{
  "id": "vvzt1o",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1657483518.0,
  "title": "What makes recovery worth it for you?",
  "selftext": "I’m posting so I can come back and remind myself whenever I want to relapse. \n\nHere are some things that make recovery worth it to me;\n\nHealthy hair\n\nBeing able to sit on hard surfaces without pain\n\nNot being ravenous all the time\n\nMore stable mood\n\nFull cheeks\n\nSoft hydrated skin\n\nConsistent bathroom habits\n\nStronger eyesight \n\nEnjoying FOOD!\n\n.\n\n\n.\n\n\n.\n\n\n\n\n\n\n\n\n\nEdit: ❤️❤️❤️ You guys the response to this post has been wonderfully overwhelming! I’m so grateful to all of you for further inspiring me to recover! I wish each and every one of you the very best wherever you are in your journey!!! ❤️❤️❤️",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/vvzt1o/what_makes_recovery_worth_it_for_you/",
  "score": 137,
  "num_comments": 96,
  "comments": [
    {
      "id": "ifn6rli",
      "author": "not-a-tthrowaway",
      "body": "I am not in recovery but one reason I want to is that weekends are so LONG. Unstructured time that for everyone else is fun time off work to enjoy for me is torture, counting down between meals, distractions. I just want to be at work again so I can fill my day with doing other things rather than think about food.\nIf I was recovering I would be able to do what other people do and live a life not completely centered around food. Hold on for that!",
      "created_utc": 1657488215.0,
      "score": 62,
      "context": []
    },
    {
      "id": "ifn844u",
      "author": "subterraneanworld",
      "body": "being healthy enough to get gender confirmation surgery one day. finally looking like an adult man and not an eternal awkward teen, too. being strong like my favourite wrestlers lol...\n\ngoing to chicago next year to finally meet some of my best online friends. not spending fucking 90% of the winter in bed because i'm too cold and sore to do anything. having an actual social life. knowing that people in my life love me for *me*, the real me who is still here under all this, no ridiculous fucking thoughts about my weight being the only special or important thing about me. eating fresh ripe fruit in the summer. going back to university and getting a degree and all the books i want to read and games i want to play and writing i want to do when my brain has room to breathe.\n\nknowing that my disorder was born from sexual abuse and not wanting the people who hurt me to have any power left over me anymore. wanting my body and my life to be finally, completely mine, and worth it just as they are.\n\ni even thought of more! having the energy to finally learn to swim and ride a bike... going on nature walks just for the beauty and the peace. having chips on the beach. maybe being in a relationship again one day. getting more tattoos. real good uninterrupted sleep. the hope i can still undo the damage to my bones or at least not do any more. no more sunk cost fallacy about how much of my life i've lost to this so why bother at this point at all. i think i really believe now that as long as you're living it's never too late for it to not still be worth *something* to stop.",
      "created_utc": 1657488802.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ifmwnp0",
      "author": "keepyourcrystals",
      "body": "finally growing / getting my period / developing properly, being able to focus on things & achieving my dream of becoming an astrophysicist, meeting with my girlfriend one day, having strength & energy, not being cold all the time, getting my bold & optimistic personality back \n\nand the list goes on and on and on!! i’m fighting & fully committing to recovery and am *going* to achieve my goals <3",
      "created_utc": 1657483905.0,
      "score": 46,
      "context": []
    },
    {
      "id": "ifn1f8d",
      "author": "kylemikahel",
      "body": "My first reason for recovery was my HAIR. I really love it and seeing it falling was really painful. So it was the start for my recovery. Now what makes recovery worth for me is the possibility of run a marathon and be able to have good moments with my partner.",
      "created_utc": 1657485940.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ifnqm2x",
      "author": "applesandpebbles",
      "body": "number 1 for me is having the brain space to think about something other than food - even in quasi when i was genuinely “happy” i was never “free”\n\nedit: woah i DID NOT know that hashtag made everything bold lmao 💀",
      "created_utc": 1657497229.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ifnaeln",
      "author": "Myluckyvalentine",
      "body": "Having energy to live life!! Finally able to focus on relationships, university, hobbies, having the energy to take part in my own life and be spontaneous! You miss out on so much when you’re preoccupied with food & weight constantly. No longer feeling empty all the time!",
      "created_utc": 1657489804.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ifnavai",
      "author": "literarywitch32",
      "body": " So many things!\n\nThicker hair, not being freezing all the time, being able to walk/hike with my boyfriend and dog, enjoying trying new foods, having the energy to live my life, not constantly being nauseous or dizzy or tired, not having my whole life revolve around food, being able to laugh and joke and have conversations. The list goes on. \n\nOnce I got through the early stages of recovery, I realized that when I was deep in my ED, I wasn’t really living, I was surviving and I didn’t want to go through life just surviving it. I wanted to enjoy it.",
      "created_utc": 1657490004.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ifn8e60",
      "author": "Spectrachic311311",
      "body": "I want my hair and nails back. I am sick of being freezing all the time. I’m sick of having my day revolve around food and what I can or can’t eat. I just want my life back.",
      "created_utc": 1657488924.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ifn9s97",
      "author": "IcyValue2",
      "body": "i love singing, can't do that if you fuck up your throat purging. wanna keep my teeth as long as i can, i used to hate my smile but i love it now. wanna keep my kidneys working as long as possible too lol.  i genuinely love dancing (or just jumping around to music really) and weightlifting, and i want my heart to be strong enough to handle it. it would metaphorically break my heart if i ruined that for myself, the singing too. i feel like my ED was a way to punish and hurt myself, and i don't think i deserved it. i want to enjoy the outdoors, i want to have energy and not be in pain so i can do the things i find meaningful, i want to fill my life with beauty and experiences, and i want to live as long as i can.",
      "created_utc": 1657489530.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ifnpla8",
      "author": "Parabuthus",
      "body": "Energy and muscles. Strength. Endurance. TRUE energy and not just that wired adrenaline and cortisol flight response I used to get high on while running on E. \n\n The peace of mind that comes with knowing my heart is safe and not degrading. \n\n Cognitive function. I struggle with ADHD and wow was my brain starving. My symptoms were so exacerbated and unmanageable during active ED. I was a prisoner in my foggy brain.\n\n\nHaving a fast enough metabolism to not even have to worry or fixate about extra treats or a larger meal. I went through a period of weight gain repairing my slowed metabolism in early recovery and IT WAS WORTH IT. I gained energy and laughter and  soon enough to ability to build muscle. It was so mentally hard at first and eventually became easier to accept and finally embrace. \n\n I'm finally at the point of recovery where I don't compulsively carry out a lot of my disordered habits anymore. It doesn't run my life. I run my life now. I struggle sometimes and the ED thoughts will probably always remain, but they're quiet now and it doesn't drain me.",
      "created_utc": 1657496742.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ifnn8q1",
      "author": "VirtualPeanut5791",
      "body": "Honestly, as much as they annoy and irk me with food, my family.\n\n&#x200B;\n\nI remember when I was at my lowest, I got into an argument with my grandmother. I said something along the lines of \"You didn't say shit when I was \\*insert big number here\\* so why is my weight all of a sudden a problem to you?\"  \n\n\nHer response? \"Because you're the love of my life and I couldn't imagine living the rest of my life without you.\"  \n\n\nShe wasn't wrong. I was dying, and her and I both knew that. Whenever I start slipping (which happens often) I remind myself of her. I couldn't imagine the amount of pain it would cause if she lost me because of my ED.",
      "created_utc": 1657495622.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ifn5oxa",
      "author": "saladflambe",
      "body": "my kids",
      "created_utc": 1657487760.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ifni4nx",
      "author": "keepyourcrystals",
      "body": "reading these comments is actually so motivational, i hope every one of you successfully & fully recovers and that ya’ll will achieve your goals 🤍",
      "created_utc": 1657493223.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ifnsj11",
      "author": "Luckypenny4683",
      "body": "You can’t have an ed and a healthy relationship at the same time. My husband is more important than my ed.",
      "created_utc": 1657498149.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ifnxbrk",
      "author": "Margkam",
      "body": "Relationships. Hands down. Having people around me that love me and that I can feel love for. That’s a cool thing and not something I was able to care about when really sick.",
      "created_utc": 1657500466.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ifnjqhx",
      "author": "kayethx",
      "body": "Being able to stand up and dance at a concert without feeling sick\n\nBeing able to keep up with my friends when we go out, even for something simple like walking\n\nCleavage (shallow as fuck, but it made me so sad to lose it and I'm so happy to be getting \"my\" body back)\n\nHaving enough mental focus to write poetry, do my hobbies, and actually feel present when I'm doing something I like\n\nSeeing how happy it makes some people who really care about me see me healthier\n\nHaving enough energy to sing and dance again, period (I hadn't realized how much weaker it had made my voice)\n\nGetting my period back and feeling like I'm at least giving myself the chance to have a kid\n\nBeing able to wear makeup again because my skin is finally healthy enough to handle it\n\nKnowing that, as awful as some people have been to my body (assaults, abuse, insults, etc.), I'm now giving it what it needs and taking care of it. Feels good to at least sort of break the cycle of abuse on myself.   \n\n\nThanks for starting this! <3",
      "created_utc": 1657493964.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ifn97hn",
      "author": "Duckii9487",
      "body": "Better focus and higher energy level!",
      "created_utc": 1657489279.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ifnm6f4",
      "author": "None",
      "body": "Eating without restriction \n\nBeing able to relax\n\nNot being miserable\n\nNot feeling like an addict sneaking around to the gym all the time\n\nAlso having an ass\n\nHaving liquid calories\n\nHaving solid healthy poops",
      "created_utc": 1657495117.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ifnr4l3",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1657497480.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ifnt9sq",
      "author": "flowerscatsandqs",
      "body": "My relationship with my family and friends. Now that I’m solidly in recovery I have so much more mental space for my friends, family, and hobbies. I’m in a decent mood and can be mentally and emotionally present when I’m with others in a way I just couldn’t when I was restricting. This also translates into being able to enjoy my hobbies, both physical (hiking/biking/swimming/weight lifting) and mental (art/sewing/reading). Everything is just sharper in my mind. \n\nAlso just the improvement in my relationship with food. I’m totally a foodie and I LOVE to cook but it’s hard to truly enjoy any of that when you’re an orthorexic anorexic mess. Being able to cook intuitively again and not constantly worry about measurements and weighing out each individual ingredient has been totally freeing. Plus the bonus of being able to go out and try a variety of new foods without melting down over it or needing to scour the menu for hours to determine what my “safest” option is.",
      "created_utc": 1657498508.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ifnujuh",
      "author": "MissyChevious613",
      "body": "Being able to visit my friends in Japan and actually enjoying the trip instead of being fixated on food and calories and exercise",
      "created_utc": 1657499119.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ifo6c39",
      "author": "leaveusinruins",
      "body": "not being a shell of a person\n\nfeeling actual emotion\n\nenjoying food with people i love \n\nnot getting dizzy when i stand up\n\ni can do my job well \n\nhiking without getting exhausted \n\ngood poops",
      "created_utc": 1657504852.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ifofk05",
      "author": "apatheticBird",
      "body": "being there for my fiance\n\nbeing able to sit and not feel like i'm sitting on pitchforks\n\nbeing there for my friends \n\ncreating art, just having the energy to create anything in general (in any form, but my biggest hobby is filmmaking)\n\nand finally just enjoying nature and the world, my big dream is to eventually explore as many countries as i can.",
      "created_utc": 1657509442.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ifobht6",
      "author": "avocantdough",
      "body": "I want to be a nurse so badly. I want to help someone like they helped me.",
      "created_utc": 1657507389.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ifol735",
      "author": "None",
      "body": "Not passing ED behavior to my children",
      "created_utc": 1657512525.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ifqun5d",
      "author": "lightsugar",
      "body": "the first time having a great meal and not feeling a hint of guilt afterwards, which for me happened to be today :) also, my skin has been so glowy and pretty lately whereas before it was almost grayish and super dry",
      "created_utc": 1657559839.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ifoo7i1",
      "author": "Dangerous-Vehicle611",
      "body": "My skin is clearing up, I feel healthier and full of energy, I love drinking water, I feel more satisfied every time I eat. Clothes fit me better. My confidence has severely increased ! God is good",
      "created_utc": 1657514303.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ifoq5jj",
      "author": "SmolBeanAmina",
      "body": "I am so much more energized when I eat, my social life is better, food is delicious, I am not miserable and I feel less anxiety around food!",
      "created_utc": 1657515508.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ifp4hih",
      "author": "throwawayferret88",
      "body": "Having the strength and energy to be able to do my job without passing out, and go out and enjoy life instead of being too tired to even get up and get water",
      "created_utc": 1657526021.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ifrmi2f",
      "author": "alenamalina",
      "body": "Not doing useless busy work to keep myself distracted from eating is nice. I love free time and relaxing and doing nothing lol",
      "created_utc": 1657570765.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ifp16pd",
      "author": "Sndhelp2me",
      "body": "I’m not in recovery yet but I definitely want to stop having headaches and I want to be able to do things with all of my energy, like having the mental capacity. I feel like shit everyday recently",
      "created_utc": 1657523344.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ifprmmt",
      "author": "Ashamed-Minute-2721",
      "body": "Energy. Being able to do anything other than think about food.",
      "created_utc": 1657543191.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ifpsn1b",
      "author": "buglady-",
      "body": "having problems and stressors and having them not affect eating at all. i didn’t think abt that one because i hadn’t realized how much stress was in fact affecting my eating. but the knowledge that you’ve regained so much self worth that no stress or problem could push you to disrespect or harm your own body and mind.",
      "created_utc": 1657543733.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ifpsqkx",
      "author": "KurapikaKurtaAkaku",
      "body": "That no one regrets recovery, they only regret having an ed, hair growth, more energy, being able to enjoy food",
      "created_utc": 1657543784.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ifq9sqx",
      "author": "ispitbarsbro",
      "body": "Being able to once again fall in love with the things I cared about before- passions, people, hobbies. Being able to walk places without feeling like I’m constantly on the verge of fainting. Being able to talk and laugh and have valuable conversations with my loved ones! My thoughts still fuck me up big time but holding onto these positives keep me believing in recovery.",
      "created_utc": 1657551570.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ifqczzs",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1657552888.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ifqj8jq",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1657555400.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ifsu3cf",
      "author": "crycry_chemtrails",
      "body": "I can’t miss out on my sister’s kids",
      "created_utc": 1657589045.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ifvaz5v",
      "author": "amyleo123",
      "body": "Oh, so so many things! The fact that I can enjoy food now, focus on things such as my uni work and enjoy my education instead of using it as a way to pass time before I’m “allowed” my next meal, mental space, being more social again and being able to genuinely laugh instead of feeling like I’m stuck in a glass cage, my ass fitting pants now so they aren’t loose like a diaper anymore, not freezing all the time, and the thing that I’m still working on but most excited for is being spontaneous again and just letting life happen",
      "created_utc": 1657640552.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ifn9wgo",
      "author": "subterraneanworld",
      "body": "fucking hell, i know, right? you put this perfectly. every single day just feels so miserably long when all you can think about is food and when you can finally have it. a day with no obligations or distractions is somehow my worst nightmare now. i can't wait to get out of this void and want to actually DO things.\n\nyou hold on, too. i know we're all going to get there.",
      "created_utc": 1657489582.0,
      "score": 25,
      "context": [
        {
          "id": "ifn6rli",
          "author": "not-a-tthrowaway",
          "body": "I am not in recovery but one reason I want to is that weekends are so LONG. Unstructured time that for everyone else is fun time off work to enjoy for me is torture, counting down between meals, distractions. I just want to be at work again so I can fill my day with doing other things rather than think about food.\nIf I was recovering I would be able to do what other people do and live a life not completely centered around food. Hold on for that!",
          "created_utc": 1657488215.0
        }
      ]
    },
    {
      "id": "ifnzfhf",
      "author": "selkieflying",
      "body": "Ooh I can relate so much to this. I hate not having stuff to do between meals because I’m so fucking food obsessed it’s like I’m living meal to meal. Part of recovery for me has been trying to find meaning and distraction and things to do outside of food and it’s fucking hard. I’m making progress tho! I had three days off this week and I think I filled them pretty well.",
      "created_utc": 1657501490.0,
      "score": 12,
      "context": [
        {
          "id": "ifn6rli",
          "author": "not-a-tthrowaway",
          "body": "I am not in recovery but one reason I want to is that weekends are so LONG. Unstructured time that for everyone else is fun time off work to enjoy for me is torture, counting down between meals, distractions. I just want to be at work again so I can fill my day with doing other things rather than think about food.\nIf I was recovering I would be able to do what other people do and live a life not completely centered around food. Hold on for that!",
          "created_utc": 1657488215.0
        }
      ]
    },
    {
      "id": "ifn7eu9",
      "author": "None",
      "body": "Keep hoping, and trying, don’t give up on yourself! Hugs ❤️",
      "created_utc": 1657488497.0,
      "score": 5,
      "context": [
        {
          "id": "ifn6rli",
          "author": "not-a-tthrowaway",
          "body": "I am not in recovery but one reason I want to is that weekends are so LONG. Unstructured time that for everyone else is fun time off work to enjoy for me is torture, counting down between meals, distractions. I just want to be at work again so I can fill my day with doing other things rather than think about food.\nIf I was recovering I would be able to do what other people do and live a life not completely centered around food. Hold on for that!",
          "created_utc": 1657488215.0
        }
      ]
    },
    {
      "id": "ifoun89",
      "author": "None",
      "body": "I can relate to this so much :(",
      "created_utc": 1657518492.0,
      "score": 2,
      "context": [
        {
          "id": "ifn6rli",
          "author": "not-a-tthrowaway",
          "body": "I am not in recovery but one reason I want to is that weekends are so LONG. Unstructured time that for everyone else is fun time off work to enjoy for me is torture, counting down between meals, distractions. I just want to be at work again so I can fill my day with doing other things rather than think about food.\nIf I was recovering I would be able to do what other people do and live a life not completely centered around food. Hold on for that!",
          "created_utc": 1657488215.0
        }
      ]
    },
    {
      "id": "ifqy8ml",
      "author": "hoe00",
      "body": "yep for me it’s like ill have plans and things which are meant to be enjoyable like going away on holiday and doing things out and about but then all i can focus on is the food im gonna eat and barely have brain space to think about the actual event. every day is just a waiting game to eat",
      "created_utc": 1657561228.0,
      "score": 1,
      "context": [
        {
          "id": "ifn6rli",
          "author": "not-a-tthrowaway",
          "body": "I am not in recovery but one reason I want to is that weekends are so LONG. Unstructured time that for everyone else is fun time off work to enjoy for me is torture, counting down between meals, distractions. I just want to be at work again so I can fill my day with doing other things rather than think about food.\nIf I was recovering I would be able to do what other people do and live a life not completely centered around food. Hold on for that!",
          "created_utc": 1657488215.0
        }
      ]
    },
    {
      "id": "ifn8ihq",
      "author": "None",
      "body": "Take back what’s yours and show em’ your strength❤️",
      "created_utc": 1657488977.0,
      "score": 8,
      "context": [
        {
          "id": "ifn844u",
          "author": "subterraneanworld",
          "body": "being healthy enough to get gender confirmation surgery one day. finally looking like an adult man and not an eternal awkward teen, too. being strong like my favourite wrestlers lol...\n\ngoing to chicago next year to finally meet some of my best online friends. not spending fucking 90% of the winter in bed because i'm too cold and sore to do anything. having an actual social life. knowing that people in my life love me for *me*, the real me who is still here under all this, no ridiculous fucking thoughts about my weight being the only special or important thing about me. eating fresh ripe fruit in the summer. going back to university and getting a degree and all the books i want to read and games i want to play and writing i want to do when my brain has room to breathe.\n\nknowing that my disorder was born from sexual abuse and not wanting the people who hurt me to have any power left over me anymore. wanting my body and my life to be finally, completely mine, and worth it just as they are.\n\ni even thought of more! having the energy to finally learn to swim and ride a bike... going on nature walks just for the beauty and the peace. having chips on the beach. maybe being in a relationship again one day. getting more tattoos. real good uninterrupted sleep. the hope i can still undo the damage to my bones or at least not do any more. no more sunk cost fallacy about how much of my life i've lost to this so why bother at this point at all. i think i really believe now that as long as you're living it's never too late for it to not still be worth *something* to stop.",
          "created_utc": 1657488802.0
        }
      ]
    },
    {
      "id": "ifn3f97",
      "author": "None",
      "body": "Keep fighting- you will get there, I believe in you!!!",
      "created_utc": 1657486788.0,
      "score": 12,
      "context": [
        {
          "id": "ifmwnp0",
          "author": "keepyourcrystals",
          "body": "finally growing / getting my period / developing properly, being able to focus on things & achieving my dream of becoming an astrophysicist, meeting with my girlfriend one day, having strength & energy, not being cold all the time, getting my bold & optimistic personality back \n\nand the list goes on and on and on!! i’m fighting & fully committing to recovery and am *going* to achieve my goals <3",
          "created_utc": 1657483905.0
        }
      ]
    },
    {
      "id": "ifngydx",
      "author": "busted3000",
      "body": "I just wanna say it’s so cool you wanna be an astrophysicist, I’m in a slightly different branch of physics myself, but any physics is awesome!",
      "created_utc": 1657492695.0,
      "score": 8,
      "context": [
        {
          "id": "ifmwnp0",
          "author": "keepyourcrystals",
          "body": "finally growing / getting my period / developing properly, being able to focus on things & achieving my dream of becoming an astrophysicist, meeting with my girlfriend one day, having strength & energy, not being cold all the time, getting my bold & optimistic personality back \n\nand the list goes on and on and on!! i’m fighting & fully committing to recovery and am *going* to achieve my goals <3",
          "created_utc": 1657483905.0
        }
      ]
    },
    {
      "id": "ifn3q4c",
      "author": "None",
      "body": "Wishing you thick long hairs:) Good luck on your marathon, and here’s to making happy memories:)",
      "created_utc": 1657486914.0,
      "score": 9,
      "context": [
        {
          "id": "ifn1f8d",
          "author": "kylemikahel",
          "body": "My first reason for recovery was my HAIR. I really love it and seeing it falling was really painful. So it was the start for my recovery. Now what makes recovery worth for me is the possibility of run a marathon and be able to have good moments with my partner.",
          "created_utc": 1657485940.0
        }
      ]
    },
    {
      "id": "ifnqsxm",
      "author": "None",
      "body": "It really does take over. Head empty, only food. I hope you break free!",
      "created_utc": 1657497323.0,
      "score": 5,
      "context": [
        {
          "id": "ifnqm2x",
          "author": "applesandpebbles",
          "body": "number 1 for me is having the brain space to think about something other than food - even in quasi when i was genuinely “happy” i was never “free”\n\nedit: woah i DID NOT know that hashtag made everything bold lmao 💀",
          "created_utc": 1657497229.0
        }
      ]
    },
    {
      "id": "ifnatif",
      "author": "None",
      "body": "SO much missed out on, fr:/ I wanna get that spontaneity and energy back!!!",
      "created_utc": 1657489982.0,
      "score": 4,
      "context": [
        {
          "id": "ifnaeln",
          "author": "Myluckyvalentine",
          "body": "Having energy to live life!! Finally able to focus on relationships, university, hobbies, having the energy to take part in my own life and be spontaneous! You miss out on so much when you’re preoccupied with food & weight constantly. No longer feeling empty all the time!",
          "created_utc": 1657489804.0
        }
      ]
    },
    {
      "id": "ifnaylh",
      "author": "None",
      "body": "Thrive- not survive!:)",
      "created_utc": 1657490044.0,
      "score": 11,
      "context": [
        {
          "id": "ifnavai",
          "author": "literarywitch32",
          "body": " So many things!\n\nThicker hair, not being freezing all the time, being able to walk/hike with my boyfriend and dog, enjoying trying new foods, having the energy to live my life, not constantly being nauseous or dizzy or tired, not having my whole life revolve around food, being able to laugh and joke and have conversations. The list goes on. \n\nOnce I got through the early stages of recovery, I realized that when I was deep in my ED, I wasn’t really living, I was surviving and I didn’t want to go through life just surviving it. I wanted to enjoy it.",
          "created_utc": 1657490004.0
        }
      ]
    },
    {
      "id": "ifn8ln8",
      "author": "None",
      "body": "Felt. Here’s to living life!",
      "created_utc": 1657489015.0,
      "score": 3,
      "context": [
        {
          "id": "ifn8e60",
          "author": "Spectrachic311311",
          "body": "I want my hair and nails back. I am sick of being freezing all the time. I’m sick of having my day revolve around food and what I can or can’t eat. I just want my life back.",
          "created_utc": 1657488924.0
        }
      ]
    },
    {
      "id": "ifna0k9",
      "author": "None",
      "body": "Here’s to singing and dancing and loving life, keep going beautiful!",
      "created_utc": 1657489634.0,
      "score": 4,
      "context": [
        {
          "id": "ifn9s97",
          "author": "IcyValue2",
          "body": "i love singing, can't do that if you fuck up your throat purging. wanna keep my teeth as long as i can, i used to hate my smile but i love it now. wanna keep my kidneys working as long as possible too lol.  i genuinely love dancing (or just jumping around to music really) and weightlifting, and i want my heart to be strong enough to handle it. it would metaphorically break my heart if i ruined that for myself, the singing too. i feel like my ED was a way to punish and hurt myself, and i don't think i deserved it. i want to enjoy the outdoors, i want to have energy and not be in pain so i can do the things i find meaningful, i want to fill my life with beauty and experiences, and i want to live as long as i can.",
          "created_utc": 1657489530.0
        }
      ]
    },
    {
      "id": "ifnq4ni",
      "author": "None",
      "body": "Thankyou for the inspiration:) Keep going!",
      "created_utc": 1657497000.0,
      "score": 1,
      "context": [
        {
          "id": "ifnpla8",
          "author": "Parabuthus",
          "body": "Energy and muscles. Strength. Endurance. TRUE energy and not just that wired adrenaline and cortisol flight response I used to get high on while running on E. \n\n The peace of mind that comes with knowing my heart is safe and not degrading. \n\n Cognitive function. I struggle with ADHD and wow was my brain starving. My symptoms were so exacerbated and unmanageable during active ED. I was a prisoner in my foggy brain.\n\n\nHaving a fast enough metabolism to not even have to worry or fixate about extra treats or a larger meal. I went through a period of weight gain repairing my slowed metabolism in early recovery and IT WAS WORTH IT. I gained energy and laughter and  soon enough to ability to build muscle. It was so mentally hard at first and eventually became easier to accept and finally embrace. \n\n I'm finally at the point of recovery where I don't compulsively carry out a lot of my disordered habits anymore. It doesn't run my life. I run my life now. I struggle sometimes and the ED thoughts will probably always remain, but they're quiet now and it doesn't drain me.",
          "created_utc": 1657496742.0
        }
      ]
    },
    {
      "id": "ifnq0fs",
      "author": "None",
      "body": "Awwww. ❤️",
      "created_utc": 1657496944.0,
      "score": 2,
      "context": [
        {
          "id": "ifnn8q1",
          "author": "VirtualPeanut5791",
          "body": "Honestly, as much as they annoy and irk me with food, my family.\n\n&#x200B;\n\nI remember when I was at my lowest, I got into an argument with my grandmother. I said something along the lines of \"You didn't say shit when I was \\*insert big number here\\* so why is my weight all of a sudden a problem to you?\"  \n\n\nHer response? \"Because you're the love of my life and I couldn't imagine living the rest of my life without you.\"  \n\n\nShe wasn't wrong. I was dying, and her and I both knew that. Whenever I start slipping (which happens often) I remind myself of her. I couldn't imagine the amount of pain it would cause if she lost me because of my ED.",
          "created_utc": 1657495622.0
        }
      ]
    },
    {
      "id": "ifn64iv",
      "author": "None",
      "body": "Awww. Good for you:)",
      "created_utc": 1657487942.0,
      "score": 3,
      "context": [
        {
          "id": "ifn5oxa",
          "author": "saladflambe",
          "body": "my kids",
          "created_utc": 1657487760.0
        }
      ]
    },
    {
      "id": "ifnu5ll",
      "author": "None",
      "body": "For sure, our loved ones deserve the best version of ourselves.",
      "created_utc": 1657498930.0,
      "score": 2,
      "context": [
        {
          "id": "ifnsj11",
          "author": "Luckypenny4683",
          "body": "You can’t have an ed and a healthy relationship at the same time. My husband is more important than my ed.",
          "created_utc": 1657498149.0
        }
      ]
    },
    {
      "id": "ifnxhyh",
      "author": "None",
      "body": "So true, sometimes this disease can make us very selfish. Our loved ones deserve better.",
      "created_utc": 1657500549.0,
      "score": 2,
      "context": [
        {
          "id": "ifnxbrk",
          "author": "Margkam",
          "body": "Relationships. Hands down. Having people around me that love me and that I can feel love for. That’s a cool thing and not something I was able to care about when really sick.",
          "created_utc": 1657500466.0
        }
      ]
    },
    {
      "id": "ifnjuaq",
      "author": "None",
      "body": "So many wonderful reasons! Keep em’ coming!!!",
      "created_utc": 1657494013.0,
      "score": 2,
      "context": [
        {
          "id": "ifnjqhx",
          "author": "kayethx",
          "body": "Being able to stand up and dance at a concert without feeling sick\n\nBeing able to keep up with my friends when we go out, even for something simple like walking\n\nCleavage (shallow as fuck, but it made me so sad to lose it and I'm so happy to be getting \"my\" body back)\n\nHaving enough mental focus to write poetry, do my hobbies, and actually feel present when I'm doing something I like\n\nSeeing how happy it makes some people who really care about me see me healthier\n\nHaving enough energy to sing and dance again, period (I hadn't realized how much weaker it had made my voice)\n\nGetting my period back and feeling like I'm at least giving myself the chance to have a kid\n\nBeing able to wear makeup again because my skin is finally healthy enough to handle it\n\nKnowing that, as awful as some people have been to my body (assaults, abuse, insults, etc.), I'm now giving it what it needs and taking care of it. Feels good to at least sort of break the cycle of abuse on myself.   \n\n\nThanks for starting this! <3",
          "created_utc": 1657493964.0
        }
      ]
    },
    {
      "id": "ifn9blc",
      "author": "None",
      "body": "The focus thing especially, yes!",
      "created_utc": 1657489329.0,
      "score": 2,
      "context": [
        {
          "id": "ifn97hn",
          "author": "Duckii9487",
          "body": "Better focus and higher energy level!",
          "created_utc": 1657489279.0
        }
      ]
    },
    {
      "id": "ifnpvwt",
      "author": "None",
      "body": "Yes!!!",
      "created_utc": 1657496883.0,
      "score": 2,
      "context": [
        {
          "id": "ifnm6f4",
          "author": "None",
          "body": "Eating without restriction \n\nBeing able to relax\n\nNot being miserable\n\nNot feeling like an addict sneaking around to the gym all the time\n\nAlso having an ass\n\nHaving liquid calories\n\nHaving solid healthy poops",
          "created_utc": 1657495117.0
        }
      ]
    },
    {
      "id": "ifnu2c4",
      "author": "None",
      "body": "❤️",
      "created_utc": 1657498887.0,
      "score": 1,
      "context": [
        {
          "id": "ifnr4l3",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1657497480.0
        }
      ]
    },
    {
      "id": "ifnu92y",
      "author": "None",
      "body": "To better relationships with friends, family and food:)",
      "created_utc": 1657498975.0,
      "score": 2,
      "context": [
        {
          "id": "ifnt9sq",
          "author": "flowerscatsandqs",
          "body": "My relationship with my family and friends. Now that I’m solidly in recovery I have so much more mental space for my friends, family, and hobbies. I’m in a decent mood and can be mentally and emotionally present when I’m with others in a way I just couldn’t when I was restricting. This also translates into being able to enjoy my hobbies, both physical (hiking/biking/swimming/weight lifting) and mental (art/sewing/reading). Everything is just sharper in my mind. \n\nAlso just the improvement in my relationship with food. I’m totally a foodie and I LOVE to cook but it’s hard to truly enjoy any of that when you’re an orthorexic anorexic mess. Being able to cook intuitively again and not constantly worry about measurements and weighing out each individual ingredient has been totally freeing. Plus the bonus of being able to go out and try a variety of new foods without melting down over it or needing to scour the menu for hours to determine what my “safest” option is.",
          "created_utc": 1657498508.0
        }
      ]
    },
    {
      "id": "ifnur1g",
      "author": "None",
      "body": "I hope you get to take that trip 🌸",
      "created_utc": 1657499216.0,
      "score": 2,
      "context": [
        {
          "id": "ifnujuh",
          "author": "MissyChevious613",
          "body": "Being able to visit my friends in Japan and actually enjoying the trip instead of being fixated on food and calories and exercise",
          "created_utc": 1657499119.0
        }
      ]
    },
    {
      "id": "ifo7k9t",
      "author": "None",
      "body": "❤️",
      "created_utc": 1657505449.0,
      "score": 1,
      "context": [
        {
          "id": "ifo6c39",
          "author": "leaveusinruins",
          "body": "not being a shell of a person\n\nfeeling actual emotion\n\nenjoying food with people i love \n\nnot getting dizzy when i stand up\n\ni can do my job well \n\nhiking without getting exhausted \n\ngood poops",
          "created_utc": 1657504852.0
        }
      ]
    },
    {
      "id": "ifofu9u",
      "author": "None",
      "body": "These are all amazing reasons, I hope you get travel especially:)",
      "created_utc": 1657509591.0,
      "score": 1,
      "context": [
        {
          "id": "ifofk05",
          "author": "apatheticBird",
          "body": "being there for my fiance\n\nbeing able to sit and not feel like i'm sitting on pitchforks\n\nbeing there for my friends \n\ncreating art, just having the energy to create anything in general (in any form, but my biggest hobby is filmmaking)\n\nand finally just enjoying nature and the world, my big dream is to eventually explore as many countries as i can.",
          "created_utc": 1657509442.0
        }
      ]
    },
    {
      "id": "ifobmta",
      "author": "None",
      "body": "Awwww:) You can do it!",
      "created_utc": 1657507457.0,
      "score": 1,
      "context": [
        {
          "id": "ifobht6",
          "author": "avocantdough",
          "body": "I want to be a nurse so badly. I want to help someone like they helped me.",
          "created_utc": 1657507389.0
        }
      ]
    },
    {
      "id": "ifolcu1",
      "author": "None",
      "body": "That’s so very important. They have a great parent:)",
      "created_utc": 1657512616.0,
      "score": 1,
      "context": [
        {
          "id": "ifol735",
          "author": "None",
          "body": "Not passing ED behavior to my children",
          "created_utc": 1657512525.0
        }
      ]
    },
    {
      "id": "ifqxxgl",
      "author": "None",
      "body": "That’s awesome!!! And yay for glowy skin!!!",
      "created_utc": 1657561108.0,
      "score": 2,
      "context": [
        {
          "id": "ifqun5d",
          "author": "lightsugar",
          "body": "the first time having a great meal and not feeling a hint of guilt afterwards, which for me happened to be today :) also, my skin has been so glowy and pretty lately whereas before it was almost grayish and super dry",
          "created_utc": 1657559839.0
        }
      ]
    },
    {
      "id": "ifpnoj5",
      "author": "None",
      "body": "These are wonderful changes! And yes he is!",
      "created_utc": 1657540944.0,
      "score": 1,
      "context": [
        {
          "id": "ifoo7i1",
          "author": "Dangerous-Vehicle611",
          "body": "My skin is clearing up, I feel healthier and full of energy, I love drinking water, I feel more satisfied every time I eat. Clothes fit me better. My confidence has severely increased ! God is good",
          "created_utc": 1657514303.0
        }
      ]
    },
    {
      "id": "ifpnrjm",
      "author": "None",
      "body": "Sounds great!!! This is so motivating to hear! Keep it up ❤️",
      "created_utc": 1657540994.0,
      "score": 1,
      "context": [
        {
          "id": "ifoq5jj",
          "author": "SmolBeanAmina",
          "body": "I am so much more energized when I eat, my social life is better, food is delicious, I am not miserable and I feel less anxiety around food!",
          "created_utc": 1657515508.0
        }
      ]
    },
    {
      "id": "ifpnvj2",
      "author": "None",
      "body": "Don’t give up, you’ll get there ❤️",
      "created_utc": 1657541059.0,
      "score": 2,
      "context": [
        {
          "id": "ifp4hih",
          "author": "throwawayferret88",
          "body": "Having the strength and energy to be able to do my job without passing out, and go out and enjoy life instead of being too tired to even get up and get water",
          "created_utc": 1657526021.0
        }
      ]
    },
    {
      "id": "ifrmnqi",
      "author": "None",
      "body": "Definitely. It’s hard to relax when all you can think about is the next meal :(",
      "created_utc": 1657570825.0,
      "score": 1,
      "context": [
        {
          "id": "ifrmi2f",
          "author": "alenamalina",
          "body": "Not doing useless busy work to keep myself distracted from eating is nice. I love free time and relaxing and doing nothing lol",
          "created_utc": 1657570765.0
        }
      ]
    },
    {
      "id": "ifpntfj",
      "author": "None",
      "body": "I hope you can get there, don’t give up ❤️",
      "created_utc": 1657541024.0,
      "score": 1,
      "context": [
        {
          "id": "ifp16pd",
          "author": "Sndhelp2me",
          "body": "I’m not in recovery yet but I definitely want to stop having headaches and I want to be able to do things with all of my energy, like having the mental capacity. I feel like shit everyday recently",
          "created_utc": 1657523344.0
        }
      ]
    },
    {
      "id": "ifpzv3c",
      "author": "None",
      "body": "Food not being on the mind all the time, yess",
      "created_utc": 1657547282.0,
      "score": 1,
      "context": [
        {
          "id": "ifprmmt",
          "author": "Ashamed-Minute-2721",
          "body": "Energy. Being able to do anything other than think about food.",
          "created_utc": 1657543191.0
        }
      ]
    },
    {
      "id": "ifpzwe1",
      "author": "None",
      "body": "❤️❤️",
      "created_utc": 1657547299.0,
      "score": 1,
      "context": [
        {
          "id": "ifpsn1b",
          "author": "buglady-",
          "body": "having problems and stressors and having them not affect eating at all. i didn’t think abt that one because i hadn’t realized how much stress was in fact affecting my eating. but the knowledge that you’ve regained so much self worth that no stress or problem could push you to disrespect or harm your own body and mind.",
          "created_utc": 1657543733.0
        }
      ]
    },
    {
      "id": "ifpzzcu",
      "author": "None",
      "body": "There’s so many upsides",
      "created_utc": 1657547337.0,
      "score": 2,
      "context": [
        {
          "id": "ifpsqkx",
          "author": "KurapikaKurtaAkaku",
          "body": "That no one regrets recovery, they only regret having an ed, hair growth, more energy, being able to enjoy food",
          "created_utc": 1657543784.0
        }
      ]
    },
    {
      "id": "ifq9y3p",
      "author": "None",
      "body": "Keep holding on, for all the loves in your life ❤️",
      "created_utc": 1657551631.0,
      "score": 1,
      "context": [
        {
          "id": "ifq9sqx",
          "author": "ispitbarsbro",
          "body": "Being able to once again fall in love with the things I cared about before- passions, people, hobbies. Being able to walk places without feeling like I’m constantly on the verge of fainting. Being able to talk and laugh and have valuable conversations with my loved ones! My thoughts still fuck me up big time but holding onto these positives keep me believing in recovery.",
          "created_utc": 1657551570.0
        }
      ]
    },
    {
      "id": "ifqliwl",
      "author": "None",
      "body": "You can do it! ❤️",
      "created_utc": 1657556306.0,
      "score": 1,
      "context": [
        {
          "id": "ifqczzs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1657552888.0
        }
      ]
    },
    {
      "id": "ifqljw4",
      "author": "None",
      "body": "❤️",
      "created_utc": 1657556317.0,
      "score": 1,
      "context": [
        {
          "id": "ifqj8jq",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1657555400.0
        }
      ]
    },
    {
      "id": "ifsueiv",
      "author": "None",
      "body": "Awww, you won’t ❤️",
      "created_utc": 1657589185.0,
      "score": 1,
      "context": [
        {
          "id": "ifsu3cf",
          "author": "crycry_chemtrails",
          "body": "I can’t miss out on my sister’s kids",
          "created_utc": 1657589045.0
        }
      ]
    },
    {
      "id": "ifvx9pp",
      "author": "None",
      "body": "I’m so happy to hear of all these changes for you❤️",
      "created_utc": 1657649341.0,
      "score": 1,
      "context": [
        {
          "id": "ifvaz5v",
          "author": "amyleo123",
          "body": "Oh, so so many things! The fact that I can enjoy food now, focus on things such as my uni work and enjoy my education instead of using it as a way to pass time before I’m “allowed” my next meal, mental space, being more social again and being able to genuinely laugh instead of feeling like I’m stuck in a glass cage, my ass fitting pants now so they aren’t loose like a diaper anymore, not freezing all the time, and the thing that I’m still working on but most excited for is being spontaneous again and just letting life happen",
          "created_utc": 1657640552.0
        }
      ]
    },
    {
      "id": "ifr0k85",
      "author": "not-a-tthrowaway",
      "body": "Yup. I’m going on holiday soon and I’m not excited, I’m dreading it because aaaah unplanned food, unmonitored calories, weight gain??? I just want a summer holiday of relaxing and exciting memories not anxiety around food!",
      "created_utc": 1657562136.0,
      "score": 1,
      "context": [
        {
          "id": "ifn6rli",
          "author": "not-a-tthrowaway",
          "body": "I am not in recovery but one reason I want to is that weekends are so LONG. Unstructured time that for everyone else is fun time off work to enjoy for me is torture, counting down between meals, distractions. I just want to be at work again so I can fill my day with doing other things rather than think about food.\nIf I was recovering I would be able to do what other people do and live a life not completely centered around food. Hold on for that!",
          "created_utc": 1657488215.0
        },
        {
          "id": "ifqy8ml",
          "author": "hoe00",
          "body": "yep for me it’s like ill have plans and things which are meant to be enjoyable like going away on holiday and doing things out and about but then all i can focus on is the food im gonna eat and barely have brain space to think about the actual event. every day is just a waiting game to eat",
          "created_utc": 1657561228.0
        }
      ]
    },
    {
      "id": "ifn41wr",
      "author": "keepyourcrystals",
      "body": "thank you, same to you!!!",
      "created_utc": 1657487053.0,
      "score": 7,
      "context": [
        {
          "id": "ifmwnp0",
          "author": "keepyourcrystals",
          "body": "finally growing / getting my period / developing properly, being able to focus on things & achieving my dream of becoming an astrophysicist, meeting with my girlfriend one day, having strength & energy, not being cold all the time, getting my bold & optimistic personality back \n\nand the list goes on and on and on!! i’m fighting & fully committing to recovery and am *going* to achieve my goals <3",
          "created_utc": 1657483905.0
        },
        {
          "id": "ifn3f97",
          "author": "None",
          "body": "Keep fighting- you will get there, I believe in you!!!",
          "created_utc": 1657486788.0
        }
      ]
    },
    {
      "id": "ifnhuws",
      "author": "keepyourcrystals",
      "body": "thank you so much,, and i 100% agree :))",
      "created_utc": 1657493099.0,
      "score": 3,
      "context": [
        {
          "id": "ifmwnp0",
          "author": "keepyourcrystals",
          "body": "finally growing / getting my period / developing properly, being able to focus on things & achieving my dream of becoming an astrophysicist, meeting with my girlfriend one day, having strength & energy, not being cold all the time, getting my bold & optimistic personality back \n\nand the list goes on and on and on!! i’m fighting & fully committing to recovery and am *going* to achieve my goals <3",
          "created_utc": 1657483905.0
        },
        {
          "id": "ifngydx",
          "author": "busted3000",
          "body": "I just wanna say it’s so cool you wanna be an astrophysicist, I’m in a slightly different branch of physics myself, but any physics is awesome!",
          "created_utc": 1657492695.0
        }
      ]
    },
    {
      "id": "ifnv4lw",
      "author": "applesandpebbles",
      "body": "thank you so much, i’m really trying to move past seeing myself as “an anorexic” or even “a recovering anorexic” and just as a person again",
      "created_utc": 1657499399.0,
      "score": 5,
      "context": [
        {
          "id": "ifnqm2x",
          "author": "applesandpebbles",
          "body": "number 1 for me is having the brain space to think about something other than food - even in quasi when i was genuinely “happy” i was never “free”\n\nedit: woah i DID NOT know that hashtag made everything bold lmao 💀",
          "created_utc": 1657497229.0
        },
        {
          "id": "ifnqsxm",
          "author": "None",
          "body": "It really does take over. Head empty, only food. I hope you break free!",
          "created_utc": 1657497323.0
        }
      ]
    },
    {
      "id": "ifnbopf",
      "author": "Myluckyvalentine",
      "body": "I’m sure you will! Definitely worth it, even on hard days",
      "created_utc": 1657490361.0,
      "score": 3,
      "context": [
        {
          "id": "ifnaeln",
          "author": "Myluckyvalentine",
          "body": "Having energy to live life!! Finally able to focus on relationships, university, hobbies, having the energy to take part in my own life and be spontaneous! You miss out on so much when you’re preoccupied with food & weight constantly. No longer feeling empty all the time!",
          "created_utc": 1657489804.0
        },
        {
          "id": "ifnatif",
          "author": "None",
          "body": "SO much missed out on, fr:/ I wanna get that spontaneity and energy back!!!",
          "created_utc": 1657489982.0
        }
      ]
    },
    {
      "id": "ifncmjy",
      "author": "IcyValue2",
      "body": "hell yeah, you too < 33",
      "created_utc": 1657490767.0,
      "score": 3,
      "context": [
        {
          "id": "ifn9s97",
          "author": "IcyValue2",
          "body": "i love singing, can't do that if you fuck up your throat purging. wanna keep my teeth as long as i can, i used to hate my smile but i love it now. wanna keep my kidneys working as long as possible too lol.  i genuinely love dancing (or just jumping around to music really) and weightlifting, and i want my heart to be strong enough to handle it. it would metaphorically break my heart if i ruined that for myself, the singing too. i feel like my ED was a way to punish and hurt myself, and i don't think i deserved it. i want to enjoy the outdoors, i want to have energy and not be in pain so i can do the things i find meaningful, i want to fill my life with beauty and experiences, and i want to live as long as i can.",
          "created_utc": 1657489530.0
        },
        {
          "id": "ifna0k9",
          "author": "None",
          "body": "Here’s to singing and dancing and loving life, keep going beautiful!",
          "created_utc": 1657489634.0
        }
      ]
    },
    {
      "id": "ifny5br",
      "author": "Margkam",
      "body": "I never thought I could have a healthy relationship with a partner. Only once I got my head out of the ED sand did that start to happen. \n\nNot to say you can’t while you’re sick, I have just been unable to honestly connect with anyone while I was or was drawn to unhealthy situations. So that’s just a personal anecdote.",
      "created_utc": 1657500867.0,
      "score": 1,
      "context": [
        {
          "id": "ifnxbrk",
          "author": "Margkam",
          "body": "Relationships. Hands down. Having people around me that love me and that I can feel love for. That’s a cool thing and not something I was able to care about when really sick.",
          "created_utc": 1657500466.0
        },
        {
          "id": "ifnxhyh",
          "author": "None",
          "body": "So true, sometimes this disease can make us very selfish. Our loved ones deserve better.",
          "created_utc": 1657500549.0
        }
      ]
    },
    {
      "id": "ifq0den",
      "author": "KurapikaKurtaAkaku",
      "body": "There’s so many upsides to recovery vs so many downsides to being sick ^—^",
      "created_utc": 1657547513.0,
      "score": 2,
      "context": [
        {
          "id": "ifpsqkx",
          "author": "KurapikaKurtaAkaku",
          "body": "That no one regrets recovery, they only regret having an ed, hair growth, more energy, being able to enjoy food",
          "created_utc": 1657543784.0
        },
        {
          "id": "ifpzzcu",
          "author": "None",
          "body": "There’s so many upsides",
          "created_utc": 1657547337.0
        }
      ]
    },
    {
      "id": "ifs7dgf",
      "author": "hoe00",
      "body": "i feel you it’s so hard. but in 10 years time you won’t look back on your time away and think “oh im so glad i spent that holiday restricting myself so i didn’t gain weight and depriving myself nice food with others” you’d feel deeply sad for your younger self and wish you could go back in time. think of what you really want for your life",
      "created_utc": 1657579024.0,
      "score": 1,
      "context": [
        {
          "id": "ifn6rli",
          "author": "not-a-tthrowaway",
          "body": "I am not in recovery but one reason I want to is that weekends are so LONG. Unstructured time that for everyone else is fun time off work to enjoy for me is torture, counting down between meals, distractions. I just want to be at work again so I can fill my day with doing other things rather than think about food.\nIf I was recovering I would be able to do what other people do and live a life not completely centered around food. Hold on for that!",
          "created_utc": 1657488215.0
        },
        {
          "id": "ifqy8ml",
          "author": "hoe00",
          "body": "yep for me it’s like ill have plans and things which are meant to be enjoyable like going away on holiday and doing things out and about but then all i can focus on is the food im gonna eat and barely have brain space to think about the actual event. every day is just a waiting game to eat",
          "created_utc": 1657561228.0
        },
        {
          "id": "ifr0k85",
          "author": "not-a-tthrowaway",
          "body": "Yup. I’m going on holiday soon and I’m not excited, I’m dreading it because aaaah unplanned food, unmonitored calories, weight gain??? I just want a summer holiday of relaxing and exciting memories not anxiety around food!",
          "created_utc": 1657562136.0
        }
      ]
    },
    {
      "id": "ifn4519",
      "author": "None",
      "body": "❤️",
      "created_utc": 1657487089.0,
      "score": 5,
      "context": [
        {
          "id": "ifmwnp0",
          "author": "keepyourcrystals",
          "body": "finally growing / getting my period / developing properly, being able to focus on things & achieving my dream of becoming an astrophysicist, meeting with my girlfriend one day, having strength & energy, not being cold all the time, getting my bold & optimistic personality back \n\nand the list goes on and on and on!! i’m fighting & fully committing to recovery and am *going* to achieve my goals <3",
          "created_utc": 1657483905.0
        },
        {
          "id": "ifn3f97",
          "author": "None",
          "body": "Keep fighting- you will get there, I believe in you!!!",
          "created_utc": 1657486788.0
        },
        {
          "id": "ifn41wr",
          "author": "keepyourcrystals",
          "body": "thank you, same to you!!!",
          "created_utc": 1657487053.0
        }
      ]
    },
    {
      "id": "ifnv70r",
      "author": "None",
      "body": "❤️",
      "created_utc": 1657499431.0,
      "score": 3,
      "context": [
        {
          "id": "ifnqm2x",
          "author": "applesandpebbles",
          "body": "number 1 for me is having the brain space to think about something other than food - even in quasi when i was genuinely “happy” i was never “free”\n\nedit: woah i DID NOT know that hashtag made everything bold lmao 💀",
          "created_utc": 1657497229.0
        },
        {
          "id": "ifnqsxm",
          "author": "None",
          "body": "It really does take over. Head empty, only food. I hope you break free!",
          "created_utc": 1657497323.0
        },
        {
          "id": "ifnv4lw",
          "author": "applesandpebbles",
          "body": "thank you so much, i’m really trying to move past seeing myself as “an anorexic” or even “a recovering anorexic” and just as a person again",
          "created_utc": 1657499399.0
        }
      ]
    },
    {
      "id": "ifndbsx",
      "author": "None",
      "body": "❤️",
      "created_utc": 1657491079.0,
      "score": 2,
      "context": [
        {
          "id": "ifnaeln",
          "author": "Myluckyvalentine",
          "body": "Having energy to live life!! Finally able to focus on relationships, university, hobbies, having the energy to take part in my own life and be spontaneous! You miss out on so much when you’re preoccupied with food & weight constantly. No longer feeling empty all the time!",
          "created_utc": 1657489804.0
        },
        {
          "id": "ifnatif",
          "author": "None",
          "body": "SO much missed out on, fr:/ I wanna get that spontaneity and energy back!!!",
          "created_utc": 1657489982.0
        },
        {
          "id": "ifnbopf",
          "author": "Myluckyvalentine",
          "body": "I’m sure you will! Definitely worth it, even on hard days",
          "created_utc": 1657490361.0
        }
      ]
    },
    {
      "id": "ifndagk",
      "author": "None",
      "body": "❤️",
      "created_utc": 1657491063.0,
      "score": 4,
      "context": [
        {
          "id": "ifn9s97",
          "author": "IcyValue2",
          "body": "i love singing, can't do that if you fuck up your throat purging. wanna keep my teeth as long as i can, i used to hate my smile but i love it now. wanna keep my kidneys working as long as possible too lol.  i genuinely love dancing (or just jumping around to music really) and weightlifting, and i want my heart to be strong enough to handle it. it would metaphorically break my heart if i ruined that for myself, the singing too. i feel like my ED was a way to punish and hurt myself, and i don't think i deserved it. i want to enjoy the outdoors, i want to have energy and not be in pain so i can do the things i find meaningful, i want to fill my life with beauty and experiences, and i want to live as long as i can.",
          "created_utc": 1657489530.0
        },
        {
          "id": "ifna0k9",
          "author": "None",
          "body": "Here’s to singing and dancing and loving life, keep going beautiful!",
          "created_utc": 1657489634.0
        },
        {
          "id": "ifncmjy",
          "author": "IcyValue2",
          "body": "hell yeah, you too < 33",
          "created_utc": 1657490767.0
        }
      ]
    },
    {
      "id": "ifnyae0",
      "author": "None",
      "body": "I get what ur saying, the disconnect I feel from people is real. And I have to literally force myself to maintain any sort of relationship, it’s exhausting.",
      "created_utc": 1657500935.0,
      "score": 3,
      "context": [
        {
          "id": "ifnxbrk",
          "author": "Margkam",
          "body": "Relationships. Hands down. Having people around me that love me and that I can feel love for. That’s a cool thing and not something I was able to care about when really sick.",
          "created_utc": 1657500466.0
        },
        {
          "id": "ifnxhyh",
          "author": "None",
          "body": "So true, sometimes this disease can make us very selfish. Our loved ones deserve better.",
          "created_utc": 1657500549.0
        },
        {
          "id": "ifny5br",
          "author": "Margkam",
          "body": "I never thought I could have a healthy relationship with a partner. Only once I got my head out of the ED sand did that start to happen. \n\nNot to say you can’t while you’re sick, I have just been unable to honestly connect with anyone while I was or was drawn to unhealthy situations. So that’s just a personal anecdote.",
          "created_utc": 1657500867.0
        }
      ]
    },
    {
      "id": "ifnyoi3",
      "author": "Margkam",
      "body": "The eating disorder bubble world is comfortable but terrible.",
      "created_utc": 1657501127.0,
      "score": 3,
      "context": [
        {
          "id": "ifnxbrk",
          "author": "Margkam",
          "body": "Relationships. Hands down. Having people around me that love me and that I can feel love for. That’s a cool thing and not something I was able to care about when really sick.",
          "created_utc": 1657500466.0
        },
        {
          "id": "ifnxhyh",
          "author": "None",
          "body": "So true, sometimes this disease can make us very selfish. Our loved ones deserve better.",
          "created_utc": 1657500549.0
        },
        {
          "id": "ifny5br",
          "author": "Margkam",
          "body": "I never thought I could have a healthy relationship with a partner. Only once I got my head out of the ED sand did that start to happen. \n\nNot to say you can’t while you’re sick, I have just been unable to honestly connect with anyone while I was or was drawn to unhealthy situations. So that’s just a personal anecdote.",
          "created_utc": 1657500867.0
        },
        {
          "id": "ifnyae0",
          "author": "None",
          "body": "I get what ur saying, the disconnect I feel from people is real. And I have to literally force myself to maintain any sort of relationship, it’s exhausting.",
          "created_utc": 1657500935.0
        }
      ]
    },
    {
      "id": "ifnypvp",
      "author": "None",
      "body": "True that.",
      "created_utc": 1657501146.0,
      "score": 1,
      "context": [
        {
          "id": "ifnxbrk",
          "author": "Margkam",
          "body": "Relationships. Hands down. Having people around me that love me and that I can feel love for. That’s a cool thing and not something I was able to care about when really sick.",
          "created_utc": 1657500466.0
        },
        {
          "id": "ifnxhyh",
          "author": "None",
          "body": "So true, sometimes this disease can make us very selfish. Our loved ones deserve better.",
          "created_utc": 1657500549.0
        },
        {
          "id": "ifny5br",
          "author": "Margkam",
          "body": "I never thought I could have a healthy relationship with a partner. Only once I got my head out of the ED sand did that start to happen. \n\nNot to say you can’t while you’re sick, I have just been unable to honestly connect with anyone while I was or was drawn to unhealthy situations. So that’s just a personal anecdote.",
          "created_utc": 1657500867.0
        },
        {
          "id": "ifnyae0",
          "author": "None",
          "body": "I get what ur saying, the disconnect I feel from people is real. And I have to literally force myself to maintain any sort of relationship, it’s exhausting.",
          "created_utc": 1657500935.0
        },
        {
          "id": "ifnyoi3",
          "author": "Margkam",
          "body": "The eating disorder bubble world is comfortable but terrible.",
          "created_utc": 1657501127.0
        }
      ]
    }
  ]
}