{
  "id": "w905up",
  "subreddit": "fuckeatingdisorders",
  "author": "poopystinky7",
  "created_utc": 1658882394.0,
  "title": "my ED has turned me into a protein obsessed gym bro",
  "selftext": "that’s it that’s the tweet. grave realization i made while standing in a Protein Smoothie Store waiting for my smoothie. yeah idk man.\n\ni fluctuate from eating unrestricted amounts of safe foods (ie: popcorn) to going back to mfp & tracking my cals religiously. it’s taken everything in me to not sign up for a gym cuz i know that is a slippery slope, but i still workout at home. idk…pretending i dont have an ED anymor because i can’t restrict like i used to after treatment, & trading it for trying to eat as much Healthy Protein food as possible. im still just as crazy \n\n:(",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/w905up/my_ed_has_turned_me_into_a_protein_obsessed_gym/",
  "score": 93,
  "num_comments": 9,
  "comments": [
    {
      "id": "ihsjd1x",
      "author": "Parabuthus",
      "body": "I started working out after restoring some weight because it empowered me, controlled stress, and made my weak body feel amazing. \n\n...Turns out there is a huge toxic fitness world full of obsessive ED behaviors out there to navigate.",
      "created_utc": 1658883882.0,
      "score": 38,
      "context": []
    },
    {
      "id": "ihsqtys",
      "author": "ermagawd",
      "body": "I did the same, for years and years. Being the 'healthy recovered fit girl' became my identity but I started to realize I was feeling JUST as trapped as I felt when I was actively restricting, just in a different way. Whole day was planned around my exercise and eating. I had basically traded one eating disorder for another. And it was almost harder to break out of because it was constantly reaffirmed by people saying things like \"wow you're so dedicated\" \"so strong!\" \"I wish I could have your discipline\" etc. So it was a lot more difficult to be like hey this is an issue and you need to stop.\nI had to actually go to therapy to start breaking the exercise addiction/orthorexia. It was HARD but really worth it. It took a long time but I started by slowly decreasing my workouts and finding other things to do with my time. I started reintroducing foods that didn't fit into my fitness plan. It was recovery all over again but I'm glad I did it.",
      "created_utc": 1658887253.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ihsgdqf",
      "author": "Sareeee48",
      "body": "I did the same and it’s really hard to break, so I feel you. The first step is acknowledging that this isn’t healthy either. Do it that information what you will but know that we are here for you even if you aren’t ready to give it up. It’s hard having an eating disorder, so if nothing else be gentle with yourself after this realization.",
      "created_utc": 1658882556.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ihtj5xw",
      "author": "None",
      "body": "I believe in u! The key is to eat enough so u feel satisfied and satiated. I realized I was healing when I thought I’m gonna have a chocolate bar instead of a protein bar Cus i enjoy it more lol Ik you’ll be able to get there. It’s important to realize if ur eating enough through the day and have variety at ur meals ur likely getting enough protein. You’ll also hopefully get to a point where ur not so obsessed with popcorn and u just let urself eat chips lol. It’s great",
      "created_utc": 1658902821.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ihuabqn",
      "author": "froggieluv3r",
      "body": "this happened to my sister (both of us struggle from ED) . she strictly was obsessed with protein and eating very little. she was eventually hospitalized for kidney damage. please be careful on the protein and make sure you’re getting a variety of nutrients.",
      "created_utc": 1658923063.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kelg8hq",
      "author": "None",
      "body": "Yeah I can’t restrict as low as I used to but I’ve turned to the gym because it reduces my appetite and I obsess over having loads of protein while hitting maintenance/slight deficit calories as it stops me from binging/purging\n\nIt may have changed my habits to conventionally healthier ones but I’m still doing it really disorderly which I keep trying to convince myself I’m not to make myself feel better. It’s been a month and I’m OBSESSED with the gym despite being weak af still which is just a slippery slope waiting to happen..",
      "created_utc": 1703332187.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ihtfmys",
      "author": "fuckinunknowable",
      "body": "Cult of fitness suuuuucks",
      "created_utc": 1658900383.0,
      "score": 6,
      "context": [
        {
          "id": "ihsjd1x",
          "author": "Parabuthus",
          "body": "I started working out after restoring some weight because it empowered me, controlled stress, and made my weak body feel amazing. \n\n...Turns out there is a huge toxic fitness world full of obsessive ED behaviors out there to navigate.",
          "created_utc": 1658883882.0
        }
      ]
    },
    {
      "id": "ihwqx18",
      "author": "f_edsthrowaway",
      "body": "I genuinely hate how our society puts this ONE way to exercise on such a high pedestal, acting as if going to the gym regularly is some kind of special achievement that makes you superior to all those other uNdIsCiPLiNeD people who just can't \"get motivated\" (to do something that they probably just legitimately don't enjoy); this narrative makes it that much harder to break out of orthorexia because it not only prolongs how long it takes to even _identify_ that you have a problem, but it also makes you feel terribly guilty about trying to address it too.",
      "created_utc": 1658958366.0,
      "score": 2,
      "context": [
        {
          "id": "ihsqtys",
          "author": "ermagawd",
          "body": "I did the same, for years and years. Being the 'healthy recovered fit girl' became my identity but I started to realize I was feeling JUST as trapped as I felt when I was actively restricting, just in a different way. Whole day was planned around my exercise and eating. I had basically traded one eating disorder for another. And it was almost harder to break out of because it was constantly reaffirmed by people saying things like \"wow you're so dedicated\" \"so strong!\" \"I wish I could have your discipline\" etc. So it was a lot more difficult to be like hey this is an issue and you need to stop.\nI had to actually go to therapy to start breaking the exercise addiction/orthorexia. It was HARD but really worth it. It took a long time but I started by slowly decreasing my workouts and finding other things to do with my time. I started reintroducing foods that didn't fit into my fitness plan. It was recovery all over again but I'm glad I did it.",
          "created_utc": 1658887253.0
        }
      ]
    },
    {
      "id": "ihsinqi",
      "author": "poopystinky7",
      "body": "thank you so much man 💚 the anorexia to orthorexia pipeline is so real, not even mentioning that overexercise has been a hallmark in my ED anyways. i think i just didn’t realize how insidious the switch is? it feels like a hole im never gonna get out of, even though I want to so badly. if tou don’t mind me asking, how were you able to breakout of that cycle? (or if you’re still breaking out of it?) \n\nthanks for you support, it means a lot.❤️❤️",
      "created_utc": 1658883571.0,
      "score": 13,
      "context": [
        {
          "id": "ihsgdqf",
          "author": "Sareeee48",
          "body": "I did the same and it’s really hard to break, so I feel you. The first step is acknowledging that this isn’t healthy either. Do it that information what you will but know that we are here for you even if you aren’t ready to give it up. It’s hard having an eating disorder, so if nothing else be gentle with yourself after this realization.",
          "created_utc": 1658882556.0
        }
      ]
    }
  ]
}