{
  "id": "we4j2w",
  "subreddit": "fuckeatingdisorders",
  "author": "uwhwjwi8",
  "created_utc": 1659422659.0,
  "title": "Things I LIKE about recovering into a larger body",
  "selftext": "Feel free to remove this if it goes against any rules, but I thought I'd make a positive thread for once, that celebrates the improvements in quality of life that come hand in hand with weight gain.\n\nAs part of my recovery, I've ended up \"obese\" by bmi. However society sucks, and being \"obese\" actually isn't the worst thing in the history of the world ever. A lot of the time society literally behaves like being dead is preferable to not fitting its extremely narrow beauty constraints. However realising that thats bullshit, I also realised that there ARE real positive upsides to being in a larger body which aren't ever discussed about because of shaming and fatphobia in society.\n\n-Cushioning for injuries. When I was at my lowest weight, I managed to fracture one of my ribs in my sleep by knocking my elbow into it... WTF. In a larger body, I'm not terrified of accidentally bumping into things, or opening a door or closing a cabinet with my side, and I know if I trip and fall on my face due to being clumsy AF I'll only be humiliated instead of actually hurt like I could have been before.\n\n-Periods!!! I never got consistent periods at a low healthy bmi and need to be near the overweight range for them to be regular. Now I can predict when it'll hit almost to the hour every month...\n\n-A digestive system that works. \n\n-Being much stronger! I can lift all sorts of heavy things without breaking a sweat. I used to be the type of person who asked other people to open water bottles for me, now people ask ME to open water bottles for them lol\n\n-My hair is rich, glossy as thick. I have natural curls but they disappeared at my LW, now I have them again (and the energy to take care of them!)\n\n-Bigger lap for my cat to lay on lol\n\n-Never getting sick anymore. Someone could sneeze directly on me and my immune system won't break a sweat, when before I caught every cold, virus and fungal infection in a 3 mile radius.\n\nFeel free to add your own!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/we4j2w/things_i_like_about_recovering_into_a_larger_body/",
  "score": 127,
  "num_comments": 12,
  "comments": [
    {
      "id": "iim78k5",
      "author": "keepyourcrystals",
      "body": "i love this post so much! i started experiencing extreme hunger when i was already weight restored/even considered overweight by the bmi chart and am still gaining, indicating that i’ll recover into an even larger body. i’m trying to unlearn fatphobia, which for me also majorly roots in society’s “big = necessarily uNhEaLtHy” mentality. thanks for sharing this 🤍",
      "created_utc": 1659426005.0,
      "score": 29,
      "context": []
    },
    {
      "id": "iinb5fk",
      "author": "MarsupialPristine677",
      "body": "I’m really happy for you 💕 personally I love looking like a lady from a medieval painting",
      "created_utc": 1659450649.0,
      "score": 15,
      "context": []
    },
    {
      "id": "iiobxgz",
      "author": "Abrookspug",
      "body": "I love this. I'm also overweight since recovering and then having kids and agree with all these points. I especially love being strong and now go to the gym to get stronger, healthier, and get more endurance, not to punish myself or burn calories. Now I love working out and look forward to it, when I used to dread it. I definitely feel healthier than I was when I was underweight or even average weight, especially since I do work out more. I also like my curves; I've always had a big butt that got attention, but now I finally have the boobs I always wanted.\n\nAlso, I can say everyone in my household loves to cuddle with me. My 6 year old has a weird obsession with my stomach. She loves \"belly\" and acts like it's a whole baby or the family pet or something, lol. When she's sad or just wants to cuddle, she asks to touch my belly cuz it's so soft and comforting. When I was younger, I think I'd hate that since I've always disliked my stomach, but now I sort of see it through my daughter's eyes, as something that's soft, cute, and comforting to the babies that grew in there. My kids and husband accept and love my body the way it is now, and that's helped me slowly accept it like I never thought I would.",
      "created_utc": 1659464454.0,
      "score": 13,
      "context": []
    },
    {
      "id": "iin8dfd",
      "author": "Empath_13",
      "body": "-Being able to ski again! I would be waaaaay too cold, and my fingers and toes would literally be numb the whole time. Plus I didn’t have the energy!\n-Swimming! I loved swimming before my ED but then it was wayyy too cold for me (unless it was a hot tub). Plus instead of just enjoying it, it became all about burning calories\n-No more blue/purple tinge to my skin!\n-Not peeing my pants constantly\n-Having energy. Not just more energy lol but energy.",
      "created_utc": 1659449504.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iingotb",
      "author": "NeuroticKrystal",
      "body": "Yesssss. With fat on my butts, sitting in a chair is no longer like sitting on a pad of needles",
      "created_utc": 1659452834.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iim83t2",
      "author": "empathy_for_a_day",
      "body": "More tits, ass, squish and softness for decent partners who actually don't prefer underweight bodies.",
      "created_utc": 1659426713.0,
      "score": 21,
      "context": []
    },
    {
      "id": "iin5i60",
      "author": "throwawaystitches",
      "body": "Ive gone back and forth on my weight but jumping off the fact that I get sick less is also having wiggle room for some weight loss that won't kill me, if I ever do get sick.\n\nI think it can be easy take our ability to eat for granted, but people get sick and it can be hard or impossible to eat/keep food down. Idk about you guys but I can get serious anxiety when I have a high fever that \\~\\*this is it\\*\\~ and it feels even more intense when I know the stats for underweight people. Ive had times where I've wished for death, but theres something scary about when it feels like it's going to happen and you have no control.\n\nAlso second, finding better quality partners that may be attracted to you for your body, but don't have narrow expectations for it.",
      "created_utc": 1659448287.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iinii77",
      "author": "Real-Ad-6720",
      "body": "god what a lovely post 😭😭😭😭 thank you 💗",
      "created_utc": 1659453540.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ij9b25z",
      "author": "None",
      "body": "The cushioning one hit me different.I remember trying to do sit-ups and I just couldn’t because of my tailbone and spine hurting",
      "created_utc": 1659836143.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iiqdkl0",
      "author": "bluexjay",
      "body": "Wow, i didn't even connect the injuries part. I used to be covered in bruises from bumping into things - I still get scared when I hit something but it never hurts anymore. Still just as clumsy, sadly",
      "created_utc": 1659494561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iis3bgj",
      "author": "sunflowersss3",
      "body": "god the immune system one is one of the perks i cant wait for - i got covid for the second time a couple weeks ago, after a period of severe restriction bc of the '''summer body'''' pressure, and omfg it SUCKED. my first round of covid was at a healthy weight (i think-cant remember too perfectly, i was probably in quasi-recovery so i was physically okay)  and it was a walk in the park compared to the most recent second time. my first round was basically inevitable bc my sister had it and wed been very close to each other, and i wouldnt have even tested myself for it if she hadnt been diagnosed bc i felt so fine, my only symptom was a slight fever. the second time i have no clue how i got it, i tested bc of my symptoms, my throat felt like id swallowed three knives, i had a massive cough, i could only speak in whispers, and it lasted quite a few days longer than the first time. \ni cant wait for my immune system to toughen up now after i decided to commit to recovrry. i swear ill go around licking toilet bowls once im fully physically recovered 😭😭",
      "created_utc": 1659533692.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iisth3q",
      "author": "GeophysicsSharkie",
      "body": "I really needed to see this today, thank you.",
      "created_utc": 1659544074.0,
      "score": 1,
      "context": []
    }
  ]
}