{
  "id": "wejt63",
  "subreddit": "fuckeatingdisorders",
  "author": "l0ser_6",
  "created_utc": 1659466391.0,
  "title": "reasons to recover RIGHT NOW!",
  "selftext": "this post is mainly intended for u/Zealousideal-Top377, but i decided to make it into a post so others can see it, and cause it was so long haha. \n\nYOU WILL DEFINITELY DIE IF YOU DONT GAIN WEIGHT!!\n\ni apologize if this post is triggering, but i have to say this. you have to recover NOW or you’ll die\n\nwhen i decided fuck it and started recovering, I BASICALLY HAD NO OTHER CHOICE THAN DEATH! \n\nthings i have suffered due to anorexia:\n\n1- **MY TAILBONE CAME OUT OF MY BACK!** literally. this was basically what mainly pushed me to recovery. i was going downstairs at a hospital, was so tired i missed a step and fell onto my butt down each stair. idk why i passed out after and my mom had to carry me into the car. at home, my mom noticed a huge blood stain on the back of my shorts (i thought i got my period, how funny😹) and found out that my tailbone literally punctured through my skin. had that fixed but now i have a permanent scar in my asscrack👍\n\n2- **MY GRANDMA WOULD CARRY ME INTO CARS/UP STAIRS/SIDEWALKS!** i literally reached a point where i could not walk for more than 5 mins without blacking out and my 70 YEAR OLD GRANDMA would help me do basic human functions like opening/closing my car door and helping me take a step up a sidewalk. \n\n3- **SEVERE BRAIN FOG/ MEMORY LOSS!** like i genuinely do not remember a single specific memory at the time i was malnourished, just general periods of time (this improves DRASTICALLY with recovery, a new world opens up!!) i also could not keep up a conversation for more than a couple mins as i would get so exhausted. \n\n4- **I HAD NO BLADDER CONTROL!** i literally don’t know why but i’ve pissed myself so many times while on the way to the bathroom, cause when my bladder was full it would literally empty itself on its own. (embarrassing) \n\n5- **BRUISES FROM SITTING/SLEEPING!** i reached a point where even laying down on a mattress would cause my ribs/bones to bruise and turn blue (ouch)\n\n6- **DIGESTION PROBLEMS!** everyone says this but you either shit pure water for days (i would still refuse to eat starch to help💔) or not shit for a month, no in between. \n\n7-**EXTREMELY LOW HEART RATE!** my heart rate was in the low 30s even when i would walk and my parents would check up on me while sleeping since they were scared i would die in my sleep!\n\n.\n.\nthere are MUCH MUCH more terrible things and ed can cause. i will definitely try to add more if i remember other stuff. also feel free to comment more shit your ed has caused!!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/wejt63/reasons_to_recover_right_now/",
  "score": 117,
  "num_comments": 35,
  "comments": [
    {
      "id": "iiono0s",
      "author": "anon_mentalhealthacc",
      "body": "1. My ED messed up my hormones and my thyroids. I now have hypothyroidism.\n\n2. Also, periods. I don't wanna have kids right now and I'm not sure if I ever plan on having kids, but it would be nice to at least have the option to. But, like many others, I haven't had my period in a while (around 6-7 months now). And I know that can't be healthy.\n\n3. Hair and nails. My nails are so brittle, I break one every day. And my hair has gotten a lot thinner and I feel like it doesn't grow at all.\n\n4. It's embarrassing to admit, but I am gassy a lot of the time and I can't hold in my farts. It just happens. And it smells dreadful. It's even more embarrassing when it happens at work... I'm pretty sure everyone around me noticed, but they don't want to seem impolite by calling it out...\n\n5. Kind of similar to your brain fog argument, but I also noticed that I can't concentrate on anything. I can't watch movies anymore, because I start getting bored/losing focus after half an hour. I also can't pursue my hobbies anymore. It sucks. It has improved a bit though. Maybe my brain is still healing.",
      "created_utc": 1659468933.0,
      "score": 46,
      "context": []
    },
    {
      "id": "iip5eu5",
      "author": "Forward-Woodpecker-4",
      "body": "Warning: long comment\nedit: fixed typos\n\n1. No period. Although i don’t want kids, i know i need my period. Because the anxiety of knowing you are at risk for heart issues and osteoporosis when you are not even old yet, is terrifying.\n\n2. Hurts to sit on hard surfaces. Even though i was never “underweight” at my lowest weight it hurt my bones  to sit down in my shower to shave my legs :/\n\n3. Always have to pee…all the damn time. Because of drinking too much water and fluids bc “hunger and thirst are confused 😑🙄” and to fill up the void of not having enough food, i constantly had some kind of beverage going down my throat and they all just went right through me. I had to pee every hour of the day \n\n4. Hair and nails don’t grow. My hair has always been thick and “healthy” and never lost too much hair, but it wouldn’t grow for the life of me. I last bleached my hair at the very beginning of 2019. Only 2 weeks ago did i finally grow it all out back to my natural hair! 3 1/2 years!! Just to grow out my hair again 🤯 and my nails can never get past a certain length, they would always be brittle and break, they never used to be like that. I didn’t even take care of them before but they could grow strong and healthy when i ate enough.\n\n5. Always cold, so not being able to look forward to winter holidays or going anywhere even somewhat cold. Christmas is my absolute favorite time of year! In fact i just love fall and winter in general. Seeing snow makes me so happy. Only did my ED convince me to stop looking forward to winter and hating it. In the summer i was already cold in my house using a blanket when it was nearly 100 F / 37 C outside, so the thought of winter every year terrified me because i constantly had my door shut with the heater on, had 2 layers on, and a blanket. I even would get so mad at my family and yell at them if they ever left my door open and let the heat out. They did not deserve that. Going to the store was so scary as well just because the store is always a bit cool, but to me it was freezing. I would avoid going to the store in the winter as much as possible 😞\n\n6. No brain space for anything fun or productive. All i did besides obsessively thinking about food and my next meal, or planning it, was finding ways to pass the time between meals. Literally i did was mindlessly scroll all day after i finished my work, or i would sleep. I had no motivation or energy to do anything and i dreaded everyday, i was constantly sad and bored but couldn’t bring myself to do anything. I could barely keep myself playing a game or watching a show because i was starving…\n\n7. Literally did not shower. Yeah I’m not going to sugar coat this, it’s absolutely gross and one of the worst parts. I absolutely dreaded showering. Standing for that long and sitting to shave was horrible because it hurt my bones, and i would get dizzy from being so hungry. Watching my hair fall out…also the no energy part again, i couldn’t get myself up to do much of anything. I had gone like a week without washing my hair or showering more than once and i cried a lot. I always isolated myself because i was dirty, ashamed, and no energy \n\n8. Losing your friends. I didn’t have much to talk about with them, i refused going out because i had no energy and food anxiety at anywhere but my home, and i was always in a bad mood and started fights for no reason. Especially when they were just asking about my well being. This just worsened my depression and ED.\n\n9. Digestive issues. Always constipation, bloating, diarrhea, or gas! Eat anything I’m not used to? I will look pregnant and have such bad gas i can’t be around anyone. Eating at night after conditioning myself not to for 5 years? Indigestion, acid reflux, cramps, and insomnia! My bowel movements were unpredictable af and always were painful in someway as well.  \n\n10. Intermittent fasting. All I’m gonna say is 🖕🖕🖕it helped cause and make every problem on this list 10x worse! \n\nAnd all of this…All for what? To be skinny? Attractive? Hm? Someone who is filthy is not attractive or cute, no energy to do anything meaningful is not fun or cute, and someone who has nothing to talk about because all they think about is food and the next time they will eat, is not fun, cute or attractive! You know what is though? Being able to enjoy your food without having horrible pain, going out and making memories with people, and having actual hobbies and brain capacity! The ED is never worth it no matter how much it convinces you it is. Recovery is not easy at all, but it has opened my eyes to how much life is actually worth living again!",
      "created_utc": 1659475652.0,
      "score": 41,
      "context": []
    },
    {
      "id": "iioqxk3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1659470173.0,
      "score": 32,
      "context": []
    },
    {
      "id": "iipeeuk",
      "author": "piginapickle",
      "body": "This is a great thread and I second most of these ! \n\nI’ll add general fearfulness and jumpiness. Just this low level anxiety of always feeling so anxious for no reason. Probably my body in panic mode. I am so much more chill just 6 weeks into recovery.\n\nSuch a tiny world. Just narrowing my life more and more to accommodate my eating habits and not having energy to do much more than manage my eating and workouts. No joy",
      "created_utc": 1659479173.0,
      "score": 15,
      "context": []
    },
    {
      "id": "iiplojq",
      "author": "pompoususername",
      "body": "1. Not getting headaches constantly\n\n2. Trips and hang outs with friends and family no longer have to be ruled by planning and counting and anxiety over what I’ll eat and eating it at the right time and trying to inconspicuously exercise “enough”. I can just sit back and enjoy things (well, I’m still working on it, but that’s the end goal)\n\n3. The BLOATING AND STOMACH ISSUES. This is a big one (for me). My IBS has been so much better the last few months, and the bloating from storing food and from not digesting things properly goes waaaay down\n\n4. Not getting dizzy and lightheaded every time I stand up. Still working on this one for me, but I hate when my vision goes dark when I first get up in the morning.\n\n5. The mood swings and irritability. I was so cranky when I was deep in it, and aside from how it affected me socially, it also just SUCKS to feel so down and/or agitated ALL. The. Time. My mood has improved a lot recently (but I also started taking mood stabilizers a few weeks ago). I still get hangry, but at least it’s not CONSTANTLY.\n\n6. I actually have energy and motivation to do things now. I can ENJOY things again and it’s great. It makes every in life feel so much more worth it.\n\n7. I know this one gets mentioned a lot, but seriously the concentration/brain fog. I hated feeling so useless and dumb in the middle of conversations, trailing off and not being able to think of anything to say to carry on the conversation, which is already bad enough with my ADHD. I also don’t have to worry about how it’s going to impact my schooling and grades anymore because I can actually compute and retain things now\n\nEdit: 8. And being uncomfortable sitting or laying anywhere!!",
      "created_utc": 1659482204.0,
      "score": 13,
      "context": []
    },
    {
      "id": "iisoxwo",
      "author": "keepyourcrystals",
      "body": "i could’ve added much more to this list but i just wanted to mention how crazy it is how eating disorders are often romanticized (even by people who have never experienced one, or have seen a loved one suffer from them etc) and how the long list of negative and not so pleasant consequences are rarely ever brought up.",
      "created_utc": 1659542360.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iiq6f4i",
      "author": "B0urn3D3ad",
      "body": "When you went for recovery, what did your first 4 days-week look like?  Just eating all day whatever you want, adding in a few things each day, eating loads one day and then less the next, etc?  Did you go all in or slowly increase? I keep overthinking and worrying. Like I’m so analytical im like what’s the right amount to eat when I go all in to actually go all in Instead of just eating a massive amount and going into the storm And just doing it",
      "created_utc": 1659491299.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iiqqhw9",
      "author": "Funky_Lesbian",
      "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
      "created_utc": 1659501190.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iiorlwu",
      "author": "l0ser_6",
      "body": "i swear! not being able to concentrate is the worst. like i’m tryna watch a movie and all i can think of is food",
      "created_utc": 1659470433.0,
      "score": 17,
      "context": [
        {
          "id": "iiono0s",
          "author": "anon_mentalhealthacc",
          "body": "1. My ED messed up my hormones and my thyroids. I now have hypothyroidism.\n\n2. Also, periods. I don't wanna have kids right now and I'm not sure if I ever plan on having kids, but it would be nice to at least have the option to. But, like many others, I haven't had my period in a while (around 6-7 months now). And I know that can't be healthy.\n\n3. Hair and nails. My nails are so brittle, I break one every day. And my hair has gotten a lot thinner and I feel like it doesn't grow at all.\n\n4. It's embarrassing to admit, but I am gassy a lot of the time and I can't hold in my farts. It just happens. And it smells dreadful. It's even more embarrassing when it happens at work... I'm pretty sure everyone around me noticed, but they don't want to seem impolite by calling it out...\n\n5. Kind of similar to your brain fog argument, but I also noticed that I can't concentrate on anything. I can't watch movies anymore, because I start getting bored/losing focus after half an hour. I also can't pursue my hobbies anymore. It sucks. It has improved a bit though. Maybe my brain is still healing.",
          "created_utc": 1659468933.0
        }
      ]
    },
    {
      "id": "iip4xjl",
      "author": "the_acid_lava_lamp",
      "body": "wait the gas thing isn’t just me?",
      "created_utc": 1659475466.0,
      "score": 9,
      "context": [
        {
          "id": "iiono0s",
          "author": "anon_mentalhealthacc",
          "body": "1. My ED messed up my hormones and my thyroids. I now have hypothyroidism.\n\n2. Also, periods. I don't wanna have kids right now and I'm not sure if I ever plan on having kids, but it would be nice to at least have the option to. But, like many others, I haven't had my period in a while (around 6-7 months now). And I know that can't be healthy.\n\n3. Hair and nails. My nails are so brittle, I break one every day. And my hair has gotten a lot thinner and I feel like it doesn't grow at all.\n\n4. It's embarrassing to admit, but I am gassy a lot of the time and I can't hold in my farts. It just happens. And it smells dreadful. It's even more embarrassing when it happens at work... I'm pretty sure everyone around me noticed, but they don't want to seem impolite by calling it out...\n\n5. Kind of similar to your brain fog argument, but I also noticed that I can't concentrate on anything. I can't watch movies anymore, because I start getting bored/losing focus after half an hour. I also can't pursue my hobbies anymore. It sucks. It has improved a bit though. Maybe my brain is still healing.",
          "created_utc": 1659468933.0
        }
      ]
    },
    {
      "id": "iip9a51",
      "author": "None",
      "body": "i would suggest looking into LDN. i'm not the world's greatest proponent of medication, but this one has drastically improved many functions for those with hypo.",
      "created_utc": 1659477162.0,
      "score": 3,
      "context": [
        {
          "id": "iiono0s",
          "author": "anon_mentalhealthacc",
          "body": "1. My ED messed up my hormones and my thyroids. I now have hypothyroidism.\n\n2. Also, periods. I don't wanna have kids right now and I'm not sure if I ever plan on having kids, but it would be nice to at least have the option to. But, like many others, I haven't had my period in a while (around 6-7 months now). And I know that can't be healthy.\n\n3. Hair and nails. My nails are so brittle, I break one every day. And my hair has gotten a lot thinner and I feel like it doesn't grow at all.\n\n4. It's embarrassing to admit, but I am gassy a lot of the time and I can't hold in my farts. It just happens. And it smells dreadful. It's even more embarrassing when it happens at work... I'm pretty sure everyone around me noticed, but they don't want to seem impolite by calling it out...\n\n5. Kind of similar to your brain fog argument, but I also noticed that I can't concentrate on anything. I can't watch movies anymore, because I start getting bored/losing focus after half an hour. I also can't pursue my hobbies anymore. It sucks. It has improved a bit though. Maybe my brain is still healing.",
          "created_utc": 1659468933.0
        }
      ]
    },
    {
      "id": "iiqcpzq",
      "author": "theinvisiblemonster",
      "body": "Fuck intermittent fasting. Glad to see this. This post and the comments stopped a thought spiral in its tracks. Thank you. 💕",
      "created_utc": 1659494169.0,
      "score": 8,
      "context": [
        {
          "id": "iip5eu5",
          "author": "Forward-Woodpecker-4",
          "body": "Warning: long comment\nedit: fixed typos\n\n1. No period. Although i don’t want kids, i know i need my period. Because the anxiety of knowing you are at risk for heart issues and osteoporosis when you are not even old yet, is terrifying.\n\n2. Hurts to sit on hard surfaces. Even though i was never “underweight” at my lowest weight it hurt my bones  to sit down in my shower to shave my legs :/\n\n3. Always have to pee…all the damn time. Because of drinking too much water and fluids bc “hunger and thirst are confused 😑🙄” and to fill up the void of not having enough food, i constantly had some kind of beverage going down my throat and they all just went right through me. I had to pee every hour of the day \n\n4. Hair and nails don’t grow. My hair has always been thick and “healthy” and never lost too much hair, but it wouldn’t grow for the life of me. I last bleached my hair at the very beginning of 2019. Only 2 weeks ago did i finally grow it all out back to my natural hair! 3 1/2 years!! Just to grow out my hair again 🤯 and my nails can never get past a certain length, they would always be brittle and break, they never used to be like that. I didn’t even take care of them before but they could grow strong and healthy when i ate enough.\n\n5. Always cold, so not being able to look forward to winter holidays or going anywhere even somewhat cold. Christmas is my absolute favorite time of year! In fact i just love fall and winter in general. Seeing snow makes me so happy. Only did my ED convince me to stop looking forward to winter and hating it. In the summer i was already cold in my house using a blanket when it was nearly 100 F / 37 C outside, so the thought of winter every year terrified me because i constantly had my door shut with the heater on, had 2 layers on, and a blanket. I even would get so mad at my family and yell at them if they ever left my door open and let the heat out. They did not deserve that. Going to the store was so scary as well just because the store is always a bit cool, but to me it was freezing. I would avoid going to the store in the winter as much as possible 😞\n\n6. No brain space for anything fun or productive. All i did besides obsessively thinking about food and my next meal, or planning it, was finding ways to pass the time between meals. Literally i did was mindlessly scroll all day after i finished my work, or i would sleep. I had no motivation or energy to do anything and i dreaded everyday, i was constantly sad and bored but couldn’t bring myself to do anything. I could barely keep myself playing a game or watching a show because i was starving…\n\n7. Literally did not shower. Yeah I’m not going to sugar coat this, it’s absolutely gross and one of the worst parts. I absolutely dreaded showering. Standing for that long and sitting to shave was horrible because it hurt my bones, and i would get dizzy from being so hungry. Watching my hair fall out…also the no energy part again, i couldn’t get myself up to do much of anything. I had gone like a week without washing my hair or showering more than once and i cried a lot. I always isolated myself because i was dirty, ashamed, and no energy \n\n8. Losing your friends. I didn’t have much to talk about with them, i refused going out because i had no energy and food anxiety at anywhere but my home, and i was always in a bad mood and started fights for no reason. Especially when they were just asking about my well being. This just worsened my depression and ED.\n\n9. Digestive issues. Always constipation, bloating, diarrhea, or gas! Eat anything I’m not used to? I will look pregnant and have such bad gas i can’t be around anyone. Eating at night after conditioning myself not to for 5 years? Indigestion, acid reflux, cramps, and insomnia! My bowel movements were unpredictable af and always were painful in someway as well.  \n\n10. Intermittent fasting. All I’m gonna say is 🖕🖕🖕it helped cause and make every problem on this list 10x worse! \n\nAnd all of this…All for what? To be skinny? Attractive? Hm? Someone who is filthy is not attractive or cute, no energy to do anything meaningful is not fun or cute, and someone who has nothing to talk about because all they think about is food and the next time they will eat, is not fun, cute or attractive! You know what is though? Being able to enjoy your food without having horrible pain, going out and making memories with people, and having actual hobbies and brain capacity! The ED is never worth it no matter how much it convinces you it is. Recovery is not easy at all, but it has opened my eyes to how much life is actually worth living again!",
          "created_utc": 1659475652.0
        }
      ]
    },
    {
      "id": "iir5pww",
      "author": "l0ser_6",
      "body": "YES the showering part!! i could barely stand let alone SCRUB myself. it was so tiring i would get out of the shower already sweaty haha",
      "created_utc": 1659511597.0,
      "score": 5,
      "context": [
        {
          "id": "iip5eu5",
          "author": "Forward-Woodpecker-4",
          "body": "Warning: long comment\nedit: fixed typos\n\n1. No period. Although i don’t want kids, i know i need my period. Because the anxiety of knowing you are at risk for heart issues and osteoporosis when you are not even old yet, is terrifying.\n\n2. Hurts to sit on hard surfaces. Even though i was never “underweight” at my lowest weight it hurt my bones  to sit down in my shower to shave my legs :/\n\n3. Always have to pee…all the damn time. Because of drinking too much water and fluids bc “hunger and thirst are confused 😑🙄” and to fill up the void of not having enough food, i constantly had some kind of beverage going down my throat and they all just went right through me. I had to pee every hour of the day \n\n4. Hair and nails don’t grow. My hair has always been thick and “healthy” and never lost too much hair, but it wouldn’t grow for the life of me. I last bleached my hair at the very beginning of 2019. Only 2 weeks ago did i finally grow it all out back to my natural hair! 3 1/2 years!! Just to grow out my hair again 🤯 and my nails can never get past a certain length, they would always be brittle and break, they never used to be like that. I didn’t even take care of them before but they could grow strong and healthy when i ate enough.\n\n5. Always cold, so not being able to look forward to winter holidays or going anywhere even somewhat cold. Christmas is my absolute favorite time of year! In fact i just love fall and winter in general. Seeing snow makes me so happy. Only did my ED convince me to stop looking forward to winter and hating it. In the summer i was already cold in my house using a blanket when it was nearly 100 F / 37 C outside, so the thought of winter every year terrified me because i constantly had my door shut with the heater on, had 2 layers on, and a blanket. I even would get so mad at my family and yell at them if they ever left my door open and let the heat out. They did not deserve that. Going to the store was so scary as well just because the store is always a bit cool, but to me it was freezing. I would avoid going to the store in the winter as much as possible 😞\n\n6. No brain space for anything fun or productive. All i did besides obsessively thinking about food and my next meal, or planning it, was finding ways to pass the time between meals. Literally i did was mindlessly scroll all day after i finished my work, or i would sleep. I had no motivation or energy to do anything and i dreaded everyday, i was constantly sad and bored but couldn’t bring myself to do anything. I could barely keep myself playing a game or watching a show because i was starving…\n\n7. Literally did not shower. Yeah I’m not going to sugar coat this, it’s absolutely gross and one of the worst parts. I absolutely dreaded showering. Standing for that long and sitting to shave was horrible because it hurt my bones, and i would get dizzy from being so hungry. Watching my hair fall out…also the no energy part again, i couldn’t get myself up to do much of anything. I had gone like a week without washing my hair or showering more than once and i cried a lot. I always isolated myself because i was dirty, ashamed, and no energy \n\n8. Losing your friends. I didn’t have much to talk about with them, i refused going out because i had no energy and food anxiety at anywhere but my home, and i was always in a bad mood and started fights for no reason. Especially when they were just asking about my well being. This just worsened my depression and ED.\n\n9. Digestive issues. Always constipation, bloating, diarrhea, or gas! Eat anything I’m not used to? I will look pregnant and have such bad gas i can’t be around anyone. Eating at night after conditioning myself not to for 5 years? Indigestion, acid reflux, cramps, and insomnia! My bowel movements were unpredictable af and always were painful in someway as well.  \n\n10. Intermittent fasting. All I’m gonna say is 🖕🖕🖕it helped cause and make every problem on this list 10x worse! \n\nAnd all of this…All for what? To be skinny? Attractive? Hm? Someone who is filthy is not attractive or cute, no energy to do anything meaningful is not fun or cute, and someone who has nothing to talk about because all they think about is food and the next time they will eat, is not fun, cute or attractive! You know what is though? Being able to enjoy your food without having horrible pain, going out and making memories with people, and having actual hobbies and brain capacity! The ED is never worth it no matter how much it convinces you it is. Recovery is not easy at all, but it has opened my eyes to how much life is actually worth living again!",
          "created_utc": 1659475652.0
        }
      ]
    },
    {
      "id": "iis6s83",
      "author": "LoveThatForYouBebe",
      "body": "I don’t have the energy to comment all I want to in the spirit of solace/camaraderie, but to your last point, intermittent fasting is what sent me into this relapse that started a year ago and I’m still desperately trying to find a way to climb out of it. FUCK IF.",
      "created_utc": 1659535199.0,
      "score": 5,
      "context": [
        {
          "id": "iip5eu5",
          "author": "Forward-Woodpecker-4",
          "body": "Warning: long comment\nedit: fixed typos\n\n1. No period. Although i don’t want kids, i know i need my period. Because the anxiety of knowing you are at risk for heart issues and osteoporosis when you are not even old yet, is terrifying.\n\n2. Hurts to sit on hard surfaces. Even though i was never “underweight” at my lowest weight it hurt my bones  to sit down in my shower to shave my legs :/\n\n3. Always have to pee…all the damn time. Because of drinking too much water and fluids bc “hunger and thirst are confused 😑🙄” and to fill up the void of not having enough food, i constantly had some kind of beverage going down my throat and they all just went right through me. I had to pee every hour of the day \n\n4. Hair and nails don’t grow. My hair has always been thick and “healthy” and never lost too much hair, but it wouldn’t grow for the life of me. I last bleached my hair at the very beginning of 2019. Only 2 weeks ago did i finally grow it all out back to my natural hair! 3 1/2 years!! Just to grow out my hair again 🤯 and my nails can never get past a certain length, they would always be brittle and break, they never used to be like that. I didn’t even take care of them before but they could grow strong and healthy when i ate enough.\n\n5. Always cold, so not being able to look forward to winter holidays or going anywhere even somewhat cold. Christmas is my absolute favorite time of year! In fact i just love fall and winter in general. Seeing snow makes me so happy. Only did my ED convince me to stop looking forward to winter and hating it. In the summer i was already cold in my house using a blanket when it was nearly 100 F / 37 C outside, so the thought of winter every year terrified me because i constantly had my door shut with the heater on, had 2 layers on, and a blanket. I even would get so mad at my family and yell at them if they ever left my door open and let the heat out. They did not deserve that. Going to the store was so scary as well just because the store is always a bit cool, but to me it was freezing. I would avoid going to the store in the winter as much as possible 😞\n\n6. No brain space for anything fun or productive. All i did besides obsessively thinking about food and my next meal, or planning it, was finding ways to pass the time between meals. Literally i did was mindlessly scroll all day after i finished my work, or i would sleep. I had no motivation or energy to do anything and i dreaded everyday, i was constantly sad and bored but couldn’t bring myself to do anything. I could barely keep myself playing a game or watching a show because i was starving…\n\n7. Literally did not shower. Yeah I’m not going to sugar coat this, it’s absolutely gross and one of the worst parts. I absolutely dreaded showering. Standing for that long and sitting to shave was horrible because it hurt my bones, and i would get dizzy from being so hungry. Watching my hair fall out…also the no energy part again, i couldn’t get myself up to do much of anything. I had gone like a week without washing my hair or showering more than once and i cried a lot. I always isolated myself because i was dirty, ashamed, and no energy \n\n8. Losing your friends. I didn’t have much to talk about with them, i refused going out because i had no energy and food anxiety at anywhere but my home, and i was always in a bad mood and started fights for no reason. Especially when they were just asking about my well being. This just worsened my depression and ED.\n\n9. Digestive issues. Always constipation, bloating, diarrhea, or gas! Eat anything I’m not used to? I will look pregnant and have such bad gas i can’t be around anyone. Eating at night after conditioning myself not to for 5 years? Indigestion, acid reflux, cramps, and insomnia! My bowel movements were unpredictable af and always were painful in someway as well.  \n\n10. Intermittent fasting. All I’m gonna say is 🖕🖕🖕it helped cause and make every problem on this list 10x worse! \n\nAnd all of this…All for what? To be skinny? Attractive? Hm? Someone who is filthy is not attractive or cute, no energy to do anything meaningful is not fun or cute, and someone who has nothing to talk about because all they think about is food and the next time they will eat, is not fun, cute or attractive! You know what is though? Being able to enjoy your food without having horrible pain, going out and making memories with people, and having actual hobbies and brain capacity! The ED is never worth it no matter how much it convinces you it is. Recovery is not easy at all, but it has opened my eyes to how much life is actually worth living again!",
          "created_utc": 1659475652.0
        }
      ]
    },
    {
      "id": "iiorzau",
      "author": "l0ser_6",
      "body": "i was such a bitch during my ed aswell like?! i couldn’t even joke around with people all i cared about was what i would eat next lmaoo",
      "created_utc": 1659470575.0,
      "score": 20,
      "context": [
        {
          "id": "iioqxk3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1659470173.0
        }
      ]
    },
    {
      "id": "iipyudi",
      "author": "withonlygrace",
      "body": "Interesting on #1! I’ve always been a horny motherfucker 😭 I think for me it’s more psychological maybe?",
      "created_utc": 1659487953.0,
      "score": 7,
      "context": [
        {
          "id": "iioqxk3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1659470173.0
        }
      ]
    },
    {
      "id": "iip53d4",
      "author": "the_acid_lava_lamp",
      "body": "huge agree - hate the feeling of my hip bones protruding against the mattress when i try to sleep, not a fun time",
      "created_utc": 1659475529.0,
      "score": 6,
      "context": [
        {
          "id": "iioqxk3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1659470173.0
        }
      ]
    },
    {
      "id": "iiqhu24",
      "author": "Forward-Woodpecker-4",
      "body": "Honestly everyone is different but for me after the health scare of losing my period, at the beginning of this year i started trying to recover by just eating more overall. i was still definitely super disordered though and only ate around “maintenance” or a bit over (which was not really my maintenance, TDEE calculators suck and cause useless anxiety) and i was still avoiding a lot of foods. But this summer is whenever i really got serious about my recovery. I stopped eating most low cal safe foods and trying to incorporate a lot of fear foods, sugar, high calorie foods and more fat into my diet. I have been going all in for about a month and a half and honestly i think it was the best option. There are times so far when i have not eaten enough in the day and so i ate so much at night i was extremely sick and had bad insomnia. There have been days where i literally ate all day every hour. And there have been days where I’m not paying much attention and just eat whatever, whenever, however much and feel fine. The best way to go i think is to eat consistently throughout the day though. Eat whatever you want whenever you want no matter how much. At first this is hard bc you will just not want to stop eating at all, and I’m still going through this bc i have a really bad scarcity mindset still, but your body doesn’t think it will get food again so it just wants you to eat while you can. Just give in, it gets better. Now i have been working on eating consistently all day long rather than kind of restricting during the day, bc trust me although i still eat A LOT every night, eating thousands of cals like i have been doing feels so much better when done all day long and not all at once before bed if it can be helped. Bc i would eat so so much at night i would not be able to sleep and my heart rate would go up, i would not be able to move etc. you will be really bloated either way and these things will still happen, also i am always gassy. So this is just stuff to expect, but it’s all so much better and manageable if you just eat consistently throughout the whole day. So far it has been getting a lot better for me. Once i start eating, it’s still hard to stop bc I’m super hungry and like i said, bad scarcity mindset, but it’s so much better now. Since i have been showing my body that food is available anytime, even though i still eat so much now i don’t have to gorge myself on food until i am sick and vomit (not on purpose though) as often anymore. and also don’t try to find a reason to eat or be hungry. You don’t need a reason. If you are thinking about food and want something just eat, it doesn’t matter if you have physical hunger, or what time of day it is. Eat whatever you want whenever regardless of the time of day or the reason you are eating. There is no such thing as an invalid reason to eat especially in recovery. Also i think the only “right” amount of food to eat is eating everything you want when you want it. It’s not easy and i won’t say it is. Each day is a struggle for me and i really struggle with disordered thoughts still, but i fight them full force as much as i can. i also don’t have anyone to talk about this with in real life, but if you do it will help a lot. But it really does keep getting better. You will slowly be less scared, less bloated and sick, more energy and happiness etc. i am so happy i can eat now and that i chose recovery despite the hardships. I know this is kind of rambling, and wayyyy too long (sorry) but i wish you luck and hope maybe this helps you in some way.",
      "created_utc": 1659496599.0,
      "score": 4,
      "context": [
        {
          "id": "iiq6f4i",
          "author": "B0urn3D3ad",
          "body": "When you went for recovery, what did your first 4 days-week look like?  Just eating all day whatever you want, adding in a few things each day, eating loads one day and then less the next, etc?  Did you go all in or slowly increase? I keep overthinking and worrying. Like I’m so analytical im like what’s the right amount to eat when I go all in to actually go all in Instead of just eating a massive amount and going into the storm And just doing it",
          "created_utc": 1659491299.0
        }
      ]
    },
    {
      "id": "iir627c",
      "author": "l0ser_6",
      "body": "i posted this somewhere else but heres what i did! \n\n\ni was in quasi recovery last summer and i ate 1200-1400 cals, while healthifying the foods that i craved and occasionally ordering what i actually wanted in restaurants but compensating afterwards. i was also going to the gym for an hour daily and really thought i was “recovering” lmao.\n\ni decided to go all in one day (a year after relapsing so terribly), so the night before i was excited googling my favorite foods and just knowing that now i actually have the permission to eat them! so i just woke up the next day and had a sit down breakfast with my family! the first week-ish i was still scared/ kind of gravitating towards my safe foods more.\n\nhowever i vividly remember on my 7th day i decided to make a sandwich for the first time while my mom was in the same room. i ate the sandwich and was still STARVING, and my mom was like well make another one. so i made two more, each with a filling i have restricted before. afterwards my stomach was literally RUMBLING. i kept on making more until i finished the whole loaf and didn’t even get full. i remember this cause my mom was super proud of me and hugged me after :,)\n\nthis was when extreme hunger started, and when i started to eat whatever i craved whenever i wanted!",
      "created_utc": 1659511859.0,
      "score": 5,
      "context": [
        {
          "id": "iiq6f4i",
          "author": "B0urn3D3ad",
          "body": "When you went for recovery, what did your first 4 days-week look like?  Just eating all day whatever you want, adding in a few things each day, eating loads one day and then less the next, etc?  Did you go all in or slowly increase? I keep overthinking and worrying. Like I’m so analytical im like what’s the right amount to eat when I go all in to actually go all in Instead of just eating a massive amount and going into the storm And just doing it",
          "created_utc": 1659491299.0
        }
      ]
    },
    {
      "id": "iir05cl",
      "author": "efftheestablishment",
      "body": "A lot of the replies have good answers that don't just apply to severely underweight people but... even being mildly underweight is a concern. Your ED can kill you at any weight. There have been obese and fat people who have died from starvation, as well as purging. \n\nI was only ever \"mildly underweight\" before I went into recovery, and only for a short period, not even when I did recover, but I still have long term consequences of my ED. \n\nI chose recovery because my heart was struggling, it would skip beats or start beating really fast and my chest would hurt and i'd get faint, struggle to stand. i also struggled with consistent fainting spells for the entirety of my ED. \n\nI also chose recovery because yeah, it hurt to sit, and I was miserable and everything ached and my head always hurt and man, was I irritable. The hanger really gets to you. But so does the exhaustion. All I wanted to do was sleep, and I was not fun to be around. My friends and I became distanced because I was too starved to do anything. I lost all my hobbies and my studies weren't doing well either. It was a constant cycle of waking up, counting calories, starving, feeling miserable, overworking myself and then going to bed.\n\nThis one's kind of gross but I also had HORRIBLE gum disease. I would brush and brush and brush but because I didn't have the energy to spare, my body couldn't fight off the infection in my mouth. Which was kind of embarrassing, especially when you get lectured at the dentist about it. I just had an appointment with my dentist for the first time since I started all-in recovery, and \"somehow\" the severe inflammation and gum disease of SIX YEARS is almost completely gone. \n\nOutside of the gums, I was constantly sick because I couldn't fight much off. I literally had a consistent illness for MONTHS because of stress, exhaustion and starvation. Your body can't manage or clean itself out if it doesn't have the energy. That includes your memory. My memory is also ass because of ADHD and CPTSD, but memory processing is one of the first things to go. Even if you have a good memory now, a lot of people end up losing those memories in recovery because they simply aren't strong enough to retain.\n\nBut the most important reason I chose recovery is because I actually developed reactive hypoglycemia. Everyone associates diabetes and blood sugar issues with eating too much or obesity, but... anorexia can make that happen too. I'm lucky that I've only got reactive hypoglycemia, and not pre-diabetes or diabetes itself. But I still have to manage my blood sugar and prick my finger and be concious about my food choices and eat almost every 2-4 hours so my blood sugar doesn't drop too low and I don't die. I have to make sure I eat the right things for dinner so I don't drop in the middle of the night, and my god, I have food in my car and I eat every time before I drive because if my blood sugar crashes while I'm behind the wheel, I would probably end up in a different type of crash.\n\nIt's much better now in recovery, since I'm actually eating, but I do have to be concious about it still, and I'm sure if I wasn't, I would be a lot worse. I've been dealing with this for about two years now. I was off my typical \"diet\" for a few days while on vacation laat month, and my blood sugar was CONSTANTLY dropping. \n\nI hope this isn't too preachy, your original point is true, I feel like a lot of ed symptoms are usually focused on the aspect of being underweight, but malnutrition really fucks you up. Its cheesy but calories are energy, and without energy, your body can't function the way it's supposed to, and has to \"adapt\" to a new way of surviving, which drains you, and eventually will kill you if you don't make the switch to recovery. \n\nIt's definitely easier said than done, I knew I was struggling and likely going to die for a long time before I chose to recover, but I hope you can get there. I hate to throw in another cheesy line, but the cheesy bullcrap is often true so... some of the best decisions in your life will often be the hardest ones to make - this is one of them.",
      "created_utc": 1659507426.0,
      "score": 8,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        }
      ]
    },
    {
      "id": "iirqk0c",
      "author": "busted3000",
      "body": "Sure some of them like bruises from sleeping or your tailbone poking through your skin are only really applicable to those severely underweight, but most of the issues in this thread are caused by malnourishment which happens at any weight.",
      "created_utc": 1659527225.0,
      "score": 7,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        }
      ]
    },
    {
      "id": "iisvjij",
      "author": "l0ser_6",
      "body": "even though it might seem like it, but most of these problems listed start occurring when your body is malnourished, not just underweight. \n\nexcept for my tailbone injury, in which i listed to scare a specific SEVERELY underweight user into recovery asap! i included it on the list because that exact problem is what pushed me to take recovery seriously.",
      "created_utc": 1659544861.0,
      "score": 6,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        }
      ]
    },
    {
      "id": "iiqzq9e",
      "author": "aiyana0119",
      "body": "not trying to sound rude at all but that’s very much not true\n\nthese things in the thread can all apply to anyone who is underweight, which IMO means suppressing one’s own natural set weight (doesn’t have to be BMI def of underweight).",
      "created_utc": 1659507129.0,
      "score": 5,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        }
      ]
    },
    {
      "id": "iis3ems",
      "author": "OhCrumbs96",
      "body": "Yeah, I'm not really sure how helpful threads like this are. They can very easily slip into humble-bragging, ED competitiveness territory. We all know how much our ED's thrive off of comparison and competition. I'm not convinced it's all that healthy to be trading war stories like this.",
      "created_utc": 1659533730.0,
      "score": 6,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        }
      ]
    },
    {
      "id": "iis8fsx",
      "author": "None",
      "body": "none of the issues presented here are exclusive to underweight people, except maybe op's tailbone injury.",
      "created_utc": 1659535889.0,
      "score": 2,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        }
      ]
    },
    {
      "id": "iisyls1",
      "author": "makeupyourworld",
      "body": "Yeah for real and this is coming from someone who is underweight and has experienced different problems. My heart rate isn't deathly low, it's too high and I need meds to lower it. Half the posts on this sub are just triggering af people with Restrictive AN bragging about how \"dangerous\" it is while gloating in it. I hate it.",
      "created_utc": 1659546038.0,
      "score": 3,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        }
      ]
    },
    {
      "id": "iit57y7",
      "author": "sksknie",
      "body": "Omg me too",
      "created_utc": 1659548604.0,
      "score": 3,
      "context": [
        {
          "id": "iiono0s",
          "author": "anon_mentalhealthacc",
          "body": "1. My ED messed up my hormones and my thyroids. I now have hypothyroidism.\n\n2. Also, periods. I don't wanna have kids right now and I'm not sure if I ever plan on having kids, but it would be nice to at least have the option to. But, like many others, I haven't had my period in a while (around 6-7 months now). And I know that can't be healthy.\n\n3. Hair and nails. My nails are so brittle, I break one every day. And my hair has gotten a lot thinner and I feel like it doesn't grow at all.\n\n4. It's embarrassing to admit, but I am gassy a lot of the time and I can't hold in my farts. It just happens. And it smells dreadful. It's even more embarrassing when it happens at work... I'm pretty sure everyone around me noticed, but they don't want to seem impolite by calling it out...\n\n5. Kind of similar to your brain fog argument, but I also noticed that I can't concentrate on anything. I can't watch movies anymore, because I start getting bored/losing focus after half an hour. I also can't pursue my hobbies anymore. It sucks. It has improved a bit though. Maybe my brain is still healing.",
          "created_utc": 1659468933.0
        },
        {
          "id": "iip4xjl",
          "author": "the_acid_lava_lamp",
          "body": "wait the gas thing isn’t just me?",
          "created_utc": 1659475466.0
        }
      ]
    },
    {
      "id": "iiqdf0c",
      "author": "Forward-Woodpecker-4",
      "body": "Np, that is exactly what i hoped it would do ❤️ i wish i could have seen something like this many times in my past, maybe it would have changed some things in my life. But honestly yes fuck fasting fr. It is so shoved down everyone’s throat these days and i feel like i was brainwashed and manipulated into it. I felt unhealthy if i didn’t do it 🙄 but it literally caused a lot of these problems and just multiplied them and made them much worse. Like my digestive and bowel issues, low energy, being cold etc. Idc what anyone says, doctor or not, i think humans are not meant to fast long term. Just enjoy your life and eat food. Life is too short to go without it. Humans are supposed to eat or we wouldn’t want to, our bodies are not stupid like we have been made to believe",
      "created_utc": 1659494490.0,
      "score": 7,
      "context": [
        {
          "id": "iip5eu5",
          "author": "Forward-Woodpecker-4",
          "body": "Warning: long comment\nedit: fixed typos\n\n1. No period. Although i don’t want kids, i know i need my period. Because the anxiety of knowing you are at risk for heart issues and osteoporosis when you are not even old yet, is terrifying.\n\n2. Hurts to sit on hard surfaces. Even though i was never “underweight” at my lowest weight it hurt my bones  to sit down in my shower to shave my legs :/\n\n3. Always have to pee…all the damn time. Because of drinking too much water and fluids bc “hunger and thirst are confused 😑🙄” and to fill up the void of not having enough food, i constantly had some kind of beverage going down my throat and they all just went right through me. I had to pee every hour of the day \n\n4. Hair and nails don’t grow. My hair has always been thick and “healthy” and never lost too much hair, but it wouldn’t grow for the life of me. I last bleached my hair at the very beginning of 2019. Only 2 weeks ago did i finally grow it all out back to my natural hair! 3 1/2 years!! Just to grow out my hair again 🤯 and my nails can never get past a certain length, they would always be brittle and break, they never used to be like that. I didn’t even take care of them before but they could grow strong and healthy when i ate enough.\n\n5. Always cold, so not being able to look forward to winter holidays or going anywhere even somewhat cold. Christmas is my absolute favorite time of year! In fact i just love fall and winter in general. Seeing snow makes me so happy. Only did my ED convince me to stop looking forward to winter and hating it. In the summer i was already cold in my house using a blanket when it was nearly 100 F / 37 C outside, so the thought of winter every year terrified me because i constantly had my door shut with the heater on, had 2 layers on, and a blanket. I even would get so mad at my family and yell at them if they ever left my door open and let the heat out. They did not deserve that. Going to the store was so scary as well just because the store is always a bit cool, but to me it was freezing. I would avoid going to the store in the winter as much as possible 😞\n\n6. No brain space for anything fun or productive. All i did besides obsessively thinking about food and my next meal, or planning it, was finding ways to pass the time between meals. Literally i did was mindlessly scroll all day after i finished my work, or i would sleep. I had no motivation or energy to do anything and i dreaded everyday, i was constantly sad and bored but couldn’t bring myself to do anything. I could barely keep myself playing a game or watching a show because i was starving…\n\n7. Literally did not shower. Yeah I’m not going to sugar coat this, it’s absolutely gross and one of the worst parts. I absolutely dreaded showering. Standing for that long and sitting to shave was horrible because it hurt my bones, and i would get dizzy from being so hungry. Watching my hair fall out…also the no energy part again, i couldn’t get myself up to do much of anything. I had gone like a week without washing my hair or showering more than once and i cried a lot. I always isolated myself because i was dirty, ashamed, and no energy \n\n8. Losing your friends. I didn’t have much to talk about with them, i refused going out because i had no energy and food anxiety at anywhere but my home, and i was always in a bad mood and started fights for no reason. Especially when they were just asking about my well being. This just worsened my depression and ED.\n\n9. Digestive issues. Always constipation, bloating, diarrhea, or gas! Eat anything I’m not used to? I will look pregnant and have such bad gas i can’t be around anyone. Eating at night after conditioning myself not to for 5 years? Indigestion, acid reflux, cramps, and insomnia! My bowel movements were unpredictable af and always were painful in someway as well.  \n\n10. Intermittent fasting. All I’m gonna say is 🖕🖕🖕it helped cause and make every problem on this list 10x worse! \n\nAnd all of this…All for what? To be skinny? Attractive? Hm? Someone who is filthy is not attractive or cute, no energy to do anything meaningful is not fun or cute, and someone who has nothing to talk about because all they think about is food and the next time they will eat, is not fun, cute or attractive! You know what is though? Being able to enjoy your food without having horrible pain, going out and making memories with people, and having actual hobbies and brain capacity! The ED is never worth it no matter how much it convinces you it is. Recovery is not easy at all, but it has opened my eyes to how much life is actually worth living again!",
          "created_utc": 1659475652.0
        },
        {
          "id": "iiqcpzq",
          "author": "theinvisiblemonster",
          "body": "Fuck intermittent fasting. Glad to see this. This post and the comments stopped a thought spiral in its tracks. Thank you. 💕",
          "created_utc": 1659494169.0
        }
      ]
    },
    {
      "id": "iip11v3",
      "author": "belen43",
      "body": "YES, i was a bitch and kind of annoying, people always trying to be nice to me, inviting me food and going out, and i was like NOPE BYE",
      "created_utc": 1659473988.0,
      "score": 8,
      "context": [
        {
          "id": "iioqxk3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1659470173.0
        },
        {
          "id": "iiorzau",
          "author": "l0ser_6",
          "body": "i was such a bitch during my ed aswell like?! i couldn’t even joke around with people all i cared about was what i would eat next lmaoo",
          "created_utc": 1659470575.0
        }
      ]
    },
    {
      "id": "iir9x8e",
      "author": "Tertiaritus",
      "body": "The sandwich story is so wholesome I can't T.T\n\nMy mom told me when I just started refeeding \"do control yourself somehow will ya\" because I had a huge stomach from eating to the limit and someone surrendered a seat to me on subway when we were out together thinking I was pregnant. I was in fact incapable of controlling myself at that point anymore.\n\nIt was a very stressful time for our family for a multitude of reasons and she's the only one in our family without an ed so she doesn't understand sometimes",
      "created_utc": 1659514913.0,
      "score": 4,
      "context": [
        {
          "id": "iiq6f4i",
          "author": "B0urn3D3ad",
          "body": "When you went for recovery, what did your first 4 days-week look like?  Just eating all day whatever you want, adding in a few things each day, eating loads one day and then less the next, etc?  Did you go all in or slowly increase? I keep overthinking and worrying. Like I’m so analytical im like what’s the right amount to eat when I go all in to actually go all in Instead of just eating a massive amount and going into the storm And just doing it",
          "created_utc": 1659491299.0
        },
        {
          "id": "iir627c",
          "author": "l0ser_6",
          "body": "i posted this somewhere else but heres what i did! \n\n\ni was in quasi recovery last summer and i ate 1200-1400 cals, while healthifying the foods that i craved and occasionally ordering what i actually wanted in restaurants but compensating afterwards. i was also going to the gym for an hour daily and really thought i was “recovering” lmao.\n\ni decided to go all in one day (a year after relapsing so terribly), so the night before i was excited googling my favorite foods and just knowing that now i actually have the permission to eat them! so i just woke up the next day and had a sit down breakfast with my family! the first week-ish i was still scared/ kind of gravitating towards my safe foods more.\n\nhowever i vividly remember on my 7th day i decided to make a sandwich for the first time while my mom was in the same room. i ate the sandwich and was still STARVING, and my mom was like well make another one. so i made two more, each with a filling i have restricted before. afterwards my stomach was literally RUMBLING. i kept on making more until i finished the whole loaf and didn’t even get full. i remember this cause my mom was super proud of me and hugged me after :,)\n\nthis was when extreme hunger started, and when i started to eat whatever i craved whenever i wanted!",
          "created_utc": 1659511859.0
        }
      ]
    },
    {
      "id": "iisg7dt",
      "author": "Funky_Lesbian",
      "body": "lmao i’m sorry but your tailbone can’t pop out of your body unless you’re like an inch away from death due to emaciation",
      "created_utc": 1659538991.0,
      "score": 1,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        },
        {
          "id": "iiqzq9e",
          "author": "aiyana0119",
          "body": "not trying to sound rude at all but that’s very much not true\n\nthese things in the thread can all apply to anyone who is underweight, which IMO means suppressing one’s own natural set weight (doesn’t have to be BMI def of underweight).",
          "created_utc": 1659507129.0
        }
      ]
    },
    {
      "id": "iisg07h",
      "author": "Funky_Lesbian",
      "body": "!!! exactly, it comes off as bragging sometimes to me too",
      "created_utc": 1659538911.0,
      "score": -1,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        },
        {
          "id": "iis3ems",
          "author": "OhCrumbs96",
          "body": "Yeah, I'm not really sure how helpful threads like this are. They can very easily slip into humble-bragging, ED competitiveness territory. We all know how much our ED's thrive off of comparison and competition. I'm not convinced it's all that healthy to be trading war stories like this.",
          "created_utc": 1659533730.0
        }
      ]
    },
    {
      "id": "iiu7f6x",
      "author": "Funky_Lesbian",
      "body": "LITERALLY!! like come on, we all know EDs are insanely competitive. don’t give me a checklist of things to strive for bro",
      "created_utc": 1659564427.0,
      "score": 1,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        },
        {
          "id": "iisyls1",
          "author": "makeupyourworld",
          "body": "Yeah for real and this is coming from someone who is underweight and has experienced different problems. My heart rate isn't deathly low, it's too high and I need meds to lower it. Half the posts on this sub are just triggering af people with Restrictive AN bragging about how \"dangerous\" it is while gloating in it. I hate it.",
          "created_utc": 1659546038.0
        }
      ]
    },
    {
      "id": "iiuad63",
      "author": "None",
      "body": "even if you don't have an ed you can still empathize or at least understand what someone else is going through. what your mom said is entirely inappropriate. my brother is a super country dude, doesn't really believe in mental illness, (after living with me i don't know how that's really possible, but i digress) and squirms at any mention of therapy or \"self care\" (yeah, i'm sure this will bite him in the butt one day). however, he knows i have problems with eating and he respects that. when we go out together, he makes sure we settle on a place beforehand \"so it's easier for you and so you can eat too.\" so, even without firsthand experience, you are completely capable of understanding that something is difficult for someone else. even a brotype like my brother.\n\n my sister is terrified of clowns, but me? not at all. regardless, i would NEVER scare her with a clown or do anything along those lines. i don't understand her fear, and to be honest i think it's a bit silly, but the fear exists outside of my own opinion. so i choose to respect that, which is the mature and caring thing to do. i realize that clowns aren't as central to our society as food, but you can deduce the point.  your mom should be able to as well. i'm really sorry you received that comment and i hope that you can find healing from and through that.",
      "created_utc": 1659565719.0,
      "score": 3,
      "context": [
        {
          "id": "iiq6f4i",
          "author": "B0urn3D3ad",
          "body": "When you went for recovery, what did your first 4 days-week look like?  Just eating all day whatever you want, adding in a few things each day, eating loads one day and then less the next, etc?  Did you go all in or slowly increase? I keep overthinking and worrying. Like I’m so analytical im like what’s the right amount to eat when I go all in to actually go all in Instead of just eating a massive amount and going into the storm And just doing it",
          "created_utc": 1659491299.0
        },
        {
          "id": "iir627c",
          "author": "l0ser_6",
          "body": "i posted this somewhere else but heres what i did! \n\n\ni was in quasi recovery last summer and i ate 1200-1400 cals, while healthifying the foods that i craved and occasionally ordering what i actually wanted in restaurants but compensating afterwards. i was also going to the gym for an hour daily and really thought i was “recovering” lmao.\n\ni decided to go all in one day (a year after relapsing so terribly), so the night before i was excited googling my favorite foods and just knowing that now i actually have the permission to eat them! so i just woke up the next day and had a sit down breakfast with my family! the first week-ish i was still scared/ kind of gravitating towards my safe foods more.\n\nhowever i vividly remember on my 7th day i decided to make a sandwich for the first time while my mom was in the same room. i ate the sandwich and was still STARVING, and my mom was like well make another one. so i made two more, each with a filling i have restricted before. afterwards my stomach was literally RUMBLING. i kept on making more until i finished the whole loaf and didn’t even get full. i remember this cause my mom was super proud of me and hugged me after :,)\n\nthis was when extreme hunger started, and when i started to eat whatever i craved whenever i wanted!",
          "created_utc": 1659511859.0
        },
        {
          "id": "iir9x8e",
          "author": "Tertiaritus",
          "body": "The sandwich story is so wholesome I can't T.T\n\nMy mom told me when I just started refeeding \"do control yourself somehow will ya\" because I had a huge stomach from eating to the limit and someone surrendered a seat to me on subway when we were out together thinking I was pregnant. I was in fact incapable of controlling myself at that point anymore.\n\nIt was a very stressful time for our family for a multitude of reasons and she's the only one in our family without an ed so she doesn't understand sometimes",
          "created_utc": 1659514913.0
        }
      ]
    },
    {
      "id": "iishjo9",
      "author": "aiyana0119",
      "body": "okay so sure a couple things are an exception but i don’t understand why you’re dead set on doubting how sick you are… you still need to recover and being “mildy” underweight doesn’t make you the exception for more than half of these symptoms",
      "created_utc": 1659539519.0,
      "score": 6,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        },
        {
          "id": "iiqzq9e",
          "author": "aiyana0119",
          "body": "not trying to sound rude at all but that’s very much not true\n\nthese things in the thread can all apply to anyone who is underweight, which IMO means suppressing one’s own natural set weight (doesn’t have to be BMI def of underweight).",
          "created_utc": 1659507129.0
        },
        {
          "id": "iisg7dt",
          "author": "Funky_Lesbian",
          "body": "lmao i’m sorry but your tailbone can’t pop out of your body unless you’re like an inch away from death due to emaciation",
          "created_utc": 1659538991.0
        }
      ]
    },
    {
      "id": "iiv897n",
      "author": "allofthemwitches",
      "body": "When I was four I was running in a parking garage in patent leather Mary Janes and slipped on an oil spill from a car and fractured my tailbone so bad that it was poking out of the skin and to this day protrudes. I cannot do lots of different sitting positions, yoga, dance, etc. It’s an extremely delicate area; thin skin, and anyone who endures that kind of fall is lucky to be walking.",
      "created_utc": 1659581284.0,
      "score": 3,
      "context": [
        {
          "id": "iiqqhw9",
          "author": "Funky_Lesbian",
          "body": "this thread seems mostly only applicable to people who are very severely underweight though? which is obviously important to talk about, but my brain is immediately like “oh none of these things could happen to you bc you’re only mildly underweight so you’re fine”",
          "created_utc": 1659501190.0
        },
        {
          "id": "iiqzq9e",
          "author": "aiyana0119",
          "body": "not trying to sound rude at all but that’s very much not true\n\nthese things in the thread can all apply to anyone who is underweight, which IMO means suppressing one’s own natural set weight (doesn’t have to be BMI def of underweight).",
          "created_utc": 1659507129.0
        },
        {
          "id": "iisg7dt",
          "author": "Funky_Lesbian",
          "body": "lmao i’m sorry but your tailbone can’t pop out of your body unless you’re like an inch away from death due to emaciation",
          "created_utc": 1659538991.0
        }
      ]
    }
  ]
}