{
  "id": "wg3t21",
  "subreddit": "fuckeatingdisorders",
  "author": "Forsaken-Unit-8207",
  "created_utc": 1659626150.0,
  "title": "The amount of ‘I’m no longer attracted to my spouse/partner because of her/his weight gain’ posts is triggering and infuriating AF",
  "selftext": "Tw: talk of fatphobia and should mention I am not yet in recovery. This is a vent.\n\nI see copious posts like this in the Marriage and RelationshipAdvice subreddits. The OP *always* mentions loss of attraction and not even being able to look at their own fucking spouse and always asks ‘how to point out that their spouse has gained weight.’ They always make sure to include that their wife/sometimes husband looked “amazing and fit/like a supermodel” and was really into going to the gym/eating healthy until it suddenly all goes to shit. But how should you point it out? Literally fucking don’t. \n\nI’m sure the person you are with is well aware of their weight gain and having to deal with the crippling realization that their spouse is no longer attracted to them would probably be enough to lead to a full blown eating disorder, if they didn’t already have one. \n\nMy abusive ex constantly made comments about my weight (I was always at a very healthy BMI) and compared my body to the bodies of other women. But he would constantly tell me how “perfect” I would be if I just lost ten pounds, putting me in the closer to UW category. Looking back on it now, he was without question fetishizing anorexic body types. He is precisely what led me to developing a full blown eating disorder that I can’t shake a decade later. \n\nAnd the comments in these posts are LOADED with fatphobia and toxic diet culture, like ‘suggest meal planning healthier meals, exercising together/getting a gym membership.’ ‘Maybe it’s a mental health issue/binge eating.’ And there are always even worse comments like, ‘you’re still young and haven’t been married long. You should get out while you can.’ ‘Your spouse let themselves go and you deserve to be with someone who will take care of themselves and their ✨helth✨.’ Fuck that.\n\nPeople would literally suggest to leave the person someone vowed to spend the rest of their life with over FUCKING WEIGHT GAIN. Like, are you serious? I have a feeling these subreddits are full of awful cis white heterosexual males who think women NATURALLY look like supermodels. It is a full fucking time JOB to look anything remotely close to that. It is an illness. It is exhausting. \n\nAnd bodies are SUPPOSED to change. But how can I ever recover when this is how people view weight gain? I am incredibly fortunate to have found my husband who has never made me feel like these men. In fact, he always finds me most attractive when I feel like I look like a hot mess (sweatpants, hair in utter disarray, no makeup, etc.). He has never expected me to look a certain way/pressured me to be thin. But it’s terrifying. I am doing my best to challenge my own internalized fatphobia which I do still struggle with. And these posts get me so HEATED.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/wg3t21/the_amount_of_im_no_longer_attracted_to_my/",
  "score": 269,
  "num_comments": 43,
  "comments": [
    {
      "id": "ij1txna",
      "author": "Sareeee48",
      "body": "I’m locking this post because some of y’all are being fatphobic as fuck. Please check your privilege and the harm is causes people when you judge their worth based on their weight. It’s gross.",
      "created_utc": 1659705734.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iixdyak",
      "author": "busted3000",
      "body": "I’ve heard it said before that we are trying to recover into a disordered world, these posts are sadly just further evidence of that.",
      "created_utc": 1659626937.0,
      "score": 124,
      "context": []
    },
    {
      "id": "iixj4qs",
      "author": "alwaysunderthestars",
      "body": "Ugh. It IS triggering! It infuriates me when people act this way. How the hell are they going to handle a partner who has wrinkles? Or who gets sick? \n\nBeing healthy does not equal thinness. Let me repeat: being healthy does not equal thinness. Many people can live healthy lifestyles (mentally, emotionally, physically) and be at many different shapes and sizes. Taking care of our well-being and having empathy is attractive. \n\nWhat bothers me is how many people’s brains and what they find “attractive” are being altered/tainted to what content they see online/media…they are objectifying the body of others, not loving the entirety of the human person. \n\nI am glad to hear you’re in a healthy relationship with someone who is attracted to your entire person, as it should be!",
      "created_utc": 1659628922.0,
      "score": 43,
      "context": []
    },
    {
      "id": "iiy5mvn",
      "author": "None",
      "body": "Oooohhhh do I know what you're talking about and boy do I fucking hate those posts. These people may as well do everyone a favour and publicly include, \"until death or you get fat do us part\" in their marriage vow. And yes, a lot of dudes on Reddit and in general think women can \"\"naturally\"\" and \"\"healthily\"\" maintain an underweight or borderline underweight BMI for a lifetime because they're pornsick. \n\nThere was actually an article posted recently on the main ED sub, that while triggering, was all about how fucking stupid men's expectations of women's bodies are. The article was from a women who, while she did not disclose she had an ED or not, definitely has disordered eating and strived to maintain a thin body type - and her frustrations with partners who were attracted to her for her thinness but were hypocritically turned off by what exactly it takes to maintain that thinness.",
      "created_utc": 1659637355.0,
      "score": 36,
      "context": []
    },
    {
      "id": "iixrfwb",
      "author": "Thiccsmartie",
      "body": "Unfortunately it happens. I was in that case. Relationship of 5 years. I gained a lot in recovery. Like really a lot. And he couldn’t handle it. I ended up being the one breaking up. 2,5 years later I am in a new relationship again.",
      "created_utc": 1659632059.0,
      "score": 28,
      "context": []
    },
    {
      "id": "iixeb3f",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1659627074.0,
      "score": 67,
      "context": []
    },
    {
      "id": "iiy118i",
      "author": "None",
      "body": "I don't feel like my attraction or ability to stay in love with a partner has ever had anything to do with their weight. People who want their partner to meet a certain physical standard at all times in life are typically worried about how having a traditionally attractive partner makes them look and they are scared to lose that feather in their own hat.",
      "created_utc": 1659635649.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iixwhby",
      "author": "JrCrazyCatLady",
      "body": "I hate these posts especially because they rarely get at the reason someone gains weight. They could be recovering from an ED, recovering from an illness/surgery, dealing with depression/anxiety/mental illness, recovering from giving birth, or whatever the heck normal life situations cause people to gain weight. No, the advice is to get them a gym membership or be a good example of healthy eating. Not talk to your freaking partner about what is going on in their life and how you can support them through whatever they are going through regardless of if that results in them losing weight. Losing weight is put first, and mental health and caring for your partner is put second or just ignored entirely.",
      "created_utc": 1659633954.0,
      "score": 33,
      "context": []
    },
    {
      "id": "iiyu0bb",
      "author": "ruthpower",
      "body": "Lots of great input here and I want to especially acknowledge that our culture is fatphobic as fuck however I also want to remind you that the people posting on those relationship subreddits are not a representative sample of the world’s thoughts and beliefs!! Reddit is still a very male, heteronormative, regressive place even if there are lovely pockets of community and acceptance within (like this subreddit!). I’ll sometimes mention similar feelings about stuff I’ve seen on Reddit being triggering to my bf and he kindly reminds me that the people who gather on Reddit tend towards a certain set of beliefs that do suck but also aren’t the ONLY set of beliefs out there. Your feelings and frustration are valid but I promise you it could be helpful to mindfully disengage with those kinds of posts by unfollowing the subreddit or whatever. When you read a lot of the same stuff - that weight gain in a partner made someone fall out of love, for example - it’s easy to imagine that those same thought patterns are everywhere, in everyone you encounter! But of course logically we know that can’t be the case because there are so many other variables that drive how people think out in the non-internet world.  So! That is all to say I totally get your frustration and wanted to share what helps me when I feel the same way ❤️",
      "created_utc": 1659646706.0,
      "score": 14,
      "context": []
    },
    {
      "id": "iiz6fkk",
      "author": "Forgotmyusername8910",
      "body": "Omg. I got absolutely destroyed for basically (very gently) telling this guy that his girlfriend was being a jerk for telling him that she no longer found him attractive because he gained 40lb. He’d already lost 10 of it and was working on it but he was super busy with work or school or whatever. She sounded like a super bitch and was really mean about it. \n\nEveryone basically attacked him for being gross and gaining so much weight. \n\nI was like- um. Wtf. This is disgusting. And people came at me for defending this poor guy. \n\nAll I was even saying was like- your fiancé should be encouraging you and supporting you, not cutting you down. She should’ve talked to you in a delicate way and been like ‘hey, I love you and want you to be healthy, and I was thinking, what if we joined a gym? Or a softball league together? Or took a cooking class?’ Or just started cooking healthy meals. Or started asking him to go hiking or something. \n\nInstead she just came for him and told him he was gross. Literally. \n\nIt’s like people have lost every single type of compassion ever. Empathy. Love. It’s just all gone. \n\nThere comes a point in life when everything material and superficial becomes completely irrelevant- and it’s at that point that you understand things a bit more clearly. It’s usually too late to do much about it, but not always. And no one ever takes the advice you have to give, I mean we’ve all heard it before- it just doesn’t mean much until you’re neck deep in the shit. But watching other people mismanage their opportunities is difficult.",
      "created_utc": 1659651625.0,
      "score": 13,
      "context": []
    },
    {
      "id": "iiyn44a",
      "author": "None",
      "body": "I hate those posts too, and I hate how people try to justify their shallowness by asserting it's 'for health.' Ugh and the misogyny.\n\nWhen I come across those posts, I send up good vibes and prayers to the partner and hope they'll part ways sooner than later. I can't imagine how hurt I would be if my partner that I MARRIED for LIFE decided this marriage thing is no longer working for them because I gained weight. But if they did, I would hope I am wise enough to leave their sorry ass and move on. What do they think happens to bodies as we age? And these are the people we're supposed to rely on when we get sick and infirm in the end??",
      "created_utc": 1659643950.0,
      "score": 12,
      "context": []
    },
    {
      "id": "iiy0zr5",
      "author": "Sareeee48",
      "body": "This is definitely one of the things that kept me from recovering for so long.\n\nI got with a friend who I had had a crush on for nearly 10 years of friendship. While I was stoked to be with someone who got me like nobody else, my behaviors intensified over that first year of our relationship. I was terrified of ever allowing my body to change because what if he found me disgusting and lost all attraction for me? What if he found someone who looked better than me? What if, what if, what if.\n\nIronically, when I broke down and opened up about my ED, he was super supportive and I don’t think I would have been able to recover at the time if he wasn’t so open minded and encouraged me throughout my extreme hunger and weight gain. I am the heaviest I have ever been in my life and my relationship with this individual has improved tenfold—which is the exact opposite of what I had seen, heard, and read about. Obviously not all relationships will turn out like mine, but honestly that’s the sad part. Everyone deserves that kind of support and to feel loved at any weight. Because if your love can’t change and adapt with each others’ bodies, then do you *really* fucking love that person? Is it really fucking love if you are willing to throw away an entire relationship because your partner gained fucking weight? Yikes.\n\n**Edit:** I noticed a lot of these posts you mentioned are about women who had these men’s fucking *children* and they have the audacity to to be upset they don’t look the same postpartum? I’d like to see them grow a 5-10 lb fetus inside of their body, stretching their skin, and tearing through their reproductive organs and come out with the same body. Pregnancy causes [**necessary**] weight gain and body changes.",
      "created_utc": 1659635633.0,
      "score": 27,
      "context": []
    },
    {
      "id": "iizh8hs",
      "author": "dylan_dumbest",
      "body": "Thank you for posting this. The comments have helped me feel sane again, because I see so much “You owe it to your husband to continue looking like the woman he married” toxicity on said subs.",
      "created_utc": 1659656256.0,
      "score": 10,
      "context": []
    },
    {
      "id": "iiz7tpu",
      "author": "mermaidmagick",
      "body": "This was an insecurity I never had until Reddit. I even stopped using it for a while because of it. I became obsessed with the idea my husband wasn’t attracted to me due to my weight. I’m obese now. \n\nFast forward and he admitted he wasn’t attracted to me anymore. Because I constantly accused him of hating me for being fat.",
      "created_utc": 1659652203.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iixyclw",
      "author": "breathebelievejen",
      "body": "I feel kinda differently about this.\n\nIf somebody decides they are no longer attracted to their SO, for whatever reason, that's their opinion. They can communicate X and make a choice to stay, leave, whatever. I don't think it's necessarily hateful to have or express these beliefs. People change, physically, mentally, blah blah blah.. If it's not possible for a couple to reach a compromise around a certain issue then I don't think it's a good idea to stick with it for the sake of it. I believe happiness for both people, even separately, is better than trying to force it. I do believe the content of the communication around this, as with anything in a relationship, needs to be appropriate ie. supportive and loving rather than hateful or combatitive.\n\nI have been in abusive relationships. They make the choice to be an arsehole and I make the choice to leave somebody who is being shallow, cruel, controlling or manipulative about my body or whatever else. \n\nIf anything, for my personal preferences, the person has kinda done me a favour if they leave me first! I'm not compatible with them and that's cool. Some people do value a certain body type, aesthetic or whatever, and that's fine. Each to their own. I know I feel more sensitive about this particular issue as it relates to my body image and yet I wouldn't allow that to make me think that nobody is attracted to me. On to the next one, thanks :P\n\nIt's not the whole world that thinks or behaves like this and for those that do, it really is their own insecurities and defects driving them. The best thing about this all is that I get to choose who I spend my time with or the media content that I engage in. I can find good and bad everywhere, it's healthier for me to focus on the good eggs instead.",
      "created_utc": 1659634658.0,
      "score": 18,
      "context": []
    },
    {
      "id": "iiykzdg",
      "author": "None",
      "body": "Well in my case my partner got more attracted to me lol",
      "created_utc": 1659643150.0,
      "score": 5,
      "context": []
    },
    {
      "id": "iiyj63t",
      "author": "IamNotABaldEagle",
      "body": "Regardless of what your physical preferences are you have no business getting married if you can't handle your partner's appearance changing. People fucking age. If you're that superficial do everyone a favour and stay single.",
      "created_utc": 1659642469.0,
      "score": 7,
      "context": []
    },
    {
      "id": "iizeiqu",
      "author": "literarywitch32",
      "body": "It’s a shitty reality. Part of my relapse two years ago was triggered by an ex who would go on and on about losing attraction to his ex who he claimed gained “a lot” of weight. The thing was, I knew his ex and she used to be underweight and then gained a bit and was so much happier and healthier. She was nowhere near overweight and even if she had, it shouldn’t have mattered! \n\nI got self conscious after that because his bar for “a lot of weight” was seriously disordered and fucked up. We truly have an uphill battle trying to recover in diet culture.",
      "created_utc": 1659655064.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iizin61",
      "author": "psychieintraining",
      "body": "They're so triggering for me too. Even more triggering than the post itself is seeing how literally no one in the thousands of comments is pointing out how fucked up it is. I recovered into a larger body and idk what I would do if I wasn’t even a relationship. I would be so terrified to date given the shit I see on here.",
      "created_utc": 1659656873.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iizre39",
      "author": "JellyCharacter1653",
      "body": "I’m in recovery ip and I’m absolutely terrified to go back to school in acouple weeks and see my bf and scared he’ll be like this",
      "created_utc": 1659660794.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ij1mkrp",
      "author": "mercifulmothman",
      "body": "I’ve gained weight since being with my partner. I’m not sure how much, as I don’t weigh myself anymore (recovery wins lol!) but I can physically see that my body has changed. Posts like that make me (completely irrationally) worry that my partner secretly hates my body and doesn’t find me attractive. It’s so shit and I hate it, especially since all the comments on those posts are like ‘ew how DARE your partner gain weight, they deserve it if you leave’",
      "created_utc": 1659702150.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iizhlrg",
      "author": "None",
      "body": "Exactly..and it might just be me but it seems so fake? Like I get there's emotional attraction and sexual attraction. But to suddenly treat your partner like trash because they put on a few pounds? It makes me think that whatever \"love\" someone might have had for their partner was just surface level. And I hate how people just frame it as \"we just want you to be healthy\". \n\nPeople have stupid expectations. Our bodies are not meant to stay the same forever. Shit happens. Stress, pregnancy, pandemics, etc.",
      "created_utc": 1659656419.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ij05nu8",
      "author": "Fairylights0927",
      "body": "&#x200B;\n\nFirst off, I want to say that your ex is one of those people who makes me ashamed to be a part of the human race. How damn scummy. That is AWFUL and that is fucking infuriating. I'm proud that you are so willing to protect others from that trauma and that you have the courage to share that. That shit can really help people in similar situations.\n\nHot take tho:\n\nA lot of these people are just simply ignorant. I can understand being conditioned to believe that being 20-30 pound overweight is really telling of bad health, and wanting to help a person you care about. Not saying it's true, because it isn't. People ask me about my self-harm scars. They tell me: WHy don't you just stop? Or when I pick, they say: \"Why don't you stop? Why don't you cover it up with makeup\"? Ofc, it is super annoying and puts me in a really bad mindset sometimes. I've had to learn to set boundaries in the moment and educate a little. I harbor less resentment, I compartmentalize the judgment, and yeah. Not easy, but I made it. Took a while. Anywho, if someone who happens to not know how to handle the situation wants to show love and acknowledgment, it can come off the wrong way. And it can feel like pure idiocy, but not everyone is going to be woke or interpersonally and intrapersonally conscious. Doesn't mean anything other than ignorance sometimes. And fear.\n\nMost people are being shit on in the west, and everyone just goes about a traditional \"way\" in our culture, not really learning or growing because nobody really knows how to go about it. The modern media pushes anything BUT science on consumers to make a profit, and people are literally eating in to so many conspiracy theories right now that it's terrifying. It really seems that science is just not valid enough to people of profitable enough to corporations. As a result, people kind of remain ignorant. I have a friend from Germany who says that emotional intelligence is a part of the Curriculum in German schools. It's mainly a cultural thing, and persecuting ppl or sometimes even labeling people as \"bad\" or \"idiots\" is not the way to end fatphobia. \n\nI feel like a lot of men don't have the expressive tools and stuff to support and empower themselves quite like women do. We HAVE to stop demonizing ppl if we truly want to see change. And change will be slow, unfortunately.  Also, many people are just plain ignorant. Can we blame them? Science is not mainstream these days, unfortunately.\n\nThat's why a lot of men might act like ignorant babies, b/c they themselves can be quite vapid without the support net of something akin to feminism for men. Many men are disordered themselves. That hunger to perpetuate power and to generate more power can be disordered as well. Not saying it's an excuse. Just saying. It's the rich assholes and the media really.",
      "created_utc": 1659667202.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iiyoswc",
      "author": "None",
      "body": "Readings those things since years made me sick to the point that I have huge trust issues and every the smallest rejection I blame my weight, even doe is average 🥴",
      "created_utc": 1659644628.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iizgepx",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1659655889.0,
      "score": -1,
      "context": []
    },
    {
      "id": "iizeqxc",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1659655164.0,
      "score": -3,
      "context": []
    },
    {
      "id": "ij1nmms",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1659702705.0,
      "score": -2,
      "context": []
    },
    {
      "id": "iiyzr9n",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1659648951.0,
      "score": -10,
      "context": []
    },
    {
      "id": "iiy5dpl",
      "author": "withonlygrace",
      "body": "It’s so sad! I’ve had two recent exes say they just wanted me to be healthy, but going off of straight up looks, would actually be more attracted to me if I were heavier. But I’ve been steeped in diet culture and fatphobia for nearly three decades; even though I loved these individuals and wanted them to be attracted to me, I never internalized their beliefs and instead was just like, “well I look the best AND I get the most social capital/privilege from others at x bmi, so I’m gonna keep going with that.” For me it’s become a lot less about what one particular partner wants and more about how the world at large rewards me for looking 😭 I’m really sensitive. I know when I gain weight someone’s going to comment on it, and I definitely have fear about that day coming. (I am single and in recovery now though, and I definitely feel more at peace that I’m doing it alone so I don’t have to worry about people triggering me.)",
      "created_utc": 1659637264.0,
      "score": 22,
      "context": [
        {
          "id": "iixdyak",
          "author": "busted3000",
          "body": "I’ve heard it said before that we are trying to recover into a disordered world, these posts are sadly just further evidence of that.",
          "created_utc": 1659626937.0
        }
      ]
    },
    {
      "id": "ij091a0",
      "author": "ilikebigbooks98765",
      "body": ">we are trying to recover into a disordered world\n\nWow this is such a good quote and so true",
      "created_utc": 1659668829.0,
      "score": 7,
      "context": [
        {
          "id": "iixdyak",
          "author": "busted3000",
          "body": "I’ve heard it said before that we are trying to recover into a disordered world, these posts are sadly just further evidence of that.",
          "created_utc": 1659626937.0
        }
      ]
    },
    {
      "id": "iiy5pyz",
      "author": "Abrookspug",
      "body": "That study sounds crazy to me. I know people have different preferences, but most men I know always say they don't like stick thin women and want a little meat on their bones. My husband rarely gets Hollywood crushes but if he does, it's usually on the more \"normal\" looking women who aren't sickly looking. I think I got more attention from guys when my bmi was around 23 or 24 than at 18 or 19, but maybe it was about my attitude, as I was happier and more confident than when I was starving myself and anti-social. And if a guy wants a stick thin girl, then he's not for me, but I think there's someone out there for everyone so it works!",
      "created_utc": 1659637388.0,
      "score": 20,
      "context": [
        {
          "id": "iixeb3f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1659627074.0
        }
      ]
    },
    {
      "id": "iiywl4k",
      "author": "alwaysunderthestars",
      "body": "👍",
      "created_utc": 1659647708.0,
      "score": 2,
      "context": [
        {
          "id": "iiyn44a",
          "author": "None",
          "body": "I hate those posts too, and I hate how people try to justify their shallowness by asserting it's 'for health.' Ugh and the misogyny.\n\nWhen I come across those posts, I send up good vibes and prayers to the partner and hope they'll part ways sooner than later. I can't imagine how hurt I would be if my partner that I MARRIED for LIFE decided this marriage thing is no longer working for them because I gained weight. But if they did, I would hope I am wise enough to leave their sorry ass and move on. What do they think happens to bodies as we age? And these are the people we're supposed to rely on when we get sick and infirm in the end??",
          "created_utc": 1659643950.0
        }
      ]
    },
    {
      "id": "iiy98tk",
      "author": "alwaysunderthestars",
      "body": "Omg for real! I am so happy to hear you had a positive experience recovering into a healthier body. Like you stated, everyone deserves a similar experience as you did. I’m so sick of how many people have this fantasy of how a partner’s body *should* be. Ugh!",
      "created_utc": 1659638732.0,
      "score": 12,
      "context": [
        {
          "id": "iiy0zr5",
          "author": "Sareeee48",
          "body": "This is definitely one of the things that kept me from recovering for so long.\n\nI got with a friend who I had had a crush on for nearly 10 years of friendship. While I was stoked to be with someone who got me like nobody else, my behaviors intensified over that first year of our relationship. I was terrified of ever allowing my body to change because what if he found me disgusting and lost all attraction for me? What if he found someone who looked better than me? What if, what if, what if.\n\nIronically, when I broke down and opened up about my ED, he was super supportive and I don’t think I would have been able to recover at the time if he wasn’t so open minded and encouraged me throughout my extreme hunger and weight gain. I am the heaviest I have ever been in my life and my relationship with this individual has improved tenfold—which is the exact opposite of what I had seen, heard, and read about. Obviously not all relationships will turn out like mine, but honestly that’s the sad part. Everyone deserves that kind of support and to feel loved at any weight. Because if your love can’t change and adapt with each others’ bodies, then do you *really* fucking love that person? Is it really fucking love if you are willing to throw away an entire relationship because your partner gained fucking weight? Yikes.\n\n**Edit:** I noticed a lot of these posts you mentioned are about women who had these men’s fucking *children* and they have the audacity to to be upset they don’t look the same postpartum? I’d like to see them grow a 5-10 lb fetus inside of their body, stretching their skin, and tearing through their reproductive organs and come out with the same body. Pregnancy causes [**necessary**] weight gain and body changes.",
          "created_utc": 1659635633.0
        }
      ]
    },
    {
      "id": "ij1tqqm",
      "author": "Sareeee48",
      "body": "Your post was removed for breaking Rule 6. Please contact the mods if you have any doubts.",
      "created_utc": 1659705647.0,
      "score": 1,
      "context": [
        {
          "id": "iizgepx",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1659655889.0
        }
      ]
    },
    {
      "id": "ij1skou",
      "author": "Sareeee48",
      "body": "Your post was removed for breaking Rule 6 and 10. Please contact the mods if you have any doubts.",
      "created_utc": 1659705112.0,
      "score": 0,
      "context": [
        {
          "id": "iizeqxc",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1659655164.0
        }
      ]
    },
    {
      "id": "ij1t0j3",
      "author": "Sareeee48",
      "body": "Your post was removed for breaking Rule 6. Please contact the mods if you have any doubts.",
      "created_utc": 1659705314.0,
      "score": 1,
      "context": [
        {
          "id": "ij1nmms",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1659702705.0
        }
      ]
    },
    {
      "id": "iiz66ht",
      "author": "Forsaken-Unit-8207",
      "body": "Why exactly are you even here? To troll? I’m guessing you are a troll. I will not engage with trolls.",
      "created_utc": 1659651523.0,
      "score": 4,
      "context": [
        {
          "id": "iiyzr9n",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1659648951.0
        }
      ]
    },
    {
      "id": "iizhasb",
      "author": "None",
      "body": "Reading this gave me a fucking headache.",
      "created_utc": 1659656285.0,
      "score": 2,
      "context": [
        {
          "id": "iiyzr9n",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1659648951.0
        }
      ]
    },
    {
      "id": "iiychb2",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1659639942.0,
      "score": 10,
      "context": [
        {
          "id": "iixeb3f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1659627074.0
        },
        {
          "id": "iiy5pyz",
          "author": "Abrookspug",
          "body": "That study sounds crazy to me. I know people have different preferences, but most men I know always say they don't like stick thin women and want a little meat on their bones. My husband rarely gets Hollywood crushes but if he does, it's usually on the more \"normal\" looking women who aren't sickly looking. I think I got more attention from guys when my bmi was around 23 or 24 than at 18 or 19, but maybe it was about my attitude, as I was happier and more confident than when I was starving myself and anti-social. And if a guy wants a stick thin girl, then he's not for me, but I think there's someone out there for everyone so it works!",
          "created_utc": 1659637388.0
        }
      ]
    },
    {
      "id": "iiyas43",
      "author": "Sareeee48",
      "body": "It’s sad because these people are always the loudest; you don’t read a lot about people saying “love your partner’s body no matter what!” Because it’s not something they think about, I believe. So all you see is the shitty things about relationship weight gain. It really freaks us out, especially women, and keeps us from being truly open with our partners.",
      "created_utc": 1659639301.0,
      "score": 6,
      "context": [
        {
          "id": "iiy0zr5",
          "author": "Sareeee48",
          "body": "This is definitely one of the things that kept me from recovering for so long.\n\nI got with a friend who I had had a crush on for nearly 10 years of friendship. While I was stoked to be with someone who got me like nobody else, my behaviors intensified over that first year of our relationship. I was terrified of ever allowing my body to change because what if he found me disgusting and lost all attraction for me? What if he found someone who looked better than me? What if, what if, what if.\n\nIronically, when I broke down and opened up about my ED, he was super supportive and I don’t think I would have been able to recover at the time if he wasn’t so open minded and encouraged me throughout my extreme hunger and weight gain. I am the heaviest I have ever been in my life and my relationship with this individual has improved tenfold—which is the exact opposite of what I had seen, heard, and read about. Obviously not all relationships will turn out like mine, but honestly that’s the sad part. Everyone deserves that kind of support and to feel loved at any weight. Because if your love can’t change and adapt with each others’ bodies, then do you *really* fucking love that person? Is it really fucking love if you are willing to throw away an entire relationship because your partner gained fucking weight? Yikes.\n\n**Edit:** I noticed a lot of these posts you mentioned are about women who had these men’s fucking *children* and they have the audacity to to be upset they don’t look the same postpartum? I’d like to see them grow a 5-10 lb fetus inside of their body, stretching their skin, and tearing through their reproductive organs and come out with the same body. Pregnancy causes [**necessary**] weight gain and body changes.",
          "created_utc": 1659635633.0
        },
        {
          "id": "iiy98tk",
          "author": "alwaysunderthestars",
          "body": "Omg for real! I am so happy to hear you had a positive experience recovering into a healthier body. Like you stated, everyone deserves a similar experience as you did. I’m so sick of how many people have this fantasy of how a partner’s body *should* be. Ugh!",
          "created_utc": 1659638732.0
        }
      ]
    },
    {
      "id": "iiz0pxy",
      "author": "Abrookspug",
      "body": "Yeah age helps for sure. My preferences have def changed as I don't like the skinny guys I did when I was 21. I prefer slightly bigger, more muscular guys who look like men, not boys. It seems similar for a lot of guys my age, as I'm in my mid thirties and most guys I meet don't seem to be put off by mombod. They still buy my friends and I drinks when we're out despite us all being married and not interested, and I still have been catcalled or flirted with at ridiculous places, like the gas station lol. But as my husband has told me, most guys will try to sleep with any woman regardless of size. They have preferences like we do, but whether you're thin or not, you'll get attention from guys, especially in the bar scene. \n\nIn fact, over the years, I've come to the disturbing realization that I feel more judged for my weight by other women than men. It's always other women who made comments about me or other girls not being thin enough, or that guys won't like us, etc. When I see comments on reddit about women on tv shows, it's usually women calling them fat and assuming the husband is cheating because she hasn't lost the baby weight...when there's no evidence that he is and he seems perfectly happy. When I was younger, it was other women encouraging me to starve myself and count calories, while any guys who found out what I was doing were shocked and upset and just confused why I thought I was fat. So for me, talking to my husband and his friends and finding out that they tend to like curvier girls has helped me put things in perspective. I wish I knew this when I was a teen and trying to stay thin to impress guys who apparently didn't even care either way lol.",
      "created_utc": 1659649330.0,
      "score": 6,
      "context": [
        {
          "id": "iixeb3f",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1659627074.0
        },
        {
          "id": "iiy5pyz",
          "author": "Abrookspug",
          "body": "That study sounds crazy to me. I know people have different preferences, but most men I know always say they don't like stick thin women and want a little meat on their bones. My husband rarely gets Hollywood crushes but if he does, it's usually on the more \"normal\" looking women who aren't sickly looking. I think I got more attention from guys when my bmi was around 23 or 24 than at 18 or 19, but maybe it was about my attitude, as I was happier and more confident than when I was starving myself and anti-social. And if a guy wants a stick thin girl, then he's not for me, but I think there's someone out there for everyone so it works!",
          "created_utc": 1659637388.0
        },
        {
          "id": "iiychb2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1659639942.0
        }
      ]
    },
    {
      "id": "iiyh0pb",
      "author": "alwaysunderthestars",
      "body": "So true.",
      "created_utc": 1659641654.0,
      "score": 4,
      "context": [
        {
          "id": "iiy0zr5",
          "author": "Sareeee48",
          "body": "This is definitely one of the things that kept me from recovering for so long.\n\nI got with a friend who I had had a crush on for nearly 10 years of friendship. While I was stoked to be with someone who got me like nobody else, my behaviors intensified over that first year of our relationship. I was terrified of ever allowing my body to change because what if he found me disgusting and lost all attraction for me? What if he found someone who looked better than me? What if, what if, what if.\n\nIronically, when I broke down and opened up about my ED, he was super supportive and I don’t think I would have been able to recover at the time if he wasn’t so open minded and encouraged me throughout my extreme hunger and weight gain. I am the heaviest I have ever been in my life and my relationship with this individual has improved tenfold—which is the exact opposite of what I had seen, heard, and read about. Obviously not all relationships will turn out like mine, but honestly that’s the sad part. Everyone deserves that kind of support and to feel loved at any weight. Because if your love can’t change and adapt with each others’ bodies, then do you *really* fucking love that person? Is it really fucking love if you are willing to throw away an entire relationship because your partner gained fucking weight? Yikes.\n\n**Edit:** I noticed a lot of these posts you mentioned are about women who had these men’s fucking *children* and they have the audacity to to be upset they don’t look the same postpartum? I’d like to see them grow a 5-10 lb fetus inside of their body, stretching their skin, and tearing through their reproductive organs and come out with the same body. Pregnancy causes [**necessary**] weight gain and body changes.",
          "created_utc": 1659635633.0
        },
        {
          "id": "iiy98tk",
          "author": "alwaysunderthestars",
          "body": "Omg for real! I am so happy to hear you had a positive experience recovering into a healthier body. Like you stated, everyone deserves a similar experience as you did. I’m so sick of how many people have this fantasy of how a partner’s body *should* be. Ugh!",
          "created_utc": 1659638732.0
        },
        {
          "id": "iiyas43",
          "author": "Sareeee48",
          "body": "It’s sad because these people are always the loudest; you don’t read a lot about people saying “love your partner’s body no matter what!” Because it’s not something they think about, I believe. So all you see is the shitty things about relationship weight gain. It really freaks us out, especially women, and keeps us from being truly open with our partners.",
          "created_utc": 1659639301.0
        }
      ]
    }
  ]
}