{
  "id": "wgvznj",
  "subreddit": "fuckeatingdisorders",
  "author": "Pieta_prkl",
  "created_utc": 1659707400.0,
  "title": "Edtwt is the most toxic hellhole there is",
  "selftext": "Seriously. I've silenced every word that has anything to do with edtwt and still the pro-ana sh*t manages to get on my feed. \nI was trying to find fanart of an anime and boom, \"character based diets <3\" thread is the first result. \n\nI know these people are sick, sad, and need help but i can't feel anything but hate towards them. They're killing themselves while encouraging other people to do the same. I know they need compassion and love. But I sure as hell can't give it to them. Eating disorders ruin people.\n\nI'm sorry, i'm just tired of it",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/wgvznj/edtwt_is_the_most_toxic_hellhole_there_is/",
  "score": 126,
  "num_comments": 16,
  "comments": [
    {
      "id": "ij25c33",
      "author": "IamNotABaldEagle",
      "body": "I have to say I'm with you OP. I just find it very difficult to empathise. I did alot of crazy shit and wasn't always the best person during the height of my ED but I'm so glad I didn't actually wish my messed up food mindset on anyone else.",
      "created_utc": 1659710554.0,
      "score": 43,
      "context": []
    },
    {
      "id": "ij275sq",
      "author": "isleepifart",
      "body": "I think it's fair that we feel some ill feelings towards these people. Like, I 100% wish them the best and want them to get better but I just don't want to see their disordered opinions and tweets. They are triggering and really really demeaning/delusional. On brand for our disorder but seeing as how much we've suffered we shouldn't feel guilt for not feeling empathy.\n\nPersonally I've added a lot of things to my blocked/muted keywords list. I've found blockchains are really helpful too. So far a combo of this has worked.",
      "created_utc": 1659711276.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ij1yibe",
      "author": "None",
      "body": "i find it very hard to have empathy bc edtwt is the place there the most fatspo and meanspo is posted, and that's just vile shit that you can't just blame on an illness and think you can get away with, so i totally get you.",
      "created_utc": 1659707755.0,
      "score": 47,
      "context": []
    },
    {
      "id": "ij2r550",
      "author": "keepyourcrystals",
      "body": "i have very mixed feelings towards these types of people. \n\ni understand that they struggle, and wouldn’t wish this mental illness on anyone but even in the depth of my disorder, i’d never consider try to push my disordered behaviors onto others and engage in things such as posting “thinspo”, “fatspo” etc. especially fatspo - that’s just so fucking wrong on so many levels. shaming fat people, using them as “inspiration”… just, no. also straight up encouraging others to restrict, PRAISE them for restriction, and harass for “binging”.",
      "created_utc": 1659718995.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ij3vfnz",
      "author": "americadontcry",
      "body": "the worst thing about them is the claims that edtwt is a safe space. safe how? and for who? it is not safe for anyone to be in that environment. I know how important it is to be able to express yourself and relate to people facing the same problems you're experiencing but you should do that in therapy, there is no safety in what they have there, and I really hope there is a way to shut down all of those accounts one day!",
      "created_utc": 1659734649.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ij30r61",
      "author": "alwalee",
      "body": "back in 2020 i was on edtwt and it was one of the lowest points in my life, so i get why you hate people on there. their eating disorder doesn’t even justify their behaviour, they’re just inherently problematic and toxic. luckily i opened my eyes and realised how edtwt was actually worsening my disorder",
      "created_utc": 1659722661.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ij34pgr",
      "author": "AnaDion94",
      "body": "Same. I feel sad for them. I wish them better things in the future. When they're young, my heart fucking weeps for them. \n\nBut the vitriol, eagerness to trigger themselves and others, rampant fatphobia- it's the worst. And at the end of the day, I care more about my own recovery than trying to positively engage with internet strangers who don't want help anyways. So blocked, with abandon.",
      "created_utc": 1659724185.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ij2nxsu",
      "author": "softpitbull",
      "body": "I’m with you too - frankly I really hate that the community is thriving on such a public platform. It actually makes me feel a little bit better about the slightly more obscure platforms of pro-ana of the early 2000s … not something I’m at all saying was a shining point in time in terms of my character, but imo, those spaces existing on their own domains was maybe less overt in exposing itself to anyone who didn’t seek it out. I ended up deleting my twitter account entirely, I kept the app, mostly just so reading the weather and local news tweets would be convenient. I agree with you that empathy is difficult here. Obviously those folks are sick, and that’s a place I’ve been.. but that doesn’t mean accountability shouldn’t exist simultaneously. It can be fairly triggering on bad days, and just upsetting other times. I really can’t reconcile it for myself, or change it, so I just do what I can to limit my own time and associations on social media ed and recovery communities.",
      "created_utc": 1659717779.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ij42loo",
      "author": "terranumeric",
      "body": "I hope Twitter doesn't learn from what hashtags I just looked at. My TikTok would be ruined already.\nI didn't know how mean fatspo is. I am generation Tumblr and there was a lot of fatspo but I can't remember that it was that mean.. and pictures not videos.\nMeanspo is a horrible place, what are those people thinking..\n\nAnd why is #edtwt not banned? Don't they usually ban all tags around proana etc?\n\nEdit: WHY DO THEY USE HEALTHY WEIGHT WOMEN AS FATSPO????? NOT EVEN CHUBBY JUST \"NORMAL\"",
      "created_utc": 1659737657.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ij5tcgp",
      "author": "heighh",
      "body": "I was on it for a long time to trigger myself further into my disorder. I never shamed anyone and actively avoided fatspo. It was not healthy and I deactivated when my boyfriend found it. He did not know i had an eating disorder so that was awkward",
      "created_utc": 1659771917.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ij3gx0c",
      "author": "rileyyj001",
      "body": "I honestly don’t even know how to find it 😂 I’m so not social media savvy and I’m low key thankful for that because that shit is the last thing I need in my life rn.",
      "created_utc": 1659728897.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ij3jys3",
      "author": "twcooking",
      "body": "i use edtwt. a part of it is straight up vile so i get you point but the majority of people i’ve encountered there are genuinely nice and having a place where i could freely discuss the reality of my illness back when i was at my lowest helped me a lot and provided at least a bit of sympathy in my isolation. it also in some part inspired me to recover. i know that you’re probably refering to the toxic/fatphobic/proana part of edtwt and i agree with you but grouping the whole platform together and saying that you feel nothing but hatered towards, essentially, mentally ill people seeking community is quite extreme imo. i never thought i’d be defending edtwt but the way you worded this post made me feel like i’m a piece of shit for simply using a platform that has all sorts of users on it, just like edreddit does.",
      "created_utc": 1659730086.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ij2reqf",
      "author": "keepyourcrystals",
      "body": "this. having an eating disorder does NOT justify shaming others. and never will.",
      "created_utc": 1659719096.0,
      "score": 17,
      "context": [
        {
          "id": "ij1yibe",
          "author": "None",
          "body": "i find it very hard to have empathy bc edtwt is the place there the most fatspo and meanspo is posted, and that's just vile shit that you can't just blame on an illness and think you can get away with, so i totally get you.",
          "created_utc": 1659707755.0
        }
      ]
    },
    {
      "id": "ij3zn7f",
      "author": "terranumeric",
      "body": "I checked the fatspo hashtag for the first time..and wow people can be so vile. \nSo many nasty comments about women just enjoying themselves on TikTok.\nHaving an ED doesnt justify being a shit person.",
      "created_utc": 1659736399.0,
      "score": 8,
      "context": [
        {
          "id": "ij1yibe",
          "author": "None",
          "body": "i find it very hard to have empathy bc edtwt is the place there the most fatspo and meanspo is posted, and that's just vile shit that you can't just blame on an illness and think you can get away with, so i totally get you.",
          "created_utc": 1659707755.0
        }
      ]
    },
    {
      "id": "ij5aaa2",
      "author": "Pieta_prkl",
      "body": "yes!",
      "created_utc": 1659758766.0,
      "score": 2,
      "context": [
        {
          "id": "ij3vfnz",
          "author": "americadontcry",
          "body": "the worst thing about them is the claims that edtwt is a safe space. safe how? and for who? it is not safe for anyone to be in that environment. I know how important it is to be able to express yourself and relate to people facing the same problems you're experiencing but you should do that in therapy, there is no safety in what they have there, and I really hope there is a way to shut down all of those accounts one day!",
          "created_utc": 1659734649.0
        }
      ]
    },
    {
      "id": "m7erea0",
      "author": "DayyDreamingZ",
      "body": "I agree and disagree - for the most part that does seem true, but it all depends on the type of content you search for in edtwt. You could find all the meanspo or toxic pro-ana stuff anywhere if you searched for it, but a lot of people like myself try to be more uplifting and actually talk to eachother on Twitter and give check ins.\n\nI Wish people like you could understand that therapy isn't always accessible. My parents wouldn't allow me, I'm a minor and the only phone that can make calls is always with my mother. The only place nearby I could ask for help from is like 10 miles away too, since I live In a tiny town. \n\nShutting down accounts of people who have eating disorders isn't going to fix their problems if the only reason they're doing this online is because they were so desperate and knew they couldn't get help. Just going to blankly state it now. Nobody just doesn't want help for no reason.",
      "created_utc": 1737007686.0,
      "score": 1,
      "context": [
        {
          "id": "ij3vfnz",
          "author": "americadontcry",
          "body": "the worst thing about them is the claims that edtwt is a safe space. safe how? and for who? it is not safe for anyone to be in that environment. I know how important it is to be able to express yourself and relate to people facing the same problems you're experiencing but you should do that in therapy, there is no safety in what they have there, and I really hope there is a way to shut down all of those accounts one day!",
          "created_utc": 1659734649.0
        }
      ]
    }
  ]
}