{
  "id": "wtmed3",
  "subreddit": "fuckeatingdisorders",
  "author": "Supersaiyan-Dragon",
  "created_utc": 1661043331.0,
  "title": "How Do You Take This News?",
  "selftext": "My Clinician just informed me \"Congratulations, you reached your goal weight restoration.  Now you can taper back.\"\n\nEven at age 32 I feel like now this means I cannot eat what I want, whenever I want and am in such distress.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/wtmed3/how_do_you_take_this_news/",
  "score": 87,
  "num_comments": 16,
  "comments": [
    {
      "id": "il50vek",
      "author": "piginapickle",
      "body": "Taper back? What does that even mean? Back to dying? Geez",
      "created_utc": 1661045331.0,
      "score": 109,
      "context": []
    },
    {
      "id": "il4yzun",
      "author": "Emergency-Parsley-51",
      "body": "OMG, these are the exact words? How clueless of them to tell this to a patient, let alone one recovering from an eating disorder. I'm sorry you've got to hear this. They clearly see EDs as only a matter of weight and it's totally wrong. You can eat what you want, whenever you want and deserve a life with food freedom.",
      "created_utc": 1661044414.0,
      "score": 76,
      "context": []
    },
    {
      "id": "il5450e",
      "author": "whereistheclit",
      "body": "You eat what you want, when you want, wherever you want. People without EDs eat when they want, and what they want. They don’t think “taper at this #” and “eat more at this #”. Don’t taper shit if you don’t want to or feel like it! You do NOT need to change a thing.",
      "created_utc": 1661046933.0,
      "score": 41,
      "context": []
    },
    {
      "id": "il5cvkj",
      "author": "firecat321",
      "body": "What a bizarre, dangerous bit of “feedback”. Please do not listen to this person. Stick to your goals, listen to your body, and don’t change a damn thing if it’s doing you well, which it certainly seems to (congrats by the way!!). I’m assuming (and hoping!) that they’ve been a helpful part of your treatment team thus far. Cool! That being said, I think it’s time that you “taper back” on them, honestly. You’ve clearly learned some great skills, and hopefully have a much more expansive, helpful support system. That type of advice is not going appropriate to your recovery, and not at all supportive to your journey. I’m sorry this happened to you. Please don’t let one ignorant person invalidate you and your recovery. You got this.",
      "created_utc": 1661051287.0,
      "score": 20,
      "context": []
    },
    {
      "id": "il5bzmm",
      "author": "monsterintheuniverse",
      "body": "Tell him “congratulations, you just said the sickest thing you can possibly say to someone with an eating disorder.  Now you can fuck off.”",
      "created_utc": 1661050827.0,
      "score": 32,
      "context": []
    },
    {
      "id": "il65xkt",
      "author": "anniekeepsontrying",
      "body": "Another day another recount of a clinician making me want to bang my head against the wall. \nDo. Not. Tell. Your. ED Patients. To. Eat. Less. Geeez do these people know anything about eating disorders beyond weight?! \nPlease, OP, do not take this comment as a free pass to be skeptical of your hunger cues or even to restrict. \nLike, if you were to think of it like a garden.. you‘ve bit in the work, got the good soil, tore out all the weed and put in some nice seeds. Watered twice daily. Now you see a little green seedling pushing through the soil! Evidence of your hard work! Do you now just water once per day or stop watering? No of course you don’t! You‘re thrilled at the sight of the seedlings but ultimately you’re aiming for a rose bush, tulips, a tree. So you don‘t stop your care now, you continue to give your garden what it needs and go beyond the bare minimum. You do whatever you can to help that garden thrive. And you don‘t listen to others who tell you to care less about your garden. You know what it needs best. \n\nWow I really had a field day with that analogy bit this stuff really grinds my gears.",
      "created_utc": 1661070624.0,
      "score": 13,
      "context": []
    },
    {
      "id": "il8u35q",
      "author": "trapezoid-",
      "body": "why does it always seem that health care practitioners are the ones who spread the most harmful information about EDs to their patients?\n\nwhen i reached my dietitian's \"goal weight\" after my first relapse, she told me that it was now time to switch to a \"maintenance\" plan. i was a little confused and disappointed, since i was still ravenously hungry eating the \"weight gain\" plan she made for me. i stopped working with her after this and went on to gain about 30 more lbs until my primary care physician told me i needed to start \"paying attention\" to my food & exercise habits bc i was gaining \"too much.\" of course, being the \"good\" patient i was, i began to restrict my calories & increase my exercise, & i relapsed. now i'm right back where i started & wasted an entire year that could've been spent in recovery had my healthcare team not done EXACTLY THE OPPOSITE of what they should've.\n\ni can't wait for the day when the BMI is abolished & physicians actually understand EDs before making uninformed decisions.",
      "created_utc": 1661118663.0,
      "score": 5,
      "context": []
    },
    {
      "id": "il5g6mz",
      "author": "Powerful-Cheetah-467",
      "body": "I got told this by the first dietitian I saw last year. Once we got to my pre Ed weight she told me I could stop gaining now and wanted me to only eat at certain times/certain amounts. I knew it was wrong but it still triggered me and I relapsed until I finally got a place in a private inpatient residential hospital. I think you probably know how to listen to your body a bit more now and maybe you could stop seeing a dietitian and just see a doctor for blind weigh ins every now and then to make sure you’re not losing weight. But the way to go is to eat whenever you’re hungry, whenever you feel like it, and however much you want/need at that time. Your body will get to a point where it will do whatever it needs to do with your weight if you feed it properly. I know you’re probably really struggling to eat like how you were before they told you this but try as much as you can to eat the same. Your body might keep gaining but that’s ok and it will stop when your body is ready for it to and it might go down later on if you keep eating but it might not and that’s okay. Anyway what I’m trying to say is be kind to yourself and try and keep eating the same as you were before this appointment.",
      "created_utc": 1661053007.0,
      "score": 9,
      "context": []
    },
    {
      "id": "il5fvkr",
      "author": "crycry_chemtrails",
      "body": "Oh boy that’s really bad",
      "created_utc": 1661052848.0,
      "score": 5,
      "context": []
    },
    {
      "id": "il5e9ey",
      "author": "None",
      "body": "remember that clinicians base their goals on the bmi, which is a ludicrous measure of health. additionally, they usually have no idea about the amount of mental anguish and torment one who suffers from an eating disorder is going through. it's kind of like telling someone who does an extreme sport and suffered a life-threatening head injury \"ok the swelling is gone, so you can go back to doing whatever you want and taking hard falls.\" NO! that isn't how it works!! you need to be way more careful after something like that, and it might take years to recover from it. \n\ni'd advise reaching out to people who care about and can support you in this time. in my experience, the most acute phase of recovery is this one- where everyone says, \"yep, not dying anymore!\" and they pull back. this was where everything i tried to squash with my ed came roaring back with a vengeance. i needed a ton of support in this time, and i imagine you do, too. \n\nwith other illnesses, markers like this are a license for more independence + celebration. for those of us with eating disorders, it's a recipe for a disaster. weight restoration is one facet of recovery, it (as you know) does NOT mean everything is fine. you're going to need people to support you through this, so please find someone reliable to help. friends, family, a therapist- people who aren't swayed by diet culture and understand your struggle. for me, this was the absolute hardest part. it takes so much to even get here, and it'll take a lot more to stay. you're a freaking champ who should be proud af, even though i know it doesn't feel that way. \n\n you are allowed to eat as much as you want, whenever you want. your body is wise- it wants to help you. you're allowed to take care of it, and you should. it's the only one you have, after all. \n\ni'm really sorry your doc was an inconsiderate arse. those words are so poorly chosen and they shouldn't be taken to heart. find an eating disorder specialist if possible ( i know they can be pricey), and they'll tell you that was way out of line and inaccurate. \n\nhere are some refs\n\n[https://www.npr.org/templates/story/story.php?storyId=106268439](https://www.npr.org/templates/story/story.php?storyId=106268439)\n\nhttps://www.mamamia.com.au/bmi-calculator/",
      "created_utc": 1661052016.0,
      "score": 5,
      "context": []
    },
    {
      "id": "il8ay9f",
      "author": "Spectrachic311311",
      "body": "I’m wondering if he’s older. I’ve found many older practitioners adhere to that advice. Like, get to normal BMI and then stop. Except that your body doesn’t know what BMI to shoot for because bmi is bullshit. I would try to find a new doctor, but in the meantime just keep eating what you want.",
      "created_utc": 1661110663.0,
      "score": 1,
      "context": []
    },
    {
      "id": "il5zr7z",
      "author": "Supersaiyan-Dragon",
      "body": "Needed that so badly.\n\nYes was quite shocking, I just ignored it and went home an made an omelette with Eggo waffles for dinner..Breakfast for dinner the best.",
      "created_utc": 1661065537.0,
      "score": 51,
      "context": [
        {
          "id": "il4yzun",
          "author": "Emergency-Parsley-51",
          "body": "OMG, these are the exact words? How clueless of them to tell this to a patient, let alone one recovering from an eating disorder. I'm sorry you've got to hear this. They clearly see EDs as only a matter of weight and it's totally wrong. You can eat what you want, whenever you want and deserve a life with food freedom.",
          "created_utc": 1661044414.0
        }
      ]
    },
    {
      "id": "il5d01q",
      "author": "None",
      "body": "seconding this notion",
      "created_utc": 1661051352.0,
      "score": 6,
      "context": [
        {
          "id": "il5bzmm",
          "author": "monsterintheuniverse",
          "body": "Tell him “congratulations, you just said the sickest thing you can possibly say to someone with an eating disorder.  Now you can fuck off.”",
          "created_utc": 1661050827.0
        }
      ]
    },
    {
      "id": "il6am5p",
      "author": "Kazie224",
      "body": "This is the correct response",
      "created_utc": 1661074665.0,
      "score": 19,
      "context": [
        {
          "id": "il4yzun",
          "author": "Emergency-Parsley-51",
          "body": "OMG, these are the exact words? How clueless of them to tell this to a patient, let alone one recovering from an eating disorder. I'm sorry you've got to hear this. They clearly see EDs as only a matter of weight and it's totally wrong. You can eat what you want, whenever you want and deserve a life with food freedom.",
          "created_utc": 1661044414.0
        },
        {
          "id": "il5zr7z",
          "author": "Supersaiyan-Dragon",
          "body": "Needed that so badly.\n\nYes was quite shocking, I just ignored it and went home an made an omelette with Eggo waffles for dinner..Breakfast for dinner the best.",
          "created_utc": 1661065537.0
        }
      ]
    },
    {
      "id": "il6xvuz",
      "author": "selkieflying",
      "body": "Ugh I love breakfast for dinner",
      "created_utc": 1661090064.0,
      "score": 3,
      "context": [
        {
          "id": "il4yzun",
          "author": "Emergency-Parsley-51",
          "body": "OMG, these are the exact words? How clueless of them to tell this to a patient, let alone one recovering from an eating disorder. I'm sorry you've got to hear this. They clearly see EDs as only a matter of weight and it's totally wrong. You can eat what you want, whenever you want and deserve a life with food freedom.",
          "created_utc": 1661044414.0
        },
        {
          "id": "il5zr7z",
          "author": "Supersaiyan-Dragon",
          "body": "Needed that so badly.\n\nYes was quite shocking, I just ignored it and went home an made an omelette with Eggo waffles for dinner..Breakfast for dinner the best.",
          "created_utc": 1661065537.0
        }
      ]
    },
    {
      "id": "il6lm70",
      "author": "Emergency-Parsley-51",
      "body": "Love it! Glad you ignored them.",
      "created_utc": 1661083275.0,
      "score": 2,
      "context": [
        {
          "id": "il4yzun",
          "author": "Emergency-Parsley-51",
          "body": "OMG, these are the exact words? How clueless of them to tell this to a patient, let alone one recovering from an eating disorder. I'm sorry you've got to hear this. They clearly see EDs as only a matter of weight and it's totally wrong. You can eat what you want, whenever you want and deserve a life with food freedom.",
          "created_utc": 1661044414.0
        },
        {
          "id": "il5zr7z",
          "author": "Supersaiyan-Dragon",
          "body": "Needed that so badly.\n\nYes was quite shocking, I just ignored it and went home an made an omelette with Eggo waffles for dinner..Breakfast for dinner the best.",
          "created_utc": 1661065537.0
        }
      ]
    }
  ]
}