{
  "id": "wxtl1z",
  "subreddit": "fuckeatingdisorders",
  "author": "fmdkdnxksk",
  "created_utc": 1661471782.0,
  "title": "I wish I could have a disclaimer so people can’t talk about losing weight or not eating in front of me",
  "selftext": "I know it’s bitchy and stupid and selfish but every time someone mentions it I freeze up, I feels like I can’t breathe, and I want to cry lol. I’m in quasi recovery right now and it’s like my brain is hyper aware of these topics. I just purposefully don’t say anything until the subject changes or brush it off entirely.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/wxtl1z/i_wish_i_could_have_a_disclaimer_so_people_cant/",
  "score": 156,
  "num_comments": 13,
  "comments": [
    {
      "id": "iltn6ai",
      "author": "thrxwxxx",
      "body": "same my friend keeps mentioning calories and stuff to me and idk how to tell her to stop 😭 she doesn’t know about my ed so I feel like it’s unfair to expect her to stop without telling her and I don’t want to say anything",
      "created_utc": 1661483172.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ilszr7m",
      "author": "salientmould",
      "body": "I don't think it's stupid or bitchy or selfish at all. In fact, I think it's pretty offensive that diet culture is so prevalent and not only do people buy into it, but lack the self awareness that talking about it so openly is harmful to those with EDs and people in larger bodies.\n\nYou are totally valid in being upset by it and if you need to remove yourself or establish verbal boundaries, you have a world of people who understand and support you in doing so!",
      "created_utc": 1661472345.0,
      "score": 46,
      "context": []
    },
    {
      "id": "ilux259",
      "author": "anniekeepsontrying",
      "body": "Ugghh 100% this. I did ask my mum to a)  not tell me what she eats (because it‘s usually not a lot plus followed by a justification) and b) not to be judgemental towards the foods I eat. \nShe‘s often asked me how she can help me with my ED and that‘s the best way I know how. But a tshirt with these rules would be great haha",
      "created_utc": 1661514878.0,
      "score": 11,
      "context": []
    },
    {
      "id": "iltxoj2",
      "author": "Live-Arm7068",
      "body": "The more time passes with recovery and the more you try to break out of your shell, the easier it is to give boundaries with people talking about weight, diets, etc. I used to freeze up the same way you did. It will get better. The more you break down the mental barriers you have the easier it will be to do this.",
      "created_utc": 1661488934.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ilwankn",
      "author": "JustASadSwiftie",
      "body": "ESPECIALLY IN COLLEGE SUDJBEDIJX",
      "created_utc": 1661535620.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ilxglxf",
      "author": "Elle241",
      "body": "Couldn’t agree more. I also wish I could get my friends to sign something saying that if they ever take a picture with me in it, they will agree to never send it to me and ESPECIALLY never to post it to social media without asking me. So fucking triggering.",
      "created_utc": 1661552613.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iltr2o3",
      "author": "SquashBrave4473",
      "body": "I really struggle with this as well.",
      "created_utc": 1661485170.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ilweq35",
      "author": "vargtimmen68",
      "body": "I have a button maker, as in the pinback kind. I’ve been thinking of making a button that says PLEASE DON’T TALK TO ME ABOUT YOUR DIET or PLEASE DON’T MENTION CALORIE COUNTS TO ME (This in particular is my big trigger.) and putting it on whatever I’m wearing. Although I mostly spend time with my family and friends who either know what I’m going through or just don’t talk about diet stuff that much in the first place (or both).",
      "created_utc": 1661537212.0,
      "score": 2,
      "context": []
    },
    {
      "id": "inyx9m2",
      "author": "zourdough",
      "body": "NO LITERALLY my brain always goes like „its unfair how they can diet or only have one meal a day or forget to eat“ or whatever the fuck the mention while im in recovery and cant ??? it doesnt make sense but fidusklw",
      "created_utc": 1662891413.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ilw472q",
      "author": "petitelinotte212",
      "body": "I def feel this. Maybe we should make tshirts :p",
      "created_utc": 1661533097.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ilu0x7b",
      "author": "Mammoth-Corner",
      "body": "I don't have an ED (I hang around here because I want to help support my girlfriend) and I'm definitely uncomfortable with calorie talk and have asked people not to do it in front of me — you don't need to disclose why to ask someone to stop. A good friend will take 'it makes me very uncomfortable when you talk calories to me, could you avoid it please?' at face value and not demand a note from your doctor.",
      "created_utc": 1661490993.0,
      "score": 31,
      "context": [
        {
          "id": "iltn6ai",
          "author": "thrxwxxx",
          "body": "same my friend keeps mentioning calories and stuff to me and idk how to tell her to stop 😭 she doesn’t know about my ed so I feel like it’s unfair to expect her to stop without telling her and I don’t want to say anything",
          "created_utc": 1661483172.0
        }
      ]
    },
    {
      "id": "ilv39p2",
      "author": "kylestopthrowingfood",
      "body": "This! I didn’t expect my friends and family to have so many eating disorder behaviors that I’m sensitive too!",
      "created_utc": 1661518077.0,
      "score": 5,
      "context": [
        {
          "id": "iltn6ai",
          "author": "thrxwxxx",
          "body": "same my friend keeps mentioning calories and stuff to me and idk how to tell her to stop 😭 she doesn’t know about my ed so I feel like it’s unfair to expect her to stop without telling her and I don’t want to say anything",
          "created_utc": 1661483172.0
        }
      ]
    },
    {
      "id": "ilyor0y",
      "author": "fmdkdnxksk",
      "body": "my roommates are gonna make me relapse 😭😭 i know IM not a good influence when I restrict but at least I have the grace to not talk about it!!!",
      "created_utc": 1661574208.0,
      "score": 1,
      "context": [
        {
          "id": "ilwankn",
          "author": "JustASadSwiftie",
          "body": "ESPECIALLY IN COLLEGE SUDJBEDIJX",
          "created_utc": 1661535620.0
        }
      ]
    }
  ]
}