{
  "id": "wyc8b6",
  "subreddit": "fuckeatingdisorders",
  "author": "kayethx",
  "created_utc": 1661527967.0,
  "title": "Just wanted to share a nice, supportive encounter",
  "selftext": "So I was checking in for a flight in London yesterday, and I had signed up for assistance walking long distances/standing in line.\n\nThe woman checking me in and I had been chatting a lot, about my trip, etc. She told me I looked so \"healthy and vibrant,\" which was really lovely to hear, because I know I've looked very ill a lot over the last year. (This was before she noticed the assistance request on my booking, so she wasn't being passive aggressive or anything.)\n\nWe had chatted enough that when she was clarifying the specifics for the assistance I needed, she asked if it was okay if she asked what health issue I have. I normally don't answer this, but she had been so warm, and seemed to be asking out of actual concern and not out of morbid curiosity or doubt, so I decided to be open. So I told her I was in recovery from anorexia, and my body was still in a place where it gets extremely worn out if I carry heavy things while standing in line, etc.\n\nImmediately, she held out a bag of candy to me, and said, \"Here, have a sweet!\" (And I took it and ate it then, which I could *not* have done a year ago.) And she was so kind, and said all kinds of encouraging things about how healthy I was looking (without every commenting on my body - she said it was an energy thing), and how good it was I was trying to get better and take care of myself, and how wonderful it was, and how much she wanted to share food with me, ha. She gave me tips on how to get food while I was waiting to be assisted (they don't let you stop for food on the way to the gate after they pick you up, so she was letting me know how I could get food first) because she wanted to make sure I could keep eating on my schedule. And when I left, she very warmly said that she hoped I kept taking care of myself and making progress, and that I was doing great things.\n\nIt was so just nice - she wasn't patronizing or dismissive at all; it's so common to get one of those two reactions. Just seemed sincerely concerned, then honestly sad for me that I had been through this and very, very happy and proud I was working on getting better. And she went out of her way to make sure I felt proud of myself too, even though she was about to get in trouble because there was a line and she was taking so long, ha.\n\nBut wanted to share with you all because it was so great to get some real, random support from a stranger! Def made a hard day for me much better!\n\n**As an aside:** If you find you get weak standing for long periods, or trying to walk long distances esp. while handling luggages while in recovery, I definitely recommended signing up for this when you fly! Every airline I've flown with offers it for free - they'll drive you in a car or in a wheelchair, and let you skip all the lines. Super helpful. No one's ever even asked for proof of a health issue, and everyone has been nice about it.\n\n**Edit:** I'm so glad this is making so many of you happy as well!! <3 <3 <3 I thought of this place right after when she was being so kind - I know we all need a pick-me-up sometimes and to be reminded there are some really lovely people out there <3 ",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/wyc8b6/just_wanted_to_share_a_nice_supportive_encounter/",
  "score": 101,
  "num_comments": 7,
  "comments": [
    {
      "id": "ilvuhjd",
      "author": "cassandygee",
      "body": "This made me tear up 😭😭😭 Kindness makes the world go round and this woman showed the F up. Thank you for sharing this story!",
      "created_utc": 1661529358.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ilw0mp0",
      "author": "hopeless2002",
      "body": "I hope nothing but happiness and health to this woman. She's an angel I swear",
      "created_utc": 1661531738.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ilw6b7y",
      "author": "keepyourcrystals",
      "body": "i’m actually crying. that lady is so sweet.",
      "created_utc": 1661533918.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ilw4x0t",
      "author": "petitelinotte212",
      "body": "Why did this make me cry so much? Damn",
      "created_utc": 1661533374.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ilwi43u",
      "author": "AmphibianHappy6541",
      "body": "Oh my god this is so cute",
      "created_utc": 1661538561.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ilxz1au",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1661561088.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ilyvez1",
      "author": "anniekeepsontrying",
      "body": "🥹🥹🥹 what a lovely experience! Potect her at all costs <3",
      "created_utc": 1661578475.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ily63yx",
      "author": "kayethx",
      "body": "Oh no, I'm so so so sorry that happened to you!! You're definitely right - people can be so awful about it once you tell them, which is why I was so hesitant to do it and rarely do it. Ugh that woman sounds like such a horrible nightmare :(",
      "created_utc": 1661564479.0,
      "score": 2,
      "context": [
        {
          "id": "ilxz1au",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1661561088.0
        }
      ]
    }
  ]
}