{
  "id": "wzur2k",
  "subreddit": "fuckeatingdisorders",
  "author": "SLEG48",
  "created_utc": 1661691057.0,
  "title": "Death to keto",
  "selftext": "I cannot BREATHE without seeing people or comments or posts or videos talking about how amazing keto is and how going “sugar-free” helped them and everybody praising them for caring for their body or having discipline. It all has such a judgmental, condescending air to it and it’s one of the things that makes recovery so difficult!\n\nI swear the Internet, ESPECIALLY eating and dieting spaces, would demonize eating a blueberry muffin made with sugar, eggs, butter, and flour. -_-",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/wzur2k/death_to_keto/",
  "score": 267,
  "num_comments": 63,
  "comments": [
    {
      "id": "im4saag",
      "author": "selkieflying",
      "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
      "created_utc": 1661697675.0,
      "score": 143,
      "context": []
    },
    {
      "id": "im4un1m",
      "author": "None",
      "body": "I saw a discussion on social media with someone having a craving for strawberries and people were telling them to \"make it healthy\" by adding tons of heavy cream or to eat cream cheese with strawberry flavored drink mix instead. It is so ridiculous. It's not even supposed to be a general diet for people but for drug resistant epilepsy and only under medical supervision for short bursts because it has a lot of health risks.",
      "created_utc": 1661698674.0,
      "score": 66,
      "context": []
    },
    {
      "id": "im5bvjv",
      "author": "Funky_Lesbian",
      "body": "i will never ever understand how people can put a stick of butter in their coffee and replace bread with cheese but refuse an apple bc it has “too much sugar” lmao like???? bro???",
      "created_utc": 1661705735.0,
      "score": 31,
      "context": []
    },
    {
      "id": "im4euy8",
      "author": "Sareeee48",
      "body": "As someone who used keto to justify my severe restrictions in terms of intake *and* types of food, idk how tf I did it. Everyone says it makes the carb cravings disappear but that was not the case for me **at all**. It also offered me no energy whatsoever. And if it *actually* curbed carb cravings, then why is everyone trying to find keto alternatives to meals reliant on carbs?",
      "created_utc": 1661691185.0,
      "score": 55,
      "context": []
    },
    {
      "id": "im54wpq",
      "author": "YukiHase",
      "body": "My mom did keto for a few years. Watching what she ate would low key disgust me because it was just fatty, artificial, expensive processed crap. She recently stopped because she had high cholesterol levels and felt like shit. After seeing a dietician and going back to more normal healthy foods, she started feeling a lot better, and I’m glad. I’m glad she’s finally eating carbs without guilt after YEARS of telling her it’s ok…",
      "created_utc": 1661702959.0,
      "score": 25,
      "context": []
    },
    {
      "id": "im4q9lt",
      "author": "LadyProto",
      "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
      "created_utc": 1661696828.0,
      "score": 60,
      "context": []
    },
    {
      "id": "im5dvdp",
      "author": "jfkdktmmv",
      "body": "Keto and fasting zealots are so fucking annoying. \n\n“What? Do you know how many carbs are in that bowl of plain pasta? It’s going to spike your blood sugar and cause the next global catastrophe. Not to mention, humans are only meant to eat once a day since we’re hunter gatherers. Anyways, time for me to go hunt and gather some bacon and cream cheese at Trader Joe’s. Want to see my new car?”\n\nThe irony",
      "created_utc": 1661706540.0,
      "score": 20,
      "context": []
    },
    {
      "id": "im4pby1",
      "author": "rileyyj001",
      "body": "I see *SO* many keto pages on IG, and the sheer amount of cheese and meat that these people swear by is unreal. Every single recipe they make is just layers upon layers of fat, grease, oil, 😵‍💫 Like, go on with your bad self, eat however you want, but they demonize ALL carbs and come up with the most ridiculous food swaps and “hacks.” It’s so disordered, but they refuse to believe or accept that. \n\n“How I go keto at Olive Garden—replace the pasta with broccoli in my fettuccine Alfredo!” 🙄 Their focus on changing every single dish to meet their diet is very harmful and takes up so much brain space.",
      "created_utc": 1661696405.0,
      "score": 26,
      "context": []
    },
    {
      "id": "im51bw9",
      "author": "onlyheinzbakedbeans",
      "body": "I had a friend doing keto. Idk how the f* we can congratulate people for doing that. It's not an achievement and most people will go back to their \"usual diet\" within few weeks/months because you can't live a life being on keto. I mean, cauliflower is supposed to be served with rice not TO BE THE RICE. \n\n\nI remember she used to \"save\" to go for drinks after work and she could not even order the drink she wanted but the one that fitted the diet requirements 😭 I was myself in the midst of my ED at that time but keto has never been something I have followed. My love for carbs (even restricted) was too strong to even try that.",
      "created_utc": 1661701497.0,
      "score": 11,
      "context": []
    },
    {
      "id": "im5hf1g",
      "author": "faultierin",
      "body": "Keto for me means being constipated all the time lmao. There is nothing better than fruits and vegetables.",
      "created_utc": 1661707994.0,
      "score": 9,
      "context": []
    },
    {
      "id": "im4hlbm",
      "author": "cassandygee",
      "body": "Preach!! Keto made me extremely sluggish and depressed. So depressed that I had to choose between medication or eating some gd carbs. I think it can really mess up some people’s hormones, females in particular! Not for me, gimme da carbs",
      "created_utc": 1661692626.0,
      "score": 10,
      "context": []
    },
    {
      "id": "im6rrex",
      "author": "happy_bluebird",
      "body": "Heck, those people demonize eating a banana.",
      "created_utc": 1661727518.0,
      "score": 7,
      "context": []
    },
    {
      "id": "im5njdv",
      "author": "shannonpmua",
      "body": "A friend’s ex-boyfriend wouldn’t eat a banana because “it’s sugar” but would happily order a steak with butter. It’s just marketed, fancy disordered eating",
      "created_utc": 1661710488.0,
      "score": 12,
      "context": []
    },
    {
      "id": "im6s5up",
      "author": "happy_bluebird",
      "body": "The Maintenance Phase podcast on keto is fabulous https://podcasts.apple.com/us/podcast/the-keto-diet/id1535408667?i=1000527972412",
      "created_utc": 1661727699.0,
      "score": 5,
      "context": []
    },
    {
      "id": "im7exsb",
      "author": "jessssiicca",
      "body": "YES 👏 I went to a surf shop last weekend to shop and they literally had a Mexican keto cookbook at the register. AT A CLOTHING STORE 🙃 I cant escape it.",
      "created_utc": 1661738572.0,
      "score": 6,
      "context": []
    },
    {
      "id": "inv6398",
      "author": "Forward-Woodpecker-4",
      "body": "How could someone honestly believe drinking heavy cream is healthier than ever eating fruit. Wtf. Your body was not meant to subsist off of only protein and fat, ketosis is literally survival mode ffs you aren’t supposed to live like that. You need fiber and nutrients from fruit and vegetables, you need carbs to survive healthfully. Everyone who says the human body does not need carbs fails to realize being in a state of ketosis is not a lifestyle, it’s your bodies way of using what it can get to survive and not die like wtf. Hello liver problems and constipation….",
      "created_utc": 1662823550.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ip10tit",
      "author": "None",
      "body": "As somebody who’s eaten keto chocolate, I can tell you that stuff is NOT good for you. I’m talking short term not good for you. \n\nOne day I spent the whole day clutching my stomach in intense pain wondering what the hell was wrong with me. I was on a road trip with my friend and it ruined the whole day for me. I thought I was coming down with some severe sickness. I thought I had celiac disease or something.\n\nBut no, it just turned out I’d eaten a large portion of my mum’s keto brownies. If I’d eaten that same portion of sugary brownies I would have been fine. You CANNOT convince me that keto sugar is healthier than normal sugar, when even in the short term it has such massive negative effects.",
      "created_utc": 1663563874.0,
      "score": 4,
      "context": []
    },
    {
      "id": "im6mrai",
      "author": "MissyChevious613",
      "body": "I'm having to go low carb due to some fun new health issues I'm having, it frustrates me that every time I find a recipe that looks good, it's fucking keto. It makes me want to pull my hair out.",
      "created_utc": 1661725265.0,
      "score": 3,
      "context": []
    },
    {
      "id": "im6or42",
      "author": "sunny-beez",
      "body": "And the amount of fiber in low carb and keto products is **insane**. 15g of fiber in a single \"tortilla\"? My ibs could NEVER",
      "created_utc": 1661726159.0,
      "score": 3,
      "context": []
    },
    {
      "id": "inpje92",
      "author": "None",
      "body": "I literally just saw somebody seriously claim you can absorb carbohydrates through brushing your teeth. It’s insane",
      "created_utc": 1662719221.0,
      "score": 3,
      "context": []
    },
    {
      "id": "im5mdl9",
      "author": "None",
      "body": "Keto is a joke. I worked in a gym for close to 15 years, I am so thankful that every trainer and dietician there would very strongly advise against doing that (or really any kind of “dieting”). We always always ALWAYS focused exercise, the portions and balancing the types of foods one was eating. Obviously there are dietary restrictions and all that jazz but overall eating a balanced diet combined with exercise is the best thing most people can do.",
      "created_utc": 1661710015.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m1q08v7",
      "author": "Sharp-Supermarket-72",
      "body": "Do not do this diet 4 months later I am still struggling with potassium imbalance n I got super sick by the grace of God I am recovering slowly stay away from keto",
      "created_utc": 1734024745.0,
      "score": 2,
      "context": []
    },
    {
      "id": "im4wl4j",
      "author": "myceliumfriend",
      "body": "ikr. i just spent 2 months eating massive amounts of carbs ands fats and honestly probably not enough protein bc i wasn't offered it, but i felt better than i have in a long time bc of the sheer fact that i was getting *enough*. idc how many 'portions' of rice i usually ate at mealtimes, i'm unironically guessing about 5. if you need massive amounts of protein and micromanage your intake to try and feel full on as little as possible, you just aren't eating enough and nothing will mask the effects of that.",
      "created_utc": 1661699505.0,
      "score": 32,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        }
      ]
    },
    {
      "id": "im5e0c8",
      "author": "jfkdktmmv",
      "body": "For real, you cannot go wrong eating the “basic” foods that we have always been eating. Does anyone seriously think that plain rice or pasta is somehow bad for them?",
      "created_utc": 1661706595.0,
      "score": 19,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        }
      ]
    },
    {
      "id": "im5vm7s",
      "author": "missamethyst1",
      "body": "For real. And even for the few people for whom some form of keto is actually medically recommended, it always seems to come with huge caveats. At one point, my daughter's neurologist suggested a highly modified keto (basically just lower carb, still including veggies and fruit) diet to see if it would control her seizures before resorting to some medications that can have really horrible side effects, since studies have shown that for some reason lower carb diets can sometimes do this. Even then, they recommended it only for a short term to see how things went. Unless someone falls into the tiny category of people like that, eliminating like 90% of natural foods and also enjoyable foods makes zero sense from either a health or happiness perspective.",
      "created_utc": 1661713815.0,
      "score": 14,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        }
      ]
    },
    {
      "id": "im6lhlf",
      "author": "piginapickle",
      "body": "Yesssss!!!",
      "created_utc": 1661724704.0,
      "score": 2,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        }
      ]
    },
    {
      "id": "kuplv0x",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710353030.0,
      "score": 1,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        }
      ]
    },
    {
      "id": "im5fkwy",
      "author": "None",
      "body": "This is the most ridiculous thing imaginable. Like I get experimenting with various ratios of macros to find what works for your body the best, but to actually believe that heavy cream or strawberry flavored cream cheese is healthier than a plain fruit is pure insanity",
      "created_utc": 1661707237.0,
      "score": 27,
      "context": [
        {
          "id": "im4un1m",
          "author": "None",
          "body": "I saw a discussion on social media with someone having a craving for strawberries and people were telling them to \"make it healthy\" by adding tons of heavy cream or to eat cream cheese with strawberry flavored drink mix instead. It is so ridiculous. It's not even supposed to be a general diet for people but for drug resistant epilepsy and only under medical supervision for short bursts because it has a lot of health risks.",
          "created_utc": 1661698674.0
        }
      ]
    },
    {
      "id": "im5wq01",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1661714279.0,
      "score": 12,
      "context": [
        {
          "id": "im4un1m",
          "author": "None",
          "body": "I saw a discussion on social media with someone having a craving for strawberries and people were telling them to \"make it healthy\" by adding tons of heavy cream or to eat cream cheese with strawberry flavored drink mix instead. It is so ridiculous. It's not even supposed to be a general diet for people but for drug resistant epilepsy and only under medical supervision for short bursts because it has a lot of health risks.",
          "created_utc": 1661698674.0
        }
      ]
    },
    {
      "id": "im5w69v",
      "author": "missamethyst1",
      "body": "Yes!!! That's literally the reason my daughter's pediatric neurologist suggested it-- and even then with tons of caveats. I can't understand why anyone would think it's a healthy idea for a random person, not to mention the negative happiness effects of eliminating so many foods the average person enjoys.",
      "created_utc": 1661714048.0,
      "score": 9,
      "context": [
        {
          "id": "im4un1m",
          "author": "None",
          "body": "I saw a discussion on social media with someone having a craving for strawberries and people were telling them to \"make it healthy\" by adding tons of heavy cream or to eat cream cheese with strawberry flavored drink mix instead. It is so ridiculous. It's not even supposed to be a general diet for people but for drug resistant epilepsy and only under medical supervision for short bursts because it has a lot of health risks.",
          "created_utc": 1661698674.0
        }
      ]
    },
    {
      "id": "im4h57d",
      "author": "SLEG48",
      "body": "Exactly, the effects of my going sugar-free were nothing but lethargy, hunger pangs, and hangriness. In fact, it made carbs 90% of my food intake when I went all in 😭",
      "created_utc": 1661692397.0,
      "score": 13,
      "context": [
        {
          "id": "im4euy8",
          "author": "Sareeee48",
          "body": "As someone who used keto to justify my severe restrictions in terms of intake *and* types of food, idk how tf I did it. Everyone says it makes the carb cravings disappear but that was not the case for me **at all**. It also offered me no energy whatsoever. And if it *actually* curbed carb cravings, then why is everyone trying to find keto alternatives to meals reliant on carbs?",
          "created_utc": 1661691185.0
        }
      ]
    },
    {
      "id": "im4xecm",
      "author": "vargtimmen68",
      "body": "There’s a specific brand of pita bread that I like and the only place they sell it here is a Keto store (I guess because it’s got a reasonable amount of fibre it’s Keto?) and some of the products they sell are just absurd to me. Like there’s no way that a bagel with zero carbs is possibly edible.",
      "created_utc": 1661699854.0,
      "score": 5,
      "context": [
        {
          "id": "im4euy8",
          "author": "Sareeee48",
          "body": "As someone who used keto to justify my severe restrictions in terms of intake *and* types of food, idk how tf I did it. Everyone says it makes the carb cravings disappear but that was not the case for me **at all**. It also offered me no energy whatsoever. And if it *actually* curbed carb cravings, then why is everyone trying to find keto alternatives to meals reliant on carbs?",
          "created_utc": 1661691185.0
        }
      ]
    },
    {
      "id": "im577wd",
      "author": "SLEG48",
      "body": "So glad your mom got out of that and I’m sorry you had to experience that! I feel like mothers are expected to maintain a perfect, slim figure and insane 1200-calorie/restrictive “healthy” diets for the rest of their life, even after going through childbirths and pregnancies. My mother dealt with something similar, although to a lesser extent.",
      "created_utc": 1661703891.0,
      "score": 4,
      "context": [
        {
          "id": "im54wpq",
          "author": "YukiHase",
          "body": "My mom did keto for a few years. Watching what she ate would low key disgust me because it was just fatty, artificial, expensive processed crap. She recently stopped because she had high cholesterol levels and felt like shit. After seeing a dietician and going back to more normal healthy foods, she started feeling a lot better, and I’m glad. I’m glad she’s finally eating carbs without guilt after YEARS of telling her it’s ok…",
          "created_utc": 1661702959.0
        }
      ]
    },
    {
      "id": "im4xvwk",
      "author": "SLEG48",
      "body": "Don’t even get me started on IF -_- It’s just normalized disordered eating. Honestly, who is happy not eating until 12 in the afternoon, then one more time at 6 and never again for the rest of the day. People have been going more and more extreme too- going DAYS without eating and everyone calling it “discipline” and saying they “feel so much better.",
      "created_utc": 1661700058.0,
      "score": 41,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        }
      ]
    },
    {
      "id": "im6nq7k",
      "author": "Emergency-Parsley-51",
      "body": "YES! A doctor who has a TV show in my country preached some weeks ago about how he isn't hungry anymore and that he only eats now to fuel himself and I was like yeaaah, I call that anorexia, but ok. At the worst of my ED, I used to not feel any hunger anymore and ate just to eat into my calorie limit (small number anyways) and usually only untill 4-5 PM. But my body started to give up on me eventually. Everytime I hear about IF, I want to scream.\n\nI'm not from UK, but I've seen how their gouvernment started a campaign on how not eating a.k.a. IF is actually beneficial, just to mask the fact that their economy is on the bricks, with prices going up an insane amount. It's so fucked up.",
      "created_utc": 1661725700.0,
      "score": 9,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        }
      ]
    },
    {
      "id": "im5lvjv",
      "author": "hopeless2002",
      "body": "IF can also fuck up female hormones !! It's highly associated with hypothalamic amenorrhea",
      "created_utc": 1661709808.0,
      "score": 11,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        }
      ]
    },
    {
      "id": "im5hkkd",
      "author": "faultierin",
      "body": "I bet they poop like once a week and spend 1hr on the toilet because of the lack of fiber.  \nWhy cant people just admit that moderation is the best approach to food?",
      "created_utc": 1661708057.0,
      "score": 9,
      "context": [
        {
          "id": "im4pby1",
          "author": "rileyyj001",
          "body": "I see *SO* many keto pages on IG, and the sheer amount of cheese and meat that these people swear by is unreal. Every single recipe they make is just layers upon layers of fat, grease, oil, 😵‍💫 Like, go on with your bad self, eat however you want, but they demonize ALL carbs and come up with the most ridiculous food swaps and “hacks.” It’s so disordered, but they refuse to believe or accept that. \n\n“How I go keto at Olive Garden—replace the pasta with broccoli in my fettuccine Alfredo!” 🙄 Their focus on changing every single dish to meet their diet is very harmful and takes up so much brain space.",
          "created_utc": 1661696405.0
        }
      ]
    },
    {
      "id": "im5c7tz",
      "author": "Funky_Lesbian",
      "body": "right like!! there’s obvi nothing wrong with eating lots of fats because they are a necessary food group, but how are you gonna demonize all carbs and then. do THAT. make it make sense",
      "created_utc": 1661705872.0,
      "score": 6,
      "context": [
        {
          "id": "im4pby1",
          "author": "rileyyj001",
          "body": "I see *SO* many keto pages on IG, and the sheer amount of cheese and meat that these people swear by is unreal. Every single recipe they make is just layers upon layers of fat, grease, oil, 😵‍💫 Like, go on with your bad self, eat however you want, but they demonize ALL carbs and come up with the most ridiculous food swaps and “hacks.” It’s so disordered, but they refuse to believe or accept that. \n\n“How I go keto at Olive Garden—replace the pasta with broccoli in my fettuccine Alfredo!” 🙄 Their focus on changing every single dish to meet their diet is very harmful and takes up so much brain space.",
          "created_utc": 1661696405.0
        }
      ]
    },
    {
      "id": "im6lqaa",
      "author": "firecat321",
      "body": "My sister, who has a long history with disordered eating, is absolutely convinced that her keto diet is responsible for lowering her hereditary high cholesterol. Definitely not her medication, running 6 miles a day and barely eating. She refuses to eat fruit and most veggies, and lives off of monk fruit and cheese. It’s so frustrating.",
      "created_utc": 1661724811.0,
      "score": 5,
      "context": [
        {
          "id": "im4pby1",
          "author": "rileyyj001",
          "body": "I see *SO* many keto pages on IG, and the sheer amount of cheese and meat that these people swear by is unreal. Every single recipe they make is just layers upon layers of fat, grease, oil, 😵‍💫 Like, go on with your bad self, eat however you want, but they demonize ALL carbs and come up with the most ridiculous food swaps and “hacks.” It’s so disordered, but they refuse to believe or accept that. \n\n“How I go keto at Olive Garden—replace the pasta with broccoli in my fettuccine Alfredo!” 🙄 Their focus on changing every single dish to meet their diet is very harmful and takes up so much brain space.",
          "created_utc": 1661696405.0
        }
      ]
    },
    {
      "id": "kobokii",
      "author": "Ketodietworks",
      "body": "100 pounds saved my life. Some do keto and intermittent fasting to control their eating disorders you know obesity? Over eating?",
      "created_utc": 1706729320.0,
      "score": 1,
      "context": [
        {
          "id": "im51bw9",
          "author": "onlyheinzbakedbeans",
          "body": "I had a friend doing keto. Idk how the f* we can congratulate people for doing that. It's not an achievement and most people will go back to their \"usual diet\" within few weeks/months because you can't live a life being on keto. I mean, cauliflower is supposed to be served with rice not TO BE THE RICE. \n\n\nI remember she used to \"save\" to go for drinks after work and she could not even order the drink she wanted but the one that fitted the diet requirements 😭 I was myself in the midst of my ED at that time but keto has never been something I have followed. My love for carbs (even restricted) was too strong to even try that.",
          "created_utc": 1661701497.0
        }
      ]
    },
    {
      "id": "inpkezu",
      "author": "SLEG48",
      "body": "Oh God, tracking the 0.0000000001 amount of sugar and calories in TOOTHPASTE?",
      "created_utc": 1662719951.0,
      "score": 2,
      "context": [
        {
          "id": "inpje92",
          "author": "None",
          "body": "I literally just saw somebody seriously claim you can absorb carbohydrates through brushing your teeth. It’s insane",
          "created_utc": 1662719221.0
        }
      ]
    },
    {
      "id": "kupjdqw",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710352232.0,
      "score": 1,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        },
        {
          "id": "im4wl4j",
          "author": "myceliumfriend",
          "body": "ikr. i just spent 2 months eating massive amounts of carbs ands fats and honestly probably not enough protein bc i wasn't offered it, but i felt better than i have in a long time bc of the sheer fact that i was getting *enough*. idc how many 'portions' of rice i usually ate at mealtimes, i'm unironically guessing about 5. if you need massive amounts of protein and micromanage your intake to try and feel full on as little as possible, you just aren't eating enough and nothing will mask the effects of that.",
          "created_utc": 1661699505.0
        }
      ]
    },
    {
      "id": "im5vwr2",
      "author": "missamethyst1",
      "body": "Sadly they do! Ironic since when scientists have done studies of the populations that have the longest average lifespan, they all happen to be cultural groups whose diets are super high in grains or rice, such as Okinawan people and Ashkenazi Jews.",
      "created_utc": 1661713938.0,
      "score": 18,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        },
        {
          "id": "im5e0c8",
          "author": "jfkdktmmv",
          "body": "For real, you cannot go wrong eating the “basic” foods that we have always been eating. Does anyone seriously think that plain rice or pasta is somehow bad for them?",
          "created_utc": 1661706595.0
        }
      ]
    },
    {
      "id": "kuppzvp",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710354373.0,
      "score": 1,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        },
        {
          "id": "im5vm7s",
          "author": "missamethyst1",
          "body": "For real. And even for the few people for whom some form of keto is actually medically recommended, it always seems to come with huge caveats. At one point, my daughter's neurologist suggested a highly modified keto (basically just lower carb, still including veggies and fruit) diet to see if it would control her seizures before resorting to some medications that can have really horrible side effects, since studies have shown that for some reason lower carb diets can sometimes do this. Even then, they recommended it only for a short term to see how things went. Unless someone falls into the tiny category of people like that, eliminating like 90% of natural foods and also enjoyable foods makes zero sense from either a health or happiness perspective.",
          "created_utc": 1661713815.0
        }
      ]
    },
    {
      "id": "kuqf9xb",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 4 (No diet tips). Please contact the mods if you have any doubts.",
      "created_utc": 1710362663.0,
      "score": 1,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        },
        {
          "id": "kuplv0x",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710353030.0
        }
      ]
    },
    {
      "id": "im61i6n",
      "author": "None",
      "body": "Keto mimics a fasted state - that's why you have to eat pretty much only fat otherwise the body will run on glucose which is important for if you actually need to be in a ketogenic state, like if it's part of a medical diet for epilepsy - but its otherwise really unhealthy and unnecessary but its trendy and people will gladly ignore health and common sense for quick and unsustainable weight loss.",
      "created_utc": 1661716283.0,
      "score": 6,
      "context": [
        {
          "id": "im4un1m",
          "author": "None",
          "body": "I saw a discussion on social media with someone having a craving for strawberries and people were telling them to \"make it healthy\" by adding tons of heavy cream or to eat cream cheese with strawberry flavored drink mix instead. It is so ridiculous. It's not even supposed to be a general diet for people but for drug resistant epilepsy and only under medical supervision for short bursts because it has a lot of health risks.",
          "created_utc": 1661698674.0
        },
        {
          "id": "im5wq01",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1661714279.0
        }
      ]
    },
    {
      "id": "im8z4s4",
      "author": "Elizabitch4848",
      "body": "Fruit or even some veggies. 🙃",
      "created_utc": 1661776718.0,
      "score": 1,
      "context": [
        {
          "id": "im4un1m",
          "author": "None",
          "body": "I saw a discussion on social media with someone having a craving for strawberries and people were telling them to \"make it healthy\" by adding tons of heavy cream or to eat cream cheese with strawberry flavored drink mix instead. It is so ridiculous. It's not even supposed to be a general diet for people but for drug resistant epilepsy and only under medical supervision for short bursts because it has a lot of health risks.",
          "created_utc": 1661698674.0
        },
        {
          "id": "im5wq01",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1661714279.0
        }
      ]
    },
    {
      "id": "kuprgot",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710354865.0,
      "score": 1,
      "context": [
        {
          "id": "im4euy8",
          "author": "Sareeee48",
          "body": "As someone who used keto to justify my severe restrictions in terms of intake *and* types of food, idk how tf I did it. Everyone says it makes the carb cravings disappear but that was not the case for me **at all**. It also offered me no energy whatsoever. And if it *actually* curbed carb cravings, then why is everyone trying to find keto alternatives to meals reliant on carbs?",
          "created_utc": 1661691185.0
        },
        {
          "id": "im4h57d",
          "author": "SLEG48",
          "body": "Exactly, the effects of my going sugar-free were nothing but lethargy, hunger pangs, and hangriness. In fact, it made carbs 90% of my food intake when I went all in 😭",
          "created_utc": 1661692397.0
        }
      ]
    },
    {
      "id": "im5xy0g",
      "author": "GladPen",
      "body": "I acidentally bought keto ice cream a month ago. It is still in my freezer as I tell myself if I get desperate I'll finish it, but honestly, I need to just throw it out. It's the most disgusting thing ever, tastes like cardboard and dead dreams and makes me nauseated.",
      "created_utc": 1661714793.0,
      "score": 11,
      "context": [
        {
          "id": "im4euy8",
          "author": "Sareeee48",
          "body": "As someone who used keto to justify my severe restrictions in terms of intake *and* types of food, idk how tf I did it. Everyone says it makes the carb cravings disappear but that was not the case for me **at all**. It also offered me no energy whatsoever. And if it *actually* curbed carb cravings, then why is everyone trying to find keto alternatives to meals reliant on carbs?",
          "created_utc": 1661691185.0
        },
        {
          "id": "im4xecm",
          "author": "vargtimmen68",
          "body": "There’s a specific brand of pita bread that I like and the only place they sell it here is a Keto store (I guess because it’s got a reasonable amount of fibre it’s Keto?) and some of the products they sell are just absurd to me. Like there’s no way that a bagel with zero carbs is possibly edible.",
          "created_utc": 1661699854.0
        }
      ]
    },
    {
      "id": "im59hfm",
      "author": "YukiHase",
      "body": "Thank you. She used to run/bike a lot when I was a kid (not anymore since she damaged her knee) and ate into the early-mid 2000’s diet fads that made her pretty skinny at the time. Obviously with a middle-aged body that has bared three children, she has put on more weight in more recent years. Thankfully I’m glad she wants to lose weight for her health alone and not for the “perfect body”.. I’m helping her in ways that are safe, like by cooking her healthy meals and assisting her with her diet (things I wish I could do for myself >.>). And she doesn’t demonize the occasional cookie or muffin I bake either like she used to. She even recently bought an electric bike so she’s getting out again, going on rides almost daily. \n\nI’m happy for her resilience now and hope she reaches her goals, bc I love her very much and want her here and happy for as long as possible!",
      "created_utc": 1661704794.0,
      "score": 7,
      "context": [
        {
          "id": "im54wpq",
          "author": "YukiHase",
          "body": "My mom did keto for a few years. Watching what she ate would low key disgust me because it was just fatty, artificial, expensive processed crap. She recently stopped because she had high cholesterol levels and felt like shit. After seeing a dietician and going back to more normal healthy foods, she started feeling a lot better, and I’m glad. I’m glad she’s finally eating carbs without guilt after YEARS of telling her it’s ok…",
          "created_utc": 1661702959.0
        },
        {
          "id": "im577wd",
          "author": "SLEG48",
          "body": "So glad your mom got out of that and I’m sorry you had to experience that! I feel like mothers are expected to maintain a perfect, slim figure and insane 1200-calorie/restrictive “healthy” diets for the rest of their life, even after going through childbirths and pregnancies. My mother dealt with something similar, although to a lesser extent.",
          "created_utc": 1661703891.0
        }
      ]
    },
    {
      "id": "im5yi9f",
      "author": "GladPen",
      "body": "Honestly, my ED could be said to mimic IF with how many hrs would go by eating (no idea if I ate enough calories though) and I definitely feel fatigued after eating these days normally, like, my body is healing and repairing itself and I bet if people went back to eating normally their body would do that too. You guys say its healing causing the extreme fatigue and I just wonder if that energized feeling they (I got) get is adrenaline to push us through the deprivation. Now that I eat much more normally, my body is like \"oh, we don't have to release adrenaline anymore, the famine is over and we can sleep.\"",
      "created_utc": 1661715029.0,
      "score": 9,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        },
        {
          "id": "im4xvwk",
          "author": "SLEG48",
          "body": "Don’t even get me started on IF -_- It’s just normalized disordered eating. Honestly, who is happy not eating until 12 in the afternoon, then one more time at 6 and never again for the rest of the day. People have been going more and more extreme too- going DAYS without eating and everyone calling it “discipline” and saying they “feel so much better.",
          "created_utc": 1661700058.0
        }
      ]
    },
    {
      "id": "im4zley",
      "author": "LadyProto",
      "body": "Like keto has some some merit for kids with severe epilepsy. But the way most people use it? Nah, I’m so happy to eat bread and butter again.\n\nIf? IF is just disordered eating promoted as something good. I want pancakes. Lemme have my morning pancakes",
      "created_utc": 1661700778.0,
      "score": 15,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        },
        {
          "id": "im4xvwk",
          "author": "SLEG48",
          "body": "Don’t even get me started on IF -_- It’s just normalized disordered eating. Honestly, who is happy not eating until 12 in the afternoon, then one more time at 6 and never again for the rest of the day. People have been going more and more extreme too- going DAYS without eating and everyone calling it “discipline” and saying they “feel so much better.",
          "created_utc": 1661700058.0
        }
      ]
    },
    {
      "id": "kups6f5",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710355099.0,
      "score": 1,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        },
        {
          "id": "im4xvwk",
          "author": "SLEG48",
          "body": "Don’t even get me started on IF -_- It’s just normalized disordered eating. Honestly, who is happy not eating until 12 in the afternoon, then one more time at 6 and never again for the rest of the day. People have been going more and more extreme too- going DAYS without eating and everyone calling it “discipline” and saying they “feel so much better.",
          "created_utc": 1661700058.0
        }
      ]
    },
    {
      "id": "inv73hn",
      "author": "Forward-Woodpecker-4",
      "body": "IF is the reason why i have hypothalamic amenorrhea. I will never forgive the people preaching that like it is a savior or something",
      "created_utc": 1662823952.0,
      "score": 3,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        },
        {
          "id": "im5lvjv",
          "author": "hopeless2002",
          "body": "IF can also fuck up female hormones !! It's highly associated with hypothalamic amenorrhea",
          "created_utc": 1661709808.0
        }
      ]
    },
    {
      "id": "kupk90c",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).",
      "created_utc": 1710352510.0,
      "score": 1,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        },
        {
          "id": "im4wl4j",
          "author": "myceliumfriend",
          "body": "ikr. i just spent 2 months eating massive amounts of carbs ands fats and honestly probably not enough protein bc i wasn't offered it, but i felt better than i have in a long time bc of the sheer fact that i was getting *enough*. idc how many 'portions' of rice i usually ate at mealtimes, i'm unironically guessing about 5. if you need massive amounts of protein and micromanage your intake to try and feel full on as little as possible, you just aren't eating enough and nothing will mask the effects of that.",
          "created_utc": 1661699505.0
        },
        {
          "id": "kupjdqw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710352232.0
        }
      ]
    },
    {
      "id": "kuqfsnn",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 4 (No diet tips). Please contact the mods if you have any doubts.",
      "created_utc": 1710362834.0,
      "score": 1,
      "context": [
        {
          "id": "im4saag",
          "author": "selkieflying",
          "body": "Any “diet” where you can’t even eat the natural foods that grow out of the ground Is automatically BS and you can’t change my mind  \n\nI will never stop eating fruit, potatoes, rice… carbs are LIFE and NEEDED by the body.",
          "created_utc": 1661697675.0
        },
        {
          "id": "im5vm7s",
          "author": "missamethyst1",
          "body": "For real. And even for the few people for whom some form of keto is actually medically recommended, it always seems to come with huge caveats. At one point, my daughter's neurologist suggested a highly modified keto (basically just lower carb, still including veggies and fruit) diet to see if it would control her seizures before resorting to some medications that can have really horrible side effects, since studies have shown that for some reason lower carb diets can sometimes do this. Even then, they recommended it only for a short term to see how things went. Unless someone falls into the tiny category of people like that, eliminating like 90% of natural foods and also enjoyable foods makes zero sense from either a health or happiness perspective.",
          "created_utc": 1661713815.0
        },
        {
          "id": "kuppzvp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710354373.0
        }
      ]
    },
    {
      "id": "im62pun",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1661716789.0,
      "score": 9,
      "context": [
        {
          "id": "im4un1m",
          "author": "None",
          "body": "I saw a discussion on social media with someone having a craving for strawberries and people were telling them to \"make it healthy\" by adding tons of heavy cream or to eat cream cheese with strawberry flavored drink mix instead. It is so ridiculous. It's not even supposed to be a general diet for people but for drug resistant epilepsy and only under medical supervision for short bursts because it has a lot of health risks.",
          "created_utc": 1661698674.0
        },
        {
          "id": "im5wq01",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1661714279.0
        },
        {
          "id": "im61i6n",
          "author": "None",
          "body": "Keto mimics a fasted state - that's why you have to eat pretty much only fat otherwise the body will run on glucose which is important for if you actually need to be in a ketogenic state, like if it's part of a medical diet for epilepsy - but its otherwise really unhealthy and unnecessary but its trendy and people will gladly ignore health and common sense for quick and unsustainable weight loss.",
          "created_utc": 1661716283.0
        }
      ]
    },
    {
      "id": "kuqfvn3",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).",
      "created_utc": 1710362861.0,
      "score": 1,
      "context": [
        {
          "id": "im4euy8",
          "author": "Sareeee48",
          "body": "As someone who used keto to justify my severe restrictions in terms of intake *and* types of food, idk how tf I did it. Everyone says it makes the carb cravings disappear but that was not the case for me **at all**. It also offered me no energy whatsoever. And if it *actually* curbed carb cravings, then why is everyone trying to find keto alternatives to meals reliant on carbs?",
          "created_utc": 1661691185.0
        },
        {
          "id": "im4h57d",
          "author": "SLEG48",
          "body": "Exactly, the effects of my going sugar-free were nothing but lethargy, hunger pangs, and hangriness. In fact, it made carbs 90% of my food intake when I went all in 😭",
          "created_utc": 1661692397.0
        },
        {
          "id": "kuprgot",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710354865.0
        }
      ]
    },
    {
      "id": "kuqnzfg",
      "author": "Sareeee48",
      "body": "Do not come onto a recovery sub and try to justify a severely restrictive diet. Goodbye.",
      "created_utc": 1710365530.0,
      "score": 1,
      "context": [
        {
          "id": "im4euy8",
          "author": "Sareeee48",
          "body": "As someone who used keto to justify my severe restrictions in terms of intake *and* types of food, idk how tf I did it. Everyone says it makes the carb cravings disappear but that was not the case for me **at all**. It also offered me no energy whatsoever. And if it *actually* curbed carb cravings, then why is everyone trying to find keto alternatives to meals reliant on carbs?",
          "created_utc": 1661691185.0
        },
        {
          "id": "im4h57d",
          "author": "SLEG48",
          "body": "Exactly, the effects of my going sugar-free were nothing but lethargy, hunger pangs, and hangriness. In fact, it made carbs 90% of my food intake when I went all in 😭",
          "created_utc": 1661692397.0
        },
        {
          "id": "kuprgot",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710354865.0
        }
      ]
    },
    {
      "id": "im62kss",
      "author": "vargtimmen68",
      "body": "Do you know anybody who really likes ice cream and who you also really want to pull a mean prank on?",
      "created_utc": 1661716730.0,
      "score": 4,
      "context": [
        {
          "id": "im4euy8",
          "author": "Sareeee48",
          "body": "As someone who used keto to justify my severe restrictions in terms of intake *and* types of food, idk how tf I did it. Everyone says it makes the carb cravings disappear but that was not the case for me **at all**. It also offered me no energy whatsoever. And if it *actually* curbed carb cravings, then why is everyone trying to find keto alternatives to meals reliant on carbs?",
          "created_utc": 1661691185.0
        },
        {
          "id": "im4xecm",
          "author": "vargtimmen68",
          "body": "There’s a specific brand of pita bread that I like and the only place they sell it here is a Keto store (I guess because it’s got a reasonable amount of fibre it’s Keto?) and some of the products they sell are just absurd to me. Like there’s no way that a bagel with zero carbs is possibly edible.",
          "created_utc": 1661699854.0
        },
        {
          "id": "im5xy0g",
          "author": "GladPen",
          "body": "I acidentally bought keto ice cream a month ago. It is still in my freezer as I tell myself if I get desperate I'll finish it, but honestly, I need to just throw it out. It's the most disgusting thing ever, tastes like cardboard and dead dreams and makes me nauseated.",
          "created_utc": 1661714793.0
        }
      ]
    },
    {
      "id": "im93syb",
      "author": "LadyProto",
      "body": "My energy levels did the same. Couldn’t sleep because my body was wanting to go “hunt because of famine”.\n\nIt was a man made famine and I, tho I’m learning to love myself, was an idiot. Lmao",
      "created_utc": 1661779034.0,
      "score": 4,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        },
        {
          "id": "im4xvwk",
          "author": "SLEG48",
          "body": "Don’t even get me started on IF -_- It’s just normalized disordered eating. Honestly, who is happy not eating until 12 in the afternoon, then one more time at 6 and never again for the rest of the day. People have been going more and more extreme too- going DAYS without eating and everyone calling it “discipline” and saying they “feel so much better.",
          "created_utc": 1661700058.0
        },
        {
          "id": "im5yi9f",
          "author": "GladPen",
          "body": "Honestly, my ED could be said to mimic IF with how many hrs would go by eating (no idea if I ate enough calories though) and I definitely feel fatigued after eating these days normally, like, my body is healing and repairing itself and I bet if people went back to eating normally their body would do that too. You guys say its healing causing the extreme fatigue and I just wonder if that energized feeling they (I got) get is adrenaline to push us through the deprivation. Now that I eat much more normally, my body is like \"oh, we don't have to release adrenaline anymore, the famine is over and we can sleep.\"",
          "created_utc": 1661715029.0
        }
      ]
    },
    {
      "id": "kuqgc7e",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post has been removed under moderators’ discretion. You may reach out to the mod team regarding any removals, however keep in mind that the final decision is left to the mod(s).",
      "created_utc": 1710363010.0,
      "score": 1,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        },
        {
          "id": "im4xvwk",
          "author": "SLEG48",
          "body": "Don’t even get me started on IF -_- It’s just normalized disordered eating. Honestly, who is happy not eating until 12 in the afternoon, then one more time at 6 and never again for the rest of the day. People have been going more and more extreme too- going DAYS without eating and everyone calling it “discipline” and saying they “feel so much better.",
          "created_utc": 1661700058.0
        },
        {
          "id": "kups6f5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710355099.0
        }
      ]
    },
    {
      "id": "inv7p4n",
      "author": "hopeless2002",
      "body": "Sameee (well had not have). I lost my period twice during my ED years and both were when I did IF",
      "created_utc": 1662824190.0,
      "score": 4,
      "context": [
        {
          "id": "im4q9lt",
          "author": "LadyProto",
          "body": "Girl my biggest hate is to IF. Man that messed me up. That’s just anarexia by a different name",
          "created_utc": 1661696828.0
        },
        {
          "id": "im5lvjv",
          "author": "hopeless2002",
          "body": "IF can also fuck up female hormones !! It's highly associated with hypothalamic amenorrhea",
          "created_utc": 1661709808.0
        },
        {
          "id": "inv73hn",
          "author": "Forward-Woodpecker-4",
          "body": "IF is the reason why i have hypothalamic amenorrhea. I will never forgive the people preaching that like it is a savior or something",
          "created_utc": 1662823952.0
        }
      ]
    },
    {
      "id": "im652j8",
      "author": "None",
      "body": "Yep. People with health credentials making a profit out of selling absolute bs and they convince people that they need to cut something out, that this is toxic, that that is toxic, that this diet or one weird trick is the key to weight loss.  I don't blame people for falling for it because there's so much out there but the culture is so fucked up, and all for profit and the ego boosting of handfuls of awful toxic individuals.",
      "created_utc": 1661717770.0,
      "score": 5,
      "context": [
        {
          "id": "im4un1m",
          "author": "None",
          "body": "I saw a discussion on social media with someone having a craving for strawberries and people were telling them to \"make it healthy\" by adding tons of heavy cream or to eat cream cheese with strawberry flavored drink mix instead. It is so ridiculous. It's not even supposed to be a general diet for people but for drug resistant epilepsy and only under medical supervision for short bursts because it has a lot of health risks.",
          "created_utc": 1661698674.0
        },
        {
          "id": "im5wq01",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1661714279.0
        },
        {
          "id": "im61i6n",
          "author": "None",
          "body": "Keto mimics a fasted state - that's why you have to eat pretty much only fat otherwise the body will run on glucose which is important for if you actually need to be in a ketogenic state, like if it's part of a medical diet for epilepsy - but its otherwise really unhealthy and unnecessary but its trendy and people will gladly ignore health and common sense for quick and unsustainable weight loss.",
          "created_utc": 1661716283.0
        },
        {
          "id": "im62pun",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1661716789.0
        }
      ]
    }
  ]
}