{
  "id": "x55fpx",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1662240780.0,
  "title": "Dae have family that just causally say things like “oh I’ve been so good I only ate this today” like stfu I don’t wanna hear that type of stuff constantly :(",
  "selftext": "Just stuff that does not need to be said\n\n“I’m losing weight lately I’m at xx“ \n\n It does my head in both my parents say this type of shit constantly, go on about type of foods and that just things that don’t need to be said. Like I don’t care if you weigh less than me stop talking about it.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/x55fpx/dae_have_family_that_just_causally_say_things/",
  "score": 85,
  "num_comments": 6,
  "comments": [
    {
      "id": "imziyh5",
      "author": "mandanic",
      "body": "Yuuuup 😑. Too many comments to list…so awks trying to ignore or keep changing the topic.",
      "created_utc": 1662246041.0,
      "score": 20,
      "context": []
    },
    {
      "id": "imzsbg6",
      "author": "None",
      "body": "yeah thats cuz diet culture and disordered food habits are very VERY COMMON and encouraged.. especially between the female population. i'd say try and ignore those things and focus on your own wellbeing. ur not them and they are not you. let them live their own lives while you try and improve your own! hugs for u, op 💕",
      "created_utc": 1662250446.0,
      "score": 12,
      "context": []
    },
    {
      "id": "in1axtc",
      "author": "busted3000",
      "body": "Yup! We are recovering into a disordered world and, unfortunately, that often includes many people you know. Diet culture is very prevalent.",
      "created_utc": 1662284559.0,
      "score": 7,
      "context": []
    },
    {
      "id": "in1bnxm",
      "author": "vincentvanghosts",
      "body": "Yes unfortunately:( \n\n\nMy mother also does this thing where she'll stare at my body for a few moments when we first meet and then say something like \"you've lose weight! Great job, you're so skinny\" or \"I know you've been feeling insecure because of your weight gain\" when I've literally not said anything and sometimes didn't even gain weight (not like it matters either way)\n\n\nMy late grandmother did the same thing. My dad and one of my brothers also regularly talk about whatever diet or weight loss trend theyre trying, so the disordered eating in my family runs deep\n\n\nIf you have a comfortable relationship with any of your family members, I'd recommend telling them that this type of speech bothers you and you don't want to hear it. You don't owe anyone an explanation as to why - if they're a decent person, they should respect that. I've had luck with saying this with friends and my sister-in-law, but not everyone has been receptive -- I'd still say it's worth a shot if you have a safe and comfortable space to do so \n\n\nI'm really sorry you're experiencing this regardless and hope that you realize that recognizing this type of speech is fucked up is a huge feat in itself, not that this makes it any better ♡",
      "created_utc": 1662285173.0,
      "score": 3,
      "context": []
    },
    {
      "id": "in25r7u",
      "author": "Vikkkiiix",
      "body": "Yep! Friends too, it is EVERYWHERE 😔",
      "created_utc": 1662302614.0,
      "score": 2,
      "context": []
    },
    {
      "id": "in1g9br",
      "author": "wendy125",
      "body": "NO ONE wants to hear that.",
      "created_utc": 1662288921.0,
      "score": 1,
      "context": []
    }
  ]
}