{
  "id": "xgcrok",
  "subreddit": "fuckeatingdisorders",
  "author": "lmkast",
  "created_utc": 1663389590.0,
  "title": "STOP DEMONIZING FATNESS",
  "selftext": "I grew up a fat kid. I always hated myself so much because diets didn’t work for me. Eventually tho I realized starvation did. I became anorexic and finally managed to loose all that weight. \n\nEveryone was so proud of me and it felt so good to finally be validated. It’s so hard to want to recover when everyone acts like your anorexia is the best thing that ever happened to you.\n\nAlmost every anorexic is terrified of the idea of getting fat from recovering. As someone who had been fat their whole life, I knew for a fact if I started eating normally again I wouldn’t just get to a “normal” BMI and stop. I’ve noticed through my recovery process that so many people reassure each other that they’re not going to be fat if they stop restricting. I understand how that helps some people in a way, but understand how that made my recovery so much harder. \n\nEven in the context of eating disorder recovery, being fat was still being demonized. I’ve been in recovery for over a year and a half now and am still gaining weight. I’ve felt like such a failure and know that a lot of people in my life think that about me too. They just see that I was skinny and now I’m not. They don’t care to think that maybe there’s a reason for that. And I expect that from the world, but frankly I want better from you guys. \n\nIf having an ED teaches you anything it’s that skinny doesn’t mean healthy. Please stop reassuring each other that you won’t get fat and instead reassure each other that if you do get fat that’s ok. Despite what diet culture wants you to believe, you can be fat, healthy, and happy all at the same time.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/xgcrok/stop_demonizing_fatness/",
  "score": 194,
  "num_comments": 12,
  "comments": [
    {
      "id": "iosa964",
      "author": "Sareeee48",
      "body": "I am watching over this thread to make sure everyone is adhering to rule 6 (no fatphobia).",
      "created_utc": 1663414655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ioset42",
      "author": "BedroomImpossible124",
      "body": "I have the utmost admiration for you , the strength it took for you to recover and honor the needs of your body is tremendous 💪. We can never know by looking at someone what their life is like, what hardships, joy and pain they have experienced or are experiencing.  That is why we must always treat everyone with respect and kindness.  Thank you for the reminder.  Wishing you peace and happiness 🧡",
      "created_utc": 1663417470.0,
      "score": 27,
      "context": []
    },
    {
      "id": "iosp0gs",
      "author": "YoullNeverWalkAl0ne",
      "body": "These adverts of things to do with dieting or hiding any type of fat that I keep getting pop up on every social media platforms need to stop.\n\nIt's ridiculous how you can't get away from this shit even though you want to.",
      "created_utc": 1663422825.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ioro209",
      "author": "ForestRagamuffin",
      "body": "thank you! i don't really have anything to add, but thank you for bringing more fat acceptance to this sub 💚 all bodies are good bodies!",
      "created_utc": 1663397411.0,
      "score": 35,
      "context": []
    },
    {
      "id": "ioshpvn",
      "author": "mandanic",
      "body": "Thank you, I needed this reminder this morning. I am months into my longest period of recovery and started it already in a body that was above my pre-ed weight. It’s been hard, uncomfortable. But I’m so happy to have been working on my fear of weight gain the whole time, bc it really is not the worst thing in the world. It’s different than what I’m used to sure. Some people may think negative of me sure. That’s their problem. I am the most ok with it I’ve ever been and I am still gaining. I’m at a place I’ve never been and it’s better than the depths of binging and purging anyyyy day of the week. I can live my life in this body. Say yes to social events and dinners with family in this body. I can travel, work, laugh, enjoy life. My body is able, it can move, it’s still healthy. I am grateful for that. Healthy and happy is 100% the best “look” over skinny. Proud of you!",
      "created_utc": 1663419124.0,
      "score": 14,
      "context": []
    },
    {
      "id": "iorqphs",
      "author": "silentnatalie",
      "body": "I definitely feel this. I have had food binges as a child and I was obese. I ate food like crazy due to my house life and during middle school, for the bullying I suffered for being fat. Then I came to realize that maybe no one liked me in middle school and high school because I was fat.\n\nOf course, instead of going the \"healthy\" route, I developed anorexia sub binge/purge at 14. As I started to loose the weight, people treated me better. Then it got to a point where people even complimented me and were kind. \n\nNow at 20, I decided to get help. I've only been in recovery for about 4 months, or quasi recovery, because I'm afraid of what will happen if I look fat again. \n\nIt triggers me to read the \"oh you have internalized fat phobia\" because no. I don't hate fat people. I don't hate anyone. I just hate what I will become. I hate that I'll go back to the place where I once was, and how I was treated. \n\nI'm afraid of all these things, and I'm afraid I'll go back to looking like what I was and be shunned forever again. \n\nNot even being \"skinny\" made me feel better. My bone structure is horrible. So no one ever thought I looked sick. \n\nBut I just need to live. and move on from this disorder because it's not really worth the tears and pain anymore.",
      "created_utc": 1663399475.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ios04fh",
      "author": "apismellifera_x",
      "body": "I can understand why that narrative of 'you won't get fat from recovery' is very hurtful to you! I believe it comes from a harm-reduction standpoint, so the idea is if someone still has a lot of body image issues it's still healthier to get them to gain some weight, even if they feel they still need tight control on it.  Being severely underweight is so so bad for your heart and bone health (if you're a cis woman) so often doctors focus on managing that first, with the hope that eventually therapy will pick up the rest of the pieces.  \n\nAs someone recovered from anorexia, I truly believe that most people I know have a somewhat disordered relationship with food (myself included).  It's very hard to attain body-neutrality in a society that pushes thinness, and more insidiously, 'health' (but not really, just the appearance of health).  In an ideal world, fatness would be entirely neutral and not tied up with a load of moralistic bullshit.  However the sad fact is that for most people, that's not massively achievable.\n\nAll this to say, I'm sorry for all of us and I hope that you personally can find peace with your body OP.  You sound like you have wisdom about your journey which is a strong starting point! Good luck!",
      "created_utc": 1663407075.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ios3s97",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1663409911.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ios9u9t",
      "author": "stopquaking",
      "body": "There's empirical evidence to suggest that having a slightly overweight BMI is actually the healthiest BMI. Also mental health is just as important as physical health so suggesting that someone with anorexia recovering into an overweight body isn't okay just because it's not the most physically healthy is inappropriate and harmful.\n\nEdit: spelling\n\nAlso source for study: [https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds](https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds)",
      "created_utc": 1663414385.0,
      "score": 16,
      "context": [
        {
          "id": "ios3s97",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663409911.0
        }
      ]
    },
    {
      "id": "iosa0es",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 6. Please contact the mods if you have any doubts.",
      "created_utc": 1663414497.0,
      "score": 3,
      "context": [
        {
          "id": "ios3s97",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663409911.0
        }
      ]
    },
    {
      "id": "iosb3yv",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1663415223.0,
      "score": 0,
      "context": [
        {
          "id": "ios3s97",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663409911.0
        },
        {
          "id": "ios9u9t",
          "author": "stopquaking",
          "body": "There's empirical evidence to suggest that having a slightly overweight BMI is actually the healthiest BMI. Also mental health is just as important as physical health so suggesting that someone with anorexia recovering into an overweight body isn't okay just because it's not the most physically healthy is inappropriate and harmful.\n\nEdit: spelling\n\nAlso source for study: [https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds](https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds)",
          "created_utc": 1663414385.0
        }
      ]
    },
    {
      "id": "iosbq02",
      "author": "Sareeee48",
      "body": "No report, I removed it because you’re being fatphobic. ☺️",
      "created_utc": 1663415611.0,
      "score": 10,
      "context": [
        {
          "id": "ios3s97",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663409911.0
        },
        {
          "id": "ios9u9t",
          "author": "stopquaking",
          "body": "There's empirical evidence to suggest that having a slightly overweight BMI is actually the healthiest BMI. Also mental health is just as important as physical health so suggesting that someone with anorexia recovering into an overweight body isn't okay just because it's not the most physically healthy is inappropriate and harmful.\n\nEdit: spelling\n\nAlso source for study: [https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds](https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds)",
          "created_utc": 1663414385.0
        },
        {
          "id": "iosb3yv",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663415223.0
        }
      ]
    },
    {
      "id": "iosbz4c",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1663415777.0,
      "score": 1,
      "context": [
        {
          "id": "ios3s97",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663409911.0
        },
        {
          "id": "ios9u9t",
          "author": "stopquaking",
          "body": "There's empirical evidence to suggest that having a slightly overweight BMI is actually the healthiest BMI. Also mental health is just as important as physical health so suggesting that someone with anorexia recovering into an overweight body isn't okay just because it's not the most physically healthy is inappropriate and harmful.\n\nEdit: spelling\n\nAlso source for study: [https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds](https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds)",
          "created_utc": 1663414385.0
        },
        {
          "id": "iosb3yv",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663415223.0
        },
        {
          "id": "iosbq02",
          "author": "Sareeee48",
          "body": "No report, I removed it because you’re being fatphobic. ☺️",
          "created_utc": 1663415611.0
        }
      ]
    },
    {
      "id": "ioscbpa",
      "author": "Sareeee48",
      "body": "Imagine being this angry over not being allowed to shit on fat people, lmao.",
      "created_utc": 1663416001.0,
      "score": 21,
      "context": [
        {
          "id": "ios3s97",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663409911.0
        },
        {
          "id": "ios9u9t",
          "author": "stopquaking",
          "body": "There's empirical evidence to suggest that having a slightly overweight BMI is actually the healthiest BMI. Also mental health is just as important as physical health so suggesting that someone with anorexia recovering into an overweight body isn't okay just because it's not the most physically healthy is inappropriate and harmful.\n\nEdit: spelling\n\nAlso source for study: [https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds](https://www.sciencealert.com/the-healthiest-weight-could-actually-be-overweight-huge-study-finds)",
          "created_utc": 1663414385.0
        },
        {
          "id": "iosb3yv",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663415223.0
        },
        {
          "id": "iosbq02",
          "author": "Sareeee48",
          "body": "No report, I removed it because you’re being fatphobic. ☺️",
          "created_utc": 1663415611.0
        },
        {
          "id": "iosbz4c",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663415777.0
        }
      ]
    }
  ]
}