{
  "id": "ximu2u",
  "subreddit": "fuckeatingdisorders",
  "author": "sunflqwers",
  "created_utc": 1663617384.0,
  "title": "100 days of all-in recovery: what i've noticed",
  "selftext": "i used to lurk here a lot during my early recovery days and even posted a bit, and something that always helped me was seeing people's positive recovery updates so i thought i'd share mine now that i've been all-in for 100+ days!! keep in mind that recovery is different for different people, but these are just some of the things, both big and small, that i've noticed in my life:\n\n1) i am no longer obsessed with food. back in my ED days, i'd spend hours and hours (literally all of my free time) thinking about food, whether it be obsessively scrolling through food blogs, watching wieiad videos, planning meals, and even going on grocery store websites to look for products i'd never buy. even during the first few months of recovery, i consumed so much recovery content that was centered around food. now, all that stuff occupies a fraction of my mind. i still love to cook, but it's not the center of my life anymore - in fact, i can't really do it since i'm in a dorm at college, and that is fine! \n\n2) i no longer fixate on what other people are eating. in the past, so much of my brain was taken over by overanalyzing what everyone else was eating at any given time. i'd get incredibly angry if i saw someone eat less than me; deep down, it felt like i was not getting their permission to eat. i know it's been said time and time again, but once you are not in energy deficit, your brain does not constantly latch onto other people's energy intake. i'd love to say i could not care less, but parts of my brain still give fucks, if you will, at times, though it's far easier to push those thoughts aside though.\n\n3) not all changes are big. i no longer have the need to get up immediately after any meal - in fact if i do, i feel queasy. somedays i want a late night snack and sometimes i don't. i can't really eat \"intuitively\" yet, but it's easier to recognize hunger and fullness. i like mushrooms now. my \"embarrassing\" fandom interests are back. my fashion sense has changed, my taste in books has changed, and i prefer different perfume scents now. \n\n4) i've come to realize that having an eating disorder never made me more \"productive\". for a long time, i thought my single-minded eating disordered brain was just better and more accepted by the systems of this world, and honestly? maybe that's even a bit true. i could churn out loads of words and do the ritualistic things and follow routines so ingrained in the status quo - wake up, work out, do work - but that, to me, is not a joyful or celebratory way of living and learning. my mind works in different ways; i learn through different media, and not necessarily the ones idealized by our dominant cultures. recovery has brought back the constant clusterfuck in my mind, as well as my personality. i have interests and more importantly, the desire to have a *life* beyond the plastic, artificual stuff so often seen in the media. i am a bit socially awkward and love nature and tea and books; i read fanfiction and convoluted academic jargon simultaneously. i like astronomy and linguistics, picture books and genetics, and enjoy things that make my mind work (like puzzles, my latest hobby). and that's fine! that's who i am, and ultimately, who i will choose.\n\n5) diet culture will probably always be in this world for as long as i'm in it, in whatever insidious form it takes or disguise it adopts. that is always going to be a part of this world that i am just not compatible with. i have had to make my peace with the fact that while i wish i could just permanently avoid diet culture and disordered eating in my external environment forever, i simply can't. it's hard when fatphobia and diet culture have permeated pretty much most institutions out there. it's easier said than done, but at some point you will have to develop a resiliency to it. i am nowhere near that point; while i can look at something diet-y and tell myself \"that's absolute bullshit\", i am still human. i still have emotions and associations in my head that i don't have control over. i'm not sure if, in queen tabitha farrar's example, i'll ever be able to walk into a dieting convention and not get affected by it, but it's something i'm working towards and probably will have to work towards for the rest of my life.\n\n6) recovery does not solve everything. there seems to be a recurring narrative, at least from the online recovery community that i observed, that recovery makes your life all rainbows and sunshine, but that is not true in any capacity, at least in my experience. i am still a person of color, neurodivergent, a lesbian, and a genderqueer person that has to grapple with all the implications of the identities and institutions i cannot change. i still struggle with a smorgasbord of issues, big and small, that i have to get through every day. certainly, having enough energy to make my brain work properly helps with things, but i cannot recover myself out of both systemic and personal issues, and that is another thing i have had to make my peace with. for me, though, recovery will always be worth it, regardless of how many problems it does or does not solve, because it has given me a greater capacity to live.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ximu2u/100_days_of_allin_recovery_what_ive_noticed/",
  "score": 109,
  "num_comments": 9,
  "comments": [
    {
      "id": "ip4kk9r",
      "author": "Gourdon00",
      "body": "Thank you for taking the time to write this. It felt really true, natural, humane and realistically optimistic.\n\nAlso, keep up taking care of yourself!",
      "created_utc": 1663628780.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ip4sslv",
      "author": "boopy_noops",
      "body": "This is so beautiful. Thank you for sharing.",
      "created_utc": 1663632683.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ip4ux1m",
      "author": "piginapickle",
      "body": "This is such a tribute to recovery AND to your strength. Love it! Thanks for posting",
      "created_utc": 1663633675.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ip50ggf",
      "author": "Easy-Opposite-5431",
      "body": "Is this me writing this? I've experienced these same things to a T in my own recovery. Thanks for the great reminder of how, ironically, life is a lot lighter and more carefree without the wrath of the eating disorder. :)",
      "created_utc": 1663636255.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ip5j9ke",
      "author": "ResolutionOk5238",
      "body": "This is a beautiful read. Your last line really hit me. Congratulations OP 💜",
      "created_utc": 1663645568.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ip5nbwz",
      "author": "None",
      "body": "I cannot explain how reassuring this was to read!! I want to print it out and stick it on my wall :D honestly feels like I've lost myself completely, I have no hobbies of interests atm and haven't been able to really enjoy anyof the stuff i used to love in in like a year. It makes recovery so hard when you feel like you don't have a life outside of the ed. But thjs made me feel hopeful <3",
      "created_utc": 1663648100.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ip5tqpk",
      "author": "firecat321",
      "body": "Congratulations on your progress! Thank you so much for sharing your honest experience. It’s super comforting and reassuring, especially to those of us in earlier stages of recovery! You got this!",
      "created_utc": 1663652599.0,
      "score": 4,
      "context": []
    },
    {
      "id": "irjph3i",
      "author": "Lonely-Comparison-71",
      "body": "I’m so proud of you 🥹 thank you for sharing some light and honesty 💛",
      "created_utc": 1665257499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "isx8cn6",
      "author": "AngelMom_2_7",
      "body": "I have considered all-in recovery but I am scared shitless. This post gives me some hope that it might work for me.",
      "created_utc": 1666178311.0,
      "score": 1,
      "context": []
    }
  ]
}