{
  "id": "xl9h7u",
  "subreddit": "fuckeatingdisorders",
  "author": "Thin-Hamster3203",
  "created_utc": 1663871903.0,
  "title": "I’m jealous of the people with EDs that complain about their parents",
  "selftext": "I shouldn’t be jealous of them I don’t wish this on anyone so why do I still feel so fucking jealous when I see posts that are like “my parents keep telling me to eat more” or “ my parents are concerned about me”. God what I wouldn’t give to have anyone in my life care about me like that. I’ve never once gotten a comment from anyone in my family that they are concerned or even care at all. I’m pretty underweight according to my BMI but it just feels like I’m still so fat. If I wasn’t so fat people would notice and care right? \n\nAnyways that’s my rant for the day sorry if it makes no sense",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/xl9h7u/im_jealous_of_the_people_with_eds_that_complain/",
  "score": 89,
  "num_comments": 15,
  "comments": [
    {
      "id": "ipi797a",
      "author": "cassandygee",
      "body": "This is relatable for me. I am old now and live on my own, but what I would have given to have parents that noticed I was sick and needed help. I have gotten through a lot of those thoughts and am mostly grateful to have learned to rely on myself early on, and become the independent badass I am, but idk if that pain will ever fully vanish.",
      "created_utc": 1663873029.0,
      "score": 31,
      "context": []
    },
    {
      "id": "ipiyhe4",
      "author": "gr8thighs",
      "body": "Right!! My whole family was just impressed with me. And when it got really bad, I wasn’t even seeing them anymore. I feel u",
      "created_utc": 1663883876.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ipj5arr",
      "author": "Tertiaritus",
      "body": "During my first bout of ED, I overdosed. Before that dad would make small jokes about my weight when I was still bigger (\"you weigh more than me but my moobs are bigger\").\n\nDuring relapse, he was the first one to get concerned because of that overdose. I yelled at him that everything was normal, I didn't need to eat more, and I was extremely happy back then mom was backing me up. He couldn't really fight it because he'd never yelled back at me.\n\nWhen I started binging, he never said a thing and just tried doing something to involve me in healthier habits - going fishing with him or accompanying me during exercises outside. Mom on the other hand chastised me for the fact my stomach was always sticking out full of food because people would surrender seats on subway thinking I'm pregnant.\n\nI am eternally guilty for yelling at him back then and not recognizing how valuable it was that he was so concerned. And I'll never understand why it was only one person out of two.",
      "created_utc": 1663887025.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ipjd9sx",
      "author": "None",
      "body": "Yep. Realising that my mom fought me about every single thing I wanted to do for myself except losing weight when I was already skinny as a 13 year old is what crushed me. She would buy me diet shakes and everything, but supporting any other choice? Fat chance.",
      "created_utc": 1663890944.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ipi5fgn",
      "author": "None",
      "body": "i feel this every day!!",
      "created_utc": 1663872336.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ipjgne3",
      "author": "Spectrachic311311",
      "body": "Me too. My mom is dead and my dad remarried and moved away and barely talks to me. Granted I’m older, but it still stings. I think I use ED to tell people that I need to be cared about or something.",
      "created_utc": 1663892622.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ipk7eko",
      "author": "linguinibubbles",
      "body": "I'm in uni and I have a healthy BMI but my parents are convinced I'm fat. At the peak of my eating issues, I hid the duration of my fasts but nothing else. My parents were fine with me fasting (and even encouraged it) and my mom's idea of a whole, fulfilling meal was sometimes just a meat patty and two apple slices. I had to go in for an eating disorder screening and when my parents were asked if they had any concerns about my eating habits, they said I needed to eat less and exercise more.\n\nYeah that was fun to hear.\n\nBy contrast, three of my high school teachers were genuinely concerned. One stocked up on protein bars if I ever needed them, but I was too embarrassed to take him up on the offer. Another clearly had restrictive eating issues and admitted to over-exercising but would regularly try to feed me either fruit, celery, low-cal granola bars, and diet yogurts, which was all I ever saw her eat. The third one is the only adult I've ever met with a clearly sane relationship with food and despite typically being very reluctant to share food, she would give me at least a whole meal's worth of calories every time she fed me. I knew how territorial she was with her food and never asked her for any, yet when she chose to feed me she would always give me so much and the gesture meant a lot.\n\nI have a complicated relationship with my parents so their lack of concern doesn't bother me much, but compared to the concern I got from high school teachers who were in no way obligated to make sure I ate, it's a little sad.",
      "created_utc": 1663906602.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ipkr7oi",
      "author": "Littlebittle89",
      "body": "OP, I you can have a version of yourself who acts as a parent. This is suggested for people with childhood truama and it really does help to re-parent yourself. \n\nI am a mother, and while not your mother, I want to assure you that you are worthy on your own merit. your body is your home and should be treated with kindness (this is the work). You deserve a life of peace, and the ability to enjoy food without all of the issues it brings up. \n\nI am holding space for you. This is hard and you are so brave. I am proud of you and I hope you are proud of you too",
      "created_utc": 1663922920.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ipkhnq1",
      "author": "KurapikaKurtaAkaku",
      "body": "I feel like that too",
      "created_utc": 1663914190.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ipla8je",
      "author": "hopeless2002",
      "body": "I feel this. My dad never showed concern and it makes me feel so invalid",
      "created_utc": 1663937269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ipj7xoq",
      "author": "cassandygee",
      "body": "Sending you a hug",
      "created_utc": 1663888311.0,
      "score": 5,
      "context": [
        {
          "id": "ipj5arr",
          "author": "Tertiaritus",
          "body": "During my first bout of ED, I overdosed. Before that dad would make small jokes about my weight when I was still bigger (\"you weigh more than me but my moobs are bigger\").\n\nDuring relapse, he was the first one to get concerned because of that overdose. I yelled at him that everything was normal, I didn't need to eat more, and I was extremely happy back then mom was backing me up. He couldn't really fight it because he'd never yelled back at me.\n\nWhen I started binging, he never said a thing and just tried doing something to involve me in healthier habits - going fishing with him or accompanying me during exercises outside. Mom on the other hand chastised me for the fact my stomach was always sticking out full of food because people would surrender seats on subway thinking I'm pregnant.\n\nI am eternally guilty for yelling at him back then and not recognizing how valuable it was that he was so concerned. And I'll never understand why it was only one person out of two.",
          "created_utc": 1663887025.0
        }
      ]
    },
    {
      "id": "ipkc6mp",
      "author": "black_kyanite",
      "body": "My mom always did that too. It was horrifying. She'd always give me diet pills and tell me about the diets she was on. She once lost a lot of weight as a result from serious illness and said, \"you don't like when I'm thinner than you.\" Ooooookay Mom! Never even had that thought.",
      "created_utc": 1663909926.0,
      "score": 5,
      "context": [
        {
          "id": "ipjd9sx",
          "author": "None",
          "body": "Yep. Realising that my mom fought me about every single thing I wanted to do for myself except losing weight when I was already skinny as a 13 year old is what crushed me. She would buy me diet shakes and everything, but supporting any other choice? Fat chance.",
          "created_utc": 1663890944.0
        }
      ]
    },
    {
      "id": "ipkhp9w",
      "author": "KurapikaKurtaAkaku",
      "body": "This!!",
      "created_utc": 1663914226.0,
      "score": 3,
      "context": [
        {
          "id": "ipjd9sx",
          "author": "None",
          "body": "Yep. Realising that my mom fought me about every single thing I wanted to do for myself except losing weight when I was already skinny as a 13 year old is what crushed me. She would buy me diet shakes and everything, but supporting any other choice? Fat chance.",
          "created_utc": 1663890944.0
        }
      ]
    },
    {
      "id": "ipojen7",
      "author": "None",
      "body": "Ugh I feel you and I'm sorry. That's so awful of her.",
      "created_utc": 1663993555.0,
      "score": 2,
      "context": [
        {
          "id": "ipjd9sx",
          "author": "None",
          "body": "Yep. Realising that my mom fought me about every single thing I wanted to do for myself except losing weight when I was already skinny as a 13 year old is what crushed me. She would buy me diet shakes and everything, but supporting any other choice? Fat chance.",
          "created_utc": 1663890944.0
        },
        {
          "id": "ipkc6mp",
          "author": "black_kyanite",
          "body": "My mom always did that too. It was horrifying. She'd always give me diet pills and tell me about the diets she was on. She once lost a lot of weight as a result from serious illness and said, \"you don't like when I'm thinner than you.\" Ooooookay Mom! Never even had that thought.",
          "created_utc": 1663909926.0
        }
      ]
    },
    {
      "id": "ipp0i5n",
      "author": "black_kyanite",
      "body": "Right? I saw a picture of myself when I was 11 and said, \"wow I was so skinny.\" And she said, \"well you were really active back then.\" Truthfully, I was really prepubescent back then. And the insinuation that I could get back my 11 year old body if I could just work out enough was too much for me.\n\nThis next paragraph needs a TW: really scary diet talk \n\n>!The last straw was when she did the HCG diet. She was trying to lose 40 pounds in 40 days. And insisted that removing all fat from her diet, drinking 80 oz of sparkling water every day, and refusing to use skin care products, all while taking hormones to trick her body into thinking it was pregnant was the way to do it. I don't even know if it worked or not. She told me she was doing that shit and I had to immediately cut her out of my life for a year.!<",
      "created_utc": 1664006610.0,
      "score": 2,
      "context": [
        {
          "id": "ipjd9sx",
          "author": "None",
          "body": "Yep. Realising that my mom fought me about every single thing I wanted to do for myself except losing weight when I was already skinny as a 13 year old is what crushed me. She would buy me diet shakes and everything, but supporting any other choice? Fat chance.",
          "created_utc": 1663890944.0
        },
        {
          "id": "ipkc6mp",
          "author": "black_kyanite",
          "body": "My mom always did that too. It was horrifying. She'd always give me diet pills and tell me about the diets she was on. She once lost a lot of weight as a result from serious illness and said, \"you don't like when I'm thinner than you.\" Ooooookay Mom! Never even had that thought.",
          "created_utc": 1663909926.0
        },
        {
          "id": "ipojen7",
          "author": "None",
          "body": "Ugh I feel you and I'm sorry. That's so awful of her.",
          "created_utc": 1663993555.0
        }
      ]
    }
  ]
}