{
  "id": "xm26mj",
  "subreddit": "fuckeatingdisorders",
  "author": "YoullNeverWalkAl0ne",
  "created_utc": 1663950483.0,
  "title": "The toxic fasting culture",
  "selftext": "No it's not healthy to not eat, you really think cavemen wouldn't fucking stuff their faces everyday if they were surrounded by food? And even if cavemen did go periods without eating you don't think that thousands of years with food at our fingertips we haven't evolved past that by now?\n\nIt's such a toxic, harmful culture that has somehow swept over the internet. Trying anything to limit their hunger so they can stay as small as possible or lose as much fat as possible.\n\nFuck everything about it",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/xm26mj/the_toxic_fasting_culture/",
  "score": 167,
  "num_comments": 33,
  "comments": [
    {
      "id": "ipmf3pu",
      "author": "None",
      "body": "What’s the likelihood we was snacking on berries and bugs through the day anyway? Pretty high I’d imagine",
      "created_utc": 1663956153.0,
      "score": 64,
      "context": []
    },
    {
      "id": "ipn0hns",
      "author": "None",
      "body": "I’m part of an intermittent fasting for women Facebook group- initially joined it for inspiration, now I’ve stayed out of morbid fascination. It’s eating disorder behaviour re packaged as intermittent fasting- and as soon as anyone calls someone out on it they get kicked out of the group! They competitively do long lasts (like 48-72 hours), or do OMAD where they show their one meal as a tiny burrito that they only managed half of because they “felt too full and too amazing after fasting for so long”. \n\nThere’s one woman who pretty much does daily accountability posts who is pretty toxic tbh- if you call her out on some of the behaviours she’s promoting or pointing out that something is dangerous- she quotes “research” (a YouTube video everyone MUST watch), that she is doing this for longevity and autophagy benefits and not for aesthetic reasons  (but posts side by side selfies every day and photos of her scale and weight loss graphs)- and worst of all- boasts about going to theme parks and holidays with her kids but being able to “stay strong” and not “indulge” by not eating with them and that everyone else should remember to not break their fasts because they’re stronger than that… I do wonder what those kids will internalise about eating when they remember that mummy only ate once every 2-3 days even on holiday…\n\nOk. Rant over. Thanks for bringing it up and letting me vent ! 😊",
      "created_utc": 1663965670.0,
      "score": 48,
      "context": []
    },
    {
      "id": "ipm3plm",
      "author": "Sareeee48",
      "body": "You call it fasting\n\nI call it ✨chic anorexia✨\n\nNo but seriously I 1000% agree. Calling it fasting was what lead me to denying my obvious eating disorder for years.",
      "created_utc": 1663951172.0,
      "score": 122,
      "context": []
    },
    {
      "id": "ipmspb4",
      "author": "garlicgirI",
      "body": "On top of all that diet culture bs another thing thats not really talked about is that all the \"benefits\" of fasting were only found in studies done with men so as woman fasting can mess with your hormone levels rlly bad!!!",
      "created_utc": 1663962197.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ipmsmx8",
      "author": "black_kyanite",
      "body": "Yeah, unless you're observing Ramadan or it's for medical reasons. \n\nI've done so many stupid kinds of fasting. Intermittent fasting. Juice fasting. Fat fasting. That was fun. 5 meals a day, 200 calories each, >80% fat. What are you having for lunch? Oh gee I just can't decide between two pieces of bacon or 1/3 cup macadamia nuts. How about mixing ground flax seeds with heavy cream. DELICIOUS. The only thing worse than that was the juice fast. It was even fewer calories and I just wanted to find the nearest living thing and kill it.",
      "created_utc": 1663962167.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ipm9p85",
      "author": "throwaway787878786",
      "body": "“that’s how our ancestors lived” yeah Cindy but the average life expectancy of human beings went past 50 only in fucking 1950. people in the 1910s thought smoking was healthy so why would you take use human beings (who weren’t even the same species as us yet) as examples for health?",
      "created_utc": 1663953794.0,
      "score": 48,
      "context": []
    },
    {
      "id": "ipmg9f9",
      "author": "linguinibubbles",
      "body": "I think one of the most fucked up impacts it had on me is that even though it's been months since I last fasted, I'm still constantly having to remind myself that food isn't optional and yes i do need to ingest things to survive. The bananas week(s)-long fasts populating the fasting sub as well as my mom's insistence that fasting was the key to good health messed me up far more than I expected.",
      "created_utc": 1663956670.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ippfaks",
      "author": "None",
      "body": "They also act as if cavemen weren’t spending their whole day searching for food. They weren’t like “another fasting day for me!”",
      "created_utc": 1664019106.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ipojqh7",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1663993774.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ippiutq",
      "author": "isaacww__",
      "body": "Yep and not only that the “intermittent fasting” thing is literally proven to be bad for afab people who is pre menopause and not only that, in what world is it normal and healthy to literally only have time to eat 1-2 meals a day (no matter how big it is)?!! The only thing that thing does is fuck up peoples hunger cues, which probably is the point. But that’s literally a free way to the eating disorder train, specifically the binge-restrict cycle but that’s just gonna get normalized.",
      "created_utc": 1664021518.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ippoi2o",
      "author": "shiroyagisan",
      "body": "My mum's ex was constantly telling me about the benefits of fasting and how good it would be for me to fast, after I told him I have an eating disorder. He claimed that fasting could cure cancer as well as a myriad of other illnesses. Again, I have an eating disorder. Fasting is just structured restriction. It's going to make me worse. Dude would not stop going on about it.",
      "created_utc": 1664024906.0,
      "score": 6,
      "context": []
    },
    {
      "id": "iq09cl5",
      "author": "Beautiful_Welder_616",
      "body": "I fell into alternate day fasting to help lose the weight I gained on psych meds and the fasting 'support groups' are like Pro ana but socially acceptable if I wasn't already in treatment and didn't have a great connection with my psych and therapist stuff could've gotten really dark.  \n\nFasting groups are the MLM of Dieting fr",
      "created_utc": 1664219027.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ipn415y",
      "author": "cinny_bunn",
      "body": "Diet culture in general I horse shit and is designed to make you feel insecure and bad about yourself, not a day goes by where I think back to how underweight I was and wishing I could go back but then realising how miserable I was eating 1 egg every couple of days I’d rather not go back so I know how miserable these people are who “fast” it’s not a diet it’s just an eating disorder or an introduction to one.",
      "created_utc": 1663967218.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ipne86d",
      "author": "terranumeric",
      "body": "Every diet fad is annoying. Few years ago keto was the thing and everyone tried to force keto on others. Carbs are evil, we aren't meant to eat wheat that much, look out our canines! There was a detox period, really fun to consume all the magic foods that get the toxins out of your body.. god and a cabbage diet that was so freaking popular for a while where I live. Who in their right mind eats cabbage for weeks and only that .  .\n\nNow it's fasting. 16:8, 20:4, OMAD etc. \nJust let people eat how they want. I don't eat breakfast, technically I do 16:8, just I don't look at the time, don't mind if I eat later or earlier and don't freak out if my eating window closes. But I do feel better morning/noon if I don't eat. Clearer mind, more energy and zero hunger until lunch. There are studies for and against fasting.\n But I would never tell anyone to skip breakfast because it works for me. And I am sick and tired of people telling me that breakfast is the most important meal if the day. Yes the Kellogg's study says that but I wonder why.\nEveryone should just do what works for them.. if they can figure it out and it's not actually unhealthy.\n\nI honestly think the keto crowd is pissing me off more than the fasting andys. Eating a block of cheese and a pound of bacon a day really sounds amazing... and no, cauliflower pizza will never be as good as a normal pizza. And I believe everyone who thinks pizza crust out of tuna is remotely ok absolutely has a eating disorder.\nEat what ever the fuck you want but stop telling me how amazing it is and how carbs are slowly killing me.",
      "created_utc": 1663971838.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ipn6a7m",
      "author": "candycanes12346",
      "body": "My mom who’s diabetic does intermittent fasting at the recommendation of her doctor and she’s monitored closely and it seems to manage her diabetes fairly well. \n\nMy issue is she’ll stick to the “times” she’s “allowed/supposed” to eat so closely that she can feel her sugar dropping and she still won’t let herself eat yet. It really bothers me. But also I guess I’m not her doctor so what do I know.",
      "created_utc": 1663968224.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ipxgv3e",
      "author": "thanksfortalking",
      "body": "THANK YOU",
      "created_utc": 1664163467.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ipm4hsq",
      "author": "YoullNeverWalkAl0ne",
      "body": "I feel when I started with that intermittent fasting shite is when my ED really took a hold and progressed. It's so toxic yet they play it off as the most natural thing ever, especially the long fasters who bring up all the 'facts' about its what cavemen used to do but then have to prime their body with broth before they can break their fast in order to not do themselves damage?!",
      "created_utc": 1663951508.0,
      "score": 41,
      "context": [
        {
          "id": "ipm3plm",
          "author": "Sareeee48",
          "body": "You call it fasting\n\nI call it ✨chic anorexia✨\n\nNo but seriously I 1000% agree. Calling it fasting was what lead me to denying my obvious eating disorder for years.",
          "created_utc": 1663951172.0
        }
      ]
    },
    {
      "id": "ipn19yy",
      "author": "None",
      "body": "THIS!! But try and point this out to women who intermittent fast and watch your head get sliced open. I once brought up that my dietician said that women can intermittent fast maybe 16:8 a couple of times a week, but anything more than that it really messes up the hormones- for fertile women and it’s even worse for those in menopause- it caused an uproar which was quite amusing",
      "created_utc": 1663966007.0,
      "score": 12,
      "context": [
        {
          "id": "ipmspb4",
          "author": "garlicgirI",
          "body": "On top of all that diet culture bs another thing thats not really talked about is that all the \"benefits\" of fasting were only found in studies done with men so as woman fasting can mess with your hormone levels rlly bad!!!",
          "created_utc": 1663962197.0
        }
      ]
    },
    {
      "id": "ipndeii",
      "author": "YoullNeverWalkAl0ne",
      "body": "Well I'm a fella so if fasting is boosting my testosterone I doubt being underweight is doing it a lot of good",
      "created_utc": 1663971452.0,
      "score": 4,
      "context": [
        {
          "id": "ipmspb4",
          "author": "garlicgirI",
          "body": "On top of all that diet culture bs another thing thats not really talked about is that all the \"benefits\" of fasting were only found in studies done with men so as woman fasting can mess with your hormone levels rlly bad!!!",
          "created_utc": 1663962197.0
        }
      ]
    },
    {
      "id": "ipn9ige",
      "author": "kylemikahel",
      "body": "You reminded me of a 50's cigar ads that pointed smoking during pregnancy was a good thing bc makes the baby slim and easy to give birth lol",
      "created_utc": 1663969665.0,
      "score": 23,
      "context": [
        {
          "id": "ipm9p85",
          "author": "throwaway787878786",
          "body": "“that’s how our ancestors lived” yeah Cindy but the average life expectancy of human beings went past 50 only in fucking 1950. people in the 1910s thought smoking was healthy so why would you take use human beings (who weren’t even the same species as us yet) as examples for health?",
          "created_utc": 1663953794.0
        }
      ]
    },
    {
      "id": "kah5fmz",
      "author": "None",
      "body": "i study Stone Age Civilization Theory (caveman stuff) - and humans didn't even live like that then lol. Like it's waaaaaaaaaaaaaaaaaaaaay more complex but the bottom line is, if we really were starving for the whole of (pre)history we wouldn't be here today.",
      "created_utc": 1700767936.0,
      "score": 1,
      "context": [
        {
          "id": "ipm9p85",
          "author": "throwaway787878786",
          "body": "“that’s how our ancestors lived” yeah Cindy but the average life expectancy of human beings went past 50 only in fucking 1950. people in the 1910s thought smoking was healthy so why would you take use human beings (who weren’t even the same species as us yet) as examples for health?",
          "created_utc": 1663953794.0
        }
      ]
    },
    {
      "id": "ipzz8yx",
      "author": "YoullNeverWalkAl0ne",
      "body": "When I realised I could go a stupid amount of time without eating is when I hit rock bottom. I'd force my ass to go the gym and lift weights not eating I was a shell of a person",
      "created_utc": 1664215134.0,
      "score": 6,
      "context": [
        {
          "id": "ipmg9f9",
          "author": "linguinibubbles",
          "body": "I think one of the most fucked up impacts it had on me is that even though it's been months since I last fasted, I'm still constantly having to remind myself that food isn't optional and yes i do need to ingest things to survive. The bananas week(s)-long fasts populating the fasting sub as well as my mom's insistence that fasting was the key to good health messed me up far more than I expected.",
          "created_utc": 1663956670.0
        }
      ]
    },
    {
      "id": "ippp1os",
      "author": "Sareeee48",
      "body": "Your comment was removed for breaking rule 12. Please contact the mods if you have any doubts.",
      "created_utc": 1664025208.0,
      "score": 1,
      "context": [
        {
          "id": "ipojqh7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1663993774.0
        }
      ]
    },
    {
      "id": "ipppapr",
      "author": "Sareeee48",
      "body": "I usually see the keto crowd mixed in with the fasting crowd, so they both annoy me equally lmao.",
      "created_utc": 1664025348.0,
      "score": 7,
      "context": [
        {
          "id": "ipne86d",
          "author": "terranumeric",
          "body": "Every diet fad is annoying. Few years ago keto was the thing and everyone tried to force keto on others. Carbs are evil, we aren't meant to eat wheat that much, look out our canines! There was a detox period, really fun to consume all the magic foods that get the toxins out of your body.. god and a cabbage diet that was so freaking popular for a while where I live. Who in their right mind eats cabbage for weeks and only that .  .\n\nNow it's fasting. 16:8, 20:4, OMAD etc. \nJust let people eat how they want. I don't eat breakfast, technically I do 16:8, just I don't look at the time, don't mind if I eat later or earlier and don't freak out if my eating window closes. But I do feel better morning/noon if I don't eat. Clearer mind, more energy and zero hunger until lunch. There are studies for and against fasting.\n But I would never tell anyone to skip breakfast because it works for me. And I am sick and tired of people telling me that breakfast is the most important meal if the day. Yes the Kellogg's study says that but I wonder why.\nEveryone should just do what works for them.. if they can figure it out and it's not actually unhealthy.\n\nI honestly think the keto crowd is pissing me off more than the fasting andys. Eating a block of cheese and a pound of bacon a day really sounds amazing... and no, cauliflower pizza will never be as good as a normal pizza. And I believe everyone who thinks pizza crust out of tuna is remotely ok absolutely has a eating disorder.\nEat what ever the fuck you want but stop telling me how amazing it is and how carbs are slowly killing me.",
          "created_utc": 1663971838.0
        }
      ]
    },
    {
      "id": "ipmdzx1",
      "author": "Anti-Diet-Newbie",
      "body": "Saaaaaame. I was dieting before but when I started doing the 5:2 diet everything got so much worse for me. After a few weeks, my brain went 'hey if eating normally on the 5 days makes me lose weight at this speed, eating even less on those days will make me lose weight faster!' Thanks brain!",
      "created_utc": 1663955659.0,
      "score": 20,
      "context": [
        {
          "id": "ipm3plm",
          "author": "Sareeee48",
          "body": "You call it fasting\n\nI call it ✨chic anorexia✨\n\nNo but seriously I 1000% agree. Calling it fasting was what lead me to denying my obvious eating disorder for years.",
          "created_utc": 1663951172.0
        },
        {
          "id": "ipm4hsq",
          "author": "YoullNeverWalkAl0ne",
          "body": "I feel when I started with that intermittent fasting shite is when my ED really took a hold and progressed. It's so toxic yet they play it off as the most natural thing ever, especially the long fasters who bring up all the 'facts' about its what cavemen used to do but then have to prime their body with broth before they can break their fast in order to not do themselves damage?!",
          "created_utc": 1663951508.0
        }
      ]
    },
    {
      "id": "ipmbptk",
      "author": "Sareeee48",
      "body": "There was this docuseries I watched that covered fasting, and this guy had gone to a fasting “resort” for a month; he ended up getting refeeding syndrome and dying once he broke the fast but somehowwww it’s still percieved as healthy?¿?¿",
      "created_utc": 1663954664.0,
      "score": 39,
      "context": [
        {
          "id": "ipm3plm",
          "author": "Sareeee48",
          "body": "You call it fasting\n\nI call it ✨chic anorexia✨\n\nNo but seriously I 1000% agree. Calling it fasting was what lead me to denying my obvious eating disorder for years.",
          "created_utc": 1663951172.0
        },
        {
          "id": "ipm4hsq",
          "author": "YoullNeverWalkAl0ne",
          "body": "I feel when I started with that intermittent fasting shite is when my ED really took a hold and progressed. It's so toxic yet they play it off as the most natural thing ever, especially the long fasters who bring up all the 'facts' about its what cavemen used to do but then have to prime their body with broth before they can break their fast in order to not do themselves damage?!",
          "created_utc": 1663951508.0
        }
      ]
    },
    {
      "id": "ipnvm2g",
      "author": "OneFootDown",
      "body": "Holy shit",
      "created_utc": 1663980446.0,
      "score": 11,
      "context": [
        {
          "id": "ipm9p85",
          "author": "throwaway787878786",
          "body": "“that’s how our ancestors lived” yeah Cindy but the average life expectancy of human beings went past 50 only in fucking 1950. people in the 1910s thought smoking was healthy so why would you take use human beings (who weren’t even the same species as us yet) as examples for health?",
          "created_utc": 1663953794.0
        },
        {
          "id": "ipn9ige",
          "author": "kylemikahel",
          "body": "You reminded me of a 50's cigar ads that pointed smoking during pregnancy was a good thing bc makes the baby slim and easy to give birth lol",
          "created_utc": 1663969665.0
        }
      ]
    },
    {
      "id": "iq01spm",
      "author": "linguinibubbles",
      "body": "Yeah it's such a slippery slope and it's so easy to fall down it.",
      "created_utc": 1664216114.0,
      "score": 3,
      "context": [
        {
          "id": "ipmg9f9",
          "author": "linguinibubbles",
          "body": "I think one of the most fucked up impacts it had on me is that even though it's been months since I last fasted, I'm still constantly having to remind myself that food isn't optional and yes i do need to ingest things to survive. The bananas week(s)-long fasts populating the fasting sub as well as my mom's insistence that fasting was the key to good health messed me up far more than I expected.",
          "created_utc": 1663956670.0
        },
        {
          "id": "ipzz8yx",
          "author": "YoullNeverWalkAl0ne",
          "body": "When I realised I could go a stupid amount of time without eating is when I hit rock bottom. I'd force my ass to go the gym and lift weights not eating I was a shell of a person",
          "created_utc": 1664215134.0
        }
      ]
    },
    {
      "id": "ipmbw2s",
      "author": "avocantdough",
      "body": "What the hellll! What was this doc I’d love to watch it!",
      "created_utc": 1663954740.0,
      "score": 11,
      "context": [
        {
          "id": "ipm3plm",
          "author": "Sareeee48",
          "body": "You call it fasting\n\nI call it ✨chic anorexia✨\n\nNo but seriously I 1000% agree. Calling it fasting was what lead me to denying my obvious eating disorder for years.",
          "created_utc": 1663951172.0
        },
        {
          "id": "ipm4hsq",
          "author": "YoullNeverWalkAl0ne",
          "body": "I feel when I started with that intermittent fasting shite is when my ED really took a hold and progressed. It's so toxic yet they play it off as the most natural thing ever, especially the long fasters who bring up all the 'facts' about its what cavemen used to do but then have to prime their body with broth before they can break their fast in order to not do themselves damage?!",
          "created_utc": 1663951508.0
        },
        {
          "id": "ipmbptk",
          "author": "Sareeee48",
          "body": "There was this docuseries I watched that covered fasting, and this guy had gone to a fasting “resort” for a month; he ended up getting refeeding syndrome and dying once he broke the fast but somehowwww it’s still percieved as healthy?¿?¿",
          "created_utc": 1663954664.0
        }
      ]
    },
    {
      "id": "ipme8ef",
      "author": "TerrifyinglyAlive",
      "body": "Probably talking about Jonathan Kamm.  They covered it on (Un)Well on Netflix",
      "created_utc": 1663955764.0,
      "score": 12,
      "context": [
        {
          "id": "ipm3plm",
          "author": "Sareeee48",
          "body": "You call it fasting\n\nI call it ✨chic anorexia✨\n\nNo but seriously I 1000% agree. Calling it fasting was what lead me to denying my obvious eating disorder for years.",
          "created_utc": 1663951172.0
        },
        {
          "id": "ipm4hsq",
          "author": "YoullNeverWalkAl0ne",
          "body": "I feel when I started with that intermittent fasting shite is when my ED really took a hold and progressed. It's so toxic yet they play it off as the most natural thing ever, especially the long fasters who bring up all the 'facts' about its what cavemen used to do but then have to prime their body with broth before they can break their fast in order to not do themselves damage?!",
          "created_utc": 1663951508.0
        },
        {
          "id": "ipmbptk",
          "author": "Sareeee48",
          "body": "There was this docuseries I watched that covered fasting, and this guy had gone to a fasting “resort” for a month; he ended up getting refeeding syndrome and dying once he broke the fast but somehowwww it’s still percieved as healthy?¿?¿",
          "created_utc": 1663954664.0
        },
        {
          "id": "ipmbw2s",
          "author": "avocantdough",
          "body": "What the hellll! What was this doc I’d love to watch it!",
          "created_utc": 1663954740.0
        }
      ]
    },
    {
      "id": "ipmi1p4",
      "author": "Sareeee48",
      "body": "Yup it’s (Un)Well on Netflix.",
      "created_utc": 1663957447.0,
      "score": 10,
      "context": [
        {
          "id": "ipm3plm",
          "author": "Sareeee48",
          "body": "You call it fasting\n\nI call it ✨chic anorexia✨\n\nNo but seriously I 1000% agree. Calling it fasting was what lead me to denying my obvious eating disorder for years.",
          "created_utc": 1663951172.0
        },
        {
          "id": "ipm4hsq",
          "author": "YoullNeverWalkAl0ne",
          "body": "I feel when I started with that intermittent fasting shite is when my ED really took a hold and progressed. It's so toxic yet they play it off as the most natural thing ever, especially the long fasters who bring up all the 'facts' about its what cavemen used to do but then have to prime their body with broth before they can break their fast in order to not do themselves damage?!",
          "created_utc": 1663951508.0
        },
        {
          "id": "ipmbptk",
          "author": "Sareeee48",
          "body": "There was this docuseries I watched that covered fasting, and this guy had gone to a fasting “resort” for a month; he ended up getting refeeding syndrome and dying once he broke the fast but somehowwww it’s still percieved as healthy?¿?¿",
          "created_utc": 1663954664.0
        },
        {
          "id": "ipmbw2s",
          "author": "avocantdough",
          "body": "What the hellll! What was this doc I’d love to watch it!",
          "created_utc": 1663954740.0
        }
      ]
    }
  ]
}