{
  "id": "xn05r6",
  "subreddit": "fuckeatingdisorders",
  "author": "alenamalina",
  "created_utc": 1664043811.0,
  "title": "Ppl r meaner now that I’m a healthy weight",
  "selftext": "Cant believe being skinny gave me pretty privilege… i looked like i was gonna die kind of rude of y’all",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/xn05r6/ppl_r_meaner_now_that_im_a_healthy_weight/",
  "score": 141,
  "num_comments": 11,
  "comments": [
    {
      "id": "ipri5dh",
      "author": "salientmould",
      "body": "Ugh, I hate how true this is. Men definitely seemed friendlier and almost eager to help me when I was very underweight. I can't lie and say I don't miss the special treatment. \n\nI try to remember those are the types of people not likely to be good friends or partners. The people who respect me just for being a person are the ones I want around.",
      "created_utc": 1664054166.0,
      "score": 72,
      "context": []
    },
    {
      "id": "ipr25ep",
      "author": "Sareeee48",
      "body": "I feel this in my soul lmao. I got hit on a lot more and people seemed more interested me (men specifically) when I was extremely thin. Maybe it has to do with confidence because I felt more accepted in a thinner body, but it definitely pisses me off because I’m 1000 times more interesting now than I was constantly hyperfixated on food and exercise all of the time.",
      "created_utc": 1664047137.0,
      "score": 56,
      "context": []
    },
    {
      "id": "ipscs5g",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1664068866.0,
      "score": 23,
      "context": []
    },
    {
      "id": "iptvuxx",
      "author": "None",
      "body": "i wanna type this out as i feel like the title triggered something deep within me; now this might be a completely different take as i'm not talking about being seen as prettier when skinnier or noticing that men notice you a lot more; growing up i was always sort of emotionally neglected by my mother, and i also have a mentally ill sibling which further took away my parents' attention from me to my sibling. i genuinely had no idea how much this actually hurt me until i entered my teen years (16-17) and i realized that some days (not always but sometimes) i'd purposefully starve myself or restrict so my mother would notice me and so i could pull some sort of a motherly reaction out of her. this rarely worked as she was busy with other stuff and barely even noticed how much i was hurting my own body, losing weight, over-exercising etc, and so, i'd be left with a gaping hole, yearning for her approval and i genuinely just fucking wanted to be babied and taken care of.\n\nfast forward, i am now in my early 20s and the ed is still here, stronger than ever, and i find myself doing the same thing whenever i visit my mum for holidays etc, i get the urge to not eat just so she could notice me, make me a soup, baby me a bit etc. this is so fucking sad now that i am thinking about it, but yeah. people ARE so much nicer to you when you're severely underweight/skinny because they see you as sick, weak, unable to take care of yourself. its not a good thing, it might feel like it is cuz most of us love being taken care of, most of us do have some issues with our parents etc.\n\ni can only hope that all of us, you included op, find the healing and love within ourselves to get better and to appreciate our own bodies more than we appreciate other people's opinions.",
      "created_utc": 1664107125.0,
      "score": 7,
      "context": []
    },
    {
      "id": "irjooxf",
      "author": "Lonely-Comparison-71",
      "body": "Tbh I never got special attention from men when I was severely underweight. Well with the exception of one guy who acted interested and then I subsequently found out it was because he felt bad for me. That was it though and only because I trusted an asshole. But when I was at a healthy weight I met my now husband. That is only my experience though and it probably depends on size before and after recovery, who you associate yourself with, and somewhat your perception. Like I felt less attractive when I reached a healthy weight so I automatically assumed and perceived others felt the same way. You’re beautiful independent of weight and anyone worth your time will love you as you are",
      "created_utc": 1665257108.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iptiwdp",
      "author": "thatsnotaviolin93",
      "body": "I have only noticed when I became significantly overweight people were just ignoring me/not noticing me. Which can be great at times tbh. I never noticed any more positive attention when I was UW...thankfully tbh cause I hate attention. I'd be wary of anyone who'd give you special attention cause you're on either extreme side of the scale because to me it screams fetish.",
      "created_utc": 1664097024.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ips1ht6",
      "author": "Sareeee48",
      "body": "Something that really helped me with this is when someone teold me that these are the type of men who just want someone they can physically and psychologically dominate/who can’t fight back as easily and I can’t lie, from experience I think they were right.",
      "created_utc": 1664063222.0,
      "score": 58,
      "context": [
        {
          "id": "ipri5dh",
          "author": "salientmould",
          "body": "Ugh, I hate how true this is. Men definitely seemed friendlier and almost eager to help me when I was very underweight. I can't lie and say I don't miss the special treatment. \n\nI try to remember those are the types of people not likely to be good friends or partners. The people who respect me just for being a person are the ones I want around.",
          "created_utc": 1664054166.0
        }
      ]
    },
    {
      "id": "iprz5lo",
      "author": "Emergency-Parsley-51",
      "body": ">I try to remember those are the types of people not likely to be good friends or partners. The people who respect me just for being a person are the ones I want around.\n\nYesss! 🙌🏻",
      "created_utc": 1664062092.0,
      "score": 19,
      "context": [
        {
          "id": "ipri5dh",
          "author": "salientmould",
          "body": "Ugh, I hate how true this is. Men definitely seemed friendlier and almost eager to help me when I was very underweight. I can't lie and say I don't miss the special treatment. \n\nI try to remember those are the types of people not likely to be good friends or partners. The people who respect me just for being a person are the ones I want around.",
          "created_utc": 1664054166.0
        }
      ]
    },
    {
      "id": "ipsf326",
      "author": "alenamalina",
      "body": "Wish it wasn’t just men though but like… friends family professors TAs job recruiters and strangers in general",
      "created_utc": 1664070073.0,
      "score": 11,
      "context": [
        {
          "id": "ipri5dh",
          "author": "salientmould",
          "body": "Ugh, I hate how true this is. Men definitely seemed friendlier and almost eager to help me when I was very underweight. I can't lie and say I don't miss the special treatment. \n\nI try to remember those are the types of people not likely to be good friends or partners. The people who respect me just for being a person are the ones I want around.",
          "created_utc": 1664054166.0
        }
      ]
    },
    {
      "id": "ipr37m7",
      "author": "alenamalina",
      "body": "not necessarily with men but in general ppl seem to want to talk to me less at parties and stuff. And I have pretty bad anxiety and so when I had panic attacks in public people would help me… but now they call the police and tell me I should get over it\n\nAnd when I went to office hours people would help me but now they seem annoyed that I’m there asking questions. And people seem to want to be my friend less. Pisses me off so much bc I really think I was less interesting when I was on the verge of death and always thinking about food.",
      "created_utc": 1664047590.0,
      "score": 21,
      "context": [
        {
          "id": "ipr25ep",
          "author": "Sareeee48",
          "body": "I feel this in my soul lmao. I got hit on a lot more and people seemed more interested me (men specifically) when I was extremely thin. Maybe it has to do with confidence because I felt more accepted in a thinner body, but it definitely pisses me off because I’m 1000 times more interesting now than I was constantly hyperfixated on food and exercise all of the time.",
          "created_utc": 1664047137.0
        }
      ]
    },
    {
      "id": "ipuf8xb",
      "author": "None",
      "body": "This has been the hardest fucking thing for me in all of this. Just noticing how people have treated me has changed so much between ED and recovery, especially men. As a very dumb surface level example, the same guys that would have smiled at me before just kind of glance at me and keep doing what they were doing. It's dumb because I'm married and that shouldn't matter but it still stings. I remind myself that they probably wouldn't be good people to have in my life, and my worth isn't based on the glances or treatment of random strangers, anyway... I'm worth so much more than that, we all are. And like you said, since recovery, I know I'm way more interesting and have sooo many more hobbies and stuff going on.\n\nIt's a weird feeling. Because I used to feel like my worth *did* hinge on the amount of attention I got for my body. When I was a teenager and at the height of my ED, I remember feeling like shit because it felt like I couldn't have male friends, they all just wanted one thing. That every kindness was just a veil for hitting on me and it felt gross. I'm glad I get sexually harassed a lot less but I also don't like the implications. On the flip side, I have a lot more close and genuine friendships with women now where it used to be hard because it felt like they always held my weight against me. I was usually the skinniest with a lot of thicker friends and felt like they never shut up about my weight, but in reality I could have just been obnoxious or something and totally naive to their own insecurities.\n\nIt's so dumb but it is what it is.",
      "created_utc": 1664117076.0,
      "score": 4,
      "context": [
        {
          "id": "ipr25ep",
          "author": "Sareeee48",
          "body": "I feel this in my soul lmao. I got hit on a lot more and people seemed more interested me (men specifically) when I was extremely thin. Maybe it has to do with confidence because I felt more accepted in a thinner body, but it definitely pisses me off because I’m 1000 times more interesting now than I was constantly hyperfixated on food and exercise all of the time.",
          "created_utc": 1664047137.0
        }
      ]
    },
    {
      "id": "ipsewot",
      "author": "alenamalina",
      "body": "This might be it… not sure tho. My social anxiety has returned bc I guess i’ve returned to the person pre-ED who had severe social anxiety. That went away not bc I was skinny but just happened during the ED. Maybe I gotta work on that first.",
      "created_utc": 1664069981.0,
      "score": 6,
      "context": [
        {
          "id": "ipscs5g",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1664068866.0
        }
      ]
    }
  ]
}