{
  "id": "xxujfj",
  "subreddit": "fuckeatingdisorders",
  "author": "Throwwawayfds",
  "created_utc": 1665134955.0,
  "title": "The more I think about BMI the more I am mad at the whole world",
  "selftext": "So you are telling me that what doctors have recommended me to use because \"they know what's best for me and you don't\", what I literally tortured my body over, screamed and cried thousands of times over, is.... borderline pseudoscience that barely works half of the time? \n\nNever in my life i have been in the \"normal\" category of the bmi, not even as a child, and doctors have blamed all of my problems on it. If I only could get into the normal range of the BMI scale my life would be so much better, the only cause of my issues was me, and i could fix it! \n\nThe balding and amenhorrea, among other things i experienced, did not matter. \nI was in the healthy bmi range therefore these problems were imaginary, all in my head, because they are issues that only people categorized as \"underweight\" experienced and i surely was not in that category. \nI had no choice at one point and gave into the extreme hunger, \"failing all the hard work\" and failing in front of my doctors. I got there, how could i not be disciplined enough to stay there instead of giving up!\n\nAnd now I get to find out that it is a hundreds of years old system invented to categorize exclusively white male populations on a group level, not individually, that works barely 50% of the time for them imagine for everyone else!!!! And whose cap was changed from 27 to 25 for no reason other than \"its a simpler number\". \nI spent my whole life worshipping it, thinking it would make me a human worthy of sympathy and dignity once i reached that number, thinking it would finally get people to see a person and not a deformed thing and it would finally solve my health issues. \n\nAnd now the absolute opposite of what was told is happening before my eyes, i have never been as healthy as i am now, at a \"non normal\" bmi. \n\nI am sorry for these posts these days my recovery is turning out to be a painfully long and difficult journey",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/xxujfj/the_more_i_think_about_bmi_the_more_i_am_mad_at/",
  "score": 110,
  "num_comments": 18,
  "comments": [
    {
      "id": "ireamgc",
      "author": "stopquaking",
      "body": "Yeah it sucks to think about how much we've suffered just due to other peoples stupidity, incompetence and lack of basic empathy in the medical field.\n\nI don't have the exact same experience as you but I relate to what you've said. I was always a normal BMI, and during my ED my BMI got a lot lower but was never classified as underweight so I didn't feel like my ED was as serious as others. Now I'm recovered and my BMI is in the overweight almost obese category and I legit feel the healthiest I have ever felt. I feel mentally clearer, sharper, and physically and emotionally stronger even though I was taught over and over that becoming overweight was detrimental to my health and physical/mental wellbeing. I keep getting told to lose weight though. \n\nTo most people, my BMI when I had an ED would have been considered 'healthy' and 'nothing to worry about' or maybe 'just a little bit too thin' when it was actually I was having all these health symptoms and wasn't okay at all.\n\nThere's a huge bias in the medical community against being overweight and a lot of health problems disproportionately get blamed on being too fat even though there's empirical evidence to suggest that having a slightly overweight BMI is the healthiest BMI. I had a friend who was obese and had anorexia and her weight loss was HEAVILY encouraged by everyone around her because they thought her weight wasn't healthy. I was the only person who realised she had anorexia because of my own personal history with EDs and I told her to get help but she didn't want to because she didn't think they'd take her seriously. (Luckily she recovered fully on her own.) She also got down to a healthy BMI at the peak of her ED which everyone around her was very happy about but I was horrified. She was clearly suffering very badly from malnutrition and was extremely obsessive and trapped in every way. It was everything I'd suffered through myself, just at a slightly higher weight. Because of that one factor it was like nobody could see it for what it was.\n\nI feel like because we really suffer through EDs we become way more cynical of diet culture, BMI, fatphobia. To us it's not harmless misinformation at all. It's LIFE or DEATH and it feels like nobody cares. I get being mad at the whole world sometimes, I really do.",
      "created_utc": 1665145457.0,
      "score": 28,
      "context": []
    },
    {
      "id": "irf5vkj",
      "author": "petitelinotte212",
      "body": "Be angry. I am. And as I come to terms with that anger in recovery, the shittiness of BMI does reveal something: how limited these standardized metrics really are. That health and healing are things you feel, not things you compute. That taking the time to check-in and self-evaluate and be honest with myself about how I'm really doing, is more important in the long-run than validation from a medical system that does not acknowledge or value my whole health. I was never outside a \"healthy\" BMI range, even at my sickest, and my life was still down the tubes: and I refuse to be gaslit by people wholly unconnected to me. Don't get me wrong: I rely on physicians for my general health, I'm not at all against science or clinical care. But I no longer seek 'treatment' from physicians for my issues with ED-related stuff because I know they rely on metrics that are not meaningful to me (I am years into recovery so obviously this wouldn't apply for someone who is still medically restoring.)",
      "created_utc": 1665160531.0,
      "score": 8,
      "context": []
    },
    {
      "id": "irf6vk7",
      "author": "notabowlofoatmeal",
      "body": "Completely understand that. I was a size 00, hair falling out, my skin was receding from my nails, brain fog, bones protruding… the whole nine yards. My BMI was 20. I was “healthy”. It messed me up so badly and definitely made things worse since my doctors and parents figured normal range = nothing is wrong. I hate the system. It is so messed up and the fact that we still use it makes my heart hurt for everyone that it hurts.",
      "created_utc": 1665160971.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ire54yj",
      "author": "Ptitdino",
      "body": "This and also basal metabolic rate. It ruined my life so bad, telling my I need to eat under X calories to lose or maintain weight. My dietician told me yesterday that bmr is bs mainly because it's only a number without considering many more factors that influence the weight, like the metabolism of one person can be slower or the opposite. She also told me that BMI is also only a number that's not really important.",
      "created_utc": 1665141818.0,
      "score": 16,
      "context": []
    },
    {
      "id": "irfy6ty",
      "author": "mae-onaise",
      "body": "not sure if you have but PLEASE listen to the maintenance phase podcast episode on BMI, the hosts of that podcast break down the history and how it’s such bullshit that literally wasn’t even invented to relate to healthcare anyways, but then insurance adopted it to charge people more money.",
      "created_utc": 1665173456.0,
      "score": 6,
      "context": []
    },
    {
      "id": "irfm6oo",
      "author": "Panthera_leo22",
      "body": "BMI is a fucking joke. It makes me so angry the medical community continues to use and that a number dictates the type of care you receive. I’ve never been in the normal range, always outside or on the upper end.  When my bmi went outside 27, I got a long talk from my doctor and my parents. The only time I got to the “healthy” weight for my height was when I had a full blown eating disorder. My pediatrician praised my work but never thought to ask more questions. Yes I was exercising but I was doing this everyday for hours at a time. I was so tired, hungry, and super anemic. But guess what, mu weight was normal which meant what I was doing was okay.  My period stopped and k thought it was the birth control, I now believe that wasn’t the case as it came back eventually. I hate that EDs also have weight limits.\n\nI’m not within the “healthy” bmi range now but I am so much more healthier than I was then. Not anemic anymore, periods are regular, my hands got their color back.  Labs come back fine so my new doctor and for the first time she hasn’t gotten on me about my weight. I was shocked when I complained about an issue and they prescribed medication (I was put on psychiatric medication). I didn’t go to the doctor for 5 years because of this.  \n\nI totally understand where you are coming from. I live for the day that bmi is seen as unreliable and not used as an indicator of health.",
      "created_utc": 1665167887.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iregfd3",
      "author": "None",
      "body": "And the worst is how it’s usually damn near impossible to explain this to pretty much anybody who isn’t already in the know about diet culture.",
      "created_utc": 1665148681.0,
      "score": 7,
      "context": []
    },
    {
      "id": "irf6bgw",
      "author": "GladPen",
      "body": "My drs made me care about my BMI. But, not only am I on a medication that makes me gain 20 lbs of water weight (i have proof) at my very thinnest I was smack dab in the middle of BMI. I did get down to normal, I shed 20% of my weight in one year to do so, but I started eating a bit more and I had been constipated, and I get weiged and I'm ..0.01 of a decimal in overweight BMI. Which he brings up. He knows about my eating issues. He's never asked me about them in any visits since I gave up on his help, when I told him about it, trying not to cry, he looked at me and said ... \"do you mostly eat ...snacks?\"\n\nRight now I go to thim because he gives me a medication that most drs won't. I'm starting to look around but there's no way to know who will prescribe you this medication before you transfer to them. \n\nThat whole spiel was just to say... Im sorry. I understand. My hair falling out, my period nearly stopping, real signs of anorexia .. shrugged off by him and insurance because Im the wrong weight.",
      "created_utc": 1665160724.0,
      "score": 3,
      "context": []
    },
    {
      "id": "irgr441",
      "author": "ForestRagamuffin",
      "body": "honestly needed your rage today. FUCK bmi trash and the horse it rode in on. i'm saving this post to reread next time i need someone to be angry about bmi shit with me. stay powerful 💚",
      "created_utc": 1665188207.0,
      "score": 3,
      "context": []
    },
    {
      "id": "irl9bg4",
      "author": "black_kyanite",
      "body": "Add my voice to the chorus of \"looked gross and underweight when my BMI was healthy.\" \n\nI had serious medical problems and lost a lot of weight. I was skinny for the first time. Healthy BMI, flat stomach. Once I got healthy again I gained back the weight. But then it seemed like a failure because I had now been skinny for the first time. This is how my ED was born. \n\nI'm not supposed to be that low weight. Everyone was worried about me because I was too thin and my face looked gaunt. And I spent years abusing my body, trying to make it go back to how it looked when I was sick.\n\nNow I'm overweight. And eh, whatever. I'm still cute asf. And my body can DO SHIT now that it definitely couldn't when I was a healthy BMI.",
      "created_utc": 1665284409.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ire3lis",
      "author": "Bananas-for",
      "body": "BMI is bullshit. I’m proud of you for choosing recovery despite everything you’ve been through",
      "created_utc": 1665140657.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ire4zqi",
      "author": "None",
      "body": "Yeah its kinda nice once your eyes are open to the BS that is diet culture, BMI etc but it’s also v frustrating",
      "created_utc": 1665141709.0,
      "score": 6,
      "context": []
    },
    {
      "id": "irgvnek",
      "author": "happy_bluebird",
      "body": "Maintenance Phase did a great episode on this! https://maintenancephase.buzzsprout.com/1411126/8963468",
      "created_utc": 1665190722.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iriqx7p",
      "author": "Throwwawayfds",
      "body": "Thanks to everyone who commented, i read and upvoted every and each one of your comments and i am incredibly grateful for this support!!! I am feeling quite overhwelmed these days so thats why i couldnt reply to everybody.",
      "created_utc": 1665240621.0,
      "score": 2,
      "context": []
    },
    {
      "id": "irjkxur",
      "author": "None",
      "body": "You know how vets determine if an animal is overweight or underweight? They literally just look at it. \n\nVisible bones? Underweight.\n\n\nNo visible waist? Body fat high enough to have a negative affect on mobility?  Overweight. \n\nDoes this dog look like other dogs who are healthy and get lots of walks and play? Healthy weight. \n\n\nI was in the exact middle of my BMI range one morning. Then I put on two heavy layers of Winter clothes, ate breakfast, ate lunch, drank some water, and went for a health check up. The doctor weighed  me, and gave me a lecture on how I was ***~almost overweight~*** 😱\n\n For me to be in the middle of the BMI range in the afternoon, which she wanted, i would have to be at the low end in morning. For my body, being at low end in the morning meant that I had visible bones 🤦🏼‍♀️\n\nEven being in the exact centre of the BMI range wasn't good enough!!!",
      "created_utc": 1665255252.0,
      "score": 2,
      "context": []
    },
    {
      "id": "irgsfjm",
      "author": "Mother_Orchid_1109",
      "body": "A “healthy” BMI. Sigh. Although I’ve never been more than just barely in the “overweight” category for bmi, I did notice a huge difference from when I initially started losing weight, to now. I’m not even under weight, so people will and have congratulated me on my weight loss. I’ve struggled with some form of an ED for the past twenty years, and it was never seen as threatening, or out of control, until I started nearing the underweight category. Even then, certain people would still gush about how “great” I look. Sorry for all the quotes, but it’s for emphasis. (If that wasn’t apparent.) I had an ex who was anorexic, and considered obese, and it broke my heart, especially because people are so damn heartless, and make assumptions. Bigger bodied people are judged for simply existing. A skinny person wears sweats and a baggy shirt, and it’s “cute and comfy,” but a bigger bodied person does, and they’re “sloppy, and lazy.” 🙄 the double standards, man. Anyway, I apologize if I seem to have made this about me, I wasn’t trying to. I was just trying to commiserate, because this shit is *fu * ked*, and i am so sorry that it is the way it is.",
      "created_utc": 1665188939.0,
      "score": 4,
      "context": [
        {
          "id": "ireamgc",
          "author": "stopquaking",
          "body": "Yeah it sucks to think about how much we've suffered just due to other peoples stupidity, incompetence and lack of basic empathy in the medical field.\n\nI don't have the exact same experience as you but I relate to what you've said. I was always a normal BMI, and during my ED my BMI got a lot lower but was never classified as underweight so I didn't feel like my ED was as serious as others. Now I'm recovered and my BMI is in the overweight almost obese category and I legit feel the healthiest I have ever felt. I feel mentally clearer, sharper, and physically and emotionally stronger even though I was taught over and over that becoming overweight was detrimental to my health and physical/mental wellbeing. I keep getting told to lose weight though. \n\nTo most people, my BMI when I had an ED would have been considered 'healthy' and 'nothing to worry about' or maybe 'just a little bit too thin' when it was actually I was having all these health symptoms and wasn't okay at all.\n\nThere's a huge bias in the medical community against being overweight and a lot of health problems disproportionately get blamed on being too fat even though there's empirical evidence to suggest that having a slightly overweight BMI is the healthiest BMI. I had a friend who was obese and had anorexia and her weight loss was HEAVILY encouraged by everyone around her because they thought her weight wasn't healthy. I was the only person who realised she had anorexia because of my own personal history with EDs and I told her to get help but she didn't want to because she didn't think they'd take her seriously. (Luckily she recovered fully on her own.) She also got down to a healthy BMI at the peak of her ED which everyone around her was very happy about but I was horrified. She was clearly suffering very badly from malnutrition and was extremely obsessive and trapped in every way. It was everything I'd suffered through myself, just at a slightly higher weight. Because of that one factor it was like nobody could see it for what it was.\n\nI feel like because we really suffer through EDs we become way more cynical of diet culture, BMI, fatphobia. To us it's not harmless misinformation at all. It's LIFE or DEATH and it feels like nobody cares. I get being mad at the whole world sometimes, I really do.",
          "created_utc": 1665145457.0
        }
      ]
    },
    {
      "id": "iriq5dd",
      "author": "Throwwawayfds",
      "body": "I'n sorry for you and your friend. I am insanely wary of the medical field because how is any of this about actual health?\nWe need to redefine the path to health to an individual and most importantly specific level soon.",
      "created_utc": 1665240215.0,
      "score": 3,
      "context": [
        {
          "id": "ireamgc",
          "author": "stopquaking",
          "body": "Yeah it sucks to think about how much we've suffered just due to other peoples stupidity, incompetence and lack of basic empathy in the medical field.\n\nI don't have the exact same experience as you but I relate to what you've said. I was always a normal BMI, and during my ED my BMI got a lot lower but was never classified as underweight so I didn't feel like my ED was as serious as others. Now I'm recovered and my BMI is in the overweight almost obese category and I legit feel the healthiest I have ever felt. I feel mentally clearer, sharper, and physically and emotionally stronger even though I was taught over and over that becoming overweight was detrimental to my health and physical/mental wellbeing. I keep getting told to lose weight though. \n\nTo most people, my BMI when I had an ED would have been considered 'healthy' and 'nothing to worry about' or maybe 'just a little bit too thin' when it was actually I was having all these health symptoms and wasn't okay at all.\n\nThere's a huge bias in the medical community against being overweight and a lot of health problems disproportionately get blamed on being too fat even though there's empirical evidence to suggest that having a slightly overweight BMI is the healthiest BMI. I had a friend who was obese and had anorexia and her weight loss was HEAVILY encouraged by everyone around her because they thought her weight wasn't healthy. I was the only person who realised she had anorexia because of my own personal history with EDs and I told her to get help but she didn't want to because she didn't think they'd take her seriously. (Luckily she recovered fully on her own.) She also got down to a healthy BMI at the peak of her ED which everyone around her was very happy about but I was horrified. She was clearly suffering very badly from malnutrition and was extremely obsessive and trapped in every way. It was everything I'd suffered through myself, just at a slightly higher weight. Because of that one factor it was like nobody could see it for what it was.\n\nI feel like because we really suffer through EDs we become way more cynical of diet culture, BMI, fatphobia. To us it's not harmless misinformation at all. It's LIFE or DEATH and it feels like nobody cares. I get being mad at the whole world sometimes, I really do.",
          "created_utc": 1665145457.0
        }
      ]
    },
    {
      "id": "iriqc0d",
      "author": "Throwwawayfds",
      "body": "That podcast was definitely one of the reasons why i learned so much!! Thanks for spreading the word",
      "created_utc": 1665240312.0,
      "score": 2,
      "context": [
        {
          "id": "irfy6ty",
          "author": "mae-onaise",
          "body": "not sure if you have but PLEASE listen to the maintenance phase podcast episode on BMI, the hosts of that podcast break down the history and how it’s such bullshit that literally wasn’t even invented to relate to healthcare anyways, but then insurance adopted it to charge people more money.",
          "created_utc": 1665173456.0
        }
      ]
    }
  ]
}