{
  "id": "xypv90",
  "subreddit": "fuckeatingdisorders",
  "author": "bouba_el",
  "created_utc": 1665226696.0,
  "title": "Some tips that helped me get through recovery",
  "selftext": "Hello all !\n\n&#x200B;\n\nThe recovery journey is a hard one and full of doubts, and for some of us it is one of the biggest challenge we ever faced. \n\nThis subreddit has helped me a lot to understand what I was going through, and I cannot thank you all enough for the support. I am also giving a special thank you to Sareeee48, you are an angel. I want to share with you some tips that have been helpful for me to go through the hardships of recovery\n\nIt will be a long post and one that comes strictly from personal experience. This is what helped me, but of course everyone is different so I don’t say that everyone should follow this. I am only sharing my own experience with this crazy thing named recovery.\n\n&#x200B;\n\n\\-**Noticing the good stuff.** One of the thing that doesn’t seem logical with recovery is how bad it feels. Suddenly you're even lower on energy, you feel gross, you eat like crazy. It is easy to start to think you are doing it wrong and you need to stop. What helped me is noticing and appreciating the good stuff in the middle of the chaos, like little clues that life gives me and that tells me \"keep going you are on the right track\"\n\nFor me it was for example : seeing my hair becoming beautiful again, and being more present at work and with people. It seems like small things but it is so important, I was finally getting my hair back ! Zoning out way less with people ! It was proof that I was right. It is easy to focus on the wrong, it can be good to focus on the right, and thank your body for it\n\n&#x200B;\n\n\\-**The clothes.** It is mentionned a lot here, but I cannot stress enough how true this is. As long as you keep being tight in your clothes, it will fuck with your head. They are not a valid assessment tool. You need to buy comfy clothes your size, where you feel good in it. It is a treat that you deserve, you going through a lot. Feeling good in stylish clothes at your size help so much, for me it was a game changer.\n\n&#x200B;\n\n\\-**You don’t struggle for nothing.** Passing recovery needs immense IDGAF energy. Going through and listening to you despite the comments from other people, what society tells you, what your ED brain tells you, it needs huge amounts of no fucks given. This is a skill you keep after and the strenght, self love and trust in yourself you gain by overcoming all this conditioning makes it so worth it\n\n&#x200B;\n\n\\-**Embracing my anger** (Id say even hanger haha). A strange one that personally helped me to harness this IDGAF energy : When I think of all that this ED robbed me, I get angry. All these years I was barely myself, all these opportunity that I left out, the isolation, the obsession with food that took everything else. I lost so much by believing the lies of the ED, this makes my blood boil.\n\nFeeling that anger fully, and using it to fuel my desire for recovery was helpful. \n\n&#x200B;\n\n\\-**Feeling fully what you have to feel.** The most important for me. During recovery a lot of suppressed feelings will come. I experimented depression. This is a good thing. It is your body surfacing all you tried to repress. You absolutely need to feel it completely without judgement. The more you struggle with yourself the harder it will be, and you wont get completely free. There is no good or wrong emotions, they just want to be heard. Our bullshit perfectionnist ED mind, so scared, think that we shouldn’t feel that way or that way, but stop struggling with your feelings and accept it all. You feel gross/ ugly / sad ? That is okay too. That needs appreciation. It will free a huge burden\n\n&#x200B;\n\n\\-**About the pain and fatigue**. They are also a normal reaction of a body healing. When you are sick and you get fever, this is your body chasing out the virus. It is the same here, it gets bad before it gets good. This is confusing because you shouldn’t feel worse when recovering right ? I lose months and months of recovery because I was trying to avoid that. When I realised the pain I was feeling was my body healing, I embraced it fully, and I let my body heal\n\n&#x200B;\n\n\\-**Understand that you need to get to a certain weight before you are healed**. There is no avoiding it, and if you try to control your weight gain, at the end it is just losing time since you will have to get there anyway.\n\nAt a point I did this strategy : since I know that anyway I will have to gain the weight, lets do it the quickest way possible. I started to plan my day to be able to eat the most calories possible. Eating the most calorie dense food. Setting times where I had to do (big) snacks. I even went as far as using weight gainer - the stuff that bukling bodybuilders use. \n\nI am not recommending this to anyone, each one has their path, but for me it helped get to the other side, and this is where I started to feel like myself for the first time\n\n&#x200B;\n\n\\-Last thing, the more you are deprived of energy (calories) the more your ED brain is roaring. When we are at our most restrictive phase, the brain is constantly criticizing our body. When we eat more, and we initially gain weight, he will scream! But if you continue eating and accepting your thoughts and feelings, there is a point where you start to accept yourself, it is the turning point, but the brain needs the food to get there.\n\n&#x200B;\n\n&#x200B;\n\nThanks for the one reading. Being healed is a beautiful thing. I feel like a normal human being again, something that I hadnt feel in a long time. I love myself, have picked up hobbies and passions, and I am much more social. Now I have friends that I like to see. I even gained back my libido (at a point I was thinking I was asexual)\n\nWishing you all the best !",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/xypv90/some_tips_that_helped_me_get_through_recovery/",
  "score": 103,
  "num_comments": 13,
  "comments": [
    {
      "id": "iribjne",
      "author": "Domahina",
      "body": "Thank you so much for sharing these tips ! It's an amazing post :) I can't even express how much I'm grateful for recovery and, even though I'm still not recovered yet, I feel alive for the first time in months. Recovery is so worth it.",
      "created_utc": 1665231387.0,
      "score": 10,
      "context": []
    },
    {
      "id": "irieb57",
      "author": "HeresWhereStoryEnds",
      "body": "What a great list. So helpful to share here. Thank you.\r  \nThe point about feeling the feels is a BIG one for me. Besides using the ED as a warped sense of \"control\", I used it as a tool to numb out my feelings completely. Yes on the anger too because I channeled the anger inward to harm myself by depriving myself of food.\r  \nYour last point reminds me of the \"Ed voice\" that was used in the book \"Life Without Ed\". Have you read it? It's helpful to me to separate the ED from myself. Recovery is still a journey...",
      "created_utc": 1665233285.0,
      "score": 11,
      "context": []
    },
    {
      "id": "irid41d",
      "author": "Bananas-for",
      "body": "Thank you 😊. This is a great post.",
      "created_utc": 1665232480.0,
      "score": 10,
      "context": []
    },
    {
      "id": "irigkgo",
      "author": "cassandygee",
      "body": "Beautiful post, thank you so much for taking the time to write this. I completely agree with all points. I had never thought about the IDGAF vibes sticking with me after I was recovered but you are 100% correct and it is glorious!",
      "created_utc": 1665234722.0,
      "score": 7,
      "context": []
    },
    {
      "id": "irineu1",
      "author": "mandanic",
      "body": "This is a great list! Thank you for sharing! Definitely have to re-emphasize the first two and the last two points - those were huge to me!! Focus on what you’re gaining aside from weight, buy clothes that fit and get rid of the old, don’t try and hack the system - just prolongs the inevitable, and yesssss there is a turning point! Again, you can get there with a short period of screaming or listen to your brain hooowling for way longer. Go for it❤️",
      "created_utc": 1665238762.0,
      "score": 2,
      "context": []
    },
    {
      "id": "irj2qwc",
      "author": "Sareeee48",
      "body": "This is a really great list! Especially regarding the emotional stuff, we definitely don’t talk about it enough here.\n\nAlso thanks so much for the shoutout! ❤️",
      "created_utc": 1665246578.0,
      "score": 2,
      "context": []
    },
    {
      "id": "irjp0m1",
      "author": "purplelilly95",
      "body": "I love this post so, so much.\n\nHad an insane revelation the other day. In the worst depths of my ED throughout late 2021 - end of 2022, my hair was falling out in handfuls. I tried anything and everything I could to stop it and fretted about it all day and night. For some reason, I really never connected it to my ED and thought it was due to another health reason.\n\nHave been in quasi-recovery since January, and had the crazy revelation about a week ago that my hair is thick again and hasn’t fallen out at all in months. I almost cried of happiness. \n\nIt’s truly noticing the little things that make this all worth it.",
      "created_utc": 1665257271.0,
      "score": 2,
      "context": []
    },
    {
      "id": "irifu19",
      "author": "bouba_el",
      "body": "You got this! You chose life. Sending love your way 🙌",
      "created_utc": 1665234264.0,
      "score": 5,
      "context": [
        {
          "id": "iribjne",
          "author": "Domahina",
          "body": "Thank you so much for sharing these tips ! It's an amazing post :) I can't even express how much I'm grateful for recovery and, even though I'm still not recovered yet, I feel alive for the first time in months. Recovery is so worth it.",
          "created_utc": 1665231387.0
        }
      ]
    },
    {
      "id": "irqn72n",
      "author": "bouba_el",
      "body": "Same for me, ED was about numbing my feelings, that is why experimenting them is like treating the issue to the source.\n\n\"Yes on the anger too because I channeled the anger inward to harm myself by depriving myself of food.\" Exactly ! What you repress will go against you, but when you allow it to be, you realise it was your ally the whole time ! \n\nAbout \"Life without Ed\", I just looked it now after reading your comments. Thanks for the suggestion, I will definitely read it, this is a topic that keeps interesting me, and I completely relate with the \"Ed voice\"\n\nAll the best to you in your journey!",
      "created_utc": 1665391334.0,
      "score": 2,
      "context": [
        {
          "id": "irieb57",
          "author": "HeresWhereStoryEnds",
          "body": "What a great list. So helpful to share here. Thank you.\r  \nThe point about feeling the feels is a BIG one for me. Besides using the ED as a warped sense of \"control\", I used it as a tool to numb out my feelings completely. Yes on the anger too because I channeled the anger inward to harm myself by depriving myself of food.\r  \nYour last point reminds me of the \"Ed voice\" that was used in the book \"Life Without Ed\". Have you read it? It's helpful to me to separate the ED from myself. Recovery is still a journey...",
          "created_utc": 1665233285.0
        }
      ]
    },
    {
      "id": "irifvbh",
      "author": "bouba_el",
      "body": "Thanks 🥰",
      "created_utc": 1665234286.0,
      "score": 3,
      "context": [
        {
          "id": "irid41d",
          "author": "Bananas-for",
          "body": "Thank you 😊. This is a great post.",
          "created_utc": 1665232480.0
        }
      ]
    },
    {
      "id": "irqncir",
      "author": "bouba_el",
      "body": "When my whole family and well caring friends were keeping messing my head with their \"well intended advices\" and their \"concerns\" and \"subtle backhand comments.\" I understood at a point we need to just not give a fuck and do the right things for us. Was a real life lesson to me and yes it is glorious !",
      "created_utc": 1665391473.0,
      "score": 2,
      "context": [
        {
          "id": "irigkgo",
          "author": "cassandygee",
          "body": "Beautiful post, thank you so much for taking the time to write this. I completely agree with all points. I had never thought about the IDGAF vibes sticking with me after I was recovered but you are 100% correct and it is glorious!",
          "created_utc": 1665234722.0
        }
      ]
    },
    {
      "id": "irqne78",
      "author": "bouba_el",
      "body": "I couldn't have it summarised better, thanks ❤️",
      "created_utc": 1665391519.0,
      "score": 1,
      "context": [
        {
          "id": "irineu1",
          "author": "mandanic",
          "body": "This is a great list! Thank you for sharing! Definitely have to re-emphasize the first two and the last two points - those were huge to me!! Focus on what you’re gaining aside from weight, buy clothes that fit and get rid of the old, don’t try and hack the system - just prolongs the inevitable, and yesssss there is a turning point! Again, you can get there with a short period of screaming or listen to your brain hooowling for way longer. Go for it❤️",
          "created_utc": 1665238762.0
        }
      ]
    },
    {
      "id": "irqnmqs",
      "author": "bouba_el",
      "body": "We don't talk about it enough and yet it is intimately linked to our ED for lots of us\n\nIt is actually your post about \"things to keep in mind during recovery\" that inspired me. You have no idea how much this post and your others helped me when I was still confused. Thank you so much ❤️",
      "created_utc": 1665391742.0,
      "score": 1,
      "context": [
        {
          "id": "irj2qwc",
          "author": "Sareeee48",
          "body": "This is a really great list! Especially regarding the emotional stuff, we definitely don’t talk about it enough here.\n\nAlso thanks so much for the shoutout! ❤️",
          "created_utc": 1665246578.0
        }
      ]
    }
  ]
}