{
  "id": "xzhdkp",
  "subreddit": "fuckeatingdisorders",
  "author": "silent_watcher2160",
  "created_utc": 1665307845.0,
  "title": "why is extreme hunger not know among professionals",
  "selftext": "the first time i went inpatient, we were not allowed to eat above our meal plan and the nurses and dieticians would be so rude and mean whenever i told them that i am hungry and neeeed more food. \nand eventhough the second treatment center i went to was wayyyy better, they never taught us anything about extreme hunger and my dietitian was super confused when i told her that i am starving an hour after ever meal. \n\nmy sister told me that her dietitians would always gaslight her and tell her that she can’t be hungry, because she already has a high meal plan etc. \n\nbut on ed spaces on social media it is such a big topic and everyone seems to know about it. i was wondering if anyone knows why that is? i mean, anorexia has always been a common disease so it can’t be a new phenomenon, right? \n\nthe thing that annoys me the most is that my ed is trying to use this as an excuse to not eat\nand it makes things so so so much harder. :(",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/xzhdkp/why_is_extreme_hunger_not_know_among_professionals/",
  "score": 108,
  "num_comments": 32,
  "comments": [
    {
      "id": "irm9973",
      "author": "bunni_bear_boom",
      "body": "I feel like a lot of professionals have very little knowledge of eating disorders. When I was in residential specifically for EDs even so much was mismanaged",
      "created_utc": 1665309960.0,
      "score": 86,
      "context": []
    },
    {
      "id": "irmgfus",
      "author": "zourdough",
      "body": "hmm idk? in germany (from my experience) they do like when i was inpatient i was experiencing it but i wasnt allowed to honor it as i came from intensive care unit bcs of refeeding syndrome but i know another girl had it too. it was never like explained to all of us but rather treated privately for her bcs they were afraid of her being embarrassed when everyone knows about it?",
      "created_utc": 1665315732.0,
      "score": 29,
      "context": []
    },
    {
      "id": "irmimkl",
      "author": "highlandharris",
      "body": "I can only speak from my own experience of inpatient (I've not experienced extreme hunger) but I had to stick to the meal plan and wasn't allowed to be offered snacks by other patients (was just a psychiatric ward not a specific ED ward) because of refeeding syndrome",
      "created_utc": 1665317225.0,
      "score": 16,
      "context": []
    },
    {
      "id": "irmlj0h",
      "author": "corgi-kisses",
      "body": "Honestly, most ed professionals know absolute dick about eating disorders. you cant learn this shit from reading a book and studying on it, you need lived experience to truly “get” what eds are all about\n\nthe ones ive had especially in ip would consistently gaslight and make assumptions, they would categorize and generalize us, and even encourage us to do restrictive behaviors (i had an ed nurse once tell me to drink loads of water to ”stave off” extreme hunger i was feeling at the time)  and in hindsight made my ed 20x worse",
      "created_utc": 1665319035.0,
      "score": 27,
      "context": []
    },
    {
      "id": "irnr2s9",
      "author": "Spectrachic311311",
      "body": "I worked with an ED specific dietitian who always encouraged me to honor EH, even if my doctor or therapist would have me stick to a meal plan. Basically, once you are out of any refeeding danger, you can and should eat as much as you need and want.",
      "created_utc": 1665337398.0,
      "score": 11,
      "context": []
    },
    {
      "id": "irng2b5",
      "author": "Sareeee48",
      "body": "Professionals are educated in standards and criteria that are directly linked to fatphobic rhetoric—so of course they don’t know or understand phenomena like extreme and mental hunger. They’re literally trained to discourage eating and [tOo MuCh] weight gain. But this isn’t just an ED recovery issue—it’s a nutritional and dietetics issue at its core. Many nutritional studies are riddled with design errors, their participant pool is often never randomized, and the collected data from these studies are almost always kept private… basically, most nutritional and weight studies are extremely biased, which is why you will see thousands of contradicting studies about this super food, or why you should avoid that food, this is the best diet to lose weight, but if you do xyz you’ll gain weight, etc. A good example of harmful and fatphobic dietetics practices was released earlier this year, suggesting pretty severe restriction for those who are considered “overweight” by BMI standards.\n\nExtreme hunger—scientifically known as *post-starvation hyperphagia*—has been documented numerous times, however it contradicts everything we are told regarding CICO and weight gain/loss. When you are told that the desire to eat a lot of food is problematic and emotionally driven, it’s going to lead the majority of people to assume that they have a binging problem after restriction—especially if you are in a larger body. We are societally wired to fear eating a lot, without actually understanding that our bodies need quite a lot of food to function optimally every single day.\n\nTbh treatment surrounding EDs is really fucking shitty specifically due to not just a general lack of understanding, but an utter *refusal* to understand the human body as a whole. Relapse rates are so high *because* we aren’t educating patients on what they’re bodies are experiencing and why it’s so important to honor hunger (once medically stable enough to do so, of course). It’s why so many people opt to recover on their own or simply not recover at all.",
      "created_utc": 1665333024.0,
      "score": 18,
      "context": []
    },
    {
      "id": "irmi60p",
      "author": "thatsnotaviolin93",
      "body": "It's why I made sure to reach out to a ED therapist who had a history with eating issues herself. I also have so many bad experiences in that regard, So many people trivialize eating/mental health issues even the ones actually working in the facilities. I was in a Mental Hospital at 15 and the people working there were outright terrible people.",
      "created_utc": 1665316919.0,
      "score": 12,
      "context": []
    },
    {
      "id": "irn6izv",
      "author": "sommerniks",
      "body": "Uh it's not something that the 'ed' community knew about years ago either, I've spent years on sites including recovery sites, up till 10 years ago, and I never heard of extreme hunger until now. \nNot saying it's not a thing, just saying it's probably one of these things that is seen but not observed until someone thinks about it and puts it together. \nThere is research about it but that doesn't mean it's immediately implemented everywhere.",
      "created_utc": 1665329162.0,
      "score": -1,
      "context": []
    },
    {
      "id": "irmave1",
      "author": "silent_watcher2160",
      "body": "agree! i just don’t understand how that is still possible? eating disorders are the deadliest mental disorders and that’s why it is actually so so important to treat it right and not invalid and traumatize patients. it’s so frustrating because i feel like good educated professionals could prevent so much harm. :(\n\ntbh, i don’t know what i would do if i wouldn’t have access to social media and couldnt see that other people are also experiencing extreme hunger etc…",
      "created_utc": 1665311362.0,
      "score": 24,
      "context": [
        {
          "id": "irm9973",
          "author": "bunni_bear_boom",
          "body": "I feel like a lot of professionals have very little knowledge of eating disorders. When I was in residential specifically for EDs even so much was mismanaged",
          "created_utc": 1665309960.0
        }
      ]
    },
    {
      "id": "irmkpsx",
      "author": "silent_watcher2160",
      "body": "ah witzig, ich komme tatsächlich auch aus deutschland hehe \nam anfang kann ich’s definitiv auch verstehen, es ist einfach viel zu riskant und wahrscheinlich mental für die meisten nicht machbar. \naber ich durfte es selbst nach 4-5 monaten nicht, was ziemlich frustrierend war. \naber tatsächlich wunderte mich vor allem, warum einfach so wenig drauf eingegangen wird. ich hatte recht viel ernährungstheorie und ernährungsthetapie und nie wurde es angesprochen. \nin meiner zweiten klinik wurden wir zwar wrmutigt, nachschlag zu nehmen, wenn wir noch mehr hunger hatten, aber das hätte meinen extremhunger auch nicht gestillt. \n\nzudem wurden die esspläne/richtmengen sofort runtergesetzt, wenn man das zielgewicht erreicht hat (und da wurden faktoren wie die ausbleibende regelblutung irgendwie komplett ignorierst), was ich auch ziemlich problematisch finde, weil dadurch mein EH noch extremer geworden ist. \n\nwie gesagt sagt meine ES mir dann, dass ich dem hunger nicht nachgehen soll und die scham- und wutgegühle, wenn ich’s dann doch mache, sind unaushaltbar. :/",
      "created_utc": 1665318548.0,
      "score": 12,
      "context": [
        {
          "id": "irmgfus",
          "author": "zourdough",
          "body": "hmm idk? in germany (from my experience) they do like when i was inpatient i was experiencing it but i wasnt allowed to honor it as i came from intensive care unit bcs of refeeding syndrome but i know another girl had it too. it was never like explained to all of us but rather treated privately for her bcs they were afraid of her being embarrassed when everyone knows about it?",
          "created_utc": 1665315732.0
        }
      ]
    },
    {
      "id": "irml62p",
      "author": "silent_watcher2160",
      "body": "yeah, at first they also told me it’s because of refeeding syndrome but even after i stayed there for a few month i wasn’t allowed to do it and professionals told me that it’s impossible to feel hungry with my meal plan…. i would always fill myself up with soy milk, because we were allowed to drink it with our coffee haha \nidk, i think i just wished some dieticians would have explained eh to me before it happens because i was devastated when i first gave in and was convinced that i developed another disorder…",
      "created_utc": 1665318823.0,
      "score": 10,
      "context": [
        {
          "id": "irmimkl",
          "author": "highlandharris",
          "body": "I can only speak from my own experience of inpatient (I've not experienced extreme hunger) but I had to stick to the meal plan and wasn't allowed to be offered snacks by other patients (was just a psychiatric ward not a specific ED ward) because of refeeding syndrome",
          "created_utc": 1665317225.0
        }
      ]
    },
    {
      "id": "irnefa9",
      "author": "silent_watcher2160",
      "body": "ufff yes, definitely agree… other patient always helped me more than the professionals which is super sad and frustrating :(",
      "created_utc": 1665332385.0,
      "score": 3,
      "context": [
        {
          "id": "irmlj0h",
          "author": "corgi-kisses",
          "body": "Honestly, most ed professionals know absolute dick about eating disorders. you cant learn this shit from reading a book and studying on it, you need lived experience to truly “get” what eds are all about\n\nthe ones ive had especially in ip would consistently gaslight and make assumptions, they would categorize and generalize us, and even encourage us to do restrictive behaviors (i had an ed nurse once tell me to drink loads of water to ”stave off” extreme hunger i was feeling at the time)  and in hindsight made my ed 20x worse",
          "created_utc": 1665319035.0
        }
      ]
    },
    {
      "id": "itffgku",
      "author": "SurvivorSwapped",
      "body": "Hey do you know if the dietitian you worked with takes virtual clients or do you have link to their website? Looking for a new dietitian ❤️",
      "created_utc": 1666506549.0,
      "score": 1,
      "context": [
        {
          "id": "irnr2s9",
          "author": "Spectrachic311311",
          "body": "I worked with an ED specific dietitian who always encouraged me to honor EH, even if my doctor or therapist would have me stick to a meal plan. Basically, once you are out of any refeeding danger, you can and should eat as much as you need and want.",
          "created_utc": 1665337398.0
        }
      ]
    },
    {
      "id": "isfdj46",
      "author": "is-it-a-bot",
      "body": "Thank you for noting that EH doesn’t follow what we’re fed about CICO. I have a logic, number-based brain by default, and my ED side uses it to justify not giving in to when I’m extremely hungry, because it’s “excessive” and the math doesn’t check out.\n\nThe fact that EH deviates from all we know about calorie maintenance honestly fascinates me. The number-based part of me wants so bad to find any equation or sense to it. I’m trying to embrace the unknown and the uncalculatable though, and trust the process. Trusting that honoring EH works, it’s what I need, and it’s not “excessive” just because it’s above an arbitrary number with so many variables.",
      "created_utc": 1665848302.0,
      "score": 2,
      "context": [
        {
          "id": "irng2b5",
          "author": "Sareeee48",
          "body": "Professionals are educated in standards and criteria that are directly linked to fatphobic rhetoric—so of course they don’t know or understand phenomena like extreme and mental hunger. They’re literally trained to discourage eating and [tOo MuCh] weight gain. But this isn’t just an ED recovery issue—it’s a nutritional and dietetics issue at its core. Many nutritional studies are riddled with design errors, their participant pool is often never randomized, and the collected data from these studies are almost always kept private… basically, most nutritional and weight studies are extremely biased, which is why you will see thousands of contradicting studies about this super food, or why you should avoid that food, this is the best diet to lose weight, but if you do xyz you’ll gain weight, etc. A good example of harmful and fatphobic dietetics practices was released earlier this year, suggesting pretty severe restriction for those who are considered “overweight” by BMI standards.\n\nExtreme hunger—scientifically known as *post-starvation hyperphagia*—has been documented numerous times, however it contradicts everything we are told regarding CICO and weight gain/loss. When you are told that the desire to eat a lot of food is problematic and emotionally driven, it’s going to lead the majority of people to assume that they have a binging problem after restriction—especially if you are in a larger body. We are societally wired to fear eating a lot, without actually understanding that our bodies need quite a lot of food to function optimally every single day.\n\nTbh treatment surrounding EDs is really fucking shitty specifically due to not just a general lack of understanding, but an utter *refusal* to understand the human body as a whole. Relapse rates are so high *because* we aren’t educating patients on what they’re bodies are experiencing and why it’s so important to honor hunger (once medically stable enough to do so, of course). It’s why so many people opt to recover on their own or simply not recover at all.",
          "created_utc": 1665333024.0
        }
      ]
    },
    {
      "id": "irmkual",
      "author": "silent_watcher2160",
      "body": "yeah that’s definitely the best idea… i actually started therapy for my depression and anxiety and was in denial of my ed so i was looking for someone who specializes in those areas…",
      "created_utc": 1665318623.0,
      "score": 5,
      "context": [
        {
          "id": "irmi60p",
          "author": "thatsnotaviolin93",
          "body": "It's why I made sure to reach out to a ED therapist who had a history with eating issues herself. I also have so many bad experiences in that regard, So many people trivialize eating/mental health issues even the ones actually working in the facilities. I was in a Mental Hospital at 15 and the people working there were outright terrible people.",
          "created_utc": 1665316919.0
        }
      ]
    },
    {
      "id": "irqab0v",
      "author": "None",
      "body": "I had a similar experience at the same age. They were sadistic with control issues or negligent at best. Only one woman showed any compassion and she wasn't a professional she was some kind of assistant who just helped bring food out and had no authority or training. \n\nI am 30 now, and at the time I just felt terror and didn't have the words to describe why. I am now old enough to understand it was an abusive environment that i was trapped in. i still have PTSD from that experience.\n\n People choose jobs because they like them. I like working with my hands, outdoors, and in casual environments. I look for those jobs. People who like seeing others in pain and have issues with control are drawn to working with the vulnerable, unfortunately.",
      "created_utc": 1665380420.0,
      "score": 2,
      "context": [
        {
          "id": "irmi60p",
          "author": "thatsnotaviolin93",
          "body": "It's why I made sure to reach out to a ED therapist who had a history with eating issues herself. I also have so many bad experiences in that regard, So many people trivialize eating/mental health issues even the ones actually working in the facilities. I was in a Mental Hospital at 15 and the people working there were outright terrible people.",
          "created_utc": 1665316919.0
        }
      ]
    },
    {
      "id": "irng8qk",
      "author": "Sareeee48",
      "body": "Post-starvation hyperphagia (extreme hunger) has been a known and documented phenomenon since the mid 1900s though??",
      "created_utc": 1665333096.0,
      "score": 8,
      "context": [
        {
          "id": "irn6izv",
          "author": "sommerniks",
          "body": "Uh it's not something that the 'ed' community knew about years ago either, I've spent years on sites including recovery sites, up till 10 years ago, and I never heard of extreme hunger until now. \nNot saying it's not a thing, just saying it's probably one of these things that is seen but not observed until someone thinks about it and puts it together. \nThere is research about it but that doesn't mean it's immediately implemented everywhere.",
          "created_utc": 1665329162.0
        }
      ]
    },
    {
      "id": "irne8yy",
      "author": "silent_watcher2160",
      "body": "that is actually super interesting! do you know any scientific studies or something like this? i just know about the minnesota starvation study but i would like to research a little bit more about the scientific reason behind it…",
      "created_utc": 1665332315.0,
      "score": 3,
      "context": [
        {
          "id": "irn6izv",
          "author": "sommerniks",
          "body": "Uh it's not something that the 'ed' community knew about years ago either, I've spent years on sites including recovery sites, up till 10 years ago, and I never heard of extreme hunger until now. \nNot saying it's not a thing, just saying it's probably one of these things that is seen but not observed until someone thinks about it and puts it together. \nThere is research about it but that doesn't mean it's immediately implemented everywhere.",
          "created_utc": 1665329162.0
        }
      ]
    },
    {
      "id": "irmly9y",
      "author": "zourdough",
      "body": "okay aber ich muss auch ganz ehrlich sagen ich finde the krankenhaus systeme so abgefuckt und bin auch nachdem ich entlassen wurde direkt zurück gefallen weil ich erstens nicht vom essplan weg kam und zweitens immer versucht habe bei nem bestimmten gewicht zu bleiben. ich sag mal so für die einen ist das zwar perfekt aber meiner meinung nach ist es fast unmöglich nach dem klinik system komplett gesund zu werden. dazu muss ich aber auch sagen das ich von all in ziemlich überzeugt bin weil man halt wirklich sich von einer sekunde auf die andere von fast allem löst",
      "created_utc": 1665319286.0,
      "score": 8,
      "context": [
        {
          "id": "irmgfus",
          "author": "zourdough",
          "body": "hmm idk? in germany (from my experience) they do like when i was inpatient i was experiencing it but i wasnt allowed to honor it as i came from intensive care unit bcs of refeeding syndrome but i know another girl had it too. it was never like explained to all of us but rather treated privately for her bcs they were afraid of her being embarrassed when everyone knows about it?",
          "created_utc": 1665315732.0
        },
        {
          "id": "irmkpsx",
          "author": "silent_watcher2160",
          "body": "ah witzig, ich komme tatsächlich auch aus deutschland hehe \nam anfang kann ich’s definitiv auch verstehen, es ist einfach viel zu riskant und wahrscheinlich mental für die meisten nicht machbar. \naber ich durfte es selbst nach 4-5 monaten nicht, was ziemlich frustrierend war. \naber tatsächlich wunderte mich vor allem, warum einfach so wenig drauf eingegangen wird. ich hatte recht viel ernährungstheorie und ernährungsthetapie und nie wurde es angesprochen. \nin meiner zweiten klinik wurden wir zwar wrmutigt, nachschlag zu nehmen, wenn wir noch mehr hunger hatten, aber das hätte meinen extremhunger auch nicht gestillt. \n\nzudem wurden die esspläne/richtmengen sofort runtergesetzt, wenn man das zielgewicht erreicht hat (und da wurden faktoren wie die ausbleibende regelblutung irgendwie komplett ignorierst), was ich auch ziemlich problematisch finde, weil dadurch mein EH noch extremer geworden ist. \n\nwie gesagt sagt meine ES mir dann, dass ich dem hunger nicht nachgehen soll und die scham- und wutgegühle, wenn ich’s dann doch mache, sind unaushaltbar. :/",
          "created_utc": 1665318548.0
        }
      ]
    },
    {
      "id": "irmlmgv",
      "author": "highlandharris",
      "body": "Dieticians definitely need to get a better understanding of EDs I hate to fight tooth and nail to be allowed to drink oat milk on the ward as she was convinced I didn't want to drink cow's milk because I was trying to be in control, despite me telling her (and my mum...I'm in my 30s!) That it was actually because it gives me stomach pain...that was me being manipulative apparently! I feel like they tar everyone with the same brush and don't take into account that everyone's different and I read so much about eh now that it's obviously a huge thing for people so they should be more clued up",
      "created_utc": 1665319093.0,
      "score": 18,
      "context": [
        {
          "id": "irmimkl",
          "author": "highlandharris",
          "body": "I can only speak from my own experience of inpatient (I've not experienced extreme hunger) but I had to stick to the meal plan and wasn't allowed to be offered snacks by other patients (was just a psychiatric ward not a specific ED ward) because of refeeding syndrome",
          "created_utc": 1665317225.0
        },
        {
          "id": "irml62p",
          "author": "silent_watcher2160",
          "body": "yeah, at first they also told me it’s because of refeeding syndrome but even after i stayed there for a few month i wasn’t allowed to do it and professionals told me that it’s impossible to feel hungry with my meal plan…. i would always fill myself up with soy milk, because we were allowed to drink it with our coffee haha \nidk, i think i just wished some dieticians would have explained eh to me before it happens because i was devastated when i first gave in and was convinced that i developed another disorder…",
          "created_utc": 1665318823.0
        }
      ]
    },
    {
      "id": "ithlk75",
      "author": "Spectrachic311311",
      "body": "Mine likes in person sessions but she might take virtual clients. DM me and I’ll give you the website.",
      "created_utc": 1666550062.0,
      "score": 2,
      "context": [
        {
          "id": "irnr2s9",
          "author": "Spectrachic311311",
          "body": "I worked with an ED specific dietitian who always encouraged me to honor EH, even if my doctor or therapist would have me stick to a meal plan. Basically, once you are out of any refeeding danger, you can and should eat as much as you need and want.",
          "created_utc": 1665337398.0
        },
        {
          "id": "itffgku",
          "author": "SurvivorSwapped",
          "body": "Hey do you know if the dietitian you worked with takes virtual clients or do you have link to their website? Looking for a new dietitian ❤️",
          "created_utc": 1666506549.0
        }
      ]
    },
    {
      "id": "isfp4rs",
      "author": "Sareeee48",
      "body": "I’m really “data” oriented as well and reading up on all of this has helped that side of me to flip the script, if you will. From what I’ve been able to learn it’s helped me accept that bodies aren’t calculators, calories aren’t hard numbers, and even if they were our bodies don’t digest and metabolize them as simply as we are told they do. The body is complex as **fuck** and to expect it to act like a machine that hasn’t spent several million years surviving and evolving is a complete disregard of the potential of the human body.\n\nIt is, unfortunately, something you just have to do in order to accept though. Good luck on your recovery journey!",
      "created_utc": 1665853257.0,
      "score": 2,
      "context": [
        {
          "id": "irng2b5",
          "author": "Sareeee48",
          "body": "Professionals are educated in standards and criteria that are directly linked to fatphobic rhetoric—so of course they don’t know or understand phenomena like extreme and mental hunger. They’re literally trained to discourage eating and [tOo MuCh] weight gain. But this isn’t just an ED recovery issue—it’s a nutritional and dietetics issue at its core. Many nutritional studies are riddled with design errors, their participant pool is often never randomized, and the collected data from these studies are almost always kept private… basically, most nutritional and weight studies are extremely biased, which is why you will see thousands of contradicting studies about this super food, or why you should avoid that food, this is the best diet to lose weight, but if you do xyz you’ll gain weight, etc. A good example of harmful and fatphobic dietetics practices was released earlier this year, suggesting pretty severe restriction for those who are considered “overweight” by BMI standards.\n\nExtreme hunger—scientifically known as *post-starvation hyperphagia*—has been documented numerous times, however it contradicts everything we are told regarding CICO and weight gain/loss. When you are told that the desire to eat a lot of food is problematic and emotionally driven, it’s going to lead the majority of people to assume that they have a binging problem after restriction—especially if you are in a larger body. We are societally wired to fear eating a lot, without actually understanding that our bodies need quite a lot of food to function optimally every single day.\n\nTbh treatment surrounding EDs is really fucking shitty specifically due to not just a general lack of understanding, but an utter *refusal* to understand the human body as a whole. Relapse rates are so high *because* we aren’t educating patients on what they’re bodies are experiencing and why it’s so important to honor hunger (once medically stable enough to do so, of course). It’s why so many people opt to recover on their own or simply not recover at all.",
          "created_utc": 1665333024.0
        },
        {
          "id": "isfdj46",
          "author": "is-it-a-bot",
          "body": "Thank you for noting that EH doesn’t follow what we’re fed about CICO. I have a logic, number-based brain by default, and my ED side uses it to justify not giving in to when I’m extremely hungry, because it’s “excessive” and the math doesn’t check out.\n\nThe fact that EH deviates from all we know about calorie maintenance honestly fascinates me. The number-based part of me wants so bad to find any equation or sense to it. I’m trying to embrace the unknown and the uncalculatable though, and trust the process. Trusting that honoring EH works, it’s what I need, and it’s not “excessive” just because it’s above an arbitrary number with so many variables.",
          "created_utc": 1665848302.0
        }
      ]
    },
    {
      "id": "irquitr",
      "author": "thatsnotaviolin93",
      "body": "Never looked at it that way, but looking at my experiences in several mental health facilities over the years that actually sounds terrifyingly accurate.",
      "created_utc": 1665397920.0,
      "score": 2,
      "context": [
        {
          "id": "irmi60p",
          "author": "thatsnotaviolin93",
          "body": "It's why I made sure to reach out to a ED therapist who had a history with eating issues herself. I also have so many bad experiences in that regard, So many people trivialize eating/mental health issues even the ones actually working in the facilities. I was in a Mental Hospital at 15 and the people working there were outright terrible people.",
          "created_utc": 1665316919.0
        },
        {
          "id": "irqab0v",
          "author": "None",
          "body": "I had a similar experience at the same age. They were sadistic with control issues or negligent at best. Only one woman showed any compassion and she wasn't a professional she was some kind of assistant who just helped bring food out and had no authority or training. \n\nI am 30 now, and at the time I just felt terror and didn't have the words to describe why. I am now old enough to understand it was an abusive environment that i was trapped in. i still have PTSD from that experience.\n\n People choose jobs because they like them. I like working with my hands, outdoors, and in casual environments. I look for those jobs. People who like seeing others in pain and have issues with control are drawn to working with the vulnerable, unfortunately.",
          "created_utc": 1665380420.0
        }
      ]
    },
    {
      "id": "irnoi7p",
      "author": "sommerniks",
      "body": "Well that does not mean anorexics know about it, or that treatment teams consider it 'safe' for all patients (eg protocol keeps safety of all in mind, physical complications from eating disorders are also real) OR that someone who has never experienced it understands  it. \n\nSeriously, years ago nobody talked about it, now it's almost all you read to the point that it triggers me.",
      "created_utc": 1665336410.0,
      "score": -2,
      "context": [
        {
          "id": "irn6izv",
          "author": "sommerniks",
          "body": "Uh it's not something that the 'ed' community knew about years ago either, I've spent years on sites including recovery sites, up till 10 years ago, and I never heard of extreme hunger until now. \nNot saying it's not a thing, just saying it's probably one of these things that is seen but not observed until someone thinks about it and puts it together. \nThere is research about it but that doesn't mean it's immediately implemented everywhere.",
          "created_utc": 1665329162.0
        },
        {
          "id": "irng8qk",
          "author": "Sareeee48",
          "body": "Post-starvation hyperphagia (extreme hunger) has been a known and documented phenomenon since the mid 1900s though??",
          "created_utc": 1665333096.0
        }
      ]
    },
    {
      "id": "irngrb1",
      "author": "Sareeee48",
      "body": "This is one [study](https://academic.oup.com/ajcn/article/65/3/717/4655278) that is worth the read as it explains the biological purpose of EH.",
      "created_utc": 1665333298.0,
      "score": 3,
      "context": [
        {
          "id": "irn6izv",
          "author": "sommerniks",
          "body": "Uh it's not something that the 'ed' community knew about years ago either, I've spent years on sites including recovery sites, up till 10 years ago, and I never heard of extreme hunger until now. \nNot saying it's not a thing, just saying it's probably one of these things that is seen but not observed until someone thinks about it and puts it together. \nThere is research about it but that doesn't mean it's immediately implemented everywhere.",
          "created_utc": 1665329162.0
        },
        {
          "id": "irne8yy",
          "author": "silent_watcher2160",
          "body": "that is actually super interesting! do you know any scientific studies or something like this? i just know about the minnesota starvation study but i would like to research a little bit more about the scientific reason behind it…",
          "created_utc": 1665332315.0
        }
      ]
    },
    {
      "id": "irmmo9n",
      "author": "silent_watcher2160",
      "body": "da stimme ich dir sowas von zu! krankenhaus war nochmal schlimmer, als meine klinikaufenthalte, aber selbst die haben nicht viel gebracht. \nich brauchte definitiv vor allem am anfang die unterstützung beim essen und auch die strukturierten mahlzeit waren eine sehr sehr große hilfe, aber für zu hause ist das alles unrealistisch. \nin meiner ersten klinik haben sie mit kalorienplänen gearbeitet und obwohl ich davor nie auf kalorien geachtet habe, wird dich dann davon komplett eingenommen und sehe lebensmittel jetzt nur noch als zahlen… einfach frustrierend alles 🥹",
      "created_utc": 1665319705.0,
      "score": 6,
      "context": [
        {
          "id": "irmgfus",
          "author": "zourdough",
          "body": "hmm idk? in germany (from my experience) they do like when i was inpatient i was experiencing it but i wasnt allowed to honor it as i came from intensive care unit bcs of refeeding syndrome but i know another girl had it too. it was never like explained to all of us but rather treated privately for her bcs they were afraid of her being embarrassed when everyone knows about it?",
          "created_utc": 1665315732.0
        },
        {
          "id": "irmkpsx",
          "author": "silent_watcher2160",
          "body": "ah witzig, ich komme tatsächlich auch aus deutschland hehe \nam anfang kann ich’s definitiv auch verstehen, es ist einfach viel zu riskant und wahrscheinlich mental für die meisten nicht machbar. \naber ich durfte es selbst nach 4-5 monaten nicht, was ziemlich frustrierend war. \naber tatsächlich wunderte mich vor allem, warum einfach so wenig drauf eingegangen wird. ich hatte recht viel ernährungstheorie und ernährungsthetapie und nie wurde es angesprochen. \nin meiner zweiten klinik wurden wir zwar wrmutigt, nachschlag zu nehmen, wenn wir noch mehr hunger hatten, aber das hätte meinen extremhunger auch nicht gestillt. \n\nzudem wurden die esspläne/richtmengen sofort runtergesetzt, wenn man das zielgewicht erreicht hat (und da wurden faktoren wie die ausbleibende regelblutung irgendwie komplett ignorierst), was ich auch ziemlich problematisch finde, weil dadurch mein EH noch extremer geworden ist. \n\nwie gesagt sagt meine ES mir dann, dass ich dem hunger nicht nachgehen soll und die scham- und wutgegühle, wenn ich’s dann doch mache, sind unaushaltbar. :/",
          "created_utc": 1665318548.0
        },
        {
          "id": "irmly9y",
          "author": "zourdough",
          "body": "okay aber ich muss auch ganz ehrlich sagen ich finde the krankenhaus systeme so abgefuckt und bin auch nachdem ich entlassen wurde direkt zurück gefallen weil ich erstens nicht vom essplan weg kam und zweitens immer versucht habe bei nem bestimmten gewicht zu bleiben. ich sag mal so für die einen ist das zwar perfekt aber meiner meinung nach ist es fast unmöglich nach dem klinik system komplett gesund zu werden. dazu muss ich aber auch sagen das ich von all in ziemlich überzeugt bin weil man halt wirklich sich von einer sekunde auf die andere von fast allem löst",
          "created_utc": 1665319286.0
        }
      ]
    },
    {
      "id": "itmnf2g",
      "author": "SurvivorSwapped",
      "body": "Hey I messaged you",
      "created_utc": 1666640218.0,
      "score": 1,
      "context": [
        {
          "id": "irnr2s9",
          "author": "Spectrachic311311",
          "body": "I worked with an ED specific dietitian who always encouraged me to honor EH, even if my doctor or therapist would have me stick to a meal plan. Basically, once you are out of any refeeding danger, you can and should eat as much as you need and want.",
          "created_utc": 1665337398.0
        },
        {
          "id": "itffgku",
          "author": "SurvivorSwapped",
          "body": "Hey do you know if the dietitian you worked with takes virtual clients or do you have link to their website? Looking for a new dietitian ❤️",
          "created_utc": 1666506549.0
        },
        {
          "id": "ithlk75",
          "author": "Spectrachic311311",
          "body": "Mine likes in person sessions but she might take virtual clients. DM me and I’ll give you the website.",
          "created_utc": 1666550062.0
        }
      ]
    },
    {
      "id": "irs5g4u",
      "author": "None",
      "body": "The best counsellors i ever had saw people on a voluntary basis where i was free to stand up and walk out whenever i wanted",
      "created_utc": 1665421165.0,
      "score": 1,
      "context": [
        {
          "id": "irmi60p",
          "author": "thatsnotaviolin93",
          "body": "It's why I made sure to reach out to a ED therapist who had a history with eating issues herself. I also have so many bad experiences in that regard, So many people trivialize eating/mental health issues even the ones actually working in the facilities. I was in a Mental Hospital at 15 and the people working there were outright terrible people.",
          "created_utc": 1665316919.0
        },
        {
          "id": "irqab0v",
          "author": "None",
          "body": "I had a similar experience at the same age. They were sadistic with control issues or negligent at best. Only one woman showed any compassion and she wasn't a professional she was some kind of assistant who just helped bring food out and had no authority or training. \n\nI am 30 now, and at the time I just felt terror and didn't have the words to describe why. I am now old enough to understand it was an abusive environment that i was trapped in. i still have PTSD from that experience.\n\n People choose jobs because they like them. I like working with my hands, outdoors, and in casual environments. I look for those jobs. People who like seeing others in pain and have issues with control are drawn to working with the vulnerable, unfortunately.",
          "created_utc": 1665380420.0
        },
        {
          "id": "irquitr",
          "author": "thatsnotaviolin93",
          "body": "Never looked at it that way, but looking at my experiences in several mental health facilities over the years that actually sounds terrifyingly accurate.",
          "created_utc": 1665397920.0
        }
      ]
    },
    {
      "id": "iro392a",
      "author": "notsure22222",
      "body": "can we type in english so everyone can read",
      "created_utc": 1665342128.0,
      "score": -28,
      "context": [
        {
          "id": "irmgfus",
          "author": "zourdough",
          "body": "hmm idk? in germany (from my experience) they do like when i was inpatient i was experiencing it but i wasnt allowed to honor it as i came from intensive care unit bcs of refeeding syndrome but i know another girl had it too. it was never like explained to all of us but rather treated privately for her bcs they were afraid of her being embarrassed when everyone knows about it?",
          "created_utc": 1665315732.0
        },
        {
          "id": "irmkpsx",
          "author": "silent_watcher2160",
          "body": "ah witzig, ich komme tatsächlich auch aus deutschland hehe \nam anfang kann ich’s definitiv auch verstehen, es ist einfach viel zu riskant und wahrscheinlich mental für die meisten nicht machbar. \naber ich durfte es selbst nach 4-5 monaten nicht, was ziemlich frustrierend war. \naber tatsächlich wunderte mich vor allem, warum einfach so wenig drauf eingegangen wird. ich hatte recht viel ernährungstheorie und ernährungsthetapie und nie wurde es angesprochen. \nin meiner zweiten klinik wurden wir zwar wrmutigt, nachschlag zu nehmen, wenn wir noch mehr hunger hatten, aber das hätte meinen extremhunger auch nicht gestillt. \n\nzudem wurden die esspläne/richtmengen sofort runtergesetzt, wenn man das zielgewicht erreicht hat (und da wurden faktoren wie die ausbleibende regelblutung irgendwie komplett ignorierst), was ich auch ziemlich problematisch finde, weil dadurch mein EH noch extremer geworden ist. \n\nwie gesagt sagt meine ES mir dann, dass ich dem hunger nicht nachgehen soll und die scham- und wutgegühle, wenn ich’s dann doch mache, sind unaushaltbar. :/",
          "created_utc": 1665318548.0
        },
        {
          "id": "irmly9y",
          "author": "zourdough",
          "body": "okay aber ich muss auch ganz ehrlich sagen ich finde the krankenhaus systeme so abgefuckt und bin auch nachdem ich entlassen wurde direkt zurück gefallen weil ich erstens nicht vom essplan weg kam und zweitens immer versucht habe bei nem bestimmten gewicht zu bleiben. ich sag mal so für die einen ist das zwar perfekt aber meiner meinung nach ist es fast unmöglich nach dem klinik system komplett gesund zu werden. dazu muss ich aber auch sagen das ich von all in ziemlich überzeugt bin weil man halt wirklich sich von einer sekunde auf die andere von fast allem löst",
          "created_utc": 1665319286.0
        },
        {
          "id": "irmmo9n",
          "author": "silent_watcher2160",
          "body": "da stimme ich dir sowas von zu! krankenhaus war nochmal schlimmer, als meine klinikaufenthalte, aber selbst die haben nicht viel gebracht. \nich brauchte definitiv vor allem am anfang die unterstützung beim essen und auch die strukturierten mahlzeit waren eine sehr sehr große hilfe, aber für zu hause ist das alles unrealistisch. \nin meiner ersten klinik haben sie mit kalorienplänen gearbeitet und obwohl ich davor nie auf kalorien geachtet habe, wird dich dann davon komplett eingenommen und sehe lebensmittel jetzt nur noch als zahlen… einfach frustrierend alles 🥹",
          "created_utc": 1665319705.0
        }
      ]
    },
    {
      "id": "iro4lpy",
      "author": "ForestRagamuffin",
      "body": "i think it's fine for ppl to use whatever language is most comfy for them. maybe op and the commenter are able to have a deeper, more nuanced discussion in german (?) than in english. and that's what this post is for; support for the op.",
      "created_utc": 1665342658.0,
      "score": 30,
      "context": [
        {
          "id": "irmgfus",
          "author": "zourdough",
          "body": "hmm idk? in germany (from my experience) they do like when i was inpatient i was experiencing it but i wasnt allowed to honor it as i came from intensive care unit bcs of refeeding syndrome but i know another girl had it too. it was never like explained to all of us but rather treated privately for her bcs they were afraid of her being embarrassed when everyone knows about it?",
          "created_utc": 1665315732.0
        },
        {
          "id": "irmkpsx",
          "author": "silent_watcher2160",
          "body": "ah witzig, ich komme tatsächlich auch aus deutschland hehe \nam anfang kann ich’s definitiv auch verstehen, es ist einfach viel zu riskant und wahrscheinlich mental für die meisten nicht machbar. \naber ich durfte es selbst nach 4-5 monaten nicht, was ziemlich frustrierend war. \naber tatsächlich wunderte mich vor allem, warum einfach so wenig drauf eingegangen wird. ich hatte recht viel ernährungstheorie und ernährungsthetapie und nie wurde es angesprochen. \nin meiner zweiten klinik wurden wir zwar wrmutigt, nachschlag zu nehmen, wenn wir noch mehr hunger hatten, aber das hätte meinen extremhunger auch nicht gestillt. \n\nzudem wurden die esspläne/richtmengen sofort runtergesetzt, wenn man das zielgewicht erreicht hat (und da wurden faktoren wie die ausbleibende regelblutung irgendwie komplett ignorierst), was ich auch ziemlich problematisch finde, weil dadurch mein EH noch extremer geworden ist. \n\nwie gesagt sagt meine ES mir dann, dass ich dem hunger nicht nachgehen soll und die scham- und wutgegühle, wenn ich’s dann doch mache, sind unaushaltbar. :/",
          "created_utc": 1665318548.0
        },
        {
          "id": "irmly9y",
          "author": "zourdough",
          "body": "okay aber ich muss auch ganz ehrlich sagen ich finde the krankenhaus systeme so abgefuckt und bin auch nachdem ich entlassen wurde direkt zurück gefallen weil ich erstens nicht vom essplan weg kam und zweitens immer versucht habe bei nem bestimmten gewicht zu bleiben. ich sag mal so für die einen ist das zwar perfekt aber meiner meinung nach ist es fast unmöglich nach dem klinik system komplett gesund zu werden. dazu muss ich aber auch sagen das ich von all in ziemlich überzeugt bin weil man halt wirklich sich von einer sekunde auf die andere von fast allem löst",
          "created_utc": 1665319286.0
        },
        {
          "id": "irmmo9n",
          "author": "silent_watcher2160",
          "body": "da stimme ich dir sowas von zu! krankenhaus war nochmal schlimmer, als meine klinikaufenthalte, aber selbst die haben nicht viel gebracht. \nich brauchte definitiv vor allem am anfang die unterstützung beim essen und auch die strukturierten mahlzeit waren eine sehr sehr große hilfe, aber für zu hause ist das alles unrealistisch. \nin meiner ersten klinik haben sie mit kalorienplänen gearbeitet und obwohl ich davor nie auf kalorien geachtet habe, wird dich dann davon komplett eingenommen und sehe lebensmittel jetzt nur noch als zahlen… einfach frustrierend alles 🥹",
          "created_utc": 1665319705.0
        },
        {
          "id": "iro392a",
          "author": "notsure22222",
          "body": "can we type in english so everyone can read",
          "created_utc": 1665342128.0
        }
      ]
    },
    {
      "id": "irqo0yu",
      "author": "plierss",
      "body": "[Got you man.](https://www-reddit-com.translate.goog/r/fuckeatingdisorders/comments/xzhdkp/why_is_extreme_hunger_not_know_among_professionals/?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=en-US&_x_tr_pto=wapp) Next time though, google translate. u/ForestRagamuffin has a solid point, and the work arounds are easy :) Internet is pretty cool.",
      "created_utc": 1665392106.0,
      "score": 3,
      "context": [
        {
          "id": "irmgfus",
          "author": "zourdough",
          "body": "hmm idk? in germany (from my experience) they do like when i was inpatient i was experiencing it but i wasnt allowed to honor it as i came from intensive care unit bcs of refeeding syndrome but i know another girl had it too. it was never like explained to all of us but rather treated privately for her bcs they were afraid of her being embarrassed when everyone knows about it?",
          "created_utc": 1665315732.0
        },
        {
          "id": "irmkpsx",
          "author": "silent_watcher2160",
          "body": "ah witzig, ich komme tatsächlich auch aus deutschland hehe \nam anfang kann ich’s definitiv auch verstehen, es ist einfach viel zu riskant und wahrscheinlich mental für die meisten nicht machbar. \naber ich durfte es selbst nach 4-5 monaten nicht, was ziemlich frustrierend war. \naber tatsächlich wunderte mich vor allem, warum einfach so wenig drauf eingegangen wird. ich hatte recht viel ernährungstheorie und ernährungsthetapie und nie wurde es angesprochen. \nin meiner zweiten klinik wurden wir zwar wrmutigt, nachschlag zu nehmen, wenn wir noch mehr hunger hatten, aber das hätte meinen extremhunger auch nicht gestillt. \n\nzudem wurden die esspläne/richtmengen sofort runtergesetzt, wenn man das zielgewicht erreicht hat (und da wurden faktoren wie die ausbleibende regelblutung irgendwie komplett ignorierst), was ich auch ziemlich problematisch finde, weil dadurch mein EH noch extremer geworden ist. \n\nwie gesagt sagt meine ES mir dann, dass ich dem hunger nicht nachgehen soll und die scham- und wutgegühle, wenn ich’s dann doch mache, sind unaushaltbar. :/",
          "created_utc": 1665318548.0
        },
        {
          "id": "irmly9y",
          "author": "zourdough",
          "body": "okay aber ich muss auch ganz ehrlich sagen ich finde the krankenhaus systeme so abgefuckt und bin auch nachdem ich entlassen wurde direkt zurück gefallen weil ich erstens nicht vom essplan weg kam und zweitens immer versucht habe bei nem bestimmten gewicht zu bleiben. ich sag mal so für die einen ist das zwar perfekt aber meiner meinung nach ist es fast unmöglich nach dem klinik system komplett gesund zu werden. dazu muss ich aber auch sagen das ich von all in ziemlich überzeugt bin weil man halt wirklich sich von einer sekunde auf die andere von fast allem löst",
          "created_utc": 1665319286.0
        },
        {
          "id": "irmmo9n",
          "author": "silent_watcher2160",
          "body": "da stimme ich dir sowas von zu! krankenhaus war nochmal schlimmer, als meine klinikaufenthalte, aber selbst die haben nicht viel gebracht. \nich brauchte definitiv vor allem am anfang die unterstützung beim essen und auch die strukturierten mahlzeit waren eine sehr sehr große hilfe, aber für zu hause ist das alles unrealistisch. \nin meiner ersten klinik haben sie mit kalorienplänen gearbeitet und obwohl ich davor nie auf kalorien geachtet habe, wird dich dann davon komplett eingenommen und sehe lebensmittel jetzt nur noch als zahlen… einfach frustrierend alles 🥹",
          "created_utc": 1665319705.0
        },
        {
          "id": "iro392a",
          "author": "notsure22222",
          "body": "can we type in english so everyone can read",
          "created_utc": 1665342128.0
        }
      ]
    }
  ]
}