{
  "id": "yazxe1",
  "subreddit": "fuckeatingdisorders",
  "author": "Accomplished_Act412",
  "created_utc": 1666476044.0,
  "title": "recovery is easier when you're pretty doing it",
  "selftext": "i hope this doesn't trigger anyone and i really don't want to come across rude or insensitive. \nbut im really jealous and envious of those who can recover and still look pretty and barely gain any weight. i gained SO much SO fast because i was so hungry. but i feel so guilty when looking at all the \"recovery influencers\" who are still slim after being in recovery for a while, and being able to have normal sized meals (not huge meals like me because I'm just ravenous).. they're also able to have a social life outside of their recovery, whereas i have totally isolated myself because I'm so ashamed of how my body looks. then i see on social media these beautiful individuals in recovery who post \"keep going 🥺💖\" and it's just stressing me out because ITS SO EASY FOR YOU TO SAY.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/yazxe1/recovery_is_easier_when_youre_pretty_doing_it/",
  "score": 156,
  "num_comments": 16,
  "comments": [
    {
      "id": "itevr58",
      "author": "Brennir10",
      "body": "A lot of “recovery influencers “ are not actually recovered. When you are comparing yourself to others make sure you remember you have no idea what is going on behind the scenes.",
      "created_utc": 1666493769.0,
      "score": 116,
      "context": []
    },
    {
      "id": "itfe2xq",
      "author": "epixcpersona",
      "body": "Those recovery influencers are a scam, except few. They still eat no human portions at all, that's what I saw on tiktok, or just work it all out. Working out is fine but not to the extremum. Also they always show the \"healthy\" foods. Yesterday at my EH i didnt care what I ate! Just wanted to finally be full.",
      "created_utc": 1666505466.0,
      "score": 46,
      "context": []
    },
    {
      "id": "itg07ld",
      "author": "highlandharris",
      "body": "If I were you I would just unfollow them all, especially if they are making you feel like this, everyone's recovery is different and I'm not sure posting about it on social media is entirely helpful because you second guess yourself, how can they eat that? why do/don't I struggle with this? Maybe I'm not as Ill as I thought? Maybe my recovery isn't valid? Everybody is different and every body is different, the likelyhood is that they are maybe not fully recovered and you are really only seeing what they want you too. Focus on what is important, you and recovering for you.",
      "created_utc": 1666523396.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ite53ep",
      "author": "busted3000",
      "body": "I understand why you think this, but as someone who has recovered (well weight restored, I’m still working towards full mental recovery) into a fairly slim body I can assure you it doesn’t really make the process easier. I’ve still gone through periods of isolating myself from people because I hated how my body looked with gaining weight even if it wasn’t realistically very much weight. My ED didn’t really believe that it wasn’t very much weight. I’ve still struggled to socialise because I was ashamed of the quantities of food I was eating compared to everyone else, I’ve still had acne breakouts, I’ve still had the really intense (and hot) recovery farts that made me not wanna be around anyone. I’ve still experienced all the mental distress of ignoring the ED thoughts. \n\nEating disorders are mental illnesses and that means what weight you are doesn’t necessarily effect how you feel, and that carries over to recovery. Recovering into a slim body doesn’t necessarily mean you **feel** pretty or beautiful, no matter how others may view you. I pretty much followed the path you describe in here, but only now after over a year of (more or less) recovery do I actually feel pretty sometimes, and I can assure you that encouraging to people to continue because it gets better has never been any easier for me to say just because I’m still quite slim.",
      "created_utc": 1666480846.0,
      "score": 29,
      "context": []
    },
    {
      "id": "itj9p7p",
      "author": "kmbell333",
      "body": "My comment was NOT a diet tip, btw. I was fucking recovering and facing extreme hunger and cravings. Wtf is wrong with these mods",
      "created_utc": 1666574739.0,
      "score": 4,
      "context": []
    },
    {
      "id": "itgzlss",
      "author": "None",
      "body": "Recovery influencers who are underweight are still disordered and usually have moved into the realm of orthorexia",
      "created_utc": 1666541438.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ithfq6n",
      "author": "Spectrachic311311",
      "body": "Yes! I found my whole face shape changed when I got weight restored the first time and it sent me into relapse. I wish I could recover and keep my low normal BMI, but my body just genuinely isn’t happy there.",
      "created_utc": 1666547843.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ith25yb",
      "author": "psychieintraining",
      "body": "It’s true. It might be just as mentally tough on anyone as their fear of gaining weight is there no matter what size they get to, but someone who recovers into a small body won’t face nearly the same pain as someone who recovers into a larger body.\n\nBut, as others have noted, most recovery ppl on SM are not really recovered. I don’t find it helpful to follow them anymore. I go out of my way to follow fat ppl in recovery who get it.",
      "created_utc": 1666542479.0,
      "score": 2,
      "context": []
    },
    {
      "id": "itgf6s8",
      "author": "MaryContrary26",
      "body": "I've only seen a few of these \"recovery\" videos but what I saw, from an objective perspective as someone long recovered who worked in recovery, was people using \"recovery\" as a hook to draw viewers and most of it was \"go through my day with me as I show you what my life is like and I'll give you a few minutes of food related content\".  It struck me as purely attention seeking having little to do with actual recovery and the \"meals\" were meager, totally insufficient. I think that if someone wants to be an influencer but doesn't have celebrity or talent this is a niche that will attract viewers and they know that. Otherwise, who would spend 10 minutes watching someone sip a drink and talk about nothing? Lol. It was insufferable.",
      "created_utc": 1666532438.0,
      "score": 2,
      "context": []
    },
    {
      "id": "itgwgwd",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1666540134.0,
      "score": 2,
      "context": []
    },
    {
      "id": "itffyap",
      "author": "Ihateeating23848",
      "body": "Exactly",
      "created_utc": 1666506940.0,
      "score": 1,
      "context": []
    },
    {
      "id": "itht85t",
      "author": "busted3000",
      "body": "Sadly very true, even if they are recovered you have to remember that the same as any other type of influencer, you’re only seeing a carefully curated and staged snapshot of what they want you to see, not the messy parts.",
      "created_utc": 1666552942.0,
      "score": 4,
      "context": [
        {
          "id": "itevr58",
          "author": "Brennir10",
          "body": "A lot of “recovery influencers “ are not actually recovered. When you are comparing yourself to others make sure you remember you have no idea what is going on behind the scenes.",
          "created_utc": 1666493769.0
        }
      ]
    },
    {
      "id": "itfg0rm",
      "author": "Ihateeating23848",
      "body": "Me too, irs been like that everyday my stomach hurts so much rn 😭",
      "created_utc": 1666506994.0,
      "score": 4,
      "context": [
        {
          "id": "itfe2xq",
          "author": "epixcpersona",
          "body": "Those recovery influencers are a scam, except few. They still eat no human portions at all, that's what I saw on tiktok, or just work it all out. Working out is fine but not to the extremum. Also they always show the \"healthy\" foods. Yesterday at my EH i didnt care what I ate! Just wanted to finally be full.",
          "created_utc": 1666505466.0
        }
      ]
    },
    {
      "id": "ithal7c",
      "author": "June211960",
      "body": "This is so true they replace restriction with excessive exercise. They are not recovered at all.",
      "created_utc": 1666545870.0,
      "score": 2,
      "context": [
        {
          "id": "itfe2xq",
          "author": "epixcpersona",
          "body": "Those recovery influencers are a scam, except few. They still eat no human portions at all, that's what I saw on tiktok, or just work it all out. Working out is fine but not to the extremum. Also they always show the \"healthy\" foods. Yesterday at my EH i didnt care what I ate! Just wanted to finally be full.",
          "created_utc": 1666505466.0
        }
      ]
    },
    {
      "id": "ite9d04",
      "author": "Accomplished_Act412",
      "body": "thank you so much for sharing this<3 i hope my post didn't come across insensitive, i think i was just really frustrated in the moment. i just personally believe that i would find recovery easier if my weight gain was slower (but then again, that's not really recovery then if I'm still obsessing over weight. instead, it's the Ed tricking me into engaging in disordered behaviours to suppress my body weight) 💗 also, i just feel the need to mention that anyone's feelings are completely valid despite their weight/body size.",
      "created_utc": 1666482841.0,
      "score": 13,
      "context": [
        {
          "id": "ite53ep",
          "author": "busted3000",
          "body": "I understand why you think this, but as someone who has recovered (well weight restored, I’m still working towards full mental recovery) into a fairly slim body I can assure you it doesn’t really make the process easier. I’ve still gone through periods of isolating myself from people because I hated how my body looked with gaining weight even if it wasn’t realistically very much weight. My ED didn’t really believe that it wasn’t very much weight. I’ve still struggled to socialise because I was ashamed of the quantities of food I was eating compared to everyone else, I’ve still had acne breakouts, I’ve still had the really intense (and hot) recovery farts that made me not wanna be around anyone. I’ve still experienced all the mental distress of ignoring the ED thoughts. \n\nEating disorders are mental illnesses and that means what weight you are doesn’t necessarily effect how you feel, and that carries over to recovery. Recovering into a slim body doesn’t necessarily mean you **feel** pretty or beautiful, no matter how others may view you. I pretty much followed the path you describe in here, but only now after over a year of (more or less) recovery do I actually feel pretty sometimes, and I can assure you that encouraging to people to continue because it gets better has never been any easier for me to say just because I’m still quite slim.",
          "created_utc": 1666480846.0
        }
      ]
    },
    {
      "id": "ithvtxm",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 10. Please contact the mods if you have any doubts.",
      "created_utc": 1666553913.0,
      "score": 0,
      "context": [
        {
          "id": "itgwgwd",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1666540134.0
        }
      ]
    }
  ]
}