{
  "id": "ykojvu",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1667439024.0,
  "title": "Fuck whatever body type or diet is trending right now - recovery was hard and I'm never going back",
  "selftext": "I know the 90's heroin chic or whatever body type is in vogue again right now, and honestly? I'm done. I don't care anymore. I restricted heavily in 2020 and lost a lot of weight and I still felt like that wasn't enough. I ended up binge eating and over-exercising for two years and now I still struggle with it occasionally. \n\nI'm about 90% recovered now and I have a generally healthy relationship with food and my body, except on really bad days. Recovery genuinely felt like it took forever. The urges and the disordered thoughts stick with you, and they only get louder and more frequent when you give in.\n\nI don't live to look good. I live to be healthy and strong. This shit I see online isn't going to fool me into starving myself again.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ykojvu/fuck_whatever_body_type_or_diet_is_trending_right/",
  "score": 141,
  "num_comments": 7,
  "comments": [
    {
      "id": "iuumi56",
      "author": "alloson_1derlnd",
      "body": "Yes to this!\n\nAlso, the fact that there are there are “trendy” body types is SO messed up. \n\nWe don’t have “trending” heights, eye color, or other things about our bodies we can’t control. \n\nI feel like the phenomenon of “trendy” body types is just another way our society had decided to shame women. I honestly never bought too much into the idea that there is a lot of misogyny in our society until I started ED recovery. Maybe I’m totally off base here, but on the other hand, you rarely hear about trendy body types for men. \n\nBut anyway, yeah! Love your attitude!",
      "created_utc": 1667444849.0,
      "score": 38,
      "context": []
    },
    {
      "id": "iuuil1q",
      "author": "northdakotanowhere",
      "body": "I love this!!! Congratulations on your progress. \n\nI like to think I'm on the \"other side\" now but have to be careful not to get too cocky I guess. My last relapse happened pretty suddenly. \n\nI'm too tired to be in that mindset anymore. It's a beautiful thing to not be assaulted by that horrible voice anymore. \n\nI have a lot of minor behaviors that can build into bigger ones but ive come too far and learned too much to go back.\n\nI'm really freaking proud of you!!! Fuck eating disorders!",
      "created_utc": 1667442955.0,
      "score": 14,
      "context": []
    },
    {
      "id": "iuvlt9p",
      "author": "blissfulboo",
      "body": "this exactly. when i went into recovery i had an ideal body in mind (which was still me being stuck in my ED) but now i’m just accepting the body that recovery gave me. it’s not worth the mental anguish that i had during my ED. recovery is so freeing and i’m also not going back🤍you’ve got this",
      "created_utc": 1667471754.0,
      "score": 4,
      "context": []
    },
    {
      "id": "iuuy0wl",
      "author": "dealingwthstff",
      "body": "EXACTLY, you said everything that needed to be said. I’m proud of you❤️",
      "created_utc": 1667451542.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j0cg89v",
      "author": "None",
      "body": "The last paragraph of your post is helping more than I can describe.",
      "created_utc": 1671124586.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iuuw7sr",
      "author": "None",
      "body": "Yes! The worst thing is that these \"trendy\" body types are usually never achieved unless women go through plastic surgery (BBLs, liposuction) or undergo rigorous dieting, which is unrealistic because the average woman has responsibilities that require energy (which you don't really have when you're starving). \n\nWomen are almost always socialized to never be happy with their bodies so our insecurities can be profited off of. It's ridiculous. I don't wanna subscribe to any of these ideas.",
      "created_utc": 1667450349.0,
      "score": 14,
      "context": [
        {
          "id": "iuumi56",
          "author": "alloson_1derlnd",
          "body": "Yes to this!\n\nAlso, the fact that there are there are “trendy” body types is SO messed up. \n\nWe don’t have “trending” heights, eye color, or other things about our bodies we can’t control. \n\nI feel like the phenomenon of “trendy” body types is just another way our society had decided to shame women. I honestly never bought too much into the idea that there is a lot of misogyny in our society until I started ED recovery. Maybe I’m totally off base here, but on the other hand, you rarely hear about trendy body types for men. \n\nBut anyway, yeah! Love your attitude!",
          "created_utc": 1667444849.0
        }
      ]
    },
    {
      "id": "iuuwerk",
      "author": "None",
      "body": "Thank you! I hope you're already out of your relapse and are on your way to being recovered again if you aren't already :)\n\nI also have some \"leftover\" ED behaviors, but they're not as rigid as they used to be. For example, I still loosely track my kcals, but it's more of a tool to recover from BED more than anything. \n\nTHANK YOU! I'm proud of you too >:)) EDs can suck it.",
      "created_utc": 1667450477.0,
      "score": 3,
      "context": [
        {
          "id": "iuuil1q",
          "author": "northdakotanowhere",
          "body": "I love this!!! Congratulations on your progress. \n\nI like to think I'm on the \"other side\" now but have to be careful not to get too cocky I guess. My last relapse happened pretty suddenly. \n\nI'm too tired to be in that mindset anymore. It's a beautiful thing to not be assaulted by that horrible voice anymore. \n\nI have a lot of minor behaviors that can build into bigger ones but ive come too far and learned too much to go back.\n\nI'm really freaking proud of you!!! Fuck eating disorders!",
          "created_utc": 1667442955.0
        }
      ]
    }
  ]
}