{
  "id": "ymzlq9",
  "subreddit": "fuckeatingdisorders",
  "author": "malewifejohan",
  "created_utc": 1667667479.0,
  "title": "the portrayal of extreme hunger online is kind of ass",
  "selftext": "ive been noticing a lot of videos, especially on tik tok of \"what i eat in a day! extreme hunger!!\" and its really just what most people would consider a normal day of eating, maybe with a few extra snacks. not to mention theres usually a full body shot or bodycheck somewhere in the video. there's no such thing as 'eating too much' while in recovery/weight restoration but these videos make it really easy to feel like that. its almost like there's still that competitive aspect of 'im in recovery and im still eating less than you!!' \n\nextreme hunger definitely looks different for everyone, but if you KNOW that even with extreme hunger, you're eating just about half (or less) than what other people might be eating, is it really necessary to post? \n\nwhen i first started experiencing eh i thought there was something weong with me because i was eating 2-4x the people in these videos. it felt so isolating and the process of learning to honor my hunger would have been easier had i seen more representation of people who ate like me",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ymzlq9/the_portrayal_of_extreme_hunger_online_is_kind_of/",
  "score": 119,
  "num_comments": 23,
  "comments": [
    {
      "id": "iv6bmcv",
      "author": "namey_9",
      "body": "I don't use tiktok and don't watch vids that say \"what i eat in a day\" on any platform. I think, at the end of the day, part of recovery is learning to trust your own (or a medical professional's) assessments of what is reasonable instead of comparing ourselves to strangers online.",
      "created_utc": 1667668710.0,
      "score": 55,
      "context": []
    },
    {
      "id": "iv7ufv7",
      "author": "Fitkratomgirl",
      "body": "If you haven't yet you should check out Emily Spence on YouTube, she kinda addresses this, talks about how she was too busy eating so much to even document it all! lol",
      "created_utc": 1667691995.0,
      "score": 15,
      "context": []
    },
    {
      "id": "iv6i6zv",
      "author": "Specific-Raise-931",
      "body": "Honestly a few months ago I decided I was never going to watch another ‘what I eat in a day’ video. Best decision I ever made for my recovery, they’re absolutely toxic. I didn’t even realise how toxic until I stopped exposing myself to them.",
      "created_utc": 1667671356.0,
      "score": 29,
      "context": []
    },
    {
      "id": "iv7xvk0",
      "author": "MeanDuck611",
      "body": "When I had extreme hunger for a few months I ate about ~5,000 cal a day. I got bloated, I was always hungry even if I was about to puke from eating so much, was fatigued, and overall felt like shit.",
      "created_utc": 1667693489.0,
      "score": 12,
      "context": []
    },
    {
      "id": "iv6zcva",
      "author": "mykindabook",
      "body": "I only find myself *genuinely* wanting to watch them when I’m relapsing/not in recovery. If I’m attempting to recover I avoid those like plague",
      "created_utc": 1667678517.0,
      "score": 22,
      "context": []
    },
    {
      "id": "iv7lm1n",
      "author": "SmolBeanAmina",
      "body": "\"What I eat in a day (recovery edition) 🥰\"\n\nShows a mirror shot in a crop top and shorts.\n\nLike cmon they know what they are doing, idk about tiktok but my insta discovery page was full of these and it took me so long to clean it and fill it with actual recovery content\n\nI had to unfollow several recovery accounts cause they kept posting (very obvious) body checks and the comments never called it out !! It was always something encouraging the creator\n\nAlso the people who post their foods with their wrists in the shot.. ahh",
      "created_utc": 1667688132.0,
      "score": 21,
      "context": []
    },
    {
      "id": "iv6xh3w",
      "author": "Spectrachic311311",
      "body": "I know what you mean. My EH episodes are fairly chaotic. I eat a lot of random things and it usually adds up to a LOT of food. I don’t think people portraying it online are necessarily posting everything if they actually are honoring EH.",
      "created_utc": 1667677716.0,
      "score": 11,
      "context": []
    },
    {
      "id": "iv7c9jy",
      "author": "Hungry_Bookkeeper191",
      "body": "i saw a girl on instagram posting “extreme hunger eat with me!” and i swear she just ate a couple chocolates. \n\ni’m honestly trying to avoid these accounts but they keep coming up?? i swear i need a way to filter out every instagram acc with “fit” in the username bc they’re all triggering recovery accounts",
      "created_utc": 1667683999.0,
      "score": 8,
      "context": []
    },
    {
      "id": "iv86z92",
      "author": "Pastinaaktaart",
      "body": "Oh...I don’t use tiktok...but I ofc know what’s going on...Does those people feel like having a strange&disorder-full flex? Nah...extreme hunger hits like a truck. And, it is definitely not “couple more tiny snacks hahaha”. But also, I cannot so harshly judge those people. Everyone has different metabolism. That is why, it is totally not sense making to compare ourselves with others. For ex. I’ve been hiding my anorexia quite easily due to my quite fast metabolism. It looked like I ate “normal” from outside to people who don’t know me but, I ate about half of what my body really needs. Some people also have quite slow metabolism. Their “binge” can look normal-ish but, it can be waaaay more then their so-called caloric needs. If you have extreme hunger, you have extreme hunger. Do not compare. For me it was two huge white chocolate bars (even though I don’t like white chocolate) a vegan hot dog (I actually hate hot dogs...) cheese croissant and a huge american style cookie and a quarter extra sweet apple-pie as a lunch. (Imagine the dinner and breakfast) \nExtreme hunger has many roots...I think...\nRelated to physical-hunger, psychological-hunger due to starvation and emotional hunger due to trying to recover. \n\nIt is an “extreme” issue to handle...emotionally too!\n\nSo, do not compare it. There’ll be always some bullsh🦋t online that will make you feel uneasy. But! That is your body and your recovery!",
      "created_utc": 1667697514.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ivaf9cp",
      "author": "busted3000",
      "body": "The competitive nature of EDs is so hard to overcome. As well as the fact that people don’t necessarily show everything they eat, or are not necessarily fully honouring their hunger, even if they are; what anyone else does or doesn’t eat has no relevance on what your body needs. If these videos aren’t helpful for you, unsubscribe. Fill your feed with content that *is* positive for you, or just walk away from social media for a while. Your journey is your own.",
      "created_utc": 1667747062.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iv6yi5f",
      "author": "Brennir10",
      "body": "So our culture is saturated in diet culture and so is all forms of social media. Just unsubscribe. My social media feeds are cute animal videos, nature pictures,some mindfulness/meditation stuff, and a few TV shows I really like. Diet culture seeps into everything ( including a LOT of people’s recoveries) so I’d consider anything food, weight or even eating disorder related as primarily unsafe",
      "created_utc": 1667678154.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ivae0vf",
      "author": "givemebackmybraincel",
      "body": "this!!!! i felt so isolated by those until i started avoiding them like the plague. at the beginning of my recovery i only wore my dads 3XL sweaters, had a sheet over my mirror, left my part time job, and was easily eating 10-20k+ cals a day... just to see someone in a video wearing a crop top go omg 3000k??? so much omg haha so hungry haha :/ i get everyones experience is different but no one can convince me that majority of that content is not still disordered behaviour (imo)",
      "created_utc": 1667746535.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ivan7bq",
      "author": "blissfulboo",
      "body": "the few times i went through extreme hunger in the past, i was RAVENOUS and felt like a literal bottomless pit. it was nothing like people portray it to be. the people who make these posts aren’t accurately representing extreme hunger and they definitely shouldn’t label it as such. i feel your frustration, OP.",
      "created_utc": 1667750304.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iv7op0y",
      "author": "dollszn",
      "body": "at my peak i ate up to 3,000 - 3,500 cals a day, tik tok isn’t reality",
      "created_utc": 1667689477.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iv8t7uf",
      "author": "kkumas",
      "body": "Tbh i would only watch people who have already gone through recovery.  A lot of people who post their recovery journals are still sick and obviously are still looking for validation..\n\nBut that being said.  You have to stop comparing.  When i was in recovery i was practicing hard to just see other peoples bodies as…just a body.\n\nBut ya my EH i think i ate 10k a few days in the beginning hehe 👀",
      "created_utc": 1667708022.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivf62vk",
      "author": "LateFile8300",
      "body": "Best series for this, I've found, which seems unique, is \"Hat Will/DID BEat this\".   I honestly didn't even realize it was technically WIEIAD until their EH video played as it is more of a friendly, inspiring series of information/meals during recovery involving zero body beyond the artist's hands.  [https://www.youtube.com/channel/UC0uEzvYAlH1VD4EZXwA9gXg/videos](https://www.youtube.com/channel/UC0uEzvYAlH1VD4EZXwA9gXg/videos)",
      "created_utc": 1667833487.0,
      "score": 1,
      "context": []
    },
    {
      "id": "iv6egnc",
      "author": "malewifejohan",
      "body": "definitely! im definitely not saying it isnt, but to people who are very early in recovery and/or without the privilege of professional help, seeing videos like this left and right when you're searching for recovery-related content makes it difficult not to compare, especially when it could be purposely competitive by the poster",
      "created_utc": 1667669847.0,
      "score": 15,
      "context": [
        {
          "id": "iv6bmcv",
          "author": "namey_9",
          "body": "I don't use tiktok and don't watch vids that say \"what i eat in a day\" on any platform. I think, at the end of the day, part of recovery is learning to trust your own (or a medical professional's) assessments of what is reasonable instead of comparing ourselves to strangers online.",
          "created_utc": 1667668710.0
        }
      ]
    },
    {
      "id": "iv7w9yv",
      "author": "pterodactylleg",
      "body": "i second this! emily is awesome, her instagram was super helpful for me too",
      "created_utc": 1667692788.0,
      "score": 8,
      "context": [
        {
          "id": "iv7ufv7",
          "author": "Fitkratomgirl",
          "body": "If you haven't yet you should check out Emily Spence on YouTube, she kinda addresses this, talks about how she was too busy eating so much to even document it all! lol",
          "created_utc": 1667691995.0
        }
      ]
    },
    {
      "id": "iv8h4to",
      "author": "malewifejohan",
      "body": "it was actually her \"is my extreme hunger too extreme\" video that got me to truly realize that my extreme hunger was normal and that no amount of food with eh is too much even if it may feel like it",
      "created_utc": 1667702085.0,
      "score": 7,
      "context": [
        {
          "id": "iv7ufv7",
          "author": "Fitkratomgirl",
          "body": "If you haven't yet you should check out Emily Spence on YouTube, she kinda addresses this, talks about how she was too busy eating so much to even document it all! lol",
          "created_utc": 1667691995.0
        }
      ]
    },
    {
      "id": "iv8hbr6",
      "author": "malewifejohan",
      "body": "me too! ive been eating around 4000-6000 and even if im physically uncomfortably full, mentally i am RAVENOUS",
      "created_utc": 1667702170.0,
      "score": 9,
      "context": [
        {
          "id": "iv7xvk0",
          "author": "MeanDuck611",
          "body": "When I had extreme hunger for a few months I ate about ~5,000 cal a day. I got bloated, I was always hungry even if I was about to puke from eating so much, was fatigued, and overall felt like shit.",
          "created_utc": 1667693489.0
        }
      ]
    },
    {
      "id": "iv7tksx",
      "author": "pterodactylleg",
      "body": "i wouldn’t really consider this extreme hunger, these are recovery minimums",
      "created_utc": 1667691612.0,
      "score": 5,
      "context": [
        {
          "id": "iv7op0y",
          "author": "dollszn",
          "body": "at my peak i ate up to 3,000 - 3,500 cals a day, tik tok isn’t reality",
          "created_utc": 1667689477.0
        }
      ]
    },
    {
      "id": "iv6ggsx",
      "author": "namey_9",
      "body": "I hear you. Sometimes it helps to step away from social media entirely. I realize that's kinda silly to say on Reddit though lol\n\nGood luck to you in your recovery <3",
      "created_utc": 1667670661.0,
      "score": 13,
      "context": [
        {
          "id": "iv6bmcv",
          "author": "namey_9",
          "body": "I don't use tiktok and don't watch vids that say \"what i eat in a day\" on any platform. I think, at the end of the day, part of recovery is learning to trust your own (or a medical professional's) assessments of what is reasonable instead of comparing ourselves to strangers online.",
          "created_utc": 1667668710.0
        },
        {
          "id": "iv6egnc",
          "author": "malewifejohan",
          "body": "definitely! im definitely not saying it isnt, but to people who are very early in recovery and/or without the privilege of professional help, seeing videos like this left and right when you're searching for recovery-related content makes it difficult not to compare, especially when it could be purposely competitive by the poster",
          "created_utc": 1667669847.0
        }
      ]
    },
    {
      "id": "iv7unuz",
      "author": "dollszn",
      "body": "my dietitian told me differently but EH is very subjective and i definitely didn’t mean that eating above 3,500 isn’t normal! there were days where i ate 5,000 cals easily",
      "created_utc": 1667692088.0,
      "score": 4,
      "context": [
        {
          "id": "iv7op0y",
          "author": "dollszn",
          "body": "at my peak i ate up to 3,000 - 3,500 cals a day, tik tok isn’t reality",
          "created_utc": 1667689477.0
        },
        {
          "id": "iv7tksx",
          "author": "pterodactylleg",
          "body": "i wouldn’t really consider this extreme hunger, these are recovery minimums",
          "created_utc": 1667691612.0
        }
      ]
    }
  ]
}