{
  "id": "ypgd3g",
  "subreddit": "fuckeatingdisorders",
  "author": "None",
  "created_utc": 1667898306.0,
  "title": "I KNOW THIS HAS BEEN SAID BEFORE BUT I'M UNSUBBING FROM EDANONYM/OUS 😭😭",
  "selftext": "I know it's an ED Group, but it's starting to feel so pro-ana? Like, every 20 hours or so you get a post talking about how good they feel restricting. Or you get:\n\n\"Will I gain weight if I eat xyz?\"\n\"Does anyone feel prettier while restricting?\"\n\"I just binged, how do I get back on track?\"\n\nFirst of all, I get it - again, it's an ED Group. People will discuss safe foods, triggers, etc. but just now I saw someone post about how their \"fat coworker\" was triggered into mimicking their eating habits. And then someone in the comments said regular people don't have it in them to restrict??? And someone responded saying they felt validated???????\n\nI'm sorry, that sub is just so triggering 😭 I'm recovered and I usually just lurk on ED subs because hey, it's still relatable. Goddamn though. That sub is so weirdly pro-restriction and pro-skinny.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/ypgd3g/i_know_this_has_been_said_before_but_im_unsubbing/",
  "score": 230,
  "num_comments": 66,
  "comments": [
    {
      "id": "ivja9mm",
      "author": "SLEG48",
      "body": "Yup, although there’s nothing wrong with a space to vent/share your eating disorder struggles **in theory**, an echo chamber of harmful behaviors, intense self loathing, subtle competition, and an overall detriment to your recovery is created by staying too long.\n\nr/EDAnonymous is NOT a recovery sub and if you plan on recovering, you should probably cut ties with it, it can be pretty harmful for you in the long run 😬",
      "created_utc": 1667907147.0,
      "score": 111,
      "context": []
    },
    {
      "id": "ivj8zbk",
      "author": "SmolBeanAmina",
      "body": "When I joined I thought it was just a neutral space to vent and stuff but sometimes people encourage others' habits and I.. was just in awe. Especially for a group that claims to not be pro-ana. Pro-ana isn't always explicit, it can be in very small things. Not a good space to be in whether you are sick or recovering, I had to leave it. The reason why I was able to start recovering was that I joined recovery spaces even when I was sick, so instead of people encouraging my bad habits they'd encourage the good ones",
      "created_utc": 1667906167.0,
      "score": 53,
      "context": []
    },
    {
      "id": "ivj40y9",
      "author": "rileyyj001",
      "body": "Unfortunately, I agree with this, and wish I felt the opposite. I have seen so many of the posts you’ve mentioned. I joined knowing full well this isn’t an active “pro-recovery” space. However, there is a pretty clear line (IMO) of “pro-ana” vs being a neutral, safe space.",
      "created_utc": 1667901953.0,
      "score": 64,
      "context": []
    },
    {
      "id": "ivj8udb",
      "author": "callmedylanelliot",
      "body": "(Imo it has always been vagualy pro ana, or at least not really \"into\" recovery)",
      "created_utc": 1667906059.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ivjjk5c",
      "author": "messythelioma",
      "body": "They're also sometimes so mean about it when other people bring it up... Like, I've seen some similar sentiments that you've written here made in ED anon and you'll get a plethora of people getting mad at them for sharing their feelings...\n\nI saw the other day that one person suggested people come here to this sub, but then another person replied saying how we're worse over here... I don't know, but this sub is the only thing that's keeping me sane and has actually helped in recovery.",
      "created_utc": 1667912931.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ivjjvmv",
      "author": "throwaway787878786",
      "body": "many people from edtwt are coming into ed reddit and they have to hide it if they’re fatphobic (they said it themselves) and i guess that you will see some of their true colors whenever they can without crossing the boundary of “ed talk” vs “pro ana”",
      "created_utc": 1667913104.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ivj1kfl",
      "author": "None",
      "body": "Haha I feel the same too and want to move to other fun spaces in Reddit.",
      "created_utc": 1667899692.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ivjibct",
      "author": "Somewhere-Practical",
      "body": "Yeah, as someone who’s first ED was pre-tumblr and so who’s triggering content at the time was vegan forums and forums dedicated to adults trying to lose weight…edanony was an eye opener. I didn’t find it that triggering (at least, not as triggering as my one month of tiktok) because my habits are more “30-something attorney with RED-S/maybe an at times ED,” and the posters in edanony appear to be about half my age, but it just made me uncomfortable and sad. I am so fortunate those spaces didn’t exist or were harder to find when I was a kid.",
      "created_utc": 1667912256.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ivjq2ri",
      "author": "davidsasselhoff",
      "body": "I actually just unsubscribed less than an hour ago. I rarely see posts anymore but when I do it's just full of humble brags about how sick they are. Or people spreading completely untrue beliefs about nutrition.\n\nI can't tell if the sub has always been this bad, or if I've just changed and reached a good place in recovery.",
      "created_utc": 1667916145.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ivktvvo",
      "author": "cheapfriedclams",
      "body": "The last straw from me was when they said fat people can’t have anorexia.",
      "created_utc": 1667932011.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ivkv7t9",
      "author": "cricketjacked",
      "body": "Just like with r/EDAnonymemes, every other post is about someone getting ridiculed by their partner for gaining weight and the post is flooded with pro-ana comments. It also makes me want to relapse because, if that many people are being told to lose weight by their partners, then I need to \"get ahead of the game\". It's like a constant reminder that I'm single (and therefore unlovable) because my body doesn't meet the unspoken standards of other people, particularly people I'm attracted to.\n\nWhat's really scary about this is that my ED arose from a desire to control and was initially health obsessed (like orthorexia but with more chaos). As someone who developed an eating disorder without body image issues, the sub is literally giving me body image issues when I didn't have them.",
      "created_utc": 1667932514.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ivj7kt6",
      "author": "katarina-stratford",
      "body": "I swear I report posts for being pro every time I look at that sub. The fact that such a concept exists makes me want to cry.",
      "created_utc": 1667905055.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ivkdw27",
      "author": "myqueershoulder",
      "body": "The adult EdA sub is an even bigger nightmare!! People legitimately asking for restriction buddies…like is the 20011 Tumblr or what?? I was shocked, I thought it would be more around what it’s like to make a living/raise a family while having an ED but it’s really just another place for people to enable their disordered habits. I think that was a wakeup call for me actually - realizing that if I don’t get my shit together soon I’m going to be one of those adults whose lives are so taken over by their ED that they’re still resorting to behaviours they used as a teen.",
      "created_utc": 1667925876.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ivkz76l",
      "author": "highacidcontent",
      "body": "I've been thinking this too!! All the \"name your favorite low-cal snack<3\" and \"what are your fear foods?\" \"I love restricting and I don't want to recover<3<3\" \"how do you hide xyz behavior\" posts?? WHATS GOING ON?\n\nIn AA nobody would go \"my favorite drink is whisky, what's your drink of choice?\" or \"can you give me advice on how to continue drinking without anyone noticing?\" etc.\n\nI know, it's not a recovery sub, but actively supporting other peoples disorders like they do there? What the fuck.",
      "created_utc": 1667934016.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ivj67dq",
      "author": "LoveThatForYouBebe",
      "body": "That post and comments hit me the same way. Like…yeah, not a vibe I enjoy.",
      "created_utc": 1667903910.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ivjrsvk",
      "author": "Liuzzaa",
      "body": "Its so pro Ana I remember when I was heavily anorexic and not wanting to recover id go there for tips and advice :( it’s so sad and messed up that sub should get taken down tbh",
      "created_utc": 1667916931.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ivjvtlo",
      "author": "lifestrengthsong",
      "body": "When I entered treatment, I noticed how triggered I felt reading that subreddit and realized that a good portion of the posts seemed anti-recovery. I unfollowed and don’t regret it.\nYou’re definitely not alone.",
      "created_utc": 1667918653.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ivkqwok",
      "author": "Sareeee48",
      "body": "I’ve felt this way even before recovery and shared my thoughts about it here before. That sub always felt very unhelpful and kept me in my disorder a lot longer because it kinda “normalized” everything.\n\nIt’s not that I think having a bad lace to vent, especially when you aren’t in recovery, but it’s not heavily moderated like it needs to be, which is an issue when you have disordered individuals with very distorted perspectives on reality talking to other disordered individuals with very distorted perspectives on reality. If you’re running a space dedicated to a mental disorder/illness you’re bound to have discussions regarding disordered behaviors… the issue is when you begin to spread harmful information that *promotes* disordered behavior. It’s not really anyone’s fault that happens, but that’s why I really try to make sure this sub is always monitored… because if it weren’t, it would go downhill quickly.",
      "created_utc": 1667930878.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ivl4uh9",
      "author": "tbibbly",
      "body": "They also don't believe in Extreme hunger from restriction, they just call it binging so, that fucking hurts 🥲 Like they actively diss this sub for supporting extreme hunger.",
      "created_utc": 1667936175.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ivjq3c0",
      "author": "None",
      "body": "I agree, it's very triggering. Like, I get it, I have really fucked up ED thoughts but there is a big difference between having them and posting them so that other people can go \"oh me too,\" it sort of validates them. Also there's constant normalization of behaviors that may be ok for people without EDs but dangerous af for people with EDs and the \"well, {this behavior} is bad for people with ana but fine for everyone else\" like so many of us don't have a competitive side to the illness and I'm so not here for it. There's still a lot of good stuff on there and I'm glad I found it because it did help me but I had to unsub because of this kind of crap.",
      "created_utc": 1667916153.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ivkre92",
      "author": "heyy240",
      "body": "I'm so glad i left now. For a while I wondered if I was missing smth cause I still related to some ed struggles too. But I have been recovering so it would have been so triggering to see that stuff :c",
      "created_utc": 1667931067.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ivl9rog",
      "author": "livimae",
      "body": "It’s really only safe for those in active ed..",
      "created_utc": 1667938037.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ivldn60",
      "author": "iwishiwasabumblebee",
      "body": "I just left EdAnonymous too! I realized today I was too far along in my recovery to hinder it by seeing triggering posts on there, nothing to get triggered by if I’m not a part of the subreddit! :)",
      "created_utc": 1667939515.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ivjb94r",
      "author": "mykindabook",
      "body": "If I were in recovery I wouldn’t be part of any ED/“recovery” space online. They all have their negatives and triggers, you just cannot avoid that",
      "created_utc": 1667907861.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ivl4jsi",
      "author": "swaggysalamander",
      "body": "My first step to recovering was deleting my ed blogs and unfollowing all accounts like that. That is wonderful news and I’m proud of you p",
      "created_utc": 1667936061.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ivm13nv",
      "author": "ED-BeGone",
      "body": "I accidentally deleted my comment haha\n\nYeah, they don't delete comments that I have reported that clearly break their rules. I report them all the time and they never get deleted. Very poorly moderated. I would stay away from that sub if I were anywhere in recovery (and even after, tbh)",
      "created_utc": 1667948814.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ivkew0p",
      "author": "None",
      "body": "Did not sadly notice this before (apparently I just had my (specifically me-not trying to bash teens here- teenage girl brain on) but OMG. Each post is worst on whos the best at winning the eating disorder.",
      "created_utc": 1667926262.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ivnv5bf",
      "author": "MeloenKop",
      "body": "even one time I wouldpost  in there talking  abt smthing while I have been in Recovery  for a while and actually  doing good and I felt so alienated talking  about actually  doing  well like a feeling  judged for actually  recovering.",
      "created_utc": 1667985025.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ivmw3mg",
      "author": "B0urn3D3ad",
      "body": "There’s also such minimal knowledge. Like someone posted about reactive hunger and getting hunger queues after eating etc and a couple commenters tried to tell them that it was insulin resistance 🤨 like yea nope that’s not it at all 😂",
      "created_utc": 1667962589.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iw9rccy",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1668387078.0,
      "score": 0,
      "context": []
    },
    {
      "id": "iwk6avm",
      "author": "None",
      "body": ">\"I just binged, how do I get back on track?\"\n\nJust a friendly reminder that binge eating disorder is a valid eating disorder. Not everyone who binges is struggling with anorexia.",
      "created_utc": 1668578071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ix6zekt",
      "author": "graciesea98",
      "body": "this is old but the name of the sub (or at least where the older posters came from) used to be like “pro ana” or “pro ED” or something so not surprising. they changed it in order to not get deleted by reddit admins but it’s pretty dangerous to allow pro ana content on a sub that doesn’t present itself as such",
      "created_utc": 1669008693.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ivl3uwx",
      "author": "incorrectlyironman",
      "body": "On the flip side I've never unsubscribed and it usually helps motivate me to stay in recovery. It's just daily little sneakpeeks into how much of a shitshow it is to have an eating disorder. \"I shat myself in the grocery store\" \"I promised myself I could have birthday cake today and I just couldn't do it\" \"Boyfriend broke up with me because I wouldn't stop purging\", even \"DAE only experience joy through their ED\". Yeah no fucking thanks to going back to that.",
      "created_utc": 1667935798.0,
      "score": 56,
      "context": [
        {
          "id": "ivja9mm",
          "author": "SLEG48",
          "body": "Yup, although there’s nothing wrong with a space to vent/share your eating disorder struggles **in theory**, an echo chamber of harmful behaviors, intense self loathing, subtle competition, and an overall detriment to your recovery is created by staying too long.\n\nr/EDAnonymous is NOT a recovery sub and if you plan on recovering, you should probably cut ties with it, it can be pretty harmful for you in the long run 😬",
          "created_utc": 1667907147.0
        }
      ]
    },
    {
      "id": "ivjauuy",
      "author": "None",
      "body": "Yeah, I'm sure EDAnonymous was made with good intentions in mind, but over time it really did just become an echo chamber of people constantly bringing up how \"messed up\" or \"sick\" they are - I get it, but sometimes it just comes off as bragging.",
      "created_utc": 1667907574.0,
      "score": 24,
      "context": [
        {
          "id": "ivja9mm",
          "author": "SLEG48",
          "body": "Yup, although there’s nothing wrong with a space to vent/share your eating disorder struggles **in theory**, an echo chamber of harmful behaviors, intense self loathing, subtle competition, and an overall detriment to your recovery is created by staying too long.\n\nr/EDAnonymous is NOT a recovery sub and if you plan on recovering, you should probably cut ties with it, it can be pretty harmful for you in the long run 😬",
          "created_utc": 1667907147.0
        }
      ]
    },
    {
      "id": "ivqqek2",
      "author": "WaterMeronii",
      "body": "Thanks for the advice",
      "created_utc": 1668032972.0,
      "score": 2,
      "context": [
        {
          "id": "ivja9mm",
          "author": "SLEG48",
          "body": "Yup, although there’s nothing wrong with a space to vent/share your eating disorder struggles **in theory**, an echo chamber of harmful behaviors, intense self loathing, subtle competition, and an overall detriment to your recovery is created by staying too long.\n\nr/EDAnonymous is NOT a recovery sub and if you plan on recovering, you should probably cut ties with it, it can be pretty harmful for you in the long run 😬",
          "created_utc": 1667907147.0
        }
      ]
    },
    {
      "id": "ivjaqqj",
      "author": "None",
      "body": "Yeah. I honestly had the impression that it was an ED discussion group for people who weren't quite ready to recover yet. Sadly, it's just been an echo chamber of people subtly bragging about how sick they are, which I assume can make members with non-restrictive EDs (BED, for example) feel like they aren't \"disordered\" enough",
      "created_utc": 1667907492.0,
      "score": 13,
      "context": [
        {
          "id": "ivj8zbk",
          "author": "SmolBeanAmina",
          "body": "When I joined I thought it was just a neutral space to vent and stuff but sometimes people encourage others' habits and I.. was just in awe. Especially for a group that claims to not be pro-ana. Pro-ana isn't always explicit, it can be in very small things. Not a good space to be in whether you are sick or recovering, I had to leave it. The reason why I was able to start recovering was that I joined recovery spaces even when I was sick, so instead of people encouraging my bad habits they'd encourage the good ones",
          "created_utc": 1667906167.0
        }
      ]
    },
    {
      "id": "ivj4aiu",
      "author": "None",
      "body": "Honestly, same :( At first I joined in because I thought it gave off, \"we're sick and it's kind of ridiculous but we're not ready to recover yet so let's talk about it\" energy, but over time it just became very pro-ana/restriction :(",
      "created_utc": 1667902197.0,
      "score": 28,
      "context": [
        {
          "id": "ivj40y9",
          "author": "rileyyj001",
          "body": "Unfortunately, I agree with this, and wish I felt the opposite. I have seen so many of the posts you’ve mentioned. I joined knowing full well this isn’t an active “pro-recovery” space. However, there is a pretty clear line (IMO) of “pro-ana” vs being a neutral, safe space.",
          "created_utc": 1667901953.0
        }
      ]
    },
    {
      "id": "ivllhdm",
      "author": "highacidcontent",
      "body": "I saw that too!! I genuinely don't understand what they're talking about???",
      "created_utc": 1667942489.0,
      "score": 6,
      "context": [
        {
          "id": "ivjjk5c",
          "author": "messythelioma",
          "body": "They're also sometimes so mean about it when other people bring it up... Like, I've seen some similar sentiments that you've written here made in ED anon and you'll get a plethora of people getting mad at them for sharing their feelings...\n\nI saw the other day that one person suggested people come here to this sub, but then another person replied saying how we're worse over here... I don't know, but this sub is the only thing that's keeping me sane and has actually helped in recovery.",
          "created_utc": 1667912931.0
        }
      ]
    },
    {
      "id": "ivj2peu",
      "author": "None",
      "body": "Right? Like, that sub isn't fun, it's weirdly competitive 😭",
      "created_utc": 1667900743.0,
      "score": 12,
      "context": [
        {
          "id": "ivj1kfl",
          "author": "None",
          "body": "Haha I feel the same too and want to move to other fun spaces in Reddit.",
          "created_utc": 1667899692.0
        }
      ]
    },
    {
      "id": "ivl06ds",
      "author": "ontopofyourmom",
      "body": "This sub is.... not \"fun,\" but being part of a community that actually gives mutual support makes me feel good.",
      "created_utc": 1667934387.0,
      "score": 9,
      "context": [
        {
          "id": "ivj1kfl",
          "author": "None",
          "body": "Haha I feel the same too and want to move to other fun spaces in Reddit.",
          "created_utc": 1667899692.0
        }
      ]
    },
    {
      "id": "ivk94hz",
      "author": "the-Starch-Ghoul",
      "body": ">vegan forums\n\nvegan forums are low-key ED forums, ESPECIALLY the wfpb ones. I have never seen such judgementalism and dietary dogmatism as in wfpb groups, especially the more restrictive ones",
      "created_utc": 1667923995.0,
      "score": 12,
      "context": [
        {
          "id": "ivjibct",
          "author": "Somewhere-Practical",
          "body": "Yeah, as someone who’s first ED was pre-tumblr and so who’s triggering content at the time was vegan forums and forums dedicated to adults trying to lose weight…edanony was an eye opener. I didn’t find it that triggering (at least, not as triggering as my one month of tiktok) because my habits are more “30-something attorney with RED-S/maybe an at times ED,” and the posters in edanony appear to be about half my age, but it just made me uncomfortable and sad. I am so fortunate those spaces didn’t exist or were harder to find when I was a kid.",
          "created_utc": 1667912256.0
        }
      ]
    },
    {
      "id": "ivltkhs",
      "author": "efftheestablishment",
      "body": "My thoughts as well, yeah. It feels worse, but sometimes I wonder if that's simply because I've recovered and it's something I wouldn't have blinked at twice when I wasn't. It's probably a bit of both tbh",
      "created_utc": 1667945680.0,
      "score": 2,
      "context": [
        {
          "id": "ivjq2ri",
          "author": "davidsasselhoff",
          "body": "I actually just unsubscribed less than an hour ago. I rarely see posts anymore but when I do it's just full of humble brags about how sick they are. Or people spreading completely untrue beliefs about nutrition.\n\nI can't tell if the sub has always been this bad, or if I've just changed and reached a good place in recovery.",
          "created_utc": 1667916145.0
        }
      ]
    },
    {
      "id": "ivllhk1",
      "author": "None",
      "body": "Yeah, they have no idea how dangerous that can be for members with atypical anorexia who might just see that as a \"push\" to restrict even heavier. They act like having AN is a badge of honor :(",
      "created_utc": 1667942490.0,
      "score": 2,
      "context": [
        {
          "id": "ivktvvo",
          "author": "cheapfriedclams",
          "body": "The last straw from me was when they said fat people can’t have anorexia.",
          "created_utc": 1667932011.0
        }
      ]
    },
    {
      "id": "ivl3fox",
      "author": "incorrectlyironman",
      "body": ">As someone who developed an eating disorder without body image issues, the sub is literally giving me body image issues when I didn't have them. \n\nThis is really interesting to hear from another person. I also developed an ED out of a desire for control, then started obsessively seeking out food related content (bc starvation naturally leads to food obsession), *then* developed body image issues. It was the obesity documentaries just as much as the ED content to be fair, but yeah it's an interesting contrast to the \"people only ever develop [restrictive] EDs because they want to be skinny!!1\". Chicken, meet egg. \n\nAlso FYI that trend of partner comments is a case of major selection bias. Men with anorexia fetishes and/or an abusive need to simply damage their partner's self esteem no matter what are gonna be more likely to go for women with self esteem issues and pre existing eating disorders. Men who are attracted to thicker women are probably mainly gonna seek out women who seem confident in that body type. Most people on that sub aren't set up to end up in healthy relationships, and it has nothing to do with their body type.",
      "created_utc": 1667935637.0,
      "score": 10,
      "context": [
        {
          "id": "ivkv7t9",
          "author": "cricketjacked",
          "body": "Just like with r/EDAnonymemes, every other post is about someone getting ridiculed by their partner for gaining weight and the post is flooded with pro-ana comments. It also makes me want to relapse because, if that many people are being told to lose weight by their partners, then I need to \"get ahead of the game\". It's like a constant reminder that I'm single (and therefore unlovable) because my body doesn't meet the unspoken standards of other people, particularly people I'm attracted to.\n\nWhat's really scary about this is that my ED arose from a desire to control and was initially health obsessed (like orthorexia but with more chaos). As someone who developed an eating disorder without body image issues, the sub is literally giving me body image issues when I didn't have them.",
          "created_utc": 1667932514.0
        }
      ]
    },
    {
      "id": "iw9rjqi",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1668387172.0,
      "score": 0,
      "context": [
        {
          "id": "ivkv7t9",
          "author": "cricketjacked",
          "body": "Just like with r/EDAnonymemes, every other post is about someone getting ridiculed by their partner for gaining weight and the post is flooded with pro-ana comments. It also makes me want to relapse because, if that many people are being told to lose weight by their partners, then I need to \"get ahead of the game\". It's like a constant reminder that I'm single (and therefore unlovable) because my body doesn't meet the unspoken standards of other people, particularly people I'm attracted to.\n\nWhat's really scary about this is that my ED arose from a desire to control and was initially health obsessed (like orthorexia but with more chaos). As someone who developed an eating disorder without body image issues, the sub is literally giving me body image issues when I didn't have them.",
          "created_utc": 1667932514.0
        }
      ]
    },
    {
      "id": "ivkghk6",
      "author": "None",
      "body": "Not trying to guess your age, but as a fellow adult (allegedly-I am 31), have you tried the r/Eatingdisordersover30 ? I have found that group to be helpful.",
      "created_utc": 1667926873.0,
      "score": 5,
      "context": [
        {
          "id": "ivkdw27",
          "author": "myqueershoulder",
          "body": "The adult EdA sub is an even bigger nightmare!! People legitimately asking for restriction buddies…like is the 20011 Tumblr or what?? I was shocked, I thought it would be more around what it’s like to make a living/raise a family while having an ED but it’s really just another place for people to enable their disordered habits. I think that was a wakeup call for me actually - realizing that if I don’t get my shit together soon I’m going to be one of those adults whose lives are so taken over by their ED that they’re still resorting to behaviours they used as a teen.",
          "created_utc": 1667925876.0
        }
      ]
    },
    {
      "id": "ivll90c",
      "author": "None",
      "body": "Oh my god, your point about AA is so good 😭 \n\nYou're right though, it's not a recovery sub and THAT'S perfectly fine. What's not perfectly fine is everyone just going around in a circlejerk encouraging and validating each other's *extremely* disordered habits.",
      "created_utc": 1667942401.0,
      "score": 8,
      "context": [
        {
          "id": "ivkz76l",
          "author": "highacidcontent",
          "body": "I've been thinking this too!! All the \"name your favorite low-cal snack<3\" and \"what are your fear foods?\" \"I love restricting and I don't want to recover<3<3\" \"how do you hide xyz behavior\" posts?? WHATS GOING ON?\n\nIn AA nobody would go \"my favorite drink is whisky, what's your drink of choice?\" or \"can you give me advice on how to continue drinking without anyone noticing?\" etc.\n\nI know, it's not a recovery sub, but actively supporting other peoples disorders like they do there? What the fuck.",
          "created_utc": 1667934016.0
        }
      ]
    },
    {
      "id": "iw9y6gy",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 2. Please contact the mods if you have any doubts.",
      "created_utc": 1668390313.0,
      "score": 1,
      "context": [
        {
          "id": "iw9rccy",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1668387078.0
        }
      ]
    },
    {
      "id": "ivllyut",
      "author": "None",
      "body": "Damn, that's actually a pretty good argument for staying on the sub without actively supporting it. I think I made a good decision in leaving though, because honestly from time to time on that sub my brain would tell my ED wasn't \"valid\" because I had never gotten to the point of shitting myself in public or purging at a family event or fasting for xx days. It's...wild 😵‍💫",
      "created_utc": 1667942672.0,
      "score": 11,
      "context": [
        {
          "id": "ivja9mm",
          "author": "SLEG48",
          "body": "Yup, although there’s nothing wrong with a space to vent/share your eating disorder struggles **in theory**, an echo chamber of harmful behaviors, intense self loathing, subtle competition, and an overall detriment to your recovery is created by staying too long.\n\nr/EDAnonymous is NOT a recovery sub and if you plan on recovering, you should probably cut ties with it, it can be pretty harmful for you in the long run 😬",
          "created_utc": 1667907147.0
        },
        {
          "id": "ivl3uwx",
          "author": "incorrectlyironman",
          "body": "On the flip side I've never unsubscribed and it usually helps motivate me to stay in recovery. It's just daily little sneakpeeks into how much of a shitshow it is to have an eating disorder. \"I shat myself in the grocery store\" \"I promised myself I could have birthday cake today and I just couldn't do it\" \"Boyfriend broke up with me because I wouldn't stop purging\", even \"DAE only experience joy through their ED\". Yeah no fucking thanks to going back to that.",
          "created_utc": 1667935798.0
        }
      ]
    },
    {
      "id": "ivk89ha",
      "author": "the-Starch-Ghoul",
      "body": "It's worsened over time.",
      "created_utc": 1667923646.0,
      "score": 15,
      "context": [
        {
          "id": "ivja9mm",
          "author": "SLEG48",
          "body": "Yup, although there’s nothing wrong with a space to vent/share your eating disorder struggles **in theory**, an echo chamber of harmful behaviors, intense self loathing, subtle competition, and an overall detriment to your recovery is created by staying too long.\n\nr/EDAnonymous is NOT a recovery sub and if you plan on recovering, you should probably cut ties with it, it can be pretty harmful for you in the long run 😬",
          "created_utc": 1667907147.0
        },
        {
          "id": "ivjauuy",
          "author": "None",
          "body": "Yeah, I'm sure EDAnonymous was made with good intentions in mind, but over time it really did just become an echo chamber of people constantly bringing up how \"messed up\" or \"sick\" they are - I get it, but sometimes it just comes off as bragging.",
          "created_utc": 1667907574.0
        }
      ]
    },
    {
      "id": "ivlf40b",
      "author": "SmolBeanAmina",
      "body": "It's a shame that edanonymemes is the same",
      "created_utc": 1667940070.0,
      "score": 9,
      "context": [
        {
          "id": "ivj8zbk",
          "author": "SmolBeanAmina",
          "body": "When I joined I thought it was just a neutral space to vent and stuff but sometimes people encourage others' habits and I.. was just in awe. Especially for a group that claims to not be pro-ana. Pro-ana isn't always explicit, it can be in very small things. Not a good space to be in whether you are sick or recovering, I had to leave it. The reason why I was able to start recovering was that I joined recovery spaces even when I was sick, so instead of people encouraging my bad habits they'd encourage the good ones",
          "created_utc": 1667906167.0
        },
        {
          "id": "ivjaqqj",
          "author": "None",
          "body": "Yeah. I honestly had the impression that it was an ED discussion group for people who weren't quite ready to recover yet. Sadly, it's just been an echo chamber of people subtly bragging about how sick they are, which I assume can make members with non-restrictive EDs (BED, for example) feel like they aren't \"disordered\" enough",
          "created_utc": 1667907492.0
        }
      ]
    },
    {
      "id": "ivl8sxk",
      "author": "bigdaddyt2",
      "body": "Does this sub not do the opposite though and basically say if you don’t partially develop BED your doing it wrong. Don’t get me wrong I think this sub is good but some people just need different things at different times.",
      "created_utc": 1667937668.0,
      "score": -6,
      "context": [
        {
          "id": "ivj8zbk",
          "author": "SmolBeanAmina",
          "body": "When I joined I thought it was just a neutral space to vent and stuff but sometimes people encourage others' habits and I.. was just in awe. Especially for a group that claims to not be pro-ana. Pro-ana isn't always explicit, it can be in very small things. Not a good space to be in whether you are sick or recovering, I had to leave it. The reason why I was able to start recovering was that I joined recovery spaces even when I was sick, so instead of people encouraging my bad habits they'd encourage the good ones",
          "created_utc": 1667906167.0
        },
        {
          "id": "ivjaqqj",
          "author": "None",
          "body": "Yeah. I honestly had the impression that it was an ED discussion group for people who weren't quite ready to recover yet. Sadly, it's just been an echo chamber of people subtly bragging about how sick they are, which I assume can make members with non-restrictive EDs (BED, for example) feel like they aren't \"disordered\" enough",
          "created_utc": 1667907492.0
        }
      ]
    },
    {
      "id": "ivj4nri",
      "author": "rileyyj001",
      "body": "Yes! Exactly why I joined, as well. MPA was wayyyy too much for me to handle, and I got sucked in FAST over there. This space felt safer, and I never saw anything even remotely like the posts I see now. Even if they *do* get removed, it isn’t instant, and some stay up for hours.",
      "created_utc": 1667902531.0,
      "score": 15,
      "context": [
        {
          "id": "ivj40y9",
          "author": "rileyyj001",
          "body": "Unfortunately, I agree with this, and wish I felt the opposite. I have seen so many of the posts you’ve mentioned. I joined knowing full well this isn’t an active “pro-recovery” space. However, there is a pretty clear line (IMO) of “pro-ana” vs being a neutral, safe space.",
          "created_utc": 1667901953.0
        },
        {
          "id": "ivj4aiu",
          "author": "None",
          "body": "Honestly, same :( At first I joined in because I thought it gave off, \"we're sick and it's kind of ridiculous but we're not ready to recover yet so let's talk about it\" energy, but over time it just became very pro-ana/restriction :(",
          "created_utc": 1667902197.0
        }
      ]
    },
    {
      "id": "ivj6rwa",
      "author": "None",
      "body": "Anything about recovery isn’t given that much importance in that space, anything that involves losing weight, restricting etc etc gets more attention. So I wish to leave it asap. Maybe do it from tomorrow.",
      "created_utc": 1667904396.0,
      "score": 10,
      "context": [
        {
          "id": "ivj1kfl",
          "author": "None",
          "body": "Haha I feel the same too and want to move to other fun spaces in Reddit.",
          "created_utc": 1667899692.0
        },
        {
          "id": "ivj2peu",
          "author": "None",
          "body": "Right? Like, that sub isn't fun, it's weirdly competitive 😭",
          "created_utc": 1667900743.0
        }
      ]
    },
    {
      "id": "ivnltv3",
      "author": "None",
      "body": "Yes , it’s not fun to be part of an Ed community, having an Ed is very hard but to have a community which actually provides support and guidance I feel thankful.",
      "created_utc": 1667977434.0,
      "score": 2,
      "context": [
        {
          "id": "ivj1kfl",
          "author": "None",
          "body": "Haha I feel the same too and want to move to other fun spaces in Reddit.",
          "created_utc": 1667899692.0
        },
        {
          "id": "ivl06ds",
          "author": "ontopofyourmom",
          "body": "This sub is.... not \"fun,\" but being part of a community that actually gives mutual support makes me feel good.",
          "created_utc": 1667934387.0
        }
      ]
    },
    {
      "id": "ivkfn9v",
      "author": "None",
      "body": "I was just thinking this the other day when I was doing my weird ED/OCD recipe search of the evening and stumbled across a vegan website. I was like this is made for my ED's dream. I don't think at this point even I want to try it lol",
      "created_utc": 1667926552.0,
      "score": 3,
      "context": [
        {
          "id": "ivjibct",
          "author": "Somewhere-Practical",
          "body": "Yeah, as someone who’s first ED was pre-tumblr and so who’s triggering content at the time was vegan forums and forums dedicated to adults trying to lose weight…edanony was an eye opener. I didn’t find it that triggering (at least, not as triggering as my one month of tiktok) because my habits are more “30-something attorney with RED-S/maybe an at times ED,” and the posters in edanony appear to be about half my age, but it just made me uncomfortable and sad. I am so fortunate those spaces didn’t exist or were harder to find when I was a kid.",
          "created_utc": 1667912256.0
        },
        {
          "id": "ivk94hz",
          "author": "the-Starch-Ghoul",
          "body": ">vegan forums\n\nvegan forums are low-key ED forums, ESPECIALLY the wfpb ones. I have never seen such judgementalism and dietary dogmatism as in wfpb groups, especially the more restrictive ones",
          "created_utc": 1667923995.0
        }
      ]
    },
    {
      "id": "ivku8ih",
      "author": "Somewhere-Practical",
      "body": "Yes! I find those sorts of things way more triggering too. It’s the casualness of it. The implication that the way they eat is the only healthy way to live. I don’t really find someone living off of a monster energy and vape pen (or, as they did in my day, diet coke and cigarettes) triggering because I don’t ever feel compelled to do that. But someone who says don’t use olive oil? That’ll fuck me up on a bad day, and I won’t list out what fucks me up on a good day.",
      "created_utc": 1667932142.0,
      "score": 2,
      "context": [
        {
          "id": "ivjibct",
          "author": "Somewhere-Practical",
          "body": "Yeah, as someone who’s first ED was pre-tumblr and so who’s triggering content at the time was vegan forums and forums dedicated to adults trying to lose weight…edanony was an eye opener. I didn’t find it that triggering (at least, not as triggering as my one month of tiktok) because my habits are more “30-something attorney with RED-S/maybe an at times ED,” and the posters in edanony appear to be about half my age, but it just made me uncomfortable and sad. I am so fortunate those spaces didn’t exist or were harder to find when I was a kid.",
          "created_utc": 1667912256.0
        },
        {
          "id": "ivk94hz",
          "author": "the-Starch-Ghoul",
          "body": ">vegan forums\n\nvegan forums are low-key ED forums, ESPECIALLY the wfpb ones. I have never seen such judgementalism and dietary dogmatism as in wfpb groups, especially the more restrictive ones",
          "created_utc": 1667923995.0
        }
      ]
    },
    {
      "id": "iw9viep",
      "author": "cricketjacked",
      "body": "Is it a relapse sub?",
      "created_utc": 1668389036.0,
      "score": 1,
      "context": [
        {
          "id": "ivkv7t9",
          "author": "cricketjacked",
          "body": "Just like with r/EDAnonymemes, every other post is about someone getting ridiculed by their partner for gaining weight and the post is flooded with pro-ana comments. It also makes me want to relapse because, if that many people are being told to lose weight by their partners, then I need to \"get ahead of the game\". It's like a constant reminder that I'm single (and therefore unlovable) because my body doesn't meet the unspoken standards of other people, particularly people I'm attracted to.\n\nWhat's really scary about this is that my ED arose from a desire to control and was initially health obsessed (like orthorexia but with more chaos). As someone who developed an eating disorder without body image issues, the sub is literally giving me body image issues when I didn't have them.",
          "created_utc": 1667932514.0
        },
        {
          "id": "iw9rjqi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1668387172.0
        }
      ]
    },
    {
      "id": "iw9yhi7",
      "author": "fuckeatingdisorders-ModTeam",
      "body": "Your post was removed for breaking Rule 2. Please contact the mods if you have any doubts.",
      "created_utc": 1668390463.0,
      "score": 1,
      "context": [
        {
          "id": "ivkv7t9",
          "author": "cricketjacked",
          "body": "Just like with r/EDAnonymemes, every other post is about someone getting ridiculed by their partner for gaining weight and the post is flooded with pro-ana comments. It also makes me want to relapse because, if that many people are being told to lose weight by their partners, then I need to \"get ahead of the game\". It's like a constant reminder that I'm single (and therefore unlovable) because my body doesn't meet the unspoken standards of other people, particularly people I'm attracted to.\n\nWhat's really scary about this is that my ED arose from a desire to control and was initially health obsessed (like orthorexia but with more chaos). As someone who developed an eating disorder without body image issues, the sub is literally giving me body image issues when I didn't have them.",
          "created_utc": 1667932514.0
        },
        {
          "id": "iw9rjqi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1668387172.0
        }
      ]
    },
    {
      "id": "ivm62bk",
      "author": "black_kyanite",
      "body": "Yeah just rename it EDcirclejerk and look at it as a satire forum, and it's probably enjoyable. \n\nFor me, I have made the commitment that I want to *be in recovery*. Therefore, I want to surround myself with others who want to be in recovery, because that seems like what will be the most helpful to keep me on the track I want to be on. \n\nI wouldn't judge anyone else, but I don't want to be some kind of voyeur for other people's illness, especially if they don't want recovery for themselves.",
      "created_utc": 1667950931.0,
      "score": 3,
      "context": [
        {
          "id": "ivkz76l",
          "author": "highacidcontent",
          "body": "I've been thinking this too!! All the \"name your favorite low-cal snack<3\" and \"what are your fear foods?\" \"I love restricting and I don't want to recover<3<3\" \"how do you hide xyz behavior\" posts?? WHATS GOING ON?\n\nIn AA nobody would go \"my favorite drink is whisky, what's your drink of choice?\" or \"can you give me advice on how to continue drinking without anyone noticing?\" etc.\n\nI know, it's not a recovery sub, but actively supporting other peoples disorders like they do there? What the fuck.",
          "created_utc": 1667934016.0
        },
        {
          "id": "ivll90c",
          "author": "None",
          "body": "Oh my god, your point about AA is so good 😭 \n\nYou're right though, it's not a recovery sub and THAT'S perfectly fine. What's not perfectly fine is everyone just going around in a circlejerk encouraging and validating each other's *extremely* disordered habits.",
          "created_utc": 1667942401.0
        }
      ]
    },
    {
      "id": "ivm1d32",
      "author": "highacidcontent",
      "body": "100%",
      "created_utc": 1667948926.0,
      "score": 1,
      "context": [
        {
          "id": "ivkz76l",
          "author": "highacidcontent",
          "body": "I've been thinking this too!! All the \"name your favorite low-cal snack<3\" and \"what are your fear foods?\" \"I love restricting and I don't want to recover<3<3\" \"how do you hide xyz behavior\" posts?? WHATS GOING ON?\n\nIn AA nobody would go \"my favorite drink is whisky, what's your drink of choice?\" or \"can you give me advice on how to continue drinking without anyone noticing?\" etc.\n\nI know, it's not a recovery sub, but actively supporting other peoples disorders like they do there? What the fuck.",
          "created_utc": 1667934016.0
        },
        {
          "id": "ivll90c",
          "author": "None",
          "body": "Oh my god, your point about AA is so good 😭 \n\nYou're right though, it's not a recovery sub and THAT'S perfectly fine. What's not perfectly fine is everyone just going around in a circlejerk encouraging and validating each other's *extremely* disordered habits.",
          "created_utc": 1667942401.0
        }
      ]
    },
    {
      "id": "ivltmk0",
      "author": "Somewhere-Practical",
      "body": "They’ve been particularly bad lately imo. I remember when I first found it and I hadn’t ever felt more seen. Now I feel like I can’t relate to most of them because I am pretty recovered and they all seem to be about (if not glorifying) really harmful stuff I luckily never did :/",
      "created_utc": 1667945703.0,
      "score": 7,
      "context": [
        {
          "id": "ivj8zbk",
          "author": "SmolBeanAmina",
          "body": "When I joined I thought it was just a neutral space to vent and stuff but sometimes people encourage others' habits and I.. was just in awe. Especially for a group that claims to not be pro-ana. Pro-ana isn't always explicit, it can be in very small things. Not a good space to be in whether you are sick or recovering, I had to leave it. The reason why I was able to start recovering was that I joined recovery spaces even when I was sick, so instead of people encouraging my bad habits they'd encourage the good ones",
          "created_utc": 1667906167.0
        },
        {
          "id": "ivjaqqj",
          "author": "None",
          "body": "Yeah. I honestly had the impression that it was an ED discussion group for people who weren't quite ready to recover yet. Sadly, it's just been an echo chamber of people subtly bragging about how sick they are, which I assume can make members with non-restrictive EDs (BED, for example) feel like they aren't \"disordered\" enough",
          "created_utc": 1667907492.0
        },
        {
          "id": "ivlf40b",
          "author": "SmolBeanAmina",
          "body": "It's a shame that edanonymemes is the same",
          "created_utc": 1667940070.0
        }
      ]
    },
    {
      "id": "ivlf2bl",
      "author": "SmolBeanAmina",
      "body": "What..? Who says that",
      "created_utc": 1667940052.0,
      "score": 6,
      "context": [
        {
          "id": "ivj8zbk",
          "author": "SmolBeanAmina",
          "body": "When I joined I thought it was just a neutral space to vent and stuff but sometimes people encourage others' habits and I.. was just in awe. Especially for a group that claims to not be pro-ana. Pro-ana isn't always explicit, it can be in very small things. Not a good space to be in whether you are sick or recovering, I had to leave it. The reason why I was able to start recovering was that I joined recovery spaces even when I was sick, so instead of people encouraging my bad habits they'd encourage the good ones",
          "created_utc": 1667906167.0
        },
        {
          "id": "ivjaqqj",
          "author": "None",
          "body": "Yeah. I honestly had the impression that it was an ED discussion group for people who weren't quite ready to recover yet. Sadly, it's just been an echo chamber of people subtly bragging about how sick they are, which I assume can make members with non-restrictive EDs (BED, for example) feel like they aren't \"disordered\" enough",
          "created_utc": 1667907492.0
        },
        {
          "id": "ivl8sxk",
          "author": "bigdaddyt2",
          "body": "Does this sub not do the opposite though and basically say if you don’t partially develop BED your doing it wrong. Don’t get me wrong I think this sub is good but some people just need different things at different times.",
          "created_utc": 1667937668.0
        }
      ]
    },
    {
      "id": "ivlsxg7",
      "author": "efftheestablishment",
      "body": "No lmao you don't develop any form of bed. After you restrict your intake, you NEED to make up that intake to heal, so early in recovery it is normal to display \"binge-like\" behavior. the key difference being - it's not binging at all. They are vastly different and do not feel even remotely similar. The only similarity is that it's a \"higher than average\" intake.",
      "created_utc": 1667945420.0,
      "score": 6,
      "context": [
        {
          "id": "ivj8zbk",
          "author": "SmolBeanAmina",
          "body": "When I joined I thought it was just a neutral space to vent and stuff but sometimes people encourage others' habits and I.. was just in awe. Especially for a group that claims to not be pro-ana. Pro-ana isn't always explicit, it can be in very small things. Not a good space to be in whether you are sick or recovering, I had to leave it. The reason why I was able to start recovering was that I joined recovery spaces even when I was sick, so instead of people encouraging my bad habits they'd encourage the good ones",
          "created_utc": 1667906167.0
        },
        {
          "id": "ivjaqqj",
          "author": "None",
          "body": "Yeah. I honestly had the impression that it was an ED discussion group for people who weren't quite ready to recover yet. Sadly, it's just been an echo chamber of people subtly bragging about how sick they are, which I assume can make members with non-restrictive EDs (BED, for example) feel like they aren't \"disordered\" enough",
          "created_utc": 1667907492.0
        },
        {
          "id": "ivl8sxk",
          "author": "bigdaddyt2",
          "body": "Does this sub not do the opposite though and basically say if you don’t partially develop BED your doing it wrong. Don’t get me wrong I think this sub is good but some people just need different things at different times.",
          "created_utc": 1667937668.0
        }
      ]
    },
    {
      "id": "ivj501z",
      "author": "None",
      "body": "Oh god, MPA brings back memories lmao (they renamed it to \"ED recovery\" or smth last time I checked) but yeah, the sub really went downhill for some reason. Sometimes I see posts that are just straight up pro-restriction, with a few comments even giving tips, and I wonder where the mods are. \n\nThere are also a few members humble-bragging about their low BMIs/weights and it's just ???? Okay :/",
      "created_utc": 1667902838.0,
      "score": 9,
      "context": [
        {
          "id": "ivj40y9",
          "author": "rileyyj001",
          "body": "Unfortunately, I agree with this, and wish I felt the opposite. I have seen so many of the posts you’ve mentioned. I joined knowing full well this isn’t an active “pro-recovery” space. However, there is a pretty clear line (IMO) of “pro-ana” vs being a neutral, safe space.",
          "created_utc": 1667901953.0
        },
        {
          "id": "ivj4aiu",
          "author": "None",
          "body": "Honestly, same :( At first I joined in because I thought it gave off, \"we're sick and it's kind of ridiculous but we're not ready to recover yet so let's talk about it\" energy, but over time it just became very pro-ana/restriction :(",
          "created_utc": 1667902197.0
        },
        {
          "id": "ivj4nri",
          "author": "rileyyj001",
          "body": "Yes! Exactly why I joined, as well. MPA was wayyyy too much for me to handle, and I got sucked in FAST over there. This space felt safer, and I never saw anything even remotely like the posts I see now. Even if they *do* get removed, it isn’t instant, and some stay up for hours.",
          "created_utc": 1667902531.0
        }
      ]
    },
    {
      "id": "ivj98kf",
      "author": "callmedylanelliot",
      "body": "It took me a second to recognize that acronym. And I'm honestly proud of myself that I no longer instantly recognise it. Fuck that place, it DESTROYED the lives of so many people 😡 it's sick how they would pretend they're a recovery space. Like if I met the person who ownes it I would genuinely love to...have a fistfighting duel with them or some other thing that doesn't count as threatening violence on Reddit",
      "created_utc": 1667906365.0,
      "score": 7,
      "context": [
        {
          "id": "ivj40y9",
          "author": "rileyyj001",
          "body": "Unfortunately, I agree with this, and wish I felt the opposite. I have seen so many of the posts you’ve mentioned. I joined knowing full well this isn’t an active “pro-recovery” space. However, there is a pretty clear line (IMO) of “pro-ana” vs being a neutral, safe space.",
          "created_utc": 1667901953.0
        },
        {
          "id": "ivj4aiu",
          "author": "None",
          "body": "Honestly, same :( At first I joined in because I thought it gave off, \"we're sick and it's kind of ridiculous but we're not ready to recover yet so let's talk about it\" energy, but over time it just became very pro-ana/restriction :(",
          "created_utc": 1667902197.0
        },
        {
          "id": "ivj4nri",
          "author": "rileyyj001",
          "body": "Yes! Exactly why I joined, as well. MPA was wayyyy too much for me to handle, and I got sucked in FAST over there. This space felt safer, and I never saw anything even remotely like the posts I see now. Even if they *do* get removed, it isn’t instant, and some stay up for hours.",
          "created_utc": 1667902531.0
        }
      ]
    },
    {
      "id": "iwa5hho",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1668393848.0,
      "score": 0,
      "context": [
        {
          "id": "ivkv7t9",
          "author": "cricketjacked",
          "body": "Just like with r/EDAnonymemes, every other post is about someone getting ridiculed by their partner for gaining weight and the post is flooded with pro-ana comments. It also makes me want to relapse because, if that many people are being told to lose weight by their partners, then I need to \"get ahead of the game\". It's like a constant reminder that I'm single (and therefore unlovable) because my body doesn't meet the unspoken standards of other people, particularly people I'm attracted to.\n\nWhat's really scary about this is that my ED arose from a desire to control and was initially health obsessed (like orthorexia but with more chaos). As someone who developed an eating disorder without body image issues, the sub is literally giving me body image issues when I didn't have them.",
          "created_utc": 1667932514.0
        },
        {
          "id": "iw9rjqi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1668387172.0
        },
        {
          "id": "iw9viep",
          "author": "cricketjacked",
          "body": "Is it a relapse sub?",
          "created_utc": 1668389036.0
        }
      ]
    },
    {
      "id": "ivj5fst",
      "author": "rileyyj001",
      "body": "Yes, it’s the tip seeking/sharing and the competition/humble bragging that get me the most. \n\nSometimes I worry I do that, myself (humble brag). But I only ever share my exact numbers (and use the text blocker) to give context/relate to the post/comments, and to offer help. I like that we *can* share numbers, but I think there is a safe way to do so, and I personally don’t put it in to prove I’m “sicker,” or “better at my ED” than anyone. \n\nED spaces are weird, man",
      "created_utc": 1667903234.0,
      "score": 3,
      "context": [
        {
          "id": "ivj40y9",
          "author": "rileyyj001",
          "body": "Unfortunately, I agree with this, and wish I felt the opposite. I have seen so many of the posts you’ve mentioned. I joined knowing full well this isn’t an active “pro-recovery” space. However, there is a pretty clear line (IMO) of “pro-ana” vs being a neutral, safe space.",
          "created_utc": 1667901953.0
        },
        {
          "id": "ivj4aiu",
          "author": "None",
          "body": "Honestly, same :( At first I joined in because I thought it gave off, \"we're sick and it's kind of ridiculous but we're not ready to recover yet so let's talk about it\" energy, but over time it just became very pro-ana/restriction :(",
          "created_utc": 1667902197.0
        },
        {
          "id": "ivj4nri",
          "author": "rileyyj001",
          "body": "Yes! Exactly why I joined, as well. MPA was wayyyy too much for me to handle, and I got sucked in FAST over there. This space felt safer, and I never saw anything even remotely like the posts I see now. Even if they *do* get removed, it isn’t instant, and some stay up for hours.",
          "created_utc": 1667902531.0
        },
        {
          "id": "ivj501z",
          "author": "None",
          "body": "Oh god, MPA brings back memories lmao (they renamed it to \"ED recovery\" or smth last time I checked) but yeah, the sub really went downhill for some reason. Sometimes I see posts that are just straight up pro-restriction, with a few comments even giving tips, and I wonder where the mods are. \n\nThere are also a few members humble-bragging about their low BMIs/weights and it's just ???? Okay :/",
          "created_utc": 1667902838.0
        }
      ]
    },
    {
      "id": "iwaasf4",
      "author": "cricketjacked",
      "body": "I wish eating disorders made sense but they don't. If I had perfect judgement, then I wouldn't be on that sub, sure. I also wouldn't have an eating disorder.\n\nI'm allowed to talk about my experience. I shouldn't be compelled to defend being on the page. I thought it'd be funny and help me not taking my problems so seriously. I also thought, because my ED wasn't motivated by body image issues, that I wouldn't be triggered the same way.\n\nI know it seems contradictory to you for me to be be on that page given the warning, but I really didn't think it'd affect me like it has. I didn't have disordered eating habits that centered around body image issues. Color me surprised when I starting experiencing the urge to restrict all over again, only this time because I can't stand to look at myself in the mirror now. All because of a meme page that didn't cause me trouble before now.",
      "created_utc": 1668396492.0,
      "score": 1,
      "context": [
        {
          "id": "ivkv7t9",
          "author": "cricketjacked",
          "body": "Just like with r/EDAnonymemes, every other post is about someone getting ridiculed by their partner for gaining weight and the post is flooded with pro-ana comments. It also makes me want to relapse because, if that many people are being told to lose weight by their partners, then I need to \"get ahead of the game\". It's like a constant reminder that I'm single (and therefore unlovable) because my body doesn't meet the unspoken standards of other people, particularly people I'm attracted to.\n\nWhat's really scary about this is that my ED arose from a desire to control and was initially health obsessed (like orthorexia but with more chaos). As someone who developed an eating disorder without body image issues, the sub is literally giving me body image issues when I didn't have them.",
          "created_utc": 1667932514.0
        },
        {
          "id": "iw9rjqi",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1668387172.0
        },
        {
          "id": "iw9viep",
          "author": "cricketjacked",
          "body": "Is it a relapse sub?",
          "created_utc": 1668389036.0
        },
        {
          "id": "iwa5hho",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1668393848.0
        }
      ]
    }
  ]
}