{
  "id": "zdmu2t",
  "subreddit": "fuckeatingdisorders",
  "author": "onlyheinzbakedbeans",
  "created_utc": 1670280612.0,
  "title": "2022 was the year of my recovery. Here are 10 things I've learnt along the way✨",
  "selftext": "1- Trust the process, your body, yourself. If it's too hard, starting by not trusting your ED is already a step forward\n\n2- Recovery won't bring you happiness but the keys to it. Might sound depressing but it's not. Without the keys, you can't unlock much. \n\n3- Theres so much more of You that you will meet if you keep going \n\n4- Travelling the world is so much more enjoyable when your mind is there\n\n5- Food is good. But have you ever been so onto a book you would forget the world around you? Hobbies, passions, relationships is where Life's at.\n\n6- Actually, being you and getting out of your own cage is not as scary as it seems. And the more you do it, the easiest it gets. Just like starting a new job.\n\n7- Your body is your friend. Sometimes your friend pisses you off. But it still your friend. Don't be too harsh on it, just sleep on it, it's always been here for you and you always find a way to forgive each other. \n\n8- Time is the most precious thing on earth, don't waste any second trying to fit in, please people you don't even like or overthinking their reactions. Spend it on things that matter. In 50 years time, you'll thank yourself.\n\n9- Try your best, give your best. You might fail, but you can always climb back. You won't start from scratch but from experience. No one is perfect, neither am I. The aim is not perfection but improvement.\n\n10- You are never alone. And even if you feel like this, right here, right now, you're not. And I hope you can see you are enough \n\nTake care you all and have a beautiful end of 2022 ❤️✨",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/zdmu2t/2022_was_the_year_of_my_recovery_here_are_10/",
  "score": 90,
  "num_comments": 5,
  "comments": [
    {
      "id": "iz37k17",
      "author": "monsterintheuniverse",
      "body": "I love you, thank you",
      "created_utc": 1670296255.0,
      "score": 15,
      "context": []
    },
    {
      "id": "iz3q6wr",
      "author": "None",
      "body": "This is so true. If food continues to be the focus it doesn’t bring happiness. It’s about what food (and just feeding yourself and not trying to operate on a restrictive brain) let’s you do, be mindful about time w loved ones and engage in hobbies activities and experiences that bring joy. I try to remember this myself.",
      "created_utc": 1670306704.0,
      "score": 9,
      "context": []
    },
    {
      "id": "iz6d4hj",
      "author": "LoveThatForYouBebe",
      "body": "Bless you. And major congratulations.",
      "created_utc": 1670358301.0,
      "score": 3,
      "context": []
    },
    {
      "id": "iz781py",
      "author": "HeresWhereStoryEnds",
      "body": "Congrats to you! Thanks for sharing these insights. The ones that really resonated with me are: recovery won't bring me happiness and my body is my friend.\n\nWishing you continued strength in your recovery!",
      "created_utc": 1670370904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "iz7dc4i",
      "author": "onlyheinzbakedbeans",
      "body": "The body is my friend is the one which took me the longest but accepting that some days I'm not gonna be okay with it at 100% but without meaning I don't love it helped me loads. ❤️\n\nThank you so much x",
      "created_utc": 1670373258.0,
      "score": 2,
      "context": [
        {
          "id": "iz781py",
          "author": "HeresWhereStoryEnds",
          "body": "Congrats to you! Thanks for sharing these insights. The ones that really resonated with me are: recovery won't bring me happiness and my body is my friend.\n\nWishing you continued strength in your recovery!",
          "created_utc": 1670370904.0
        }
      ]
    }
  ]
}