{
  "id": "zqzxkv",
  "subreddit": "fuckeatingdisorders",
  "author": "LoveThatForYouBebe",
  "created_utc": 1671570963.0,
  "title": "I was invincible…until I wasn’t. Major medical wake-up call today and I’m not okay.",
  "selftext": "First, to clarify, I’m not on death’s door, I don’t mean that kind of wake up call.\n\nBut I’m 34. I’ve had this disorder for 20 years, and have avoided getting a DEXA scan since the one I got in 2004. And I now know why.\n\nBecause today, I was informed I have full-blown osteoporosis. At 34. And that’s one of the only irreversible conditions/effects of this disorder. If I were younger, under 30, even, I would have a better chance at rebuilding bone mineral density.\n\nBut now…the best I can hope for is first and foremost trying to keep aiming for nutritional rehabilitation, and taking meds as a second line defense to halt further bone density loss. I can’t get it back. \n\nI can’t get 20 years of my life back. I can’t get back my ability to do the things I love the most (sports like ice skating and skateboarding) without major danger. I can’t get back the years in which I probably would have been able to have my own children.\n\nI’m 34 years old, and I feel stupid for being this upset at this news, but also…I’m just 34. It feels suffocating to think about the reality of this not getting better, and the best case scenario just being pausing the damage that’s been done.\n\nFuck these disorders. Fuck EDs for not letting us see how much danger we’re in. Fuck the ED denial that tells us we’re the one person who won’t have [problem X]. And most of all, fuck me for not finding a way to break free for 2 freaking decades, until this damage was done.\n\nI’m sorry for the tone, I’m just lying here on my bed in tears, beating myself up for this extremely real wake/up call of a physical issue as a result of this mental freaking illness and it all feels so…exhaustingly overwhelming. I’m so mad that I relapsed majorly last year without realizing until it was too late. And I hate myself for not being able to keep this from happening.\n\nBecause like the title says…I was the exception…until I wasn’t. This hurts. Badly.\n\nedit: typos fixed because I’m an idiot who didn’t proofread",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/zqzxkv/i_was_invincibleuntil_i_wasnt_major_medical/",
  "score": 133,
  "num_comments": 20,
  "comments": [
    {
      "id": "j12hj5f",
      "author": "BrowncoatIona",
      "body": "I'm so sorry. I was diagnosed with osteoporosis around 25. At the same time a 19 year old was diagnosed, and she... was understandably extremely upset. She'd stepped away from Harvard to receive treatment. Extremely heartbreaking. \n\nOsteoporosis isn't reversible. But it is something you can manage and prevent from rapidly declining. That's the upside in the shitty situation, I guess. \n\nIt sucks though. So bad. And I'm so sorry.",
      "created_utc": 1671597220.0,
      "score": 28,
      "context": []
    },
    {
      "id": "j112urt",
      "author": "Top-Chicken3102",
      "body": "I feel every word of this. I'm 34 too, and still completely fkn entrenched in this disorder that started when I was 9. I fkn hate it, but I'm resigned to it now. I hope... Fk!",
      "created_utc": 1671574004.0,
      "score": 30,
      "context": []
    },
    {
      "id": "j1179g2",
      "author": "No-Guava-6516",
      "body": "I’m so so so sorry. I can’t even imagine how you’re feeling right now. For what it’s worth, reading this just took away all the guilt I had from eating a lot (by my disordered standards,  not normal standards) today, so thank you for sharing. Sending you strength <3",
      "created_utc": 1671575835.0,
      "score": 21,
      "context": []
    },
    {
      "id": "j11okc9",
      "author": "None",
      "body": "I’m 21, and I’ve also gotten severe osteoporosis. my doctors said it is probably not reversible at this point. I’m really sorry this illness has taken even more from you, and I hope that you can separate yourself from it and find the peace you deserve. sending good vibes and healing!!",
      "created_utc": 1671583312.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j11a0ks",
      "author": "Vikkkiiix",
      "body": "I feel you, this was me too! like nothing will happen to me 🤷🏼‍♀️ I'm so sorry. I have osteoperosis too, I wish none of it ever happened, ED's take literally everything 🤦🏼‍♀️ sending you strength. 🫂❤️",
      "created_utc": 1671576988.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j140msq",
      "author": "LateFile8300",
      "body": "Personally I'm a \"late bloomer\" when it comes to the AN-R diagnosis, falling in most obviously/severely at 40+ (and male).  I'm sure you're aware, but the somewhat consoling take I look at things is the fact that osteoporosis diagnosis means if ANY part of the scan indicates that severity level the entire body/case is considered that.  While this feeds the disorder's \"you're not that sick\" mindset, it can at least give a bit of hope that any areas which aren't showing the same level of deterioration aren't as badly off as the areas that are.\n\nI'm pretty sure you've read Sick Enough by Dr. G, but there's also a great little podcast by Tabitha Farrar and an interview with Dr G at [https://tabithafarrar.com/2018/01/ask-dr-g-anorexia-malnutrition-bones/](https://tabithafarrar.com/2018/01/ask-dr-g-anorexia-malnutrition-bones/) which actually shows some bone recovery options, and that's from a somewhat older podcast at this point which says (to me) things may have even improved for at least AFAB people to have a chance at getting a bit of their skeletal integrity restored.",
      "created_utc": 1671633913.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j15ni4j",
      "author": "Angelundrground1",
      "body": "Do not listen to them! Yes, you probably will not get all of your bone density back but there is treatment to get at least some. My therapist who had a ED but also went thru cancer treatment had this issue. I believe mainly from the chemo. Google for the info and start whatever you need to do. Also, strength exercises can help as well. Having strong muscles surrounding your bones will help protect from a potential break. Just talk to your people in the exercise part first. I’ve had a E.D. pretty much as long as you have. I know enough that all is not lost ;)",
      "created_utc": 1671656974.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j15rqwr",
      "author": "None",
      "body": "Don't apologise for a thing. I am so sorry you are going through this. It is unfair and it is cruel. You deserve none of it. How are you doing? Are the people in your life of any comfort?",
      "created_utc": 1671658677.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j15s10p",
      "author": "mili1002",
      "body": "I'm so sorry, OP. Also have osteoporosis and it just fucking sucks. I wish I had listened when I had the chance. Sending love.",
      "created_utc": 1671658790.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j15tze0",
      "author": "LoveThatForYouBebe",
      "body": "It breaks my heart even more for anyone who’s even younger having to deal with this. Thanks for taking time to comment and empathize, but dang, I hate that you know it all too well firsthand. Really appreciate the encouraging and solace. I hope you’ve been able to at least find ways to keep it from progressing.",
      "created_utc": 1671659577.0,
      "score": 2,
      "context": [
        {
          "id": "j12hj5f",
          "author": "BrowncoatIona",
          "body": "I'm so sorry. I was diagnosed with osteoporosis around 25. At the same time a 19 year old was diagnosed, and she... was understandably extremely upset. She'd stepped away from Harvard to receive treatment. Extremely heartbreaking. \n\nOsteoporosis isn't reversible. But it is something you can manage and prevent from rapidly declining. That's the upside in the shitty situation, I guess. \n\nIt sucks though. So bad. And I'm so sorry.",
          "created_utc": 1671597220.0
        }
      ]
    },
    {
      "id": "j1133as",
      "author": "LoveThatForYouBebe",
      "body": "I’m so sorry you understand so well. It sucks. No one deserves living in this hell for so long. Sending you gentle, virtual hugs (only with consent). Thanks for taking time to share. <3",
      "created_utc": 1671574100.0,
      "score": 12,
      "context": [
        {
          "id": "j112urt",
          "author": "Top-Chicken3102",
          "body": "I feel every word of this. I'm 34 too, and still completely fkn entrenched in this disorder that started when I was 9. I fkn hate it, but I'm resigned to it now. I hope... Fk!",
          "created_utc": 1671574004.0
        }
      ]
    },
    {
      "id": "j117x5o",
      "author": "LoveThatForYouBebe",
      "body": "If nothing else, I’m so glad this helped take away that guilt. I’ve always said I’m up for sharing my own journey if any part of it can have any remotely helpful effect for one other person, so thank you for letting me know it had that effect after you so kindly took the time to read it. Wishing you the best in your journey, it’s hard, but there has to be more to life. Thank you for your empathy, it means so freaking much.",
      "created_utc": 1671576111.0,
      "score": 12,
      "context": [
        {
          "id": "j1179g2",
          "author": "No-Guava-6516",
          "body": "I’m so so so sorry. I can’t even imagine how you’re feeling right now. For what it’s worth, reading this just took away all the guilt I had from eating a lot (by my disordered standards,  not normal standards) today, so thank you for sharing. Sending you strength <3",
          "created_utc": 1671575835.0
        }
      ]
    },
    {
      "id": "j11wgcp",
      "author": "LoveThatForYouBebe",
      "body": "I am so sorry you’re still so young and already having to deal with this. If your doctors have said that, I’m not going to disagree with medical opinion, but this doctor I am grateful to have the ability to see is pretty well into the current ED/recovery/treatment world and knowledge, and I think the recommendation is for nutritional rehabilitation above all else, because until somewhere between 25-30, it’s often possible to reverse the active loss and get to a place where our body is creating new bone mineral density faster than it’s being depleted. That tends to slow down in late 20s-30ish, but I wouldn’t stop doing everything I could if I were you. If there’s any chance at all you could even reverse some of it, I wish you all the luck in the world. You absolutely shouldn’t have to deal with this at age 21. Thank you for taking time to read and comment; sending all the love and best wishes for any success your way.",
      "created_utc": 1671586903.0,
      "score": 11,
      "context": [
        {
          "id": "j11okc9",
          "author": "None",
          "body": "I’m 21, and I’ve also gotten severe osteoporosis. my doctors said it is probably not reversible at this point. I’m really sorry this illness has taken even more from you, and I hope that you can separate yourself from it and find the peace you deserve. sending good vibes and healing!!",
          "created_utc": 1671583312.0
        }
      ]
    },
    {
      "id": "j11adi8",
      "author": "LoveThatForYouBebe",
      "body": "I’m so sorry you’re going through the same. It makes me furious on behalf of all of us who have fallen prey to this disorder. Thanks for the encouragement, though I wish you didn’t understand so personally. Sending virtual hugs (if wanted) across the airwaves.",
      "created_utc": 1671577139.0,
      "score": 6,
      "context": [
        {
          "id": "j11a0ks",
          "author": "Vikkkiiix",
          "body": "I feel you, this was me too! like nothing will happen to me 🤷🏼‍♀️ I'm so sorry. I have osteoperosis too, I wish none of it ever happened, ED's take literally everything 🤦🏼‍♀️ sending you strength. 🫂❤️",
          "created_utc": 1671576988.0
        }
      ]
    },
    {
      "id": "j15ud43",
      "author": "LoveThatForYouBebe",
      "body": "It’s funny you mention Dr. G’s book, because I’ve read it a couple times myself, and even before I got this most recent news, I was recently re-reading the section on bone in the city, but I also tend to forget those very logical resources when I’m dealing with emotional stuff, so I always love when I see others recommend the things that I usually recommend, but can never remember to go to, myself. \n\nThank you so much for taking time to share. I have actually listened to that podcast episode, but it’s been about a year, so thanks for the reminder to go back and give it a relisten, I do remember there were some specific things mentioned in there that couldn’t hurt to at least give a shot. \n\nI’m so sorry that you got stuck in this world after living as long as you did without it, and I hope that you’ve been able to find a way to enjoy life and work toward the freedom we all deserve, no matter how long we’ve been struggling, how old we are, or exactly what we might be dealing with. Your comment means more than I can say, thank you again.",
      "created_utc": 1671659731.0,
      "score": 1,
      "context": [
        {
          "id": "j140msq",
          "author": "LateFile8300",
          "body": "Personally I'm a \"late bloomer\" when it comes to the AN-R diagnosis, falling in most obviously/severely at 40+ (and male).  I'm sure you're aware, but the somewhat consoling take I look at things is the fact that osteoporosis diagnosis means if ANY part of the scan indicates that severity level the entire body/case is considered that.  While this feeds the disorder's \"you're not that sick\" mindset, it can at least give a bit of hope that any areas which aren't showing the same level of deterioration aren't as badly off as the areas that are.\n\nI'm pretty sure you've read Sick Enough by Dr. G, but there's also a great little podcast by Tabitha Farrar and an interview with Dr G at [https://tabithafarrar.com/2018/01/ask-dr-g-anorexia-malnutrition-bones/](https://tabithafarrar.com/2018/01/ask-dr-g-anorexia-malnutrition-bones/) which actually shows some bone recovery options, and that's from a somewhat older podcast at this point which says (to me) things may have even improved for at least AFAB people to have a chance at getting a bit of their skeletal integrity restored.",
          "created_utc": 1671633913.0
        }
      ]
    },
    {
      "id": "j15uzl3",
      "author": "LoveThatForYouBebe",
      "body": "Thank you so much for sharing this, I am all about anecdotal evidence when it comes to finding hope to cling to. My doctor did say there was a possibility that we could arrest the progress and keep it where it is for many, many years, but I know the practice she is with is on the front lines of the field in the research for bone density (I’m seeing them in a scholarship/grand I was granted after applying a few months ago, otherwise I would probably still be in the dark on this), especially in regards to SE-AN, so I am pretty sure she at least has some ideas to try, on the off chance they can actually improve and help me get any of my BMD back, I think she just didn’t feel like she could promise that since there’s no guarantee. \n\nBut she didn’t paint it nearly as hopeful as I felt when I posted it here, that was just my own hopelessness after hours of processing and crying and wanting to be in denial.\n\nThank you for the reminder that it doesn’t necessarily mean every single bit of hope is lost. I really appreciate that.",
      "created_utc": 1671659987.0,
      "score": 2,
      "context": [
        {
          "id": "j15ni4j",
          "author": "Angelundrground1",
          "body": "Do not listen to them! Yes, you probably will not get all of your bone density back but there is treatment to get at least some. My therapist who had a ED but also went thru cancer treatment had this issue. I believe mainly from the chemo. Google for the info and start whatever you need to do. Also, strength exercises can help as well. Having strong muscles surrounding your bones will help protect from a potential break. Just talk to your people in the exercise part first. I’ve had a E.D. pretty much as long as you have. I know enough that all is not lost ;)",
          "created_utc": 1671656974.0
        }
      ]
    },
    {
      "id": "j15vihw",
      "author": "LoveThatForYouBebe",
      "body": "Thank you so much for every single word you said, sometimes one of the most helpful things someone can say is just acknowledging that something sucks. I try to do that a lot for people in my life, and it really means a lot when I encounter anyone else who does the same, so thank you. \n\nThankfully I have an extremely supportive husband, and I have an excellent outpatient team that I’m very fortunate to be able to work with right now, all of whom are very compassionate, empathetic, and eager to help me in any way they can. \n\nI don’t know how in the world my husband has stuck with me throughout all of this bull crap, but I couldn’t be more thankful that he has, because I couldn’t ask for a better partner in all of this. Part of the reason I’m so pissed off at this disorder is because of everything it’s taken from him because it stolen ME. \n\nAnd he is the sole reason I’m continuing to fight, because if I didn’t have him, and I got this news…I’m not sure I’d have it in me to keep fighting. I’m definitely not to a point where I really want this for myself yet, but I’m hoping that going through the motions for him, and at least knowing that I don’t want us to live the life we’re currently living, I’m OK with feeling like shit going through this process if it means he gets any relief, or gets any of his wife back.",
      "created_utc": 1671660209.0,
      "score": 2,
      "context": [
        {
          "id": "j15rqwr",
          "author": "None",
          "body": "Don't apologise for a thing. I am so sorry you are going through this. It is unfair and it is cruel. You deserve none of it. How are you doing? Are the people in your life of any comfort?",
          "created_utc": 1671658677.0
        }
      ]
    },
    {
      "id": "j15vutq",
      "author": "LoveThatForYouBebe",
      "body": "Thank you so much for your compassion and empathy; I’m so sorry you’re also dealing with this bitch of a physical repercussion from an insidious mental illness no one should ever have to face.",
      "created_utc": 1671660351.0,
      "score": 2,
      "context": [
        {
          "id": "j15s10p",
          "author": "mili1002",
          "body": "I'm so sorry, OP. Also have osteoporosis and it just fucking sucks. I wish I had listened when I had the chance. Sending love.",
          "created_utc": 1671658790.0
        }
      ]
    },
    {
      "id": "j1258a8",
      "author": "None",
      "body": "thank you so much for your kind words and for alerting me to the possibility of making things a little better than they are. the body can do crazy things, so who knows? i looked, and maybe some of the treatment doctors offer can be helpful to you! so don't give up hope, maybe there's still something that can be done, either now or in the future. i know words must fall short and seem empty, but you do deserve so much more than this. it has taken too much from you. you might be 34, but that is still incredibly young, too; you've got so much left for you!! thank you for spreading awareness and sending all of the love and wishes back to you!!!",
      "created_utc": 1671590972.0,
      "score": 8,
      "context": [
        {
          "id": "j11okc9",
          "author": "None",
          "body": "I’m 21, and I’ve also gotten severe osteoporosis. my doctors said it is probably not reversible at this point. I’m really sorry this illness has taken even more from you, and I hope that you can separate yourself from it and find the peace you deserve. sending good vibes and healing!!",
          "created_utc": 1671583312.0
        },
        {
          "id": "j11wgcp",
          "author": "LoveThatForYouBebe",
          "body": "I am so sorry you’re still so young and already having to deal with this. If your doctors have said that, I’m not going to disagree with medical opinion, but this doctor I am grateful to have the ability to see is pretty well into the current ED/recovery/treatment world and knowledge, and I think the recommendation is for nutritional rehabilitation above all else, because until somewhere between 25-30, it’s often possible to reverse the active loss and get to a place where our body is creating new bone mineral density faster than it’s being depleted. That tends to slow down in late 20s-30ish, but I wouldn’t stop doing everything I could if I were you. If there’s any chance at all you could even reverse some of it, I wish you all the luck in the world. You absolutely shouldn’t have to deal with this at age 21. Thank you for taking time to read and comment; sending all the love and best wishes for any success your way.",
          "created_utc": 1671586903.0
        }
      ]
    },
    {
      "id": "j18jmli",
      "author": "None",
      "body": "Same here, I don't really like it when people just try to sugarcoat something I'm going through - some things genuinely just suck, and your experience with it is valid. You're welcome <3 \n\nI'm so so glad about your husband. Having even just a bit of emotional support is very helpful. I can really empathise with how you feel, it doesn't only affect you, but those who love you, too. If anything, it's good motivation to keep you going - you want a better life for your husband, and he's happy if you're happy and healthy and safe, so you're striving to achieve just that. It's tough and it's gonna take a lot of mental energy, but I know you can do it. You sound really strong and mature and capable, and you have a great support system. Gaining back some of that control over your body is also going to do wonders for your self esteem, imo - once you get to the point of gaining your health back, doing things you love, seeing your husband proud and joyful and not worried about you anymore. The future is looking so, so bright. This, right now, is shit, and it hurts, and it's scary, and you must be so full of regrets, but there is so much love and fun ahead. You just have to get there. It's going to be so worth it. \n\nI'm really proud of you for realising how bad this got, and for having the motivation to change your future. It's amazing, I think it's what we all strive for with this disorder. You're really strong.",
      "created_utc": 1671716148.0,
      "score": 2,
      "context": [
        {
          "id": "j15rqwr",
          "author": "None",
          "body": "Don't apologise for a thing. I am so sorry you are going through this. It is unfair and it is cruel. You deserve none of it. How are you doing? Are the people in your life of any comfort?",
          "created_utc": 1671658677.0
        },
        {
          "id": "j15vihw",
          "author": "LoveThatForYouBebe",
          "body": "Thank you so much for every single word you said, sometimes one of the most helpful things someone can say is just acknowledging that something sucks. I try to do that a lot for people in my life, and it really means a lot when I encounter anyone else who does the same, so thank you. \n\nThankfully I have an extremely supportive husband, and I have an excellent outpatient team that I’m very fortunate to be able to work with right now, all of whom are very compassionate, empathetic, and eager to help me in any way they can. \n\nI don’t know how in the world my husband has stuck with me throughout all of this bull crap, but I couldn’t be more thankful that he has, because I couldn’t ask for a better partner in all of this. Part of the reason I’m so pissed off at this disorder is because of everything it’s taken from him because it stolen ME. \n\nAnd he is the sole reason I’m continuing to fight, because if I didn’t have him, and I got this news…I’m not sure I’d have it in me to keep fighting. I’m definitely not to a point where I really want this for myself yet, but I’m hoping that going through the motions for him, and at least knowing that I don’t want us to live the life we’re currently living, I’m OK with feeling like shit going through this process if it means he gets any relief, or gets any of his wife back.",
          "created_utc": 1671660209.0
        }
      ]
    }
  ]
}