{
  "id": "zroiwl",
  "subreddit": "fuckeatingdisorders",
  "author": "trans_fats_",
  "created_utc": 1671633519.0,
  "title": "Just like ED me was shocked at how much I ate pre-ED, I'm now shocked at how little I ate before starting recovery",
  "selftext": "I just ate a pack of raisins. Y'know, the 40 g ones. It was gone in a few minutes.\n\nDuring the bad ol' times (~2 months ago lol) I also loved raisins. I once bought a 250 g bag that I thought was huge. I ate it in small handfuls (more like fingerfuls really) in the span of three days. When I realized it only took me 3 days to finish it, I wanted to cry. \n\nBack then, I seriously felt like I was eating the raisins without control and that 80 g in a the span of a few HOURS was a case of serious overeating. Today, after eating the raisins, I went back to the kitchen to put nutella on a slice of a baguette and EAT IT (the horror)! I had also eaten a Lidl pretzel and a rice cake before the raisins. Now I'm excitedly waiting for dinner as my dad promised chicken burgers. During my ED days, I'd have eaten only half the pretzel, skipped the rice cake because I already ate \"so much\" referring to half the pretzel, absolutely no Nutella and no baguette :( and no raisins in case I'd \"lose control\" again. I'd also have cried in the grocery store if my dad brought up the idea of burgers. Life was fun back then /s\n\nI can't believe I've gotten this far already. Life is so much better now :)\n\nUpdate: the burgers were yummy :]",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/zroiwl/just_like_ed_me_was_shocked_at_how_much_i_ate/",
  "score": 124,
  "num_comments": 7,
  "comments": [
    {
      "id": "j140b1f",
      "author": "bienshee",
      "body": "So so proud of how far you’ve come!! Enjoy the burgers ❤️",
      "created_utc": 1671633774.0,
      "score": 19,
      "context": []
    },
    {
      "id": "j14wh1m",
      "author": "SmolBeanAmina",
      "body": "Omg I felt the title! I am pretty sure I even overestimated the calories deep in my ED. Now no calorie counting, and if hungry, we go back for more-I wanted to peek at the calorie labels, or weigh the food several times now but I stopped myself! The only time I checked the weights on the package was to decide which one of the snacks was bigger so I could get it LOL\n\nAlso proud of you OP!!",
      "created_utc": 1671646363.0,
      "score": 11,
      "context": []
    },
    {
      "id": "j156ora",
      "author": "LoveThatForYouBebe",
      "body": "I loved reading this so much, thank you for sharing!!!!",
      "created_utc": 1671650346.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j14l8j6",
      "author": "busted3000",
      "body": "This is such an amazing post, it’s so lovely to hear how far you’ve come!! And I’m glad the burgers were yummy!",
      "created_utc": 1671642115.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j17grdn",
      "author": "weedmassacre",
      "body": "I don’t know you but this makes me feel so proud and happy for you OP :)) You are awesome for honouring your body’s needs and taking joy in fuelling your body.",
      "created_utc": 1671687635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j17vaup",
      "author": "myceliumfriend",
      "body": "Thank you for taking the time to write this out!!! I'm proud of you :)",
      "created_utc": 1671698388.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j17vjwl",
      "author": "myceliumfriend",
      "body": "Hope you're eating breakfast lunch and snacks now tho",
      "created_utc": 1671698596.0,
      "score": 1,
      "context": [
        {
          "id": "j17vaup",
          "author": "myceliumfriend",
          "body": "Thank you for taking the time to write this out!!! I'm proud of you :)",
          "created_utc": 1671698388.0
        }
      ]
    }
  ]
}