{
  "id": "zu76al",
  "subreddit": "fuckeatingdisorders",
  "author": "Halaros",
  "created_utc": 1671877530.0,
  "title": "Calories don't exist today, or tomorrow, or for the rest of the year at least!",
  "selftext": "I need to tell myself this! I need to stop counting calories, because if I eat everything I want to do today, tomorrow and even the day after, it will EASILY be >!6000-7000+!< calories every day, and that's OKAY! We've made so many delicious cakes and cookies and chocolates! We've bought in so many packs of different chocolates and candies and treats! I want hot chocolate, I want PB oatmeal, I want pizza, I want the Christmas dinners and desserts! I want fruits and veggies in addition; I want it all!\n\nFor me to TRULY enjoy myself, I can't count calories today; not sure how to avoid it though...\n\nHeck, even if I count everything and eat four times what I usually do, screw it! It's the holiday season; and I won't try to compensate for new years either!\n\nI wish you all luck with the holidays; and most importantly, enjoy yourselves with good company and food and whatever else you desire! What's the point of life if it can't be fully enjoyed!",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/zu76al/calories_dont_exist_today_or_tomorrow_or_for_the/",
  "score": 99,
  "num_comments": 4,
  "comments": [
    {
      "id": "j1hdx1q",
      "author": "farthest_star",
      "body": "Brilliant! And you're not alone - I'm going to be allowing myself to join in with everything and eat just for the joy of it. Hope you have a lovely time 🎄",
      "created_utc": 1671878002.0,
      "score": 19,
      "context": []
    },
    {
      "id": "j1i4wra",
      "author": "heyy240",
      "body": "I've been struggling so much this season but I feel less alone seeing this post :'> thanks for the uplifting message ! I'll try my best to follow thru and just enjoy the food !",
      "created_utc": 1671895881.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j1heof3",
      "author": "Halaros",
      "body": "Here's to the both of us!",
      "created_utc": 1671878679.0,
      "score": 7,
      "context": [
        {
          "id": "j1hdx1q",
          "author": "farthest_star",
          "body": "Brilliant! And you're not alone - I'm going to be allowing myself to join in with everything and eat just for the joy of it. Hope you have a lovely time 🎄",
          "created_utc": 1671878002.0
        }
      ]
    },
    {
      "id": "j1hkji4",
      "author": "Training-Positive-17",
      "body": "I want to do this too, so badly! \n\nI've reached a point (not in recovery, but wanting to start) where I've finally become aware that I really do want all of this beautiful, yummy food (takeaways, sweet and savoury 'processed foods that I tried convincing myself I didn't want any of it or need it. \n\nPanicking about Christmas Dinner tomorrow too. Fuck eating disorders. I love food and I don't want these rules anymore.",
      "created_utc": 1671883642.0,
      "score": 13,
      "context": [
        {
          "id": "j1hdx1q",
          "author": "farthest_star",
          "body": "Brilliant! And you're not alone - I'm going to be allowing myself to join in with everything and eat just for the joy of it. Hope you have a lovely time 🎄",
          "created_utc": 1671878002.0
        }
      ]
    }
  ]
}