{
  "id": "zvvwsg",
  "subreddit": "fuckeatingdisorders",
  "author": "SmolBeanAmina",
  "created_utc": 1672086126.0,
  "title": "Maybe, just maybe, the reason why I am so hungry and eat a lot at night is that,",
  "selftext": "MY BREAKFAST IS ALWAYS A SMALL BOWL OF CEREAL!\n\nI HAVE NO MORNING SNACK BECAUSE THE TIME BETWEEN BREAKFAST AND LUNCH BEING SHORT SCARES ME!\n\nI ONLY EAT LUNCH UNTIL IT LOOKS ENOUGH, BUT DOESN'T FEEL SO!\n\nI HAVE SALADS AND VEGGIE WRAPS FOR DINNER WITH LITTLE TO NO PROTEIN OR FAT SOURCES!\n\nBut nah, it's probably not that and I'm just binging /s\n\nSo maybe I should start by adding smth to my breakfast and having a better dinner.",
  "url": "https://www.reddit.com/r/fuckeatingdisorders/comments/zvvwsg/maybe_just_maybe_the_reason_why_i_am_so_hungry/",
  "score": 118,
  "num_comments": 4,
  "comments": [
    {
      "id": "j1rgbv4",
      "author": "mandanic",
      "body": "I think you’re on to something ;)",
      "created_utc": 1672086997.0,
      "score": 40,
      "context": []
    },
    {
      "id": "j1rl66v",
      "author": "whichaddiction4me",
      "body": "I was diagnosed with binge eating disorder in October at 44 yo and currently in an evidence-based treatment program with weekly visits to my therapist and monthly visits with my medical provider.\n\nThe first step to resolving uncontrollable hunger or binge eating episodes is to eat regularly, 3 meals + 2 snacks, no more than 4 hours apart but ideally 2/3 hours apart throughout the day. I am not instructed to count calories, but I am to maintain the scheduled eating and keep meals or snacks at the approximate eating times. This means that I am constantly feeding my body throughout the day, and I know I get to eat again very shortly and can make myself wait if I happen to be hungry in between snacks or meals. This also has reduced my binge eating episodes drastically, and I have not experienced an uncontrollable binge in 8 weeks. \n\nI'm not perfect at the tracking or maintaining exact times, but simply eating at regular intervals and making sure that I am keeping the huge hunger monster at Bay has made all the difference. I still wake up at night wanting to binge, though now if I am truly hungry, I do have a small snack ( like a piece of bread and butter, a piece of string cheese or another pre-portion snack Pack) that does not result in a thousand calorie or more episode. I'm starting to learn the difference between real hunger and the binge eating triggers, which helps me to increase food through the day and increase my success at night.\n\nMaybe this learning experience of mine can help lend validity to the strategy you are already recognizing in your post.",
      "created_utc": 1672089142.0,
      "score": 34,
      "context": []
    },
    {
      "id": "j1szgrh",
      "author": "idkman1768",
      "body": "Wild how eating enough throughout the day prevents binging isn’t it🤪",
      "created_utc": 1672112980.0,
      "score": 12,
      "context": []
    },
    {
      "id": "j1vpi1d",
      "author": "tiredbthrowaway",
      "body": "This is very relatable lol. Thank you for calling me out too",
      "created_utc": 1672169145.0,
      "score": 1,
      "context": []
    }
  ]
}