{
  "id": "104czyi",
  "subreddit": "EatingDisorders",
  "author": "aneverydaybattle",
  "created_utc": 1672959252.0,
  "title": "I love my partner SO much that sometimes I want to break up with him so he does not have to deal with my constant relapses...",
  "selftext": "Maybe I am being unconsiderate by stayinf with him because of love... Anyone struggles with this?:(",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/104czyi/i_love_my_partner_so_much_that_sometimes_i_want/",
  "score": 56,
  "num_comments": 15,
  "comments": [
    {
      "id": "j34s87m",
      "author": "He_who_humps",
      "body": "I accept my partner for what she is.  I wouldn’t leave her if she got cancer, why should I leave her if she had an eating disorder. Don’t feel bad for him loving you.\n\nI’m the father of a 23 year old that is in recovery.  We had a rough couple years.  She first started having trouble when she was 14.  After many inpatient stays and much therapy she is doing rather well and just graduated college.  You can do it too!",
      "created_utc": 1672967143.0,
      "score": 35,
      "context": []
    },
    {
      "id": "j34d0dx",
      "author": "Wooliesworld73",
      "body": "I'm sure he doesn't feel that way. Don't let your brain find another way to make you feel worse about yourself, brains are so good at beating us up. Yours probably does it in order to try and get you to relapse.\nKeep trying, keep working through it. Tell him you're so grateful that he stays by your side.",
      "created_utc": 1672961204.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j356pav",
      "author": "licegirl",
      "body": "when my boyfriend met me, i fell in love so hard that i recovered, or at least tried to. now, 6 months later, i find myself relapsing. i am constantly crying to him over the phone about this disorder, and no matter how much i vent, he still tells me he loves me and likes to listen. i try to believe him. i would not break up with him, but i often fear he will leave me because i refuse to listen to his advice. i guess we really are in love. we are moving in together and i am not sure how I'm gonna continue to relapse but ill figure that out when it comes to that. do you live with him?",
      "created_utc": 1672973183.0,
      "score": 9,
      "context": []
    },
    {
      "id": "j34vw6x",
      "author": "PeachYogurtLover",
      "body": "Noooo 😪 your ED doesn't make you a bad person, you are valuable and strong, an ED doesn't define you and you shouldn't struggle with this alone. I hope he can understand you and support you.",
      "created_utc": 1672968653.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j37mj9a",
      "author": "FindingAWayThrough",
      "body": "Oh man, this post hit me hard. I CONSTANTLY feel as though my boyfriend would be 100% better off without me. He is so kind, caring and compassionate, yet here I am, constantly turning to my ED when I know he doesn’t deserve all the stress and worry that I cause. \n\nOoof. Gentle hugs your way, OP. 💕",
      "created_utc": 1673022699.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j35y8dh",
      "author": "None",
      "body": "Absolutely not. He is with you because he loves all of you, the good and the bad. He's not perfect either, I'm sure, and I'd bet that he just wants you to be happy and feel supported. \n\nYou are deserving of love, despite your ED, and you should hold on tight to it, because he obviously loves you and wants the best for you. \n\nYOU are not your ED. You are a whole human being who happens to have a medical issue, and that is not a reason for anyone to not be with you, nor is it a reason for you to leave someone because you worry he can't deal.",
      "created_utc": 1672987725.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j362rev",
      "author": "Justdoingokay1108",
      "body": "I understand this feeling so much but you have to remember he’s with you he’s staying with you even with relapses you deserve happiness you deserve someone who is there for you and accepts you. Just because you relapse doesn’t mean you don’t deserve someone. If you want to talk more about this (I relate so much) feel free to message me :) please allow yourself happiness I know it’s hard but it’s what you deserve",
      "created_utc": 1672990998.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j36a1ys",
      "author": "None",
      "body": "It’s easy to feel this way, but you are not inconsiderate for staying with him. Please remember that you yourself are not your ED. You are a wonderful person that is deserving of love and happiness, regardless of your disorder.",
      "created_utc": 1672996797.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j36a83k",
      "author": "None",
      "body": "I am very close friends with someone that has an ED. It pains me a lot to see her like that. However, I feel my discomfort is an insignificant price for the love that I can give to her. I would do almost anything to see her become a little bit better and I do not expect anything in return. I think such is also how your SO thinks. If you would break up because of your ED, you are giving a victory to that terrible illness. Savor and enjoy every positive feelings you have from your relationship, because that will make both of you happy.",
      "created_utc": 1672996937.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j36c9s2",
      "author": "telluriciron",
      "body": "So, if your partner wants to break up with you-because of literally any reason, not just your ED-he can initiate that himself. You aren't keeping him locked up or anything, he's already free to walk away whenever he wants.\n\nSo if he hasn't walked away then *he doesn't want to*. And is not likely to be happy about you thinking you know what he wants better than *he* does.",
      "created_utc": 1672998635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j37dhe6",
      "author": "Similar_Syllabub_114",
      "body": "I relate to this so much and have been struggling with this as well a lot lately. I feel like I shouldn’t be dragging him into my struggles and don’t know what to do either because it isn’t fair to him.",
      "created_utc": 1673019321.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j397ep5",
      "author": "Catbun2020",
      "body": "I have a best friend who is the opposite gender whom I lean on heavily because I love him. He has been with me for close to ten years of this (and at varying degrees of severity) and I feel bad literally every time I have a meltdown but at the end of the day, I have to recognize he loves me for me, and I love him for who he is when he has meltdowns. It’s not always easy or fun, but we hold each other up and that’s what makes our friendship beautiful. When I do meltdown and then inevitably apologize for it, he reminds me he’s loved me for a long time and when I do freak out on him, he knows he is trusted and loved back. This is all a really long way of saying that no, don’t break up with him. Understand that yes, relapses will be hard on both of you, but eventually there will be fewer and it will make your relationship stronger. Trial by fire.",
      "created_utc": 1673043500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j39lpyw",
      "author": "JulioRod44",
      "body": "My girlfriend has been struggling for almost 2 years now and as hard as it is for her I wouldn’t trade her for anything in the world. You absolutely are not being inconsiderate and if you do love each other I’m sure he accepts you and wants to care for you. Good luck in your fight and I hope this helps :)",
      "created_utc": 1673049237.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j369x75",
      "author": "None",
      "body": "Just wanted to say that you sound like a great father!",
      "created_utc": 1672996688.0,
      "score": 12,
      "context": [
        {
          "id": "j34s87m",
          "author": "He_who_humps",
          "body": "I accept my partner for what she is.  I wouldn’t leave her if she got cancer, why should I leave her if she had an eating disorder. Don’t feel bad for him loving you.\n\nI’m the father of a 23 year old that is in recovery.  We had a rough couple years.  She first started having trouble when she was 14.  After many inpatient stays and much therapy she is doing rather well and just graduated college.  You can do it too!",
          "created_utc": 1672967143.0
        }
      ]
    },
    {
      "id": "j3eno40",
      "author": "He_who_humps",
      "body": "Thank you! I wish I was even better.",
      "created_utc": 1673139205.0,
      "score": 1,
      "context": [
        {
          "id": "j34s87m",
          "author": "He_who_humps",
          "body": "I accept my partner for what she is.  I wouldn’t leave her if she got cancer, why should I leave her if she had an eating disorder. Don’t feel bad for him loving you.\n\nI’m the father of a 23 year old that is in recovery.  We had a rough couple years.  She first started having trouble when she was 14.  After many inpatient stays and much therapy she is doing rather well and just graduated college.  You can do it too!",
          "created_utc": 1672967143.0
        },
        {
          "id": "j369x75",
          "author": "None",
          "body": "Just wanted to say that you sound like a great father!",
          "created_utc": 1672996688.0
        }
      ]
    }
  ]
}