{
  "id": "108vvqk",
  "subreddit": "EatingDisorders",
  "author": "moveslikejagger129",
  "created_utc": 1673412652.0,
  "title": "Diabulimia (TW)",
  "selftext": "I have a not so well known eating disorder… mine is called diabulimia. Basically it means I restrict insulin to lose weight, because I have diabetes. Just giving awareness to other disorders that are not as well known. Thanks for listening to my TED talk.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/108vvqk/diabulimia_tw/",
  "score": 105,
  "num_comments": 15,
  "comments": [
    {
      "id": "j3v8p7v",
      "author": "SmileThen22",
      "body": "i hate how lesser known EDs are so often dismissed. loads of people dont even know that PICA, rumination disorder, ARFID, diabulimia, orthorexia, purging disorder, etc.. even exist. it makes the stigma worse, im so sorry",
      "created_utc": 1673423728.0,
      "score": 52,
      "context": []
    },
    {
      "id": "j3vkspf",
      "author": "Margkam",
      "body": "I was in treatment with someone with diabulimia who was pregnant. This is such a scary eating disorder. Please take care.",
      "created_utc": 1673433800.0,
      "score": 20,
      "context": []
    },
    {
      "id": "j3uriep",
      "author": "M1nn1m0use",
      "body": "I’ve never heard of this and I’m so sorry you’re going through it but thank you for sharing. I feel so many disorders aren’t yet classified and it can make getting treatment that much more difficult",
      "created_utc": 1673412749.0,
      "score": 14,
      "context": []
    },
    {
      "id": "j3x61ca",
      "author": "RepulsiveApartment20",
      "body": "I have diabulimia and bulimia. I’ve been in recovery for 1 and 1/2 now but I have also gone into cardiac arrest twice, was in a coma for two weeks and on a ventilator and had to get my left pinky toe amputated. There are real consequences that may seem so distant right now, but the longer you do this the worse it gets. I know it’s hard but you’ve got to try to get it under control. The repercussions are not worth the skinny body. Nobody cares if your skinny when you’re lying in a coffin.",
      "created_utc": 1673460060.0,
      "score": 12,
      "context": []
    },
    {
      "id": "j3wjr7q",
      "author": "Strawberrywitches",
      "body": "My father has diabulimia and and it’s killing him, he’s constantly in and out of the hospital and can’t manage his everyday life (although he barely has one because he can barely function) it’s really messed him up and done a lot of damage",
      "created_utc": 1673451898.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j3uw4s7",
      "author": "BEBE-r",
      "body": "Have you been diabetic for a long time? I hope that you have support in taking care of your mental and ohysical health 🧡🧡🧡",
      "created_utc": 1673415293.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j3x9lp9",
      "author": "According-Constant89",
      "body": "My close friend passed away from this stay strong its a terrible illness I hope you're able to access help if not know you are not alone",
      "created_utc": 1673461346.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j3uy92u",
      "author": "None",
      "body": "That is so dangerous 😳  are you getting any help?",
      "created_utc": 1673416541.0,
      "score": 9,
      "context": []
    },
    {
      "id": "j3vmcho",
      "author": "Lina_lightwood",
      "body": "I’m going trough the same thing right now .. I hate how “ easy “ my diabetes is making this",
      "created_utc": 1673435015.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j3ysuvj",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1673482104.0,
      "score": -4,
      "context": []
    },
    {
      "id": "j3z87oa",
      "author": "doctorpness",
      "body": "Long-time Diabulimia sufferer here- please join the \"diabulimia awareness\" support group on facebook. We are a big community that can offer help in many ways, if even just to talk about going through hard times. I will warn you, a lot of the stories and serious consequences going on in that group will scare the absolute shit out of you, but sometimes that is what a person needs to jumpstart recovery.  It took a coma and long-term hospitalization for me to get my shit together, and I still have permanent damage that will only get worse as I age. Please get help, it's not worth it. They don't call it the world's deadliest eating disorder for nothing.",
      "created_utc": 1673488491.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j5ve0oj",
      "author": "turbollamaa",
      "body": "I have diabulimia too, Its hard to have and its hard to recover. All EDs are hard but I think diabulimia is a little harder because it is not well known or understood even in the ed/treatment world (There is not a clear dx for diabulimia and ive had doctors that dont fully agree on the best course of action). Its so important to work towards recovery because, as much as I hate to say it, diabulimia tends to give less time than others to do so.",
      "created_utc": 1674679907.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j3x30gw",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1673458984.0,
      "score": 9,
      "context": [
        {
          "id": "j3v8p7v",
          "author": "SmileThen22",
          "body": "i hate how lesser known EDs are so often dismissed. loads of people dont even know that PICA, rumination disorder, ARFID, diabulimia, orthorexia, purging disorder, etc.. even exist. it makes the stigma worse, im so sorry",
          "created_utc": 1673423728.0
        }
      ]
    },
    {
      "id": "j3zbv2q",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1673490039.0,
      "score": 1,
      "context": [
        {
          "id": "j3ysuvj",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1673482104.0
        }
      ]
    },
    {
      "id": "j3x54gx",
      "author": "SmileThen22",
      "body": "youre so welcome <3. you guys deserve better than the bare minimum of simply being recognized",
      "created_utc": 1673459733.0,
      "score": 5,
      "context": [
        {
          "id": "j3v8p7v",
          "author": "SmileThen22",
          "body": "i hate how lesser known EDs are so often dismissed. loads of people dont even know that PICA, rumination disorder, ARFID, diabulimia, orthorexia, purging disorder, etc.. even exist. it makes the stigma worse, im so sorry",
          "created_utc": 1673423728.0
        },
        {
          "id": "j3x30gw",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1673458984.0
        }
      ]
    }
  ]
}