{
  "id": "109t3bs",
  "subreddit": "EatingDisorders",
  "author": "Strongfish45",
  "created_utc": 1673506881.0,
  "title": "First signs of your body shutting down",
  "selftext": "What were the first symptoms or signs you had when your body started to shut down? \nI'm trying to identify some symptoms I have and I was wondering if it could be related to food restriction \nAlso can you get health problems even if you're still at a healthy weight?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/109t3bs/first_signs_of_your_body_shutting_down/",
  "score": 40,
  "num_comments": 15,
  "comments": [
    {
      "id": "j41119c",
      "author": "XTianoElCurioso",
      "body": "If you are after a list of symptoms of eating disorders you can probably get a lot of those from others or just Googling it..\n BUT my advice would be to please go and see a doctor or specialist about this. Symptoms can be very different between people and interpreting what means what is a medical science. The metaphor of the body shutting down is not a particularly good one because it assumes that things are going to go slowly. But the reality is that things can happen very quickly such as cardiac arrests and you might not get any warnings. \nSo please talk to someone who can give you advice that is specific to your body/circumstances",
      "created_utc": 1673528327.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j409kcq",
      "author": "None",
      "body": "Everyone is different. For women it usually starts with loosing the ability to have a period. Weakness and feeling faint is also an early symptom. For me I knew it was getting serious when I started passing out. Depending on how quickly you lost weight, yes, you can still be seriously sick even with a healthy weight. Heart problems are a major issue with ED.",
      "created_utc": 1673508066.0,
      "score": 28,
      "context": []
    },
    {
      "id": "j4221rh",
      "author": "S2yydrj",
      "body": "Very cold hands and feet, cold just in general when everyone else finds the temperature normal, hair loss, brain fog, tired regardless of adequate sleep, fainting. Those are all the ones that hit me hardest and soonest",
      "created_utc": 1673543763.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j41kkg7",
      "author": "smithscully",
      "body": "I just wanted to pop in to say that weight does not correlate to health. You can be of a higher weight and perfectly healthy and at a “normal” weight and be unhealthy. This is why we say that EDs don’t discriminate by weight. This is also why medical monitoring in treatment is a thing. If you are concerned about symptoms you are having, please reach out to a doctor if you can.",
      "created_utc": 1673537090.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j40d4ty",
      "author": "610-Kat",
      "body": "BRAIN FOG HAS BEEN A NIGHTMARE",
      "created_utc": 1673510759.0,
      "score": 15,
      "context": []
    },
    {
      "id": "j40f6v0",
      "author": "None",
      "body": "I had constant back pain and fatigue, which then morphed into full on kidney failure. Am better now..sort of. Bulimia where you’re purging x3 a day and low res isn’t a good combo. \n\nFar as my knowledge goes yeah I’ve heard of people who’ve been a healthy weight/bmi and still having things like heart failure",
      "created_utc": 1673512383.0,
      "score": 12,
      "context": []
    },
    {
      "id": "j42uen1",
      "author": "FirstAd4471",
      "body": "As a girl. Terrifyingly cold, and very purple/blue. No period for awhile. My stomach just felt obscenely empty. I don’t know how something so bad, could feel so good. Definitely in hindsight it was worrisome. I really hurt my body, and the damaged has lasted well into my adult years",
      "created_utc": 1673554173.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j438zdv",
      "author": "Constantly_fatigued",
      "body": "I couldn’t eat without feeling nauseous, brain fog, dizziness, fatigue, depression. Just overall feeling physically like I wanted to sleep and never wake up. It was awful and thankfully I had a moment were self preservation kicked in and got help.",
      "created_utc": 1673559351.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j43f0rv",
      "author": "Anypega",
      "body": "Tired, can’t breath, sleepy, heavy breaths, dizziness, lost of appetite, anxious, sad",
      "created_utc": 1673561535.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j43k9or",
      "author": "None",
      "body": "I have never been underweight and I’m currently spending thousands of dollars to treat my small intestinal bacterial overgrowth that I got because of restricting. I also lost my period for several years and I’m sure lost a lot of bone density. All while at a “normal” BMI looking like a healthy and “fit” person. Tap out now while you’re ahead!! Don’t go down this road!",
      "created_utc": 1673563496.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j43zehd",
      "author": "r1poster",
      "body": "For me, my blood pressure was insanely low, I would have frequent bouts of brain fog, and, for some reason, my lips would occasionally turn blue.\n\nAlso, yes, you can get health problems at a healthy weight. I was barely underweight on the BMI scale when my symptoms started occurring.",
      "created_utc": 1673569566.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j45k769",
      "author": "Educational_Egg7569",
      "body": "Besides the brain fog, dizziness, short breath, hair loss, extreme tiredness(sleeping 12+hours/day)…at my worst what really scared me were the heart palpitations and edemas in my legs-I thought they were gonna need to cut them off. Oh and the extreme muscle loss caused me to not be able to get out of bed, shower or even take the stairs without help",
      "created_utc": 1673599810.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j45bl4d",
      "author": "None",
      "body": "Fainting, dizziness, erectile dysfunction.",
      "created_utc": 1673593339.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j47128o",
      "author": "funnyegger",
      "body": "i don’t think my body was shutting down but i did/do have some adverse affects from undereating such as cold all the time. my hands would turn blue and same with my feet. i was constipated and would go days without going to the bathroom. hair loss, loss of period, and just feeling lightheaded and dizzy",
      "created_utc": 1673628230.0,
      "score": 1,
      "context": []
    }
  ]
}