{
  "id": "10fteso",
  "subreddit": "EatingDisorders",
  "author": "ErinOrIrene",
  "created_utc": 1674105644.0,
  "title": "I want people to notice",
  "selftext": "I don't know why, but I really want someone to notice me struggling. \n\nI'm 16, and I keep hoping that one of my teachers will notice something about me, or during lacrosse practice my coach will notice I'm off, or my English teacher will hear me mention that I haven't been eating and will ask me how I'm doing. \n\nI just really want my teachers and other adults to care.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/10fteso/i_want_people_to_notice/",
  "score": 61,
  "num_comments": 8,
  "comments": [
    {
      "id": "j4zi267",
      "author": "fuqthisshit543210",
      "body": "Please talk with an adult you trust. You don’t have to suffer in silence ❤️",
      "created_utc": 1674122583.0,
      "score": 32,
      "context": []
    },
    {
      "id": "j508y83",
      "author": "savannahruns",
      "body": "Honestly, I think this is fairly common.  I know I felt like this as a teenager struggling, and even sometimes as a young adult.  It was really helpful for me to get into therapy and be able to use my words to tell someone that I'm struggling instead of using actions and hoping they would notice.  It was - and still is - very validating and helpful to hear my therapist say that she knows I'm struggling or scared or whatever, and that she's there.",
      "created_utc": 1674138697.0,
      "score": 21,
      "context": []
    },
    {
      "id": "j51lcgf",
      "author": "Illustrious_Wind_233",
      "body": "I agree with the others suggesting you reach out to someone.\n\nIt really hard for someone who may see you struggling to know whether it's OK to talk with you about it.  They don't know if you'd be OK with them \"crossing that line\" and getting into personal discussions.  Out of respect for you, they may not reach out even if they think something is going on.  That said, if you reach out to let them know you are struggling and are looking for help, I'd bet they'd not hesitate one second to do whatever they can to help.",
      "created_utc": 1674156834.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j5357ev",
      "author": "ghostboydreamer",
      "body": "I spent my whole eating disorder hiding it but silently begging people to notice. No one ever did. When I asked for help, though, they cared. People just don’t know what to look for. Being the one to ask for help is so scary, but I believe you can do it :) and recovery is possible I promise",
      "created_utc": 1674179125.0,
      "score": 4,
      "context": []
    },
    {
      "id": "j4z6f8t",
      "author": "NoelAngeline",
      "body": "Is it possible you want to feel your eating disorder is validated?\n\nIf you’re not ok… is it ok to reach out and say that you’re not ok to someone?",
      "created_utc": 1674113110.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j52o84s",
      "author": "Riley_R24",
      "body": "I went through this too. I know it doesn’t seem like what you want to do but the strongest thing you can do is ask for help. Unfortunately it’s not people’s jobs (other then your parents) to make sure you’re okay and safe, everyone has their own struggles and mostly focus on themselves. Please try to talk to a trusted adult or even doctor, nurse, teacher, ect. It takes strength to realize you’re struggling and I promise it will be worth it later",
      "created_utc": 1674171926.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j52ptw3",
      "author": "Aggravating_Lead_616",
      "body": "I wanted people to notice too and care about me for once :/",
      "created_utc": 1674172588.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j53db1p",
      "author": "ahchava",
      "body": "Something I learned a few years ago is that people are not mind readers. Especially teachers. They are over worked and don’t have the spoons to watch for every kids silent struggle. If you want help I have no doubt they will happily help you and support you, but you have to tell them first.\n\nETA: my partner is a teacher and often comes across situations/notices things where he cares —even a lot—but can’t say anything without it becoming a problem.",
      "created_utc": 1674182687.0,
      "score": 2,
      "context": []
    }
  ]
}