{
  "id": "10gclsh",
  "subreddit": "EatingDisorders",
  "author": "Cheekygirl97",
  "created_utc": 1674160873.0,
  "title": "My coworker just made a comment",
  "selftext": "As the title says, my coworker just told me I’ve been gaining weight, her exact words were, “when you started you were so tiny and skinny, now…” now I don’t want to eat my lunch. I don’t know what to do. I’ve been in recovery for a year with a lot of relapsing.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/10gclsh/my_coworker_just_made_a_comment/",
  "score": 48,
  "num_comments": 8,
  "comments": [
    {
      "id": "j534bgc",
      "author": "He_who_humps",
      "body": "If you feel up to it, you should assert yourself and tell her that comments about your body are never appreciated whether positive or negative, and you would appreciate that she never does again. You could also go to HR about it to. I know some people don’t feel comfortable revealing their eating disorder at work, but it can be a positive experience. You have a disease that is not your fault. Just like another person that might be in recovery with cancer.",
      "created_utc": 1674178742.0,
      "score": 38,
      "context": []
    },
    {
      "id": "j53tp1j",
      "author": "SieBanhus",
      "body": "Whether or not it’s true, “And now I’m much healthier and happier, thanks for noticing!”",
      "created_utc": 1674190562.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j52xp1z",
      "author": "LucyBlue16",
      "body": "Ugh when will people learn to not comment on things that don’t concern them? This says way more about her than it does you. You don’t owe her anything. I’m sorry that happened.",
      "created_utc": 1674175888.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j52nagg",
      "author": "arcsprung",
      "body": "That's super shitty of them, I'm so sorry to hear that 💜 I've had this happen with colleagues too... some people just don't think about how things they say might affect other people. It sounds like you've been working so hard and doing so well, relapses don't mean you're not taking steps forward! \n\nAre you perhaps able to drink something like a yoghurt or hot chocolate? I find things are easier to drink than eat when I'm wanting to restrict so it can be a good compromise if a whole lunch is too much right now. Sending lots of strength :)",
      "created_utc": 1674171534.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j5305lu",
      "author": "llamasfartIveheardit",
      "body": "I know EXACTLY what you mean. We have photo ID for work, mine was from when I was a health weight (4 years ago). My co-worker said I looked chubby in the photo and that I look better now. \n\nMy ED brain soaked up that comment but my healing brain wanted to cry and shout at him for potentially ruining my progress.",
      "created_utc": 1674176945.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j543ut6",
      "author": "evrlastingangel",
      "body": "oh no :(( that’s really awful, don’t bother listening to her. that’s super fucked up in her part. im proud that u came this far in ur recovery. don’t let her mess it all up for u.",
      "created_utc": 1674196721.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j57tav8",
      "author": "updown27",
      "body": "Personally, when I was going through that, I told people flat out exactly what was going on. I wanted them to understand how inappropriate it is to comment on people's bodies. I wanted them to be as uncomfortable as I was when they made comments about it. And I would tell them not to make comments about my body or my food. If conversation about weight, body image, dieting, etc. came up, I would say, \"I don't want to talk about that,\" on repeat until they stopped talking about it. I don't care if it makes people uncomfortable. It SHOULD make people uncomfortable to say stuff like that. I know this method doesn't work for everyone but I just want you to know it's absolutely within your right to stand up for yourself. You can be vague about your condition just saying \"yeah, I've been going through a grueling medical treatment, it's been really tough and I'd really appreciate if you didn't comment on my body.\" I also used the phrase \"doctors orders!\" quite a bit when people slipped up to remind them I have a medical condition and their comments are inappropriate.",
      "created_utc": 1674260422.0,
      "score": 1,
      "context": []
    }
  ]
}