{
  "id": "10nv98i",
  "subreddit": "EatingDisorders",
  "author": "shortstack3000",
  "created_utc": 1674955299.0,
  "title": "Has anyone else gotten to a point with their ED where it's too much work?",
  "selftext": "The hiding, spending money on food your just going to try to get rid of, the guilt and shame from those who know....",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/10nv98i/has_anyone_else_gotten_to_a_point_with_their_ed/",
  "score": 74,
  "num_comments": 18,
  "comments": [
    {
      "id": "j6b6rka",
      "author": "j_p96",
      "body": "Yes, it’s completely exhausting. All the way down to feeling guilty and rude when I turn down food being offered to me. And then the look on my friend’s/family’s faces just crushes me. I’m so done with it. I’m at the beginning stages of recovery (building a team of medical professionals, essentially) and it’s a full time job. But I know it’ll be worth it… just need to develop better habits. \n\nWishing u the best.",
      "created_utc": 1674957954.0,
      "score": 28,
      "context": []
    },
    {
      "id": "j6bpe4z",
      "author": "SieBanhus",
      "body": "Every couple of weeks I get to this point…and then I knock out and sleep for 18 hours and my stupid disordered brain decides I was just sleepy, not tired of being alive, and I keep right on with my bullshit. \n\nBut honestly I don’t know how much longer I can keep going",
      "created_utc": 1674966974.0,
      "score": 17,
      "context": []
    },
    {
      "id": "j6b3ypu",
      "author": "Excellent-World-476",
      "body": "Anyone who says having an eating disorder is easy and enjoyable is lying and in denial.",
      "created_utc": 1674956640.0,
      "score": 25,
      "context": []
    },
    {
      "id": "j6cdyz7",
      "author": "agorathird",
      "body": "Staying up until sunrise just to finish my exercise routine but still feeling anxious and afraid of my body is too much at once. I can deal with the negative feelings if i get sleep. And my muscles need to recover. It feels too inhumane to be soothed by right now.",
      "created_utc": 1674984251.0,
      "score": 12,
      "context": []
    },
    {
      "id": "j6dir2u",
      "author": "krolikzajchik",
      "body": "True, I understood that I couldn’t live like this anymore and started recovery. I’ve been in recovery for 5 years, so you will be able to do it too!",
      "created_utc": 1675008699.0,
      "score": 6,
      "context": []
    },
    {
      "id": "j6bjzn3",
      "author": "None",
      "body": "Yup but I can’t stop . I have to keep losing . It’s stressful and draining . I’ll spend hours planning and procrastinating. How long it’ll take to lose x amount . I’m so tired . It makes me cry thinking about younger me I wish I didn’t do this to her . I want to be normal again. Not think about this daily and not let it consume me it’s just sucked my personality and life up",
      "created_utc": 1674964307.0,
      "score": 8,
      "context": []
    },
    {
      "id": "j6d25k2",
      "author": "mindfullymoving",
      "body": "Yeah, that’s when I chose recovery",
      "created_utc": 1675001439.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j6dx64o",
      "author": "Unlikely-Conflict-30",
      "body": "Totally exhausted",
      "created_utc": 1675014338.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j6fer9n",
      "author": "throwmefar666",
      "body": "Wow yes. It’s so much work to kill myself slowly lol. But it’s also so much work to be healthy. Maybe it’s less, though. I feel like the hiding and guilt add so much more to the level of exhaustion; with being healthy, you can get help",
      "created_utc": 1675034250.0,
      "score": 3,
      "context": []
    },
    {
      "id": "j6e7lo3",
      "author": "freedomofit",
      "body": "What really got me into recovery was the realization that i have severe osteoporosis. Then recovery wont look like too much work. Its never easy, but for once you actually realize the true reason to recover. Having said that, i dont believe in a full recovery for those who had or still dealing with severe AN.",
      "created_utc": 1675018350.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j6fb3jg",
      "author": "None",
      "body": "this is what drove me to recovery a few years ago. I had spent my entire life wasting time and money on my eating disorder, and one day I just woke up and I was fucking EXHAUSTED. it gets to be too much. It's not like recovery is a walk in the park, but at least with recovery theres a light at the end of the tunnel. With my ED, I always wanted to be sk*nnier, there was always more to go. With recovery there's just so much more to celebrate, so it's less tiring.",
      "created_utc": 1675032919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j6ddkpe",
      "author": "Scary-Permission-293",
      "body": "I go from obese to anorexic. I’m stopping myself in the 5lbs over weight by science definition now, but it’s hard. To suffer both over eating (binge) and not eating (anorexic) sucks. I wish I was bulemic at times as they have the most average weight, but am glad I stopped laxatives years ago to be anorexic. No matter what my ED is going it seems. It just sucks that’s all.",
      "created_utc": 1675006598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j6e0xed",
      "author": "shortstack3000",
      "body": "You need the sleep too! Thinking about you hope your having a good day today 😊",
      "created_utc": 1675015786.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j6cf701",
      "author": "wethail",
      "body": "Yeah… I got down to my UUGW in 2019… and today we are 69 pounds heavier i gained more than half of me",
      "created_utc": 1674985269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j6de3gm",
      "author": "bestjamieever89",
      "body": "I’ve managed to stop purging because of my guilt/expense of food. I cannot however stop myself from purging",
      "created_utc": 1675006811.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j99cnvt",
      "author": "Fantastic_Royal8119",
      "body": "I understand this and it truly sucks to feel this way all the time. I haven't got to the point where it's noticeable when I relapse but I get so angry at everything and it's because of this. Exhaustion from restricting and feeling shame and hating yourself and at some point your SO because without meaning to they say or do triggering things. Or when you have the day planned out but of course outside sources change those plans and you can't go about with how you wanted the day to go so like the food you knew was okay to eat or when you needed to start working out. It is so many things and never something you can say was worth it.",
      "created_utc": 1676874210.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j6fbjx6",
      "author": "Creepy_Ad_3132",
      "body": "No, you just reclaimed you. You aren't a number, but through regaining needed weight, you have regained your life back xx",
      "created_utc": 1675033076.0,
      "score": 2,
      "context": [
        {
          "id": "j6cf701",
          "author": "wethail",
          "body": "Yeah… I got down to my UUGW in 2019… and today we are 69 pounds heavier i gained more than half of me",
          "created_utc": 1674985269.0
        }
      ]
    },
    {
      "id": "je6nk9q",
      "author": "wethail",
      "body": "this made me tear up, thank u <3",
      "created_utc": 1680120341.0,
      "score": 2,
      "context": [
        {
          "id": "j6cf701",
          "author": "wethail",
          "body": "Yeah… I got down to my UUGW in 2019… and today we are 69 pounds heavier i gained more than half of me",
          "created_utc": 1674985269.0
        },
        {
          "id": "j6fbjx6",
          "author": "Creepy_Ad_3132",
          "body": "No, you just reclaimed you. You aren't a number, but through regaining needed weight, you have regained your life back xx",
          "created_utc": 1675033076.0
        }
      ]
    }
  ]
}