{
  "id": "10ptbe3",
  "subreddit": "EatingDisorders",
  "author": "Aida540",
  "created_utc": 1675154613.0,
  "title": "I cannot stop overeating",
  "selftext": "Since christmas I overate at least 4-5 days per week. \n\nAt first it was because, well, christmas food. Then I went on a week holiday to different country where I wanted to try so many food and was eating way too much. \nNow I have exams time and I’m so stressed that I eat my emotions. I have this urge everyday to eat most of my planned food in the begining of the day, if I won’t I wouldn’t be able to focus on studying. I don’t wanna overeat but I have to focus right now too. \n\nI think about food all the time. There is no other way to satisfy my emotional hunger. Games do not help, friends do not help. Exercise? I try to move as much as I can but I don’t have time for it right now.\n\nI don’t even have that much food at home. At this point I snack on green olives and chocolate sprinkles cause there is literally no other food. \nI have easy access to food delivery so I that is mostly how I overeat + when I’m out I buy pastries. \n\nThis is problem about me. I can control myself most of the time. I can lose weight and have healthy relationship with food. But in times like now I feel like there is nothing I can do to not overeat. I’m losing hope that I will ever be like normal people. \n\nWhat can I do?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/10ptbe3/i_cannot_stop_overeating/",
  "score": 41,
  "num_comments": 10,
  "comments": [
    {
      "id": "j6ndeaa",
      "author": "KnopeCampaign",
      "body": "I have binged most of my life and could never think about food in a healthy way, so I get it. I’m sorry you’re going through this. What really helped me was to address seemingly unrelated issues; depression, anxiety, ADHD, and vitamin deficiencies. You know how people with low iron crave ice? Same thing can come from vitamin deficiencies that make you crave sugar/carbs. \n\nI also got prescribed Phentermine to help curb my appetite. It gave me a lot of freedom to think about other things, and to be more mindful. Before, it’s like food autopiloted into my mouth and I had no control. \n\nWhatever you do, be kind to yourself. I hope you find some peace with food and exams soon. ❤️",
      "created_utc": 1675180002.0,
      "score": 16,
      "context": []
    },
    {
      "id": "j6nqc9z",
      "author": "unVisible-Scientist",
      "body": "Being tired can make you crave carbs and sugar limitlessly. Try regulating ur sleep and setting a bedtime even if you don't go to sleep, set a timer to brush your teeth at the end of the night.\nI dont have all the answers, I'm going thru it myself too, but small steps end up being big steps in the end. And never give up",
      "created_utc": 1675184834.0,
      "score": 7,
      "context": []
    },
    {
      "id": "j6n2u3c",
      "author": "SpaghettiBecky",
      "body": "hey, i've been in a similar situation and i really feel for you. it really sucks when food is all you can think about. just give yourself permission to eat. don't try to restrict yourself to certain \"planned\" foods. and actually enjoy your food. if you're craving fries, have fries. dont try to replace your cravings with carrot sticks or whatever. once you realise food is just food, it will have less control over you. \nalso, love yourself. even if you can't love your body, try to accept it. dont hate it. dont get so hyper focused on your body. \nreminder: everyone else is too busy thinking about themselves to notice your belly roll (which is totally normal btw). hope u get better soon :)",
      "created_utc": 1675175752.0,
      "score": 10,
      "context": []
    },
    {
      "id": "j6ngpwm",
      "author": "kikidelaney",
      "body": "Please talk to your doctor💕",
      "created_utc": 1675181263.0,
      "score": 5,
      "context": []
    },
    {
      "id": "j6pav4m",
      "author": "JustabitLii",
      "body": "Here’’s my experience and an advice.\n\nI was binging. At first I was punishing myself by trying to eat less or eat healthier (and killed myself with running miles) but it always got worse after that. Same as you, if I didn’t have anything at home, I would eat funny things like dry oatmeal, a pack of bread with jam, etc. Then I understood that punishing and restricting myself is no good and I accepted myself. I accepted how much I eat, so this was the first step. Next, I understood that the real problem lied deeper. I started reading about depressions, about hormones, about brain biology and it actually helped a lot. So I realised that it was a kind of a depression and food was the only thing that made me happy. I ate when I was feeling good, when I was feeling bad, when I was tired, when I was lonely, etc. So finally I realised two things - 1) I didn’t like the field I just had got my bachelors degree in, feeling that I wasted 4 years of my life and also money. I accepted that. 2) As nothing made me happier than food, I looked for things that also cheered me up. I am not a good dancer but I went to the bachata classes and I always waited for the next class because mentally the atmosphere there helped me a lot. \nBecause we do many things automatically, not really thinking about how we feel, sometimes our body tells us that. Since then I know that if I start binging, I am not happy with something. Then I start digging and now I find those things pretty quickly. I haven’t binged for over a year and I think I found the key. \nWhat I want to say - your binging is a symptom, not a reason. Maybe you are not happy with something in your life? Your uni, job, relationships, goals, whatever.\nThink about it.",
      "created_utc": 1675205839.0,
      "score": 2,
      "context": []
    },
    {
      "id": "j6ny0zy",
      "author": "Maraxnina",
      "body": "I have no advice for you, but I just wanted to let you know I’m in the exact same situation as you. Can’t stop thinking about food since Christmas and I have exams this week. I can’t focus on studying because I constantly want to eat. For me it helps a bit to remind myself that I will start focusing on eating healthy and will start sporting again after my last exam. Until then I just eat a bit more and will probably gain some weight, which I will lose later.",
      "created_utc": 1675187614.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j6rcvey",
      "author": "juicepirate",
      "body": "Hey, are you seeing a therapist? I don’t believe this is something one can overcome by themselves… I know how much it sucks and I’m sorry you’re going through this. It’s a way you have found to cope with some feelings and emotions, like you wrote, there’s a reason why you’re doing it, but it’s hard to tell the reason without someone exterior helping you untangle everything. Also, a lot of people, like, most people binge during exams even when they don’t have an eating disorder so i hope you don’t feel too guilty. Good luck on your exams! I hope you feel better soon 💜",
      "created_utc": 1675246567.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j6rwdrf",
      "author": "humbledbyit",
      "body": "I used food to cope with stress during college. I also would compulsively eat just because -bored, lonely, sad, happy. I needed to try all the things I thought would work to get control of it - years & years of therapy for BED, episodes of depression or anxiety, hypnosis, weight watchers, wt loss doctor, nutritionists, self study, energy work on & on. Nothing worked long term. That's how i discovered between the ears I was screwed when it came to eating & managing wt. I joined a 12 step program & discovered I'm the chronic hopeless variety for whom all other measures will fail. My own willpower won't work rt eating & wt management. When I hit rock bottom then I became willing to do whatever it takes to get recovered. I got a sponsor & worked tge steps quickly to get recovered.  Now I can eat for nourishment and be satisfied.  Now the evenings are no longer a worry point for mindless eating & binging. I'm happy to chat more if you like.",
      "created_utc": 1675259103.0,
      "score": 1,
      "context": []
    },
    {
      "id": "j6osc7i",
      "author": "airhornsuitman",
      "body": "This is what worked for me to get my life back but just because it is well summarized it a paragraph doesn’t mean it is easy. Giving yourself permission and fostering acceptance of your body is a tedious and difficult work but it is well worth keeping at it. Having weekly therapy and a fat positive dietician after going to eating disorder treatment was crucial for me but I realize that is not accessible for all unfortunately.",
      "created_utc": 1675198807.0,
      "score": 1,
      "context": [
        {
          "id": "j6n2u3c",
          "author": "SpaghettiBecky",
          "body": "hey, i've been in a similar situation and i really feel for you. it really sucks when food is all you can think about. just give yourself permission to eat. don't try to restrict yourself to certain \"planned\" foods. and actually enjoy your food. if you're craving fries, have fries. dont try to replace your cravings with carrot sticks or whatever. once you realise food is just food, it will have less control over you. \nalso, love yourself. even if you can't love your body, try to accept it. dont hate it. dont get so hyper focused on your body. \nreminder: everyone else is too busy thinking about themselves to notice your belly roll (which is totally normal btw). hope u get better soon :)",
          "created_utc": 1675175752.0
        }
      ]
    },
    {
      "id": "jdjnqox",
      "author": "ajkpidds",
      "body": "Thank you for this. I can relate.",
      "created_utc": 1679693912.0,
      "score": 1,
      "context": [
        {
          "id": "j6pav4m",
          "author": "JustabitLii",
          "body": "Here’’s my experience and an advice.\n\nI was binging. At first I was punishing myself by trying to eat less or eat healthier (and killed myself with running miles) but it always got worse after that. Same as you, if I didn’t have anything at home, I would eat funny things like dry oatmeal, a pack of bread with jam, etc. Then I understood that punishing and restricting myself is no good and I accepted myself. I accepted how much I eat, so this was the first step. Next, I understood that the real problem lied deeper. I started reading about depressions, about hormones, about brain biology and it actually helped a lot. So I realised that it was a kind of a depression and food was the only thing that made me happy. I ate when I was feeling good, when I was feeling bad, when I was tired, when I was lonely, etc. So finally I realised two things - 1) I didn’t like the field I just had got my bachelors degree in, feeling that I wasted 4 years of my life and also money. I accepted that. 2) As nothing made me happier than food, I looked for things that also cheered me up. I am not a good dancer but I went to the bachata classes and I always waited for the next class because mentally the atmosphere there helped me a lot. \nBecause we do many things automatically, not really thinking about how we feel, sometimes our body tells us that. Since then I know that if I start binging, I am not happy with something. Then I start digging and now I find those things pretty quickly. I haven’t binged for over a year and I think I found the key. \nWhat I want to say - your binging is a symptom, not a reason. Maybe you are not happy with something in your life? Your uni, job, relationships, goals, whatever.\nThink about it.",
          "created_utc": 1675205839.0
        }
      ]
    }
  ]
}