{
  "id": "11fk68q",
  "subreddit": "EatingDisorders",
  "author": "Extra-Conference8710",
  "created_utc": 1677709490.0,
  "title": "I need desperate advice on how to help with my sister's eating disorder",
  "selftext": "I (22M) am in desperate need for help with a situation that is destroying my family. My sister (19F) has been struggling with a devastating eating disorder for a year now. We have tried everything we can think of to support her, but nothing seems to be working, and we are near our breaking point.\n\nInitially, my sister started off with what seemed like a desire to lose a few pounds. However, it quickly escalated into a full-blown disorder, with her spending hours on the treadmill every day and not eating anything. From the very beginning, my mother knew that things were not looking good. She constantly warned my sister of the dangers of the path that she is on.\n\nMy mom would try to help her and offered to see a therapist or nutritionist with her, but she viciously refused, saying that she knows what she's doing and that my mother doesn't know what she's talking about. She was constantly exercising and never eating, and my mom would try to explain to her the dangers of this and share her support for her. But my sister is extremely stubborn by nature, and would always just brush her off, attack her, yell at her. This continued for many months, my sister refusing any form of help, my mother worried sick for her, until she became dangerously underweight.\n\nWe were all extremely scared for her. My mother and I would cry almost every day, desperately trying to support her and save her, worried sick for her life. But she would always dismiss us. She was so malnourished that doctors said she needed treatment ASAP because she was at risk of organ failure, but she refused, and we cannot force treatment on her because she is an adult. If she lost any more weight she probably would have died.\n\nAt this time, my sister also wanted to get a nose job, but my mother explained to her that no doctor would put her under general anesthesia and operate on her in her condition. She explained to her that she needs to recover if she wants to be able to do the things she wants and live the life she wants, like go to college.\n\nOne day, after months of my mother and I crying for her and pleading with her, it seemed like she finally had a breakthrough. She seemed determined to get better and started forcing herself to eat. We were all so happy. We constantly supported her throughout the way. We thought she was on the road to recovery.\n\nBut now she recently got the nose job that she wanted, and she is slipping back to her old habits. Not eating, lying, gaslighting us, attacking us when we try to support her. Over the past month she has lost a dangerous amount of weight, and it seems like all of the progress she made is rapidly being lost. She is quickly entering a dangerous state again, but she is again refusing help.\n\nShe won't see a therapist or accept any treatment. She says that she can handle this on her own and nobody can help her. We have tried to talk to her gently, support her, and show our concern, but she just attacks us every time. It's like we're all held hostage by this eating disorder, a never ending nightmare that we cannot escape.\n\nThe situation is taking a massive toll on my mother. She looks depressed, exhausted, and stressed all the time. I am so worried for her health. She has a history of heart problems and high blood pressure, and I fear that all of this stress will be the end of her. I can't bear the thought of losing both my sister and my mother.\n\nI feel so terrible for my mother. She lives for her children and the only thing that matters to her is for her children to be happy and healthy. This whole situation has been destroying her. I am depressed not only for my sister, but also my mother. My mother means the world to me, and it is devastating to watch my mother breakdown while my sister withers away no matter how much she tries to help her. It seems like this battle will never end and will eventually kill them both.\n\nWe all live in the same house, and I see my mother trying to gently support my sister only to get attacked. I hear my sister yelling at my mother for trying to help her and prevent her from dying. My sister has said such terrible things to my mother despite all she's done for her. Things like she's a shit mother, saying that she's never done anything for her, that she doesn't love her, that she doesn't care about her, when my mother literally devotes her life to her kids' happiness.\n\nMy sister even blamed my mother for her eating disorder, saying it's her fault that she didn't save her before it turned into this, when my mom has literally tried everything she could from the very beginning to help her. My sister has tremendous anger issues now and makes everyday hell with her terrible attitude, throwing things, slamming things, screaming at us for trying to help her, blowing up over everything, refusing to see a therapist.\n\nI recently got laid off and have been struggling to find a job in this economy, and my father is worried about losing his job. If something happens to my sister and she needs to be hospitalized or needs medical care, we would go broke. This is such a nightmare.\n\nI'm writing this post in the hope that someone out there can help us. If you have any advice or suggestions, please share them with me. I don't know what to do, and we are all at our breaking point. We just want our sister back, and we want our family to be happy and healthy again.\n\nThank you for taking the time to read this.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/11fk68q/i_need_desperate_advice_on_how_to_help_with_my/",
  "score": 44,
  "num_comments": 28,
  "comments": [
    {
      "id": "jak8sbr",
      "author": "savannahruns",
      "body": "Your parents could petition the courts to get legal guardianship of her if you’re in the US. Then they could admit her to treatment in the same way they could if she was a minor.",
      "created_utc": 1677718235.0,
      "score": 30,
      "context": []
    },
    {
      "id": "jal220t",
      "author": "MathyMama",
      "body": "OP I’m really sorry to read this. There is no sugar coating the deadly statistical reality of eating disorders. There are some resources out there for FBT but in situations this dire …it seems you need more professional help and that without it death is a very real possibility. Put aside financial concerns about costs of hospitalization for now. Find a way (by hook or by crook) to get her to the doctor (emergency room may be in order) now!  She is not gaslighting you all, she is in a severe malnourished state, she is not ok.",
      "created_utc": 1677731848.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jajuxc5",
      "author": "Excellent-World-476",
      "body": "Depending on where you live, it is possible she could be certified although it is difficult to do. However if she is unwilling to do anything m, there isn’t much you can do. You may need to put up boundaries and your parents may need to make ultimatums that unless she does therapy she needs to move out or that they won’t pay for any activities they pay for or that she needs to pay rent, etc.",
      "created_utc": 1677712223.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jakxfof",
      "author": "Abb2424",
      "body": "I’m so sorry your going through this. When I was 11 I had severe anorexia, I got kicked off my dance team temporarily due to being underweight and the dangers behind it and my parents tricked me into going to the hospital to get help. I was in there for 2 months. Trying to work my way around not eating. It’s a HUGE psychological thing. I remember looking at myself in the mirror and thinking I looked fat, but then I would see myself in pictures and see a skeleton. It was weird. I was anger, developed bad OCD, etc. I don’t know what advice to give I’m so sorry. Maybe instead of making her feel attacked try being more of a friend? (I know your probably not attacking her but I’m her mind it may come across that everyone’s out to get her?) that’s how I felt and refused to talk to anyone or take anyone’s advice. The things your sister is saying is a fully eating disorder patterns, anger, blame, etc. it’s not her it’s what’s she’s going though. Trust me. I would have full blown episodes being psychotic because I felt so out of control of myself. I was horrible to my family. Just do the best you can. Try to not take what she’s saying personally, try to seal out any medical help if u can, and try to be a shooter for your sister to lean on if u can’t force her because of her age. I definitely needed to be forced or I probably would have died. But with her age u may need to find a way to break through to her to want help",
      "created_utc": 1677729386.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jaoepky",
      "author": "None",
      "body": "This is going to sound harsh, but if you and your parents/mother really want to help your sister, you need to understand that it isn't about you.\nShe's not doing it to you. She's not doing it to spite or hurt you. Everything she's doing, she's doing it to herself.\n\nShe's dealing with a mental illness. It's not going to make sense, because it's a mental illness.\n\nYou can't force her to get better. Telling her the health risks won't change her behaviours, she's probably more aware of them than any of you.\nShe has to decide to get better for herself.\n\n\nWhat you can do as her family though, is support her. Focus on everything else about her. If she has any hobbies, talk about them. If she doesn't, invite her to join something with you.\nDon't focus on the food or exercise. Focus on finding things that might end up more important than her eating disorder. \n\nMeet her half way with the eating as well. If she's open to drinking protein shakes, it's better than nothing. If all she'll eat is her safe foods, at least she's having something.",
      "created_utc": 1677794442.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jaotosy",
      "author": "idkidkidontkn0w",
      "body": "My sister was a lot like this as well. She’s 15 now and still recovering. We had to get her hospitalized, I’m happy you guys know she has one early on. Im not a mental health expert but my sister was exactly like this and we realized she’s mentally ill. I know it sucks but you can’t force someone to stop, you can help them but they need to make a decision to stop themselves. If she was a child I would say just like force her to go to things but since she’s an adult idk If you could do that. I would talk to a professional for advice bc there probably going to know what to do. Sorry if my comment doesn’t help you. 😅",
      "created_utc": 1677800763.0,
      "score": 2,
      "context": []
    },
    {
      "id": "janvc48",
      "author": "SpammertCashman",
      "body": "I struggled with an even disorder for the better part of my adolescent years. I am now 32 and work as a social worker. My dad is a doctor. My mom is a nurse and they really did not know what to do to support me. I am the youngest of four children. They are older Looking back I always said that I wish you admitted me against my will when you could have before I was 18 I do live in Canada so may be different but I really feel for you and your family and I am sorry for some people on here, blaming your parents, I don’t think an eating disorder is anybody’s fault, and I wouldn’t wish it on my worst enemy. I have asked my mom to go to counselling with me and I still do to this day and she will not. I do believe that counselling for your parents and your family would be very beneficial and I feel it is likely very hurtful for your sister that your mom is not willing to go to counseling, this is not her problem. It should be about you and your whole family what we can do how we can support each other and you together how can we recover as a family don’t make it about her make it about everyone we are in this together family counseling, family therapy, but make sure it’s an eating disorder Competent counselor. I still struggle with intrusive thoughts, and I have hard days and hard weeks and hard months. I am married. I have a dog. I have a great career. I think this is some thing I will struggle with my whole life and maybe if there is prevention earlier I would be able to get rid of it completely. My family is very supportive but they are a medical background. They are also British mental health has never really been an open conversation. I know that your sister’s behaviours are not likeable and not loveable even right now, but don’t give up on her.",
      "created_utc": 1677787023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "janxhfk",
      "author": "warmcatbellyfuzz",
      "body": "Does she live with your mom? It’s gonna sound harsh but your mom should set a boundary that if she doesn’t enter treatment she’s kicking her out of the house and taking her off her health insurance. If she threatens to kill herself then call 911 for emergency evaluation. It will seem harsh and cruel but you’ve exhausted all other options. You have to tell her you will do anything to help her and nothing to enable the eating disorder. And as long as your not setting these consequences then you’re just creating co-dependency. \n\nSecondly and just as important, both you and your mom need to be in therapy. This is an equally as traumatic an experience for both of you and you both need support to be there for your sister. The therapist may have other ideas to compel your sister into treatment.",
      "created_utc": 1677787861.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jb7kcl7",
      "author": "logicalinsanity675",
      "body": "I am so sorry you’re all going through this. My best advice is, do all the research you can on how to get her into a treatment center. If that isn’t possible, or if that’s months away, there are things you can do in the meantime. Number one, I agree with other comments that you and your mom should be in therapy. Until your mom starts therapy, there’s no point in telling your sister to go. If you guys make it more of a family thing, she might feel less singled out. For example, go to family therapy as a group, or each have your own sessions (or both), anything to not make her feel like “you’re not normal and we are and you need to get your act together.” As someone who has had disordered eating on and off for 15 years, I can tell you that she does not want to talk about “deep” topics with her family. To this day there are certain things I tell my therapist that I will never tell my family. You and your mom starting therapy, and then gently suggesting she do the same, might be the best approach. She feels comfortable snapping at you guys because she knows your love is unconditional. (and because her brain isn’t functioning properly; that’s why she’s so quick to anger.) Maybe you can get a therapist on the phone and hand your sister the phone, and have the therapist ask her to come in for an appointment. She’s more likely to say yes to someone who is not you or your mom. When you’re so deep into the eating disorder, you don’t account for the fact that once you start eating again, your brain will function better, and you’ll be able to see logic more clearly. Your sister probably thinks of gaining weight as going back to the life she had before, a life that felt out of control. That’s why therapy is so crucial to help your sister figure out the factors that manifested in an eating disorder. \n\nBasically, try having a therapist talk to her on the phone, because that’s more likely to convince her to go to an appointment. And any therapists the 3 of you see should specialize in eating disorders. There are too many therapists out there who don’t know how to talk to people with eating disorders and end up triggering them, so be mindful of that too. Also, just a reminder, your sister loves you guys very much, and the way she’s acting now is not her real personality. When she’s recovered (manifesting that), she’ll look back and be horrified at the way she talked to you. Good luck with everything, and just know you’re not alone.",
      "created_utc": 1678150445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jbuwsf3",
      "author": "huhudbird",
      "body": "we’re going through the exact same thing with the exact same ages :( my sister has even hit my mother. no idea what to do. my family fell apart completely",
      "created_utc": 1678573484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jak9wzl",
      "author": "Extra-Conference8710",
      "body": "I told my mother this, and told her to get medical guardianship, but she is afraid that my sister will hurt herself if she is forced into a treatment facility. My sister vehemently opposes going to any inpatient or outpatient facility no matter how much my mother tries to convince her. My mom has literally said she would be with her every step of the way but she still refuses, and she has screamed at my mother for even suggesting that she would get guardianship over her to admit her to save her life.\n\nShe has said some very suggestive things like \"if you admit me, that'll be the end of me\" and seems very mentally unstable. I am literally at a loss.",
      "created_utc": 1677718733.0,
      "score": 12,
      "context": [
        {
          "id": "jak8sbr",
          "author": "savannahruns",
          "body": "Your parents could petition the courts to get legal guardianship of her if you’re in the US. Then they could admit her to treatment in the same way they could if she was a minor.",
          "created_utc": 1677718235.0
        }
      ]
    },
    {
      "id": "jal4p17",
      "author": "Extra-Conference8710",
      "body": "She seemed to have a breakthrough a few months ago and was forcing herself to eat and she was gaining a healthy amount of weight. But ever since she got her nose job a month ago she has been relapsing and is rapidly losing weight and restricting again. She is not currently at the point where she needs to be hospitalized or at a point where we could commit her out of medical necessity, but at this rate she will enter the danger zone again. \n\nMy mother is trying to save her from relapsing so she does not lose all of her progress and we don't have to take such drastic measures, but my sister says she has given up and is refusing help and is not eating. I really don't know what to do. It seems like she's just going to become dangerously underweight to the point where her life is at risk again and there is nothing we can do to stop it.",
      "created_utc": 1677733369.0,
      "score": 6,
      "context": [
        {
          "id": "jal220t",
          "author": "MathyMama",
          "body": "OP I’m really sorry to read this. There is no sugar coating the deadly statistical reality of eating disorders. There are some resources out there for FBT but in situations this dire …it seems you need more professional help and that without it death is a very real possibility. Put aside financial concerns about costs of hospitalization for now. Find a way (by hook or by crook) to get her to the doctor (emergency room may be in order) now!  She is not gaslighting you all, she is in a severe malnourished state, she is not ok.",
          "created_utc": 1677731848.0
        }
      ]
    },
    {
      "id": "jak0bej",
      "author": "Extra-Conference8710",
      "body": "I told my mother this before, but she said she won't kick her child out of the house. My sister seems very mentally unstable and explodes over everything, to the point where my mother needs to intervene and hold her and calm her down. Yet she vehemently refuses to go to therapy. I just feel so trapped, I feel like there is literally nothing I can do to prevent my sister and mother from destroying themselves. My sister clearly needs help, but she does not accept it, and she's dragging the rest of us down into a depressing hellhole.\n\n&#x200B;\n\nI told my mother she needs to stop crying every day. She needs to stop talking to my sister for hours every day trying to convince her desperately when she refuses help. There is literally nothing for her to do. My mom said she can't just ignore this because she made so much progress before this that is just slipping away. But I tell her it is up to my sister to save herself. We have done everything that we could, and yet my mother will still not stop trying to talk to her, only for my sister to yell at her and argue with her and attack her, leaving my mother crying and breaking down . It pains me to watch.\n\n&#x200B;\n\nI feel like the only thing we can do is to hold ourselves together and hope that my sister decides to recover. Until then, there is no point killing ourselves trying to help her. But my mom does not listen and I'm worried for her health.",
      "created_utc": 1677714509.0,
      "score": 11,
      "context": [
        {
          "id": "jajuxc5",
          "author": "Excellent-World-476",
          "body": "Depending on where you live, it is possible she could be certified although it is difficult to do. However if she is unwilling to do anything m, there isn’t much you can do. You may need to put up boundaries and your parents may need to make ultimatums that unless she does therapy she needs to move out or that they won’t pay for any activities they pay for or that she needs to pay rent, etc.",
          "created_utc": 1677712223.0
        }
      ]
    },
    {
      "id": "jakxu7d",
      "author": "Abb2424",
      "body": "Maybe get rid of treadmill, start making healthy yummy foods, and put less pressure on her ? Maybe she will come around on her own terms? Did something traumatic happen to her that she hasn’t worked though?",
      "created_utc": 1677729592.0,
      "score": 0,
      "context": [
        {
          "id": "jakxfof",
          "author": "Abb2424",
          "body": "I’m so sorry your going through this. When I was 11 I had severe anorexia, I got kicked off my dance team temporarily due to being underweight and the dangers behind it and my parents tricked me into going to the hospital to get help. I was in there for 2 months. Trying to work my way around not eating. It’s a HUGE psychological thing. I remember looking at myself in the mirror and thinking I looked fat, but then I would see myself in pictures and see a skeleton. It was weird. I was anger, developed bad OCD, etc. I don’t know what advice to give I’m so sorry. Maybe instead of making her feel attacked try being more of a friend? (I know your probably not attacking her but I’m her mind it may come across that everyone’s out to get her?) that’s how I felt and refused to talk to anyone or take anyone’s advice. The things your sister is saying is a fully eating disorder patterns, anger, blame, etc. it’s not her it’s what’s she’s going though. Trust me. I would have full blown episodes being psychotic because I felt so out of control of myself. I was horrible to my family. Just do the best you can. Try to not take what she’s saying personally, try to seal out any medical help if u can, and try to be a shooter for your sister to lean on if u can’t force her because of her age. I definitely needed to be forced or I probably would have died. But with her age u may need to find a way to break through to her to want help",
          "created_utc": 1677729386.0
        }
      ]
    },
    {
      "id": "jakht8w",
      "author": "breakcharacter",
      "body": "If she is put into inpatient she will not be left unsupervised to have the opportunity to kill herself. They have anti-hanging pegs, showers, and door handles, rounded corners to prevent self harm via hitting table corners, anti-suffocation sheets and more. She will be safe.",
      "created_utc": 1677722208.0,
      "score": 21,
      "context": [
        {
          "id": "jak8sbr",
          "author": "savannahruns",
          "body": "Your parents could petition the courts to get legal guardianship of her if you’re in the US. Then they could admit her to treatment in the same way they could if she was a minor.",
          "created_utc": 1677718235.0
        },
        {
          "id": "jak9wzl",
          "author": "Extra-Conference8710",
          "body": "I told my mother this, and told her to get medical guardianship, but she is afraid that my sister will hurt herself if she is forced into a treatment facility. My sister vehemently opposes going to any inpatient or outpatient facility no matter how much my mother tries to convince her. My mom has literally said she would be with her every step of the way but she still refuses, and she has screamed at my mother for even suggesting that she would get guardianship over her to admit her to save her life.\n\nShe has said some very suggestive things like \"if you admit me, that'll be the end of me\" and seems very mentally unstable. I am literally at a loss.",
          "created_utc": 1677718733.0
        }
      ]
    },
    {
      "id": "jal4wd2",
      "author": "Extra-Conference8710",
      "body": "Also want to note that my sister paid for her nose job with her own savings. My mom said it's important for her to fully recover first but she did not listen, saying that she's an adult and she'll do what she wants. It seems like she only gained the weight so that she could have her nose job done and is still deep in the disorder.",
      "created_utc": 1677733491.0,
      "score": 7,
      "context": [
        {
          "id": "jal220t",
          "author": "MathyMama",
          "body": "OP I’m really sorry to read this. There is no sugar coating the deadly statistical reality of eating disorders. There are some resources out there for FBT but in situations this dire …it seems you need more professional help and that without it death is a very real possibility. Put aside financial concerns about costs of hospitalization for now. Find a way (by hook or by crook) to get her to the doctor (emergency room may be in order) now!  She is not gaslighting you all, she is in a severe malnourished state, she is not ok.",
          "created_utc": 1677731848.0
        },
        {
          "id": "jal4p17",
          "author": "Extra-Conference8710",
          "body": "She seemed to have a breakthrough a few months ago and was forcing herself to eat and she was gaining a healthy amount of weight. But ever since she got her nose job a month ago she has been relapsing and is rapidly losing weight and restricting again. She is not currently at the point where she needs to be hospitalized or at a point where we could commit her out of medical necessity, but at this rate she will enter the danger zone again. \n\nMy mother is trying to save her from relapsing so she does not lose all of her progress and we don't have to take such drastic measures, but my sister says she has given up and is refusing help and is not eating. I really don't know what to do. It seems like she's just going to become dangerously underweight to the point where her life is at risk again and there is nothing we can do to stop it.",
          "created_utc": 1677733369.0
        }
      ]
    },
    {
      "id": "jak0h9x",
      "author": "Excellent-World-476",
      "body": "I’m so sorry. Have you suggested to your mother that she go to therapy?  It might be helpful for her.",
      "created_utc": 1677714580.0,
      "score": 6,
      "context": [
        {
          "id": "jajuxc5",
          "author": "Excellent-World-476",
          "body": "Depending on where you live, it is possible she could be certified although it is difficult to do. However if she is unwilling to do anything m, there isn’t much you can do. You may need to put up boundaries and your parents may need to make ultimatums that unless she does therapy she needs to move out or that they won’t pay for any activities they pay for or that she needs to pay rent, etc.",
          "created_utc": 1677712223.0
        },
        {
          "id": "jak0bej",
          "author": "Extra-Conference8710",
          "body": "I told my mother this before, but she said she won't kick her child out of the house. My sister seems very mentally unstable and explodes over everything, to the point where my mother needs to intervene and hold her and calm her down. Yet she vehemently refuses to go to therapy. I just feel so trapped, I feel like there is literally nothing I can do to prevent my sister and mother from destroying themselves. My sister clearly needs help, but she does not accept it, and she's dragging the rest of us down into a depressing hellhole.\n\n&#x200B;\n\nI told my mother she needs to stop crying every day. She needs to stop talking to my sister for hours every day trying to convince her desperately when she refuses help. There is literally nothing for her to do. My mom said she can't just ignore this because she made so much progress before this that is just slipping away. But I tell her it is up to my sister to save herself. We have done everything that we could, and yet my mother will still not stop trying to talk to her, only for my sister to yell at her and argue with her and attack her, leaving my mother crying and breaking down . It pains me to watch.\n\n&#x200B;\n\nI feel like the only thing we can do is to hold ourselves together and hope that my sister decides to recover. Until then, there is no point killing ourselves trying to help her. But my mom does not listen and I'm worried for her health.",
          "created_utc": 1677714509.0
        }
      ]
    },
    {
      "id": "jal0gbq",
      "author": "Extra-Conference8710",
      "body": "Thank you for sharing your experience. I am sorry to hear that you went through this, but I am happy that you are doing better.\n\nI really do not know what happened to her. It seems like it just started out of nowhere. I am really shocked how she could could just so quickly spiral out of control like this. Nothing traumatic happened, but this did begin over covid so I don't know if that has anything to do with it.\n\nShe did come around temporarily a few months ago, but after getting her nose job she has relapsed and is rapidly losing weight again. We're worried that at this rate she will become dangerously underweight again, and if she needs to be admitted to a facility to save her life but my dad is unemployed without insurance, I don't know how we will afford it.",
      "created_utc": 1677730960.0,
      "score": 3,
      "context": [
        {
          "id": "jakxfof",
          "author": "Abb2424",
          "body": "I’m so sorry your going through this. When I was 11 I had severe anorexia, I got kicked off my dance team temporarily due to being underweight and the dangers behind it and my parents tricked me into going to the hospital to get help. I was in there for 2 months. Trying to work my way around not eating. It’s a HUGE psychological thing. I remember looking at myself in the mirror and thinking I looked fat, but then I would see myself in pictures and see a skeleton. It was weird. I was anger, developed bad OCD, etc. I don’t know what advice to give I’m so sorry. Maybe instead of making her feel attacked try being more of a friend? (I know your probably not attacking her but I’m her mind it may come across that everyone’s out to get her?) that’s how I felt and refused to talk to anyone or take anyone’s advice. The things your sister is saying is a fully eating disorder patterns, anger, blame, etc. it’s not her it’s what’s she’s going though. Trust me. I would have full blown episodes being psychotic because I felt so out of control of myself. I was horrible to my family. Just do the best you can. Try to not take what she’s saying personally, try to seal out any medical help if u can, and try to be a shooter for your sister to lean on if u can’t force her because of her age. I definitely needed to be forced or I probably would have died. But with her age u may need to find a way to break through to her to want help",
          "created_utc": 1677729386.0
        },
        {
          "id": "jakxu7d",
          "author": "Abb2424",
          "body": "Maybe get rid of treadmill, start making healthy yummy foods, and put less pressure on her ? Maybe she will come around on her own terms? Did something traumatic happen to her that she hasn’t worked though?",
          "created_utc": 1677729592.0
        }
      ]
    },
    {
      "id": "jakoq8y",
      "author": "euphoricbun",
      "body": "This is the only and correct option. You need to advocate for her the same as you would a dying child. You do not let them tell you not to take them to the doctor. You take them to the fucking doctor, or they die.  \n\n\nDo what needs to be done and let her hate you when she's alive to do it properly.",
      "created_utc": 1677725272.0,
      "score": 8,
      "context": [
        {
          "id": "jak8sbr",
          "author": "savannahruns",
          "body": "Your parents could petition the courts to get legal guardianship of her if you’re in the US. Then they could admit her to treatment in the same way they could if she was a minor.",
          "created_utc": 1677718235.0
        },
        {
          "id": "jak9wzl",
          "author": "Extra-Conference8710",
          "body": "I told my mother this, and told her to get medical guardianship, but she is afraid that my sister will hurt herself if she is forced into a treatment facility. My sister vehemently opposes going to any inpatient or outpatient facility no matter how much my mother tries to convince her. My mom has literally said she would be with her every step of the way but she still refuses, and she has screamed at my mother for even suggesting that she would get guardianship over her to admit her to save her life.\n\nShe has said some very suggestive things like \"if you admit me, that'll be the end of me\" and seems very mentally unstable. I am literally at a loss.",
          "created_utc": 1677718733.0
        },
        {
          "id": "jakht8w",
          "author": "breakcharacter",
          "body": "If she is put into inpatient she will not be left unsupervised to have the opportunity to kill herself. They have anti-hanging pegs, showers, and door handles, rounded corners to prevent self harm via hitting table corners, anti-suffocation sheets and more. She will be safe.",
          "created_utc": 1677722208.0
        }
      ]
    },
    {
      "id": "jan1jxo",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1677774963.0,
      "score": 3,
      "context": [
        {
          "id": "jal220t",
          "author": "MathyMama",
          "body": "OP I’m really sorry to read this. There is no sugar coating the deadly statistical reality of eating disorders. There are some resources out there for FBT but in situations this dire …it seems you need more professional help and that without it death is a very real possibility. Put aside financial concerns about costs of hospitalization for now. Find a way (by hook or by crook) to get her to the doctor (emergency room may be in order) now!  She is not gaslighting you all, she is in a severe malnourished state, she is not ok.",
          "created_utc": 1677731848.0
        },
        {
          "id": "jal4p17",
          "author": "Extra-Conference8710",
          "body": "She seemed to have a breakthrough a few months ago and was forcing herself to eat and she was gaining a healthy amount of weight. But ever since she got her nose job a month ago she has been relapsing and is rapidly losing weight and restricting again. She is not currently at the point where she needs to be hospitalized or at a point where we could commit her out of medical necessity, but at this rate she will enter the danger zone again. \n\nMy mother is trying to save her from relapsing so she does not lose all of her progress and we don't have to take such drastic measures, but my sister says she has given up and is refusing help and is not eating. I really don't know what to do. It seems like she's just going to become dangerously underweight to the point where her life is at risk again and there is nothing we can do to stop it.",
          "created_utc": 1677733369.0
        },
        {
          "id": "jal4wd2",
          "author": "Extra-Conference8710",
          "body": "Also want to note that my sister paid for her nose job with her own savings. My mom said it's important for her to fully recover first but she did not listen, saying that she's an adult and she'll do what she wants. It seems like she only gained the weight so that she could have her nose job done and is still deep in the disorder.",
          "created_utc": 1677733491.0
        }
      ]
    },
    {
      "id": "jak121d",
      "author": "Extra-Conference8710",
      "body": "I did suggest therapy to my mother, so that it could help my mother deal with the situation better. But she said \"what is therapy going to do for me, me going to therapy is not going to help her\". But this environment is clearly not sustainable. Even if the therapist can't help my sister, they could help my mother cope with the situation better which would still be helpful, but for some reason my mother still doesn't go.",
      "created_utc": 1677714834.0,
      "score": 8,
      "context": [
        {
          "id": "jajuxc5",
          "author": "Excellent-World-476",
          "body": "Depending on where you live, it is possible she could be certified although it is difficult to do. However if she is unwilling to do anything m, there isn’t much you can do. You may need to put up boundaries and your parents may need to make ultimatums that unless she does therapy she needs to move out or that they won’t pay for any activities they pay for or that she needs to pay rent, etc.",
          "created_utc": 1677712223.0
        },
        {
          "id": "jak0bej",
          "author": "Extra-Conference8710",
          "body": "I told my mother this before, but she said she won't kick her child out of the house. My sister seems very mentally unstable and explodes over everything, to the point where my mother needs to intervene and hold her and calm her down. Yet she vehemently refuses to go to therapy. I just feel so trapped, I feel like there is literally nothing I can do to prevent my sister and mother from destroying themselves. My sister clearly needs help, but she does not accept it, and she's dragging the rest of us down into a depressing hellhole.\n\n&#x200B;\n\nI told my mother she needs to stop crying every day. She needs to stop talking to my sister for hours every day trying to convince her desperately when she refuses help. There is literally nothing for her to do. My mom said she can't just ignore this because she made so much progress before this that is just slipping away. But I tell her it is up to my sister to save herself. We have done everything that we could, and yet my mother will still not stop trying to talk to her, only for my sister to yell at her and argue with her and attack her, leaving my mother crying and breaking down . It pains me to watch.\n\n&#x200B;\n\nI feel like the only thing we can do is to hold ourselves together and hope that my sister decides to recover. Until then, there is no point killing ourselves trying to help her. But my mom does not listen and I'm worried for her health.",
          "created_utc": 1677714509.0
        },
        {
          "id": "jak0h9x",
          "author": "Excellent-World-476",
          "body": "I’m so sorry. Have you suggested to your mother that she go to therapy?  It might be helpful for her.",
          "created_utc": 1677714580.0
        }
      ]
    },
    {
      "id": "jalzqwt",
      "author": "TempiChange",
      "body": "if you're in the US, Medicaid can cover ED treatment. \n\nalso keep in mind that it may look like it started out of nowhere, but that doesn't necessarily mean it did. I had some disordered eating habits growing up but nothing that concerned anyone, and my ED popped up quite suddenly at university when I started working through some childhood trauma that I hadn't dealt with. small things can trigger dormant problems from a long time ago. mine also started with exercise and then I started eating healthier and then the desperate need for control while I was dealing with my emotional issues just took over my life and it all blew up into an ED. nothing from the outside would have looked like a trigger.",
      "created_utc": 1677756953.0,
      "score": 2,
      "context": [
        {
          "id": "jakxfof",
          "author": "Abb2424",
          "body": "I’m so sorry your going through this. When I was 11 I had severe anorexia, I got kicked off my dance team temporarily due to being underweight and the dangers behind it and my parents tricked me into going to the hospital to get help. I was in there for 2 months. Trying to work my way around not eating. It’s a HUGE psychological thing. I remember looking at myself in the mirror and thinking I looked fat, but then I would see myself in pictures and see a skeleton. It was weird. I was anger, developed bad OCD, etc. I don’t know what advice to give I’m so sorry. Maybe instead of making her feel attacked try being more of a friend? (I know your probably not attacking her but I’m her mind it may come across that everyone’s out to get her?) that’s how I felt and refused to talk to anyone or take anyone’s advice. The things your sister is saying is a fully eating disorder patterns, anger, blame, etc. it’s not her it’s what’s she’s going though. Trust me. I would have full blown episodes being psychotic because I felt so out of control of myself. I was horrible to my family. Just do the best you can. Try to not take what she’s saying personally, try to seal out any medical help if u can, and try to be a shooter for your sister to lean on if u can’t force her because of her age. I definitely needed to be forced or I probably would have died. But with her age u may need to find a way to break through to her to want help",
          "created_utc": 1677729386.0
        },
        {
          "id": "jakxu7d",
          "author": "Abb2424",
          "body": "Maybe get rid of treadmill, start making healthy yummy foods, and put less pressure on her ? Maybe she will come around on her own terms? Did something traumatic happen to her that she hasn’t worked though?",
          "created_utc": 1677729592.0
        },
        {
          "id": "jal0gbq",
          "author": "Extra-Conference8710",
          "body": "Thank you for sharing your experience. I am sorry to hear that you went through this, but I am happy that you are doing better.\n\nI really do not know what happened to her. It seems like it just started out of nowhere. I am really shocked how she could could just so quickly spiral out of control like this. Nothing traumatic happened, but this did begin over covid so I don't know if that has anything to do with it.\n\nShe did come around temporarily a few months ago, but after getting her nose job she has relapsed and is rapidly losing weight again. We're worried that at this rate she will become dangerously underweight again, and if she needs to be admitted to a facility to save her life but my dad is unemployed without insurance, I don't know how we will afford it.",
          "created_utc": 1677730960.0
        }
      ]
    },
    {
      "id": "jamyw6c",
      "author": "savannahruns",
      "body": "Yeah this insurance thing is going to be a huge issue too. Is she in college?  Most colleges require you to either have health insurance already or get their student health insurance.",
      "created_utc": 1677773926.0,
      "score": 1,
      "context": [
        {
          "id": "jakxfof",
          "author": "Abb2424",
          "body": "I’m so sorry your going through this. When I was 11 I had severe anorexia, I got kicked off my dance team temporarily due to being underweight and the dangers behind it and my parents tricked me into going to the hospital to get help. I was in there for 2 months. Trying to work my way around not eating. It’s a HUGE psychological thing. I remember looking at myself in the mirror and thinking I looked fat, but then I would see myself in pictures and see a skeleton. It was weird. I was anger, developed bad OCD, etc. I don’t know what advice to give I’m so sorry. Maybe instead of making her feel attacked try being more of a friend? (I know your probably not attacking her but I’m her mind it may come across that everyone’s out to get her?) that’s how I felt and refused to talk to anyone or take anyone’s advice. The things your sister is saying is a fully eating disorder patterns, anger, blame, etc. it’s not her it’s what’s she’s going though. Trust me. I would have full blown episodes being psychotic because I felt so out of control of myself. I was horrible to my family. Just do the best you can. Try to not take what she’s saying personally, try to seal out any medical help if u can, and try to be a shooter for your sister to lean on if u can’t force her because of her age. I definitely needed to be forced or I probably would have died. But with her age u may need to find a way to break through to her to want help",
          "created_utc": 1677729386.0
        },
        {
          "id": "jakxu7d",
          "author": "Abb2424",
          "body": "Maybe get rid of treadmill, start making healthy yummy foods, and put less pressure on her ? Maybe she will come around on her own terms? Did something traumatic happen to her that she hasn’t worked though?",
          "created_utc": 1677729592.0
        },
        {
          "id": "jal0gbq",
          "author": "Extra-Conference8710",
          "body": "Thank you for sharing your experience. I am sorry to hear that you went through this, but I am happy that you are doing better.\n\nI really do not know what happened to her. It seems like it just started out of nowhere. I am really shocked how she could could just so quickly spiral out of control like this. Nothing traumatic happened, but this did begin over covid so I don't know if that has anything to do with it.\n\nShe did come around temporarily a few months ago, but after getting her nose job she has relapsed and is rapidly losing weight again. We're worried that at this rate she will become dangerously underweight again, and if she needs to be admitted to a facility to save her life but my dad is unemployed without insurance, I don't know how we will afford it.",
          "created_utc": 1677730960.0
        }
      ]
    },
    {
      "id": "jakwj1m",
      "author": "Extra-Conference8710",
      "body": "Unfortunately, we don't know how much she weighs and she needs to be under a certain weight threshold in order for us to be able to commit her against her will. She refuses to tell us her weight or weigh herself in front of us. I don't think she is at a dangerous threshold yet but at this rate it seems like she is rapidly approaching that point again. \n\nMy mother wants to help her from relapsing and prevent her from slipping away into that dangerous weight range again so we don't have to consider these measures, but my sister is refusing help from my mother and she is still heavily restricting.",
      "created_utc": 1677728932.0,
      "score": 6,
      "context": [
        {
          "id": "jak8sbr",
          "author": "savannahruns",
          "body": "Your parents could petition the courts to get legal guardianship of her if you’re in the US. Then they could admit her to treatment in the same way they could if she was a minor.",
          "created_utc": 1677718235.0
        },
        {
          "id": "jak9wzl",
          "author": "Extra-Conference8710",
          "body": "I told my mother this, and told her to get medical guardianship, but she is afraid that my sister will hurt herself if she is forced into a treatment facility. My sister vehemently opposes going to any inpatient or outpatient facility no matter how much my mother tries to convince her. My mom has literally said she would be with her every step of the way but she still refuses, and she has screamed at my mother for even suggesting that she would get guardianship over her to admit her to save her life.\n\nShe has said some very suggestive things like \"if you admit me, that'll be the end of me\" and seems very mentally unstable. I am literally at a loss.",
          "created_utc": 1677718733.0
        },
        {
          "id": "jakht8w",
          "author": "breakcharacter",
          "body": "If she is put into inpatient she will not be left unsupervised to have the opportunity to kill herself. They have anti-hanging pegs, showers, and door handles, rounded corners to prevent self harm via hitting table corners, anti-suffocation sheets and more. She will be safe.",
          "created_utc": 1677722208.0
        },
        {
          "id": "jakoq8y",
          "author": "euphoricbun",
          "body": "This is the only and correct option. You need to advocate for her the same as you would a dying child. You do not let them tell you not to take them to the doctor. You take them to the fucking doctor, or they die.  \n\n\nDo what needs to be done and let her hate you when she's alive to do it properly.",
          "created_utc": 1677725272.0
        }
      ]
    },
    {
      "id": "jao8qps",
      "author": "MathyMama",
      "body": "I came to say exactly this!!! The OP should not be deciding severity based on how malnourished her sister looks, there are ways that her heart and brain could be impacted that only a doctor can evaluate. Given she is starving herself, this is already a crisis (not just a potential for crisis).",
      "created_utc": 1677792145.0,
      "score": 2,
      "context": [
        {
          "id": "jal220t",
          "author": "MathyMama",
          "body": "OP I’m really sorry to read this. There is no sugar coating the deadly statistical reality of eating disorders. There are some resources out there for FBT but in situations this dire …it seems you need more professional help and that without it death is a very real possibility. Put aside financial concerns about costs of hospitalization for now. Find a way (by hook or by crook) to get her to the doctor (emergency room may be in order) now!  She is not gaslighting you all, she is in a severe malnourished state, she is not ok.",
          "created_utc": 1677731848.0
        },
        {
          "id": "jal4p17",
          "author": "Extra-Conference8710",
          "body": "She seemed to have a breakthrough a few months ago and was forcing herself to eat and she was gaining a healthy amount of weight. But ever since she got her nose job a month ago she has been relapsing and is rapidly losing weight and restricting again. She is not currently at the point where she needs to be hospitalized or at a point where we could commit her out of medical necessity, but at this rate she will enter the danger zone again. \n\nMy mother is trying to save her from relapsing so she does not lose all of her progress and we don't have to take such drastic measures, but my sister says she has given up and is refusing help and is not eating. I really don't know what to do. It seems like she's just going to become dangerously underweight to the point where her life is at risk again and there is nothing we can do to stop it.",
          "created_utc": 1677733369.0
        },
        {
          "id": "jal4wd2",
          "author": "Extra-Conference8710",
          "body": "Also want to note that my sister paid for her nose job with her own savings. My mom said it's important for her to fully recover first but she did not listen, saying that she's an adult and she'll do what she wants. It seems like she only gained the weight so that she could have her nose job done and is still deep in the disorder.",
          "created_utc": 1677733491.0
        },
        {
          "id": "jan1jxo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1677774963.0
        }
      ]
    },
    {
      "id": "jak1ofh",
      "author": "Excellent-World-476",
      "body": "Agreed. It’s a bit of a double standard to expect your sister to see a therapist if she won’t also see one. Eating disorders affect the entire family. I’m sorry your mother is unable to recognize that her relationship with your sister is in some ways enabling.",
      "created_utc": 1677715104.0,
      "score": 6,
      "context": [
        {
          "id": "jajuxc5",
          "author": "Excellent-World-476",
          "body": "Depending on where you live, it is possible she could be certified although it is difficult to do. However if she is unwilling to do anything m, there isn’t much you can do. You may need to put up boundaries and your parents may need to make ultimatums that unless she does therapy she needs to move out or that they won’t pay for any activities they pay for or that she needs to pay rent, etc.",
          "created_utc": 1677712223.0
        },
        {
          "id": "jak0bej",
          "author": "Extra-Conference8710",
          "body": "I told my mother this before, but she said she won't kick her child out of the house. My sister seems very mentally unstable and explodes over everything, to the point where my mother needs to intervene and hold her and calm her down. Yet she vehemently refuses to go to therapy. I just feel so trapped, I feel like there is literally nothing I can do to prevent my sister and mother from destroying themselves. My sister clearly needs help, but she does not accept it, and she's dragging the rest of us down into a depressing hellhole.\n\n&#x200B;\n\nI told my mother she needs to stop crying every day. She needs to stop talking to my sister for hours every day trying to convince her desperately when she refuses help. There is literally nothing for her to do. My mom said she can't just ignore this because she made so much progress before this that is just slipping away. But I tell her it is up to my sister to save herself. We have done everything that we could, and yet my mother will still not stop trying to talk to her, only for my sister to yell at her and argue with her and attack her, leaving my mother crying and breaking down . It pains me to watch.\n\n&#x200B;\n\nI feel like the only thing we can do is to hold ourselves together and hope that my sister decides to recover. Until then, there is no point killing ourselves trying to help her. But my mom does not listen and I'm worried for her health.",
          "created_utc": 1677714509.0
        },
        {
          "id": "jak0h9x",
          "author": "Excellent-World-476",
          "body": "I’m so sorry. Have you suggested to your mother that she go to therapy?  It might be helpful for her.",
          "created_utc": 1677714580.0
        },
        {
          "id": "jak121d",
          "author": "Extra-Conference8710",
          "body": "I did suggest therapy to my mother, so that it could help my mother deal with the situation better. But she said \"what is therapy going to do for me, me going to therapy is not going to help her\". But this environment is clearly not sustainable. Even if the therapist can't help my sister, they could help my mother cope with the situation better which would still be helpful, but for some reason my mother still doesn't go.",
          "created_utc": 1677714834.0
        }
      ]
    },
    {
      "id": "jamyg9s",
      "author": "savannahruns",
      "body": "committing her against her will is different than getting guardianship. honestly if your parents aren't going to take responsibility for seeking out guardianship and it's as bad as you're saying it is, that's on them.  I couldn't have close relationships with people like that, and would need to start distancing myself because it would make me sick.",
      "created_utc": 1677773752.0,
      "score": 1,
      "context": [
        {
          "id": "jak8sbr",
          "author": "savannahruns",
          "body": "Your parents could petition the courts to get legal guardianship of her if you’re in the US. Then they could admit her to treatment in the same way they could if she was a minor.",
          "created_utc": 1677718235.0
        },
        {
          "id": "jak9wzl",
          "author": "Extra-Conference8710",
          "body": "I told my mother this, and told her to get medical guardianship, but she is afraid that my sister will hurt herself if she is forced into a treatment facility. My sister vehemently opposes going to any inpatient or outpatient facility no matter how much my mother tries to convince her. My mom has literally said she would be with her every step of the way but she still refuses, and she has screamed at my mother for even suggesting that she would get guardianship over her to admit her to save her life.\n\nShe has said some very suggestive things like \"if you admit me, that'll be the end of me\" and seems very mentally unstable. I am literally at a loss.",
          "created_utc": 1677718733.0
        },
        {
          "id": "jakht8w",
          "author": "breakcharacter",
          "body": "If she is put into inpatient she will not be left unsupervised to have the opportunity to kill herself. They have anti-hanging pegs, showers, and door handles, rounded corners to prevent self harm via hitting table corners, anti-suffocation sheets and more. She will be safe.",
          "created_utc": 1677722208.0
        },
        {
          "id": "jakoq8y",
          "author": "euphoricbun",
          "body": "This is the only and correct option. You need to advocate for her the same as you would a dying child. You do not let them tell you not to take them to the doctor. You take them to the fucking doctor, or they die.  \n\n\nDo what needs to be done and let her hate you when she's alive to do it properly.",
          "created_utc": 1677725272.0
        },
        {
          "id": "jakwj1m",
          "author": "Extra-Conference8710",
          "body": "Unfortunately, we don't know how much she weighs and she needs to be under a certain weight threshold in order for us to be able to commit her against her will. She refuses to tell us her weight or weigh herself in front of us. I don't think she is at a dangerous threshold yet but at this rate it seems like she is rapidly approaching that point again. \n\nMy mother wants to help her from relapsing and prevent her from slipping away into that dangerous weight range again so we don't have to consider these measures, but my sister is refusing help from my mother and she is still heavily restricting.",
          "created_utc": 1677728932.0
        }
      ]
    },
    {
      "id": "jak47xu",
      "author": "Extra-Conference8710",
      "body": "I agree, I will try my best to get my mother to go to therapy.",
      "created_utc": 1677716219.0,
      "score": 4,
      "context": [
        {
          "id": "jajuxc5",
          "author": "Excellent-World-476",
          "body": "Depending on where you live, it is possible she could be certified although it is difficult to do. However if she is unwilling to do anything m, there isn’t much you can do. You may need to put up boundaries and your parents may need to make ultimatums that unless she does therapy she needs to move out or that they won’t pay for any activities they pay for or that she needs to pay rent, etc.",
          "created_utc": 1677712223.0
        },
        {
          "id": "jak0bej",
          "author": "Extra-Conference8710",
          "body": "I told my mother this before, but she said she won't kick her child out of the house. My sister seems very mentally unstable and explodes over everything, to the point where my mother needs to intervene and hold her and calm her down. Yet she vehemently refuses to go to therapy. I just feel so trapped, I feel like there is literally nothing I can do to prevent my sister and mother from destroying themselves. My sister clearly needs help, but she does not accept it, and she's dragging the rest of us down into a depressing hellhole.\n\n&#x200B;\n\nI told my mother she needs to stop crying every day. She needs to stop talking to my sister for hours every day trying to convince her desperately when she refuses help. There is literally nothing for her to do. My mom said she can't just ignore this because she made so much progress before this that is just slipping away. But I tell her it is up to my sister to save herself. We have done everything that we could, and yet my mother will still not stop trying to talk to her, only for my sister to yell at her and argue with her and attack her, leaving my mother crying and breaking down . It pains me to watch.\n\n&#x200B;\n\nI feel like the only thing we can do is to hold ourselves together and hope that my sister decides to recover. Until then, there is no point killing ourselves trying to help her. But my mom does not listen and I'm worried for her health.",
          "created_utc": 1677714509.0
        },
        {
          "id": "jak0h9x",
          "author": "Excellent-World-476",
          "body": "I’m so sorry. Have you suggested to your mother that she go to therapy?  It might be helpful for her.",
          "created_utc": 1677714580.0
        },
        {
          "id": "jak121d",
          "author": "Extra-Conference8710",
          "body": "I did suggest therapy to my mother, so that it could help my mother deal with the situation better. But she said \"what is therapy going to do for me, me going to therapy is not going to help her\". But this environment is clearly not sustainable. Even if the therapist can't help my sister, they could help my mother cope with the situation better which would still be helpful, but for some reason my mother still doesn't go.",
          "created_utc": 1677714834.0
        },
        {
          "id": "jak1ofh",
          "author": "Excellent-World-476",
          "body": "Agreed. It’s a bit of a double standard to expect your sister to see a therapist if she won’t also see one. Eating disorders affect the entire family. I’m sorry your mother is unable to recognize that her relationship with your sister is in some ways enabling.",
          "created_utc": 1677715104.0
        }
      ]
    },
    {
      "id": "jaletd5",
      "author": "justthrivinghunny",
      "body": "Try to see if your sister/mother are open to family therapy. It’s a disease that affects everyone involved. In my personal experience, family therapy was a necessary part for my treatment",
      "created_utc": 1677740038.0,
      "score": 2,
      "context": [
        {
          "id": "jajuxc5",
          "author": "Excellent-World-476",
          "body": "Depending on where you live, it is possible she could be certified although it is difficult to do. However if she is unwilling to do anything m, there isn’t much you can do. You may need to put up boundaries and your parents may need to make ultimatums that unless she does therapy she needs to move out or that they won’t pay for any activities they pay for or that she needs to pay rent, etc.",
          "created_utc": 1677712223.0
        },
        {
          "id": "jak0bej",
          "author": "Extra-Conference8710",
          "body": "I told my mother this before, but she said she won't kick her child out of the house. My sister seems very mentally unstable and explodes over everything, to the point where my mother needs to intervene and hold her and calm her down. Yet she vehemently refuses to go to therapy. I just feel so trapped, I feel like there is literally nothing I can do to prevent my sister and mother from destroying themselves. My sister clearly needs help, but she does not accept it, and she's dragging the rest of us down into a depressing hellhole.\n\n&#x200B;\n\nI told my mother she needs to stop crying every day. She needs to stop talking to my sister for hours every day trying to convince her desperately when she refuses help. There is literally nothing for her to do. My mom said she can't just ignore this because she made so much progress before this that is just slipping away. But I tell her it is up to my sister to save herself. We have done everything that we could, and yet my mother will still not stop trying to talk to her, only for my sister to yell at her and argue with her and attack her, leaving my mother crying and breaking down . It pains me to watch.\n\n&#x200B;\n\nI feel like the only thing we can do is to hold ourselves together and hope that my sister decides to recover. Until then, there is no point killing ourselves trying to help her. But my mom does not listen and I'm worried for her health.",
          "created_utc": 1677714509.0
        },
        {
          "id": "jak0h9x",
          "author": "Excellent-World-476",
          "body": "I’m so sorry. Have you suggested to your mother that she go to therapy?  It might be helpful for her.",
          "created_utc": 1677714580.0
        },
        {
          "id": "jak121d",
          "author": "Extra-Conference8710",
          "body": "I did suggest therapy to my mother, so that it could help my mother deal with the situation better. But she said \"what is therapy going to do for me, me going to therapy is not going to help her\". But this environment is clearly not sustainable. Even if the therapist can't help my sister, they could help my mother cope with the situation better which would still be helpful, but for some reason my mother still doesn't go.",
          "created_utc": 1677714834.0
        },
        {
          "id": "jak1ofh",
          "author": "Excellent-World-476",
          "body": "Agreed. It’s a bit of a double standard to expect your sister to see a therapist if she won’t also see one. Eating disorders affect the entire family. I’m sorry your mother is unable to recognize that her relationship with your sister is in some ways enabling.",
          "created_utc": 1677715104.0
        },
        {
          "id": "jak47xu",
          "author": "Extra-Conference8710",
          "body": "I agree, I will try my best to get my mother to go to therapy.",
          "created_utc": 1677716219.0
        }
      ]
    }
  ]
}