{
  "id": "11hc4av",
  "subreddit": "EatingDisorders",
  "author": "petralaxy",
  "created_utc": 1677871179.0,
  "title": "Is talking about healthy eating a trigger for you?",
  "selftext": "I have a coworker who is obsessed with healthy eating and likes to proselytize me and my coworkers about the benefits of going wholistic and organic. I've been struggling with eating disorders since I was 11 years old (I'm 24 now) and have gone through phases of hyper-vigilance when it came to the ingredients I put into my body, which is often a slippery slope into restricting/purging.  I've found that when she goes on one of her tangents I sometimes walk away feeling anxious and ashamed and want to throw away all of my food and stop eating. She doesn't advocate for that at all, she just talks about how we all need to eat better as a society, but I still get triggered into more unhealthy thought patterns regardless. I also know it's a good thing to think about the quality of your food, so I feel conflicted about these conversations. How triggering is the topic of healthy eating for you/is it triggering at all?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/11hc4av/is_talking_about_healthy_eating_a_trigger_for_you/",
  "score": 59,
  "num_comments": 24,
  "comments": [
    {
      "id": "jasjxym",
      "author": "Proper_Dragonfruit30",
      "body": "YES! healthy eating talk was a huuuge trigger for me in my early 20s (30 now - been struggling with ED since I was 11 like you) and i could never understand why. i think part of me was \"jealous\" that other people were able to easily control their eating so much that they were able to just eat foods that were healthy and beneficial for them and didn't have to worry about wanting to binge on junk. shame definitely played into that as well; it was a complicated feeling. not saying this is what you're experiencing exactly, but i know what you mean.",
      "created_utc": 1677871555.0,
      "score": 28,
      "context": []
    },
    {
      "id": "jasu55j",
      "author": "Excellent-World-476",
      "body": "I find it triggering because so much of the talk about “healthy” eating is filled with myth and misinformation and falsehoods. It’s annoying.",
      "created_utc": 1677875573.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jat8237",
      "author": "Salt-Establishment62",
      "body": "Yes, hard-core. My dad is one of those \"super healthy\" people to the point of an eating disorder. He won't even have something a little unhealthy when we eat out or go on vacation. He constantly gets on me about eating better. He does it so much and so doggedly that I've relapsed heavily. I've told him several times that it heavily triggers me, but he just says that I've recovered, so why should it bother me, he just wants the best for me, etc. It is so maddening.",
      "created_utc": 1677881108.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jatgle7",
      "author": "theshizirl",
      "body": "It's absolutely a trigger for me, and it usually plays into my 'fear' foods. The reality is that it's normal for people to eat unhealthy foods now and then. For me, however, this causes tons of anxiety for me and I have to specifically try \\*not\\* to eat healthy food sometimes just to eat anything.",
      "created_utc": 1677884765.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jatlgzr",
      "author": "Dangerous_Owl_1858",
      "body": "to me any sort of strict control around eating is. it looks obsessive",
      "created_utc": 1677886919.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jasp8ec",
      "author": "None",
      "body": "Yes, even though I spend sooooo much free time thinking about and looking up information about healthy eating. But if someone is bringing it up out of nowhere, or in a situation I didn’t expect, it’s triggering. Almost like I gotta be in control of the information",
      "created_utc": 1677873653.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jat089h",
      "author": "significantpause",
      "body": "YES.  Agree with others that part of it is because commonly people spout myths and you can never argue,  but any extended convo about healthy diets and recommendations just kills me. Especially when people start talking about how it made them lose weight! I took my headphones off during a voice call with my friends bc they got on the topic and I told them to message me when they were done.  I couldn't take it!",
      "created_utc": 1677877951.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jaufwwa",
      "author": "bristolfarms",
      "body": "it’s so triggering for me. i constantly have to fight my good vs bad food thoughts, and it never helps when people make comments about how organic or “healthy” is good. \n\ni already struggle with letting myself eat everything without feeling guilt or shame so proselytizing just makes it worse.",
      "created_utc": 1677901658.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jaslvrr",
      "author": "cutiepie538",
      "body": "100%. Even the word “healthy” to me\nCan be triggering cause most of society views healthy in a disordered context. Like people would look at me and assume I’m not healthy cause I eat more “unhealthy” food now and am at a bigger size than I was when I was super in my ED. I just hate the entire concept. \n\nMy coworkers are also obsessed with talking about “healthy” food and “junk” food and how this kind of food is “bad” or “good” and it triggers tf outta me. So you’re not alone. It makes me super anxious to eat around them and even just general conversations are stressful cause why are we talking about the morality of food during a 9AM work conversation??? Sometimes I feel strong enough to interject and plug intuitive eating. But sometimes I’m not and just sit there listening and anxiously shaking my leg. Sorry I don’t have better tips, but wanted you to know you’re not alone",
      "created_utc": 1677872331.0,
      "score": 6,
      "context": []
    },
    {
      "id": "javm73a",
      "author": "naomi_gvf",
      "body": "YES. My mom is always talking about \"healthy eating\" and only eats vegetables (I suspect she may have an ed of her own actually) and it makes me feel so insecure for eating at all; just being around her makes me feel the need to restrict and workout for hours every day",
      "created_utc": 1677932849.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jaw9jmz",
      "author": "kaiikee_strange",
      "body": "Absolutely, the whole diet culture is a massive trigger makes me question everything I eat. When people tell me they are on a diet and need to lose x amount of weight, I feel like I need to be too and need to watch more on what I eat and how much etc.",
      "created_utc": 1677944909.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jawl0q1",
      "author": "martinthewarrior69",
      "body": "Oh hell yes. I didn’t realize how triggered I was until I moved in with my boyfriend and he started buying diet yogurt, lean cuisine, egg whites, etc. it’s totally fine that he wants to eat that stuff, but it just puts me in a really bad headspace.",
      "created_utc": 1677949573.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jaz8rim",
      "author": "my-strange-addiction",
      "body": "I HATE the word healthy so much because healthy can mean different things for everyone and cannot be put into a box like what your co worker is talking about it has always been a massive trigger for me, as well as weight loss ads making me want to get worse. \n\nyou're not alone we're here for you 💜",
      "created_utc": 1677993679.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jb4dk6f",
      "author": "pinkmoon420",
      "body": "Actually yes. I hadn't known this term before your comment but looking into it I think that could be going on.",
      "created_utc": 1678096570.0,
      "score": 2,
      "context": []
    },
    {
      "id": "javke0h",
      "author": "pinkmoon420",
      "body": "Yes. I had to break up with a partner because of this. They were so on edge they wouldn't even eat frozen veggies because they thought it was less healthy than fresh veg. Lots of fasting. Lots of reading of labels, even if it was only my food. Lots of \"I NEED to exercise\" or \"haven't done enough\" etc. Lots of judging of others choices.\n\nI spoke to them about how much I was struggling with this and nothing would change. It got to the point where I slipped into a bad place and had to walk away for my sanity. \n\nMy take-away from this has been that, whether I am eating completely healthy or not, having a calmer attitude towards food is what is most healthy. \n\nIf I started restricting heavily again to be more \"healthy\" I fear that would lead to much much unhealthier habits and ultimately make me unwell again.\n\nEveryone has a different journey but I know that I am healthier being more relaxed about what I eat than I am restricting what I eat.",
      "created_utc": 1677931554.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jat1028",
      "author": "Lou-eez-",
      "body": "I'm more triggered by very unhealthy eating. I see it, and it makes me not want to eat at all. Healthy eating encourages me to eat more because I feel at peace with what I eat if it's clean. Having someone preach to me about healthy eating would just give me more ideas of foods that I could try, but I can understand how it would be upsetting to have a coworker like this",
      "created_utc": 1677878256.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jaslwbn",
      "author": "petralaxy",
      "body": ">i think part of me was \"jealous\" that other people were able to easily control their eating so much that they were able to just eat foods that were healthy and beneficial for them and didn't have to worry about wanting to binge on junk. \n\nRight? I'm jealous that people can limit the certain kinds of food they eat without wanting to limit everything. I do want to eat healthier, though, since I don't feel I get enough veggies or decent protein in a day. It's hard to approach it in a mindful, measured way.",
      "created_utc": 1677872338.0,
      "score": 2,
      "context": [
        {
          "id": "jasjxym",
          "author": "Proper_Dragonfruit30",
          "body": "YES! healthy eating talk was a huuuge trigger for me in my early 20s (30 now - been struggling with ED since I was 11 like you) and i could never understand why. i think part of me was \"jealous\" that other people were able to easily control their eating so much that they were able to just eat foods that were healthy and beneficial for them and didn't have to worry about wanting to binge on junk. shame definitely played into that as well; it was a complicated feeling. not saying this is what you're experiencing exactly, but i know what you mean.",
          "created_utc": 1677871555.0
        }
      ]
    },
    {
      "id": "jat2bta",
      "author": "petralaxy",
      "body": "Right? So sick of hearing the phrase “herbal cleanse.” Sure, I know eating things high in antioxidants and helpful compounds are good for you, but it’s not a cure-all for every ailment under the sun",
      "created_utc": 1677878781.0,
      "score": 2,
      "context": [
        {
          "id": "jasu55j",
          "author": "Excellent-World-476",
          "body": "I find it triggering because so much of the talk about “healthy” eating is filled with myth and misinformation and falsehoods. It’s annoying.",
          "created_utc": 1677875573.0
        }
      ]
    },
    {
      "id": "jaubj5j",
      "author": "anonchicago7",
      "body": "Tell him if you'd recovered from cancer would he keep smoking cigarettes around you....cause that's what he's doing with all the healthy food talk around a person in eating disorder recovery-spitting in ur face",
      "created_utc": 1677899398.0,
      "score": 6,
      "context": [
        {
          "id": "jat8237",
          "author": "Salt-Establishment62",
          "body": "Yes, hard-core. My dad is one of those \"super healthy\" people to the point of an eating disorder. He won't even have something a little unhealthy when we eat out or go on vacation. He constantly gets on me about eating better. He does it so much and so doggedly that I've relapsed heavily. I've told him several times that it heavily triggers me, but he just says that I've recovered, so why should it bother me, he just wants the best for me, etc. It is so maddening.",
          "created_utc": 1677881108.0
        }
      ]
    },
    {
      "id": "jat958d",
      "author": "petralaxy",
      "body": "I'm so sorry you have to deal with that, that sounds really emotionally draining. If comments about healthy eating from *acquaintances* can be triggering then I can't even imagine how much worse it would be to hear from an insensitive parent",
      "created_utc": 1677881565.0,
      "score": 2,
      "context": [
        {
          "id": "jat8237",
          "author": "Salt-Establishment62",
          "body": "Yes, hard-core. My dad is one of those \"super healthy\" people to the point of an eating disorder. He won't even have something a little unhealthy when we eat out or go on vacation. He constantly gets on me about eating better. He does it so much and so doggedly that I've relapsed heavily. I've told him several times that it heavily triggers me, but he just says that I've recovered, so why should it bother me, he just wants the best for me, etc. It is so maddening.",
          "created_utc": 1677881108.0
        }
      ]
    },
    {
      "id": "jat4nz3",
      "author": "petralaxy",
      "body": ">  I couldn't take it!\n\nYeah, I honestly would have tried to walk away from the conversation I had with this coworker today, but she and another coworker came into my cubicle and pinned me in conversationally. It would have looked very rude for me to walk away sadly",
      "created_utc": 1677879723.0,
      "score": 2,
      "context": [
        {
          "id": "jat089h",
          "author": "significantpause",
          "body": "YES.  Agree with others that part of it is because commonly people spout myths and you can never argue,  but any extended convo about healthy diets and recommendations just kills me. Especially when people start talking about how it made them lose weight! I took my headphones off during a voice call with my friends bc they got on the topic and I told them to message me when they were done.  I couldn't take it!",
          "created_utc": 1677877951.0
        }
      ]
    },
    {
      "id": "jat23wi",
      "author": "petralaxy",
      "body": "Right? I also know my coworker absolutely judges the food I eat as wrong. She made a joking comment today related to me not wanting to give up certain foods in reference to the carby snacks I keep around. What she doesn’t understand is that I keep those foods around because for me they’re personal safe foods that don’t make me want to purge, which is far healthier than if I fixated on eating only “good” foods and relapsed into something worse.",
      "created_utc": 1677878694.0,
      "score": 5,
      "context": [
        {
          "id": "jaslvrr",
          "author": "cutiepie538",
          "body": "100%. Even the word “healthy” to me\nCan be triggering cause most of society views healthy in a disordered context. Like people would look at me and assume I’m not healthy cause I eat more “unhealthy” food now and am at a bigger size than I was when I was super in my ED. I just hate the entire concept. \n\nMy coworkers are also obsessed with talking about “healthy” food and “junk” food and how this kind of food is “bad” or “good” and it triggers tf outta me. So you’re not alone. It makes me super anxious to eat around them and even just general conversations are stressful cause why are we talking about the morality of food during a 9AM work conversation??? Sometimes I feel strong enough to interject and plug intuitive eating. But sometimes I’m not and just sit there listening and anxiously shaking my leg. Sorry I don’t have better tips, but wanted you to know you’re not alone",
          "created_utc": 1677872331.0
        }
      ]
    },
    {
      "id": "jaw6xfw",
      "author": "UselessHuman1",
      "body": "Wouldn't that fall into orthorexia? Just curious.",
      "created_utc": 1677943797.0,
      "score": 2,
      "context": [
        {
          "id": "javke0h",
          "author": "pinkmoon420",
          "body": "Yes. I had to break up with a partner because of this. They were so on edge they wouldn't even eat frozen veggies because they thought it was less healthy than fresh veg. Lots of fasting. Lots of reading of labels, even if it was only my food. Lots of \"I NEED to exercise\" or \"haven't done enough\" etc. Lots of judging of others choices.\n\nI spoke to them about how much I was struggling with this and nothing would change. It got to the point where I slipped into a bad place and had to walk away for my sanity. \n\nMy take-away from this has been that, whether I am eating completely healthy or not, having a calmer attitude towards food is what is most healthy. \n\nIf I started restricting heavily again to be more \"healthy\" I fear that would lead to much much unhealthier habits and ultimately make me unwell again.\n\nEveryone has a different journey but I know that I am healthier being more relaxed about what I eat than I am restricting what I eat.",
          "created_utc": 1677931554.0
        }
      ]
    },
    {
      "id": "jat3cnt",
      "author": "petralaxy",
      "body": "Totally fair. For me I just don’t like the feeling that someone is speculating on what I eat and casting judgement, or that what I’m eating might be wrong. I just wanna be left alone when it comes to food, but maybe that in itself isn’t a super helpful mindset?",
      "created_utc": 1677879192.0,
      "score": 4,
      "context": [
        {
          "id": "jat1028",
          "author": "Lou-eez-",
          "body": "I'm more triggered by very unhealthy eating. I see it, and it makes me not want to eat at all. Healthy eating encourages me to eat more because I feel at peace with what I eat if it's clean. Having someone preach to me about healthy eating would just give me more ideas of foods that I could try, but I can understand how it would be upsetting to have a coworker like this",
          "created_utc": 1677878256.0
        }
      ]
    }
  ]
}