{
  "id": "1286dek",
  "subreddit": "EatingDisorders",
  "author": "MeteorIntrovert",
  "created_utc": 1680310830.0,
  "title": "Does an eating disorder ever go away? or do you just learn how to better deal with it?",
  "selftext": "I've had an ED continuously for like almost 2 years now and i'm starting to think that it might never go away. i've learned how to live my life with it now but i think i've accepted that it wont ever completely go away. for those that have had eds for multiple years or have recovered from it, are the ed thoughts still there?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1286dek/does_an_eating_disorder_ever_go_away_or_do_you/",
  "score": 46,
  "num_comments": 44,
  "comments": [
    {
      "id": "jehinln",
      "author": "brinnybinny",
      "body": "i've been in recovery for 15 years now. i was constantly told early on in my recovery that ed's are like other addictions in the fact that you are always going to be in recovery from them, and so far that's proven true for me. i still struggle every day with ed thoughts in my head, but i've learned to mostly ignore them. some days/weeks are worse than others, but i've learned to live with the other voice inside of my head.",
      "created_utc": 1680313312.0,
      "score": 43,
      "context": []
    },
    {
      "id": "jehepuj",
      "author": "chupke07",
      "body": "Yep, still there. I have been in recovery successfully for almost two years, but I still have foods I can't eat, like high fat foods. I also still have a lot of body dysmorphia.",
      "created_utc": 1680311441.0,
      "score": 23,
      "context": []
    },
    {
      "id": "jehh4me",
      "author": "Queenofwands1212",
      "body": "I don’t think it ever “goes away”. We can’t burn away memories or brain cells. We can’t get a brain transplant. We can’t erase the memory of having an Ed , therefore, what makes people think full recovery is possible? It doesn’t make sense to me lol. It’s just getting to a point of living with it or lowering the intensity.",
      "created_utc": 1680312592.0,
      "score": 17,
      "context": []
    },
    {
      "id": "jehxfi1",
      "author": "cleanhouz",
      "body": "Three treatment centers and two years later I no longer live every moment for my ED. Remission is amazing. Im going through a rough patch at the moment but overall, the thoughts are way less frequent and less intense. I no longer have to follow along with my thoughts. I have choice again.",
      "created_utc": 1680320963.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jei1gys",
      "author": "ChubbyPupstar",
      "body": "I think it might be different for some. I know the physician and other experts at the ED program at a large renowned hospital say it typically is about 5 years of treatment but do suggest you can and will move beyond your ED. That said, your experiences are still part of you. This can actually eventually give you more strength having gone through the battle! The Dr who actually started the program in the days before programs existed has decades of experiences and reflects on how amazing those who have gone through ED recovery are. He notes how they are some of the strongest and most incredible people he knows now. Keep your hope alive. Better days ahead and know you can beat this ED! Don’t go it alone though. Get help, seek support, be patient and  be kind to yourself. Don’t let the ED win. You are stronger than it. It is incredibly hard, but you are worth the battle! You deserve a life of freedom from the shackles of ED so you can focus on other things and achieve great things. Get yourself back, but remember:  patience, kindness, self love and on the days that don’t go as well, know there is another day around the corner. Recovery is not linear, but rather an up and down journey. Every day and every experience in recovery changes that trajectory somewhat but it’s moving, ultimately, in the forwards direction to getting you and your life back. Hang in there. You and your family and friends are worth the effort!! 🥰",
      "created_utc": 1680323359.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jei630t",
      "author": "lacroixlite",
      "body": "I used to think the same - and with good reason. EDs are seriously scary and overwhelming. When you’re in the throes of one, it’s nearly impossible to imagine life without it.\n\nHowever: recovery *is* possible. I’m 1 month and 25 days “clean” from mine, and life could not be more beautiful. It’s such a relief to not have all the twisted thinking that goes along with an ED in my head anymore. I see people normally (not as thinspo), see my body normally, and all in all… it’s just great.\n\nIf you want to recovery, please try. Before my ED recovery I’d had it for 9 years. That’s 9 years I will never get back. Please don’t give up on yourself though. No matter how long it takes… reach for that happy ending. You’re so worth it.",
      "created_utc": 1680326349.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jeidxts",
      "author": "kaiocant89",
      "body": "I’ve been in recovery for a few years now.  My mental health improved a lot and so did my body image but the eating disorder is always lurking in the background looking for a weakness, in my experience.  I went through something traumatic recently and some Ed behaviours crept back in, which I am now trying to correct in a voluntary mental health facility.\n\nMy advice is, keep up with therapy and dietician visits so that if you back slide you have clinicians on hand who can help.",
      "created_utc": 1680332266.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jei2542",
      "author": "Silvesa8686",
      "body": "I think I’ll always sort of have one. I had bad anorexia in college, followed by a brief bulimia phase. I still need to get 18,000 steps per day or I feel like a failure, all these years later. It gets better, but never fully goes away.",
      "created_utc": 1680323776.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jeifdn3",
      "author": "None",
      "body": "They’re there, but they don’t affect my actions in any way. It’s kinda strange to think about. Only three years ago I spent every day and night being led around by such thoughts, but here I am now, just vaguely aware that they exist. And that’s it.",
      "created_utc": 1680333438.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jeijzud",
      "author": "None",
      "body": "30 years here and still going unfortunately. Everyone is different. 1/3 recover, 1/3 die and 1/3 live with their ED.",
      "created_utc": 1680337414.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jeivg4n",
      "author": "Necessary_Spinach_47",
      "body": "ive been in recovery since 2021 and i can say for myself that i still have thoughts, but i can handle them and talk about them with my partner and i dont act to them anymore. very glad that its this way for me",
      "created_utc": 1680347361.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jej00gt",
      "author": "Separate_Tangelo7138",
      "body": "I think for people who’ve had it a longgggg time, like many years, it is deeply engrained in us. We just learn to better deal with it. I look and act recovered for the most part, but I still feel very guilty if I eat a fear food. I still judge myself in the mirror constantly. I still get super bummed out if I see how much I weigh. I just try my best not to act on my ED voice",
      "created_utc": 1680350565.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jei9c3o",
      "author": "tymopa",
      "body": "42 years…never goes away. But guess what? We all have a vice we deal with. This one just sucks more than many.",
      "created_utc": 1680328666.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jeicil9",
      "author": "None",
      "body": "NAD- I’m 10 years in, I’m better off than where I started. I don’t see the dysmorphia ever going away. I manage it like a chronic illness and the more I enjoy and live life the easier it is to be healthy.",
      "created_utc": 1680331127.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jejbhmx",
      "author": "Dutchie_Mike",
      "body": "It’s a forever battle",
      "created_utc": 1680356932.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jejmdu1",
      "author": "Beaew",
      "body": "10+ years later I can tell you it's 50/50.\nOn one hand my brain works completely different and I no longer think of binging and purging, I can assure you it changes a lot.\n\nOn the other hand though, I still binge a little from time to time, not the way I used to, the food amount is waaaay smaller but I would never say I'm an intuitive eater 😅\n\nYou CAN feel better but in order to do so you need to understand what lies under your ED and how to manage your feelings in a healthier way, seeing myself of 10yrs ago makes me quite sad for me, it's impressive what you can achieve :)",
      "created_utc": 1680361904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jejyk32",
      "author": "random0630",
      "body": "i always question this myself, especially with actual doctors and treatment professionals telling me that you never fully recover. however there are people who claim to be fully recovered. i think its possible as even though i’m still in recovery, there are so many foods i can eat now without thinking twice about in which would have sent me into a panic a year ago. i think you will always struggle with body image some times but everybody does, even those without an eating disorder",
      "created_utc": 1680367075.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jek0v5z",
      "author": "nm791",
      "body": "It never goes away. You have to remember that ED’s are mental, which means long after you may have resumed “normal eating” you may still be dealing with pervasive thoughts about weight, numbers and food. That is my experience. It feels like an uphill battle to combat ED everyday. When things get overwhelming, Ana is the first thing I turn to because it’s safe and it’s always been there.",
      "created_utc": 1680368018.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jem55hs",
      "author": "Ok_Emu2054",
      "body": "11 years of anorexia, 2 years into recovery (probably 6th time recovering - longest I’ve gone). Maybe I’m not the best to comment on this since I’m so fresh into recovery. But even from what I’ve experienced so far, those thoughts are still there but just not as intense. Antidepressants really helped though. Made the logic voice take over the ED voice in my head. Therapy also helps you identify your triggers, get to the root of why you have an ED (for me it has always been about control and I relapse when I feel like I’m out of control/can’t handle feeling out of control in life) so you can have the tools to tackle it better. You’re always going to be recovering. But it does get easier. Still have Ed habits that I’m trying to kick (stupid shit like “I have to stand when I eat so I don’t get fat) but that’s because they have been with me since I was super super young when my brain was still developing so they’re abit harder to kick than the other things I developed more recently. It’s all a mental game and you just need to choose recovery everyday is how I think of it.",
      "created_utc": 1680402882.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jei4jwd",
      "author": "Physical_Rice919",
      "body": "I'm 6 years in, just recently sought help, but nothing changed. \n\nIt's not hopeless, but it's definitely a long road. It takes a lot of time to reach a space where you actually feel like you're getting better. I've yet to reach that point, but I will eventually.\n\nStay strong, lovey",
      "created_utc": 1680325318.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jei8ode",
      "author": "gorexwhore",
      "body": "I’ve been stuck like this for 12 years. Would also love to know if it ever goes away. I’m so tired.",
      "created_utc": 1680328193.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jeia2di",
      "author": "cipophobia-girl",
      "body": "It doesn’t ever go away, it’s all coping and learning how to deal, but it does get better",
      "created_utc": 1680329220.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jeie4p0",
      "author": "featuringothers",
      "body": "It can get better, there can be freedom. Thinking of you, friend, and hoping that healing comes soon.",
      "created_utc": 1680332421.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jeik2zw",
      "author": "None",
      "body": "I've been battling my eating disorder for over nine years now.\n\nI have come to terms with the fact that she will probably always be a part of me. There are always nights when I cry about it and wish it were different. During Corona I had the feeling that I got my eating habits under control. But that was probably just wishful thinking. The thoughts are there. In fact, they've always been there.\n\n**Please feel hugged, - all of you.** You are not alone. You are strong and you are fighters!",
      "created_utc": 1680337492.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jeiyj35",
      "author": "darkdemonofthemist",
      "body": "12 years for me. Most of my compulsions/behaviors that really interfered with leading a normal life have gone away. The ones that don’t interfere as much (intrusive thoughts, fear of weight gain, purging- although the intense anxiety that made me do it all the time and IMMEDIATELY after eating is gone- body checking) those are still there. I’m as recovered as I think I’ll ever be. Then again, maybe someday I’ll finally get over it. It’s been so long though I can’t imagine that kind of life.",
      "created_utc": 1680349611.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jejg006",
      "author": "humbledbyit",
      "body": "I had an ED for over 30 years & have found recovery working a 12 step program for compulsive eating. In my case it was binge eating, compulsive exercise, some restricting, but tge program is for any ED.",
      "created_utc": 1680359087.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jejoeof",
      "author": "moonie52",
      "body": "the only way to “cure” an ED is to abandon society as a whole",
      "created_utc": 1680362754.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jejz1i5",
      "author": "Calm_Falcon_7477",
      "body": "Go omad. Bing and forget (no purging).",
      "created_utc": 1680367279.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jek5fja",
      "author": "ineedhelplma0",
      "body": "mine goes up and down in intensity. i’ll have really bad months where i’m restricting and exercising a lot and then i’ll do a bit better and eat a couple meals a day for a while but i’ll still be thinking about all the calories and how much weight i’m gaining and all that and then i’ll go back into restricting for a while. it’s like a never ending cycle of shitty thoughts. idk if i’ll ever be able to stop it",
      "created_utc": 1680369880.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jendzda",
      "author": "a_fonfon",
      "body": "I've been in recovery for four years, and I've found that it doesn't go away. However, I can eat without guilt, I don't check calories on packages when I go shopping, and I don't Google nutritional values of foods before I eat them. I am not avoiding eating, nor am I avoiding places where food is served. I have disordered thoughts around food or my body sometimes still, but instead of daily it is weekly or monthly and for a much, much shorter time than before, and it is easier to counter and let go of. I lump them together with my intrusive thoughts now because they're at the same level of distress, but also at the same level of healing. \nIt isn't away. It never will, but I do consider myself better. \nI have very few fallbacks they're easily identifiable, and I have a support net to help me see them quicker, rationalise they're disordered, and remind me where I've come from and where I am now. It makes all the difference. \n\nIt doesn't work for everybody, but what has helped me treat my eating better is making myself feel guilty for not caring for my body for how hard it is working to keep me moving about. I am disabled and food has a huge impact on my functionality and pain. Don't feel guilty for not eating, or eating too much, or other eating disorder habits, that's not what I mean with that. I mean, making myself feel bad for running on empty and forcing my organs to worsen my symptoms to keep me moving around. It was much easier for me to recover with that in mind because I couldn't be kind to myself. So, I created something separate from myself in mind to be kind to, my body.",
      "created_utc": 1680435151.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jenhqx4",
      "author": "MaryContrary26",
      "body": "I can tell you with confidence I know quite a few people who are recovered and do not have ED thoughts but none of them read or post ED related content so you won't find them here.",
      "created_utc": 1680437807.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jeuxlnr",
      "author": "Accomplished_Sand643",
      "body": "I have bulimia since I was about 17-18 so for about 12 years.. it has gotten worse sometimes but I have had some good months/years aswell during these years when I kept it under good control. Then stress or a certain life situation or sometimes hell knows what triggers it again and it is really hard to find my way out.. for me it is a way to sooth myself and it gives some kind of control so the best way is to gain control over my eating in a healthier way. That meaning controlling every single calorie and watch the macros closely-to an extent which is obviously not healthy but at least I am putting healthy food into myself and enough but not too many calories.. so basically I replace the bulimic behaviour with something else, but not getting rid of the psychological obsessive need of control. So I guess the most important is to find the root of it or the motive/need behind the eating disorder and deal with that somehow.. then I would say it might be possible to live with it or even recover from it-at least physically or on a behavioural level",
      "created_utc": 1680568673.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jsroai8",
      "author": "None",
      "body": "Unfortunately, it will always be with you in varying degrees and levels of intensity.",
      "created_utc": 1689880483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jt2d8z5",
      "author": "runnergirl1992",
      "body": "Yeah I think that I am mostly recovered for five years now. The difference is that even if I have ED thoughts I don’t act on them. I still have one fear food (pizza) though that I really just don’t eat even to this day, but it also causes me huge stomach distress.",
      "created_utc": 1690073259.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jek895f",
      "author": "None",
      "body": "yeah, those memories of “happiness” or the highs from the dangerous behaviours never go  away, there’s always a chance of going back to seek those feelings we felt",
      "created_utc": 1680371028.0,
      "score": 5,
      "context": [
        {
          "id": "jehh4me",
          "author": "Queenofwands1212",
          "body": "I don’t think it ever “goes away”. We can’t burn away memories or brain cells. We can’t get a brain transplant. We can’t erase the memory of having an Ed , therefore, what makes people think full recovery is possible? It doesn’t make sense to me lol. It’s just getting to a point of living with it or lowering the intensity.",
          "created_utc": 1680312592.0
        }
      ]
    },
    {
      "id": "jek6t5h",
      "author": "MeteorIntrovert",
      "body": "my god that must feel very rewarding to you. i'm so happy for you",
      "created_utc": 1680370446.0,
      "score": 1,
      "context": [
        {
          "id": "jeifdn3",
          "author": "None",
          "body": "They’re there, but they don’t affect my actions in any way. It’s kinda strange to think about. Only three years ago I spent every day and night being led around by such thoughts, but here I am now, just vaguely aware that they exist. And that’s it.",
          "created_utc": 1680333438.0
        }
      ]
    },
    {
      "id": "jek6nqk",
      "author": "MeteorIntrovert",
      "body": "do you find yourself sometimes giving in to these thoughts or are they just \"thoughts\" to you now?",
      "created_utc": 1680370385.0,
      "score": 2,
      "context": [
        {
          "id": "jeivg4n",
          "author": "Necessary_Spinach_47",
          "body": "ive been in recovery since 2021 and i can say for myself that i still have thoughts, but i can handle them and talk about them with my partner and i dont act to them anymore. very glad that its this way for me",
          "created_utc": 1680347361.0
        }
      ]
    },
    {
      "id": "jeik5h0",
      "author": "None",
      "body": "I’ve had mine for 30 years! I thought I was alone in the length of mine. Sending you love ❤️",
      "created_utc": 1680337554.0,
      "score": 4,
      "context": [
        {
          "id": "jei9c3o",
          "author": "tymopa",
          "body": "42 years…never goes away. But guess what? We all have a vice we deal with. This one just sucks more than many.",
          "created_utc": 1680328666.0
        }
      ]
    },
    {
      "id": "jek6yca",
      "author": "MeteorIntrovert",
      "body": "i think the only way to really cure an ed is to abandon your brain itself and unfortunately its not possible to do that",
      "created_utc": 1680370504.0,
      "score": 1,
      "context": [
        {
          "id": "jejoeof",
          "author": "moonie52",
          "body": "the only way to “cure” an ED is to abandon society as a whole",
          "created_utc": 1680362754.0
        }
      ]
    },
    {
      "id": "jek5pvf",
      "author": "MeteorIntrovert",
      "body": "this is very similar to how i feel. sometimes i think im doing well and then a few days later i start to worry about food and gaining weight again and it really is a cycle. this is why i figure it might be a permanent thing no matter how better it gets",
      "created_utc": 1680369998.0,
      "score": 1,
      "context": [
        {
          "id": "jek5fja",
          "author": "ineedhelplma0",
          "body": "mine goes up and down in intensity. i’ll have really bad months where i’m restricting and exercising a lot and then i’ll do a bit better and eat a couple meals a day for a while but i’ll still be thinking about all the calories and how much weight i’m gaining and all that and then i’ll go back into restricting for a while. it’s like a never ending cycle of shitty thoughts. idk if i’ll ever be able to stop it",
          "created_utc": 1680369880.0
        }
      ]
    },
    {
      "id": "jem7tfa",
      "author": "None",
      "body": "Thank you so much. It really does give me a sense of relief when I think about it. I thought I’d never be able to escape, that I’d always be under its control no matter what I did, haunted by years of how it already tore me apart. But I was able to make it through. \n\nRecovery is not the same process for everyone, so I can’t tell you how you should make your own recovery, but I sincerely hope you succeed as well. Life works in really strange ways. I wish you find your happiness too. Stay strong.",
      "created_utc": 1680404263.0,
      "score": 1,
      "context": [
        {
          "id": "jeifdn3",
          "author": "None",
          "body": "They’re there, but they don’t affect my actions in any way. It’s kinda strange to think about. Only three years ago I spent every day and night being led around by such thoughts, but here I am now, just vaguely aware that they exist. And that’s it.",
          "created_utc": 1680333438.0
        },
        {
          "id": "jek6t5h",
          "author": "MeteorIntrovert",
          "body": "my god that must feel very rewarding to you. i'm so happy for you",
          "created_utc": 1680370446.0
        }
      ]
    },
    {
      "id": "jekcq29",
      "author": "Necessary_Spinach_47",
      "body": "i have actually thrown my dinner up twice last months. but i know that i had a very stressful time to trigger it. i now eat freely, and when i have thoughts and i havent eaten enough i make sure i do eat so i wont let any space for my ed to slip back in",
      "created_utc": 1680372904.0,
      "score": 1,
      "context": [
        {
          "id": "jeivg4n",
          "author": "Necessary_Spinach_47",
          "body": "ive been in recovery since 2021 and i can say for myself that i still have thoughts, but i can handle them and talk about them with my partner and i dont act to them anymore. very glad that its this way for me",
          "created_utc": 1680347361.0
        },
        {
          "id": "jek6nqk",
          "author": "MeteorIntrovert",
          "body": "do you find yourself sometimes giving in to these thoughts or are they just \"thoughts\" to you now?",
          "created_utc": 1680370385.0
        }
      ]
    },
    {
      "id": "jw2zm3l",
      "author": "tymopa",
      "body": "Thank you. The struggle is real. ❤️❤️❤️",
      "created_utc": 1691976921.0,
      "score": 2,
      "context": [
        {
          "id": "jei9c3o",
          "author": "tymopa",
          "body": "42 years…never goes away. But guess what? We all have a vice we deal with. This one just sucks more than many.",
          "created_utc": 1680328666.0
        },
        {
          "id": "jeik5h0",
          "author": "None",
          "body": "I’ve had mine for 30 years! I thought I was alone in the length of mine. Sending you love ❤️",
          "created_utc": 1680337554.0
        }
      ]
    },
    {
      "id": "jek8tzb",
      "author": "ineedhelplma0",
      "body": "yeah same. sometimes i’ll have pretty good stretch and i’ll think “oh maybe i just miraculously got better lol” but it never lasts and it’s almost like the thought of getting better is what triggers it to get bad again if that makes sense? idk, hopefully we actually get better at some point",
      "created_utc": 1680371262.0,
      "score": 1,
      "context": [
        {
          "id": "jek5fja",
          "author": "ineedhelplma0",
          "body": "mine goes up and down in intensity. i’ll have really bad months where i’m restricting and exercising a lot and then i’ll do a bit better and eat a couple meals a day for a while but i’ll still be thinking about all the calories and how much weight i’m gaining and all that and then i’ll go back into restricting for a while. it’s like a never ending cycle of shitty thoughts. idk if i’ll ever be able to stop it",
          "created_utc": 1680369880.0
        },
        {
          "id": "jek5pvf",
          "author": "MeteorIntrovert",
          "body": "this is very similar to how i feel. sometimes i think im doing well and then a few days later i start to worry about food and gaining weight again and it really is a cycle. this is why i figure it might be a permanent thing no matter how better it gets",
          "created_utc": 1680369998.0
        }
      ]
    }
  ]
}