{
  "id": "1294isv",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1680395980.0,
  "title": "Eating Disorder in your 30s",
  "selftext": "Last fall after not having a primary doctor for years I got told I’m overweight and prediabetic. That hit me hard so I was determined to make changes. I became active, stopped snacking and ate 3 balanced meals a day. I lost more than half of what I needed to by November and was feeling great…until the holidays. Thanksgiving day I was getting compliments about my weightloss from family. I told myself just wait till they see you lose that last couple of pounds. Those comments led me to restrict that thanksgiving dinner. After everyone left though I binged. I felt sick and ashamed and I wanted this disgusting food out of me. I googled what I should do after overeating and landed on a YouTube video were there was a random comment about laxatives and puking. I had no time to get laxatives so I tried puking. It felt so nasty and I cried myself to sleep saying I will never do that again. Next morning I woke up and liked the feeling of not feeling bloated. I stepped on the scale and it didn’t move. I started thinking if I had added a laxative I probably would have felt even better. That was the beginning to the issues I suffer now. I take laxatives daily and puke on the weekends when I binge. I’m still active and still keep my balanced diet on the weekdays. I’ve lost the last couple of pounds and some but I feel I’ve lost myself as well. Doctor being impressed with my labs and weightloss and the congratulations I get from people on losing weight has had me keeping these unhealthy ways. I would feel so embarrassed admitting this to a doctor for help because even in society eating disorders are looked at as a teen/young adult issue. Maybe writing this post to a bunch of strangers is a step to help me into a healthy path.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1294isv/eating_disorder_in_your_30s/",
  "score": 75,
  "num_comments": 14,
  "comments": [
    {
      "id": "jem4k10",
      "author": "25lives",
      "body": "31yr old anorexic clocking in here. You aren't alone, and help is worth it. Start with trying a therapist before a doctor, that'll give you somewhere safe to go and work out how you wanna get out of this.",
      "created_utc": 1680402578.0,
      "score": 27,
      "context": []
    },
    {
      "id": "jemhk33",
      "author": "lacroixlite",
      "body": "Just because *society* believes something doesn’t mean you shouldn’t either.\n\nEspecially when it’s your life on the line.\n\nI’m 31, have suffered various EDs since I was 22. Definitely not a “young person’s disease.”",
      "created_utc": 1680409761.0,
      "score": 22,
      "context": []
    },
    {
      "id": "jem54r5",
      "author": "two_thoughts",
      "body": "I didn’t seek help until I was 30, almost didn’t because I was worried I was taking away resources from people who needed it more. That’s not the case, and it’s not the case that anyone in a place to help you will think it’s a young person’s issue. That’s just the disorder being manipulative of you. 💜",
      "created_utc": 1680402871.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jelwegb",
      "author": "HillcroftPansies",
      "body": "Thanks for sharing your story. You’re really brave to be looking at this so clear eyed.",
      "created_utc": 1680398489.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jemgkyl",
      "author": "Fun-Chicken-2634",
      "body": "31 yrs and still struggle with eating disorders at times. Please seek help sooner than later. It really takes a toll on your body and mind and the longer you are in it the harder it is to get out. I can’t tell you how many moments in life my ED has controlled and I have missed out. So much time I can never get back. It’s so hard when people make assumptions on outer appearance instead of checking in on how you are otherwise. Weight loss does not equate wellness or happiness for many people. I would strongly encourage you to see an intuitive eating dietician and a therapist and doctor that have good experience with treating ED. Those pounds are not worth the suffering and isolation that comes with them. Best of luck darling ❤️",
      "created_utc": 1680409139.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jem8f2t",
      "author": "zillabirdblue",
      "body": "I am 42 and have been anorexic and bulimic since I was 13. Yes, it is so stigmatized at these ages.\nThank you so much for opening up about this. So many older people with EDs don’t get it addressed because they’re fear to be judged.\n\nIf we can’t talk about it we can’t get help. But it’s hard to talk about. Consider that Anorexia has the highest mortality rate than any other mental illness. Every single time you purge you are risking life threatening events. \n\nIf you want help you have to seek it out and don’t wait someone to help you. I don’t because of the stigma. Just reading your post helped.\n\nSorry for being a huge whiner, I cut it short",
      "created_utc": 1680404568.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jen6ban",
      "author": "crystaldmb41",
      "body": "44 years old here, and since having my son at 37, I have really dived deep into my disordered eating. I was diagnosed at 26 and 32 with AN. I am currently in my fourth “round” of AN since having my son (so my sixth total round), and it just gets worse each time the older I get. The current round started on January 25, and I have already lost over 30 lbs, so it is bad right now. If you can, get help so you aren’t my age and still existing like I am.",
      "created_utc": 1680428743.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jepnnj1",
      "author": "scumfederate",
      "body": "I’m 30 and have had anorexia since I was 17. I am better at handling it now because I have had a lot of practice at recovery, but that doesn’t mean it isn’t still work every day. You’re not alone and you’re never too old for the help you deserve. 🤍",
      "created_utc": 1680472715.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jepml5w",
      "author": "Apprehensive_Tale604",
      "body": "32 and I have struggled with an eating disorder on and off since I was 16.  \n\nFor years I took laxatives, vitamins and diet pills like they were candy and worked out way too much for my intake.  I'm in moderate recovery even though I still struggle at times and the consequences of my choices is now permanent. \n\nI have heart issues, some bowel issues and OCD that is never going to get better than it is now, even with treatment.  \n\nPlease get help as soon as you can.  And if you can stop taking pills and purging, please try.  It really messes you up and the long term consequences are only half the issue.  Purging (of any kind- throwing up/exercise) and pills can cause death extremely quickly.  You are playing with your life here.  And this is coming from someone who knows just how hard it is.  It took me almost dying and dealing with major health problems to wake up.\n\nI never want to see anyone else go through that.",
      "created_utc": 1680472243.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jer1pgk",
      "author": "None",
      "body": "I've had an ED (which has morphed from one to another to another and back) since I was a child, well over half my life. \n\nYou are currently in a place where you can hopefully correct back to the positive efforts you made, eating balanced meals and being (appropriately) active. \n\nA setback is a setback - it doesn't mean you are committed to going back down the hole. \n\nYou can still do this, you can go back to where you were at, eating balanced meals, not binging, not purging, not using laxatives. You did it before - you CAN do it again!  It was recent - it wasn't years ago that you were doing well, it was mere months! \n\nThe long term dangers of purging and laxative use are absolutely detrimental, and not to be dramatic, but they can kill you.",
      "created_utc": 1680497169.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jeuu7l5",
      "author": "rileyyj001",
      "body": "r/eatingdisordersover30",
      "created_utc": 1680567229.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jer28yp",
      "author": "None",
      "body": "You're not being a whiner. \n\nThis disease is fucking brutal. I'm literally in the exact same boat as you. \n\nThe one thing, big smack in the face, that my therapist said to me that was a massive wake-up call, was...\n\n\"In my x-number of years of seeing/treating patients with eating disorders, the one thing I can tell you is that no one ever ages out of an eating disorder. It doesn't just \\*go away\\*\"\n\nAnd she's right, as I went into an outpatient program and there were women in their 60s and 70s. \n\nu/zillabirdblue please look into getting help. You deserve it just as much as anyone else, and there are treatment providers who don't give a shit about your age, they just want to help you.",
      "created_utc": 1680497531.0,
      "score": 2,
      "context": [
        {
          "id": "jem8f2t",
          "author": "zillabirdblue",
          "body": "I am 42 and have been anorexic and bulimic since I was 13. Yes, it is so stigmatized at these ages.\nThank you so much for opening up about this. So many older people with EDs don’t get it addressed because they’re fear to be judged.\n\nIf we can’t talk about it we can’t get help. But it’s hard to talk about. Consider that Anorexia has the highest mortality rate than any other mental illness. Every single time you purge you are risking life threatening events. \n\nIf you want help you have to seek it out and don’t wait someone to help you. I don’t because of the stigma. Just reading your post helped.\n\nSorry for being a huge whiner, I cut it short",
          "created_utc": 1680404568.0
        }
      ]
    },
    {
      "id": "jetlr4o",
      "author": "zillabirdblue",
      "body": "I hear it, I do. I had just wrote a lot but deleted about how much I hadn’t sought help but no medical professionals intervened at all. It seemed wrong that in all the doctors I’ve seen in all these years none said anything helpful or didn’t seem to care at all. I didn’t ask for help but I just couldn’t. I still have difficulty. Most recent time I was in therapy I was discharged because she doesn’t have knowledge about EDs. I get it but no referral, nothing like that. Just 👋 bye! That kinda stuff makes me give up. It’s my duty to get help, the rest seems whining. I’m morose af to be frank.",
      "created_utc": 1680548887.0,
      "score": 2,
      "context": [
        {
          "id": "jem8f2t",
          "author": "zillabirdblue",
          "body": "I am 42 and have been anorexic and bulimic since I was 13. Yes, it is so stigmatized at these ages.\nThank you so much for opening up about this. So many older people with EDs don’t get it addressed because they’re fear to be judged.\n\nIf we can’t talk about it we can’t get help. But it’s hard to talk about. Consider that Anorexia has the highest mortality rate than any other mental illness. Every single time you purge you are risking life threatening events. \n\nIf you want help you have to seek it out and don’t wait someone to help you. I don’t because of the stigma. Just reading your post helped.\n\nSorry for being a huge whiner, I cut it short",
          "created_utc": 1680404568.0
        },
        {
          "id": "jer28yp",
          "author": "None",
          "body": "You're not being a whiner. \n\nThis disease is fucking brutal. I'm literally in the exact same boat as you. \n\nThe one thing, big smack in the face, that my therapist said to me that was a massive wake-up call, was...\n\n\"In my x-number of years of seeing/treating patients with eating disorders, the one thing I can tell you is that no one ever ages out of an eating disorder. It doesn't just \\*go away\\*\"\n\nAnd she's right, as I went into an outpatient program and there were women in their 60s and 70s. \n\nu/zillabirdblue please look into getting help. You deserve it just as much as anyone else, and there are treatment providers who don't give a shit about your age, they just want to help you.",
          "created_utc": 1680497531.0
        }
      ]
    },
    {
      "id": "jevbuhh",
      "author": "None",
      "body": "I totally get it. I've honestly been really surprised that I haven't been called out by other doctors. I've seen several specialists for various reasons, some related to complications of my ED, some not, but I've come to realize that specialists stay in their lanes. They treat the condition, not the root cause, necessarily. Many of them also don't even know the first thing about EDs with regards to treatment, so even if they skim the surface, they don't really seem to know where to go beyond that. It was a really strange experience, in hindsight, because I was TERRIFIED of being \"accused\" of having an ED, but equally WANTED someone to say something.\n\nWhich unfortunately led to me having to straight up ask for help, myself. It was probably the scariest moment of my life, but I am so glad I did. \n\nDo you have coverage/assistance for therapy? Like extended health or anything? If so (or if you can afford it yourself!) I would do an extensive deep dive on therapists in your area (or who do remote counselling, like on zoom) who focus on EDs, read their reviews, google their name and see what others have to say. It's so important to find the right fit, and it took me three previous counsellors to find my current one, who is right for me. \n\nI would be more than happy to help in any way, if I can. Please feel free to send me a DM and I will absolutely do the legwork for you ❤️",
      "created_utc": 1680575078.0,
      "score": 1,
      "context": [
        {
          "id": "jem8f2t",
          "author": "zillabirdblue",
          "body": "I am 42 and have been anorexic and bulimic since I was 13. Yes, it is so stigmatized at these ages.\nThank you so much for opening up about this. So many older people with EDs don’t get it addressed because they’re fear to be judged.\n\nIf we can’t talk about it we can’t get help. But it’s hard to talk about. Consider that Anorexia has the highest mortality rate than any other mental illness. Every single time you purge you are risking life threatening events. \n\nIf you want help you have to seek it out and don’t wait someone to help you. I don’t because of the stigma. Just reading your post helped.\n\nSorry for being a huge whiner, I cut it short",
          "created_utc": 1680404568.0
        },
        {
          "id": "jer28yp",
          "author": "None",
          "body": "You're not being a whiner. \n\nThis disease is fucking brutal. I'm literally in the exact same boat as you. \n\nThe one thing, big smack in the face, that my therapist said to me that was a massive wake-up call, was...\n\n\"In my x-number of years of seeing/treating patients with eating disorders, the one thing I can tell you is that no one ever ages out of an eating disorder. It doesn't just \\*go away\\*\"\n\nAnd she's right, as I went into an outpatient program and there were women in their 60s and 70s. \n\nu/zillabirdblue please look into getting help. You deserve it just as much as anyone else, and there are treatment providers who don't give a shit about your age, they just want to help you.",
          "created_utc": 1680497531.0
        },
        {
          "id": "jetlr4o",
          "author": "zillabirdblue",
          "body": "I hear it, I do. I had just wrote a lot but deleted about how much I hadn’t sought help but no medical professionals intervened at all. It seemed wrong that in all the doctors I’ve seen in all these years none said anything helpful or didn’t seem to care at all. I didn’t ask for help but I just couldn’t. I still have difficulty. Most recent time I was in therapy I was discharged because she doesn’t have knowledge about EDs. I get it but no referral, nothing like that. Just 👋 bye! That kinda stuff makes me give up. It’s my duty to get help, the rest seems whining. I’m morose af to be frank.",
          "created_utc": 1680548887.0
        }
      ]
    }
  ]
}