{
  "id": "12amx41",
  "subreddit": "EatingDisorders",
  "author": "Faeriemary",
  "created_utc": 1680533719.0,
  "title": "How does one manage to feed themselves properly",
  "selftext": "I’ve had my ed for the longest time and my hunger cues are all jacked up that I don’t feel a thing whenever I’m actually hungry. I can’t tell if I’m anxious or hungry because I have crippling anxiety and I’m constantly overwhelmed so I legit can’t tell 😭 I also never have enough energy to prep anything so I unintentionally starve myself. My stomach is also really fucked up so I can’t even eat a lot at the same time so I don’t waste time later. How do y’all deal??",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/12amx41/how_does_one_manage_to_feed_themselves_properly/",
  "score": 48,
  "num_comments": 7,
  "comments": [
    {
      "id": "jetrj5j",
      "author": "cleanhouz",
      "body": "My hunger cues took a long time to recover. If I would have waited until I was hungry to feed myself I never would have gotten better. What worked for me was eating anyway. No matter what, eat at meal times. It sounds like you've got an issue with volume as well. Eating 5 times a day and/or eating calorie dense food can help with that.",
      "created_utc": 1680551169.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jesz6ix",
      "author": "Theziggyza",
      "body": "I just eat 3 meals a day and 3 snacks even if I’m not hungry",
      "created_utc": 1680540049.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jestn8w",
      "author": "AggravatingArtist815",
      "body": "I get supplements from the doctor. Might be helpful.",
      "created_utc": 1680537836.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jetkcj1",
      "author": "Ok_Nefariousness9419",
      "body": "I snack all day to help with the nausea (instead of hunger). It has gotten easier with time, at first I had alarms on my phone. The key is sticking with it - even if it doesn’t sound good, eat the cracker",
      "created_utc": 1680548335.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jev0p2v",
      "author": "Anfie22",
      "body": "Prior to regaining normal hunger sensation, the cues my body sent that I was hungry was in the form of weakness, tremor, sore throat, brain fog, blurred vision, and the one I tapped into and relied on most to tell me I was hungry which preceded the above was an internal vibrating feeling, like my body was producing this deep humming sensation like a booming subwoofer at a consistent frequency. When I started to feel this, I knew it was time to eat as I knew it would take time to heal and have normal hunger sensations like a classic grumbling shuddering stomach. Maybe you experience these hunger signs too. It's too easy to dismiss and chalk it off to feeling crappy, we got very used to and adept at doing that, but it's important to tap back into it in order to help yourself recover. Your body is working *with* you for your greatest good, not against you. Your body is your teammate, your most loyal companion, and your cheerleader, not your rival. Friend, not foe. Much love to you!",
      "created_utc": 1680569993.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jesz8ma",
      "author": "Theziggyza",
      "body": "Today I had cheese and crackers for lunch 🥪 wasn’t great but better than nothing",
      "created_utc": 1680540071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jeuf6x2",
      "author": "Usual-Effect1440",
      "body": "make a routine of when you eat even if you can't feel them that's when the hunger cues will start coming in",
      "created_utc": 1680560712.0,
      "score": 1,
      "context": []
    }
  ]
}