{
  "id": "12cws4b",
  "subreddit": "EatingDisorders",
  "author": "rileyyj001",
  "created_utc": 1680726410.0,
  "title": "Currently in kidney Failure",
  "selftext": "Hello friends—\n\nI’ve been MIA for some time now, both having been in Inpatient and just needing to step away from these communities for a moment. \n\nI wanted to share with you all that I am currently in kidney failure, and awaiting lab results to determine which stage I am at. I am only 32 years old. There is little hope that I can recover at this point without major medicinal intervention, of which I am not willing to do. I have suffered long enough, and wish to die with my dignity. \n\nI have suffered for over 25 years with this terrible illness, and I wanted to compassionately warn you all that death by EDs is a VERY REAL THING. I hope this shakes you to your core. I am 32 and dying. It could be within days, or months, but I will die from this. \n\nI wish you all nothing but healing, and peace. I am terrified. My family is in ruins. I truly cannot believe I am writing this post.\n\nThank you to every single one of you who has sent me well wishes; I take every word to heart and I have made some beautiful connections here. You are spectacular people, and you deserve full recovery.\n\nBe well, friends 🤍\n\nThank you, thank you, thank you, all! You are incredibly kind, gentle souls, and you have given me more than I can express in words.\n\nIn incredibly surprising news, my lab results are in, and by some chance of all that is good in the world, almost every single value has SHOT up; not just little jumps here and there, like major life-changing amounts. My doctor, family and I are shocked, as I haven’t changed any behaviors! \n\nI don’t know what to make of this; is it a second chance? I have so much thinking to do. \n\nLove you every one of you! I think the prayers I have received here are what has made this happen?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/12cws4b/currently_in_kidney_failure/",
  "score": 134,
  "num_comments": 16,
  "comments": [
    {
      "id": "jf445q6",
      "author": "Zealousideal-Award-8",
      "body": "I had kidney failure and reversed it but you gotta want to recover. I’m sorry you are suffering so much",
      "created_utc": 1680734464.0,
      "score": 34,
      "context": []
    },
    {
      "id": "jf3z8js",
      "author": "Zelda_is_my_homegirl",
      "body": "Wishing you lots of love and peace as you go through this. I really appreciate you posting this too. I don’t think things like organ failure gets talked about enough in ED spaces, and it is kind of you to share this part of your experience with this community. \n\nPeople have a tendency to think “but I’m not sick enough for this to happen” but you are. You are sick enough, and even if you’re not underweight, things like this can happen as a result of an ED. \nPlease take your disorder seriously, folks.",
      "created_utc": 1680732327.0,
      "score": 14,
      "context": []
    },
    {
      "id": "jf4pxu6",
      "author": "stoptouchingmyhair",
      "body": "I don't know you, but I know you deserve full recovery too. I couldnt read this without at least reaching out to say don't give up. Don't stop fighting.",
      "created_utc": 1680744327.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jf5c0t7",
      "author": "Sulkk3n",
      "body": "I don't care if I don't know you. This is making me so genuinely upset right now. You don't deserve this. You don't deserve any of this. Please don't die. You're a beautiful human being, and you deserve to be on this planet.",
      "created_utc": 1680755485.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jf5tpt0",
      "author": "Substantial-Suit-148",
      "body": "Big hugs! Im a survivor of 24 years and it almost killed me 3 times. So sorry! Keep us posted, we wish you all the best!",
      "created_utc": 1680769150.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jf6gbdk",
      "author": "None",
      "body": "Sending love ❤️",
      "created_utc": 1680785239.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jf70jqq",
      "author": "lisa1896",
      "body": "I have a different ED than yours but I became determined to change and my body has almost completely recovered, including my liver and circulation problems which were severe. I'm old, 62, so I have some skeletal issues but even those have massively improved.\n\nYour body will fight for you with everything it's got if you help it, you'll be amazed.\n\nSending you all my strength and white light and energy because you deserve to live a happy life in a healthy body, we all do.\n\nI read your post yesterday and came back to read that your lab values significantly improved and I cannot express how happy I am for you, this truly made my day.\n\nI was a nurse for over 30 years. I can tell you from experience that miracles do happen. <3\n\nWork hard and be well so that you can live long and be happy.",
      "created_utc": 1680794018.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jf7pc2u",
      "author": "Sudden_Board_4257",
      "body": "Girl this definitely is a second chance, it's your time to start recovery and begin a new and better life.",
      "created_utc": 1680803641.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jf73z5w",
      "author": "truthfully1111",
      "body": "I wish you the best 💪 and no one should ever underestimate the power of prayers, positive thoughts, good energy, and even a placebo. \n\nA registered dietitian or nutritionist can help, as can a support group, or a good listener. \n\nTry aromatherapy or any other means to calm down, too, but keep trying to heal.",
      "created_utc": 1680795378.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jf5cszu",
      "author": "sandopsio",
      "body": "I am so sorry that you have suffered from this illness so much for so long, and that you're going through this. It's heartbreaking and I don't have the right words. Even while suffering so much, you're trying to help others here. I wish I had answers and I wish I could share hope with you. I hope your kidney values can improve without the major medical intervention that you don't want to go through. You still deserve healing very much so and I know it's not my place to say, but even when feeling hopeless, there can be reasons to fight that we haven't yet discovered. Something we would fight for with everything that we didn't even know we had, if we know about it ahead of time. You deserve care and healing, mentally and physically.",
      "created_utc": 1680755963.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf94ocw",
      "author": "Ajturk89",
      "body": "I'm sending you positive, healing vibes sweetheart",
      "created_utc": 1680824739.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jfqudv4",
      "author": "lolballs39",
      "body": "im having a similar issue. i really wish you so much luck and happiness",
      "created_utc": 1681160511.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jh3v80z",
      "author": "Subject_Strategy2068",
      "body": "I sincerely hope you get well 💕💕💕💕 nobody deserves to go through what you have gone through, nobody deserves to have death come knocking on their door so early. I wish you the best and a very speedy recovery from this awful illness .",
      "created_utc": 1682051579.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jf6xadp",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1680792721.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jf6q0t3",
      "author": "Glittering_goat25",
      "body": "Don’t tell my ED this 😭😭",
      "created_utc": 1680789737.0,
      "score": -2,
      "context": []
    },
    {
      "id": "jf6zb8i",
      "author": "rileyyj001",
      "body": "Call it BS ALL you want, my friend. I posted this to 3 different ED subs and that’s it…and I didn’t say things were magically better—I said my numbers have greatly improved. Big difference. You are a troll, and I hope you find the healing you so greatly deserve. Check yourself, and take this energy right along with you. Bye 💁🏼‍♂️ Can’t even believe I gave this a response.",
      "created_utc": 1680793530.0,
      "score": 5,
      "context": [
        {
          "id": "jf6xadp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1680792721.0
        }
      ]
    }
  ]
}