{
  "id": "12hd7j6",
  "subreddit": "EatingDisorders",
  "author": "oppositetoup",
  "created_utc": 1681118729.0,
  "title": "My partner has an Eating disorder and she's now pregnant.",
  "selftext": "Should I bring up her Eating disorder when we go to our first GP appointment. I'm worried that if I try and bring it up again beforehand, she'll just refuse to go. I'm worried about the affect it will have on our baby if she doesn't get help for her ED. But I also don't want her to feel like I'm ambushing her. Any advice on how to approach this situation would be appreciated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/12hd7j6/my_partner_has_an_eating_disorder_and_shes_now/",
  "score": 47,
  "num_comments": 15,
  "comments": [
    {
      "id": "jfoesw4",
      "author": "Getting-better-",
      "body": "That’s really tough. Are you asking if you should bring it up with the doctor or with her when you go for the appointment? If you’re worried she will refuse to go if you address it beforehand I would suggest you private contact you guys’ doctor before the appointment and ask the doctor to ask about eating disorders and bring up the risks of restrictive diets and purging while pregnant. I know from personal experience I am at least a little more willing to hear out facts from a doctor than opinions from people in my personal life.",
      "created_utc": 1681120441.0,
      "score": 53,
      "context": []
    },
    {
      "id": "jfon43c",
      "author": "Indy_Anna",
      "body": "This is a tough one. I had an ED and when I got pregnant I made a lot of changes, including stopping my ED practices. I hope your wife can find the same strength. As for what you should do, I think you need to sit down and have a frank conversation with her before going to the doctor. I hope she takes it well, good luck.",
      "created_utc": 1681126761.0,
      "score": 37,
      "context": []
    },
    {
      "id": "jfoww5y",
      "author": "synchrohobbit",
      "body": "It's now her responsibility to heal and create a healthy environment if you are going to complete the pregnancy. The best thing would be to find a therapist or dietician with ED knowledge to start the process. There's no way she can \"refuse\" to go to a prenatal appointment; that would be incredibly selfish if she's trying to grow a baby.  If it's serious it's going to require serious and hard work, no way around that. If she has body image issues, food cravings or aversions, those are going to explode. You aren't ambushing her, you are thinking about your kid.",
      "created_utc": 1681132307.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jfpdyil",
      "author": "Eilidh111",
      "body": "I would honestly wait and see how the first month or so goes. Make sure she's taking her prenatal vitamins and staying hydrated. I was anorexic when I got pregnant and for some reason it was very easy for me to start eating normally. I did it with two other pregnancies as well. I also lost the weight very quickly afterwards but I gained an acceptable amount of weight. Something that helped me was having good maternity clothes. Jeans, shorts, cute dresses. It would highlight that my belly was bigger but the rest of me was pretty much the same (besides swollen feet and bigger breasts). I loved wearing leggings, a tank top, and a zip up hoodie when it was cool. My disorder isn't about being thin, it's control, but I hate the FEELING of being or looking big. It makes me feel trapped.\n\nA pregnant woman doesn't actually need to gain a lot of weight. 20-25 lbs. A bit more if she is already underweight. I would always break that down in my head and think about how much the baby weighed, the placenta, the extra fluid etc. It helped me realize that most of what I was gaining would go away quickly after delivery and it did all three times. After the first I wore my normal jeans the first week.\n\n&#x200B;\n\nNow, if she doesn't do well the first month it would be an excellent idea for her to meet with an ED Nutritionist that can help her develop a meal plan she is comfortable with. I did this on my own with a lot of research. Some days I would just eat like a \"normal\" person. Others,I needed to know exactly how much I was consuming. Having a plan in place for those days really helps and she can build it with her safe foods. I wouldn't recommend brining it up to her doctor at the first appointment. This may make her feel very pressured and will put a ton of extra focus on her weight which could be very counterproductive.\n\nBest of luck and congratulations! You are already showing you are going to be a great parent.\n\nA pregnant woman doesn't actually need to gain a lot of weight. 20-25 lbs. A bit more if she is already underweight. I would always break that down in my head and think about how much the baby weighed, the placenta, the extra fluid, etc. It helped me realize that most of what I was gaining would go away quickly after delivery and it did all three times. After the first, I wore my normal jeans the first week..od maternity clothes. Jeans, shorts, cute dresses. It would highlight that my belly was bigger but the rest of me was pretty much the same (besides swollen feet and bigger breasts). I loved wearing leggings, a tank top, and a zip-up hoodie when it was cool. My disorder isn't about being thin, it's control, but I hate the FEELING of being or looking big. It makes me feel trapped..",
      "created_utc": 1681139843.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jfp2gxr",
      "author": "sweetparamour79",
      "body": "I am 6 months pp and pregnancy was ROUGH. I had therapy in preparation and still found it mentally very draining as I swelled up alot and had no control over my body changes. \n\nIn good news, my doctor stressed that whatever I did not have my child would steal for me. It's important to eat a balanced diet and to gain a reasonable amount of weight  and your doctor will monitor your partner to ensure their weight/ babies growth continues as per expectations.  \n\nUnfortunately recovery or even simply pausing her disordered habits is very much up to her. She has to be ready. Unfortunately eating disorders can be intergenerational so ideally she will have the drive to do so asap but it may not be that way. \n\nPerhaps you could ask the doctor for nutrition guidance to help your partner hear the importance of intake without outing her condition if she isn't ready?",
      "created_utc": 1681134975.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jfpktbs",
      "author": "Stenuhhh_",
      "body": "I’m currently 8 months pregnant and found out I was pregnant at 4 weeks when I went in for a procedure to get a feeding tube, I was honest immediately with my OB but I would have that discussion with her to talk to her provider about it. While i would be upset if my fiancé had outted me I would eventually understand that he’s looking out for me and the baby. Maybe she can understand. But definitely telling the provider is important and they will help her if it’s a decent provider like mine have. Some days will be hard, but it’s complicated worth it, offer her undivided attention and extra care/support on the hard days. Idk that’s just my “advice” or two cents.",
      "created_utc": 1681142597.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jfppzl3",
      "author": "WarningEmpty",
      "body": "Suggest talking about with the GP together beforehand. Express your concerns in a nonjudgmental way and there’s a good chance her protective instincts will kick in.",
      "created_utc": 1681144659.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jfqjq1t",
      "author": "None",
      "body": "Make it known that you’re concerned for the baby *and* her. Being pregnant will put so much strain on her body that someone with a restrictive eating disorder can’t handle the same as someone without. Let her know the same way you explained to us, that you don’t want it to be an ambush and that it’s for the health of your entire family. Discuss it with her about how the two of you should approach it during the appointment.",
      "created_utc": 1681156273.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jfq2m3o",
      "author": "Doc-mcmuffins",
      "body": "Don't mention anything to your partner's doctor, especially at a time where she's growing a baby, without talking to her about it first and you both being on the same page. She will feel ambushed and may lose some trust in you.",
      "created_utc": 1681149533.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jfp2jn7",
      "author": "sweetparamour79",
      "body": "I am 6 months pp and pregnancy was ROUGH. I had therapy in preparation and still found it mentally very draining as I swelled up alot and had no control over my body changes. \n\nIn good news, my doctor stressed that whatever I did not have my child would steal for me. It's important to eat a balanced diet and to gain a reasonable amount of weight  and your doctor will monitor your partner to ensure their weight/ babies growth continues as per expectations.  \n\nUnfortunately recovery or even simply pausing her disordered habits is very much up to her. She has to be ready. Unfortunately eating disorders can be intergenerational so ideally she will have the drive to do so asap but it may not be that way. \n\nPerhaps you could ask the doctor for nutrition guidance to help your partner hear the importance of intake without outing her condition if she isn't ready?",
      "created_utc": 1681135007.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jfoln7a",
      "author": "kimchiplug",
      "body": "I don’t know the right answer here, but I do know I would feel horribly betrayed if I knew my partner decided to tell this to my doctor behind my back. Im not sure I would confide in them about anything related going forward if they did so (however understandable it might be…EDs make you crazy).\n\nObviously some doctors would be understanding and address it tactfully, but I know more than a few that are super clueless about EDs and would make insensitive comments and/or directly bring up the partner contacted them.\n\nA less aggressive tactic might be to ask clear but neutral questions about nutrition at the appointment. (Not behind her back). What nutrients are needed, what to do if there’s a lot of morning sickness (aka what to do if purging) and can vomiting with morning sickness hurt the baby, what vitals to monitor, etc.",
      "created_utc": 1681125784.0,
      "score": 40,
      "context": [
        {
          "id": "jfoesw4",
          "author": "Getting-better-",
          "body": "That’s really tough. Are you asking if you should bring it up with the doctor or with her when you go for the appointment? If you’re worried she will refuse to go if you address it beforehand I would suggest you private contact you guys’ doctor before the appointment and ask the doctor to ask about eating disorders and bring up the risks of restrictive diets and purging while pregnant. I know from personal experience I am at least a little more willing to hear out facts from a doctor than opinions from people in my personal life.",
          "created_utc": 1681120441.0
        }
      ]
    },
    {
      "id": "jfsm131",
      "author": "Haoma-Health",
      "body": "That's so awesome to hear that you were able to beat your ED, especially while pregnant! I know that must have been really tough, but you're a total inspiration.",
      "created_utc": 1681191320.0,
      "score": 4,
      "context": [
        {
          "id": "jfon43c",
          "author": "Indy_Anna",
          "body": "This is a tough one. I had an ED and when I got pregnant I made a lot of changes, including stopping my ED practices. I hope your wife can find the same strength. As for what you should do, I think you need to sit down and have a frank conversation with her before going to the doctor. I hope she takes it well, good luck.",
          "created_utc": 1681126761.0
        }
      ]
    },
    {
      "id": "jg36yzi",
      "author": "oppositetoup",
      "body": "Tried bringing it up again. She immediately started crying, and told me not to touch her anymore. Then went to the toilet and purged. I genuinely don't know what to do, because all I want to do is help her, and I feel like I'm making it worse.",
      "created_utc": 1681390805.0,
      "score": 1,
      "context": [
        {
          "id": "jfon43c",
          "author": "Indy_Anna",
          "body": "This is a tough one. I had an ED and when I got pregnant I made a lot of changes, including stopping my ED practices. I hope your wife can find the same strength. As for what you should do, I think you need to sit down and have a frank conversation with her before going to the doctor. I hope she takes it well, good luck.",
          "created_utc": 1681126761.0
        }
      ]
    },
    {
      "id": "jg3it09",
      "author": "Indy_Anna",
      "body": "Thank you so much, I really appreciate it. It was very hard but I surprised myself with how much will power I could actually have.",
      "created_utc": 1681395943.0,
      "score": 2,
      "context": [
        {
          "id": "jfon43c",
          "author": "Indy_Anna",
          "body": "This is a tough one. I had an ED and when I got pregnant I made a lot of changes, including stopping my ED practices. I hope your wife can find the same strength. As for what you should do, I think you need to sit down and have a frank conversation with her before going to the doctor. I hope she takes it well, good luck.",
          "created_utc": 1681126761.0
        },
        {
          "id": "jfsm131",
          "author": "Haoma-Health",
          "body": "That's so awesome to hear that you were able to beat your ED, especially while pregnant! I know that must have been really tough, but you're a total inspiration.",
          "created_utc": 1681191320.0
        }
      ]
    },
    {
      "id": "jg3bicp",
      "author": "Indy_Anna",
      "body": "I am so sorry. The hard truth is that if she doesn't want to change, she won't. Continue to be supportive. Suggest a program she can enter to get better. It's not just about her anymore, it's about her and the baby. I hope she can see that. Wishing you both the best.",
      "created_utc": 1681392894.0,
      "score": 1,
      "context": [
        {
          "id": "jfon43c",
          "author": "Indy_Anna",
          "body": "This is a tough one. I had an ED and when I got pregnant I made a lot of changes, including stopping my ED practices. I hope your wife can find the same strength. As for what you should do, I think you need to sit down and have a frank conversation with her before going to the doctor. I hope she takes it well, good luck.",
          "created_utc": 1681126761.0
        },
        {
          "id": "jg36yzi",
          "author": "oppositetoup",
          "body": "Tried bringing it up again. She immediately started crying, and told me not to touch her anymore. Then went to the toilet and purged. I genuinely don't know what to do, because all I want to do is help her, and I feel like I'm making it worse.",
          "created_utc": 1681390805.0
        }
      ]
    }
  ]
}