{
  "id": "12it2ir",
  "subreddit": "EatingDisorders",
  "author": "stupidlavendar",
  "created_utc": 1681238197.0,
  "title": "Recovery is worth it, losing your teeth is not.",
  "selftext": "Hi everyone. \n\nI’m in my first half of college and recovered/in recovery from my eating disorder struggles for all of high school and part of middle school. \n\nWhen i was deep in my anorexia and bulimia, I didn’t care what I did to my body, because I didn’t believe i would live long enough to ever see the consequences. Now that I’m in my 20’s, I feel much different about that sentiment, and am left with reminders of what I went through. \n\nNobody ever warned me about the stretch marks I would get when I returned to a healthy weight. Maybe it’s better they didn’t, but it feels like a constant reminder of how I’ve harmed my body whenever I see them in the mirror. On top of this, I have painful dental problems as a result of my bulimia and have nearly lost multiple teeth. My eating disorder was never worth my health or losing my teeth. \n\nIt feels like my body is trying to remind me what could happen if I relapse. Although i try not to think of it as a punishment. \n\nIf you are struggling with your recovery, I want you to know it is worth it. My only regret is not getting help sooner. Please take care of yourselves, if you believe now you may not live to see the consequences, you could be wrong just like me. You are worth your recovery, friends.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/12it2ir/recovery_is_worth_it_losing_your_teeth_is_not/",
  "score": 59,
  "num_comments": 10,
  "comments": [
    {
      "id": "jfv3vpy",
      "author": "thegameoflovexu",
      "body": "Thanks for sharing your story and the positive words. What you've gone through and the reminders of it must suck, I'm really sorry. For what it's worth, you've encouraged me to keep going :-)",
      "created_utc": 1681239686.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jfz6slr",
      "author": "None",
      "body": "This might sound weird, but I've honestly made peace with my stretch marks and see them more as evidence of how far I've come, not \"scars\" from damaging my body. I think following some carefully chosen body-positive influencers helped (but not ones who focus on weight obviously, people of all shapes and sizes who talk about issues more broadly)\n\nAs for the teeth, that sucks, I hope you're able to access dental care that isn't too expensive.",
      "created_utc": 1681314705.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jfxf3gd",
      "author": "Sulkk3n",
      "body": "I appreciate people like you who open up like this and share the true consequences of partaking in such actions. Sometimes it's uncontrollable, but personally it helps me stop myself sometimes knowing the damage that can be done. I purge, but very infrequently because I've heard the horror stories about doing it on a more regular basis. I don't think anything could convince me at this point to stop restricting, but purging scares me loads. I know they're both horrible for health, but at least I'm sparing myself from losing my dentist-praised teeth😕",
      "created_utc": 1681275975.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jfzr0y2",
      "author": "Prinjack",
      "body": "I relate to this so much. I've already lost a tooth and fear I may lose more. I'm just trying to take every day one step at a time.",
      "created_utc": 1681324466.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jjunsvg",
      "author": "kiwimelanie",
      "body": "I just started getting my teeth fixed not too long ago, as I'm no longer able to chew at all. Nearly all of them have cavities and all my back molars were dead. If I didnt have the benefits I do it would cost 1000's to fix. Sometimes I wake up screaming in pain because of how much my teeth hurt, I wouldn't wish this hell on anyone.",
      "created_utc": 1683882427.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jgrt288",
      "author": "None",
      "body": "i’m just so lost i don’t even know what to do anymore :( i want to stop so badly but i keep waking up the next day and doing the same",
      "created_utc": 1681839979.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jfvz8ti",
      "author": "stupidlavendar",
      "body": "Thank you so much for saying this. Your recovery is important, you can do it. ❤️",
      "created_utc": 1681251924.0,
      "score": 5,
      "context": [
        {
          "id": "jfv3vpy",
          "author": "thegameoflovexu",
          "body": "Thanks for sharing your story and the positive words. What you've gone through and the reminders of it must suck, I'm really sorry. For what it's worth, you've encouraged me to keep going :-)",
          "created_utc": 1681239686.0
        }
      ]
    },
    {
      "id": "jg47ixq",
      "author": "stupidlavendar",
      "body": "thank you for sharing this. that’s a great way to view stretch marks. ❤️",
      "created_utc": 1681405515.0,
      "score": 2,
      "context": [
        {
          "id": "jfz6slr",
          "author": "None",
          "body": "This might sound weird, but I've honestly made peace with my stretch marks and see them more as evidence of how far I've come, not \"scars\" from damaging my body. I think following some carefully chosen body-positive influencers helped (but not ones who focus on weight obviously, people of all shapes and sizes who talk about issues more broadly)\n\nAs for the teeth, that sucks, I hope you're able to access dental care that isn't too expensive.",
          "created_utc": 1681314705.0
        }
      ]
    },
    {
      "id": "jg47unn",
      "author": "stupidlavendar",
      "body": "Maybe it was the mental illness talking, but i genuinely believed i didn’t purge enough to damage my teeth. I always thought “i don’t do it that much. it’s okay.” but i was totally wrong. even a couple times is enough to break the enamel on your teeth. good luck on your recovery. ❤️",
      "created_utc": 1681405639.0,
      "score": 1,
      "context": [
        {
          "id": "jfxf3gd",
          "author": "Sulkk3n",
          "body": "I appreciate people like you who open up like this and share the true consequences of partaking in such actions. Sometimes it's uncontrollable, but personally it helps me stop myself sometimes knowing the damage that can be done. I purge, but very infrequently because I've heard the horror stories about doing it on a more regular basis. I don't think anything could convince me at this point to stop restricting, but purging scares me loads. I know they're both horrible for health, but at least I'm sparing myself from losing my dentist-praised teeth😕",
          "created_utc": 1681275975.0
        }
      ]
    },
    {
      "id": "jg48759",
      "author": "stupidlavendar",
      "body": "Taking it one step at a time is the best you can do. Good luck on your recovery. ❤️",
      "created_utc": 1681405771.0,
      "score": 1,
      "context": [
        {
          "id": "jfzr0y2",
          "author": "Prinjack",
          "body": "I relate to this so much. I've already lost a tooth and fear I may lose more. I'm just trying to take every day one step at a time.",
          "created_utc": 1681324466.0
        }
      ]
    }
  ]
}