{
  "id": "12lhhqn",
  "subreddit": "EatingDisorders",
  "author": "Additional_Day_672",
  "created_utc": 1681441449.0,
  "title": "EDs from things besides weight?",
  "selftext": "It seems the majority of people develop a problem with eating because they’re unhappy with how much or little they weigh and how they appear. I’ve never had issues with weight or appearance. My ED comes from financial trauma and recently because I’ve wanted to shut off my period. Anyone else like me? What does recovery look like for people like this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/12lhhqn/eds_from_things_besides_weight/",
  "score": 40,
  "num_comments": 28,
  "comments": [
    {
      "id": "jg76vit",
      "author": "EnbyYandere",
      "body": "One therapist once told me that I \"swallow my emotions, so of course there's no room for hunger.\"\nIt started with my grandmother started fights right before dinner while I was leaving with them which ruined my hunger. This happened for months and then made me feel like I am undeserving of food.",
      "created_utc": 1681455404.0,
      "score": 37,
      "context": []
    },
    {
      "id": "jg7im69",
      "author": "kayteesays",
      "body": "Mine stems from a brain injury that I got in a car accident when I was 20. I actually don't really care what I look like, and weight is kind of just a number to me. \n\nMy ED manifests more as an OCD type thing that revolves around food, exercise amounts, numbers, etc. \n\nI think deep down it probably also has a little to do with not wanting to age, since I have memory loss from the accident and the idea of waking up older and not remembering it is just so awful to me. \n\nUnfortunately I don't have any recovery advice, but recovery is a very individual thing anyway. You need a good therapist who works well with you and your needs specifically, as well as a medical team for any physical issues.",
      "created_utc": 1681465340.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jg7l8pm",
      "author": "mercurialpanties",
      "body": "I really recommend the book 8 Keys to Recovery from an Eating Disorder. It really helped me a lot, and you'll learn that ED is what manifests from other issues like anxiety or trauma, and sometimes has nothing to do with food.",
      "created_utc": 1681467452.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jg892su",
      "author": "krobie77",
      "body": "Definitely - my therapist likened it to self harm, which sounds obvious, but was a total game changer for me. When I feel guilty, shame, or bad about something, or like a burden to others, I feel like I deserve to physically feel as bad as I believe I am, so I restrict. It allows me to manifest those emotions and have control over them in some way. I have been underweight my whole life not due to restricting, and I have wanted to gain weight my whole life… I could care less how much I weigh as long as it’s over 100 lbs. I also think I’m hypoglycemic now and so even though I have gotten very good at ignoring/being unaware of my hunger cues, I am trying to force myself to eat on a regular schedule again.",
      "created_utc": 1681480462.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jg6w297",
      "author": "mazotori",
      "body": "Mine was from food scarcity and food trauma as a kid",
      "created_utc": 1681447629.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jg7lj01",
      "author": "None",
      "body": "Mine was (partly) because I felt I needed to be cleansed. It was also because I was concerned with my appearance, but going through some trauma that left me feeling dirty is what really made my ED the monster that it was.",
      "created_utc": 1681467674.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jg85shz",
      "author": "DepolluteMeGently",
      "body": "I really feel ya on the wanting to shut off your period thing. As someone assigned female at birth who now identifies as gender non conforming, restricting can make me feel affirmed in my gender because it makes my period and “feminine curves” disappear. It’s not the reason my ED started - that was mostly anxiety and feeling a lack of control over my life - but it’s definitely something that has perpetuated my issues",
      "created_utc": 1681479034.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jg8ad32",
      "author": "quantumqueijadinha",
      "body": "Mine is a control thing - my mom is a very extreme health nut & not the greatest cook, & binging/purging was the only way I could eat anything good growing up while hiding it from her, in my messed up little brain... A lot of my recovery process has been about regaining control over my eating in healthy ways (i.e. doing my own cooking) & avoiding the starvation-binging cycle that came from eating my mom's tiny amounts of food (which according to my dietician weren't even remotely close to meeting my nutritional needs - mom's portions were like 700-1000 calories per day & she absolutely refused to let me cook, even though I'm literally a professional chef), hating it, & then eating like 12 ice cream cones in 5 minutes in a desperate attempt to hide good food from her...",
      "created_utc": 1681481008.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jg7mtqf",
      "author": "princessdirtybunnyy",
      "body": "Mine initially manifested in controlling weight, but its foundation was really an abusive then neglectful childhood with a lot of instability/moving/divorce and remarriage cycles/etc. I guess my mind was desperate for some sort of gd control. So it was kind of about weight but only in the most indirect way because nothing else was really controllable until 4 years into the disorder.",
      "created_utc": 1681468642.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jg89ijo",
      "author": "bonedevourer",
      "body": "I have two eating disorders. One stems from sensory issues due to autism. The other, anorexia, stems from some power thing. I also got addicted to the feeling of being high without drugs (that floaty feeling you get when you haven’t eaten for a very very long time). Weight is involved. It helps to motivate but it’s more about the power of it. The fact nobody knows what’s wrong. I get some sadistic kick out of it I think.",
      "created_utc": 1681480645.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jg90ra9",
      "author": "synchrohobbit",
      "body": "Mine is almost completely about control.  I think most EDs have a deeper cause, although sometimes the focus can be the body.",
      "created_utc": 1681491340.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jg9ag38",
      "author": "GoHighly",
      "body": "My ED is a control thing. When I’m in my feelings and everything is going wrong and I can’t control any of it, at least I can control what goes into my body. Interestingly enough, in therapy today, my therapist posed the question “Do you do that as a way to shame yourself because you think you deserve it?” And I really had to think on that one. If anything I think I’m kind of going on a “hunger strike” of sorts because I’m protesting the treatment I’m receiving or things I’m going through in life.",
      "created_utc": 1681495088.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jg9ccdq",
      "author": "Lou-eez-",
      "body": "It started as losing weight and turned into something way more complicated. Now it's about weight, but also about feeling accomplished, trying to feel some sense of worth, and because I feel like my friends won't care about me unless they have a reason to worry about me",
      "created_utc": 1681495839.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jg9qu92",
      "author": "i_eatfunky",
      "body": "I have never struggled with weight, appearance, or even trauma. To this day, there has been no establishment cause by a counselor/therapist/psychologist/psychiatrist/medical provider or myself.\nI have strong and inconsistent aversions, often lack appetite, and hate feeling full. My mom says I've been this way since I was born.\n\nI have learned that without a known cause it's fairly different to treat/recover from an eating disorder or disordered eating. You might want to look into occupational therapy. It's something I have been considering. It's more centered around developing skills and behaviors to establish and maintain daily function. \n\nI have never really recovered. I'm not even sure it's a real option for me. More than anything, I manage my neurotic eating. I rely on electrolyte supplements, meal replacements, and multivitamins to keep me functional. People close to me have gotten comfortable with my oddities, and I enforce strong boundaries around food with new people.\n\nI'm not saying this is the best approach. I have permanent neurological damage and deterioration to my vision. I've personally just never found any success outside managing this, and doing nothing was no longer an option.",
      "created_utc": 1681501572.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jgacrfd",
      "author": "rashidaaipha",
      "body": "Yep! I have Crohn's. Food is pain so... when I'm flaring I'm not well. \n\nLast time I went into a flare, I went and begged for IV nutrition and my doc referred to it as IBD-rexia XD",
      "created_utc": 1681510677.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgaeua8",
      "author": "Ketamine-pigeon",
      "body": "Sexual trauma. I wanted to starve away my period and sex drive after being raped. I dealt with a lot of shame growing up and sometimes when I think about sex or my body, I want to swallow glass. I can’t though. So I starve because it makes me feel better. It makes me feel clean.",
      "created_utc": 1681511614.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgai5n6",
      "author": "flockyboi",
      "body": "Mine usually stems more from either punishment or feeling like I don't deserve it/spending money on food. My friends have been helping me see that I don't need to punish myself for every little thing and just by existing I am deserving of food. I've had trauma that I'm still unpacking too so I need therapy too",
      "created_utc": 1681513092.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgb1t24",
      "author": "5star-my-notebook",
      "body": "I wasn’t unhappy with my weight or appearance when I was 12 and this first started. I was a perfectionist with low self esteem. I did want to lose weight, but it was because I wanted to be accepted by my peers. I had some really toxic friends and lived in an area with a lot of thin, image obsessed high achievers. I felt so accomplished and even euphoric when I saw the number on the scale go down and it boosted my confidence a ridiculous amount because I was finally “good enough” for myself. I also happened to have a yeast infection at the time, and was told that I could get rid of it naturally by changing my diet instead of having to be checked out by a doctor. I hated my pediatrician and had 0 knowledge on nutrition so I latched onto this advice and threw myself into cutting out a ton of different foods and catapulting into restriction headfirst. Weight grew increasingly meaningful the more that people tried to intervene.",
      "created_utc": 1681522171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgd661o",
      "author": "None",
      "body": "Mine comes from wanting to punish myself/past trauma in my head it seems the more bones and veins I can see “the better job I’m doing” if that makes sense",
      "created_utc": 1681571489.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgd73bi",
      "author": "OkCranberry2346",
      "body": "Mine used to be about my weight and appearance when I was younger. But now it’s more of a coping mechanism for other traumas or to punish myself when I make a mistake at work or in my personal life.",
      "created_utc": 1681571890.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgk1f97",
      "author": "hhhhgxhydcgtd",
      "body": "mine was due to the ADHD medication i am on, and they are known appetite suppressants so for a while i needed to get weighed weekly for them and it kinda stemmed from there",
      "created_utc": 1681694556.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jg9l9i4",
      "author": "Creepy_Ad_3132",
      "body": "Yes! Can't eat when emotional at all, it feels so so wrong.\n\nI'm sorry for your experience x",
      "created_utc": 1681499330.0,
      "score": 6,
      "context": [
        {
          "id": "jg76vit",
          "author": "EnbyYandere",
          "body": "One therapist once told me that I \"swallow my emotions, so of course there's no room for hunger.\"\nIt started with my grandmother started fights right before dinner while I was leaving with them which ruined my hunger. This happened for months and then made me feel like I am undeserving of food.",
          "created_utc": 1681455404.0
        }
      ]
    },
    {
      "id": "jgaewoe",
      "author": "rilakkumkum",
      "body": "That part about swallowing my emotions is essentially how it came about for me. I had long stretches of childhood of being depressed and not being able to say anything about it, so I naturally lost my will to eat. That, along with the time period where it had somewhat a fear of the action of eating. I felt really uncomfortable doing it",
      "created_utc": 1681511643.0,
      "score": 3,
      "context": [
        {
          "id": "jg76vit",
          "author": "EnbyYandere",
          "body": "One therapist once told me that I \"swallow my emotions, so of course there's no room for hunger.\"\nIt started with my grandmother started fights right before dinner while I was leaving with them which ruined my hunger. This happened for months and then made me feel like I am undeserving of food.",
          "created_utc": 1681455404.0
        }
      ]
    },
    {
      "id": "jg7a382",
      "author": "_vudumi",
      "body": "Holy fucking shit",
      "created_utc": 1681458026.0,
      "score": 1,
      "context": [
        {
          "id": "jg76vit",
          "author": "EnbyYandere",
          "body": "One therapist once told me that I \"swallow my emotions, so of course there's no room for hunger.\"\nIt started with my grandmother started fights right before dinner while I was leaving with them which ruined my hunger. This happened for months and then made me feel like I am undeserving of food.",
          "created_utc": 1681455404.0
        }
      ]
    },
    {
      "id": "jg8c3x3",
      "author": "Additional_Day_672",
      "body": "It sucks when most of the food is terrible. I hated everything that I could eat and so it made me way less hungry. I still hate most of it but luckily I was able to convince my family to get me food that I actually like. It’s a huge difference and a big part of me staying consistent and getting a little better. Cooking things is a great idea.",
      "created_utc": 1681481726.0,
      "score": 2,
      "context": [
        {
          "id": "jg8ad32",
          "author": "quantumqueijadinha",
          "body": "Mine is a control thing - my mom is a very extreme health nut & not the greatest cook, & binging/purging was the only way I could eat anything good growing up while hiding it from her, in my messed up little brain... A lot of my recovery process has been about regaining control over my eating in healthy ways (i.e. doing my own cooking) & avoiding the starvation-binging cycle that came from eating my mom's tiny amounts of food (which according to my dietician weren't even remotely close to meeting my nutritional needs - mom's portions were like 700-1000 calories per day & she absolutely refused to let me cook, even though I'm literally a professional chef), hating it, & then eating like 12 ice cream cones in 5 minutes in a desperate attempt to hide good food from her...",
          "created_utc": 1681481008.0
        }
      ]
    },
    {
      "id": "jg9tsq9",
      "author": "Additional_Day_672",
      "body": "That’s really interesting to me. That must suck, wanting to get better and not knowing where to start because you don’t even know what caused it. I always assumed it’d be easy to figure out why someone has disordered eating. It also makes sense that some people rarely feel hungry. Not everyone’s senses or body functions are the same.\n\nI’ve been through occupational therapy a few times and while it wasn’t focused on my ED it’s amazing especially if verbal therapy doesn’t work well. Thanks for reminding me that it exists, I had completely forgotten.",
      "created_utc": 1681502749.0,
      "score": 1,
      "context": [
        {
          "id": "jg9qu92",
          "author": "i_eatfunky",
          "body": "I have never struggled with weight, appearance, or even trauma. To this day, there has been no establishment cause by a counselor/therapist/psychologist/psychiatrist/medical provider or myself.\nI have strong and inconsistent aversions, often lack appetite, and hate feeling full. My mom says I've been this way since I was born.\n\nI have learned that without a known cause it's fairly different to treat/recover from an eating disorder or disordered eating. You might want to look into occupational therapy. It's something I have been considering. It's more centered around developing skills and behaviors to establish and maintain daily function. \n\nI have never really recovered. I'm not even sure it's a real option for me. More than anything, I manage my neurotic eating. I rely on electrolyte supplements, meal replacements, and multivitamins to keep me functional. People close to me have gotten comfortable with my oddities, and I enforce strong boundaries around food with new people.\n\nI'm not saying this is the best approach. I have permanent neurological damage and deterioration to my vision. I've personally just never found any success outside managing this, and doing nothing was no longer an option.",
          "created_utc": 1681501572.0
        }
      ]
    },
    {
      "id": "jga0guv",
      "author": "i_eatfunky",
      "body": "I forgot to mention, talk to your doctor, preferably a gynecologist about your period. There are methods of stopping/limiting your period other than weight. I've done that using birth control. I was told I needed to cycle 3 to 4 times a year. This is based on increased risks associated with not having a period.\n\nI am not a medical provider. I'm sharing a method I've used for you to explore.",
      "created_utc": 1681505431.0,
      "score": 2,
      "context": [
        {
          "id": "jg9qu92",
          "author": "i_eatfunky",
          "body": "I have never struggled with weight, appearance, or even trauma. To this day, there has been no establishment cause by a counselor/therapist/psychologist/psychiatrist/medical provider or myself.\nI have strong and inconsistent aversions, often lack appetite, and hate feeling full. My mom says I've been this way since I was born.\n\nI have learned that without a known cause it's fairly different to treat/recover from an eating disorder or disordered eating. You might want to look into occupational therapy. It's something I have been considering. It's more centered around developing skills and behaviors to establish and maintain daily function. \n\nI have never really recovered. I'm not even sure it's a real option for me. More than anything, I manage my neurotic eating. I rely on electrolyte supplements, meal replacements, and multivitamins to keep me functional. People close to me have gotten comfortable with my oddities, and I enforce strong boundaries around food with new people.\n\nI'm not saying this is the best approach. I have permanent neurological damage and deterioration to my vision. I've personally just never found any success outside managing this, and doing nothing was no longer an option.",
          "created_utc": 1681501572.0
        },
        {
          "id": "jg9tsq9",
          "author": "Additional_Day_672",
          "body": "That’s really interesting to me. That must suck, wanting to get better and not knowing where to start because you don’t even know what caused it. I always assumed it’d be easy to figure out why someone has disordered eating. It also makes sense that some people rarely feel hungry. Not everyone’s senses or body functions are the same.\n\nI’ve been through occupational therapy a few times and while it wasn’t focused on my ED it’s amazing especially if verbal therapy doesn’t work well. Thanks for reminding me that it exists, I had completely forgotten.",
          "created_utc": 1681502749.0
        }
      ]
    }
  ]
}