{
  "id": "12qp098",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1681828344.0,
  "title": "Ate my first big meal in a long time",
  "selftext": "So after a few weeks of feeling nauseous, dizzy and completely empty, I finally decided to cook last night. I was about to pass out on my couch as I usually do when I’m hungry but I knew I’d have to go to work the next day and eat lunch with my coworkers, and I hate the comments I get when I don’t eat so I decided to just make something real quick. Well I ended up making enough for two servings so last night I ate dinner for the first time in a long time. I didn’t even finish the whole plate but I was so full my stomach hurt. \n\nHas anyone else noticed that when you’re anorexic and don’t eat for a long time, when you do it after it feels like your body is regulating itself and suddenly wants more food? I ate a whole meal and an hour later I could feel hunger creeping back, which was wild to me considering I just ate in one sitting what I usually eat in three days.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/12qp098/ate_my_first_big_meal_in_a_long_time/",
  "score": 51,
  "num_comments": 9,
  "comments": [
    {
      "id": "jgrm0z3",
      "author": "Excellent-World-476",
      "body": "That’s normal. Your body is on alert. It finally got food and your brain is urging more because it is so malnourished.",
      "created_utc": 1681837250.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jgrcnlb",
      "author": "Vulnerable_insect",
      "body": "That happens to me too! I manage to fully avoid food for 1-2 day(s) but then once I do eat, I full on binge my meal. I’ll eat twice the amount I normally do and still somewhat feel hungry",
      "created_utc": 1681833659.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jgrcot6",
      "author": "elst3r",
      "body": "Yeah, this has happened to me. It is as if my body is waking up. You could try a snack after eating, but you dont want to make yourself sick after restricting for so long",
      "created_utc": 1681833673.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jgt5r7u",
      "author": "shamallamadingdonger",
      "body": "Yesss. That hunger cue wakes up. During my last refeeding process, I wouldn't be able to finish meals and would feel sick then the hunger cue would hit me like a ton of bricks shortly after. The more regularly you can listen to it, the more regulated your brain and body are. It becomes a lot less intense",
      "created_utc": 1681859202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgtssss",
      "author": "True_Bass6385",
      "body": "Was u bloated?",
      "created_utc": 1681869241.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgtvnft",
      "author": "Fitkratomgirl",
      "body": "YUP, eating induced hunger is super common!",
      "created_utc": 1681870504.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jguuh8i",
      "author": "Sunflowerspecks",
      "body": "Yesss",
      "created_utc": 1681892585.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jgrfxdk",
      "author": "None",
      "body": "Oh so it’s not just me! Right now my goal is to stop going on the scale, but I’m still working on my food intake",
      "created_utc": 1681834923.0,
      "score": 4,
      "context": [
        {
          "id": "jgrcnlb",
          "author": "Vulnerable_insect",
          "body": "That happens to me too! I manage to fully avoid food for 1-2 day(s) but then once I do eat, I full on binge my meal. I’ll eat twice the amount I normally do and still somewhat feel hungry",
          "created_utc": 1681833659.0
        }
      ]
    }
  ]
}