{
  "id": "12vg3zg",
  "subreddit": "EatingDisorders",
  "author": "FinstereGedanken",
  "created_utc": 1682190941.0,
  "title": "My therapist told me to \"just eat\" and I'm so angry. Am I in the wrong?",
  "selftext": "I came in worried and asking for help about my ED because I do not want to relapse and she said, \"just eat\". I was like, \"well, if I could do it I wouldn't be asking for help.\"\n\nSometime later I was discussing again about how I'm worried about it and she asked me why am I so worried. And I was like, \"I just don't want to go down that path again, plus, I'm always hungry, so food is all I think about, but it makes me anxious\". And she asked why it she just told me that I should eat.\n\nI just want to know if I'm in the right for thinking that she is not the right therapist for me or if I'm exaggerating. Is it",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/12vg3zg/my_therapist_told_me_to_just_eat_and_im_so_angry/",
  "score": 60,
  "num_comments": 36,
  "comments": [
    {
      "id": "jhbaygd",
      "author": "Excellent-World-476",
      "body": "Can you talk to her about your anger and thoughts about how you felt with her response?  My therapist is pretty in your face and straight to the point that might seem insensitive but is actually part of her therapeutic technique. If it stings me, I talk to her about it. Yes she might be the right therapist. Conversely this might be a great chance to change how you communicate.",
      "created_utc": 1682196295.0,
      "score": 20,
      "context": []
    },
    {
      "id": "jhb9do3",
      "author": "Proerytroblast",
      "body": "In theory, ***it is*** the answer. If your ED was restrictive, what you're feeling now is probably *extreme hunger* \\- your body's way of of ensuring that the food is not only available in this very moment but will be in the long run (in short - your body's gonna try to store as much energy as it can in case it's just temporary) - meaning after a longer time of \"just eating\" it should stop. What you should also know is that yes, you can (and probably will) feel bad about it; yes, you will probably feel sick from all the food more than once and yes, it will feel like it's never gonna stop. But the more you try to fight it - the stronger it will come back.\n\n&#x200B;\n\n&#x200B;\n\nDoesn't cancel the fact that it was a shitty way of bringing it up to you and not explaining shit. Quite an awful therapist if I'm being honest.",
      "created_utc": 1682195600.0,
      "score": 31,
      "context": []
    },
    {
      "id": "jhbklvf",
      "author": "cleanhouz",
      "body": "I hear it's hard to find ED informed therapists outside of the cities. My therapist isn't Trained in ED but she knows that limitation and helps me find resources when appropriate. \n\nIt's important to note that your therapist isn't trying to be harmful, they just don't understand. Not that that makes it any better.",
      "created_utc": 1682200484.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jhcoowh",
      "author": "basketballbabe777",
      "body": "I literally fired a therapist over her telling me that I was delusional for only eating a slice of pie and cup of yogurt every day. I went to her with the Intention to heal from my anorexia as well as other things but I didn’t feel her approach was right and your therapist is reminding me of her. I’d fire her. You deserve support and understanding, not someone who is going to pick you apart. You’re very brave and courageous to go to therapy and I hope you find someone who will give you what you deserve. I’m so sorry you had this experience and if you ever need someone to talk with my dms are open.\n\nAlso I fired my therapist over email because I’m super non confrontational and I couldn’t do it face to face. Even email was hard. It took me like 3 days to work up to it.",
      "created_utc": 1682220536.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jhd9nrr",
      "author": "wazuyumi",
      "body": "technically it is what you need to do but that is so wrong to say. she could’ve worded it better(?) or just not said it. saying that is so insensitive",
      "created_utc": 1682235086.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jhdyf4j",
      "author": "lekurumayu",
      "body": "Technically it is true, but from a therapist it is really something that would drive me mad because it's the whole problem: I know I should eat more, my mom cooks for me, but I can't finish a plate and I used to think about food so much I couldn't do anything because calories where all I could concentrate on. It's like telling someone who just took their plaster off their feet to walk to feel better: technically it's true, on reality it is super hard, painful, and they won't be able to walk long without help or stopping.",
      "created_utc": 1682254449.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jhbwpqo",
      "author": "Anypega",
      "body": "You have done nothing wrong, either tell her u didn’t like that comment or  ditch her",
      "created_utc": 1682206354.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhcqwmc",
      "author": "FrankieVallieN4",
      "body": "If you feel like they don’t understand, explain what you’re feeling and what makes it difficult. Everyone has their own feelings and reasons behind our disorders and addictions. \n\nA therapist could be well versed in ED and say this to just challenge you. There’s something to be said about giving a “typical response” to an irrational thought process, instead of normalizing and relating to your thought process.",
      "created_utc": 1682221754.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhd19td",
      "author": "None",
      "body": "No. You need a new therapist who actually understands eating disorders. If it was as simple as \"just eat\", you wouldn't have an eating disorder. \n\nI heard something similar from a disability manager once (who, albeit is not a counsellor/therapist, but still is required to address reasons for going on disability), she said \"well why can't you just eat?\" or something similar, as if it was something I just hadn't thought of. Talking about my ED with a total stranger over the phone was hard enough, but to have her say that to me was just awful. My sister is the VP of HR for a large company and when I told her (far after the fact), she said that I should have reported the woman, and that she herself would have fired her if that was her employee, because of how utterly inappropriate and insensitive it was.\n\nTL;DR - you need a new therapist. You are not overreacting.",
      "created_utc": 1682228355.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhd50nb",
      "author": "Ok_Friend8779",
      "body": "NO! You are absolutely not in the wrong. I know a lot of people look towards doctors for guidance on anything and everything. People don't realize doctors have specialties for a reason. You wouldn't go to your dermatologist for a gyno issue. Sometimes doctors don't realize how fucking clueless they really are. When I was just a couple years into my ED I had a doctor tell me that I would probably \"grow out of it once I got older and priorities straighten out\" .... like dude wtf kinda comment is that??? Cause I'm about to turn 32 and my priorities are pretty straight, but I promise I still struggle and obsess constantly.",
      "created_utc": 1682231232.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhd9jq3",
      "author": "kimchiplug",
      "body": "Ugh you shouldn’t have to teach a clueless poorly trained therapist about EDs but it happens way too often",
      "created_utc": 1682234988.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhdalnl",
      "author": "True-Godess",
      "body": "Life is 15% what happens to you and 85% how you react to it. \nIs he/she an ED specialist?\nEither way if you see them again definitely say that what they said upset you. Shrinks love discussing crap like that. Don’t let them rent space in your head!\nThis lady def doesn’t have a grasp on ED if that’s all advice she gave you. Like telling a heroin addict who is on verge of relapse to just not do drugs. She sounds uneducated and uninformed about the issue that’s most bothering you. \nTherapists are like antidepressants you have to keep trying till u find the one that works for you.",
      "created_utc": 1682235888.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhdxigl",
      "author": "houston_veronica",
      "body": "Your feelings are real, and in my experience, a lack of respect for my Therapist would make it more likely for me to reject their opinions, even if not consciously.  A therapist that I find amiable (regardless of what range of directness I may find preferable) would likely be someone I consider talented in their field. Therefore, yes, I would want to do right by them, if that makes sense. (I'm a pleaser, surprise!)\nBut the thing to remember is:\n- EDs that worsen will eventually preclude your mind from thinking properly, so in some sense, therapists are the ones who have to uphold reality.If the T got off to a solid start with the client, the client should ultimately trust their T.  \n- Saying \"just eat\" is poor because it reflects a sense of being tired of you/the person with the ED. It just hearkens to a parent trying to tell their kid \"Just behave.\"  -- what does \"just eat\" mean?  \n1. \"OP, sticking with your meal plan will definitely help you start to see things more clearly. I promise you are not remotely at risk of gaining endless weight, and you know that I promised you I would be honest with you.\"\n2. \"Let's talk strategies about how you would feel more likely to eat; can you find a person to eat your meals with? When you see them eating normally, it will remind you that eating normally is not equal to weight gain. Watch how they eat - they just do it without thinking. That is our goal for you.  Someday, you will get there and it really will be easy to just...eat.\"\n\n^^ Those are comments that I could say are more powerful to ME, but that's just my opinion. \nBTW, anytime people say \"just (anything)\", it's always when there is a herculean task involved.  \"Just go to sleep\" (to an insomniac or a fussy child).  \"Just get off my case.\" (when you are super angry and not likely to drop the issue)  \"Just study harder\".  \n\nI hope you don't feel alone in your feelings, OP. They are not \"right\" or \"wrong\", they just are.",
      "created_utc": 1682253931.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhecvlk",
      "author": "pistolpxte",
      "body": "Have you considered finding someone who specializes in trauma therapy? That was the key for me. My LCSW is one of the most compassionate and caring humans I’ve ever met. She’s been integral in my recovery process.",
      "created_utc": 1682261433.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jher4hl",
      "author": "nitesead",
      "body": "She is not the right therapist for you.  I think you need a therapist who is certified in eating disorder treatment, if that is a designation where you live.",
      "created_utc": 1682267495.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhez23z",
      "author": "Miliaa",
      "body": "It’s probably not the best way of articulating a path forward for you but to be fair it was the same conclusion I eventually came to with my eating issues. Which was intense consistent lack of eating from stress. I kept trying to research and find some magical easier path towards healing when literally the answer is you just have to eat something lol. I’d bring it up with your therapist, if you guys can resolve it and create some improved ideas for better communication going forward then I wouldn’t leave the therapist over this one thing",
      "created_utc": 1682270796.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhfb0jl",
      "author": "FinstereGedanken",
      "body": "she is a psychoanalyst, so in theory she explained to me that her technique was going to be asking questions to understand or to guide. she had never said anything like this before. I did not start therapy for ED originally, though.",
      "created_utc": 1682275651.0,
      "score": 1,
      "context": [
        {
          "id": "jhbaygd",
          "author": "Excellent-World-476",
          "body": "Can you talk to her about your anger and thoughts about how you felt with her response?  My therapist is pretty in your face and straight to the point that might seem insensitive but is actually part of her therapeutic technique. If it stings me, I talk to her about it. Yes she might be the right therapist. Conversely this might be a great chance to change how you communicate.",
          "created_utc": 1682196295.0
        }
      ]
    },
    {
      "id": "jhdbdz8",
      "author": "True-Godess",
      "body": "I disagree with you. That’s like telling a heroin addict on brink of relapse to just don’t use. It’s a oversimplification of a very complicated problem considering with EDs you still have to eat food and addiction you can never use again. Also like my example she knows/could of told herself that. Doesn’t need to pay a person to say that. She should of asked more about the anxiety it brings up and what type and what has she used to cope both successfully and unsuccessfully in past and suggested different CBT or meditive or other ways to squash the anxiety before it becomes overwhelming to the point of her relapsing Or using unhealthy coping mechanisms. \n\nJust eat is what I would expect an ignorant parent to say not a trained professional.",
      "created_utc": 1682236557.0,
      "score": 5,
      "context": [
        {
          "id": "jhb9do3",
          "author": "Proerytroblast",
          "body": "In theory, ***it is*** the answer. If your ED was restrictive, what you're feeling now is probably *extreme hunger* \\- your body's way of of ensuring that the food is not only available in this very moment but will be in the long run (in short - your body's gonna try to store as much energy as it can in case it's just temporary) - meaning after a longer time of \"just eating\" it should stop. What you should also know is that yes, you can (and probably will) feel bad about it; yes, you will probably feel sick from all the food more than once and yes, it will feel like it's never gonna stop. But the more you try to fight it - the stronger it will come back.\n\n&#x200B;\n\n&#x200B;\n\nDoesn't cancel the fact that it was a shitty way of bringing it up to you and not explaining shit. Quite an awful therapist if I'm being honest.",
          "created_utc": 1682195600.0
        }
      ]
    },
    {
      "id": "jhfbku0",
      "author": "FinstereGedanken",
      "body": "thank you. It does help a bit to stop being so angry knowing that she didn't mean harm. Originally I did not start therapy due to ED, it is something that started existing again during therapy, so I didn't research her with ED in mind. I'm going to look for an experienced therapist next time.",
      "created_utc": 1682275882.0,
      "score": 2,
      "context": [
        {
          "id": "jhbklvf",
          "author": "cleanhouz",
          "body": "I hear it's hard to find ED informed therapists outside of the cities. My therapist isn't Trained in ED but she knows that limitation and helps me find resources when appropriate. \n\nIt's important to note that your therapist isn't trying to be harmful, they just don't understand. Not that that makes it any better.",
          "created_utc": 1682200484.0
        }
      ]
    },
    {
      "id": "jhcqfk1",
      "author": "FrankieVallieN4",
      "body": "Therapists are providing you a service, they are not hired by you, so you didn’t fire her. \n\nIt is true that only eating a slice of pie and a cup of yogurt a day is unhealthy and likely the result of a delusion like BDD. \n\nSome therapists are blunt, and some therapists are softer. I think that for a lot people blunt honestly might be best because it’s not sugar coating your issue like a lot of people close to you might do. \n\nThe only thing that helped me in overcoming my ED as a teen (of course it rears it’s head from time to time still) was people in my life giving honest responses and reactions, and not comforting and enabling my behavior.",
      "created_utc": 1682221488.0,
      "score": 3,
      "context": [
        {
          "id": "jhcoowh",
          "author": "basketballbabe777",
          "body": "I literally fired a therapist over her telling me that I was delusional for only eating a slice of pie and cup of yogurt every day. I went to her with the Intention to heal from my anorexia as well as other things but I didn’t feel her approach was right and your therapist is reminding me of her. I’d fire her. You deserve support and understanding, not someone who is going to pick you apart. You’re very brave and courageous to go to therapy and I hope you find someone who will give you what you deserve. I’m so sorry you had this experience and if you ever need someone to talk with my dms are open.\n\nAlso I fired my therapist over email because I’m super non confrontational and I couldn’t do it face to face. Even email was hard. It took me like 3 days to work up to it.",
          "created_utc": 1682220536.0
        }
      ]
    },
    {
      "id": "jhfc03w",
      "author": "FinstereGedanken",
      "body": "I think she was getting frustrated because I am relapsing in many aspects and was telling her that I'm considering CBT / DBT instead of psychoanalysis because I need something more actionable in this moment. she also said something like, \"If I already told you to eat, why don't you do it? Why is it so complicated?\"",
      "created_utc": 1682276058.0,
      "score": 2,
      "context": [
        {
          "id": "jhd9nrr",
          "author": "wazuyumi",
          "body": "technically it is what you need to do but that is so wrong to say. she could’ve worded it better(?) or just not said it. saying that is so insensitive",
          "created_utc": 1682235086.0
        }
      ]
    },
    {
      "id": "jhfca86",
      "author": "FinstereGedanken",
      "body": "unfortunately, she isn't well versed in ED. I didn't consider it as s criterion when looking for a therapist because some months ago I wasn't relapsing.",
      "created_utc": 1682276173.0,
      "score": 1,
      "context": [
        {
          "id": "jhcqwmc",
          "author": "FrankieVallieN4",
          "body": "If you feel like they don’t understand, explain what you’re feeling and what makes it difficult. Everyone has their own feelings and reasons behind our disorders and addictions. \n\nA therapist could be well versed in ED and say this to just challenge you. There’s something to be said about giving a “typical response” to an irrational thought process, instead of normalizing and relating to your thought process.",
          "created_utc": 1682221754.0
        }
      ]
    },
    {
      "id": "jhfcnn3",
      "author": "FinstereGedanken",
      "body": "wow, WTF with that comment from your doctor. I think you're right about the specialities. I asked my therapist if CBT or DBT would be better in my situation and she just asked what I would like her to say to me, to which I replied that I was seriously looking for her professional opinion as I want to make the best informed decisions for my health. I just wish that she would help me explore other options instead of shutting down.",
      "created_utc": 1682276326.0,
      "score": 2,
      "context": [
        {
          "id": "jhd50nb",
          "author": "Ok_Friend8779",
          "body": "NO! You are absolutely not in the wrong. I know a lot of people look towards doctors for guidance on anything and everything. People don't realize doctors have specialties for a reason. You wouldn't go to your dermatologist for a gyno issue. Sometimes doctors don't realize how fucking clueless they really are. When I was just a couple years into my ED I had a doctor tell me that I would probably \"grow out of it once I got older and priorities straighten out\" .... like dude wtf kinda comment is that??? Cause I'm about to turn 32 and my priorities are pretty straight, but I promise I still struggle and obsess constantly.",
          "created_utc": 1682231232.0
        }
      ]
    },
    {
      "id": "jhfcyvg",
      "author": "FinstereGedanken",
      "body": "no, she is not an ED specialist, because I did not have the active relapse when looking for a therapist, it just happened during the therapeutic process. \n\nI will keep looking for a different one, definitely.",
      "created_utc": 1682276457.0,
      "score": 1,
      "context": [
        {
          "id": "jhdalnl",
          "author": "True-Godess",
          "body": "Life is 15% what happens to you and 85% how you react to it. \nIs he/she an ED specialist?\nEither way if you see them again definitely say that what they said upset you. Shrinks love discussing crap like that. Don’t let them rent space in your head!\nThis lady def doesn’t have a grasp on ED if that’s all advice she gave you. Like telling a heroin addict who is on verge of relapse to just not do drugs. She sounds uneducated and uninformed about the issue that’s most bothering you. \nTherapists are like antidepressants you have to keep trying till u find the one that works for you.",
          "created_utc": 1682235888.0
        }
      ]
    },
    {
      "id": "jhfdjea",
      "author": "FinstereGedanken",
      "body": "thank you for reminding me that feelings just are. that's something I learned in a previous DBT therapy that is helpful.\n\nthis therapist is a psychoanalyst and I told her that I don't think that this approach works any longer for me because relapsing in ED and other destructive behaviors limits my ability to self-reflect and to think clearly and that I do not think I can psychoanalyze my way out of the relapse, but that I need CBT or DBT tools (and asked for her professional opinion, which she refused to provide).",
      "created_utc": 1682276702.0,
      "score": 1,
      "context": [
        {
          "id": "jhdxigl",
          "author": "houston_veronica",
          "body": "Your feelings are real, and in my experience, a lack of respect for my Therapist would make it more likely for me to reject their opinions, even if not consciously.  A therapist that I find amiable (regardless of what range of directness I may find preferable) would likely be someone I consider talented in their field. Therefore, yes, I would want to do right by them, if that makes sense. (I'm a pleaser, surprise!)\nBut the thing to remember is:\n- EDs that worsen will eventually preclude your mind from thinking properly, so in some sense, therapists are the ones who have to uphold reality.If the T got off to a solid start with the client, the client should ultimately trust their T.  \n- Saying \"just eat\" is poor because it reflects a sense of being tired of you/the person with the ED. It just hearkens to a parent trying to tell their kid \"Just behave.\"  -- what does \"just eat\" mean?  \n1. \"OP, sticking with your meal plan will definitely help you start to see things more clearly. I promise you are not remotely at risk of gaining endless weight, and you know that I promised you I would be honest with you.\"\n2. \"Let's talk strategies about how you would feel more likely to eat; can you find a person to eat your meals with? When you see them eating normally, it will remind you that eating normally is not equal to weight gain. Watch how they eat - they just do it without thinking. That is our goal for you.  Someday, you will get there and it really will be easy to just...eat.\"\n\n^^ Those are comments that I could say are more powerful to ME, but that's just my opinion. \nBTW, anytime people say \"just (anything)\", it's always when there is a herculean task involved.  \"Just go to sleep\" (to an insomniac or a fussy child).  \"Just get off my case.\" (when you are super angry and not likely to drop the issue)  \"Just study harder\".  \n\nI hope you don't feel alone in your feelings, OP. They are not \"right\" or \"wrong\", they just are.",
          "created_utc": 1682253931.0
        }
      ]
    },
    {
      "id": "jhfdmno",
      "author": "FinstereGedanken",
      "body": "thank you for the recommendation. I had not consider it as I didn't even know it was a speciality. going to see if they existing my country.",
      "created_utc": 1682276739.0,
      "score": 1,
      "context": [
        {
          "id": "jhecvlk",
          "author": "pistolpxte",
          "body": "Have you considered finding someone who specializes in trauma therapy? That was the key for me. My LCSW is one of the most compassionate and caring humans I’ve ever met. She’s been integral in my recovery process.",
          "created_utc": 1682261433.0
        }
      ]
    },
    {
      "id": "jhfbcms",
      "author": "FinstereGedanken",
      "body": "I asked if CBT / DBT would be more suitable for me in my situation, and she asked me what I would like her to answer; I said that I wanted to gather information to make the best decisions for myself and she just said that CBT / DBT is not her discipline.",
      "created_utc": 1682275789.0,
      "score": 2,
      "context": [
        {
          "id": "jhb9do3",
          "author": "Proerytroblast",
          "body": "In theory, ***it is*** the answer. If your ED was restrictive, what you're feeling now is probably *extreme hunger* \\- your body's way of of ensuring that the food is not only available in this very moment but will be in the long run (in short - your body's gonna try to store as much energy as it can in case it's just temporary) - meaning after a longer time of \"just eating\" it should stop. What you should also know is that yes, you can (and probably will) feel bad about it; yes, you will probably feel sick from all the food more than once and yes, it will feel like it's never gonna stop. But the more you try to fight it - the stronger it will come back.\n\n&#x200B;\n\n&#x200B;\n\nDoesn't cancel the fact that it was a shitty way of bringing it up to you and not explaining shit. Quite an awful therapist if I'm being honest.",
          "created_utc": 1682195600.0
        },
        {
          "id": "jhdbdz8",
          "author": "True-Godess",
          "body": "I disagree with you. That’s like telling a heroin addict on brink of relapse to just don’t use. It’s a oversimplification of a very complicated problem considering with EDs you still have to eat food and addiction you can never use again. Also like my example she knows/could of told herself that. Doesn’t need to pay a person to say that. She should of asked more about the anxiety it brings up and what type and what has she used to cope both successfully and unsuccessfully in past and suggested different CBT or meditive or other ways to squash the anxiety before it becomes overwhelming to the point of her relapsing Or using unhealthy coping mechanisms. \n\nJust eat is what I would expect an ignorant parent to say not a trained professional.",
          "created_utc": 1682236557.0
        }
      ]
    },
    {
      "id": "jhdhtum",
      "author": "Proerytroblast",
      "body": ">Just eat is what I would expect an ignorant parent to say not a trained professional.\n\nYou're free to read the last sentence of my comment again because you clearly missed that I guess.\n\n&#x200B;\n\nSecond of all, heroin addiction is NOT an equivalent - you don't need heroin to live but you NEED food to live. If your body's in a fight or flight state 24/7 it will work like this. You can't get out of a disorder while having restrictive/guilty thoughts, once you've entered the ED zone there's no going back in any other way and relapsing is very easy once you want to restrict again.",
      "created_utc": 1682242243.0,
      "score": 2,
      "context": [
        {
          "id": "jhb9do3",
          "author": "Proerytroblast",
          "body": "In theory, ***it is*** the answer. If your ED was restrictive, what you're feeling now is probably *extreme hunger* \\- your body's way of of ensuring that the food is not only available in this very moment but will be in the long run (in short - your body's gonna try to store as much energy as it can in case it's just temporary) - meaning after a longer time of \"just eating\" it should stop. What you should also know is that yes, you can (and probably will) feel bad about it; yes, you will probably feel sick from all the food more than once and yes, it will feel like it's never gonna stop. But the more you try to fight it - the stronger it will come back.\n\n&#x200B;\n\n&#x200B;\n\nDoesn't cancel the fact that it was a shitty way of bringing it up to you and not explaining shit. Quite an awful therapist if I'm being honest.",
          "created_utc": 1682195600.0
        },
        {
          "id": "jhdbdz8",
          "author": "True-Godess",
          "body": "I disagree with you. That’s like telling a heroin addict on brink of relapse to just don’t use. It’s a oversimplification of a very complicated problem considering with EDs you still have to eat food and addiction you can never use again. Also like my example she knows/could of told herself that. Doesn’t need to pay a person to say that. She should of asked more about the anxiety it brings up and what type and what has she used to cope both successfully and unsuccessfully in past and suggested different CBT or meditive or other ways to squash the anxiety before it becomes overwhelming to the point of her relapsing Or using unhealthy coping mechanisms. \n\nJust eat is what I would expect an ignorant parent to say not a trained professional.",
          "created_utc": 1682236557.0
        }
      ]
    },
    {
      "id": "jhd27y6",
      "author": "None",
      "body": "I sought out my therapist, and I pay her, so I'm pretty sure that means I can also choose to stop using her services. You're picking on semantics.\n\nThat's great that that direct method was helpful for you, but that is not the case for everyone, and obviously not the case for the OP. \n\nMy therapist is direct, and asks me the tough questions, but she most certainly doesn't comfort me and enable my behaviour, rather, she is supportive of my wins, big or small, and encourages positive behaviours. She doesn't make me defensive and feel criticized, which it sounds like OP's did. I've had therapists like that in the past and I just ended up lying to them, which was pointless. \n\nThe same treatment doesn't work for everyone, and you shouldn't make that assumption. Also, please don't diagnose someone based on a comment they made. That's inappropriate and uninformed.",
      "created_utc": 1682229049.0,
      "score": 4,
      "context": [
        {
          "id": "jhcoowh",
          "author": "basketballbabe777",
          "body": "I literally fired a therapist over her telling me that I was delusional for only eating a slice of pie and cup of yogurt every day. I went to her with the Intention to heal from my anorexia as well as other things but I didn’t feel her approach was right and your therapist is reminding me of her. I’d fire her. You deserve support and understanding, not someone who is going to pick you apart. You’re very brave and courageous to go to therapy and I hope you find someone who will give you what you deserve. I’m so sorry you had this experience and if you ever need someone to talk with my dms are open.\n\nAlso I fired my therapist over email because I’m super non confrontational and I couldn’t do it face to face. Even email was hard. It took me like 3 days to work up to it.",
          "created_utc": 1682220536.0
        },
        {
          "id": "jhcqfk1",
          "author": "FrankieVallieN4",
          "body": "Therapists are providing you a service, they are not hired by you, so you didn’t fire her. \n\nIt is true that only eating a slice of pie and a cup of yogurt a day is unhealthy and likely the result of a delusion like BDD. \n\nSome therapists are blunt, and some therapists are softer. I think that for a lot people blunt honestly might be best because it’s not sugar coating your issue like a lot of people close to you might do. \n\nThe only thing that helped me in overcoming my ED as a teen (of course it rears it’s head from time to time still) was people in my life giving honest responses and reactions, and not comforting and enabling my behavior.",
          "created_utc": 1682221488.0
        }
      ]
    },
    {
      "id": "jhdvon6",
      "author": "houston_veronica",
      "body": "What are you doing, correcting someone's interpretation of the word \"fired\"? This is not the Work forum. Why do you care how this person has chosen to say that she released her therapist...bizarre.",
      "created_utc": 1682252838.0,
      "score": 2,
      "context": [
        {
          "id": "jhcoowh",
          "author": "basketballbabe777",
          "body": "I literally fired a therapist over her telling me that I was delusional for only eating a slice of pie and cup of yogurt every day. I went to her with the Intention to heal from my anorexia as well as other things but I didn’t feel her approach was right and your therapist is reminding me of her. I’d fire her. You deserve support and understanding, not someone who is going to pick you apart. You’re very brave and courageous to go to therapy and I hope you find someone who will give you what you deserve. I’m so sorry you had this experience and if you ever need someone to talk with my dms are open.\n\nAlso I fired my therapist over email because I’m super non confrontational and I couldn’t do it face to face. Even email was hard. It took me like 3 days to work up to it.",
          "created_utc": 1682220536.0
        },
        {
          "id": "jhcqfk1",
          "author": "FrankieVallieN4",
          "body": "Therapists are providing you a service, they are not hired by you, so you didn’t fire her. \n\nIt is true that only eating a slice of pie and a cup of yogurt a day is unhealthy and likely the result of a delusion like BDD. \n\nSome therapists are blunt, and some therapists are softer. I think that for a lot people blunt honestly might be best because it’s not sugar coating your issue like a lot of people close to you might do. \n\nThe only thing that helped me in overcoming my ED as a teen (of course it rears it’s head from time to time still) was people in my life giving honest responses and reactions, and not comforting and enabling my behavior.",
          "created_utc": 1682221488.0
        }
      ]
    },
    {
      "id": "jhmq190",
      "author": "wazuyumi",
      "body": "maybe you should talk to her about the comments she made and if she keeps talking like this, try to find another one.",
      "created_utc": 1682413764.0,
      "score": 1,
      "context": [
        {
          "id": "jhd9nrr",
          "author": "wazuyumi",
          "body": "technically it is what you need to do but that is so wrong to say. she could’ve worded it better(?) or just not said it. saying that is so insensitive",
          "created_utc": 1682235086.0
        },
        {
          "id": "jhfc03w",
          "author": "FinstereGedanken",
          "body": "I think she was getting frustrated because I am relapsing in many aspects and was telling her that I'm considering CBT / DBT instead of psychoanalysis because I need something more actionable in this moment. she also said something like, \"If I already told you to eat, why don't you do it? Why is it so complicated?\"",
          "created_utc": 1682276058.0
        }
      ]
    },
    {
      "id": "jhrfh64",
      "author": "Ok_Friend8779",
      "body": "Personally CBT has worked better. I'm fully aware how messed up my thoughts process is and behaviors can be. I know that sounds opposite, but I've aways realized what I think and do is messed up and not normal. It's putting the rest into action is what seems impossible.",
      "created_utc": 1682497803.0,
      "score": 1,
      "context": [
        {
          "id": "jhd50nb",
          "author": "Ok_Friend8779",
          "body": "NO! You are absolutely not in the wrong. I know a lot of people look towards doctors for guidance on anything and everything. People don't realize doctors have specialties for a reason. You wouldn't go to your dermatologist for a gyno issue. Sometimes doctors don't realize how fucking clueless they really are. When I was just a couple years into my ED I had a doctor tell me that I would probably \"grow out of it once I got older and priorities straighten out\" .... like dude wtf kinda comment is that??? Cause I'm about to turn 32 and my priorities are pretty straight, but I promise I still struggle and obsess constantly.",
          "created_utc": 1682231232.0
        },
        {
          "id": "jhfcnn3",
          "author": "FinstereGedanken",
          "body": "wow, WTF with that comment from your doctor. I think you're right about the specialities. I asked my therapist if CBT or DBT would be better in my situation and she just asked what I would like her to say to me, to which I replied that I was seriously looking for her professional opinion as I want to make the best informed decisions for my health. I just wish that she would help me explore other options instead of shutting down.",
          "created_utc": 1682276326.0
        }
      ]
    },
    {
      "id": "jhfeijp",
      "author": "True-Godess",
      "body": "Wow. So unprofessional. What is her title exactly? I’d say so what is your discipline then because so far you’ve just been parroting my questions back to me and have been as helpful as a pamphlet.  Even if she takes the more Freudian approach she should still have studied the various aspects of therapy dynamics. \nShe sounds lazy and not a good fit for you or anyone. I’d report her if I were you. I’ve worked as a assistant counselor with a dual BA in psychology and anthropology and if patients had issues I wasn’t familiar with I’d make a point to research it and most effective treatments. \nFirst you need proper diagnosis by psychiatrist or psychologist.",
      "created_utc": 1682277111.0,
      "score": 2,
      "context": [
        {
          "id": "jhb9do3",
          "author": "Proerytroblast",
          "body": "In theory, ***it is*** the answer. If your ED was restrictive, what you're feeling now is probably *extreme hunger* \\- your body's way of of ensuring that the food is not only available in this very moment but will be in the long run (in short - your body's gonna try to store as much energy as it can in case it's just temporary) - meaning after a longer time of \"just eating\" it should stop. What you should also know is that yes, you can (and probably will) feel bad about it; yes, you will probably feel sick from all the food more than once and yes, it will feel like it's never gonna stop. But the more you try to fight it - the stronger it will come back.\n\n&#x200B;\n\n&#x200B;\n\nDoesn't cancel the fact that it was a shitty way of bringing it up to you and not explaining shit. Quite an awful therapist if I'm being honest.",
          "created_utc": 1682195600.0
        },
        {
          "id": "jhdbdz8",
          "author": "True-Godess",
          "body": "I disagree with you. That’s like telling a heroin addict on brink of relapse to just don’t use. It’s a oversimplification of a very complicated problem considering with EDs you still have to eat food and addiction you can never use again. Also like my example she knows/could of told herself that. Doesn’t need to pay a person to say that. She should of asked more about the anxiety it brings up and what type and what has she used to cope both successfully and unsuccessfully in past and suggested different CBT or meditive or other ways to squash the anxiety before it becomes overwhelming to the point of her relapsing Or using unhealthy coping mechanisms. \n\nJust eat is what I would expect an ignorant parent to say not a trained professional.",
          "created_utc": 1682236557.0
        },
        {
          "id": "jhfbcms",
          "author": "FinstereGedanken",
          "body": "I asked if CBT / DBT would be more suitable for me in my situation, and she asked me what I would like her to answer; I said that I wanted to gather information to make the best decisions for myself and she just said that CBT / DBT is not her discipline.",
          "created_utc": 1682275789.0
        }
      ]
    },
    {
      "id": "jhe46oc",
      "author": "FrankieVallieN4",
      "body": "I didn’t diagnose anyone. I wasn’t picking at semantics. And it’s important to understand that while you see a therapist for help, you are not their boss.",
      "created_utc": 1682257437.0,
      "score": 0,
      "context": [
        {
          "id": "jhcoowh",
          "author": "basketballbabe777",
          "body": "I literally fired a therapist over her telling me that I was delusional for only eating a slice of pie and cup of yogurt every day. I went to her with the Intention to heal from my anorexia as well as other things but I didn’t feel her approach was right and your therapist is reminding me of her. I’d fire her. You deserve support and understanding, not someone who is going to pick you apart. You’re very brave and courageous to go to therapy and I hope you find someone who will give you what you deserve. I’m so sorry you had this experience and if you ever need someone to talk with my dms are open.\n\nAlso I fired my therapist over email because I’m super non confrontational and I couldn’t do it face to face. Even email was hard. It took me like 3 days to work up to it.",
          "created_utc": 1682220536.0
        },
        {
          "id": "jhcqfk1",
          "author": "FrankieVallieN4",
          "body": "Therapists are providing you a service, they are not hired by you, so you didn’t fire her. \n\nIt is true that only eating a slice of pie and a cup of yogurt a day is unhealthy and likely the result of a delusion like BDD. \n\nSome therapists are blunt, and some therapists are softer. I think that for a lot people blunt honestly might be best because it’s not sugar coating your issue like a lot of people close to you might do. \n\nThe only thing that helped me in overcoming my ED as a teen (of course it rears it’s head from time to time still) was people in my life giving honest responses and reactions, and not comforting and enabling my behavior.",
          "created_utc": 1682221488.0
        },
        {
          "id": "jhd27y6",
          "author": "None",
          "body": "I sought out my therapist, and I pay her, so I'm pretty sure that means I can also choose to stop using her services. You're picking on semantics.\n\nThat's great that that direct method was helpful for you, but that is not the case for everyone, and obviously not the case for the OP. \n\nMy therapist is direct, and asks me the tough questions, but she most certainly doesn't comfort me and enable my behaviour, rather, she is supportive of my wins, big or small, and encourages positive behaviours. She doesn't make me defensive and feel criticized, which it sounds like OP's did. I've had therapists like that in the past and I just ended up lying to them, which was pointless. \n\nThe same treatment doesn't work for everyone, and you shouldn't make that assumption. Also, please don't diagnose someone based on a comment they made. That's inappropriate and uninformed.",
          "created_utc": 1682229049.0
        }
      ]
    },
    {
      "id": "jhff31s",
      "author": "FinstereGedanken",
      "body": "my therapist is a psychoanalyst.\n\nI am diagnosed by psychiatrists and neuropsychologists. My psychiatrist had recommended this therapist to me, but after discussing my feelings she said she would help me look for a different one, specialized in DBT.",
      "created_utc": 1682277351.0,
      "score": 1,
      "context": [
        {
          "id": "jhb9do3",
          "author": "Proerytroblast",
          "body": "In theory, ***it is*** the answer. If your ED was restrictive, what you're feeling now is probably *extreme hunger* \\- your body's way of of ensuring that the food is not only available in this very moment but will be in the long run (in short - your body's gonna try to store as much energy as it can in case it's just temporary) - meaning after a longer time of \"just eating\" it should stop. What you should also know is that yes, you can (and probably will) feel bad about it; yes, you will probably feel sick from all the food more than once and yes, it will feel like it's never gonna stop. But the more you try to fight it - the stronger it will come back.\n\n&#x200B;\n\n&#x200B;\n\nDoesn't cancel the fact that it was a shitty way of bringing it up to you and not explaining shit. Quite an awful therapist if I'm being honest.",
          "created_utc": 1682195600.0
        },
        {
          "id": "jhdbdz8",
          "author": "True-Godess",
          "body": "I disagree with you. That’s like telling a heroin addict on brink of relapse to just don’t use. It’s a oversimplification of a very complicated problem considering with EDs you still have to eat food and addiction you can never use again. Also like my example she knows/could of told herself that. Doesn’t need to pay a person to say that. She should of asked more about the anxiety it brings up and what type and what has she used to cope both successfully and unsuccessfully in past and suggested different CBT or meditive or other ways to squash the anxiety before it becomes overwhelming to the point of her relapsing Or using unhealthy coping mechanisms. \n\nJust eat is what I would expect an ignorant parent to say not a trained professional.",
          "created_utc": 1682236557.0
        },
        {
          "id": "jhfbcms",
          "author": "FinstereGedanken",
          "body": "I asked if CBT / DBT would be more suitable for me in my situation, and she asked me what I would like her to answer; I said that I wanted to gather information to make the best decisions for myself and she just said that CBT / DBT is not her discipline.",
          "created_utc": 1682275789.0
        },
        {
          "id": "jhfeijp",
          "author": "True-Godess",
          "body": "Wow. So unprofessional. What is her title exactly? I’d say so what is your discipline then because so far you’ve just been parroting my questions back to me and have been as helpful as a pamphlet.  Even if she takes the more Freudian approach she should still have studied the various aspects of therapy dynamics. \nShe sounds lazy and not a good fit for you or anyone. I’d report her if I were you. I’ve worked as a assistant counselor with a dual BA in psychology and anthropology and if patients had issues I wasn’t familiar with I’d make a point to research it and most effective treatments. \nFirst you need proper diagnosis by psychiatrist or psychologist.",
          "created_utc": 1682277111.0
        }
      ]
    },
    {
      "id": "jhmicle",
      "author": "True-Godess",
      "body": "That’s good, I can’t believe she’s a freAkin psychoanalysist!! I could help you more than her n I only got couple BAs n some certifications! Smh. I guess some people just in it for paycheck. Though that does make sense her not doing CbT or DBT. But she should still know enough about it to give u basics! I suggest cBT it’s an evolution of DBT n has most of its components. \nAll I can say is Prozac has really helped with my ED\nN is only antidepressant used for ED\n Good luck. Let us know how next\nOne is. \nAnd I’m very proud of you that you spoke up and advocated for yourself!! Always do that!! N tell next lady what you didn’t like in previous counselor",
      "created_utc": 1682406935.0,
      "score": 1,
      "context": [
        {
          "id": "jhb9do3",
          "author": "Proerytroblast",
          "body": "In theory, ***it is*** the answer. If your ED was restrictive, what you're feeling now is probably *extreme hunger* \\- your body's way of of ensuring that the food is not only available in this very moment but will be in the long run (in short - your body's gonna try to store as much energy as it can in case it's just temporary) - meaning after a longer time of \"just eating\" it should stop. What you should also know is that yes, you can (and probably will) feel bad about it; yes, you will probably feel sick from all the food more than once and yes, it will feel like it's never gonna stop. But the more you try to fight it - the stronger it will come back.\n\n&#x200B;\n\n&#x200B;\n\nDoesn't cancel the fact that it was a shitty way of bringing it up to you and not explaining shit. Quite an awful therapist if I'm being honest.",
          "created_utc": 1682195600.0
        },
        {
          "id": "jhdbdz8",
          "author": "True-Godess",
          "body": "I disagree with you. That’s like telling a heroin addict on brink of relapse to just don’t use. It’s a oversimplification of a very complicated problem considering with EDs you still have to eat food and addiction you can never use again. Also like my example she knows/could of told herself that. Doesn’t need to pay a person to say that. She should of asked more about the anxiety it brings up and what type and what has she used to cope both successfully and unsuccessfully in past and suggested different CBT or meditive or other ways to squash the anxiety before it becomes overwhelming to the point of her relapsing Or using unhealthy coping mechanisms. \n\nJust eat is what I would expect an ignorant parent to say not a trained professional.",
          "created_utc": 1682236557.0
        },
        {
          "id": "jhfbcms",
          "author": "FinstereGedanken",
          "body": "I asked if CBT / DBT would be more suitable for me in my situation, and she asked me what I would like her to answer; I said that I wanted to gather information to make the best decisions for myself and she just said that CBT / DBT is not her discipline.",
          "created_utc": 1682275789.0
        },
        {
          "id": "jhfeijp",
          "author": "True-Godess",
          "body": "Wow. So unprofessional. What is her title exactly? I’d say so what is your discipline then because so far you’ve just been parroting my questions back to me and have been as helpful as a pamphlet.  Even if she takes the more Freudian approach she should still have studied the various aspects of therapy dynamics. \nShe sounds lazy and not a good fit for you or anyone. I’d report her if I were you. I’ve worked as a assistant counselor with a dual BA in psychology and anthropology and if patients had issues I wasn’t familiar with I’d make a point to research it and most effective treatments. \nFirst you need proper diagnosis by psychiatrist or psychologist.",
          "created_utc": 1682277111.0
        },
        {
          "id": "jhff31s",
          "author": "FinstereGedanken",
          "body": "my therapist is a psychoanalyst.\n\nI am diagnosed by psychiatrists and neuropsychologists. My psychiatrist had recommended this therapist to me, but after discussing my feelings she said she would help me look for a different one, specialized in DBT.",
          "created_utc": 1682277351.0
        }
      ]
    }
  ]
}