{
  "id": "12vy0t9",
  "subreddit": "EatingDisorders",
  "author": "AmandaTheRedhead",
  "created_utc": 1682230184.0,
  "title": "Talking about food is triggering",
  "selftext": "I started a new job recently and they judge how I eat. I'd rather have fruit for lunch than go eat fast food everyday. Unhealthy and expensive🤷🏻‍♀️\n\nEveryday I hear the same thing, \"That's all you're going to eat?\" \"Does that fill you up?\"\n\nIt's so damn triggering talking about what I eat everyday. I want to just tell them to mind their business, but I don't want to be mean. I'm happy eating my fruit and I don't know why it has to be the topic of conversation everyday.\n\n I'm glad that I'm allowing myself to eat, and that's the honest truth.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/12vy0t9/talking_about_food_is_triggering/",
  "score": 46,
  "num_comments": 15,
  "comments": [
    {
      "id": "jhdtzal",
      "author": "Strangebirdzz",
      "body": "I’m the same way. I would rather eat fruit everyday for lunch instead of fast food. Which I would argue, that fast food IS more unhealthy, but that being said, you can’t expect people to not say anything. It was bound to happen and you know it, so you should simply ask them to stop politely if it’s bothering you. Don’t forget to say thank you for their concern. \n\nIf you express your feelings in any other way towards your coworkers (such as anger), which is based only on the information you have given. It would only prove you”re immature, self-involved, and kinda rude. Lastly, no. Your disorder is not an excuse to treat people poorly or judge others for their own eating choices.",
      "created_utc": 1682251768.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jhdizc4",
      "author": "sadgrltumblr",
      "body": "A lot of people might make that comment out of concern than ill intent. express your discomfort since it’s bothering you",
      "created_utc": 1682243283.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jhfsgr0",
      "author": "pistolpxte",
      "body": "I’d be careful with your judgment as it comes off a little pious as well as hypocritical. Fast food can definitely be unhealthy in excess. But you can also get a fast and balanced meal from most spots these days. More importantly, you need to acknowledge your lack of self awareness when it comes to what health is. Eating fruit as a main course is not a healthy choice. You are not objectively healthier than anyone if you are actively exhibiting eating disorder behavior. You are putting excess strain on all of your vital organs and depriving your body of nutrients. It sounds like you are in a little bit of denial and I’d focus on recovery rather than mimicking the judgmental behavior you are claiming to be triggered by. \n\n(Anyone downvoting please enlighten me on how anyone in the throes of an ED has superior dietary habits over anyone? Or authority to say what healthy eating habits are? I say this as someone in recovery who has been in the position of believing my starvation/all carrot diet was healthier than a Big Mac)",
      "created_utc": 1682282917.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jhdl1ky",
      "author": "scrambled-satellite",
      "body": "I had a similar thing happen to me, but it was out of concern. I would like to challenge the ED thoughts and say: fast food for lunch everyday isn’t exactly healthy but just fruit for lunch isn’t either. It is a harm reduction for you, which is good, and I get why you feel upset that they are judging how you eat. It may feel like an attack, but a lot of times it’s people’s way of trying to see if you are okay and express concern.",
      "created_utc": 1682245082.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jhd6vvv",
      "author": "Excellent-World-476",
      "body": "And yet you just judged what they eat. I’m not saying it isn’t annoying but be aware you are doing the same thing.",
      "created_utc": 1682232749.0,
      "score": 37,
      "context": []
    },
    {
      "id": "jhdrxsu",
      "author": "None",
      "body": "Isn't fruit for lunch also pretty unhealthy? You need protein, carbs, fats... fruits are basicall a snack",
      "created_utc": 1682250437.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jhgk09y",
      "author": "pigsandunicorn",
      "body": "As much as it can be for concern, the public confrontation would definitely bother me.",
      "created_utc": 1682295368.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jhgautk",
      "author": "bluebonnet-baby",
      "body": "Their commenting on other people’s food is not cool, that’s never okay. However, as others have noted, keep in mind that you’re making the same judgements toward them. \nAnd, in all honesty, eating just fruit every single day for lunch is probably far more “unhealthy” than going for fast food — yes it has things in it that aren’t great for you when consumed in excess, but it’s also providing the basic necessities of protein, carbs, and fat that are needed from a meal. Fast food is absolutely more healthy than not properly nourishing your body, which will harm you more quickly and severely than any other type of food will. \nSo, in conclusion, I’m sorry you’re dealing with people commenting on eating habits, that’s never okay. However, it’s worth taking into consideration that the reason they’re doing that is because what you’re doing is abnormal and concerning to see, and try to use this opportunity to examine your own behaviors, how you’re caring for your body, and the way you think about food (the healthy/unhealthy binary is simply false and serves no one, especially not someone with an ED).",
      "created_utc": 1682291005.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jhixu4x",
      "author": "Littlegummyworms",
      "body": "The people who talk the most about your eating habits are usually insecure about theirs.",
      "created_utc": 1682348006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhkq7sv",
      "author": "None",
      "body": "I'm not going to lecture you about how just eating fruit isn't the best choice because I think you're well aware of that.\n\nWhat I am going to suggest is saying something like \"I eat a big breakfast, so I'm just not really hungry yet\" and hopefully they move on and find someone else to focus on. I too am extremely triggered when someone comments on my food choices, and sometimes they're actually GOOD choices, and having people comment totally sets me back.",
      "created_utc": 1682373319.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jhjy1ip",
      "author": "StressedAries",
      "body": "I had this problem as well of thinking that my choices were more healthy (than fast food) because they were fruits and vegetables but you can’t sustain your body by eating apples and blueberries and celery all day. It’s just not a balanced meal. My therapist told me to try adding a protein shake when I start feeling like I should be eating only fruits and vegetables. I drink Fairlife Core Power chocolate shakes and they taste great and keep me full. Feels like a treat and not a chore.",
      "created_utc": 1682362118.0,
      "score": 2,
      "context": [
        {
          "id": "jhfsgr0",
          "author": "pistolpxte",
          "body": "I’d be careful with your judgment as it comes off a little pious as well as hypocritical. Fast food can definitely be unhealthy in excess. But you can also get a fast and balanced meal from most spots these days. More importantly, you need to acknowledge your lack of self awareness when it comes to what health is. Eating fruit as a main course is not a healthy choice. You are not objectively healthier than anyone if you are actively exhibiting eating disorder behavior. You are putting excess strain on all of your vital organs and depriving your body of nutrients. It sounds like you are in a little bit of denial and I’d focus on recovery rather than mimicking the judgmental behavior you are claiming to be triggered by. \n\n(Anyone downvoting please enlighten me on how anyone in the throes of an ED has superior dietary habits over anyone? Or authority to say what healthy eating habits are? I say this as someone in recovery who has been in the position of believing my starvation/all carrot diet was healthier than a Big Mac)",
          "created_utc": 1682282917.0
        }
      ]
    },
    {
      "id": "jhenmo9",
      "author": "Nearby_Button",
      "body": "Well, but it must be said that every day fastfood IS unhealthy.",
      "created_utc": 1682266038.0,
      "score": 5,
      "context": [
        {
          "id": "jhd6vvv",
          "author": "Excellent-World-476",
          "body": "And yet you just judged what they eat. I’m not saying it isn’t annoying but be aware you are doing the same thing.",
          "created_utc": 1682232749.0
        }
      ]
    },
    {
      "id": "jhgnibs",
      "author": "None",
      "body": "Yeah I was gonna say this!! Fruit is just carbs and fiber, and I’d be alarmed if that was someone’s meal, even though I might not say anything. It’s just not enough, and by the time you’ve eaten a meals worth of calories in fruit, you’ve had so much sugar and like 2x the daily fiber amount",
      "created_utc": 1682297067.0,
      "score": 0,
      "context": [
        {
          "id": "jhgautk",
          "author": "bluebonnet-baby",
          "body": "Their commenting on other people’s food is not cool, that’s never okay. However, as others have noted, keep in mind that you’re making the same judgements toward them. \nAnd, in all honesty, eating just fruit every single day for lunch is probably far more “unhealthy” than going for fast food — yes it has things in it that aren’t great for you when consumed in excess, but it’s also providing the basic necessities of protein, carbs, and fat that are needed from a meal. Fast food is absolutely more healthy than not properly nourishing your body, which will harm you more quickly and severely than any other type of food will. \nSo, in conclusion, I’m sorry you’re dealing with people commenting on eating habits, that’s never okay. However, it’s worth taking into consideration that the reason they’re doing that is because what you’re doing is abnormal and concerning to see, and try to use this opportunity to examine your own behaviors, how you’re caring for your body, and the way you think about food (the healthy/unhealthy binary is simply false and serves no one, especially not someone with an ED).",
          "created_utc": 1682291005.0
        }
      ]
    },
    {
      "id": "jhh6n1g",
      "author": "pistolpxte",
      "body": "Eating fruit as a stand-alone meal replacement is also incredibly unhealthy.\n\nAgain. If downvoting tell me how I’m wrong?",
      "created_utc": 1682306747.0,
      "score": 8,
      "context": [
        {
          "id": "jhd6vvv",
          "author": "Excellent-World-476",
          "body": "And yet you just judged what they eat. I’m not saying it isn’t annoying but be aware you are doing the same thing.",
          "created_utc": 1682232749.0
        },
        {
          "id": "jhenmo9",
          "author": "Nearby_Button",
          "body": "Well, but it must be said that every day fastfood IS unhealthy.",
          "created_utc": 1682266038.0
        }
      ]
    },
    {
      "id": "jhgeet0",
      "author": "bluebonnet-baby",
      "body": "No, that does not need to be said. Everyone is aware, and we don’t need to comment on people’s eating habits.",
      "created_utc": 1682292683.0,
      "score": 6,
      "context": [
        {
          "id": "jhd6vvv",
          "author": "Excellent-World-476",
          "body": "And yet you just judged what they eat. I’m not saying it isn’t annoying but be aware you are doing the same thing.",
          "created_utc": 1682232749.0
        },
        {
          "id": "jhenmo9",
          "author": "Nearby_Button",
          "body": "Well, but it must be said that every day fastfood IS unhealthy.",
          "created_utc": 1682266038.0
        }
      ]
    }
  ]
}