{
  "id": "131nrge",
  "subreddit": "EatingDisorders",
  "author": "YearConsistent2894",
  "created_utc": 1682677607.0,
  "title": "Why do people compliment my body the most when I am at my lowest? TW Ed",
  "selftext": "I don’t get this. Recently I have been getting so many compliments regarding my body. I relapsed badly with my ED and lost a lot of weight. People keep praising me for my ”hard work“, telling me that they wish they had the same ”ambition“ as me. I put those words in quotation marks, because this is not ”hard work“ or ”being ambitious“, it’s losing control and risking your life. Anorexia is a deadly illness. Right now, I am severely underweight and have so many health issues, yet people keep telling me how great I look. I remember buying pants that were meant for 12 year olds, and right after putting them on, someone told me that I look so good. For information: I am 23 years old and 176cm tall, so obviously, wearing clothes made for a 12 year old is abnormal for an adult like me. I don’t get this. What drives people to say these things? Why the hell is everyone so obsessed with food and looks, and why are eating disorders so normalized?! My suffering is celebrated and praised. When I was healthy, not many people kept telling me to ”keep up the good work“, and now they do, while I am at my lowest and suffering immensely. Comments like that keep me from reaching out for help, because they make me feel like what I am doing is okay and something to be proud of. When did society get so obsessed with being skinny? I feel like it’s been getting worse again, sick bodies are becoming a ”trend“ again. In general, why do people think bodies are a fucking trend? Why do looks matter more than health? That’s just something I’ve noticed and thought about a lot recently. So my question is: is anybody in a similar situation and can relate? Is it okay to feel incredibly angry about that? I’ve been wondering about that a lot.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/131nrge/why_do_people_compliment_my_body_the_most_when_i/",
  "score": 53,
  "num_comments": 10,
  "comments": [
    {
      "id": "ji1gwv4",
      "author": "BrowsingOnMaBreak",
      "body": "People are, simply put, messed up. I had similar comments when I had no energy, my face was gaunt and haggard, my skin looked grey and my hair was falling out - I very clearly looked ill, not to mention I was unhealthy on the inside too. It did anger me, especially when I’d literally have just told someone how ill I’d been or what pain I was in and they’d be like ‘worth it tho’. Umm no it isn’t. People would ask me for ‘my secret’. It’s mental illness, Janet. I just thought to myself (for the people that knew I was ill but seemed to think thinness was worth it anyway) that these people are even more messed up than I am because at least I recognise this is a bad thing.",
      "created_utc": 1682681200.0,
      "score": 25,
      "context": []
    },
    {
      "id": "ji28o5w",
      "author": "None",
      "body": "They’re messed up that’s it. \nWhen I was skinny (my whole life until two years ago) I was constantly hungry resulting in headaches 24/7, I ate one meal a day and the rest were for snacking. I was praised for eating one meal only and getting full, people said I wish I was like you, etc. \nBut tbh no one thought I was pretty, no one at all complement how nice I looked, but on how little I ate. My sister always got mad because clothes fit me and I always get to find my size. \n\nWhen I gained weight and I’m finally eating, not gonna lie people got very very rude, commenting at my eating habits (I rarely eat junk now, when I was skinny it was all junk but that’s ok because I was skinny), mocking me for prioritising my protein intake, mocking me because I’m building muscles and “you should just lose the weight and look how you were”. \nWhen I wear the clothes that were once baggy on me and now got filled up I get comments on “you should let go that you were skinny once”. I’ve letten it go, but people didn’t and won’t, but I’m at the best I’ve been. I love my body and I’m more healthy than I used to be. Even as a child I was always sick and tired due to under-eating.\n\nLooking back at old photos when I was skinny I realized how zombie like I was, I was clearly sick.",
      "created_utc": 1682694092.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ji3nf43",
      "author": "jelly5213",
      "body": "I’ve stopped commenting on others’ bodies. I hope more people learn this",
      "created_utc": 1682714203.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ji2hd7p",
      "author": "Thick_Sprinkles4868",
      "body": "I feel the same as you even tho I suffer from a different ED but was anorexic at one point. I also have had people tell me the same thing, I looked my best when I was working out all the time, restricting food, binging, and then eventually not eating due to health related complications but I still looked my best people would say! It's one of the main reasons I got off my social media because there were too many people even in boxing me asking me what my secret was to losing so much weight. It was hard for me because I've always had social media since myspace times but it was the best choice for me. I couldn't handle it anymore, society as a whole praising women based on their looks, weight etc. No one even cared to ask me how I had been feeling, bc truth be told I hadn't even been eating and became a workout addict, ended up malnourished and in the hospital. It's a terrible stigma to be thin and what's the secret, so many people refuse to realize maybe that person didn't eat that day or has body dysmorphia like myself and an ED and how comments from them building me up encourages and promotes ED to occur. I wish someone who cared enough about me including my own family, would have said to me are you ok? I just want to be sure you're not going through something and I'm here if you are! I am estranged from my family because first and foremost they're simply toxic and because I'm in ED therapy and recovery and they never even cared when I told them I was diagnosed with an ED! No support at all, 😞 society also sucks making us feel it's ok and we have no one really looking out for our best interests. Take care, hugs to you!! 💜💜 You're not alone!",
      "created_utc": 1682697458.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ji442k0",
      "author": "Witty-Afternoon1262",
      "body": "agreed, it’s awful. i used to get complimented all the time about my body when i was at my lowest point. i was quite literally on death’s doorstep: passing out in the shower, constantly exhausted, easily irritated, endlessly fatigued, bones jutting out, with brittle nails and damaged hair. people would see my frail figure and my twig legs, and they’d compliment me for it. they’d say- totally unprompted- that i had this killer body, that i should keep doing what i’m doing, that they wish they could be “good” like me, etc.\n\nwhereas if i- or anyone with common sense- saw someone in that condition, it would be an immediate red flag and raise alarm bells. it should never under any circumstances be validated- much less the standard.\n\nwhat’s hard now is that i’m in recovery, and i have a healthier bmi and everything, feeling much better than before, etc… but the compliments are all gone. people romanticize the worst shit, and it’s very discouraging, and honestly borderline triggering. it really pisses me off.\n\nim so sorry you’re going through this right now. i’ve become less fragile to it over time, but it still hurts, and we have every right to be upset about it. people are fucking idiots. it is more than okay to be furious about these comments. i’m here if you ever need to vent about anything.",
      "created_utc": 1682721496.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ji1vdre",
      "author": "cleanhouz",
      "body": "Sigh. It is very unfortunate and pisses me off too. Back in the day this would empower my ED. I've been in recovery a few years now. I just recently came off a medication so I lost a few (no ED on board) and I've heard these comments from three people so far. Including my *boss*. I just stare at them with a blank expression until they look away.\n\nImportantly, I don't let society's commentary impact my eating habits any more. It's hard some times, but I can only hold myself accountable, not anyone else.",
      "created_utc": 1682688670.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ji4q4dh",
      "author": "pastel_boho_love",
      "body": "The answer to the \"why\" question is \"capitalism\".\n\nI will never be able to fully recover because I cannot reconcile the fact that literally everyone would treat me better if I were smaller.\n\nI mean, how can you expect people to \"rise above\" body-shaming by \"loving themselves\" when the same people who are telling them to do so are the ones whose words and actions are shaming them toward disordered eating, or otherwise perpetuating these systemic injustices?\n\nIt's so fucked up.",
      "created_utc": 1682731561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji62sax",
      "author": "Anfie22",
      "body": "I had the opposite experience. I was stared and pointed at frequently, some people gasped. How was someone so emaciated not dead? I was visual horror, a shocking sight, I disturbed people, and I was absolutely utterly mortified and embarrassed by this and what I had done to my body. Not even clothes 5 sizes too large could conceal the blatantly obvious. I brought every ounce of that shame and humiliation upon myself.",
      "created_utc": 1682764226.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji6hjy5",
      "author": "Em_kie",
      "body": "Tell the people you trust how you feel, I only recently started explaining to family that what they consider a complement is really triggering for me and I can sometimes starve myself for days afterwards to keep up that appearance. I’ve prompted them instead to compliment my outfit or hair and they’ve obliged which has really helped me. It’s still hard with extended family or those who don’t know but it helps to have those who understand. My brother who was the first people I confided in always redirects me after a comment on my weight such as ‘wow, you’ve lost weight. You look so good’ and he’ll jump in and ask about my clothes or asks about my bow (I like hair clips) so I don’t dwell on those comments. I’m lucky to have him.",
      "created_utc": 1682774039.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji7j2y4",
      "author": "Farista_Sairuv",
      "body": "Oh. Screw them. If they’re friends or family members, I would try to explain to them my struggles and why comments like that aren helpful. If they’re strangers, I would try to tell myself that it doesn’t matter what they think. A lot of people are brainwashed by society to idolize thinness but that is really unhealthy and narrow-minded.",
      "created_utc": 1682790847.0,
      "score": 1,
      "context": []
    }
  ]
}