{
  "id": "132chi2",
  "subreddit": "EatingDisorders",
  "author": "BiZombieLuna",
  "created_utc": 1682722787.0,
  "title": "I'm in need of some serious advice. My 8yo daughter has developed an eating disorder",
  "selftext": "so like the title says she barely eats. It started 3 years ago. Idk how it started, she never told me. But the first month i also didnt handle well. after the first month i calmed down a lot and i would calmly talk to her about it. She's always been under weight too. For what she does eat I've been adding extra calories. an she also takes vitamins. well its finally come out that she just doesn't wanna be fat like me. Thats cool i don't mind i know she still loves me. Well I've talked to her about healthier ways to go about that an we do eat as healthy as possible with our budget. She's also in therapy and I'm constantly having as positive of conversations as i can about this but I'm at a loss nothing has improved. Please i need advice.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/132chi2/im_in_need_of_some_serious_advice_my_8yo_daughter/",
  "score": 74,
  "num_comments": 45,
  "comments": [
    {
      "id": "ji4ez6h",
      "author": "rileyyj001",
      "body": "Do NOT base her health solely on labs. I am so severely ill with anorexia (currently in kidney failure at age 32) and my labs STILL come back stable.",
      "created_utc": 1682726537.0,
      "score": 114,
      "context": []
    },
    {
      "id": "ji4cyq2",
      "author": "None",
      "body": "You need to get her to a pediatrician asap if you haven't yet because caloric restriction may delay her growth or stunt it",
      "created_utc": 1682725616.0,
      "score": 47,
      "context": []
    },
    {
      "id": "ji4ru66",
      "author": "The_Bastard_Henry",
      "body": "My niece went through a phase like this, because she didn't want to be overweight like her parents. My sister said ok, let's do a healthy meal plan together, so we can both eat enough but make healthier choices. There was a period of adjustment getting my niece to gradually eat more little by little, but she is now a healthy weight. She's still got a lot of disordered thinking, but she is working with a therapist and generally doing very well. I hope you can find something that works! ♥️",
      "created_utc": 1682732370.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ji55xx0",
      "author": "gaylikeamity",
      "body": "I’d recommend having her see a dietitian and start talk therapy. If it continues to worsen or really impact her health it may be worth looking for more extensive treatment options.",
      "created_utc": 1682739277.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ji4myo5",
      "author": "Therandomderpdude",
      "body": "It can be scary. \n\nThere’s a lot of peer pressure at the age of 8. Beauty standards amongst young girls start early, and can be especially hard if she doesn’t meet those criterias. \n\nBeing slim and pretty is often linked to a young girl’s self worth.\n\nTry to encourage the things she enjoy doing and is good at. Give her compliments based on her personality. \nSpend quality time with her. \nMake her focus on something unrelated to food, weight etc. \n\nI had an eating disorder in my teens, It gave me a sense of accomplishment and control as I had low self esteem and self worth. \n\nBeing told that I mattered, that I was valued as a friend, that I had talent and a good heart. When people treated me kindly. Seeing that people cared. \n\nIt motivated me to get better, I realized that life had more fulfilling meaning. \n\nI remember dwelling deeper into my destructive habits when people started distancing themselves from me, when people made awful comments about my appearance, pointed out that I looked frail and unhealthy. When people looked at my body in shock. It only worsened my self hatred. Restriction was my only choice of comfort. \n\nI wish both of you the best! Much love!",
      "created_utc": 1682730117.0,
      "score": 30,
      "context": []
    },
    {
      "id": "ji5fgwt",
      "author": "Physical_Rice919",
      "body": "I've suffered with bulimia since I was 11 (currently 18). I want to advise you heavily not to comment when she eats more than usual (if she ever does). Or when she eats in general. This illness (especially anorexia) is a way for her to have control. In most cases, it's a subcategory of OCD. If you're really strict on her, it may make it worse because she feels stuck and ashamed when you mention food or her appearance. She might start hiding what she does eat from you. Try your best not to make comments and give her space during meals. It's very stressful on a person with an eating disorder to be asked little things like \"what do you got there? What are you eating? Etc.\n\nI started out anorexic. Then, I eventually developed a binge eating disorder, which then turned into me puking my guts out after every meal. It is isolating and scary, and you feel stuck in a cycle. \n\nPlease be patient with her. She can not control a lot of her thoughts properly. If it's been as long as 3 years, she's trained her brain to associate things together. She rewired her brain to view food as an enemy. In her mind, she thinks she doesn't deserve food or she's not worthy of being happy in general. \n\nI'm still struggling every day, so I don't have the answers. But I do know that it's a very lonely road, especially when no one around you understands why you act the way you do.\n\nIf you have any questions. I might be able to help you understand her better. Feel free to dm me anytime. I wish you and your daughter the best.",
      "created_utc": 1682744929.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ji5gb0i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1682745473.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ji5p5hz",
      "author": "None",
      "body": "Is there an eating disorder recovery program at the local children’s hospital? That’s what I went through as a child and it was a doctor to check my blood and weight and whatnot, a nutritionist to tell me what to eat, and a therapist who sometimes did group therapy.",
      "created_utc": 1682752229.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ji5tkjo",
      "author": "Temporary-Silver8975",
      "body": "Look up the FB group “Parents of Children with Anorexia and Other Eating Disorders”. I have learned a ton there. My daughter is now in a residential program across the country - I didn’t realize how detrimental ED could be till she wound up hospitalized for two weeks. Aggressive treatment with refeeding is key. Also look into Family Based Treatment. It isn’t easy, but food is her medicine and the difference in my daughter since refeeding is striking. I’m so sorry you’re going through this.",
      "created_utc": 1682756010.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ji5y6ab",
      "author": "chasingravioli",
      "body": "8 is a very impressionable age, I'm so sorry and sad to hear about this!\nI don't have any kids and I'm not going to tell you how to parent (you're doing amazing), but what sort of influences could contribute to this in her life that can be limited? Social media and apps like Tiktok are shown to have negative effects on body image. What does she watch on TV? Tablet? Computer? What media does she consume?",
      "created_utc": 1682760110.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ji53c9n",
      "author": "EXT4000",
      "body": "This must be very hard for you, and I can see you are already doing everything you can think of to help your daughter and have engaged in some professional help. With what limited info you have posted on here, I’d have a chat to your Doctor about a possible ARFID diagnosis. It is very unusual to have a ED like Anorexia at her age. There is a good evidence base to support treatment for ARFID after diagnosis. If the diagnosis is made, ensure you find clinicians and therapists appropriately experienced to treat. I’ve seen really positive outcomes over the years.",
      "created_utc": 1682737885.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ji6phvl",
      "author": "magpie-sparrow",
      "body": "Might be an odd question, but does your daughter have regular access to the Internet? Do her friends, as far as you know?\n\nSocial media like Instagram and TikTok have been known to exacerbate body image issues in young girls and often promote sexualization of women. Even seemingly innocent makeup tutorials can seed low self-esteem in very young girls.\n\nIt might seem like a strange ask, but unfortunately lots of kids are on the Internet unsupervised these days.",
      "created_utc": 1682777934.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ji55zqp",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1682739304.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ji52bbh",
      "author": "BadAssBaker6",
      "body": "Find the Facebook groups. They are infinitely more helpful than Reddit.",
      "created_utc": 1682737350.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji66dkg",
      "author": "Boosey0910",
      "body": "Please get any and all books by Carolyn Costin on this subject.  I'd start with \"Your Dieting Daughter\". then \"The 8 keys to recovery from and Eating Disorder\" book. She has a workbook that goes along with it.  I would try to get your daughter into some sort of counseling as well. The sooner you can nip this in the bud the better.  It's not uncommon for young girls to start dieting earlier and earlier.  Also I'd look at your own eating habits and thoughts about your own body. It's amazing what kids pick up on.  Feel free to send me a message if you'd like.",
      "created_utc": 1682767097.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji6d8xs",
      "author": "SingForMaya",
      "body": "Mine started at age 8 as well, and went on and off even as I’m turning 31. \n\nKeep up in therapy, make sure it’s a therapist she’s comfortable with. My therapist when I was young was never someone I felt comfortable with, so it didn’t really help me- but no one ever asked me because I was a kid and I did what I was told and continued to go despite it not doing anything for me.",
      "created_utc": 1682771611.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji6n8v9",
      "author": "Delilah234703",
      "body": "The therapist should be setting up some sort of family based therapy (like maudsleys). That way she can be nutritionally rehabilitated asap. The sooner she can be weight restored the sooner she can be out of starvation syndrome and then actually taking on the other therapy. Also recruit a dietitian experienced in eating disorders. They will deal with the malnutrition and psycho education around dietary restraint whereas the psych will do more of the psycho education around cognitive and behavioural change. Good luck!",
      "created_utc": 1682776900.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji6q3er",
      "author": "Kelly_Beanz",
      "body": "Mealtime always made me so anxious. I worried everyone was assessing my every move. This may be terrible advice, but just a thought…could she do something else while eating (like audiobook or tv) so the sole focus isn’t on food? Maybe she would be distracted and eat more with less thought. \nThis goes against what I learned in my own recovery, where I developed an intimate and healthy relationship with food again through mindful eating, but perhaps a distraction could be helpful at this point. Just thinking out loud. My ED started at 10, I went to treatment at 26, and I’ve been in recovery since. Sending light and love, sweet mama! 💛",
      "created_utc": 1682778202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji85ubb",
      "author": "Necessary_Spinach_47",
      "body": "im so sorry to hear this. i get so sad whenever i hear these kinds of story. i currently dont have the mental state to help with advise. but i wish you the best with this whole situation. goodluck <3",
      "created_utc": 1682801031.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji8ixjb",
      "author": "None",
      "body": "Please dont add extra calories to her food if she finds oht she wont trust you (my family did something similar) but if you want to help maybe hide the scale or take the batteries out and tell her its dead and itll be a while till you can get some more or make her favorite food!!!! Also something that made me starts eating a bit more is my friend told me how her grandma died from an ed and how she had to eat from a tube and was froced to eat. It might help but if not if your daughter eats soup or stuff like that fix 2 cans instead of one to double the calories that’s something my mon does that i dont complain about i dont like it but i dont complain so it might just work for yours hopefully!!!!",
      "created_utc": 1682807174.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji8j2ow",
      "author": "dazedimmaculate",
      "body": "So this is my experience, and I don’t share this to accuse you of anything (I think you’re doing a wonderful job), but rather to share a different perspective. I developed an unhealthy relationship with food and eventual eating disorder due in part to my mother’s eating disorder. I grew up with an extremely warped perception of what self-image and eating habits should look like. My mother developed her own eating disorder due to her mother and sister’s obesity and constantly being praised for being thin. This led to her becoming severely anorexic for most of her life, and in turn, led to me being bulimic for the majority of my adolescence.\n\nMy mother did nothing but tell me how I was perfect exactly as I was. But unfortunately, monkey see-monkey do. My mother starved herself. My mother did not treat herself. My mother did not wear bathing suits or shorts. My mother relentlessly exercised. My mother constantly spoke of diets, and cellulite, and weight gain, and ugliness. Just because it was directed towards herself and not me didn’t make a difference - she unwittingly taught me that SHE was fat, and if I was bigger than her? That meant I was worse.\n\nShe learned her own behaviours from watching her family overindulge growing up. She watched her sister binge on sweets until she vomited. She watched her mother become diabetic. She watched as the women in her family grew out of their clothing and into morbid obesity. She was “good”. She learned nothing of moderation, only extremes.\n\nSometimes, it isn’t how you treat your child, but how you treat yourself (or how others treat themselves). Modelling healthy behaviours is so beyond important for little ones because they’re smarter than we think. They can see when people don’t practice what they preach, and they know when they’re being treated differently (even if it’s positive). Take note of how the people she looks up to treat themselves. Start noticing *all* body talk, be that in yourself, other family members, TV, commercials, etc. Have honest conversations with her about it. Kids are smarter than we give them credit for.\n\nI wish you, your daughter, and your family nothing but hope. She will get through this. She’s very lucky to have a Mum like you.",
      "created_utc": 1682807244.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji9t1lh",
      "author": "Witty-Afternoon1262",
      "body": "i am so sorry this is happening. this must be so scary. i am twenty one years old and i am currently recovering from anorexia. i would advise you to seek out a doctor that specializes in eating disorders, or a nutritionist who focuses on anorexia recovery. hopefully they can figure out a good, nutritional meal plan that provides her with all the calories she needs. once her weight is at a stable point, they can give her a maintenance plan, and i’m sure they can make it as healthy as she’d like. i’d also recommend therapy for her, if at all possible.\n\nas someone who struggles financially, i know getting this medical help probably won’t be easy depending on your circumstances- i know it wasn’t for me- but it’s necessary, and i agree entirely, your daughter definitely does need some help as soon as possible. thank you for reaching out, i am wishing you both the very best <3 please stay safe",
      "created_utc": 1682831460.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ji5c06a",
      "author": "Fairy_Sweet_22",
      "body": "This is terrifying. I was bulimic for so many years and I thought I had done no damage. Been “recovering for 3 years and just now (was 11/12 am now almost 27) feel like weird things are happening with no explanation but labs come back mostly normal",
      "created_utc": 1682742764.0,
      "score": 29,
      "context": [
        {
          "id": "ji4ez6h",
          "author": "rileyyj001",
          "body": "Do NOT base her health solely on labs. I am so severely ill with anorexia (currently in kidney failure at age 32) and my labs STILL come back stable.",
          "created_utc": 1682726537.0
        }
      ]
    },
    {
      "id": "ji5hmbs",
      "author": "BiZombieLuna",
      "body": "Thank you for this. May i ask what i can request the doctor to look at?",
      "created_utc": 1682746381.0,
      "score": 6,
      "context": [
        {
          "id": "ji4ez6h",
          "author": "rileyyj001",
          "body": "Do NOT base her health solely on labs. I am so severely ill with anorexia (currently in kidney failure at age 32) and my labs STILL come back stable.",
          "created_utc": 1682726537.0
        }
      ]
    },
    {
      "id": "ji5xzf9",
      "author": "chasingravioli",
      "body": "Aaaaaaaa I'm 30 and just looked up symptoms- FUCK 😭",
      "created_utc": 1682759938.0,
      "score": 6,
      "context": [
        {
          "id": "ji4ez6h",
          "author": "rileyyj001",
          "body": "Do NOT base her health solely on labs. I am so severely ill with anorexia (currently in kidney failure at age 32) and my labs STILL come back stable.",
          "created_utc": 1682726537.0
        }
      ]
    },
    {
      "id": "ji4det8",
      "author": "BiZombieLuna",
      "body": "She is. She sees her pediatrician once a month because of this. She gets labs done every 3 months too those all come back good too",
      "created_utc": 1682725821.0,
      "score": 16,
      "context": [
        {
          "id": "ji4cyq2",
          "author": "None",
          "body": "You need to get her to a pediatrician asap if you haven't yet because caloric restriction may delay her growth or stunt it",
          "created_utc": 1682725616.0
        }
      ]
    },
    {
      "id": "ji5i7zr",
      "author": "BiZombieLuna",
      "body": "I think I'll propose this idea to her as well. She loves learning how to cook with me. So maybe it will help too",
      "created_utc": 1682746815.0,
      "score": 8,
      "context": [
        {
          "id": "ji4ru66",
          "author": "The_Bastard_Henry",
          "body": "My niece went through a phase like this, because she didn't want to be overweight like her parents. My sister said ok, let's do a healthy meal plan together, so we can both eat enough but make healthier choices. There was a period of adjustment getting my niece to gradually eat more little by little, but she is now a healthy weight. She's still got a lot of disordered thinking, but she is working with a therapist and generally doing very well. I hope you can find something that works! ♥️",
          "created_utc": 1682732370.0
        }
      ]
    },
    {
      "id": "ji4xmgt",
      "author": "None",
      "body": "I'm very happy to know your sister has dealt with this so wisely and healthily :)",
      "created_utc": 1682735068.0,
      "score": 5,
      "context": [
        {
          "id": "ji4ru66",
          "author": "The_Bastard_Henry",
          "body": "My niece went through a phase like this, because she didn't want to be overweight like her parents. My sister said ok, let's do a healthy meal plan together, so we can both eat enough but make healthier choices. There was a period of adjustment getting my niece to gradually eat more little by little, but she is now a healthy weight. She's still got a lot of disordered thinking, but she is working with a therapist and generally doing very well. I hope you can find something that works! ♥️",
          "created_utc": 1682732370.0
        }
      ]
    },
    {
      "id": "ji5ijw5",
      "author": "BiZombieLuna",
      "body": "I'll call monday to get her in",
      "created_utc": 1682747057.0,
      "score": 3,
      "context": [
        {
          "id": "ji55xx0",
          "author": "gaylikeamity",
          "body": "I’d recommend having her see a dietitian and start talk therapy. If it continues to worsen or really impact her health it may be worth looking for more extensive treatment options.",
          "created_utc": 1682739277.0
        }
      ]
    },
    {
      "id": "ji598ty",
      "author": "None",
      "body": "Specifically a dietitian who specializes in eating disorders and/or a HAES/anti-diet dietitian. That's how I was able to heal from my eating disorder.",
      "created_utc": 1682741132.0,
      "score": 7,
      "context": [
        {
          "id": "ji55xx0",
          "author": "gaylikeamity",
          "body": "I’d recommend having her see a dietitian and start talk therapy. If it continues to worsen or really impact her health it may be worth looking for more extensive treatment options.",
          "created_utc": 1682739277.0
        }
      ]
    },
    {
      "id": "ji5i2ph",
      "author": "BiZombieLuna",
      "body": "Thank you for sharing this. I will change how i compliment her. I do compliment her personality too, but i mostly just call her beautiful and gorgeous. I've done that with all my babies since they were born. We spend a lot of time together gaming mostly. Its almost all she likes doing anymore.",
      "created_utc": 1682746711.0,
      "score": 12,
      "context": [
        {
          "id": "ji4myo5",
          "author": "Therandomderpdude",
          "body": "It can be scary. \n\nThere’s a lot of peer pressure at the age of 8. Beauty standards amongst young girls start early, and can be especially hard if she doesn’t meet those criterias. \n\nBeing slim and pretty is often linked to a young girl’s self worth.\n\nTry to encourage the things she enjoy doing and is good at. Give her compliments based on her personality. \nSpend quality time with her. \nMake her focus on something unrelated to food, weight etc. \n\nI had an eating disorder in my teens, It gave me a sense of accomplishment and control as I had low self esteem and self worth. \n\nBeing told that I mattered, that I was valued as a friend, that I had talent and a good heart. When people treated me kindly. Seeing that people cared. \n\nIt motivated me to get better, I realized that life had more fulfilling meaning. \n\nI remember dwelling deeper into my destructive habits when people started distancing themselves from me, when people made awful comments about my appearance, pointed out that I looked frail and unhealthy. When people looked at my body in shock. It only worsened my self hatred. Restriction was my only choice of comfort. \n\nI wish both of you the best! Much love!",
          "created_utc": 1682730117.0
        }
      ]
    },
    {
      "id": "ji5hh9d",
      "author": "BiZombieLuna",
      "body": "Thank you for sharing that with me. I'm not even sure where to begin with questions. I will talk to my fiance about that too. He's asked her several times what she got to eat during the day. She usually happily tells him. I'm the one who's in control of her meals. I think its always been a year since she's ate more than half a plate of something. I don't remember if i said anything about it, its been so long ago. But i more than likely did. So if out ever happens again I'll make sure to not say anything",
      "created_utc": 1682746279.0,
      "score": 6,
      "context": [
        {
          "id": "ji5fgwt",
          "author": "Physical_Rice919",
          "body": "I've suffered with bulimia since I was 11 (currently 18). I want to advise you heavily not to comment when she eats more than usual (if she ever does). Or when she eats in general. This illness (especially anorexia) is a way for her to have control. In most cases, it's a subcategory of OCD. If you're really strict on her, it may make it worse because she feels stuck and ashamed when you mention food or her appearance. She might start hiding what she does eat from you. Try your best not to make comments and give her space during meals. It's very stressful on a person with an eating disorder to be asked little things like \"what do you got there? What are you eating? Etc.\n\nI started out anorexic. Then, I eventually developed a binge eating disorder, which then turned into me puking my guts out after every meal. It is isolating and scary, and you feel stuck in a cycle. \n\nPlease be patient with her. She can not control a lot of her thoughts properly. If it's been as long as 3 years, she's trained her brain to associate things together. She rewired her brain to view food as an enemy. In her mind, she thinks she doesn't deserve food or she's not worthy of being happy in general. \n\nI'm still struggling every day, so I don't have the answers. But I do know that it's a very lonely road, especially when no one around you understands why you act the way you do.\n\nIf you have any questions. I might be able to help you understand her better. Feel free to dm me anytime. I wish you and your daughter the best.",
          "created_utc": 1682744929.0
        }
      ]
    },
    {
      "id": "ji5gwcq",
      "author": "BiZombieLuna",
      "body": "I'm in therapy too. An I'll definitely get some books. I wish she would tell me or even her therapist what happened.",
      "created_utc": 1682745872.0,
      "score": 5,
      "context": [
        {
          "id": "ji5gb0i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1682745473.0
        }
      ]
    },
    {
      "id": "ji5ig48",
      "author": "BiZombieLuna",
      "body": "Thank you I'll definitely look more into that",
      "created_utc": 1682746981.0,
      "score": 2,
      "context": [
        {
          "id": "ji53c9n",
          "author": "EXT4000",
          "body": "This must be very hard for you, and I can see you are already doing everything you can think of to help your daughter and have engaged in some professional help. With what limited info you have posted on here, I’d have a chat to your Doctor about a possible ARFID diagnosis. It is very unusual to have a ED like Anorexia at her age. There is a good evidence base to support treatment for ARFID after diagnosis. If the diagnosis is made, ensure you find clinicians and therapists appropriately experienced to treat. I’ve seen really positive outcomes over the years.",
          "created_utc": 1682737885.0
        }
      ]
    },
    {
      "id": "ji6qt64",
      "author": "BiZombieLuna",
      "body": "She only watched tiktoks on youtube. An she is not allowed on other social media outside of kids messenger but on there she only has family on there as we dont live near them an she loves talking to her cousins. An no there was a short period where i wasn't as attentive but i went through her watch history and saw she found adult male toys on youtube because she misspelled something. From there i restrict her to kids youtube an i told her she isn't in trouble as i saw it was an accident on how she came upon it. An i ended up having a talk i wasn't ready for yet. But outside of all that no i keep a close eye on everything now",
      "created_utc": 1682778521.0,
      "score": 2,
      "context": [
        {
          "id": "ji6phvl",
          "author": "magpie-sparrow",
          "body": "Might be an odd question, but does your daughter have regular access to the Internet? Do her friends, as far as you know?\n\nSocial media like Instagram and TikTok have been known to exacerbate body image issues in young girls and often promote sexualization of women. Even seemingly innocent makeup tutorials can seed low self-esteem in very young girls.\n\nIt might seem like a strange ask, but unfortunately lots of kids are on the Internet unsupervised these days.",
          "created_utc": 1682777934.0
        }
      ]
    },
    {
      "id": "ji5iq6y",
      "author": "BiZombieLuna",
      "body": "I have been trying. I have pcos an no matter how healthy i eat, which is fairly decent for the last 7 months i keep fluctuating front losing anywhere between 10-50lbs. Then it wants to jump right back up",
      "created_utc": 1682747187.0,
      "score": 4,
      "context": [
        {
          "id": "ji55zqp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1682739304.0
        }
      ]
    },
    {
      "id": "ji7p8lr",
      "author": "b1tching",
      "body": "Yeah this is really not the time to tell someone to lose weight. She’s doing so much for her daughter she really doesn’t need to add in trying to lose weight. Especially when she has pcos. It honestly might do more harm than good. Her daughter is in a very vulnerable state regarding food and weight and her mom losing weight might trigger her even more. I also don’t understand how losing weight would “help you understand more what your daughter is going through”. Losing weight is not a good way to understand what it feels like to have an eating disorder. I’m not attacking you I just don’t think this is the time to tell someone they need to lose weight.",
      "created_utc": 1682793524.0,
      "score": 3,
      "context": [
        {
          "id": "ji55zqp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1682739304.0
        }
      ]
    },
    {
      "id": "ji5iasf",
      "author": "BiZombieLuna",
      "body": "Ok I'll go look into those as well. I have gotten some helpful tips so far",
      "created_utc": 1682746872.0,
      "score": 1,
      "context": [
        {
          "id": "ji52bbh",
          "author": "BadAssBaker6",
          "body": "Find the Facebook groups. They are infinitely more helpful than Reddit.",
          "created_utc": 1682737350.0
        }
      ]
    },
    {
      "id": "ji5y2xg",
      "author": "rileyyj001",
      "body": "I’m sorry to scare you, friend, but we have to be realistic…there is so much damage being done to us on the inside. It’s impossible there isn’t. 😞",
      "created_utc": 1682760026.0,
      "score": 8,
      "context": [
        {
          "id": "ji4ez6h",
          "author": "rileyyj001",
          "body": "Do NOT base her health solely on labs. I am so severely ill with anorexia (currently in kidney failure at age 32) and my labs STILL come back stable.",
          "created_utc": 1682726537.0
        },
        {
          "id": "ji5c06a",
          "author": "Fairy_Sweet_22",
          "body": "This is terrifying. I was bulimic for so many years and I thought I had done no damage. Been “recovering for 3 years and just now (was 11/12 am now almost 27) feel like weird things are happening with no explanation but labs come back mostly normal",
          "created_utc": 1682742764.0
        }
      ]
    },
    {
      "id": "ji5uvtu",
      "author": "rileyyj001",
      "body": "Literally anything and everything her PCP can. You need to know her electrolyte levels, her kidney function, kidney filtration rate, her albumin, her creatinine, etc. She may also need to see specialists such as nephrologist, cardiologist, gastroenterologist—they can order more niche tests. She may also need a bone density scan to be sure there aren’t signs of osteopenia. Be diligent. There is more harm done than meets the eye, trust me.",
      "created_utc": 1682757170.0,
      "score": 18,
      "context": [
        {
          "id": "ji4ez6h",
          "author": "rileyyj001",
          "body": "Do NOT base her health solely on labs. I am so severely ill with anorexia (currently in kidney failure at age 32) and my labs STILL come back stable.",
          "created_utc": 1682726537.0
        },
        {
          "id": "ji5hmbs",
          "author": "BiZombieLuna",
          "body": "Thank you for this. May i ask what i can request the doctor to look at?",
          "created_utc": 1682746381.0
        }
      ]
    },
    {
      "id": "ji8h1n2",
      "author": "NeedleworkerBig7898",
      "body": "If you can find a Dr that specializes in EDs it’s even better because they’ll know what to look for. I say so many doctors who dismissed my concerns because my labs were within “normal” range. However once I found an ED specialist he actually read my labs and saw that while they were within limits my values were not what they should have been for my age and I was nearing heart and kidney failure. Also labs are based on standard deviation so they only show as abnormal if you’re a part of the 2.5% of the population with values which are high or low. Unfortunately unless it’s flagged by the system, doctors don’t tend to look at them.",
      "created_utc": 1682806255.0,
      "score": 3,
      "context": [
        {
          "id": "ji4ez6h",
          "author": "rileyyj001",
          "body": "Do NOT base her health solely on labs. I am so severely ill with anorexia (currently in kidney failure at age 32) and my labs STILL come back stable.",
          "created_utc": 1682726537.0
        },
        {
          "id": "ji5hmbs",
          "author": "BiZombieLuna",
          "body": "Thank you for this. May i ask what i can request the doctor to look at?",
          "created_utc": 1682746381.0
        }
      ]
    },
    {
      "id": "ji4dwi9",
      "author": "None",
      "body": "That's great to know. Has her therapist figured out the root cause of this, besides \"not wanting to be fat like you\"? Maybe there was something else making her a bit sad back when it started? I hope your daughter gets over this quickly, and it becomes nothing but a tiny phase in her early childhood🙏🏼",
      "created_utc": 1682726043.0,
      "score": 12,
      "context": [
        {
          "id": "ji4cyq2",
          "author": "None",
          "body": "You need to get her to a pediatrician asap if you haven't yet because caloric restriction may delay her growth or stunt it",
          "created_utc": 1682725616.0
        },
        {
          "id": "ji4det8",
          "author": "BiZombieLuna",
          "body": "She is. She sees her pediatrician once a month because of this. She gets labs done every 3 months too those all come back good too",
          "created_utc": 1682725821.0
        }
      ]
    },
    {
      "id": "ji6ey3j",
      "author": "gaylikeamity",
      "body": "I wish you guys the best of luck <3",
      "created_utc": 1682772606.0,
      "score": 1,
      "context": [
        {
          "id": "ji55xx0",
          "author": "gaylikeamity",
          "body": "I’d recommend having her see a dietitian and start talk therapy. If it continues to worsen or really impact her health it may be worth looking for more extensive treatment options.",
          "created_utc": 1682739277.0
        },
        {
          "id": "ji5ijw5",
          "author": "BiZombieLuna",
          "body": "I'll call monday to get her in",
          "created_utc": 1682747057.0
        }
      ]
    },
    {
      "id": "ji5imfw",
      "author": "Physical_Rice919",
      "body": "Well, everybody is different. It's a very unique disorder in that way. I just know that personally, for me, comments made me dread eating in front of others. There's a possibility that it might not apply to her, so take it with a grain of salt. If possible, maybe you could ask her if anything makes her anxious or embarrassed?",
      "created_utc": 1682747111.0,
      "score": 3,
      "context": [
        {
          "id": "ji5fgwt",
          "author": "Physical_Rice919",
          "body": "I've suffered with bulimia since I was 11 (currently 18). I want to advise you heavily not to comment when she eats more than usual (if she ever does). Or when she eats in general. This illness (especially anorexia) is a way for her to have control. In most cases, it's a subcategory of OCD. If you're really strict on her, it may make it worse because she feels stuck and ashamed when you mention food or her appearance. She might start hiding what she does eat from you. Try your best not to make comments and give her space during meals. It's very stressful on a person with an eating disorder to be asked little things like \"what do you got there? What are you eating? Etc.\n\nI started out anorexic. Then, I eventually developed a binge eating disorder, which then turned into me puking my guts out after every meal. It is isolating and scary, and you feel stuck in a cycle. \n\nPlease be patient with her. She can not control a lot of her thoughts properly. If it's been as long as 3 years, she's trained her brain to associate things together. She rewired her brain to view food as an enemy. In her mind, she thinks she doesn't deserve food or she's not worthy of being happy in general. \n\nI'm still struggling every day, so I don't have the answers. But I do know that it's a very lonely road, especially when no one around you understands why you act the way you do.\n\nIf you have any questions. I might be able to help you understand her better. Feel free to dm me anytime. I wish you and your daughter the best.",
          "created_utc": 1682744929.0
        },
        {
          "id": "ji5hh9d",
          "author": "BiZombieLuna",
          "body": "Thank you for sharing that with me. I'm not even sure where to begin with questions. I will talk to my fiance about that too. He's asked her several times what she got to eat during the day. She usually happily tells him. I'm the one who's in control of her meals. I think its always been a year since she's ate more than half a plate of something. I don't remember if i said anything about it, its been so long ago. But i more than likely did. So if out ever happens again I'll make sure to not say anything",
          "created_utc": 1682746279.0
        }
      ]
    },
    {
      "id": "ji7lmsc",
      "author": "badlydrawndee",
      "body": "I’m a small fat daughter of a fat mother. The biggest impact on me came not from anyone shaming ME directly but from my mom constantly lamenting her fat body in my presence. I’m currently reading “Fat Talk: Parenting in the age of Diet Culture” in order to get my own weight shame under control it to avoid passing it on to my kids. Good luck 🤞🏻",
      "created_utc": 1682791946.0,
      "score": 1,
      "context": [
        {
          "id": "ji5gb0i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1682745473.0
        },
        {
          "id": "ji5gwcq",
          "author": "BiZombieLuna",
          "body": "I'm in therapy too. An I'll definitely get some books. I wish she would tell me or even her therapist what happened.",
          "created_utc": 1682745872.0
        }
      ]
    },
    {
      "id": "ji4e84j",
      "author": "BiZombieLuna",
      "body": "No her therapist hasn't. She tries but she just shuts down. I know one of my worries is her being bullied about me, or just in general. I know she's talked about being bullied for her hair.",
      "created_utc": 1682726187.0,
      "score": 17,
      "context": [
        {
          "id": "ji4cyq2",
          "author": "None",
          "body": "You need to get her to a pediatrician asap if you haven't yet because caloric restriction may delay her growth or stunt it",
          "created_utc": 1682725616.0
        },
        {
          "id": "ji4det8",
          "author": "BiZombieLuna",
          "body": "She is. She sees her pediatrician once a month because of this. She gets labs done every 3 months too those all come back good too",
          "created_utc": 1682725821.0
        },
        {
          "id": "ji4dwi9",
          "author": "None",
          "body": "That's great to know. Has her therapist figured out the root cause of this, besides \"not wanting to be fat like you\"? Maybe there was something else making her a bit sad back when it started? I hope your daughter gets over this quickly, and it becomes nothing but a tiny phase in her early childhood🙏🏼",
          "created_utc": 1682726043.0
        }
      ]
    },
    {
      "id": "ji5iwxa",
      "author": "BiZombieLuna",
      "body": "I'll keep trying. She doesn't always answer me and its usually a question I've come to ask her occasionally once a week but mostly once a month",
      "created_utc": 1682747322.0,
      "score": 3,
      "context": [
        {
          "id": "ji5fgwt",
          "author": "Physical_Rice919",
          "body": "I've suffered with bulimia since I was 11 (currently 18). I want to advise you heavily not to comment when she eats more than usual (if she ever does). Or when she eats in general. This illness (especially anorexia) is a way for her to have control. In most cases, it's a subcategory of OCD. If you're really strict on her, it may make it worse because she feels stuck and ashamed when you mention food or her appearance. She might start hiding what she does eat from you. Try your best not to make comments and give her space during meals. It's very stressful on a person with an eating disorder to be asked little things like \"what do you got there? What are you eating? Etc.\n\nI started out anorexic. Then, I eventually developed a binge eating disorder, which then turned into me puking my guts out after every meal. It is isolating and scary, and you feel stuck in a cycle. \n\nPlease be patient with her. She can not control a lot of her thoughts properly. If it's been as long as 3 years, she's trained her brain to associate things together. She rewired her brain to view food as an enemy. In her mind, she thinks she doesn't deserve food or she's not worthy of being happy in general. \n\nI'm still struggling every day, so I don't have the answers. But I do know that it's a very lonely road, especially when no one around you understands why you act the way you do.\n\nIf you have any questions. I might be able to help you understand her better. Feel free to dm me anytime. I wish you and your daughter the best.",
          "created_utc": 1682744929.0
        },
        {
          "id": "ji5hh9d",
          "author": "BiZombieLuna",
          "body": "Thank you for sharing that with me. I'm not even sure where to begin with questions. I will talk to my fiance about that too. He's asked her several times what she got to eat during the day. She usually happily tells him. I'm the one who's in control of her meals. I think its always been a year since she's ate more than half a plate of something. I don't remember if i said anything about it, its been so long ago. But i more than likely did. So if out ever happens again I'll make sure to not say anything",
          "created_utc": 1682746279.0
        },
        {
          "id": "ji5imfw",
          "author": "Physical_Rice919",
          "body": "Well, everybody is different. It's a very unique disorder in that way. I just know that personally, for me, comments made me dread eating in front of others. There's a possibility that it might not apply to her, so take it with a grain of salt. If possible, maybe you could ask her if anything makes her anxious or embarrassed?",
          "created_utc": 1682747111.0
        }
      ]
    }
  ]
}