{
  "id": "138s39c",
  "subreddit": "EatingDisorders",
  "author": "ThrowRApixie",
  "created_utc": 1683300362.0,
  "title": "I feel like people only take your ED seriously when you are at you smallest",
  "selftext": "Just a vent really \nI have had an eating disorder since my mid teens and I am in my mid 20s now. In that time I have been deathly thin and I have also had periods where I have acc been an extremely healthy weight, in fact probably a little over weight at one point. \nAn ED never goes away really imo, even when you are deemed “healthy” again. The crippling dysmorphia is still there, you just learn to deal with it but that doesn’t mean you can’t have episodes and off days with it.\nI remember finding it quite frustrating that I felt a little like my ex boyfriend used to behave like I was “making it up” or being “dramatic” when I’d have a breakdown about food as I suppose he had mostly known me whilst I was quite a healthy weight. I don’t think he quite fully understood how full of dread it could make me because I did not look unhealthy enough on the outside.\n\nI have had quite a bad relapse so I am currently at one of the smallest weights I’ve been at and it’s not only been notable to me that people are suddenly taking it seriously again but also one of the many thoughts making me reluctant to put weight on again is the fear that people will not take this huge part of my mental health seriously again if I appear too visibly healthy. It is frustrating and makes me sad so I am venting the thought here. Sorry if it didn’t make much sense.\n\nIt does not matter what weight you are, your struggle is so so valid and should be recognised x",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/138s39c/i_feel_like_people_only_take_your_ed_seriously/",
  "score": 186,
  "num_comments": 27,
  "comments": [
    {
      "id": "jizf4ax",
      "author": "None",
      "body": "I think that part of learning to deal with our eating disorders is realizing that using food as a way to manipulate and control how others perceive us or a way to control when we feel out of control is not healthy. It sounds like your bf isn’t taking your eating disorder seriously which is a shame but that doesn’t mean that you have to prove it to him either. I think a lot of us have felt like people don’t take our mental or physical illnesses seriously and feel the need to prove to them at some point but trying to prove to them only hurts ourselves and puts us further and further back into our destructive habits. I think learning to communicate more directly about how you feel about your body or how it makes you feel when he doesn’t take you seriously is important. If people still continue to disregard feelings or not take you seriously then there should probably be some boundaries put up between you and these people. This is all really difficult and like you said the eating disorder never fully goes away but learning to live with it and accept it and having people who understand that you can turn to can definitely make it a lot easier over time to nip in the butt. Hopefully this is helpful and you can use this time of people taking you seriously to help them understand what lead you here and how they could have helped more effectively to prevent this.",
      "created_utc": 1683305583.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jiz9eug",
      "author": "cleanhouz",
      "body": "You make perfect sense. This is just about exactly what I've experienced. It's really messed up. It's not fair, but I have to advocate for myself and be that much more forthcoming when I'm in a bigger body and struggling.",
      "created_utc": 1683303293.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jizlzgy",
      "author": "meltingrubberducks",
      "body": "I feel like what helped me eventually is i started to take it seriously all the time and constantly choose to fight I don't always make it but I stopped letting myself brand myself as better or fine when I am not at my absolute worst and starting seeing the progress and being proud",
      "created_utc": 1683308341.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jj0bkh5",
      "author": "None",
      "body": "Jokes on me nobody literally ever took my ED seriously… I weighed less as a 20 year old than i did when i was hospitalized at 14\n\nMy mom did not accept my diagnosis and still believes I never “had” a problem \n\nUnfortunately i have been struggling with ED behaviors since i was about 9-10 years old. and now i am 21.",
      "created_utc": 1683318890.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jj2o08d",
      "author": "Boosey0910",
      "body": "I think the most important thing we can do is to take our own ED's seriously.  If we wait to get \"too thin\" or for others to notice we are suffering then we deny ourselves good health NOW.  Recovery once and for all has to be done for US whatever others think is irrelevant.",
      "created_utc": 1683369560.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jiz896o",
      "author": "MeteorIntrovert",
      "body": "yeah that's unfortnuately true :( thing is no matter how our body looks rn whether we're at our smallest or biggest, the ed thoughts never really go away :/ i'm sorry you're going through that and i hope you can find peace and recovery soon.",
      "created_utc": 1683302828.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jiz9j3x",
      "author": "MiladyDisdain89",
      "body": "My diagnosis is technically Atypical Anorexia With Bulimic Behaviors, according to the therapist who finally diagnosed me a decade and a half into this,  so trust me,  I get it.  I have had multiple doctors tell me that I can't possibly be anorexic because I'm fat,  despite medical issues that make the weight almost impossible to lose regardless of how little I eat. Even at my skinniest, I was only down to 107lbs, and I was still curvy, it's just how I'm built.  I had visible bones,  I looked sick. But my BMI was still technically too high. So trust me,  I get being called an attention seeker. Even now,  after decades of self treatment, even my support people don't quite get it,  because they don't always understand that none of my behaviors are conscious at this point.  I'm not not eating on purpose. I just don't always get hunger signals,  so if I'm not hungry I forget that I'm supposed to eat,  so I just don't, unless someone reminds me. But my wife gets so frustrated,  and I don't think she gets it.  But to be fair,  it's hard to understand when you have no frame of reference.",
      "created_utc": 1683303339.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jj1p25t",
      "author": "pigsandunicorn",
      "body": "I feel this...I unfortunately went through a B/P earlier today, I'm running a healthy weight, decent size but yeah, they definitely seem to think it's only when your small that it's a problem.\n\nI went a solid 2 months, have to try and beat that this time around, I need my health.",
      "created_utc": 1683342978.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jj1r39u",
      "author": "Substantial-Suit-148",
      "body": "It is terrible, my friend was a very healthy weight and was the worse she ever was and passed away from bulimia. I think society just views people with eating disorders are deathly thin but its not true some of the sickest people struggling weren't deathly underweight. I've struggled for 25 years and just want people to understand its a mental illness and doesn't matter my weight. I totally get you but we are here for you! So sorry",
      "created_utc": 1683344109.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jj025g9",
      "author": "RetrauxClem",
      "body": "I don’t really have the words, but I hear you, I get what you’re saying, it makes perfect sense. Thank you for venting, I hope it helped. It definitely put a few thinks into perspective for me to hear it put that way. I hope things improve for you ❤️",
      "created_utc": 1683314950.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jj3d5m5",
      "author": "418Sunflower418",
      "body": "Totally relate to this. Low weight—careful not to say anything triggering, healthy or high weight—let’s say all the triggering things and make her life hell. People/family suck 😒🙄",
      "created_utc": 1683384126.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jizjrib",
      "author": "YearConsistent2894",
      "body": "I know exactly what you mean. I have been at a healthy weight and I have been not. I have struggled really bad while being at a normal bmi, and I’ve felt okay while being underweight. People tend to think that the severity of eating disorders is based on how you look. I got the diagnosis anorexia nervosa when I was underweight, but as soon as I hit a healthy weight, they changed it into atypical anorexia, which is so stupid and feeds the idea that you cannot be a ”real anorexic“ when you are at a normal weight. Nobody took me seriously when I was at my lowest mentally, just because I had a healthy bmi. But as soon as I got noticeably underweight, people seemed to care. Right now I am at my smallest and only now doctors are actually listening. Before that, I even got told that ”eating is obviously not my problem“.  So I totally understand how you feel. I hope you feel better soon!",
      "created_utc": 1683307442.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jjno28p",
      "author": "None",
      "body": "This is a major major issue, even in the mental health field. I did my undergraduate thesis paper on this topic. I not only found that this is an issue that really does exist for many people, but that whether someone is underweight, overweight, or normal weight has absolutely no link (at least among my sample of 100+ young women) to eating disordered thoughts/behaviors around food intake.",
      "created_utc": 1683753921.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjwxlpv",
      "author": "ejane27",
      "body": "I know exactly what you mean. I’m currently in the middle of a relapse that was triggered by some pretty serious health issues that made me lose weight. I keep getting positive comments even though I’ve been very sick both physically and mentally. It’s hard to recover when you KNOW you are harming yourself but everyone around you is praising you for it.",
      "created_utc": 1683921363.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jj652yj",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1683430633.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jlapxkz",
      "author": "EmmaHall031799",
      "body": "I’ve had this same experience. And in my mind it feels like I only matter to people when I’m at my lowest weight. Logicsllly I know that’s not true but my brain has learned to equate concern with care and it’s really hard to get out of that",
      "created_utc": 1684853583.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jm6f18d",
      "author": "Junior_Positive_1724",
      "body": "this makes so much sense. it’s the main reason i’m so terrified of gaining weight. it’s that desperate need to “prove” myself, as if i can’t tell people i have an eating disorder until i really “look” like i have one. at least for me, that obsession with proving myself consumes nearly every thought of my day. it’s a nightmare and it’s so overwhelming. you aren’t alone.",
      "created_utc": 1685435229.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmb4tk9",
      "author": "None",
      "body": "i relapsed recently,, i’ve been restricting and i’ve lost a lot of weight in an unhealthy way and all i hear is praises and difference in treatment :/ it makes me feel so bad cause i am on the chubbier side and have had bulimia for the last 6 years and is honestly so exhausting",
      "created_utc": 1685516643.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jizvs2i",
      "author": "Rosililly27",
      "body": "I think this is the most rational and proper answer! I saved it. Thank you 🙏🏼",
      "created_utc": 1683312327.0,
      "score": 6,
      "context": [
        {
          "id": "jizf4ax",
          "author": "None",
          "body": "I think that part of learning to deal with our eating disorders is realizing that using food as a way to manipulate and control how others perceive us or a way to control when we feel out of control is not healthy. It sounds like your bf isn’t taking your eating disorder seriously which is a shame but that doesn’t mean that you have to prove it to him either. I think a lot of us have felt like people don’t take our mental or physical illnesses seriously and feel the need to prove to them at some point but trying to prove to them only hurts ourselves and puts us further and further back into our destructive habits. I think learning to communicate more directly about how you feel about your body or how it makes you feel when he doesn’t take you seriously is important. If people still continue to disregard feelings or not take you seriously then there should probably be some boundaries put up between you and these people. This is all really difficult and like you said the eating disorder never fully goes away but learning to live with it and accept it and having people who understand that you can turn to can definitely make it a lot easier over time to nip in the butt. Hopefully this is helpful and you can use this time of people taking you seriously to help them understand what lead you here and how they could have helped more effectively to prevent this.",
          "created_utc": 1683305583.0
        }
      ]
    },
    {
      "id": "jj3755r",
      "author": "Nearby_Button",
      "body": "Well written and 100% true",
      "created_utc": 1683381290.0,
      "score": 2,
      "context": [
        {
          "id": "jj2o08d",
          "author": "Boosey0910",
          "body": "I think the most important thing we can do is to take our own ED's seriously.  If we wait to get \"too thin\" or for others to notice we are suffering then we deny ourselves good health NOW.  Recovery once and for all has to be done for US whatever others think is irrelevant.",
          "created_utc": 1683369560.0
        }
      ]
    },
    {
      "id": "jj27hkv",
      "author": "Haoma-Health",
      "body": "You're not an attention seeker. You are a survivor and a fighter.",
      "created_utc": 1683355147.0,
      "score": 6,
      "context": [
        {
          "id": "jiz9j3x",
          "author": "MiladyDisdain89",
          "body": "My diagnosis is technically Atypical Anorexia With Bulimic Behaviors, according to the therapist who finally diagnosed me a decade and a half into this,  so trust me,  I get it.  I have had multiple doctors tell me that I can't possibly be anorexic because I'm fat,  despite medical issues that make the weight almost impossible to lose regardless of how little I eat. Even at my skinniest, I was only down to 107lbs, and I was still curvy, it's just how I'm built.  I had visible bones,  I looked sick. But my BMI was still technically too high. So trust me,  I get being called an attention seeker. Even now,  after decades of self treatment, even my support people don't quite get it,  because they don't always understand that none of my behaviors are conscious at this point.  I'm not not eating on purpose. I just don't always get hunger signals,  so if I'm not hungry I forget that I'm supposed to eat,  so I just don't, unless someone reminds me. But my wife gets so frustrated,  and I don't think she gets it.  But to be fair,  it's hard to understand when you have no frame of reference.",
          "created_utc": 1683303339.0
        }
      ]
    },
    {
      "id": "jj26xp3",
      "author": "boomboomcoconut",
      "body": "Heyyy that was my diagnosis as well! But then subsequent therapists had never heard of such a thing",
      "created_utc": 1683354718.0,
      "score": 3,
      "context": [
        {
          "id": "jiz9j3x",
          "author": "MiladyDisdain89",
          "body": "My diagnosis is technically Atypical Anorexia With Bulimic Behaviors, according to the therapist who finally diagnosed me a decade and a half into this,  so trust me,  I get it.  I have had multiple doctors tell me that I can't possibly be anorexic because I'm fat,  despite medical issues that make the weight almost impossible to lose regardless of how little I eat. Even at my skinniest, I was only down to 107lbs, and I was still curvy, it's just how I'm built.  I had visible bones,  I looked sick. But my BMI was still technically too high. So trust me,  I get being called an attention seeker. Even now,  after decades of self treatment, even my support people don't quite get it,  because they don't always understand that none of my behaviors are conscious at this point.  I'm not not eating on purpose. I just don't always get hunger signals,  so if I'm not hungry I forget that I'm supposed to eat,  so I just don't, unless someone reminds me. But my wife gets so frustrated,  and I don't think she gets it.  But to be fair,  it's hard to understand when you have no frame of reference.",
          "created_utc": 1683303339.0
        }
      ]
    },
    {
      "id": "jj36pch",
      "author": "Nearby_Button",
      "body": "I'm so sorry for your loss.",
      "created_utc": 1683381075.0,
      "score": 1,
      "context": [
        {
          "id": "jj1r39u",
          "author": "Substantial-Suit-148",
          "body": "It is terrible, my friend was a very healthy weight and was the worse she ever was and passed away from bulimia. I think society just views people with eating disorders are deathly thin but its not true some of the sickest people struggling weren't deathly underweight. I've struggled for 25 years and just want people to understand its a mental illness and doesn't matter my weight. I totally get you but we are here for you! So sorry",
          "created_utc": 1683344109.0
        }
      ]
    },
    {
      "id": "jj7j3o0",
      "author": "village-idiom",
      "body": "Oh god. So sorry about your friend x",
      "created_utc": 1683466960.0,
      "score": 1,
      "context": [
        {
          "id": "jj1r39u",
          "author": "Substantial-Suit-148",
          "body": "It is terrible, my friend was a very healthy weight and was the worse she ever was and passed away from bulimia. I think society just views people with eating disorders are deathly thin but its not true some of the sickest people struggling weren't deathly underweight. I've struggled for 25 years and just want people to understand its a mental illness and doesn't matter my weight. I totally get you but we are here for you! So sorry",
          "created_utc": 1683344109.0
        }
      ]
    },
    {
      "id": "jk50wwu",
      "author": "ThrowRApixie",
      "body": "Omg I agree extremely hard. Since the two key triggering events last year I have lost such a huge amount of weight and those who don’t know about my history with eating keep telling me how good I look at the moment.\nIt does not help with the reluctance to put weight back on :(\nGood luck with your journey friend",
      "created_utc": 1684085464.0,
      "score": 1,
      "context": [
        {
          "id": "jjwxlpv",
          "author": "ejane27",
          "body": "I know exactly what you mean. I’m currently in the middle of a relapse that was triggered by some pretty serious health issues that made me lose weight. I keep getting positive comments even though I’ve been very sick both physically and mentally. It’s hard to recover when you KNOW you are harming yourself but everyone around you is praising you for it.",
          "created_utc": 1683921363.0
        }
      ]
    },
    {
      "id": "jjj0gek",
      "author": "ThrowRApixie",
      "body": "It is interesting hearing from someone else who also over exercises in the form of dance. I do it every night, my friends see it as a quirk and admittedly I do enjoy dancing by myself anyway but after I started timing it and ensuring I hit targets I realised it had subconsciously become part of the ED as well. Anyway I just hadn’t related to that in someone before.",
      "created_utc": 1683669915.0,
      "score": 1,
      "context": [
        {
          "id": "jj652yj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1683430633.0
        }
      ]
    },
    {
      "id": "jm6fh6o",
      "author": "Junior_Positive_1724",
      "body": "-from the way you phrased your post, i’m guessing you weren’t given a lot of validation as a kid. i say that because i wasn’t either, and as a child a LOT of my subconscious was dedicated to figuring out how to get my mother to notice me (my father was often gone and was never there when my mom abused me, so i wasn’t too worried about his opinion). i quickly discovered my mom was VERYYY obsessed with her physical appearance, and i assumed that if i also focused on myself like that, she would notice me. blah blah blah, she noticed after i was underweight, did nothing about it beyond jealous commentary, the cycle continues to repeat. it fucking sucks that you’re right. unless you’re bone thin no one will believe you. it feels so embarrassing.",
      "created_utc": 1685435611.0,
      "score": 1,
      "context": [
        {
          "id": "jm6f18d",
          "author": "Junior_Positive_1724",
          "body": "this makes so much sense. it’s the main reason i’m so terrified of gaining weight. it’s that desperate need to “prove” myself, as if i can’t tell people i have an eating disorder until i really “look” like i have one. at least for me, that obsession with proving myself consumes nearly every thought of my day. it’s a nightmare and it’s so overwhelming. you aren’t alone.",
          "created_utc": 1685435229.0
        }
      ]
    },
    {
      "id": "jj00ecw",
      "author": "None",
      "body": "🙏🏻✌🏻np",
      "created_utc": 1683314221.0,
      "score": 3,
      "context": [
        {
          "id": "jizf4ax",
          "author": "None",
          "body": "I think that part of learning to deal with our eating disorders is realizing that using food as a way to manipulate and control how others perceive us or a way to control when we feel out of control is not healthy. It sounds like your bf isn’t taking your eating disorder seriously which is a shame but that doesn’t mean that you have to prove it to him either. I think a lot of us have felt like people don’t take our mental or physical illnesses seriously and feel the need to prove to them at some point but trying to prove to them only hurts ourselves and puts us further and further back into our destructive habits. I think learning to communicate more directly about how you feel about your body or how it makes you feel when he doesn’t take you seriously is important. If people still continue to disregard feelings or not take you seriously then there should probably be some boundaries put up between you and these people. This is all really difficult and like you said the eating disorder never fully goes away but learning to live with it and accept it and having people who understand that you can turn to can definitely make it a lot easier over time to nip in the butt. Hopefully this is helpful and you can use this time of people taking you seriously to help them understand what lead you here and how they could have helped more effectively to prevent this.",
          "created_utc": 1683305583.0
        },
        {
          "id": "jizvs2i",
          "author": "Rosililly27",
          "body": "I think this is the most rational and proper answer! I saved it. Thank you 🙏🏼",
          "created_utc": 1683312327.0
        }
      ]
    }
  ]
}