{
  "id": "13bglw4",
  "subreddit": "EatingDisorders",
  "author": "GrapefruitPerfect149",
  "created_utc": 1683528430.0,
  "title": "Just don’t purge",
  "selftext": "Lmao that’s what my mom told me \n“How hard is it to just eat and not purge?”\n“Just eat a moderate amount”\n\nThank you mom, why haven’t I realize that, it’s so simple! \nEveryone is now cured! Guys, just don’t purge! It’s that SIMPLE.\n\n\nMom, I’ve been struggling with this ED for 5 years. And I’m pretty sure you can see how hard it is, otherwise, I wouldn’t be struggling rn.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/13bglw4/just_dont_purge/",
  "score": 119,
  "num_comments": 21,
  "comments": [
    {
      "id": "jjb7k9f",
      "author": "kikkelinkuningas",
      "body": "I HATE when people think eds are a choice like u think i CHOSE to be like this????",
      "created_utc": 1683532341.0,
      "score": 41,
      "context": []
    },
    {
      "id": "jjb3mj8",
      "author": "cookiecuttershark00",
      "body": "I’m sorry, that would be really hard for you. I think it’s really hard for people who have never experienced an eating disorder to understand how hard the behaviours are to stop and how ingrained they are. Before I had a longer term eating disorder (I had restrictive cycles prior but they never lasted long enough to cause concern), I was in psych wards a lot with girls who had anorexia and I couldn’t understand why they couldn’t “just eat”. Of course I never said anything to them but I didn’t understand. Then when I went through it I was able to understand a lot more.",
      "created_utc": 1683528883.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jjc4tkv",
      "author": "LeggoMyEggoGurl",
      "body": "I've gone from Binge Eating -> Not eating -> purging within the past year and a half, I don't do it often, but more times then 0 is still concerning, as well as my diet still being meh. It's hard for people to understand that I'm telling myself not to Purge while I'm running to the bathroom to do it anyway. It just sucks, sorry for the rant",
      "created_utc": 1683554390.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jjbsyqx",
      "author": "pistolpxte",
      "body": "Yeah…after I got over the hump of purging I became the go-to for my dad with my little sisters. I’m a guy, first of all. So my relating to an ED for a woman is only relegated to the fact that we both have ED. I have no idea how to advise anyone let alone someone experiencing different societal and social pressure. But he goes “well you got over it. Tell them how.” Meanwhile…looking in the mirror and sure I don’t purge but…yep super over it 🙄",
      "created_utc": 1683548547.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jjbcmu1",
      "author": "BarefootJacob",
      "body": "Sorry you have to put up with this.\n\n\"Can't you just not eat so much?\" - is a favourite of mine.  Along with \"You just need to cheer up!\" for depression.\n\nMy all time favourite tho was a nurse at a routine physical: \"Have you thought about trying to lose weight?\"",
      "created_utc": 1683536892.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jjbby2c",
      "author": "SnooCheesecakes7458",
      "body": "It's like these people think we enjoy having mental illnesses. If we could just stop being sick, we would. Next time she has a headache or something, just tell her to stop having one, like how hard is it to just not have the headache? Can't she just switch it off?",
      "created_utc": 1683536270.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jjbd4dz",
      "author": "houston_veronica",
      "body": "solidarity <3",
      "created_utc": 1683537330.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjcjh5e",
      "author": "pigsandunicorn",
      "body": "That is absolutely frustrating. I hate being the way I am but I'm getting better each day.",
      "created_utc": 1683560442.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjcujpk",
      "author": "InsignifigantBxtch",
      "body": "Omg thanks for the advice",
      "created_utc": 1683564815.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjcz001",
      "author": "None",
      "body": "Normies don’t get it but when I started getting better that’s just what I told myself.\nJust don’t purge. It did thankfully work for me (sometimes I do relapse but not as bad as I used to) so yeahhhhh",
      "created_utc": 1683566534.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjddptq",
      "author": "blondiesdiary",
      "body": "Yesssss. I hate when people tell me this. Do you think I’m dumb? I understand how it is supposed to go, I just can’t consistently do it right 🤡",
      "created_utc": 1683572228.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjdj93v",
      "author": "None",
      "body": "Omg the number of times I've heard this... 🤦🏻‍♀️🤦🏻‍♀️🤦🏻‍♀️",
      "created_utc": 1683574401.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjdxtmh",
      "author": "Usual-Effect1440",
      "body": "just eat, am I right\n\nthis shit happened in belgium: to help the economy , people who have an illness that doesn't allow them to work as normal should just recover. both my parents fall under it",
      "created_utc": 1683580105.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjenhl2",
      "author": "Rare_Web_8511",
      "body": "I have been with a loved one going on 27 years with Anorexia,  OCD, DEPRESSION  ETC. I can not imagine where he would be today if my attitude was like what I am reading here. ABSOLUTELY APPALLING.  These parents NEED to get their damn heads out of their asses and bloody well EDUCATE themselves.  My heart aches for each one of you. I don't understand why parent's (not all thank God) DON'T take enough interest in their loved ones 'hell' that they are experiencing.  It blows me away.  Shame on all of you parents. It will be another story when one of you dies.",
      "created_utc": 1683591285.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjevy5m",
      "author": "greasylisie",
      "body": "i used to literally become physically nauseous and end up throwing up because i would overthink and somehow convince my body i needed to puke.",
      "created_utc": 1683594981.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjfg9dh",
      "author": "Comfortable-Ebb-2859",
      "body": "Purging is addictive. You get a hit of endorphins every time you do it. Besides that there’s also the general ED voice and compulsions. \n\nIt is extremely hard. I’m currently relapsing .",
      "created_utc": 1683604688.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jlx4akj",
      "author": "zabranjenovoce",
      "body": "it is not simple, but it is possible if you come to some conclusions in your head. I did it.",
      "created_utc": 1685260201.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jn5lsna",
      "author": "dumbbitchjuice_14",
      "body": "I never thought of that! Thanks I’m cured. (Also as someone who has major depressive disorder I love when people are like “just be happy”).",
      "created_utc": 1686077914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjckf1l",
      "author": "Glittering-Pair-3887",
      "body": "nah fr my boyfriend literally gets mad at me for purging",
      "created_utc": 1683560822.0,
      "score": 5,
      "context": [
        {
          "id": "jjb7k9f",
          "author": "kikkelinkuningas",
          "body": "I HATE when people think eds are a choice like u think i CHOSE to be like this????",
          "created_utc": 1683532341.0
        }
      ]
    },
    {
      "id": "jjf64eb",
      "author": "Professional_Lowlife",
      "body": "Had a psychiatrist once ask me to try intermittent fasting to help with my depression. RIGHT AFTER I EXPLAINED MY THEN ONGOING STRUGGLE WITH ED. Sometimes I wonder if these medical professionals even hear themselves.",
      "created_utc": 1683599582.0,
      "score": 4,
      "context": [
        {
          "id": "jjbcmu1",
          "author": "BarefootJacob",
          "body": "Sorry you have to put up with this.\n\n\"Can't you just not eat so much?\" - is a favourite of mine.  Along with \"You just need to cheer up!\" for depression.\n\nMy all time favourite tho was a nurse at a routine physical: \"Have you thought about trying to lose weight?\"",
          "created_utc": 1683536892.0
        }
      ]
    },
    {
      "id": "jjfg2cb",
      "author": "BarefootJacob",
      "body": "That's just... wow.  It's jaw-dropping, isn't it?  My mind was whirling round all the different response that in the end I just look at the nurse blankly and said nothing.\n\n'Have you thought about losing weight?'.\n\n\"Oh, will thinking about it work, will that solve everything?  You know, I should give it a try!\" /s",
      "created_utc": 1683604582.0,
      "score": 2,
      "context": [
        {
          "id": "jjbcmu1",
          "author": "BarefootJacob",
          "body": "Sorry you have to put up with this.\n\n\"Can't you just not eat so much?\" - is a favourite of mine.  Along with \"You just need to cheer up!\" for depression.\n\nMy all time favourite tho was a nurse at a routine physical: \"Have you thought about trying to lose weight?\"",
          "created_utc": 1683536892.0
        },
        {
          "id": "jjf64eb",
          "author": "Professional_Lowlife",
          "body": "Had a psychiatrist once ask me to try intermittent fasting to help with my depression. RIGHT AFTER I EXPLAINED MY THEN ONGOING STRUGGLE WITH ED. Sometimes I wonder if these medical professionals even hear themselves.",
          "created_utc": 1683599582.0
        }
      ]
    }
  ]
}