{
  "id": "13c9f6y",
  "subreddit": "EatingDisorders",
  "author": "aria_watercolors",
  "created_utc": 1683590673.0,
  "title": "My husband said something triggering and I don’t know how to move on.",
  "selftext": "I have been doing so well with recovery for so long. With pregnancy and trying to be a role model for my daughter I have been so health focused rather than focused on how I looked. Tonight while eating dinner (it was taco night) my husband said as I was rolling up my taco “Wow you really stuffed it.” It was not ideal but I moved past it and took a bite. He then says Well when you’re hungry, you’re hungry.” and I completely shut down. In front of my daughter too. I didn’t want her to see me like that. I couldn’t finish dinner. And now I’m just laying in bed crying.\n\nI don’t know how to move past this. He’s apologized profusely. I know he didn’t mean unwell, but I’m so confused as to why he would say that when he’s well aware of my ED and my history. How do I work through this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/13c9f6y/my_husband_said_something_triggering_and_i_dont/",
  "score": 50,
  "num_comments": 9,
  "comments": [
    {
      "id": "jjersd4",
      "author": "euphoricbun",
      "body": "I think he was nervous and blurted things out, not being sick like us, he thinks normalizing the behaviors and human experience and being hungry is a normal human experience and so is eating. So I think he made a normie remark in a proud way of like \"What yeah cool you're doing the thing!\" and then he probably detected a shift and went on to chaotically try to normalize something he only views as good, normal, positive behavior.\n\nIt's good that our partners sometimes nudge us in uncomfortable ways, if they didn't it would mean they're closer to sick than healthy and we need them to be healthy so they can help us in their way like we all help in our own special ways, yk?\n\nI do relate to this pretty hard, I just have to try and put myself in their shoes and sometimes it helps.",
      "created_utc": 1683593135.0,
      "score": 49,
      "context": []
    },
    {
      "id": "jjfx9cn",
      "author": "caitlin_bree",
      "body": "Just wanted to say that I understand your frustration. It can be so deflating when you feel like you've made so much progress, and somebody's careless words stick like a dagger in your heart, causing whatever knock-on effect that has, moodwise.\n\nSince you, or he, can't undo what he said (though I'm sure he'd have taken it back, had he known the outcome) maybe try focusing on how well you've been doing, despite the comment.\n\nFor example, you came here for support. That's a real achievement, which takes understanding of a problem. \nIdentifying any problem is at the heart of it.. you can't do much until you know where to start. \nKnowing your triggers, and doing something actual when they are activated, takes a lot of courage.\nYou've shown knowledge, bravery, and resilience.\nYou might look at it as \"I don't know HOW to move on\", but what you're also saying is \"I WANT to move on\", and that strikes me as being the bigger, louder sentiment. (At least 60% of the full 100%)\n\nI don't want to reduce or dismiss your fears. I just don't want you to reduce or dismiss your efforts.\n\nSorry if this was light, in the way of \"actual\", \"practical\" help.\n\nI do have Dolly Parton looped as an earworm right now though, which always makes me feel more charitable towards my ex.. who is, after all, just a man.",
      "created_utc": 1683616257.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jjgmlxt",
      "author": "Training-Cry510",
      "body": "I don’t think he meant it like that, but I get it.",
      "created_utc": 1683635426.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jjietw0",
      "author": "wutifidontcare",
      "body": "Ya I would’ve kindly asked him to not comment on my eating…it takes so much effort to have a healthy relationship with food and you’ve come along way. Don’t let his comment interfere with your progress. And yes you’re allowed to scarf food down regardless of what you look like",
      "created_utc": 1683661460.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jjh2nil",
      "author": "Glittering-Pair-3887",
      "body": "he was probably joking but joking about sensitive topics isn’t good but i’m sure he didn’t mean to hurt you \njust watch out for if the behavior gets repetitive",
      "created_utc": 1683642728.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jjj68eb",
      "author": "ElectronicAddress611",
      "body": "My husband has made almost this exact comment about my recent taco building, but he was proud of me for attempting to eat such a big taco….maybe yours was also?  I know it’s hard to not assume the worst but it’s possible he was just excited to see you eat too?",
      "created_utc": 1683672481.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jjjkfu3",
      "author": "kimblebobstinkypantz",
      "body": "My husband will sometimes comment on how much I can eat… (I have a very good appetite). It isn’t his fault that I have attached so much trauma over the years to food. If I want to at the time. I  ask him to not make those comments and he seems to get it. Sometimes I let it go and realize that is a reminder that I l am not fully recovered yet and I use that to keep pushing myself.\n\nI’m sorry you were upset. I know that feeling all too well. Good luck. Maybe talk to your husband when you are calmer and own your own mood, but explain how you felt. Xo",
      "created_utc": 1683678861.0,
      "score": 0,
      "context": []
    },
    {
      "id": "jjfmvxf",
      "author": "Asspieburgers",
      "body": "100% this. He was likely stoked that OP had loaded it up. I know I would be if my girlfriend had stuffed a taco she intended to eat, let alone eaten it",
      "created_utc": 1683608545.0,
      "score": 24,
      "context": [
        {
          "id": "jjersd4",
          "author": "euphoricbun",
          "body": "I think he was nervous and blurted things out, not being sick like us, he thinks normalizing the behaviors and human experience and being hungry is a normal human experience and so is eating. So I think he made a normie remark in a proud way of like \"What yeah cool you're doing the thing!\" and then he probably detected a shift and went on to chaotically try to normalize something he only views as good, normal, positive behavior.\n\nIt's good that our partners sometimes nudge us in uncomfortable ways, if they didn't it would mean they're closer to sick than healthy and we need them to be healthy so they can help us in their way like we all help in our own special ways, yk?\n\nI do relate to this pretty hard, I just have to try and put myself in their shoes and sometimes it helps.",
          "created_utc": 1683593135.0
        }
      ]
    },
    {
      "id": "jo7r859",
      "author": "caitlin_bree",
      "body": "That was Tammy Wynette. ..I know I'm not the only person to confuse the two on that song.",
      "created_utc": 1686829300.0,
      "score": 1,
      "context": [
        {
          "id": "jjfx9cn",
          "author": "caitlin_bree",
          "body": "Just wanted to say that I understand your frustration. It can be so deflating when you feel like you've made so much progress, and somebody's careless words stick like a dagger in your heart, causing whatever knock-on effect that has, moodwise.\n\nSince you, or he, can't undo what he said (though I'm sure he'd have taken it back, had he known the outcome) maybe try focusing on how well you've been doing, despite the comment.\n\nFor example, you came here for support. That's a real achievement, which takes understanding of a problem. \nIdentifying any problem is at the heart of it.. you can't do much until you know where to start. \nKnowing your triggers, and doing something actual when they are activated, takes a lot of courage.\nYou've shown knowledge, bravery, and resilience.\nYou might look at it as \"I don't know HOW to move on\", but what you're also saying is \"I WANT to move on\", and that strikes me as being the bigger, louder sentiment. (At least 60% of the full 100%)\n\nI don't want to reduce or dismiss your fears. I just don't want you to reduce or dismiss your efforts.\n\nSorry if this was light, in the way of \"actual\", \"practical\" help.\n\nI do have Dolly Parton looped as an earworm right now though, which always makes me feel more charitable towards my ex.. who is, after all, just a man.",
          "created_utc": 1683616257.0
        }
      ]
    }
  ]
}