{
  "id": "13elut9",
  "subreddit": "EatingDisorders",
  "author": "Chloraiscool",
  "created_utc": 1683807824.0,
  "title": "Horrible cycle of overeating and not eating at all",
  "selftext": "I'm not sure if this really counts as an eating disorder so if someone could tell me whether or not this is an actual issue I should be worried about\n\nEvery time I look in the mirror I get really self conscious and end up starving myself for the rest of the day, and then I go to bed, and the next day I feel like I eat way too much. Its weird.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/13elut9/horrible_cycle_of_overeating_and_not_eating_at_all/",
  "score": 53,
  "num_comments": 14,
  "comments": [
    {
      "id": "jjrqguc",
      "author": "No-Sympathy-7508",
      "body": "I have been experiencing an ed for 5 years, and, yeah, I do have exactly the same situation as you.",
      "created_utc": 1683828711.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jjqgiyk",
      "author": "Decent-Poetry3190",
      "body": "Yep, that’s a type of Bulimia. You’re bingeing and then effectively purging by not eating. You need to eat regularly so you don’t become super hungry, I know it’s difficult but sending strength.",
      "created_utc": 1683809901.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jjr8uwo",
      "author": "MindyS1719",
      "body": "I have the same type of ED. It’s called “binge eating with restricting”. It is something to worry about. Currently in recovery, hopefully you can get out of the cycle someday too. I know it’s hard. Definitely talk with your doctor or therapist about it, they can hopefully lead you in the right direction for recovery.",
      "created_utc": 1683821765.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jjtk62g",
      "author": "LittleWorld_Fire2030",
      "body": "I am right there with you. Just becoming aware of how this thinking has been my companion forever  \n\nCurrently using an App called “I Am Sober”. 1 day and 20 min down. Today I ate dinner and then ate 6 gummy worms instead of the whole package. It was so hard. I have kids in the house and don’t want to not allow stuff like that in the house bc I have such a huge problem with it being there. \n\nGood luck to you!",
      "created_utc": 1683856759.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jjqqtvt",
      "author": "juicebox275",
      "body": "sounds like an ED.",
      "created_utc": 1683814543.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjrtc3j",
      "author": "kgirl244",
      "body": "I have this too :( I’ve been in treatment for six months now with a registered dietician and therapist who specializes in eating disorders. It’s really helped, but every  day is a fight to not restrict/ binge later.",
      "created_utc": 1683829843.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjte8ln",
      "author": "mindfullymoving",
      "body": "I used to do this; the binge / restrict cycle. It was definitely part of my eating disorder.\nThe good news is there is hope and there is full recovery. You can do this 💖",
      "created_utc": 1683854076.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjzi3ny",
      "author": "None",
      "body": "Yes it is an issue. This is why I thought I didn't have a legitimate ED because I didn't have \"enough willpower\" for anorexia but didn't have BED because of the restricting cycles. One day I just decided to stop restricting and stop making out new diets. I realized I was acting irrational and that all my choices have led me NOWHERE. I started to eat normally or at least tried. I was still obsessed with food but a very important thing was, I started to recognize ED thoughts and decided to ignore them as much as possible. \n\nJust a few weeks ago I realized how my brain has started to turn normal and my hunger cues weren't so messed up anymore. I stopped being so obsessed with food. Like, any time I'd make plans with someone I only thought about food. Now, I look forward to eating tasty stuff but it doesnt dominate my life as much. There are also a lot of stuff I did and felt but I dont wanna get into the details right now. You can message me privately if you want.\n\nI'm STILL recovering and have a long road ahead. But a HUGE win for me is the fact I decided to start ignoring that stupid ass fucking ED voice in my head. So if you're wondering is it possible to get out of this?? 100%. Is it simple? It's literally simple. Is it easy? Not at all. But worth it.",
      "created_utc": 1683976061.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjqgna7",
      "author": "cleanhouz",
      "body": ">starving myself\n\nThis is an indicator of an eating disorder, yes. Your body is trying to regulate. It thinks food is scarce so it is taking in as much food as it can when food is available. Please consider getting some professional help with this before it gets worse. EDs hijack life.",
      "created_utc": 1683809958.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjrlk6z",
      "author": "BoatDizzy3989",
      "body": "I am in ur shoes rn, jus ate my first meal in abt a day and it was a few fries. I don’t have advice or know how to help but your not alone. And you are amazing how u are",
      "created_utc": 1683826761.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jjsr2z5",
      "author": "mynameisetoni",
      "body": "I'm exactly in the same circumstances than you.\nI tend to eat a very little amount of food but after an hour or two I star feeling terribly hungry and I start binging... It's horrible when you realize what have you just done",
      "created_utc": 1683843399.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjucv94",
      "author": "nextstationisend",
      "body": "yeah, that’s ED..",
      "created_utc": 1683873412.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jjziccm",
      "author": "None",
      "body": "From a recovering person, eating enough regularly is THE KEY. Just yesterday I ate too little for breakfast and lunch and got major binging urges in the evening thinking \"damn it i'm back on that bullshit\". It's so hard to eat enough cause you feel so good when you eat little. It's important to recognize that sense of achievement as an ED thought that temporarily makes you feel good.",
      "created_utc": 1683976238.0,
      "score": 2,
      "context": [
        {
          "id": "jjqgiyk",
          "author": "Decent-Poetry3190",
          "body": "Yep, that’s a type of Bulimia. You’re bingeing and then effectively purging by not eating. You need to eat regularly so you don’t become super hungry, I know it’s difficult but sending strength.",
          "created_utc": 1683809901.0
        }
      ]
    }
  ]
}