{
  "id": "13i5qa4",
  "subreddit": "EatingDisorders",
  "author": "Itsasecret123456789",
  "created_utc": 1684150723.0,
  "title": "After disclosing my mental health struggles, my academic supervisor told me I looked better since losing weight.",
  "selftext": "Just some context, I have battled with eating disorders for the past decade. \n\nDuring a meeting with my academic supervisor, I disclosed some mental health struggles since experiencing financial difficulties to pay for my course. She asked offhandedly if I had lost weight. I was a bit surprised she asked but I answered that yes I had lost weight. She replied that it “looked good on me” and that it’s a “silver lining” to my struggles. I honestly don’t know what to think, as I feel this is so inappropriate to say someone?!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/13i5qa4/after_disclosing_my_mental_health_struggles_my/",
  "score": 76,
  "num_comments": 11,
  "comments": [
    {
      "id": "jk87hbo",
      "author": "Excellent-World-476",
      "body": "OMG. Sometime people need to keep their mouth shut.",
      "created_utc": 1684151431.0,
      "score": 44,
      "context": []
    },
    {
      "id": "jk8qrbv",
      "author": "xbrosia93",
      "body": "I’m sorry that sucks ass, she shouldn’t make comments on your weights ESPECIALLY in that setting, when you were discussing MENTAL HEALTH. It didn’t occur to her in her incompetent mind, that it could be a trigger. Sorry, I would SWITCH advisors asap and tell her why your doing it, so next time she will think before she opens her stupid mouth and hurt another student",
      "created_utc": 1684161290.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jk8ntyt",
      "author": "lexablether",
      "body": "Ugh, I’m so sorry that happened to you. Diet culture really has so many people brainwashed.",
      "created_utc": 1684159945.0,
      "score": 24,
      "context": []
    },
    {
      "id": "jk92ugf",
      "author": "cleanhouz",
      "body": "My boss commented on my weight loss a few months ago. I just looked at her in silence until it got awkward. I think people are becoming more aware of how inappropriate comments like this are but it's not happening fast enough for me.",
      "created_utc": 1684167457.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jk94fmr",
      "author": "Northstar04",
      "body": "yikes",
      "created_utc": 1684168249.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jk96rh5",
      "author": "YearConsistent2894",
      "body": "What the fuck. I am sorry she said that to you, that is not okay at all. Especially since you were talking about your mental health. I guess some people should just not talk if they don’t have a single braincell left to think about how their words could hurt someone. I‘ve made similar experiences. One told me she‘s jealous of my loss of appetite while I was struggling immensely.",
      "created_utc": 1684169638.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jka89t2",
      "author": "ejane27",
      "body": "yeah no, that’s super inappropriate. your body size has nothing to do with your academic performance?! what on earth is wrong with people.",
      "created_utc": 1684184491.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jkao7pk",
      "author": "sptani",
      "body": "i'm so sorry idk how she could be so tactless but ik it's hard people keep bringing up how much weight i've lost but it makes me so uncomfortable when they assume it was something positive",
      "created_utc": 1684191353.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jkc3mzw",
      "author": "None",
      "body": "What the actual fuck, that’s not helpful. I’m sorry",
      "created_utc": 1684219074.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jkcpjxe",
      "author": "Indy_Anna",
      "body": "No that is not ok. I am so over people making comments about other peoples bodies. Do NOT make comments about a person's body unless you know for sure that it is wanted. You never know peoples' internal struggles with their physical image. \n\nWe are trying to get my MIL to stop talking about her grandkids bodies. We do not want to give them complexes like I have. It's so hard for her to not say something about their physical appearances.",
      "created_utc": 1684236899.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jnzkysz",
      "author": "Savings_Paper_7432",
      "body": "She sounds like she’s going through some stuff herself. Nonetheless, she needs to check what she says to students in light of her role as a student advisor… bruh",
      "created_utc": 1686659761.0,
      "score": 1,
      "context": []
    }
  ]
}