{
  "id": "13lukn2",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1684500620.0,
  "title": "Is my young teen daughter becoming anorexic?",
  "selftext": "Hello there 👋🏼 and thank you in advance for taking the time to reply, if you can. My 14 year old daughter has been getting thinner this last year, and eating less and less: I give her protein bara to take to school and sometimes she takes salmon or tuna salad: in the evenings she does eat with us whatever protein I’m keen on serving. But I am worried that she is becoming anorexic in front of me and I might miss it: she looks thin but not sick, exercises a lot and has all but stopped eating bread; she does cook herself eggs everyday and says she is making sure she eats enough but I am a bit loss, so I thought I’d ask you guys your opinion: should I worry more and take her directly to therapy?, what should I do?\nThank you 💖",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/13lukn2/is_my_young_teen_daughter_becoming_anorexic/",
  "score": 69,
  "num_comments": 40,
  "comments": [
    {
      "id": "jks0a8v",
      "author": "ReliefJaded8491",
      "body": "Your concern shows you are a good parent, and you are paying attention. She’s already got better odds than a lot of people just from that alone. It’s a tough subject to bring up but there are gentle ways to go about it. You could always start with a doctors visit and see how she is doing health-wise. I would recommend calling the doctors office ahead of time to  share your concerns privately. You could frame it to her as a regular checkup, but if the doctor is aware of your concerns, they can order specific ED-related blood tests. In regards to talking to her about it, often times if too much focus is put on food or weight, patients can shut down or deny. Focus on her feelings, her other behaviors. How is she doing? What are her stressors? How does she cope with stress? And listen without judgement. If she does have disordered eating, she may not even know it. It’s tough but she is lucky to have you as a parent!",
      "created_utc": 1684507276.0,
      "score": 54,
      "context": []
    },
    {
      "id": "jkrqkmn",
      "author": "He_who_humps",
      "body": "You are right to be concerned. It may be nothing, but it’s worth investigating. I would not confront her about it yet. Spend a few days tracking, as best you can, her daily intake. If you can’t visually confirm that she ate something, note that, so you can compare later. You should start to get an idea of her daily calories. It should be around 2000. Many parents will tell you not to snoop, but sometimes you have to. Look for evidence of food hiding and diuretics.  If your investigation doesn’t yield anything, you might consider making an appointment with a dietician so you can help her diet properly. If she resists passionately that may be a hint. Watch for unhealthy hair, bowel movement issues, and irregular periods. Remember that lots of teenage girls experiment with wacky dieting, and only a small percentage develop an eating disorder. It’s definitely worth watching closely, though. I wish I had paid more attention when my daughter was developing hers. We didn’t figure it out until she was pretty deep into it. I wish you the best.",
      "created_utc": 1684503324.0,
      "score": 54,
      "context": []
    },
    {
      "id": "jksb9y0",
      "author": "nougatandcrumpets",
      "body": "Hello! ED dietitian here! What you are mentioning sounds like the beginning of some disordered eating at minimum but can be the road to an ED so you are right to have picked up on this! One thing that we do know in the ED speciality is that early intervention is best but this does not have to be invasive. \n\nI think it's important to keep open communication with teens because it is an especially difficult time for children that can if not approached correctly could make them shut down with you. I would take a few days to look through what she is picking and just increasing curiosity around why she is choosing what she is choosing and you can learn a lot from just this. Often times I find teens being influenced by not only their environment (family, friends, school) but also social media on posts such as \"what I eat in a day\" or \"what is healthy eating\" and they are getting a lot of incorrect nutrition information that they might be valuing too much. Especially with the no eating bread because that sounds very much as what I hear daily from my patients and their family on foods that they try to avoid because they are not healthy. With increasing curiosity you could get a lot of information and then can offer your thoughts around \"why don't we get a dietitian to see what their opinions are on what you should be eating\" - I find that at the beginning of this work dietitians are welcomed by patients because they don't see anything wrong with what foods they are restricting and they want someone to tell them what to eat, this is a great first step because through some session the dietitian will be able to determine if a therapist will be needed or if it is just some need of knowledge on food. Make sure it is an ED dietitian because like every field there are plenty of dietitians that are very diet cultured. \n\nAnother thought is setting up a annual visit with the PCP that way you can determine medical state and weight without it being an invasive decision of \"oh no you are losing weigh lets go to the doctor\" because that can make your teen shut down. After getting this information the doctor will mention is there are any big changes or they might give some education around how children are not supposed to be losing weight as per proper growth and puberty which could be another way for you to approach the dietitian/therapist idea. \n\nSome other things to watch out for are: ideas around healthy or good foods only or clean eating, why is she exercising more? this could point to \"summer body\" or an event, is she performing any food rituals such as not cooking the eggs with oils, is she blotting food with grease, is she breaking apart food, is she choosing low fat or no sugar items etc. \n\nGood luck!",
      "created_utc": 1684511462.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jksepbv",
      "author": "Lou-eez-",
      "body": "When I was 14 I started becoming thinner. It wasn't that bad at first until I developed body dysmorphia. At that point, my body was never good enough and I became very obsessive about what I ate. My mom suspected that I had anorexia and handled it like an idiot, only making it worse, so I can only really tell you what not to do.\n\nMy mom would call me \"too skinny\", say I \"looked like a circus freak,\" and say stupid stuff about how boys like girls with meat on their bones. She also constantly asked me about what I ate, which was extremely annoying to me and only made me be more secretive. So don't do that lol. You need to show that you care in a gentle way that won't make her defensive",
      "created_utc": 1684512752.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jkt6ym9",
      "author": "CarelessPerception",
      "body": "Just adding a tip - a lot of my eating disorder was linked to my low self worth and anxiety + need for control. I wonder if she has any of those threads? And if there’s a way to constantly communicate her whole-ness for you. Is she striving to get perfect grades? Under pressure in other ways? I know people with perfect parents develop EDs too, but I was taught that love is conditional and it contributed to my utter lack of self worth. So maybe looking at any implicit messages she might be taking in - not just from you!! You sound wonderful - and seeing what ways you can boost her up.",
      "created_utc": 1684523537.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jksgyfh",
      "author": "BookLover1888",
      "body": "What would happen if you tried sending a pop tart or a peanut butter banana sandwich instead of the protein bar in the morning? Or had sloppy joe or a tuna casserole for dinner instead of just the protein item alone? \n\nHer current diet seems really protein heavy from what you described - this was the hallmark of my ED tbh (restrictive anorexia for 10 years). Protein is super low calorie for how physically filling it is - very similar to insoluble carbs / dietary fiber (vs sugars). I used to feel physically full on >!800cal!< of dietary fiber + protein a day. Fats and carbs are awesome because they're both filling (moreso fats) *and* calorically dense, which is why I used to avoid them.\n\nMay be worth considering - the behavior you described sounds eerily familiar.",
      "created_utc": 1684513598.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jktaory",
      "author": "None",
      "body": "sounds like me when i was deep in my eating disorder. definitely check in but don’t pressure her it’ll push her away",
      "created_utc": 1684525005.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jkujyv6",
      "author": "UselessHuman1",
      "body": "First of all, you are one heck of a good parent! Seriously! Thank you for being so attentive to your daughter. ❤️\n\nYour instinct is probably right. She seems to have issues with food that goes beyond the usual \"diet\" thing. I would at least take her to a GP to have tests done and to monitor her. You are right. Therapy might be a good idea. Personally, I would make sure it's someone who knows eating disorders. It is *very* easy to \"manipulate \" a therapist who knows nothing about Eds.  Also, it would be a lot more helpful from the start. If you think it's getting worse to the point of being dangerous, don't hesitate to go to the ER. Eds are not just weight. She might still be in a visual good shape, but her organs will end up suffering. ❤️",
      "created_utc": 1684544781.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jky7dvy",
      "author": "sparklyfirefly",
      "body": "https://www.butterflymind.org/published resources for parents here !!! I hope this helps",
      "created_utc": 1684616496.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jkw1s9j",
      "author": "Boosey0910",
      "body": "Arm yourself with some information.  \"Your Dieting Daughter\" is a book I highly recommend.",
      "created_utc": 1684580904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jkw2a66",
      "author": "dreaminghigher",
      "body": "as an anorexic, i think this could be a begining to some kind of eating disorder. I think that you shouldn't confront her about it right now, but maybe pay a little bit more attention about how many calories she could be eating a day. If the amount is going to be concerning for a few days in a row, talk to her carefully. Ask, if she struggles and show your interest in her good. Just have a honest talk and if she admits that she may have some kind of disordered, sign her up to go and see a therapist/doctor and that will probably be a way to recover. It's great that you see all of the signs because then you may catch it earlier and there won't be as many consequences of the sickness in the future. You are an awesome parent for caring. Mine didn't to that for me and it's so good to see that a lot of parents take this seriously. Wishing that this thing was only a concern and everything is fine!!!!",
      "created_utc": 1684581267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jkrq9m7",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1684503191.0,
      "score": -1,
      "context": []
    },
    {
      "id": "jks8sgy",
      "author": "None",
      "body": "this is so helpful!!! thank you!!! I’ll follow your advice 100%👍🏽👍🏽👍🏽",
      "created_utc": 1684510532.0,
      "score": 13,
      "context": [
        {
          "id": "jks0a8v",
          "author": "ReliefJaded8491",
          "body": "Your concern shows you are a good parent, and you are paying attention. She’s already got better odds than a lot of people just from that alone. It’s a tough subject to bring up but there are gentle ways to go about it. You could always start with a doctors visit and see how she is doing health-wise. I would recommend calling the doctors office ahead of time to  share your concerns privately. You could frame it to her as a regular checkup, but if the doctor is aware of your concerns, they can order specific ED-related blood tests. In regards to talking to her about it, often times if too much focus is put on food or weight, patients can shut down or deny. Focus on her feelings, her other behaviors. How is she doing? What are her stressors? How does she cope with stress? And listen without judgement. If she does have disordered eating, she may not even know it. It’s tough but she is lucky to have you as a parent!",
          "created_utc": 1684507276.0
        }
      ]
    },
    {
      "id": "jks93yl",
      "author": "None",
      "body": "thank you for the advice! 💪🏼👍🏽👍🏽👍🏽👍🏽",
      "created_utc": 1684510651.0,
      "score": 10,
      "context": [
        {
          "id": "jkrqkmn",
          "author": "He_who_humps",
          "body": "You are right to be concerned. It may be nothing, but it’s worth investigating. I would not confront her about it yet. Spend a few days tracking, as best you can, her daily intake. If you can’t visually confirm that she ate something, note that, so you can compare later. You should start to get an idea of her daily calories. It should be around 2000. Many parents will tell you not to snoop, but sometimes you have to. Look for evidence of food hiding and diuretics.  If your investigation doesn’t yield anything, you might consider making an appointment with a dietician so you can help her diet properly. If she resists passionately that may be a hint. Watch for unhealthy hair, bowel movement issues, and irregular periods. Remember that lots of teenage girls experiment with wacky dieting, and only a small percentage develop an eating disorder. It’s definitely worth watching closely, though. I wish I had paid more attention when my daughter was developing hers. We didn’t figure it out until she was pretty deep into it. I wish you the best.",
          "created_utc": 1684503324.0
        }
      ]
    },
    {
      "id": "jky6chx",
      "author": "Virtual-wren",
      "body": "Should not be around 2000 unless she is exercising. That would have her gaining weight at her age. Unless she is underweight 1600-1700",
      "created_utc": 1684616030.0,
      "score": -2,
      "context": [
        {
          "id": "jkrqkmn",
          "author": "He_who_humps",
          "body": "You are right to be concerned. It may be nothing, but it’s worth investigating. I would not confront her about it yet. Spend a few days tracking, as best you can, her daily intake. If you can’t visually confirm that she ate something, note that, so you can compare later. You should start to get an idea of her daily calories. It should be around 2000. Many parents will tell you not to snoop, but sometimes you have to. Look for evidence of food hiding and diuretics.  If your investigation doesn’t yield anything, you might consider making an appointment with a dietician so you can help her diet properly. If she resists passionately that may be a hint. Watch for unhealthy hair, bowel movement issues, and irregular periods. Remember that lots of teenage girls experiment with wacky dieting, and only a small percentage develop an eating disorder. It’s definitely worth watching closely, though. I wish I had paid more attention when my daughter was developing hers. We didn’t figure it out until she was pretty deep into it. I wish you the best.",
          "created_utc": 1684503324.0
        }
      ]
    },
    {
      "id": "jksc0ms",
      "author": "None",
      "body": "Thank you so much! I have a much clearer picture of what to do and how to approach her 👌🏽 thanks again!!!",
      "created_utc": 1684511742.0,
      "score": 6,
      "context": [
        {
          "id": "jksb9y0",
          "author": "nougatandcrumpets",
          "body": "Hello! ED dietitian here! What you are mentioning sounds like the beginning of some disordered eating at minimum but can be the road to an ED so you are right to have picked up on this! One thing that we do know in the ED speciality is that early intervention is best but this does not have to be invasive. \n\nI think it's important to keep open communication with teens because it is an especially difficult time for children that can if not approached correctly could make them shut down with you. I would take a few days to look through what she is picking and just increasing curiosity around why she is choosing what she is choosing and you can learn a lot from just this. Often times I find teens being influenced by not only their environment (family, friends, school) but also social media on posts such as \"what I eat in a day\" or \"what is healthy eating\" and they are getting a lot of incorrect nutrition information that they might be valuing too much. Especially with the no eating bread because that sounds very much as what I hear daily from my patients and their family on foods that they try to avoid because they are not healthy. With increasing curiosity you could get a lot of information and then can offer your thoughts around \"why don't we get a dietitian to see what their opinions are on what you should be eating\" - I find that at the beginning of this work dietitians are welcomed by patients because they don't see anything wrong with what foods they are restricting and they want someone to tell them what to eat, this is a great first step because through some session the dietitian will be able to determine if a therapist will be needed or if it is just some need of knowledge on food. Make sure it is an ED dietitian because like every field there are plenty of dietitians that are very diet cultured. \n\nAnother thought is setting up a annual visit with the PCP that way you can determine medical state and weight without it being an invasive decision of \"oh no you are losing weigh lets go to the doctor\" because that can make your teen shut down. After getting this information the doctor will mention is there are any big changes or they might give some education around how children are not supposed to be losing weight as per proper growth and puberty which could be another way for you to approach the dietitian/therapist idea. \n\nSome other things to watch out for are: ideas around healthy or good foods only or clean eating, why is she exercising more? this could point to \"summer body\" or an event, is she performing any food rituals such as not cooking the eggs with oils, is she blotting food with grease, is she breaking apart food, is she choosing low fat or no sugar items etc. \n\nGood luck!",
          "created_utc": 1684511462.0
        }
      ]
    },
    {
      "id": "jkuo9lv",
      "author": "BlitheCheese",
      "body": "I work with teenagers, and this is an excellent response. I'm going to save it for future reference.",
      "created_utc": 1684546854.0,
      "score": 2,
      "context": [
        {
          "id": "jksb9y0",
          "author": "nougatandcrumpets",
          "body": "Hello! ED dietitian here! What you are mentioning sounds like the beginning of some disordered eating at minimum but can be the road to an ED so you are right to have picked up on this! One thing that we do know in the ED speciality is that early intervention is best but this does not have to be invasive. \n\nI think it's important to keep open communication with teens because it is an especially difficult time for children that can if not approached correctly could make them shut down with you. I would take a few days to look through what she is picking and just increasing curiosity around why she is choosing what she is choosing and you can learn a lot from just this. Often times I find teens being influenced by not only their environment (family, friends, school) but also social media on posts such as \"what I eat in a day\" or \"what is healthy eating\" and they are getting a lot of incorrect nutrition information that they might be valuing too much. Especially with the no eating bread because that sounds very much as what I hear daily from my patients and their family on foods that they try to avoid because they are not healthy. With increasing curiosity you could get a lot of information and then can offer your thoughts around \"why don't we get a dietitian to see what their opinions are on what you should be eating\" - I find that at the beginning of this work dietitians are welcomed by patients because they don't see anything wrong with what foods they are restricting and they want someone to tell them what to eat, this is a great first step because through some session the dietitian will be able to determine if a therapist will be needed or if it is just some need of knowledge on food. Make sure it is an ED dietitian because like every field there are plenty of dietitians that are very diet cultured. \n\nAnother thought is setting up a annual visit with the PCP that way you can determine medical state and weight without it being an invasive decision of \"oh no you are losing weigh lets go to the doctor\" because that can make your teen shut down. After getting this information the doctor will mention is there are any big changes or they might give some education around how children are not supposed to be losing weight as per proper growth and puberty which could be another way for you to approach the dietitian/therapist idea. \n\nSome other things to watch out for are: ideas around healthy or good foods only or clean eating, why is she exercising more? this could point to \"summer body\" or an event, is she performing any food rituals such as not cooking the eggs with oils, is she blotting food with grease, is she breaking apart food, is she choosing low fat or no sugar items etc. \n\nGood luck!",
          "created_utc": 1684511462.0
        }
      ]
    },
    {
      "id": "jksfiue",
      "author": "None",
      "body": "thank you thank you thank you 🙏🏽 \nI sincerely hope you’re doing better now 😁",
      "created_utc": 1684513060.0,
      "score": 4,
      "context": [
        {
          "id": "jksepbv",
          "author": "Lou-eez-",
          "body": "When I was 14 I started becoming thinner. It wasn't that bad at first until I developed body dysmorphia. At that point, my body was never good enough and I became very obsessive about what I ate. My mom suspected that I had anorexia and handled it like an idiot, only making it worse, so I can only really tell you what not to do.\n\nMy mom would call me \"too skinny\", say I \"looked like a circus freak,\" and say stupid stuff about how boys like girls with meat on their bones. She also constantly asked me about what I ate, which was extremely annoying to me and only made me be more secretive. So don't do that lol. You need to show that you care in a gentle way that won't make her defensive",
          "created_utc": 1684512752.0
        }
      ]
    },
    {
      "id": "jkt9aeb",
      "author": "None",
      "body": "Thank you: I’m taking this to heart 👍🏽👍🏽👍🏽",
      "created_utc": 1684524452.0,
      "score": 5,
      "context": [
        {
          "id": "jkt6ym9",
          "author": "CarelessPerception",
          "body": "Just adding a tip - a lot of my eating disorder was linked to my low self worth and anxiety + need for control. I wonder if she has any of those threads? And if there’s a way to constantly communicate her whole-ness for you. Is she striving to get perfect grades? Under pressure in other ways? I know people with perfect parents develop EDs too, but I was taught that love is conditional and it contributed to my utter lack of self worth. So maybe looking at any implicit messages she might be taking in - not just from you!! You sound wonderful - and seeing what ways you can boost her up.",
          "created_utc": 1684523537.0
        }
      ]
    },
    {
      "id": "jlgluw0",
      "author": "Salt-League-6153",
      "body": "This! One very very important factor of EDs is not actually the behaviors itself but the whys of the behavior. Obvious the impact of the behavior on one’s health is incredibly important. But one could have an ED with no current negative health impacts. Really one of the biggest factors of an ED is an unhealthy relationship to one’s body, food, and very unhealthy or problematic eating habits. \n\nThis does start to get into subtle psychological territory. I would encourage you to really try to learn, listen, and be open to the struggles your child may be having. It can be helpful to lead with personal experiences if you have any. If you don’t, you can lead with other peoples experience. Even just having many real conversations about the real issues around social acceptance of different body shapes can be very beneficial.",
      "created_utc": 1684953580.0,
      "score": 1,
      "context": [
        {
          "id": "jkt6ym9",
          "author": "CarelessPerception",
          "body": "Just adding a tip - a lot of my eating disorder was linked to my low self worth and anxiety + need for control. I wonder if she has any of those threads? And if there’s a way to constantly communicate her whole-ness for you. Is she striving to get perfect grades? Under pressure in other ways? I know people with perfect parents develop EDs too, but I was taught that love is conditional and it contributed to my utter lack of self worth. So maybe looking at any implicit messages she might be taking in - not just from you!! You sound wonderful - and seeing what ways you can boost her up.",
          "created_utc": 1684523537.0
        }
      ]
    },
    {
      "id": "jksx9xj",
      "author": "None",
      "body": "thank you for the insight! I’ll try this 👍🏽",
      "created_utc": 1684519787.0,
      "score": 3,
      "context": [
        {
          "id": "jksgyfh",
          "author": "BookLover1888",
          "body": "What would happen if you tried sending a pop tart or a peanut butter banana sandwich instead of the protein bar in the morning? Or had sloppy joe or a tuna casserole for dinner instead of just the protein item alone? \n\nHer current diet seems really protein heavy from what you described - this was the hallmark of my ED tbh (restrictive anorexia for 10 years). Protein is super low calorie for how physically filling it is - very similar to insoluble carbs / dietary fiber (vs sugars). I used to feel physically full on >!800cal!< of dietary fiber + protein a day. Fats and carbs are awesome because they're both filling (moreso fats) *and* calorically dense, which is why I used to avoid them.\n\nMay be worth considering - the behavior you described sounds eerily familiar.",
          "created_utc": 1684513598.0
        }
      ]
    },
    {
      "id": "jku7d41",
      "author": "None",
      "body": "I’m keeping this in mind, thank you for your advice 😁",
      "created_utc": 1684538831.0,
      "score": 3,
      "context": [
        {
          "id": "jktaory",
          "author": "None",
          "body": "sounds like me when i was deep in my eating disorder. definitely check in but don’t pressure her it’ll push her away",
          "created_utc": 1684525005.0
        }
      ]
    },
    {
      "id": "jkxmc34",
      "author": "None",
      "body": "Thank you for the insight, and kind words; I’ll follow your advice in seeking professionals who know ED 👍🏽",
      "created_utc": 1684607368.0,
      "score": 2,
      "context": [
        {
          "id": "jkujyv6",
          "author": "UselessHuman1",
          "body": "First of all, you are one heck of a good parent! Seriously! Thank you for being so attentive to your daughter. ❤️\n\nYour instinct is probably right. She seems to have issues with food that goes beyond the usual \"diet\" thing. I would at least take her to a GP to have tests done and to monitor her. You are right. Therapy might be a good idea. Personally, I would make sure it's someone who knows eating disorders. It is *very* easy to \"manipulate \" a therapist who knows nothing about Eds.  Also, it would be a lot more helpful from the start. If you think it's getting worse to the point of being dangerous, don't hesitate to go to the ER. Eds are not just weight. She might still be in a visual good shape, but her organs will end up suffering. ❤️",
          "created_utc": 1684544781.0
        }
      ]
    },
    {
      "id": "jlenh0w",
      "author": "None",
      "body": "It does! thank you!!!",
      "created_utc": 1684922459.0,
      "score": 2,
      "context": [
        {
          "id": "jky7dvy",
          "author": "sparklyfirefly",
          "body": "https://www.butterflymind.org/published resources for parents here !!! I hope this helps",
          "created_utc": 1684616496.0
        }
      ]
    },
    {
      "id": "jkxleqe",
      "author": "None",
      "body": "will do, thank you 👍🏽",
      "created_utc": 1684606986.0,
      "score": 1,
      "context": [
        {
          "id": "jkw1s9j",
          "author": "Boosey0910",
          "body": "Arm yourself with some information.  \"Your Dieting Daughter\" is a book I highly recommend.",
          "created_utc": 1684580904.0
        }
      ]
    },
    {
      "id": "jkxm0u5",
      "author": "None",
      "body": "thank you for sharing and advice! I kindly wish you the best 🤗",
      "created_utc": 1684607237.0,
      "score": 1,
      "context": [
        {
          "id": "jkw2a66",
          "author": "dreaminghigher",
          "body": "as an anorexic, i think this could be a begining to some kind of eating disorder. I think that you shouldn't confront her about it right now, but maybe pay a little bit more attention about how many calories she could be eating a day. If the amount is going to be concerning for a few days in a row, talk to her carefully. Ask, if she struggles and show your interest in her good. Just have a honest talk and if she admits that she may have some kind of disordered, sign her up to go and see a therapist/doctor and that will probably be a way to recover. It's great that you see all of the signs because then you may catch it earlier and there won't be as many consequences of the sickness in the future. You are an awesome parent for caring. Mine didn't to that for me and it's so good to see that a lot of parents take this seriously. Wishing that this thing was only a concern and everything is fine!!!!",
          "created_utc": 1684581267.0
        }
      ]
    },
    {
      "id": "jkuctw2",
      "author": "D_r_a_g_o_n_n",
      "body": "OP is doing a good thing by directly asking people who struggle/have struggled with anorexia insted of going to a parenting sub that may give less accurate information compared to first-hand sufferers. Not saying that parenting subs are bad or anything but I think it's important that OP gets the most accurate help for their daughter.",
      "created_utc": 1684541382.0,
      "score": 3,
      "context": [
        {
          "id": "jkrq9m7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1684503191.0
        }
      ]
    },
    {
      "id": "jks96dv",
      "author": "None",
      "body": "thanks!",
      "created_utc": 1684510677.0,
      "score": 3,
      "context": [
        {
          "id": "jkrq9m7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1684503191.0
        }
      ]
    },
    {
      "id": "jktya6c",
      "author": "Blah_blah_meow",
      "body": "This is pro recovery sub as stated on the main page. Maybe you need to re read the community rules…",
      "created_utc": 1684534691.0,
      "score": 4,
      "context": [
        {
          "id": "jkrq9m7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1684503191.0
        }
      ]
    },
    {
      "id": "jkueq2o",
      "author": "EatingDisorders-ModTeam",
      "body": "Hi there, we appreciate your struggles. Unfortunately your submission has been removed for the following reason(s):\n\nYour message has been removed. Please do not encourage pro-ED comments. If you feel your message has been wrongfully deleted reply to this message with the reason.",
      "created_utc": 1684542283.0,
      "score": 2,
      "context": [
        {
          "id": "jkrq9m7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1684503191.0
        }
      ]
    },
    {
      "id": "jksilbj",
      "author": "ReliefJaded8491",
      "body": "You’re very welcome. Thank you for taking this seriously. Good luck to both of you!",
      "created_utc": 1684514217.0,
      "score": 7,
      "context": [
        {
          "id": "jks0a8v",
          "author": "ReliefJaded8491",
          "body": "Your concern shows you are a good parent, and you are paying attention. She’s already got better odds than a lot of people just from that alone. It’s a tough subject to bring up but there are gentle ways to go about it. You could always start with a doctors visit and see how she is doing health-wise. I would recommend calling the doctors office ahead of time to  share your concerns privately. You could frame it to her as a regular checkup, but if the doctor is aware of your concerns, they can order specific ED-related blood tests. In regards to talking to her about it, often times if too much focus is put on food or weight, patients can shut down or deny. Focus on her feelings, her other behaviors. How is she doing? What are her stressors? How does she cope with stress? And listen without judgement. If she does have disordered eating, she may not even know it. It’s tough but she is lucky to have you as a parent!",
          "created_utc": 1684507276.0
        },
        {
          "id": "jks8sgy",
          "author": "None",
          "body": "this is so helpful!!! thank you!!! I’ll follow your advice 100%👍🏽👍🏽👍🏽",
          "created_utc": 1684510532.0
        }
      ]
    },
    {
      "id": "jkyza7c",
      "author": "whattodoidkhelp",
      "body": "As an EDRD, this is wildly incorrect. Please do not give calorie recommendations if you do not have the credentials to do so. Adolescent needs are much higher than adults because they are developing, it is likely a 14 year old girl has needs above 2000. Regardless, there is nothing wrong with gaining weight especially as an adolescent when that is part of normal growth and development.",
      "created_utc": 1684629868.0,
      "score": 3,
      "context": [
        {
          "id": "jkrqkmn",
          "author": "He_who_humps",
          "body": "You are right to be concerned. It may be nothing, but it’s worth investigating. I would not confront her about it yet. Spend a few days tracking, as best you can, her daily intake. If you can’t visually confirm that she ate something, note that, so you can compare later. You should start to get an idea of her daily calories. It should be around 2000. Many parents will tell you not to snoop, but sometimes you have to. Look for evidence of food hiding and diuretics.  If your investigation doesn’t yield anything, you might consider making an appointment with a dietician so you can help her diet properly. If she resists passionately that may be a hint. Watch for unhealthy hair, bowel movement issues, and irregular periods. Remember that lots of teenage girls experiment with wacky dieting, and only a small percentage develop an eating disorder. It’s definitely worth watching closely, though. I wish I had paid more attention when my daughter was developing hers. We didn’t figure it out until she was pretty deep into it. I wish you the best.",
          "created_utc": 1684503324.0
        },
        {
          "id": "jky6chx",
          "author": "Virtual-wren",
          "body": "Should not be around 2000 unless she is exercising. That would have her gaining weight at her age. Unless she is underweight 1600-1700",
          "created_utc": 1684616030.0
        }
      ]
    },
    {
      "id": "jkxnyj6",
      "author": "Boosey0910",
      "body": "I have some other ideas too if you want to direct message me.",
      "created_utc": 1684608017.0,
      "score": 2,
      "context": [
        {
          "id": "jkw1s9j",
          "author": "Boosey0910",
          "body": "Arm yourself with some information.  \"Your Dieting Daughter\" is a book I highly recommend.",
          "created_utc": 1684580904.0
        },
        {
          "id": "jkxleqe",
          "author": "None",
          "body": "will do, thank you 👍🏽",
          "created_utc": 1684606986.0
        }
      ]
    },
    {
      "id": "jku7fdo",
      "author": "Nikitaknowthankyou",
      "body": "Oh silly, I can read. \nJust know the space around this forum. \nThanks for your advice though 😘",
      "created_utc": 1684538860.0,
      "score": -2,
      "context": [
        {
          "id": "jkrq9m7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1684503191.0
        },
        {
          "id": "jktya6c",
          "author": "Blah_blah_meow",
          "body": "This is pro recovery sub as stated on the main page. Maybe you need to re read the community rules…",
          "created_utc": 1684534691.0
        }
      ]
    },
    {
      "id": "jleovu8",
      "author": "None",
      "body": "Thank you for the support! I took my daughter to a dr specialized in teens yesterday, following all you kind people’s advice and, just like you all\npredicted, she ordered a ton of bloodwork and heart exams: as it turns out, my daughter is way below her weight for her height and the dr found evidence of malnutrition: so what I feared, that she “might” become anorexic in front of me and I might miss it was already happening, so we got a consult with a psychologist and. psychiatrist as well; she got sleeping pills to rest (which I didn’t know that she didn’t, since both my teenage kids have their own room and are entitled to their privacy) and the doctor asked her to not lock her door from now on, even in the bathroom, since it turned out my darling daughter had been cutting herself in the arms and hips as well. I did see the cuts yesterday morning , a few hours before the doctor’s appointment and it prompt me to explain to her everything I had gotten from you guys as well as to reassure her that I would do anything I can to help her feel better: I told her that I wasn’t mad, but extremely worried for her wellbeing and ultimatwly her life.\nSo yes, I thank you all for your advice and insights, of course you were 100% on pointe.\nAlso, I came here to say something else: I love my daughter with all my heart, more than my soul can resist and I’d give my own life in a blink for hers, I am absolutely commited to helping her feel better, go trough depression and manage her eating disorder but ultimately I am commited to making her aware that I am with her, her brother is with her, her grandmother, her aunt and uncle and we all love her dearly: she is not alone, and she doesn’t have to be alone. So for all you kind and beautiful souls that offered advice so openly since you wourselves are going through and have gone  through this nightmare, know that you are not alone: you don’t have to feel alone because some people that are close to you love you so so much, much more than you think… so much more! I know you feel lonely but you are not; someone cares for you and doesn’t know how to hold you at this moment; us who love you miss it, we miss that you’re in pain, we miss that you’re suffering and have absolutely no clue as to what you’re feeling, and that’s on us: but we still can help and will hold you if you reach out. So please do: let us know, the ones that are closest to you, what you’re feeling because we are the ones who can help. We love you, we really do, with all our hearts.",
      "created_utc": 1684923547.0,
      "score": 1,
      "context": [
        {
          "id": "jkw1s9j",
          "author": "Boosey0910",
          "body": "Arm yourself with some information.  \"Your Dieting Daughter\" is a book I highly recommend.",
          "created_utc": 1684580904.0
        },
        {
          "id": "jkxleqe",
          "author": "None",
          "body": "will do, thank you 👍🏽",
          "created_utc": 1684606986.0
        },
        {
          "id": "jkxnyj6",
          "author": "Boosey0910",
          "body": "I have some other ideas too if you want to direct message me.",
          "created_utc": 1684608017.0
        }
      ]
    },
    {
      "id": "jkytjvs",
      "author": "Blah_blah_meow",
      "body": "Oh my, I’m not trying to be silly. Just not trying to turn this page into another pro-ED space. The recovery space is already struggling with comments daily that may imply a pro-ED undertone or reasoning. \n\nTo turn people away from asking for help isn’t it. You could have recommended a partnering sub in addition to this sub. People in recovery also feel good giving advice based on first hand experience and to many it can feel like helping others supports their own recovery. \n\nWishing you the best in recovery and hope one day we will not have to worry about people glorifying this struggle.",
      "created_utc": 1684626995.0,
      "score": 1,
      "context": [
        {
          "id": "jkrq9m7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1684503191.0
        },
        {
          "id": "jktya6c",
          "author": "Blah_blah_meow",
          "body": "This is pro recovery sub as stated on the main page. Maybe you need to re read the community rules…",
          "created_utc": 1684534691.0
        },
        {
          "id": "jku7fdo",
          "author": "Nikitaknowthankyou",
          "body": "Oh silly, I can read. \nJust know the space around this forum. \nThanks for your advice though 😘",
          "created_utc": 1684538860.0
        }
      ]
    },
    {
      "id": "jletf1p",
      "author": "Boosey0910",
      "body": "The world and children would be much better off if more mothers (parents) cared about your child the way you do.  Take care, get some help for yourself too and by all means keep reaching out for support.  We are here for you!",
      "created_utc": 1684926649.0,
      "score": 2,
      "context": [
        {
          "id": "jkw1s9j",
          "author": "Boosey0910",
          "body": "Arm yourself with some information.  \"Your Dieting Daughter\" is a book I highly recommend.",
          "created_utc": 1684580904.0
        },
        {
          "id": "jkxleqe",
          "author": "None",
          "body": "will do, thank you 👍🏽",
          "created_utc": 1684606986.0
        },
        {
          "id": "jkxnyj6",
          "author": "Boosey0910",
          "body": "I have some other ideas too if you want to direct message me.",
          "created_utc": 1684608017.0
        },
        {
          "id": "jleovu8",
          "author": "None",
          "body": "Thank you for the support! I took my daughter to a dr specialized in teens yesterday, following all you kind people’s advice and, just like you all\npredicted, she ordered a ton of bloodwork and heart exams: as it turns out, my daughter is way below her weight for her height and the dr found evidence of malnutrition: so what I feared, that she “might” become anorexic in front of me and I might miss it was already happening, so we got a consult with a psychologist and. psychiatrist as well; she got sleeping pills to rest (which I didn’t know that she didn’t, since both my teenage kids have their own room and are entitled to their privacy) and the doctor asked her to not lock her door from now on, even in the bathroom, since it turned out my darling daughter had been cutting herself in the arms and hips as well. I did see the cuts yesterday morning , a few hours before the doctor’s appointment and it prompt me to explain to her everything I had gotten from you guys as well as to reassure her that I would do anything I can to help her feel better: I told her that I wasn’t mad, but extremely worried for her wellbeing and ultimatwly her life.\nSo yes, I thank you all for your advice and insights, of course you were 100% on pointe.\nAlso, I came here to say something else: I love my daughter with all my heart, more than my soul can resist and I’d give my own life in a blink for hers, I am absolutely commited to helping her feel better, go trough depression and manage her eating disorder but ultimately I am commited to making her aware that I am with her, her brother is with her, her grandmother, her aunt and uncle and we all love her dearly: she is not alone, and she doesn’t have to be alone. So for all you kind and beautiful souls that offered advice so openly since you wourselves are going through and have gone  through this nightmare, know that you are not alone: you don’t have to feel alone because some people that are close to you love you so so much, much more than you think… so much more! I know you feel lonely but you are not; someone cares for you and doesn’t know how to hold you at this moment; us who love you miss it, we miss that you’re in pain, we miss that you’re suffering and have absolutely no clue as to what you’re feeling, and that’s on us: but we still can help and will hold you if you reach out. So please do: let us know, the ones that are closest to you, what you’re feeling because we are the ones who can help. We love you, we really do, with all our hearts.",
          "created_utc": 1684923547.0
        }
      ]
    },
    {
      "id": "jl1jadh",
      "author": "Nikitaknowthankyou",
      "body": "I gave the advice based on my knowledge of this sub, since I do not know what other sub you speak of I don’t understand why you are speaking directly to me. \nThat was my advice and I stand by it so I don’t really understand why you’re trying to lecture a stranger about YOUR feelings when I was responding to a mother worried about her daughter. \nAfraid you’ve lost the plot.",
      "created_utc": 1684685068.0,
      "score": 1,
      "context": [
        {
          "id": "jkrq9m7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1684503191.0
        },
        {
          "id": "jktya6c",
          "author": "Blah_blah_meow",
          "body": "This is pro recovery sub as stated on the main page. Maybe you need to re read the community rules…",
          "created_utc": 1684534691.0
        },
        {
          "id": "jku7fdo",
          "author": "Nikitaknowthankyou",
          "body": "Oh silly, I can read. \nJust know the space around this forum. \nThanks for your advice though 😘",
          "created_utc": 1684538860.0
        },
        {
          "id": "jkytjvs",
          "author": "Blah_blah_meow",
          "body": "Oh my, I’m not trying to be silly. Just not trying to turn this page into another pro-ED space. The recovery space is already struggling with comments daily that may imply a pro-ED undertone or reasoning. \n\nTo turn people away from asking for help isn’t it. You could have recommended a partnering sub in addition to this sub. People in recovery also feel good giving advice based on first hand experience and to many it can feel like helping others supports their own recovery. \n\nWishing you the best in recovery and hope one day we will not have to worry about people glorifying this struggle.",
          "created_utc": 1684626995.0
        }
      ]
    },
    {
      "id": "jl1jp0c",
      "author": "Nikitaknowthankyou",
      "body": "“People in recovery feel good offering advice” what a blanket statement of your feelings that do not align with mine. Everyone is different sweetie. I’d start with that and maybe then log off",
      "created_utc": 1684685236.0,
      "score": 1,
      "context": [
        {
          "id": "jkrq9m7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1684503191.0
        },
        {
          "id": "jktya6c",
          "author": "Blah_blah_meow",
          "body": "This is pro recovery sub as stated on the main page. Maybe you need to re read the community rules…",
          "created_utc": 1684534691.0
        },
        {
          "id": "jku7fdo",
          "author": "Nikitaknowthankyou",
          "body": "Oh silly, I can read. \nJust know the space around this forum. \nThanks for your advice though 😘",
          "created_utc": 1684538860.0
        },
        {
          "id": "jkytjvs",
          "author": "Blah_blah_meow",
          "body": "Oh my, I’m not trying to be silly. Just not trying to turn this page into another pro-ED space. The recovery space is already struggling with comments daily that may imply a pro-ED undertone or reasoning. \n\nTo turn people away from asking for help isn’t it. You could have recommended a partnering sub in addition to this sub. People in recovery also feel good giving advice based on first hand experience and to many it can feel like helping others supports their own recovery. \n\nWishing you the best in recovery and hope one day we will not have to worry about people glorifying this struggle.",
          "created_utc": 1684626995.0
        }
      ]
    },
    {
      "id": "jl6tn9x",
      "author": "Blah_blah_meow",
      "body": "Seems as though you are missing the point and do not seem to want to have an adult conversation based on your belittling name calling. “Sweetie and silly” are passive aggressive. I’ve been nothing but respectful. \n\nWishing you the best in recovery and hopefully you get into some therapy or group work that can assist you in working through your feelings like an adult.",
      "created_utc": 1684780591.0,
      "score": 1,
      "context": [
        {
          "id": "jkrq9m7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1684503191.0
        },
        {
          "id": "jktya6c",
          "author": "Blah_blah_meow",
          "body": "This is pro recovery sub as stated on the main page. Maybe you need to re read the community rules…",
          "created_utc": 1684534691.0
        },
        {
          "id": "jku7fdo",
          "author": "Nikitaknowthankyou",
          "body": "Oh silly, I can read. \nJust know the space around this forum. \nThanks for your advice though 😘",
          "created_utc": 1684538860.0
        },
        {
          "id": "jkytjvs",
          "author": "Blah_blah_meow",
          "body": "Oh my, I’m not trying to be silly. Just not trying to turn this page into another pro-ED space. The recovery space is already struggling with comments daily that may imply a pro-ED undertone or reasoning. \n\nTo turn people away from asking for help isn’t it. You could have recommended a partnering sub in addition to this sub. People in recovery also feel good giving advice based on first hand experience and to many it can feel like helping others supports their own recovery. \n\nWishing you the best in recovery and hope one day we will not have to worry about people glorifying this struggle.",
          "created_utc": 1684626995.0
        },
        {
          "id": "jl1jp0c",
          "author": "Nikitaknowthankyou",
          "body": "“People in recovery feel good offering advice” what a blanket statement of your feelings that do not align with mine. Everyone is different sweetie. I’d start with that and maybe then log off",
          "created_utc": 1684685236.0
        }
      ]
    }
  ]
}