{
  "id": "13zpri6",
  "subreddit": "EatingDisorders",
  "author": "blutlm",
  "created_utc": 1685826732.0,
  "title": "The parts of Eds no one else talks about",
  "selftext": "I feel like society focuses on only the romanticized parts of EDs and never the truly debilitating and nasty parts. Or even just the little things that suck. These are just a few of the ones I've encountered:\n\n\\-bloating\n\n\\-always so gassy (and sometimes it's abnormally smelly)\n\n\\-stomach making the WEIRDEST noises when your gassy\n\n\\-THROBBING headaches\n\n\\-Brain fog \n\n\\-tired ALL the time\n\n\\-out of breath pretty easily\n\n\\-food rules you can't break even when you want to (I get truly scared)\n\n\\-weird food combinations everyone makes fun of (recently rippled potatoes chips dipped in mayo)\n\n\\-always cold\n\n\\-moody (constantly hangry)\n\n\\-That awkward feeling when everyone around you is talking about food",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/13zpri6/the_parts_of_eds_no_one_else_talks_about/",
  "score": 86,
  "num_comments": 57,
  "comments": [
    {
      "id": "jmsrhlh",
      "author": "Excellent-World-476",
      "body": "Extreme anger if someone takes your safe food or trespasses in a way that challenges your ED.",
      "created_utc": 1685833790.0,
      "score": 56,
      "context": []
    },
    {
      "id": "jmt2u66",
      "author": "Usual-Effect1440",
      "body": "Can't stand up for long periods of time \n\nDizzy when getting up\n\nFainting",
      "created_utc": 1685839377.0,
      "score": 20,
      "context": []
    },
    {
      "id": "jmtkoqm",
      "author": "strawberry_poptart2",
      "body": "- Bradycardia and all the symptoms with that \n- Exercise compulsion and not being able to take one day off. If I do, I don’t eat as much to compensate. \n-  Food rules \n- The self gaslighting and denial of having a problem\n- Feeling full making you want to jump off a cliff \n- Weird food fears (anyone else super paranoid about how long food is left out of the fridge?) \n- Lack of control while simultaneously feeling in control\n- Feeling cold and trying to act normal and gaslighting myself into feeling warm\n- Avoiding social events and self isolating \n- Wearing baggy clothes as I lose more weight \n\nIf you’re reading this and thinking “I’m not that bad” - believe me I never thought I would be here either. The eating disorder has completely taken over.",
      "created_utc": 1685848871.0,
      "score": 19,
      "context": []
    },
    {
      "id": "jmtj2ch",
      "author": "Junior_Positive_1724",
      "body": "being hyper-aware of every single part of your body after eating. it’s so overwhelming",
      "created_utc": 1685847965.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jmu43xv",
      "author": "Fun-Chicken-2634",
      "body": "The mental calculator that never stops, and even though you know a certain food has x many calories, you overestimate it by at least 100 \nNot even being able to get away from your ED when you sleep.. dreaming about scales and food and numbers\nLying all the time “I just ate” “I’m not hungry”\nThinking about food all the time\nBeing paranoid that the barista isn’t giving you a sugar free drink even though you said your order twice and had her repeat it back\nEating an excessive amount of pickles, not because you like them but because they are low calorie and you you’re starving\nEating half an apple just to purge something to feel a release \nTiming the laxatives to kick in in the middle of the night so no one knows even though that means you wake up 7 times a night \nSores from where your bones poke through\nTaking forever in the grocery store because nothing feels safe but you want it all\nDoubting yourself all the time\nWater cycling to purge more because your convinced you haven’t gotten it all up \nFuuuuuck, I could go on and on",
      "created_utc": 1685862148.0,
      "score": 11,
      "context": []
    },
    {
      "id": "jmtjn13",
      "author": "UselessHuman1",
      "body": "The constipation or diharea. No in between.",
      "created_utc": 1685848279.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jmt4gs2",
      "author": "None",
      "body": "social isolation bc you can’t stand to eat around others",
      "created_utc": 1685840194.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jmw9gzn",
      "author": "Primary_Breakfast_77",
      "body": "My list:\n\n• avoiding social interactions/important things because your body doesn’t feel “skinny enough” \n\n• avoiding intimacy and starving yourself when  you find someone you like/love in order to be lovable\n\n•the goal weight is never ending, there’s always going to be another goal weight\n• failing academically because you’re too malnourished & weak \n\n• spending money until you’re broke on b/p \n\n• always tired & can’t sleep\n\n• always cold\n\n• always sad\n\n• always lonely\n\n• the ed becomes such a huge part of your life that you’re forced to give other parts away\n\n• always feeling like a child that needs to be taken care of\n\n• wierd safe foods that equal in calories foods that aren’t safe but you still can’t eat the unsafe ones (it makes no logical sense)\n\n• carrying a scale around wherever you go: trips, holidays, visiting someone for a few days\n\n• always drinking coffee\n\n• when the feeling of hunger hits after a prolonged restriction period and all you feel is rage, anger & hunger\n\n• isolation & lying to ppl\n\n•depressed because how can you not be living life this way? \n\n• anxious because again\n\n• always sick\n\n• slowly developing more and more health issues due to EDs\n\n• putting your life in danger by engaging in behaviours, and knowingly doing it even if your heart may fail this time\n\n• constantly cleaning the toilet \n\n• getting asked why do you have a water bottle in your bathroom \n\n• clogging the toilet and bath, having to unclog it yourself because how can you explain what is going to be found there?\n\n• fainting in public places and knowing why&  acting like you don’t know why when strangers come to offer help \n\n• developing other addictions in order to cope with EDs \n\n• can’t get a job because ur always sick & relying on parents money\n\n• You can have the most amazing, blessed, lucky, fun day & you will not be happy abt it unless you stuck to what you were supposed to eat\n\n• Restricting and the cals go lower and lower to none & you carry it on like that until you can’t and you “binge” \n\n•refeeding syndrome giving you a seziure \n\n• safe clothes\n\n• the black and white thinking, all or nothing— doesn’t apply only to food, it applies to everything in your life \n\n•missing out on life because you’re too busy counting, measuring, restricting \n\n•losing the guy who’s in love with you and ur in love with him because the EDs fill up ur head, heart, soul, time, day & night—eventually pushing the other person away \n\n• writing all of this knowing that tomorrow my day will be determined by a number on a scale \n\n•writing all of this knowing that I couldn’t focus or had energy to study anything for my exams and I have one day left \n\n•writing all of this not knowing if I will ever get out of this vicious circle\n\n•writing all of this and sleeping with a heavy heart knowing damn well I’m self aware but still don’t know how I can change it \n\n• remembering the first time I fasted for a month was when I was 11 yrs old\n\n• thinking back on my lost childhood and adolesence\n\n•22 & wondering if I will lose more years to this or even if I will survive this\n\nSorry this turned dark really quick, but that’s how it is",
      "created_utc": 1685905393.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmtisk0",
      "author": "Queenofwands1212",
      "body": "Yes these are all valid as fuck. Also the extreme inability many of us have with eating in front of or with others. I just refuse to eat with or around people anymore. It feels like trauma and attacking myself when I have to eat in front or with others. The food combinations and weird concoctions that I make everyday is also really self shaming for sure. I also have auto immune conditions and gut disorders so the way I eat is to keep that at bay and I literally have to make all of my food for myself at home, can’t have anything packaged etc. so that manifests as orthorexia, Arfid etc",
      "created_utc": 1685847814.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmtul5r",
      "author": "WideAtmosphere",
      "body": "The bloating and gas. I’m so sick of it.",
      "created_utc": 1685855015.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmtuvxm",
      "author": "muichiroabuse",
      "body": "and when your hair falls out in huge clumps…",
      "created_utc": 1685855224.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmulstt",
      "author": "chaseylane1",
      "body": "I suffered extreme anorexia about 7 years back, like feeding tube and bed ridden as walking around house was too many calories burned. I lost 3/4 muscle mass and it affected my brain. My body fed on my brain. I have lost all of those wonderful memories of my now teenage kids as babies/ small children and my early relationship/marriage . No Christmas or birthday memories. Can’t remember my first kiss with husband. It’s affected my mental health and relationships. Worst part is they remember the time leading up too and when I was sick. Always watching asking, “did you eat” “are you going to be ok “ “are you going to die “ so yeah so awesome.",
      "created_utc": 1685876815.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmvroeu",
      "author": "blutlm",
      "body": "I also forgot to list watching endless food videos bc you want to eat those foods so bad but you can't so you settle for watching them",
      "created_utc": 1685897820.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jmtfpas",
      "author": "True_Program_1058",
      "body": "No one talks about the urinary incontinence either, I know where every bathroom is in every store I frequent. And wear depends if I'm going to a new place or know I'll be out for while not near a bathroom.",
      "created_utc": 1685846151.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jmub6c7",
      "author": "r090491",
      "body": "1. Loosing my hair\n2. Always being cold and with blue fingernails\n3. Not being able to poop at all\n4. Isolation to avoid contact with food or people eating\n5. Not being able to go up the stairs \n6. No libido \n7. Always wearing the same clothes out of fear of looking “fat”",
      "created_utc": 1685868012.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmxfppr",
      "author": "warmcatbellyfuzz",
      "body": "HeMorrhoids lolllll",
      "created_utc": 1685924205.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jmtf4xd",
      "author": "KatShyKat",
      "body": "With ARFID the most common issues I run into are\n\nLittle to no appetite\nSocial embarrassment\nWeight gain even though I rarely eat due to the foods I eat when I eat\nMental stress\nOver thinking due to being hungry and not able to eat\nStomach pain as if hungry even when I am full\nAnd honestly the worst is, if I eat something my body dislikes I'll throw it up... sometimes immediately to the point of having no way to get a trash can... and the throw up is usually chunky and smelly, I don't even force it it just happens",
      "created_utc": 1685845845.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmufpmq",
      "author": "-Tsunsuki-",
      "body": "Being dizzy EVERY SINGLE TIME you stand up. I need to bend down for a few seconds so I dont pass out, and people look at me funny.",
      "created_utc": 1685871885.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmulzw3",
      "author": "chaseylane1",
      "body": "Not wanting to eat in front of people and trying to hid the vomiting if you have to because you ate more than your used too/wanted too.",
      "created_utc": 1685876960.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmun8jn",
      "author": "SummerBeanSoup",
      "body": "This is all so true. I’m so so sorry you deal with this pain as well. It’s not fair. I hope you find your peace one day",
      "created_utc": 1685877859.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmvop28",
      "author": "kookie0098",
      "body": "is anyone else constantly nauseous?",
      "created_utc": 1685896536.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmwhjyc",
      "author": "Valued_Employee",
      "body": "-Other people commenting on my food while I’m eating it. Being told I’m not eating enough, saying I’m eating ‘so healthy’ because I ordered a salad, stuff like that. \n\n-I have a lot of middle aged relatives that are still stuck in the early 2000’s diet culture mindset. Every time we interact the conversation steers to endless questions about what I’ve done to ‘loose weight or how I’ve kept the weight off. It’s like they think I’m gatekeeping a secret diet, work out or magic potion. \n\n-I haven’t posted a full body picture of myself in about a year for the same reason as above, the comments are always about my weight/body.",
      "created_utc": 1685908818.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmwkdcs",
      "author": "Thegirlwholived808",
      "body": "Parotid gland swelling",
      "created_utc": 1685910019.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmxjql3",
      "author": "Wisconsin_ope",
      "body": "Incontinence from purging",
      "created_utc": 1685926135.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmxwat3",
      "author": "Smile1228",
      "body": "Post recovery I’m still dealing with the effects of my ED, here’s just a few. \n\n-Early Satiety, feeling full after a few bites. I have to force myself to finish otherwise I’ll just pick at it or won’t eat for the rest of the day. \n\n-Nausea after a meal, still thinking about all the calories I’m in taking and pushing away ED thinking. \n\n-My stomach does not absorb iron, therefore meaning it drops pretty consistently. I’ve been having iron infusions every 3-4 months since 2020. My doc is reassuring, but he does not see this changing as we’ve tried every other form of iron to see if I’ll absorb it. It doesn’t work. \n\n-My hair started breaking off and falling out when I had the ED, three years into recovery and it’s still very fragile and thin. Nothing like what it used to be.",
      "created_utc": 1685932222.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jn2chai",
      "author": "una_verdadera_lata",
      "body": "\\-missed opportunities because of illness or treatment in school, relationships, jobs\n\n\\-feeling behind your peers because of missed opportunities or stagnation \n\n\\-osteoporosis (in my 30s)\n\n\\-never feeling safe in your body",
      "created_utc": 1686014812.0,
      "score": 1,
      "context": []
    },
    {
      "id": "joc05rx",
      "author": "None",
      "body": "i get tired so easily and my friends make fun of me for alw wearing sweaters when it’s hot outside but i just feel so cold always",
      "created_utc": 1686910142.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jox79rm",
      "author": "RedThestral13",
      "body": "When my kids are like “try this!” And it takes everything in me to choke it down with a smile\n\nFeeling sick because I’m hungry, feeling sick when I think about what I can eat that won’t make me feel sick, and then feeling sick when I finally eat because I’m so full\n\nBeing so exhausted after taking a hot shower that I have to lay down and catch my breath for a while",
      "created_utc": 1687320917.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jq25c95",
      "author": "spunchbulge",
      "body": "okay i don’t know if it’s just me but i really struggle to sleep through the night even with the help of something like melatonin,, also HEAVY on being moody all the time !!",
      "created_utc": 1688080139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jmtpjh3",
      "author": "blutlm",
      "body": "I will cry so hard if I find out that the one food I spent all my day psyching myself up to eat is gone when I get home. I won't eat, and then everyone calls me immature",
      "created_utc": 1685851734.0,
      "score": 32,
      "context": [
        {
          "id": "jmsrhlh",
          "author": "Excellent-World-476",
          "body": "Extreme anger if someone takes your safe food or trespasses in a way that challenges your ED.",
          "created_utc": 1685833790.0
        }
      ]
    },
    {
      "id": "jmttdjr",
      "author": "WideAtmosphere",
      "body": "I became irrationally angry when the supermarket was out of my Safe Yogurt. Like ridiculously angry. I’m in my 40s…",
      "created_utc": 1685854188.0,
      "score": 15,
      "context": [
        {
          "id": "jmsrhlh",
          "author": "Excellent-World-476",
          "body": "Extreme anger if someone takes your safe food or trespasses in a way that challenges your ED.",
          "created_utc": 1685833790.0
        }
      ]
    },
    {
      "id": "jmtws4c",
      "author": "None",
      "body": "I got extremely angry and lashed out on my mom when she tried to feed me chicken one day instead of my usual fish.. I am to old to be acting like that",
      "created_utc": 1685856566.0,
      "score": 3,
      "context": [
        {
          "id": "jmsrhlh",
          "author": "Excellent-World-476",
          "body": "Extreme anger if someone takes your safe food or trespasses in a way that challenges your ED.",
          "created_utc": 1685833790.0
        }
      ]
    },
    {
      "id": "jmwvx0n",
      "author": "pigsandunicorn",
      "body": "Meat and cheese are my safe food, that's it, I hate sweet things, I go out of my way to find bitter foods and drinks.\n\nThe sweetness of nearly anything is overpowering, and makes me extremely uncomfortable.",
      "created_utc": 1685914962.0,
      "score": 2,
      "context": [
        {
          "id": "jmsrhlh",
          "author": "Excellent-World-476",
          "body": "Extreme anger if someone takes your safe food or trespasses in a way that challenges your ED.",
          "created_utc": 1685833790.0
        }
      ]
    },
    {
      "id": "jmtpbsq",
      "author": "blutlm",
      "body": "I have that same food fear! I'm super paranoid about food poisoning. And I don't even know why bc sometimes I tell myself that if I get sick and throw up it'll help aid in weight loss. \n\nThis list is kind of all the things that made me realize that I AM that bad.",
      "created_utc": 1685851602.0,
      "score": 6,
      "context": [
        {
          "id": "jmtkoqm",
          "author": "strawberry_poptart2",
          "body": "- Bradycardia and all the symptoms with that \n- Exercise compulsion and not being able to take one day off. If I do, I don’t eat as much to compensate. \n-  Food rules \n- The self gaslighting and denial of having a problem\n- Feeling full making you want to jump off a cliff \n- Weird food fears (anyone else super paranoid about how long food is left out of the fridge?) \n- Lack of control while simultaneously feeling in control\n- Feeling cold and trying to act normal and gaslighting myself into feeling warm\n- Avoiding social events and self isolating \n- Wearing baggy clothes as I lose more weight \n\nIf you’re reading this and thinking “I’m not that bad” - believe me I never thought I would be here either. The eating disorder has completely taken over.",
          "created_utc": 1685848871.0
        }
      ]
    },
    {
      "id": "jmungg8",
      "author": "SummerBeanSoup",
      "body": "I always felt so alone in the feeling full jumping off a Cliff thing and the food rules. I’m not happy you have those struggles but i feel a little relief knowing those symptoms aren’t insane and unique to me. I feel so crazy all the time. I also cannot make myself eat when I’m sad or angry. If something happens at the beginning of the day, i still won’t be able to eat by bedtime. No matter how badly i want to",
      "created_utc": 1685878014.0,
      "score": 4,
      "context": [
        {
          "id": "jmtkoqm",
          "author": "strawberry_poptart2",
          "body": "- Bradycardia and all the symptoms with that \n- Exercise compulsion and not being able to take one day off. If I do, I don’t eat as much to compensate. \n-  Food rules \n- The self gaslighting and denial of having a problem\n- Feeling full making you want to jump off a cliff \n- Weird food fears (anyone else super paranoid about how long food is left out of the fridge?) \n- Lack of control while simultaneously feeling in control\n- Feeling cold and trying to act normal and gaslighting myself into feeling warm\n- Avoiding social events and self isolating \n- Wearing baggy clothes as I lose more weight \n\nIf you’re reading this and thinking “I’m not that bad” - believe me I never thought I would be here either. The eating disorder has completely taken over.",
          "created_utc": 1685848871.0
        }
      ]
    },
    {
      "id": "jmtuhte",
      "author": "WideAtmosphere",
      "body": "Exercise addiction sucks so bad, but it’s my stress control.",
      "created_utc": 1685854952.0,
      "score": 2,
      "context": [
        {
          "id": "jmtkoqm",
          "author": "strawberry_poptart2",
          "body": "- Bradycardia and all the symptoms with that \n- Exercise compulsion and not being able to take one day off. If I do, I don’t eat as much to compensate. \n-  Food rules \n- The self gaslighting and denial of having a problem\n- Feeling full making you want to jump off a cliff \n- Weird food fears (anyone else super paranoid about how long food is left out of the fridge?) \n- Lack of control while simultaneously feeling in control\n- Feeling cold and trying to act normal and gaslighting myself into feeling warm\n- Avoiding social events and self isolating \n- Wearing baggy clothes as I lose more weight \n\nIf you’re reading this and thinking “I’m not that bad” - believe me I never thought I would be here either. The eating disorder has completely taken over.",
          "created_utc": 1685848871.0
        }
      ]
    },
    {
      "id": "jmww60g",
      "author": "pigsandunicorn",
      "body": "I HATE feeling full...it absolutely surges my anxiety and panic attacks, so I intentionally don't eat enough to be full, can't talk to anyone about it though, they could never understand.",
      "created_utc": 1685915071.0,
      "score": 1,
      "context": [
        {
          "id": "jmtkoqm",
          "author": "strawberry_poptart2",
          "body": "- Bradycardia and all the symptoms with that \n- Exercise compulsion and not being able to take one day off. If I do, I don’t eat as much to compensate. \n-  Food rules \n- The self gaslighting and denial of having a problem\n- Feeling full making you want to jump off a cliff \n- Weird food fears (anyone else super paranoid about how long food is left out of the fridge?) \n- Lack of control while simultaneously feeling in control\n- Feeling cold and trying to act normal and gaslighting myself into feeling warm\n- Avoiding social events and self isolating \n- Wearing baggy clothes as I lose more weight \n\nIf you’re reading this and thinking “I’m not that bad” - believe me I never thought I would be here either. The eating disorder has completely taken over.",
          "created_utc": 1685848871.0
        }
      ]
    },
    {
      "id": "jmwshet",
      "author": "peaches7789",
      "body": "This feeling is the worst.",
      "created_utc": 1685913485.0,
      "score": 2,
      "context": [
        {
          "id": "jmtj2ch",
          "author": "Junior_Positive_1724",
          "body": "being hyper-aware of every single part of your body after eating. it’s so overwhelming",
          "created_utc": 1685847965.0
        }
      ]
    },
    {
      "id": "jmvr0z7",
      "author": "blutlm",
      "body": "Yep. Even though I've deleted all the apps, I still know exactly how many calories are in a food. And I over estimate too just in case. I also will focus on eating foods with a laxative effect. Like prunes and fiber ones bars. I have to make sure I eat plenty of them a day so that I can shit like crazy the next morning. And yep, I feel so overwhelmed in the grocery store.",
      "created_utc": 1685897542.0,
      "score": 2,
      "context": [
        {
          "id": "jmu43xv",
          "author": "Fun-Chicken-2634",
          "body": "The mental calculator that never stops, and even though you know a certain food has x many calories, you overestimate it by at least 100 \nNot even being able to get away from your ED when you sleep.. dreaming about scales and food and numbers\nLying all the time “I just ate” “I’m not hungry”\nThinking about food all the time\nBeing paranoid that the barista isn’t giving you a sugar free drink even though you said your order twice and had her repeat it back\nEating an excessive amount of pickles, not because you like them but because they are low calorie and you you’re starving\nEating half an apple just to purge something to feel a release \nTiming the laxatives to kick in in the middle of the night so no one knows even though that means you wake up 7 times a night \nSores from where your bones poke through\nTaking forever in the grocery store because nothing feels safe but you want it all\nDoubting yourself all the time\nWater cycling to purge more because your convinced you haven’t gotten it all up \nFuuuuuck, I could go on and on",
          "created_utc": 1685862148.0
        }
      ]
    },
    {
      "id": "jmtozmn",
      "author": "blutlm",
      "body": "Or both at the same time! Don't ask how. It makes no sense",
      "created_utc": 1685851393.0,
      "score": 2,
      "context": [
        {
          "id": "jmtjn13",
          "author": "UselessHuman1",
          "body": "The constipation or diharea. No in between.",
          "created_utc": 1685848279.0
        }
      ]
    },
    {
      "id": "jmtf6ie",
      "author": "KatShyKat",
      "body": "Thats a big one",
      "created_utc": 1685845869.0,
      "score": 3,
      "context": [
        {
          "id": "jmt4gs2",
          "author": "None",
          "body": "social isolation bc you can’t stand to eat around others",
          "created_utc": 1685840194.0
        }
      ]
    },
    {
      "id": "jmtkpmj",
      "author": "strawberry_poptart2",
      "body": "This one!!!!!",
      "created_utc": 1685848885.0,
      "score": 1,
      "context": [
        {
          "id": "jmt4gs2",
          "author": "None",
          "body": "social isolation bc you can’t stand to eat around others",
          "created_utc": 1685840194.0
        }
      ]
    },
    {
      "id": "jmx7aek",
      "author": "evolve0Rrepeat",
      "body": "literally felt every single one of these! especially \"writing all of this knowing that tomorrow my day will be determined by a number on a scale\" facts",
      "created_utc": 1685920173.0,
      "score": 3,
      "context": [
        {
          "id": "jmw9gzn",
          "author": "Primary_Breakfast_77",
          "body": "My list:\n\n• avoiding social interactions/important things because your body doesn’t feel “skinny enough” \n\n• avoiding intimacy and starving yourself when  you find someone you like/love in order to be lovable\n\n•the goal weight is never ending, there’s always going to be another goal weight\n• failing academically because you’re too malnourished & weak \n\n• spending money until you’re broke on b/p \n\n• always tired & can’t sleep\n\n• always cold\n\n• always sad\n\n• always lonely\n\n• the ed becomes such a huge part of your life that you’re forced to give other parts away\n\n• always feeling like a child that needs to be taken care of\n\n• wierd safe foods that equal in calories foods that aren’t safe but you still can’t eat the unsafe ones (it makes no logical sense)\n\n• carrying a scale around wherever you go: trips, holidays, visiting someone for a few days\n\n• always drinking coffee\n\n• when the feeling of hunger hits after a prolonged restriction period and all you feel is rage, anger & hunger\n\n• isolation & lying to ppl\n\n•depressed because how can you not be living life this way? \n\n• anxious because again\n\n• always sick\n\n• slowly developing more and more health issues due to EDs\n\n• putting your life in danger by engaging in behaviours, and knowingly doing it even if your heart may fail this time\n\n• constantly cleaning the toilet \n\n• getting asked why do you have a water bottle in your bathroom \n\n• clogging the toilet and bath, having to unclog it yourself because how can you explain what is going to be found there?\n\n• fainting in public places and knowing why&  acting like you don’t know why when strangers come to offer help \n\n• developing other addictions in order to cope with EDs \n\n• can’t get a job because ur always sick & relying on parents money\n\n• You can have the most amazing, blessed, lucky, fun day & you will not be happy abt it unless you stuck to what you were supposed to eat\n\n• Restricting and the cals go lower and lower to none & you carry it on like that until you can’t and you “binge” \n\n•refeeding syndrome giving you a seziure \n\n• safe clothes\n\n• the black and white thinking, all or nothing— doesn’t apply only to food, it applies to everything in your life \n\n•missing out on life because you’re too busy counting, measuring, restricting \n\n•losing the guy who’s in love with you and ur in love with him because the EDs fill up ur head, heart, soul, time, day & night—eventually pushing the other person away \n\n• writing all of this knowing that tomorrow my day will be determined by a number on a scale \n\n•writing all of this knowing that I couldn’t focus or had energy to study anything for my exams and I have one day left \n\n•writing all of this not knowing if I will ever get out of this vicious circle\n\n•writing all of this and sleeping with a heavy heart knowing damn well I’m self aware but still don’t know how I can change it \n\n• remembering the first time I fasted for a month was when I was 11 yrs old\n\n• thinking back on my lost childhood and adolesence\n\n•22 & wondering if I will lose more years to this or even if I will survive this\n\nSorry this turned dark really quick, but that’s how it is",
          "created_utc": 1685905393.0
        }
      ]
    },
    {
      "id": "jmtpqnh",
      "author": "blutlm",
      "body": "I don't eat at work. It's super awkward. I just stay in the office and continue working. And it feels like I'm not supposed to eat bc people make comments about how I never eat (i dont think they suspect and ED just a lifestyle) so now it's just expected of me and I would feel weird if I started to eat",
      "created_utc": 1685851855.0,
      "score": 2,
      "context": [
        {
          "id": "jmtisk0",
          "author": "Queenofwands1212",
          "body": "Yes these are all valid as fuck. Also the extreme inability many of us have with eating in front of or with others. I just refuse to eat with or around people anymore. It feels like trauma and attacking myself when I have to eat in front or with others. The food combinations and weird concoctions that I make everyday is also really self shaming for sure. I also have auto immune conditions and gut disorders so the way I eat is to keep that at bay and I literally have to make all of my food for myself at home, can’t have anything packaged etc. so that manifests as orthorexia, Arfid etc",
          "created_utc": 1685847814.0
        }
      ]
    },
    {
      "id": "jmu3gg6",
      "author": "blutlm",
      "body": "I swear I'm gassy even on an empty stomach. Like how?",
      "created_utc": 1685861634.0,
      "score": 2,
      "context": [
        {
          "id": "jmtul5r",
          "author": "WideAtmosphere",
          "body": "The bloating and gas. I’m so sick of it.",
          "created_utc": 1685855015.0
        }
      ]
    },
    {
      "id": "jmtov1i",
      "author": "blutlm",
      "body": "I have to pee ALL the time! I drink so much water and it all goes right through me bc my stomach is empty. I have to pee almost once an hour at work",
      "created_utc": 1685851314.0,
      "score": 6,
      "context": [
        {
          "id": "jmtfpas",
          "author": "True_Program_1058",
          "body": "No one talks about the urinary incontinence either, I know where every bathroom is in every store I frequent. And wear depends if I'm going to a new place or know I'll be out for while not near a bathroom.",
          "created_utc": 1685846151.0
        }
      ]
    },
    {
      "id": "jmtu90d",
      "author": "WideAtmosphere",
      "body": "I pee so much and barely make it 90% of the time. Low anti diuretic hormone, low estrogen = fluids go directly through you like a Betsy Wetsy doll. And your bladder leaks easily. Mad luxurious.",
      "created_utc": 1685854779.0,
      "score": 4,
      "context": [
        {
          "id": "jmtfpas",
          "author": "True_Program_1058",
          "body": "No one talks about the urinary incontinence either, I know where every bathroom is in every store I frequent. And wear depends if I'm going to a new place or know I'll be out for while not near a bathroom.",
          "created_utc": 1685846151.0
        }
      ]
    },
    {
      "id": "jmwv5uy",
      "author": "blutlm",
      "body": "Sometimes it's at the MOST random times",
      "created_utc": 1685914639.0,
      "score": 2,
      "context": [
        {
          "id": "jmvop28",
          "author": "kookie0098",
          "body": "is anyone else constantly nauseous?",
          "created_utc": 1685896536.0
        }
      ]
    },
    {
      "id": "jmwhqvk",
      "author": "Valued_Employee",
      "body": "Yes 😭",
      "created_utc": 1685908900.0,
      "score": 1,
      "context": [
        {
          "id": "jmvop28",
          "author": "kookie0098",
          "body": "is anyone else constantly nauseous?",
          "created_utc": 1685896536.0
        }
      ]
    },
    {
      "id": "jmvb4c9",
      "author": "Spectrachic9100",
      "body": "I’m that way when they are out of my safe barbecue sauce and safe yogurt. Agree, it’s so embarrassing. I should not be that emotional about it.",
      "created_utc": 1685890611.0,
      "score": 4,
      "context": [
        {
          "id": "jmsrhlh",
          "author": "Excellent-World-476",
          "body": "Extreme anger if someone takes your safe food or trespasses in a way that challenges your ED.",
          "created_utc": 1685833790.0
        },
        {
          "id": "jmttdjr",
          "author": "WideAtmosphere",
          "body": "I became irrationally angry when the supermarket was out of my Safe Yogurt. Like ridiculously angry. I’m in my 40s…",
          "created_utc": 1685854188.0
        }
      ]
    },
    {
      "id": "jmylpsa",
      "author": "mysupersalami",
      "body": "I'm 45 and my lemon cordial isn't being stocked any more I'm so angry.",
      "created_utc": 1685948514.0,
      "score": 2,
      "context": [
        {
          "id": "jmsrhlh",
          "author": "Excellent-World-476",
          "body": "Extreme anger if someone takes your safe food or trespasses in a way that challenges your ED.",
          "created_utc": 1685833790.0
        },
        {
          "id": "jmttdjr",
          "author": "WideAtmosphere",
          "body": "I became irrationally angry when the supermarket was out of my Safe Yogurt. Like ridiculously angry. I’m in my 40s…",
          "created_utc": 1685854188.0
        }
      ]
    },
    {
      "id": "jmwufpr",
      "author": "strawberry_poptart2",
      "body": "Ok this made me feel better because I am SUPER paranoid about food poisoning and parasites for whatever reason. \nI hope you can get the help you need friend. I am headed to IDP or Res (medical exam will determine  level of care) this summer to hopefully help me figure all of this out.",
      "created_utc": 1685914324.0,
      "score": 3,
      "context": [
        {
          "id": "jmtkoqm",
          "author": "strawberry_poptart2",
          "body": "- Bradycardia and all the symptoms with that \n- Exercise compulsion and not being able to take one day off. If I do, I don’t eat as much to compensate. \n-  Food rules \n- The self gaslighting and denial of having a problem\n- Feeling full making you want to jump off a cliff \n- Weird food fears (anyone else super paranoid about how long food is left out of the fridge?) \n- Lack of control while simultaneously feeling in control\n- Feeling cold and trying to act normal and gaslighting myself into feeling warm\n- Avoiding social events and self isolating \n- Wearing baggy clothes as I lose more weight \n\nIf you’re reading this and thinking “I’m not that bad” - believe me I never thought I would be here either. The eating disorder has completely taken over.",
          "created_utc": 1685848871.0
        },
        {
          "id": "jmtpbsq",
          "author": "blutlm",
          "body": "I have that same food fear! I'm super paranoid about food poisoning. And I don't even know why bc sometimes I tell myself that if I get sick and throw up it'll help aid in weight loss. \n\nThis list is kind of all the things that made me realize that I AM that bad.",
          "created_utc": 1685851602.0
        }
      ]
    },
    {
      "id": "jmwumc4",
      "author": "strawberry_poptart2",
      "body": "I feel crazy too. It sucks when eating helps you mentally feel better but the before and after the meal emotions are extremely hard to cope with.",
      "created_utc": 1685914404.0,
      "score": 1,
      "context": [
        {
          "id": "jmtkoqm",
          "author": "strawberry_poptart2",
          "body": "- Bradycardia and all the symptoms with that \n- Exercise compulsion and not being able to take one day off. If I do, I don’t eat as much to compensate. \n-  Food rules \n- The self gaslighting and denial of having a problem\n- Feeling full making you want to jump off a cliff \n- Weird food fears (anyone else super paranoid about how long food is left out of the fridge?) \n- Lack of control while simultaneously feeling in control\n- Feeling cold and trying to act normal and gaslighting myself into feeling warm\n- Avoiding social events and self isolating \n- Wearing baggy clothes as I lose more weight \n\nIf you’re reading this and thinking “I’m not that bad” - believe me I never thought I would be here either. The eating disorder has completely taken over.",
          "created_utc": 1685848871.0
        },
        {
          "id": "jmungg8",
          "author": "SummerBeanSoup",
          "body": "I always felt so alone in the feeling full jumping off a Cliff thing and the food rules. I’m not happy you have those struggles but i feel a little relief knowing those symptoms aren’t insane and unique to me. I feel so crazy all the time. I also cannot make myself eat when I’m sad or angry. If something happens at the beginning of the day, i still won’t be able to eat by bedtime. No matter how badly i want to",
          "created_utc": 1685878014.0
        }
      ]
    },
    {
      "id": "jmwuigk",
      "author": "strawberry_poptart2",
      "body": "SAME. I numb out. Better than constantly feeling anxious or depressed.",
      "created_utc": 1685914357.0,
      "score": 1,
      "context": [
        {
          "id": "jmtkoqm",
          "author": "strawberry_poptart2",
          "body": "- Bradycardia and all the symptoms with that \n- Exercise compulsion and not being able to take one day off. If I do, I don’t eat as much to compensate. \n-  Food rules \n- The self gaslighting and denial of having a problem\n- Feeling full making you want to jump off a cliff \n- Weird food fears (anyone else super paranoid about how long food is left out of the fridge?) \n- Lack of control while simultaneously feeling in control\n- Feeling cold and trying to act normal and gaslighting myself into feeling warm\n- Avoiding social events and self isolating \n- Wearing baggy clothes as I lose more weight \n\nIf you’re reading this and thinking “I’m not that bad” - believe me I never thought I would be here either. The eating disorder has completely taken over.",
          "created_utc": 1685848871.0
        },
        {
          "id": "jmtuhte",
          "author": "WideAtmosphere",
          "body": "Exercise addiction sucks so bad, but it’s my stress control.",
          "created_utc": 1685854952.0
        }
      ]
    },
    {
      "id": "jmx23av",
      "author": "strawberry_poptart2",
      "body": "Ugh same. My dietitian said that eating more allows me to feel more in my body which is why I can feel anxious sometimes when I am eating more",
      "created_utc": 1685917748.0,
      "score": 1,
      "context": [
        {
          "id": "jmtkoqm",
          "author": "strawberry_poptart2",
          "body": "- Bradycardia and all the symptoms with that \n- Exercise compulsion and not being able to take one day off. If I do, I don’t eat as much to compensate. \n-  Food rules \n- The self gaslighting and denial of having a problem\n- Feeling full making you want to jump off a cliff \n- Weird food fears (anyone else super paranoid about how long food is left out of the fridge?) \n- Lack of control while simultaneously feeling in control\n- Feeling cold and trying to act normal and gaslighting myself into feeling warm\n- Avoiding social events and self isolating \n- Wearing baggy clothes as I lose more weight \n\nIf you’re reading this and thinking “I’m not that bad” - believe me I never thought I would be here either. The eating disorder has completely taken over.",
          "created_utc": 1685848871.0
        },
        {
          "id": "jmww60g",
          "author": "pigsandunicorn",
          "body": "I HATE feeling full...it absolutely surges my anxiety and panic attacks, so I intentionally don't eat enough to be full, can't talk to anyone about it though, they could never understand.",
          "created_utc": 1685915071.0
        }
      ]
    },
    {
      "id": "jmtp5e4",
      "author": "UselessHuman1",
      "body": "I don't need to ask. I know! Lol\n\nEdit: Can't write",
      "created_utc": 1685851493.0,
      "score": 2,
      "context": [
        {
          "id": "jmtjn13",
          "author": "UselessHuman1",
          "body": "The constipation or diharea. No in between.",
          "created_utc": 1685848279.0
        },
        {
          "id": "jmtozmn",
          "author": "blutlm",
          "body": "Or both at the same time! Don't ask how. It makes no sense",
          "created_utc": 1685851393.0
        }
      ]
    },
    {
      "id": "jmvosl8",
      "author": "WideAtmosphere",
      "body": "Yes! **drinks plain water** **farts like a warthog**",
      "created_utc": 1685896578.0,
      "score": 1,
      "context": [
        {
          "id": "jmtul5r",
          "author": "WideAtmosphere",
          "body": "The bloating and gas. I’m so sick of it.",
          "created_utc": 1685855015.0
        },
        {
          "id": "jmu3gg6",
          "author": "blutlm",
          "body": "I swear I'm gassy even on an empty stomach. Like how?",
          "created_utc": 1685861634.0
        }
      ]
    }
  ]
}