{
  "id": "1433mx3",
  "subreddit": "EatingDisorders",
  "author": "Smooth_Employ_6294",
  "created_utc": 1686113357.0,
  "title": "Why does eating less make me happier?",
  "selftext": "Every day I under-eat I notice that the entire day I was genuinely happier. You might say I wasn’t really happy but trust me I was. I don’t get why this happens and I feel as though it’s not good. Any ideas on why?\n\nEdit: Holy crap thank you all so much! This really helped me ❤️❤️",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1433mx3/why_does_eating_less_make_me_happier/",
  "score": 72,
  "num_comments": 20,
  "comments": [
    {
      "id": "jn8ocu0",
      "author": "Anti-Diet-Newbie",
      "body": "Yeah, this is a thing for some people. I've heard this called 'starvation high'. It's really hard to deal with, but I think it might be helpful to look at it like the high from taking a drug. It may feel good in the moment, but in the long run it just makes everything worse.",
      "created_utc": 1686136780.0,
      "score": 39,
      "context": []
    },
    {
      "id": "jn8q1me",
      "author": "strawberry_poptart2",
      "body": "Starvation high. Also- I love feeling numbed out.",
      "created_utc": 1686137790.0,
      "score": 25,
      "context": []
    },
    {
      "id": "jn85rd1",
      "author": "themurderdetective",
      "body": "here’s how it is for me \nlow cal days- depressed but euphoric and proud?\nmaintenance days-happy during day but guilty at night \nbinge days- disgusting and TERRIBLE self esteem\nhowever when i was at my lw i felt so pretty and appealing to guys and now that i’ve gained the weight i lose back i feel ugly again even though i’ve been told by guys my body now looks better since i got my curves back. it just goes to show that we are so judgmental towards overselves on things others don’t notice! the reason may be that you feel in control so you feel better? for me i was SO excited to see the weight drop the next morning. maybe you associate food with negative ideas? hang in there it will get better 💓",
      "created_utc": 1686122140.0,
      "score": 18,
      "context": []
    },
    {
      "id": "jn9d6b8",
      "author": "BabyUtensil",
      "body": "Honeymoon period of restriction",
      "created_utc": 1686148539.0,
      "score": 13,
      "context": []
    },
    {
      "id": "jn8rf82",
      "author": "scrambled-satellite",
      "body": "I get the same starvation high, esp when fasting🥲\n\nNot sure how to convince myself to stop trying for it.",
      "created_utc": 1686138575.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jn933m2",
      "author": "Training-Cry510",
      "body": "I get like that after a binge cycle, but once it’s been a while it goes away. I feel like it brings back the honeymoon period for a short time. I feel skinnier, sexier, cleaner. I do really get more energy at first, and feel like a better version of myself like a drug almost. After a couple weeks it goes the other way, and then the binging starts up again.",
      "created_utc": 1686144351.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jnasli2",
      "author": "Recipe-That",
      "body": "Maybe the sense of control ?",
      "created_utc": 1686167732.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jnckzru",
      "author": "None",
      "body": "For me its the confidence. I feel like I look skinnier when I really just look the same.",
      "created_utc": 1686194580.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jn8u216",
      "author": "bonnifire92",
      "body": "Yeeaaahh been dealing with that for the past few months. 😕",
      "created_utc": 1686140009.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jn99kjm",
      "author": "SuccessfulWinter2826",
      "body": "Same here!!! Curious if you find that while you are happier you are also less stable in terms of close relationships? Meaning small things tick me off in a way that makes me want to happily isolate myself from anyone else who could disturb that, aka my close relationships. Idk if that makes sense",
      "created_utc": 1686147101.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jnbbjkf",
      "author": "None",
      "body": "For me it's like going to the gym - it can suck in the moment, but when I think about the progress I'm making I am STOKED that I'm being strong",
      "created_utc": 1686174750.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jn7z6qf",
      "author": "Civil-Art-3724",
      "body": "Not for me I always end up undereating for a week and 2 and get so depressed and I actually do have days when I cry during these undereating episodes but then I end up binging and getting happy but then purge my calories after it’s a cycle man i wish I could break it but my Ed tells I have to be bones",
      "created_utc": 1686117152.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jnbs3z0",
      "author": "updown27",
      "body": "To the best of my understanding, starving your body triggers endorphins because your body thinks it's in danger. For a while, you will have more energy, better focus, better mood. But over time you will not be able to maintain that response and while your fatigue and brain fog may come on so slowly you don't notice the change, it will likely be apparent to others and you will DEFINITELY notice the difference when you restore your body's digestive function. Hopefully it doesn't get to that point for you :)",
      "created_utc": 1686181698.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jnbxl0z",
      "author": "Starsdripping",
      "body": "So I watched this YouTube documentary of fasting for a week where these 2 guys did a feeling log and measured their glucose levels. After the 2nd day through the 4-5 day they felt calm, content, stable mood, motivated and happy. After the 5th day both of them had a crash in their mood. \n\nI think it has something to do with the glucose, glucagon and glycogen in our body’s storage and the process of ketosis. In my nutrition class we went over the cycles of that. And I think one of them is the depletion of the storage. It also has something to do with if you’re getting it from fat storage or proteins storage or carbohydrate storage.",
      "created_utc": 1686184102.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jndt0k7",
      "author": "Mayane_",
      "body": "Saaame, I have had that feeling since I was 12 years old (now I am 24). I am extremely happy when I eat less than normal, and I feel extremely guilty when eating how much I suppose to it to be healthy and not have any health problems, 'cus I think that I don't deserve to eat that much because I always need to lose weight...  \nNow I can eat an apple and a cucumber in a day and feel happy, but when I lose control of that and eat just an apple more I can end up crying and blaming myself all day long.  \nI like the feeling of ache in my stomach, I like it when my ribs ache when I just lie down on them, I looove when I can see and feel my bones throw my skin.   \nI would rather not eat anything and die happy than blame myself for whole my life...",
      "created_utc": 1686225404.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jn96rfm",
      "author": "None",
      "body": "If you need anyone to chat to that understands I’m here and DMs are always open.",
      "created_utc": 1686145933.0,
      "score": 1,
      "context": []
    },
    {
      "id": "joc0b1w",
      "author": "None",
      "body": "starvation high makes me feel so good",
      "created_utc": 1686910261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jn933by",
      "author": "theresfireinhereyes",
      "body": "This. Everything is just numb. There's nothing quite like it, unfortunately.",
      "created_utc": 1686144348.0,
      "score": 10,
      "context": [
        {
          "id": "jn8q1me",
          "author": "strawberry_poptart2",
          "body": "Starvation high. Also- I love feeling numbed out.",
          "created_utc": 1686137790.0
        }
      ]
    },
    {
      "id": "jnav5vk",
      "author": "blackcoffeeuwu",
      "body": "i have similar thoughts during low cal days vs maintance days. it’s crazy how similar we all think 😭 it’s just so hard some days, it feels validating knowing there are other people out there fighting the same issue as me, makes me feel less alone.",
      "created_utc": 1686168696.0,
      "score": 7,
      "context": [
        {
          "id": "jn85rd1",
          "author": "themurderdetective",
          "body": "here’s how it is for me \nlow cal days- depressed but euphoric and proud?\nmaintenance days-happy during day but guilty at night \nbinge days- disgusting and TERRIBLE self esteem\nhowever when i was at my lw i felt so pretty and appealing to guys and now that i’ve gained the weight i lose back i feel ugly again even though i’ve been told by guys my body now looks better since i got my curves back. it just goes to show that we are so judgmental towards overselves on things others don’t notice! the reason may be that you feel in control so you feel better? for me i was SO excited to see the weight drop the next morning. maybe you associate food with negative ideas? hang in there it will get better 💓",
          "created_utc": 1686122140.0
        }
      ]
    }
  ]
}