{
  "id": "147patv",
  "subreddit": "EatingDisorders",
  "author": "Lazy_Success8453",
  "created_utc": 1686579591.0,
  "title": "I got my period back!!",
  "selftext": "Usually not something people celebrate or particularly enjoy, but I got my period again today after not having it. My anemia is better as well, which resulted in my blood pressure and heartbeat rising to normal!! I’m becoming healthy and giving my body life again. Your reminder that it’s really worth it, go enjoy your summer and make memories👍 (Btw even if you never lost your period during your ed, you’re still very much valid)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/147patv/i_got_my_period_back/",
  "score": 59,
  "num_comments": 7,
  "comments": [
    {
      "id": "jnwj0gy",
      "author": "coochie96420",
      "body": "🩷",
      "created_utc": 1686586478.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jnxyv9p",
      "author": "the_cadaver_synod",
      "body": "Awesome! Congratulations on this step in your recovery!",
      "created_utc": 1686614543.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jnylrd9",
      "author": "Northstar04",
      "body": "amazing!",
      "created_utc": 1686628217.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jnzl4bp",
      "author": "HARRDY_HARR",
      "body": "Congratulations!! Can you tell me how you recovered and how long it took? I guess I’m in recovery but my mind still says, “once the doctors see that my health is back to normal, they’ll lift my restrictions, I can do it what I want, thus eat what and WHEN I want (aka, restrict again if I wanted “, but more secretly)”.",
      "created_utc": 1686659863.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo0mj0b",
      "author": "kran79",
      "body": "Congratulations! Your future self will thank you when you're older and you have the ability to move independently and reduce fractures!",
      "created_utc": 1686679977.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo1goon",
      "author": "LogLate8102",
      "body": "It absolutely is not weird to celebrate this, congratulations! I was thrilled when I got mine back after 3 years. Keep going ♥️",
      "created_utc": 1686695234.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jnzngcm",
      "author": "Lazy_Success8453",
      "body": "Thank you!! I don’t think anyone with an eating disorder fully “recovers”, ever. What I mean is that we let go of our disordered habits and try to regain a healthy and positive relationship with oneself and food, but the mindset and thoughts regarding all of this still exit somewhere in the back of your head. I believe Ed’s are psychological and most of it is not because of numbers or looks but because of our brains. When in recovery it’ll feel like it all become even worse, or at least it did for me. You’ll go back to restriction maybe or you’ll have a really hard time throughout the whole process. I’ve had bulimia which I “recovered” from, which later came back as anorexia a year or so later. But I have myself to blame for that, because I never really healed my mind and body, I just moved on. Don’t get me wrong recovery is very very much possible!! I started a few months back and got into some old habits. You just have to relearn what your body and mind needs to feel satiated and happy, (which is hard). I myself would not call me fully recovered because I sometimes think about going back to my illness, but then I remember moments from before my illness, and moments after trying recovery, and how much freedom I had. I didn’t have to think about food and my body all of the time, I actually had energy and strength, and I could pay attention to the people around me. I’m not sure if I helped in any way. And I think when you reach the point of “normal” and have had a wif of what it feels like to have food freedom, you’ll want to go back a little less. I also believe recovery on your own and not in hospitals is much more effective. Good luck, I know you can do this!!",
      "created_utc": 1686661396.0,
      "score": 1,
      "context": [
        {
          "id": "jnzl4bp",
          "author": "HARRDY_HARR",
          "body": "Congratulations!! Can you tell me how you recovered and how long it took? I guess I’m in recovery but my mind still says, “once the doctors see that my health is back to normal, they’ll lift my restrictions, I can do it what I want, thus eat what and WHEN I want (aka, restrict again if I wanted “, but more secretly)”.",
          "created_utc": 1686659863.0
        }
      ]
    }
  ]
}