{
  "id": "148twak",
  "subreddit": "EatingDisorders",
  "author": "VeterinarianOk2107",
  "created_utc": 1686702449.0,
  "title": "I feel like I’ll never be pretty if I’m not skinny",
  "selftext": "honestly i get so annoyed when my skinny friends talk about how hard it is being skinny (not their fault but yeah) or when someone really skinny calls themselves fat. i have this itchy feeling of wanting to lash out because all my life ive just wanted to be skinny. i want to be one of those girls that eats but doesn’t gain weight. i thought i was slowly recovering since i dont think about food or my weight as much but since summer is coming up all i can think about is losing weight and becoming skinny and getting a “summer body”. i feel so ashamed of myself and i feel like im going to go back to restricting. how do i stop myself from feeling like this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/148twak/i_feel_like_ill_never_be_pretty_if_im_not_skinny/",
  "score": 120,
  "num_comments": 37,
  "comments": [
    {
      "id": "jo1z5bs",
      "author": "velogirl",
      "body": "Is it summer? Do you have a body? If yes then you have a summer body. As someone who is older, please know that weight is so far from what makes you pretty. An ED makes you grouchy and not a pretty person to be around.",
      "created_utc": 1686705670.0,
      "score": 29,
      "context": []
    },
    {
      "id": "jo1wuqf",
      "author": "boomboomcoconut",
      "body": "I grew up in a family that skinny=pretty. Honestly, it takes a lot of working on yourself through therapy. Something that's really helped me is getting a new hobby or working on something that you enjoy. That way, you can have a sense of accomplishment. \n\nThe itch may never leave you but it's good that you recognize it! Baby steps my friend",
      "created_utc": 1686704349.0,
      "score": 16,
      "context": []
    },
    {
      "id": "jo2ga5b",
      "author": "ratcrispytreat",
      "body": "if you have to break your back to look a certain way it isn’t natural, healthy, or worth it. there is nothing special about ~being skinny~ it’s more special to enjoy the summer weather and the people you spend your time with anyways. Surround yourself with good people who aren’t so focused on their appearances, if you can manage to do that.",
      "created_utc": 1686716332.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jo3o7rb",
      "author": "Northstar04",
      "body": "\"I want to be one of those girls that eats but doesn't gain weight\"\n\nThose don't exist. Sure, some people have higher metabolisms, but not grossly. Those skinny girls don't eat that much. Or they are very active. Likely both. I know because I was one. People would ask me how I didn't seem to gain weight when they saw me eating pizza or whatever. That was often my only meal of the day. I never ate breakfast. I often didn't eat lunch. I didn't snack. I didn't eat more calories than I burned. I was always hungry. I was hungry everyday for decades. I obsessed about food.\n\nYou can have an eating disorder regardless of your weight. Treat your body kindly.",
      "created_utc": 1686749929.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jo3lpma",
      "author": "aqua_bears",
      "body": "Recovery is not linear, and there will be setbacks and challenges. Don't let them throw you off, don't let them undermine the amazing progress you have been making.\n\nI know I'm just a random internet stranger, but skinny isn't pretty. Confidence is. Happiness is. Being healthy is, being yourself is. I find myself most drawn to these people, beautiful inside and therefore outside. They glow. It's magnetic. I see this beauty in strangers, and also in the people I love. I struggle to understand this for myself, too... So I know how hard it is. But I believe the happier I become and the more confident and calm in my body I am, the more I can love and accept myself... the more I will also radiate that beauty, and the more the people who matter in my life will see that beauty in me.",
      "created_utc": 1686748646.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jo47z3x",
      "author": "Slenso",
      "body": "My therapist and I were just talking about this last night. \nShe told me that I need to start breaking down the things I consider beautiful and really start supporting and creating new neuro pathaways of what I think it’s pretty or beautiful especially and specifically on myself. \nSo I need to make more effort exposing myself to new body types and considering them beautiful especially on myself. She mentioned how this will take a lot of time and a very long time. Just as long as it took the nuero pathways of what you think is pretty now on yourself. \nShe told me for now I should focus on other things that make me feel pretty that aren’t my body. \nI.e skin, hair and nails. \nI really struggle with not feeling beautiful without my unhealthy body. But I do feel a little pretty when I get my hair done, my nails done, or makeup. \nI went to the hair dresser and got tips on how to style my hair. I invested in a gel nail set up at home so I can do my nails often. And I recently bought some makeup that Iv always wanted to invent so use getting ready and feeling pretty. \nI know some of the things I mentioned to try are a little material and not accessible for everyone to do to feel better but I hope you can at least find a new perspective on the feeling and maybe a little inspiration and know your not alone at least <3 all the luck to you !",
      "created_utc": 1686758745.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jo3uj5t",
      "author": "allofme6",
      "body": "Stop comparing yourself. Skinny /fat neither equals pretty.  If your friends are triggering you like this distance yourself. Almost everyone small/big/ thin/fat,  has some kind of body image bs they deal with. You are you. Keep being you. 🖤",
      "created_utc": 1686752905.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jo58sk9",
      "author": "maryhoppins19",
      "body": "-First off, find friends that don’t trigger you. People that talk like that are insecure, asking for attention (compliments) and it only adds to your own insecurities. It’s toxic af. \n-Second, if you look at the past few decades, the “ideal” body type has changed so much. In the 90s and 2000s, it was “cool” to be super skinny, they literally called it “heroin chic.” Now it’s way more acceptable to accept your natural body the way it is, no matter the size. Embrace that!\n-Lastly, I struggled with eating disorders my whole life. I’ve been a lot of different weights, and every time I got “skinny,” it made me no happier. Make sure you are healthy, active, and keeping up good eating habits and mental health habits. ONLY then will you be satisfied with the body you have. The grass is NEVER greener, I promise. \n\nGood luck! This is temporary :)",
      "created_utc": 1686774093.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jo67y91",
      "author": "Milkywaes1",
      "body": "Omg wow. If I had a diary it would sound just like this, I've just been struggling with the same feelings. I'm not considered overweight but I'm skinny fat, I really want to lose more weight now that its summer.. but I'm scared of falling into another eating disorder. I also have an underweight sister who talks a lot about how she feels so fat. I feel bad for her, I'd also kill to have her body and her small appetite :(",
      "created_utc": 1686790616.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jo6xxl8",
      "author": "Opposite_Ad_1674",
      "body": "I absolutely get this. Being a college student i really dont get a lot of time or the energy to go to the gym after classes and its just bleh",
      "created_utc": 1686805457.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jo7k4qx",
      "author": "Therandomderpdude",
      "body": "Take a break from social media. Avoid mirror checks and scales. \n\nTake some time alone with your hobbies. Listen to music. Do some self care. \n\nTry journaling and writing or drawing how you feel, write down all your frustrations. This is a great way to ease some stress/anxiety/racing thoughts. \n\nSometimes by stressing about the unwanted thoughts, you make them have more power over you. That is why it’s important to acknowledge them instead of feeling ashamed and guilty and trying to push them away. \n\nI’ve been recovered from anorexia for 6 years and I know the feelings and urges can feel scary. \n\nTry to acknowledge your inner values as well. Tell yourself 3 things you feel grateful for. \n\nTell yourself 3 things your body does that you feel grateful for like, your nose allowing you to smell the flowers/ocean. Your ear’s allowing you to enjoy your favorite music. Your body allowing you to visit your favorite places. \n\nAlso remember that You have value as a human, and you are more than your body. Try to Ignore the “summer body” trends.\n\nIt’s not a quick fix, but eventually you will change your mindset and focus on things that truly matters and make you happy.",
      "created_utc": 1686824183.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jocjo93",
      "author": "Tarsiger",
      "body": "I grow up with healthy habits. Never being owerweight, but never skinny. But oh then I become a woman and forced to face what some men thought. And there started bing eating, and unhealthy eatinghabits. Our society promots gross thinking about weight and eating. Do some research about what different times have said is beautiful. Well Twiggy was skinny, but Sophia Loren and Marilyn Monroe? And go to an art museum and look at old paintings. Its not you, its our society. But not everyone agree. You are beautiful for so many people.",
      "created_utc": 1686922018.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jplfm01",
      "author": "Flashy-Engineer-3065",
      "body": "Same honestly. I just think that \"oh I'll do this when I'm skinnier \" \"I'll wear that when I'm thinner\" it's so hard honestly.",
      "created_utc": 1687791088.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jz0wnak",
      "author": "Big-Yak670",
      "body": "You are literally fighting with every single message society is trying to drill into women. Hang in there",
      "created_utc": 1693786454.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jo3jlwn",
      "author": "TigerOpposite5096",
      "body": "Same brdr fr",
      "created_utc": 1686747546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo3q1rx",
      "author": "savannahruns",
      "body": "Honestly part of my recovery has been accepting that my \"prettiest\" weights just aren't natural for me, and I have to move on.  It doesn't mean I don't still try to look nice, but I'm not setting the goal of looking as pretty as I did then or letting myself get stuck on it because then I just throw in the towel or am bitter and there's nothing as un-pretty as people like that.",
      "created_utc": 1686750822.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo71714",
      "author": "Junior_Positive_1724",
      "body": "i’m doing pretty bad with relapsing too but something my therapist told me kind of helps with negative thinking. it sounds weird but trying to give funny or “affectionate” terms to things that trigger you helps with shifting a negative mindset. for example, i’m SUPER obsessed and concerned with bloating. offhandedly my therapist called it a “buddha belly,” which i thought was funny😭 but also so much less harmful than the words i would have used to describe myself. obviously i don’t bloat to that size but idk buddha is a representation of peace and tranquility and using that word to describe something i hate about myself has genuinely helped a little with food anxiety. i hate myself a lot less after eating when i try to think in singular gentle terms like that, instead of trying to force myself to constantly think healthy things about my body. recovery is very very very small steps! i can’t yet fathom affectionately referring to any other part of my body, and i still often struggle with just that one term. but relapses happen, it’s a part of recovery. fight what you’re feeling when you can, and remember that no one is as concerned or as focused on your physical appearance as you are :) i hope this made sense/helps a little. we are in your corner ❤️",
      "created_utc": 1686807845.0,
      "score": 1,
      "context": []
    },
    {
      "id": "joc7p7y",
      "author": "DentalEDS",
      "body": "Been there and still am in some ways, so you are not alone.",
      "created_utc": 1686915493.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jo32lor",
      "author": "VeterinarianOk2107",
      "body": "haha that definitely makes sense! i know that its not sensible to think that weight defines my prettiness and i wish i could stop my mindset😭",
      "created_utc": 1686735655.0,
      "score": 8,
      "context": [
        {
          "id": "jo1z5bs",
          "author": "velogirl",
          "body": "Is it summer? Do you have a body? If yes then you have a summer body. As someone who is older, please know that weight is so far from what makes you pretty. An ED makes you grouchy and not a pretty person to be around.",
          "created_utc": 1686705670.0
        }
      ]
    },
    {
      "id": "jo1xc0z",
      "author": "VeterinarianOk2107",
      "body": "my family also often shamed me for being chubby😭 and my mom still comments on how much i eat from time to time. i hope i can get therapy when im older! also i’ll definitely try and work on that suggestion of picking up a hobby. thank you😭🫶🏻",
      "created_utc": 1686704629.0,
      "score": 8,
      "context": [
        {
          "id": "jo1wuqf",
          "author": "boomboomcoconut",
          "body": "I grew up in a family that skinny=pretty. Honestly, it takes a lot of working on yourself through therapy. Something that's really helped me is getting a new hobby or working on something that you enjoy. That way, you can have a sense of accomplishment. \n\nThe itch may never leave you but it's good that you recognize it! Baby steps my friend",
          "created_utc": 1686704349.0
        }
      ]
    },
    {
      "id": "jo32mo1",
      "author": "VeterinarianOk2107",
      "body": "i will try my best, thank u😭",
      "created_utc": 1686735680.0,
      "score": 3,
      "context": [
        {
          "id": "jo2ga5b",
          "author": "ratcrispytreat",
          "body": "if you have to break your back to look a certain way it isn’t natural, healthy, or worth it. there is nothing special about ~being skinny~ it’s more special to enjoy the summer weather and the people you spend your time with anyways. Surround yourself with good people who aren’t so focused on their appearances, if you can manage to do that.",
          "created_utc": 1686716332.0
        }
      ]
    },
    {
      "id": "jo3og48",
      "author": "VeterinarianOk2107",
      "body": "thank you so much🙏🏼🙏🏼🙏🏼😭😭 i agree that confidence is very attractive on other people but i cant seem to see it in me😭",
      "created_utc": 1686750044.0,
      "score": 2,
      "context": [
        {
          "id": "jo3lpma",
          "author": "aqua_bears",
          "body": "Recovery is not linear, and there will be setbacks and challenges. Don't let them throw you off, don't let them undermine the amazing progress you have been making.\n\nI know I'm just a random internet stranger, but skinny isn't pretty. Confidence is. Happiness is. Being healthy is, being yourself is. I find myself most drawn to these people, beautiful inside and therefore outside. They glow. It's magnetic. I see this beauty in strangers, and also in the people I love. I struggle to understand this for myself, too... So I know how hard it is. But I believe the happier I become and the more confident and calm in my body I am, the more I can love and accept myself... the more I will also radiate that beauty, and the more the people who matter in my life will see that beauty in me.",
          "created_utc": 1686748646.0
        }
      ]
    },
    {
      "id": "jo48gfn",
      "author": "VeterinarianOk2107",
      "body": "thank u so much for the advice! i think that might be why i love getting my nails done and getting lash extensions cause they both do help me in feeling pretty. ur therapist sounds really nice. wishing u the best too🙏🏼😭",
      "created_utc": 1686758950.0,
      "score": 2,
      "context": [
        {
          "id": "jo47z3x",
          "author": "Slenso",
          "body": "My therapist and I were just talking about this last night. \nShe told me that I need to start breaking down the things I consider beautiful and really start supporting and creating new neuro pathaways of what I think it’s pretty or beautiful especially and specifically on myself. \nSo I need to make more effort exposing myself to new body types and considering them beautiful especially on myself. She mentioned how this will take a lot of time and a very long time. Just as long as it took the nuero pathways of what you think is pretty now on yourself. \nShe told me for now I should focus on other things that make me feel pretty that aren’t my body. \nI.e skin, hair and nails. \nI really struggle with not feeling beautiful without my unhealthy body. But I do feel a little pretty when I get my hair done, my nails done, or makeup. \nI went to the hair dresser and got tips on how to style my hair. I invested in a gel nail set up at home so I can do my nails often. And I recently bought some makeup that Iv always wanted to invent so use getting ready and feeling pretty. \nI know some of the things I mentioned to try are a little material and not accessible for everyone to do to feel better but I hope you can at least find a new perspective on the feeling and maybe a little inspiration and know your not alone at least <3 all the luck to you !",
          "created_utc": 1686758745.0
        }
      ]
    },
    {
      "id": "jo59d03",
      "author": "maryhoppins19",
      "body": "Also should add….no one else has to live in your body, so you need to think about what YOU want, not what potential partners/friends/family want. There is someone for everyone, and only the people who really love you won’t care what size you are!",
      "created_utc": 1686774327.0,
      "score": 2,
      "context": [
        {
          "id": "jo58sk9",
          "author": "maryhoppins19",
          "body": "-First off, find friends that don’t trigger you. People that talk like that are insecure, asking for attention (compliments) and it only adds to your own insecurities. It’s toxic af. \n-Second, if you look at the past few decades, the “ideal” body type has changed so much. In the 90s and 2000s, it was “cool” to be super skinny, they literally called it “heroin chic.” Now it’s way more acceptable to accept your natural body the way it is, no matter the size. Embrace that!\n-Lastly, I struggled with eating disorders my whole life. I’ve been a lot of different weights, and every time I got “skinny,” it made me no happier. Make sure you are healthy, active, and keeping up good eating habits and mental health habits. ONLY then will you be satisfied with the body you have. The grass is NEVER greener, I promise. \n\nGood luck! This is temporary :)",
          "created_utc": 1686774093.0
        }
      ]
    },
    {
      "id": "jo7kdum",
      "author": "VeterinarianOk2107",
      "body": "thank you so much😭🫶🏻",
      "created_utc": 1686824384.0,
      "score": 2,
      "context": [
        {
          "id": "jo58sk9",
          "author": "maryhoppins19",
          "body": "-First off, find friends that don’t trigger you. People that talk like that are insecure, asking for attention (compliments) and it only adds to your own insecurities. It’s toxic af. \n-Second, if you look at the past few decades, the “ideal” body type has changed so much. In the 90s and 2000s, it was “cool” to be super skinny, they literally called it “heroin chic.” Now it’s way more acceptable to accept your natural body the way it is, no matter the size. Embrace that!\n-Lastly, I struggled with eating disorders my whole life. I’ve been a lot of different weights, and every time I got “skinny,” it made me no happier. Make sure you are healthy, active, and keeping up good eating habits and mental health habits. ONLY then will you be satisfied with the body you have. The grass is NEVER greener, I promise. \n\nGood luck! This is temporary :)",
          "created_utc": 1686774093.0
        }
      ]
    },
    {
      "id": "jo7kh0u",
      "author": "VeterinarianOk2107",
      "body": "im glad im not the only one who feels this way. this happens to me almost every summer and the pressure to look skinny in a bikini😭 i hope your sister is okay and i wish u the best🫶🏻",
      "created_utc": 1686824455.0,
      "score": 2,
      "context": [
        {
          "id": "jo67y91",
          "author": "Milkywaes1",
          "body": "Omg wow. If I had a diary it would sound just like this, I've just been struggling with the same feelings. I'm not considered overweight but I'm skinny fat, I really want to lose more weight now that its summer.. but I'm scared of falling into another eating disorder. I also have an underweight sister who talks a lot about how she feels so fat. I feel bad for her, I'd also kill to have her body and her small appetite :(",
          "created_utc": 1686790616.0
        }
      ]
    },
    {
      "id": "jo7kqc2",
      "author": "VeterinarianOk2107",
      "body": "the mirror checks and scales have been my daily habit which is so unhealthy so ill try and not do that anymore. and i love drawing so i might focus on that instead! im so glad that you’ve recovered 🫶🏻 thank you so much for the advice and ill try to take them to heart and follow them😭",
      "created_utc": 1686824659.0,
      "score": 2,
      "context": [
        {
          "id": "jo7k4qx",
          "author": "Therandomderpdude",
          "body": "Take a break from social media. Avoid mirror checks and scales. \n\nTake some time alone with your hobbies. Listen to music. Do some self care. \n\nTry journaling and writing or drawing how you feel, write down all your frustrations. This is a great way to ease some stress/anxiety/racing thoughts. \n\nSometimes by stressing about the unwanted thoughts, you make them have more power over you. That is why it’s important to acknowledge them instead of feeling ashamed and guilty and trying to push them away. \n\nI’ve been recovered from anorexia for 6 years and I know the feelings and urges can feel scary. \n\nTry to acknowledge your inner values as well. Tell yourself 3 things you feel grateful for. \n\nTell yourself 3 things your body does that you feel grateful for like, your nose allowing you to smell the flowers/ocean. Your ear’s allowing you to enjoy your favorite music. Your body allowing you to visit your favorite places. \n\nAlso remember that You have value as a human, and you are more than your body. Try to Ignore the “summer body” trends.\n\nIt’s not a quick fix, but eventually you will change your mindset and focus on things that truly matters and make you happy.",
          "created_utc": 1686824183.0
        }
      ]
    },
    {
      "id": "jo485vk",
      "author": "VeterinarianOk2107",
      "body": "me too! i used to constantly starve to try and keep my weight which ofcourse isnt healthy😭😭 im trying not to go back to that phase in life but i have my bad days",
      "created_utc": 1686758826.0,
      "score": 2,
      "context": [
        {
          "id": "jo3q1rx",
          "author": "savannahruns",
          "body": "Honestly part of my recovery has been accepting that my \"prettiest\" weights just aren't natural for me, and I have to move on.  It doesn't mean I don't still try to look nice, but I'm not setting the goal of looking as pretty as I did then or letting myself get stuck on it because then I just throw in the towel or am bitter and there's nothing as un-pretty as people like that.",
          "created_utc": 1686750822.0
        }
      ]
    },
    {
      "id": "jo7kl5w",
      "author": "VeterinarianOk2107",
      "body": "that actually sounds so wholesome and ur therapist seems funny😭😭😭 and thank u so much for the advice! im going to try and change my mindset step by step if i can🫶🏻🫶🏻🫶🏻🫶🏻",
      "created_utc": 1686824544.0,
      "score": 1,
      "context": [
        {
          "id": "jo71714",
          "author": "Junior_Positive_1724",
          "body": "i’m doing pretty bad with relapsing too but something my therapist told me kind of helps with negative thinking. it sounds weird but trying to give funny or “affectionate” terms to things that trigger you helps with shifting a negative mindset. for example, i’m SUPER obsessed and concerned with bloating. offhandedly my therapist called it a “buddha belly,” which i thought was funny😭 but also so much less harmful than the words i would have used to describe myself. obviously i don’t bloat to that size but idk buddha is a representation of peace and tranquility and using that word to describe something i hate about myself has genuinely helped a little with food anxiety. i hate myself a lot less after eating when i try to think in singular gentle terms like that, instead of trying to force myself to constantly think healthy things about my body. recovery is very very very small steps! i can’t yet fathom affectionately referring to any other part of my body, and i still often struggle with just that one term. but relapses happen, it’s a part of recovery. fight what you’re feeling when you can, and remember that no one is as concerned or as focused on your physical appearance as you are :) i hope this made sense/helps a little. we are in your corner ❤️",
          "created_utc": 1686807845.0
        }
      ]
    },
    {
      "id": "jojib2s",
      "author": "Long_Tart_3860",
      "body": "Don’t we all :/",
      "created_utc": 1687055478.0,
      "score": 3,
      "context": [
        {
          "id": "jo1z5bs",
          "author": "velogirl",
          "body": "Is it summer? Do you have a body? If yes then you have a summer body. As someone who is older, please know that weight is so far from what makes you pretty. An ED makes you grouchy and not a pretty person to be around.",
          "created_utc": 1686705670.0
        },
        {
          "id": "jo32lor",
          "author": "VeterinarianOk2107",
          "body": "haha that definitely makes sense! i know that its not sensible to think that weight defines my prettiness and i wish i could stop my mindset😭",
          "created_utc": 1686735655.0
        }
      ]
    },
    {
      "id": "jo1xwux",
      "author": "boomboomcoconut",
      "body": "It's so hard because you feel that way, then your family reinforces those opinions, then you have your friends talking about being skinny. It's hard to break through that cycle :/",
      "created_utc": 1686704958.0,
      "score": 5,
      "context": [
        {
          "id": "jo1wuqf",
          "author": "boomboomcoconut",
          "body": "I grew up in a family that skinny=pretty. Honestly, it takes a lot of working on yourself through therapy. Something that's really helped me is getting a new hobby or working on something that you enjoy. That way, you can have a sense of accomplishment. \n\nThe itch may never leave you but it's good that you recognize it! Baby steps my friend",
          "created_utc": 1686704349.0
        },
        {
          "id": "jo1xc0z",
          "author": "VeterinarianOk2107",
          "body": "my family also often shamed me for being chubby😭 and my mom still comments on how much i eat from time to time. i hope i can get therapy when im older! also i’ll definitely try and work on that suggestion of picking up a hobby. thank you😭🫶🏻",
          "created_utc": 1686704629.0
        }
      ]
    },
    {
      "id": "jo4cxe7",
      "author": "aqua_bears",
      "body": "You will get there! It takes time, be stubborn and fight. I will send you all my good thoughts!",
      "created_utc": 1686760832.0,
      "score": 2,
      "context": [
        {
          "id": "jo3lpma",
          "author": "aqua_bears",
          "body": "Recovery is not linear, and there will be setbacks and challenges. Don't let them throw you off, don't let them undermine the amazing progress you have been making.\n\nI know I'm just a random internet stranger, but skinny isn't pretty. Confidence is. Happiness is. Being healthy is, being yourself is. I find myself most drawn to these people, beautiful inside and therefore outside. They glow. It's magnetic. I see this beauty in strangers, and also in the people I love. I struggle to understand this for myself, too... So I know how hard it is. But I believe the happier I become and the more confident and calm in my body I am, the more I can love and accept myself... the more I will also radiate that beauty, and the more the people who matter in my life will see that beauty in me.",
          "created_utc": 1686748646.0
        },
        {
          "id": "jo3og48",
          "author": "VeterinarianOk2107",
          "body": "thank you so much🙏🏼🙏🏼🙏🏼😭😭 i agree that confidence is very attractive on other people but i cant seem to see it in me😭",
          "created_utc": 1686750044.0
        }
      ]
    },
    {
      "id": "jo495pg",
      "author": "Slenso",
      "body": "We also talked about how my eating disorder especially in extreme restriction brings me suffering. I.e health problems, hair loss, energy loss, lying, bad habits, friendship loss\nAnd how when we as humans suffer we have 4 options ( this is also a DBT skill) we can \n1. Change the situation \n2. Find a silver lining\n3. Accept the situation ( she mentioned this is more reserved for those who suffer from greif and loss sometimes there’s no option but to accept the situation but not always) \n4. Sit and suffer and continue to suffer. \nThat really spoke to me. \nShe mentioned how if I truly don’t want to suffer I’ll need to change and remember the things we talked about above and practice them when I want to restrict. \nI mentioned how this is possible and realistic that it would make eating and being in a healthy body easier but I will still struggle always. She said that was realistic and to focus on making it easier not making it go away. Sending you all the love and care right now I can understand how hard this is ! I believe in you! You’ve got the strength to get through this hard part!",
      "created_utc": 1686759249.0,
      "score": 1,
      "context": [
        {
          "id": "jo47z3x",
          "author": "Slenso",
          "body": "My therapist and I were just talking about this last night. \nShe told me that I need to start breaking down the things I consider beautiful and really start supporting and creating new neuro pathaways of what I think it’s pretty or beautiful especially and specifically on myself. \nSo I need to make more effort exposing myself to new body types and considering them beautiful especially on myself. She mentioned how this will take a lot of time and a very long time. Just as long as it took the nuero pathways of what you think is pretty now on yourself. \nShe told me for now I should focus on other things that make me feel pretty that aren’t my body. \nI.e skin, hair and nails. \nI really struggle with not feeling beautiful without my unhealthy body. But I do feel a little pretty when I get my hair done, my nails done, or makeup. \nI went to the hair dresser and got tips on how to style my hair. I invested in a gel nail set up at home so I can do my nails often. And I recently bought some makeup that Iv always wanted to invent so use getting ready and feeling pretty. \nI know some of the things I mentioned to try are a little material and not accessible for everyone to do to feel better but I hope you can at least find a new perspective on the feeling and maybe a little inspiration and know your not alone at least <3 all the luck to you !",
          "created_utc": 1686758745.0
        },
        {
          "id": "jo48gfn",
          "author": "VeterinarianOk2107",
          "body": "thank u so much for the advice! i think that might be why i love getting my nails done and getting lash extensions cause they both do help me in feeling pretty. ur therapist sounds really nice. wishing u the best too🙏🏼😭",
          "created_utc": 1686758950.0
        }
      ]
    },
    {
      "id": "jo7sq44",
      "author": "Therandomderpdude",
      "body": "Good luck :) !\n\nEdit: recovery is 100% worth it, and the most loving thing I’ve done for my body and mind. Neither my body or your body deserves to be punished like this, we all deserve love, patience, understanding and nourishment.",
      "created_utc": 1686830227.0,
      "score": 2,
      "context": [
        {
          "id": "jo7k4qx",
          "author": "Therandomderpdude",
          "body": "Take a break from social media. Avoid mirror checks and scales. \n\nTake some time alone with your hobbies. Listen to music. Do some self care. \n\nTry journaling and writing or drawing how you feel, write down all your frustrations. This is a great way to ease some stress/anxiety/racing thoughts. \n\nSometimes by stressing about the unwanted thoughts, you make them have more power over you. That is why it’s important to acknowledge them instead of feeling ashamed and guilty and trying to push them away. \n\nI’ve been recovered from anorexia for 6 years and I know the feelings and urges can feel scary. \n\nTry to acknowledge your inner values as well. Tell yourself 3 things you feel grateful for. \n\nTell yourself 3 things your body does that you feel grateful for like, your nose allowing you to smell the flowers/ocean. Your ear’s allowing you to enjoy your favorite music. Your body allowing you to visit your favorite places. \n\nAlso remember that You have value as a human, and you are more than your body. Try to Ignore the “summer body” trends.\n\nIt’s not a quick fix, but eventually you will change your mindset and focus on things that truly matters and make you happy.",
          "created_utc": 1686824183.0
        },
        {
          "id": "jo7kqc2",
          "author": "VeterinarianOk2107",
          "body": "the mirror checks and scales have been my daily habit which is so unhealthy so ill try and not do that anymore. and i love drawing so i might focus on that instead! im so glad that you’ve recovered 🫶🏻 thank you so much for the advice and ill try to take them to heart and follow them😭",
          "created_utc": 1686824659.0
        }
      ]
    },
    {
      "id": "jo4zrsg",
      "author": "savannahruns",
      "body": "We all do!  It sounds counterintuitive, but I had way more bad days when I was refusing to accept that I might never feel as pretty again.  Once I decided to just be like \"Actually, that might be true.  I may never feel as pretty as I did then,\" I was able to treat it just like the other things in my life that I don't like but can't change.",
      "created_utc": 1686770310.0,
      "score": 2,
      "context": [
        {
          "id": "jo3q1rx",
          "author": "savannahruns",
          "body": "Honestly part of my recovery has been accepting that my \"prettiest\" weights just aren't natural for me, and I have to move on.  It doesn't mean I don't still try to look nice, but I'm not setting the goal of looking as pretty as I did then or letting myself get stuck on it because then I just throw in the towel or am bitter and there's nothing as un-pretty as people like that.",
          "created_utc": 1686750822.0
        },
        {
          "id": "jo485vk",
          "author": "VeterinarianOk2107",
          "body": "me too! i used to constantly starve to try and keep my weight which ofcourse isnt healthy😭😭 im trying not to go back to that phase in life but i have my bad days",
          "created_utc": 1686758826.0
        }
      ]
    },
    {
      "id": "jo1y4z4",
      "author": "VeterinarianOk2107",
      "body": "yes that’s exactly what im saying! i feel like its a constant and unstable cycle 😭",
      "created_utc": 1686705087.0,
      "score": 2,
      "context": [
        {
          "id": "jo1wuqf",
          "author": "boomboomcoconut",
          "body": "I grew up in a family that skinny=pretty. Honestly, it takes a lot of working on yourself through therapy. Something that's really helped me is getting a new hobby or working on something that you enjoy. That way, you can have a sense of accomplishment. \n\nThe itch may never leave you but it's good that you recognize it! Baby steps my friend",
          "created_utc": 1686704349.0
        },
        {
          "id": "jo1xc0z",
          "author": "VeterinarianOk2107",
          "body": "my family also often shamed me for being chubby😭 and my mom still comments on how much i eat from time to time. i hope i can get therapy when im older! also i’ll definitely try and work on that suggestion of picking up a hobby. thank you😭🫶🏻",
          "created_utc": 1686704629.0
        },
        {
          "id": "jo1xwux",
          "author": "boomboomcoconut",
          "body": "It's so hard because you feel that way, then your family reinforces those opinions, then you have your friends talking about being skinny. It's hard to break through that cycle :/",
          "created_utc": 1686704958.0
        }
      ]
    },
    {
      "id": "jo1yu68",
      "author": "boomboomcoconut",
      "body": "Try to get a friend who doesn't care about those things :)",
      "created_utc": 1686705493.0,
      "score": 1,
      "context": [
        {
          "id": "jo1wuqf",
          "author": "boomboomcoconut",
          "body": "I grew up in a family that skinny=pretty. Honestly, it takes a lot of working on yourself through therapy. Something that's really helped me is getting a new hobby or working on something that you enjoy. That way, you can have a sense of accomplishment. \n\nThe itch may never leave you but it's good that you recognize it! Baby steps my friend",
          "created_utc": 1686704349.0
        },
        {
          "id": "jo1xc0z",
          "author": "VeterinarianOk2107",
          "body": "my family also often shamed me for being chubby😭 and my mom still comments on how much i eat from time to time. i hope i can get therapy when im older! also i’ll definitely try and work on that suggestion of picking up a hobby. thank you😭🫶🏻",
          "created_utc": 1686704629.0
        },
        {
          "id": "jo1xwux",
          "author": "boomboomcoconut",
          "body": "It's so hard because you feel that way, then your family reinforces those opinions, then you have your friends talking about being skinny. It's hard to break through that cycle :/",
          "created_utc": 1686704958.0
        },
        {
          "id": "jo1y4z4",
          "author": "VeterinarianOk2107",
          "body": "yes that’s exactly what im saying! i feel like its a constant and unstable cycle 😭",
          "created_utc": 1686705087.0
        }
      ]
    }
  ]
}