{
  "id": "14ppz4r",
  "subreddit": "EatingDisorders",
  "author": "heximintii",
  "created_utc": 1688406893.0,
  "title": "Tiktok is not safe for us",
  "selftext": "Quick tw. Also I think this is allowed but if it isn't I urge the mods to keep this up as I feel it is important info for people who are out there recovering right now. \n\nJust wanted to say to everyone on here who uses tiktok, please be careful. Unfortunately with the nature of the app itself it can be incredibly easy for you to stumble across something you shouldn't have to see. \n\nI kept getting lives from a girl who I won't name but I'm sure many of you know who I'm talking about. That was the first instance for me. I blocked her account and so far haven't seen anything. \n\nThen i find a video with thousands of likes on my fyp that is a meme of said girl and so many people in the comments are bragging about their disorder, and actively encouraging others to do the same. \n\nIt's just frustrating because it seems the more I act disinterested in this kind of content the more the algorithm wants to shove it in my face. \n\nAm I the only one who's been seeing this kind of content lately? Why is it that there are people out there who just seem to want to make it harder for us?\n\nAgain, please be careful if you use tiktok. Be safe out there and I hope you all are having a good day",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/14ppz4r/tiktok_is_not_safe_for_us/",
  "score": 47,
  "num_comments": 13,
  "comments": [
    {
      "id": "jqjc930",
      "author": "Santana_delRey",
      "body": "In general, it contains so much food and calorie related content. It really helped me to get bad in the first place a few years back",
      "created_utc": 1688409167.0,
      "score": 15,
      "context": []
    },
    {
      "id": "jqk3dt0",
      "author": "rileyyj001",
      "body": "TikToxxxic",
      "created_utc": 1688420366.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jqkeioc",
      "author": "songfireleaf",
      "body": "highkey i've had to spend a lot of time hitting \"disinterested\" on various related videos because they kept popping up on my fyp. consciously i know it's because i tend to watch them when they do pop up, since i have an awful habit of engaging with media that harms me instead of disengaging if it could cause issues (working on that though, and in the meantime avoiding media that could cause problems). best of luck.",
      "created_utc": 1688425415.0,
      "score": 8,
      "context": []
    },
    {
      "id": "jqkrbce",
      "author": "fortunatevoice",
      "body": "I’m really lucky that all I get are cat videos and gay shit. I’m so sorry that you have to see that stuff",
      "created_utc": 1688431631.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jql5fnh",
      "author": "pixiefancy",
      "body": "Yeah, I had to get off TikTok because the content got way too triggering. I avoid it as much as I can now; I’ve come too far in my recovery at this point. I’ve marked things as disinterested but things still seep through",
      "created_utc": 1688438975.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jqlnwhl",
      "author": "Entire-Somewhere-198",
      "body": "Fr i only use TikTok when I’m really depressed and go to trigger myself and cry. If you want the same type of dopamine releasing content use YouTube shorts (ik people think it’s cringe but it’s way better than TikTok)",
      "created_utc": 1688450317.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jqk65rs",
      "author": "funkydyke",
      "body": "I don’t get that kind of stuff but I get sooooo many lives of people talking about ozempic and mounjaro (who are saying things about the drugs that aren’t true)",
      "created_utc": 1688421566.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jqlsnbx",
      "author": "NeedyPudding",
      "body": "I was on TikTok for exactly 24 hours before I deleted the app and never looked back. This was the exact reason why.",
      "created_utc": 1688453822.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jqm8usb",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1688467133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jqq87o5",
      "author": "aceyos",
      "body": "yea, tiktok is actually real shit.. a year ago there was a trend abt calories, there's where i started to know what they were and 2 months after i developed an ed thanks to the incitement of pro anorexia videos",
      "created_utc": 1688539778.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jr4jpyg",
      "author": "therealmvpete",
      "body": "i feel the same way, both in videos/comment sections and in trends that are focused on body image which can be so harmful for so many people. it’s so frustrating trying to recover and then seeing content that sets me back",
      "created_utc": 1688799484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jqlnx2x",
      "author": "Entire-Somewhere-198",
      "body": "Me too",
      "created_utc": 1688450329.0,
      "score": 1,
      "context": [
        {
          "id": "jqkeioc",
          "author": "songfireleaf",
          "body": "highkey i've had to spend a lot of time hitting \"disinterested\" on various related videos because they kept popping up on my fyp. consciously i know it's because i tend to watch them when they do pop up, since i have an awful habit of engaging with media that harms me instead of disengaging if it could cause issues (working on that though, and in the meantime avoiding media that could cause problems). best of luck.",
          "created_utc": 1688425415.0
        }
      ]
    },
    {
      "id": "jqme8kr",
      "author": "EatingDisorders-ModTeam",
      "body": "No person blogs, social media or product/service advertisements",
      "created_utc": 1688470982.0,
      "score": 2,
      "context": [
        {
          "id": "jqm8usb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1688467133.0
        }
      ]
    }
  ]
}