{
  "id": "15727nv",
  "subreddit": "EatingDisorders",
  "author": "cestcommecaa",
  "created_utc": 1690078241.0,
  "title": "I got my period back",
  "selftext": "Today, I got my period back after a really long time of not having a period. I’m happy. I am. All of my effort has paid off and I let my body remember what it feels like to trust me again. I’m no longer fearing for my physical health. I no longer fear that I ruined the future that I have worked so hard to earn. Nevertheless, I can’t help but think of this feeling that I don’t know what to do next. This entire year, everything I have done has been completed with a goal in mind. Anytime that things have gotten hard, I’ve had this crutch to rely on because I knew that it would be worth it when I reached it. I thought that when that goal was reached, that would mark the end of all of this. I thought I would go back to how I used to be as soon as I crossed that metaphorical finish line. Now I’m sitting here, and I certainly don’t feel finished. I don’t feel recovered. Now, that crutch is gone. I have to do this on my own now.\n\nRegardless, I feel blessed that my body trusts me again. Nothing about being at the peak of my disorder felt good. I'm proud of how far I have come. :) (Btw: Even if you didn't lose your period ever, you are still valid.)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/15727nv/i_got_my_period_back/",
  "score": 75,
  "num_comments": 8,
  "comments": [
    {
      "id": "jt39gy9",
      "author": "Sensitive_Ad_920",
      "body": "i am SOOOO proud of you!!!❤️❤️ recovering is a long and difficult journey, but you’ve come so far. you should really give yourself a bunch of credit. when i got my period back i remember being so so relieved. reading something like this just makes me so happy for you. well done love!",
      "created_utc": 1690092325.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jt3fpf1",
      "author": "EchoConsistent3858",
      "body": "What do you mean by fearing for future of physical health?",
      "created_utc": 1690097082.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jt3xmr3",
      "author": "GoHighly",
      "body": "Congratulations on reaching this goal! Take all the credit in the world and celebrate your win! I think as we’re on this journey we have this idea of being “normal” or how we used to be again. I know I thought for me when I finally hit a healthy weight and was no longer clinically underweight, that would be it for me. What I’m discovering is that my recovery from ED goes much deeper than the disordered eating. There’s a lot of psychological things behind it and a ton of trauma. Working through all of that, and consistently eating differently, while rewiring my brain to think differently is a lot! I hope I get to a place one day where I feel recovered, but right now I’m just happy to say I’m in recovery. Best of luck OP!",
      "created_utc": 1690111329.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jv6ilrt",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1691427099.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jtb4cpg",
      "author": "still-rising",
      "body": "I am SO proud of you—congratulations!!! This is a massive testament to all of the (very, very) hard work that you’ve doubtlessly put into recovery, and you deserve to celebrate!!!\nI totally relate to that feeling of “where do I go next?” Having a concrete goal is so helpful, but it can also leave you feeling a little underwhelmed when you finally make it. Maybe try working with your team/support people to identify a next step to strive for in your recovery? Getting your period back is a major win, but—like you said—you’ve still got tons of room to grow :)\n\nAlso remember that, just because your period is back, that doesn’t mean that you get to stop nourishing your body. Your body is healing, but it’s still in a delicate place, and it’s very possible to lose your period again if you stop taking care of yourself. From what I’ve heard, maintaining your “big wins” comes with its own set of challenges (which I’m sure you will absolutely CRUSH just like you did this one). Take a minute to celebrate your win, and then pick the next goal to conquer :)",
      "created_utc": 1690237287.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jtdluv0",
      "author": "lunavrses",
      "body": "SOO PROUD OF YOU!! getting your period is an indicator that youre getting your life back -- think about all the things you can do ! hobbies and fun time with friends, try to brainstorm your future goals and dreams you want to accomplish to help because that will help you create a new goal to work towards thats not ed related",
      "created_utc": 1690289140.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jtefm14",
      "author": "Princess_ApplePie",
      "body": "Congratulations! 🩸🥳❤️ Very happy for you, so very proud of you. Recovery is hard and healing is a freaking roller coaster. \n\nYou’re in a weird point now, it’s ok. You’re allowed to enjoy your accomplishment. For what’s next, maybe you need a new goal? Something else that would be healthy and happy but also attainable and measurable. It could still be related to physical health if you still need it as a crutch to not fall back on unhealthy habits, but it could also be unrelated, just something to work towards to keep your mind busy and your life full. Maybe hobby related?\n\nI hope you soon get to feel the full extend of your accomplishment, without the feeling of uncertainty you have right now. What you managed is big, special and inspiring. All the love ❤️",
      "created_utc": 1690301432.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jt4lng2",
      "author": "cestcommecaa",
      "body": "Things like infertility, bone health, etc",
      "created_utc": 1690123953.0,
      "score": 3,
      "context": [
        {
          "id": "jt3fpf1",
          "author": "EchoConsistent3858",
          "body": "What do you mean by fearing for future of physical health?",
          "created_utc": 1690097082.0
        }
      ]
    },
    {
      "id": "jv76ode",
      "author": "cestcommecaa",
      "body": "Hello! I started recovering by eating more (but still exercising) in the beginning of February, but I completely cut out exercise on March 13. I got my period back on July 22 😊. I don’t consider myself fully mentally or physically recovered yet because I do still struggle mentally and I am still suffering a few consequences physically, but we’re getting there! Of course, every body is different so my experience is not parallel to anyone else’s experience :) Good luck in your recovery! <3",
      "created_utc": 1691436084.0,
      "score": 2,
      "context": [
        {
          "id": "jv6ilrt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1691427099.0
        }
      ]
    }
  ]
}