{
  "id": "15c0r5x",
  "subreddit": "EatingDisorders",
  "author": "lilcottonsocks226",
  "created_utc": 1690558455.0,
  "title": "I am tired of letting guests at my job say whatever about my body size. Looking for advice on how to remain professional but tell people to back off.",
  "selftext": "I (24F) work as a server at a restaurant and last night I had a 2 top. The one woman looked at me and said “you’re so cute, so tiny.” I was like dang, had to add tiny. They went on and on about it and she was like “I was gonna say I used to be like you, but I wasn’t. Don’t have kids!” While laughing. As always, I didn’t know what to say so I just smiled told them I get it from my mother. She had six kids and swims every day. The other woman chimed in, “I would drown if I was your size and went swimming.” They’re both laughing together. I was shaking and almost crying when I left the table so I had to go outside to take a minute. \nI get comments about how “skinny” I am almost regularly, and these comments struck me a little harder than most. I am fed up with smiling and acting like there’s no problem. I don’t think people should be so comfortable making comments and jokes about anyone’s body size. \nI just don’t know how to say something when I’m at work and want to remain professional. Any advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/15c0r5x/i_am_tired_of_letting_guests_at_my_job_say/",
  "score": 186,
  "num_comments": 43,
  "comments": [
    {
      "id": "jtu6kd9",
      "author": "blutlm",
      "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
      "created_utc": 1690568930.0,
      "score": 215,
      "context": []
    },
    {
      "id": "jttic5x",
      "author": "None",
      "body": "i used to serve, and i’m also an up-front kind of bitch. especially when serving. if it were me, i’d have shut it down. i know you live on your tips. even when you know you might lose out on money from one table, it feels good to stand up for yourself. i’d have said something shocking like “you don’t want to know what i had to do to look like this” (would likely shut them up) or just super bluntly tell them i’m here to serve you food, not for you to comment on my appearance.",
      "created_utc": 1690559992.0,
      "score": 51,
      "context": []
    },
    {
      "id": "jttlusy",
      "author": "guesswhomadewafflez",
      "body": "\"Comments about my body are inappropriate, I can't discuss that at work. Is there something (work related) I can help you with?\" is what I was taught by HR. If a man said this kind of thing, it would count as sexual harassment, it's just as harmful coming from women. Don't be afraid to stand up for yourself.",
      "created_utc": 1690561277.0,
      "score": 51,
      "context": []
    },
    {
      "id": "jtti89f",
      "author": "scrambled-satellite",
      "body": "Idk how comfortable you are with speaking up but a simple “Excuse me, please don’t make comments about my body” should suffice. It’s professional and gets the point across. If they continue, you can involve a manager who can ask them to leave if they continue to harass you. You deserve respect in the workplace.",
      "created_utc": 1690559953.0,
      "score": 28,
      "context": []
    },
    {
      "id": "jtw4ehu",
      "author": "celeste-nova",
      "body": "Don’t laugh, even uncomfortably, because you’re excusing/enabling the behavior and they’re going to do it to someone else. What I started doing (back when I worked in customer service) is I just stare at them for 3-5 seconds and *don’t say anything*. Their brain will process it as rejection and they’ll likely apologize. \n\nAn example (from my coworker): Coworker called a patient to the exam room and asked how he was doing. He said “oh, fine, but I think talking to you will make my wife jealous.” She didn’t acknowledge the comment, kept walking, and before they even reached the exam room, he sheepishly said “I apologize, I realize that wasn’t appropriate.”",
      "created_utc": 1690598128.0,
      "score": 26,
      "context": []
    },
    {
      "id": "jtuz720",
      "author": "Lttlsloths",
      "body": "I would tell them, “I understand that you mean no harm, however, comments like that do not make me feel so good about myself.”",
      "created_utc": 1690579800.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jttpxod",
      "author": "PJDoubleKiss",
      "body": "I know exactly how you feel. This is what I have learned in my experiences. \n\nThey didn’t think before they spoke because their comments are about soothing their own fucked up thoughts- they’re not really about you at all. They’re not thinking about you, they’re thinking about how they feel about their own body. They probably forgot about you in under an hour. Careless bombs of words dropped with no remorse. \n\nRemember these affirmations when you are preparing for work. These people are obsessed with their own insecurities and that’s why they cannot be polite and keep comments to themselves. \n\nI wouldn’t even ask politely “please do not make comments about my body” because, in my experience, it fuels the eyes to stare harder. People don’t play fair, and being the bigger person doesn’t always serve you when there is a power imbalance, be it a real imbalance or imagined by the customer with a shit ego. \n\nI can’t really tell you how to make people stop and I don’t think we’ll see people learn the lesson for hundreds of years. I had to accept that I could not control how other people reacted to my illness- but I could control how much energy I gave to their behavior. \n\nDON’T smile. DON’T give polite banter. Give a flat, uninterested affect to any uncivilized loser with an obsession over bodies. They aren’t entitled to your energy when they’re playing with their own fucked up insecurities- they’re only entitled to decent customer service. \n\nThe smile can come back when we go back to the real topic at hand- what the fuck soft drink do you want ma’m? \n\nSo sorry about their rudeness. Good luck.",
      "created_utc": 1690562783.0,
      "score": 10,
      "context": []
    },
    {
      "id": "jtwht9x",
      "author": "One-Unit-1775",
      "body": "I’m not super skinny but I am small. People always comment on my size and call me so cute and small. I hate it because I feel like it undermines my professional appearance and role in management. Especially if I’m in charge of people I feel like I’m not taken seriously. \nI don’t have advice tbh. I’m struggling with it.",
      "created_utc": 1690605273.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jtvwm9s",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1690594358.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jtx4vgq",
      "author": "None",
      "body": "Had a woman grab my arm as I was carrying their drinks and go 'see, how would you believe she could carry those drinks? Thats amazing'. Like people think it's appropriate to treat servers like shit, why do people think it's OK to grab someone?",
      "created_utc": 1690621991.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jtx6g3m",
      "author": "chadhelton",
      "body": "Just say:  \"Oh thank you it's from moving around the restaurant! I havent had the chance to sit down and eat our (__special of the day__), which is delicious!\"\" \nUp sell them x-large portions or desserts!\nFlip it back on them and just play it off. \nPeople are just a$$h0les especially in the food industry. Smile & make them tips 💚 Good Luck",
      "created_utc": 1690623309.0,
      "score": 3,
      "context": []
    },
    {
      "id": "juni3vr",
      "author": "Initial-Succotash-37",
      "body": "This is just like getting bullied for being overweight. I am on the larger side of things and people can be so nasty \n\nSorry you are going through this.",
      "created_utc": 1691086678.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jtwxmjx",
      "author": "houston_veronica",
      "body": "This entire scenario is all too familiar and easy to picture. I can see it now. I am so sorry, OP. LOTS of people are \"tiny\" because of reasons we could not possibly list in their entirety. As much as you/we all believe people can see our ED, the truth is, they have no idea. Any one of us could have cancer, a hyper-thyroid issue or dozens of other medical maladies. Still: It's up to us to set appropriate boundaries, since we cannot control what others say.  \n\nI agree with just about all the advice in this thread; you owe NO explanations, but people like these will be taken aback when you choose to abandon any shame, because there is NONE to be had. Anything from \"Your comment strikes me as incredibly personal; may I take your order for the meal now?\"  to \"Thanks. I have an illness.\"...or even *blank stare* \n\nWhatever you do, we are with you in spirit. This goes for all of us here.  Never be ashamed, because shame is where our sicknesses fester. (Bonus: these situations have taught me to watch myself and never judge others-- and to try and derail conversations if I hear people asking or commenting on things like bodies/food, etc)",
      "created_utc": 1690616133.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ju06491",
      "author": "Echoinurbedroom",
      "body": "Wow are u me???? I’m also a server and constantlyyyyy hear this. Depends on the context, sometimes I’ll laugh, sometimes I’ll retort with the fact I’m still young and that’s why I’m so small lol, and I’ve had to tell someone who questioned dessert due to their weight (and then told me I had nothing to worry about) that everyone deals with things in their own way. \nContext is everything. But ya know unless it’s a regular, u aren’t likely to see ppl again.",
      "created_utc": 1690671744.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ju3jqsb",
      "author": "chichighost",
      "body": "“how do you stay so skinny” “I have an eating disorder”",
      "created_utc": 1690739212.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jtvzbk1",
      "author": "Death2Coriander",
      "body": "‘I would drown if I was your size and went swimming’…yeah, well, fat floats.",
      "created_utc": 1690595648.0,
      "score": 0,
      "context": []
    },
    {
      "id": "jtx9cmj",
      "author": "dcalie6599",
      "body": "I do this out of honesty and not thinking about it. Like tiny things give me cuteness agression and I state why. And in the case someone like me does or someone at your job or anyone for any reason. Id recommend you say hey mam/sir/homie id appreciate it if you didn't say that. I know you may not have negative intentions but it has a negative impact on me for personal reasons that you don't have to explain. And if this is frequent or often no matter how many times you explain your self (2-3x max) then request your job move you somewhere that respects that because that is a very valid reason.",
      "created_utc": 1690625664.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jty92t5",
      "author": "kodaachrome",
      "body": "i worked in clothing retail for two years. also very small. people were making comments like that so often that i eventually ended up telling people \"oh really? i pooped 5 times today\". especially at 11am, people look at you crazy then leave you alone. they dont wanna hear about that stuff they just think they're complimenting you, so just hit em with the shock factor.",
      "created_utc": 1690643483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ju03tcp",
      "author": "Carrie_Mc",
      "body": "I don't think there's a \"nice\" way to do this, in terms of \"keeping the customer happy\". \n\nHowever, there's a girl I work with that's quite large and (I assume) is insecure about it because she constantly makes self-deprecating comments about being \"such a fat bitch\". These comments make me wildly uncomfortable as she tries to bring in my smaller size so I just completely block her out/ ignore her when she does this.\n\nI think this would be my way to handle your situation too, as the other people have nothing to bounce their opinions off and usually will stop people making further comments since you're not engaging with them.",
      "created_utc": 1690670687.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ju09tkd",
      "author": "clumsysav",
      "body": "I have the same problem. Usually a comment about their own appearance shuts them up. Not very professional though I suppose.\n\nMaybe talk to HR and let them handle it? Maybe they could send out an email to everyone regarding commenting on personal appearances with a guideline outlining what is and isn’t okay to comment on.\nThen if it continues, escalate to reporting specific people.\n\nGood luck 💚",
      "created_utc": 1690673415.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ju0aq4r",
      "author": "Daframo",
      "body": "I know it might be moraly wrong to lie even if it's only to be at peace, but I have the same underweight problem , although due to surgeries and the aftermath. Being male and weighing  48Kg (or 97 bananas) makes quite a few people, even so called \"friends\" try to convience me to \"eat more, exercise more\" or whatever, as I look \"like a corpse\".\n\nPeople that had personal confidence, knew what I was undergoing and kept the shitty attitude I cut off my life. For strangers that are rude but don't really know that this hurts, I usually pull the old \"Yeah I was in a 12 hour surgery that went wrong\" . People USUALLY don't ask any more questions.And if they do, they usually are much more careful.\n\nHowever in a work enviroment this might scare off customers , but something of that nature might make them bite their tongues before telling someone else.",
      "created_utc": 1690673834.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jurjqwa",
      "author": "None",
      "body": "So we all go through the same things huh? I highly doubt the women who say \"I used to be just like you\" were actually my size?",
      "created_utc": 1691159252.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jvdvkem",
      "author": "TheScariestSkeleton4",
      "body": "Honestly at some point here, and this applies to a lot of mental issues in my experience, you have to apply some kind of cognitive behavioral therapy and ask yourself what they really mean by that. I know “just don’t think about it like that” seems like terrible advice but there’s a lot of mental practice that can help you out just by trying to think a different way.",
      "created_utc": 1691545410.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jz0w2ir",
      "author": "Big-Yak670",
      "body": "holy fuck. If you had decked em and i was the judge at your hearing id find you innocent after listening to this. How can ppl think this behaviour is ok???",
      "created_utc": 1693786215.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jtvl7vz",
      "author": "lilcottonsocks226",
      "body": "shock factor, here for it 🥲",
      "created_utc": 1690589078.0,
      "score": 79,
      "context": [
        {
          "id": "jtu6kd9",
          "author": "blutlm",
          "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
          "created_utc": 1690568930.0
        }
      ]
    },
    {
      "id": "ju06njk",
      "author": "BabyLungs999",
      "body": "This always my go too and when they start w the  “omgg im so soryyyy”, I just walk away, you get more tips bc they realized they were being an asshole.",
      "created_utc": 1690671990.0,
      "score": 7,
      "context": [
        {
          "id": "jtu6kd9",
          "author": "blutlm",
          "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
          "created_utc": 1690568930.0
        }
      ]
    },
    {
      "id": "ju0e6t8",
      "author": "None",
      "body": "This is my go to",
      "created_utc": 1690675452.0,
      "score": 3,
      "context": [
        {
          "id": "jtu6kd9",
          "author": "blutlm",
          "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
          "created_utc": 1690568930.0
        }
      ]
    },
    {
      "id": "ju5y95n",
      "author": "Bluerunx",
      "body": "I had a friend in high school say this to a teacher about me. I was 16 and they commented on my weight loss and how good it looked. Like ma’am I was 14 when you saw me last and I’m now 16/17 I shouldn’t be getting smaller.",
      "created_utc": 1690779192.0,
      "score": 2,
      "context": [
        {
          "id": "jtu6kd9",
          "author": "blutlm",
          "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
          "created_utc": 1690568930.0
        }
      ]
    },
    {
      "id": "jttifpx",
      "author": "None",
      "body": "you can decide what you want to say and how you want to deliver it, but i’d suggest setting a boundary. do it a couple of times and it won’t feel so bad after a while.",
      "created_utc": 1690560028.0,
      "score": 17,
      "context": [
        {
          "id": "jttic5x",
          "author": "None",
          "body": "i used to serve, and i’m also an up-front kind of bitch. especially when serving. if it were me, i’d have shut it down. i know you live on your tips. even when you know you might lose out on money from one table, it feels good to stand up for yourself. i’d have said something shocking like “you don’t want to know what i had to do to look like this” (would likely shut them up) or just super bluntly tell them i’m here to serve you food, not for you to comment on my appearance.",
          "created_utc": 1690559992.0
        }
      ]
    },
    {
      "id": "jtwd16i",
      "author": "shootingstare",
      "body": "Yes! There is power in silence.",
      "created_utc": 1690602615.0,
      "score": 11,
      "context": [
        {
          "id": "jtw4ehu",
          "author": "celeste-nova",
          "body": "Don’t laugh, even uncomfortably, because you’re excusing/enabling the behavior and they’re going to do it to someone else. What I started doing (back when I worked in customer service) is I just stare at them for 3-5 seconds and *don’t say anything*. Their brain will process it as rejection and they’ll likely apologize. \n\nAn example (from my coworker): Coworker called a patient to the exam room and asked how he was doing. He said “oh, fine, but I think talking to you will make my wife jealous.” She didn’t acknowledge the comment, kept walking, and before they even reached the exam room, he sheepishly said “I apologize, I realize that wasn’t appropriate.”",
          "created_utc": 1690598128.0
        }
      ]
    },
    {
      "id": "jttrtw5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1690563472.0,
      "score": 19,
      "context": [
        {
          "id": "jttpxod",
          "author": "PJDoubleKiss",
          "body": "I know exactly how you feel. This is what I have learned in my experiences. \n\nThey didn’t think before they spoke because their comments are about soothing their own fucked up thoughts- they’re not really about you at all. They’re not thinking about you, they’re thinking about how they feel about their own body. They probably forgot about you in under an hour. Careless bombs of words dropped with no remorse. \n\nRemember these affirmations when you are preparing for work. These people are obsessed with their own insecurities and that’s why they cannot be polite and keep comments to themselves. \n\nI wouldn’t even ask politely “please do not make comments about my body” because, in my experience, it fuels the eyes to stare harder. People don’t play fair, and being the bigger person doesn’t always serve you when there is a power imbalance, be it a real imbalance or imagined by the customer with a shit ego. \n\nI can’t really tell you how to make people stop and I don’t think we’ll see people learn the lesson for hundreds of years. I had to accept that I could not control how other people reacted to my illness- but I could control how much energy I gave to their behavior. \n\nDON’T smile. DON’T give polite banter. Give a flat, uninterested affect to any uncivilized loser with an obsession over bodies. They aren’t entitled to your energy when they’re playing with their own fucked up insecurities- they’re only entitled to decent customer service. \n\nThe smile can come back when we go back to the real topic at hand- what the fuck soft drink do you want ma’m? \n\nSo sorry about their rudeness. Good luck.",
          "created_utc": 1690562783.0
        }
      ]
    },
    {
      "id": "jtvlfgk",
      "author": "lilcottonsocks226",
      "body": "thank you for sharing. and you’re right, their comments aren’t about me —i need to remember that",
      "created_utc": 1690589173.0,
      "score": 3,
      "context": [
        {
          "id": "jttpxod",
          "author": "PJDoubleKiss",
          "body": "I know exactly how you feel. This is what I have learned in my experiences. \n\nThey didn’t think before they spoke because their comments are about soothing their own fucked up thoughts- they’re not really about you at all. They’re not thinking about you, they’re thinking about how they feel about their own body. They probably forgot about you in under an hour. Careless bombs of words dropped with no remorse. \n\nRemember these affirmations when you are preparing for work. These people are obsessed with their own insecurities and that’s why they cannot be polite and keep comments to themselves. \n\nI wouldn’t even ask politely “please do not make comments about my body” because, in my experience, it fuels the eyes to stare harder. People don’t play fair, and being the bigger person doesn’t always serve you when there is a power imbalance, be it a real imbalance or imagined by the customer with a shit ego. \n\nI can’t really tell you how to make people stop and I don’t think we’ll see people learn the lesson for hundreds of years. I had to accept that I could not control how other people reacted to my illness- but I could control how much energy I gave to their behavior. \n\nDON’T smile. DON’T give polite banter. Give a flat, uninterested affect to any uncivilized loser with an obsession over bodies. They aren’t entitled to your energy when they’re playing with their own fucked up insecurities- they’re only entitled to decent customer service. \n\nThe smile can come back when we go back to the real topic at hand- what the fuck soft drink do you want ma’m? \n\nSo sorry about their rudeness. Good luck.",
          "created_utc": 1690562783.0
        }
      ]
    },
    {
      "id": "jtyju7w",
      "author": "lilcottonsocks226",
      "body": "yes i absolutely feel it undermines my position, which makes it really difficult to focus on my work. you, me, everyone, deserve to be treated with respect anywhere!!",
      "created_utc": 1690647787.0,
      "score": 1,
      "context": [
        {
          "id": "jtwht9x",
          "author": "One-Unit-1775",
          "body": "I’m not super skinny but I am small. People always comment on my size and call me so cute and small. I hate it because I feel like it undermines my professional appearance and role in management. Especially if I’m in charge of people I feel like I’m not taken seriously. \nI don’t have advice tbh. I’m struggling with it.",
          "created_utc": 1690605273.0
        }
      ]
    },
    {
      "id": "jtyjcl1",
      "author": "lilcottonsocks226",
      "body": "we all deserve to feel comfortable in our bodies. i am sorry you also deal with people who cannot behave. sending you love as well!",
      "created_utc": 1690647598.0,
      "score": 2,
      "context": [
        {
          "id": "jtvwm9s",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1690594358.0
        }
      ]
    },
    {
      "id": "jtyklbp",
      "author": "lilcottonsocks226",
      "body": "for real!! similar energy to when guests insist i don’t look old enough to work at my job. what goes on through their head i’ll never get 😭",
      "created_utc": 1690648078.0,
      "score": 1,
      "context": [
        {
          "id": "jtx4vgq",
          "author": "None",
          "body": "Had a woman grab my arm as I was carrying their drinks and go 'see, how would you believe she could carry those drinks? Thats amazing'. Like people think it's appropriate to treat servers like shit, why do people think it's OK to grab someone?",
          "created_utc": 1690621991.0
        }
      ]
    },
    {
      "id": "junuvlf",
      "author": "lilcottonsocks226",
      "body": "^ this is something so many people just do not seem to get. it’s the same on any side of the spectrum. this is why we should just take body size out of the conversation. everyone is valid regardless of how we look.",
      "created_utc": 1691091261.0,
      "score": 3,
      "context": [
        {
          "id": "juni3vr",
          "author": "Initial-Succotash-37",
          "body": "This is just like getting bullied for being overweight. I am on the larger side of things and people can be so nasty \n\nSorry you are going through this.",
          "created_utc": 1691086678.0
        }
      ]
    },
    {
      "id": "jtykbnx",
      "author": "lilcottonsocks226",
      "body": "this. exactly. no shame necessary, except for those who make inappropriate remarks on someone’s body. how embarrassing for them to lack basic decency!!",
      "created_utc": 1690647972.0,
      "score": 1,
      "context": [
        {
          "id": "jtwxmjx",
          "author": "houston_veronica",
          "body": "This entire scenario is all too familiar and easy to picture. I can see it now. I am so sorry, OP. LOTS of people are \"tiny\" because of reasons we could not possibly list in their entirety. As much as you/we all believe people can see our ED, the truth is, they have no idea. Any one of us could have cancer, a hyper-thyroid issue or dozens of other medical maladies. Still: It's up to us to set appropriate boundaries, since we cannot control what others say.  \n\nI agree with just about all the advice in this thread; you owe NO explanations, but people like these will be taken aback when you choose to abandon any shame, because there is NONE to be had. Anything from \"Your comment strikes me as incredibly personal; may I take your order for the meal now?\"  to \"Thanks. I have an illness.\"...or even *blank stare* \n\nWhatever you do, we are with you in spirit. This goes for all of us here.  Never be ashamed, because shame is where our sicknesses fester. (Bonus: these situations have taught me to watch myself and never judge others-- and to try and derail conversations if I hear people asking or commenting on things like bodies/food, etc)",
          "created_utc": 1690616133.0
        }
      ]
    },
    {
      "id": "jtw9tcc",
      "author": "MarieEtch",
      "body": "I had a manager that would say something similar, except she had lupus + fibromyalgia that caused her to lose weight and she had noooo problem telling people that made comments. Definitely free to use that line, too. We literally owe no one an explanation, but it might make them think before they open their mouth again.",
      "created_utc": 1690600889.0,
      "score": 37,
      "context": [
        {
          "id": "jtu6kd9",
          "author": "blutlm",
          "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
          "created_utc": 1690568930.0
        },
        {
          "id": "jtvl7vz",
          "author": "lilcottonsocks226",
          "body": "shock factor, here for it 🥲",
          "created_utc": 1690589078.0
        }
      ]
    },
    {
      "id": "jtwdmcz",
      "author": "updown27",
      "body": "Yep, I've used that. Haven't had to deal with these comments an a few years now thankfully but brutal honesty usually works. You may want to talk to your manager about how you can approach these situations so you don't end up being scolded for standing up for yourself.",
      "created_utc": 1690602925.0,
      "score": 8,
      "context": [
        {
          "id": "jtu6kd9",
          "author": "blutlm",
          "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
          "created_utc": 1690568930.0
        },
        {
          "id": "jtvl7vz",
          "author": "lilcottonsocks226",
          "body": "shock factor, here for it 🥲",
          "created_utc": 1690589078.0
        }
      ]
    },
    {
      "id": "jud536z",
      "author": "blutlm",
      "body": "I really like this line bc it forces them to think about how these types of compliments only fuel the disorder",
      "created_utc": 1690908974.0,
      "score": 2,
      "context": [
        {
          "id": "jtu6kd9",
          "author": "blutlm",
          "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
          "created_utc": 1690568930.0
        },
        {
          "id": "jtvl7vz",
          "author": "lilcottonsocks226",
          "body": "shock factor, here for it 🥲",
          "created_utc": 1690589078.0
        }
      ]
    },
    {
      "id": "jtvlb67",
      "author": "lilcottonsocks226",
      "body": "fair point. once i know what i want to say it’ll definitely be easier. thank you!!",
      "created_utc": 1690589120.0,
      "score": 13,
      "context": [
        {
          "id": "jttic5x",
          "author": "None",
          "body": "i used to serve, and i’m also an up-front kind of bitch. especially when serving. if it were me, i’d have shut it down. i know you live on your tips. even when you know you might lose out on money from one table, it feels good to stand up for yourself. i’d have said something shocking like “you don’t want to know what i had to do to look like this” (would likely shut them up) or just super bluntly tell them i’m here to serve you food, not for you to comment on my appearance.",
          "created_utc": 1690559992.0
        },
        {
          "id": "jttifpx",
          "author": "None",
          "body": "you can decide what you want to say and how you want to deliver it, but i’d suggest setting a boundary. do it a couple of times and it won’t feel so bad after a while.",
          "created_utc": 1690560028.0
        }
      ]
    },
    {
      "id": "jttsew7",
      "author": "PJDoubleKiss",
      "body": "I love the deadpan “oh” so much that when I see other people use it I have to conceal my satisfied laughter",
      "created_utc": 1690563688.0,
      "score": 15,
      "context": [
        {
          "id": "jttpxod",
          "author": "PJDoubleKiss",
          "body": "I know exactly how you feel. This is what I have learned in my experiences. \n\nThey didn’t think before they spoke because their comments are about soothing their own fucked up thoughts- they’re not really about you at all. They’re not thinking about you, they’re thinking about how they feel about their own body. They probably forgot about you in under an hour. Careless bombs of words dropped with no remorse. \n\nRemember these affirmations when you are preparing for work. These people are obsessed with their own insecurities and that’s why they cannot be polite and keep comments to themselves. \n\nI wouldn’t even ask politely “please do not make comments about my body” because, in my experience, it fuels the eyes to stare harder. People don’t play fair, and being the bigger person doesn’t always serve you when there is a power imbalance, be it a real imbalance or imagined by the customer with a shit ego. \n\nI can’t really tell you how to make people stop and I don’t think we’ll see people learn the lesson for hundreds of years. I had to accept that I could not control how other people reacted to my illness- but I could control how much energy I gave to their behavior. \n\nDON’T smile. DON’T give polite banter. Give a flat, uninterested affect to any uncivilized loser with an obsession over bodies. They aren’t entitled to your energy when they’re playing with their own fucked up insecurities- they’re only entitled to decent customer service. \n\nThe smile can come back when we go back to the real topic at hand- what the fuck soft drink do you want ma’m? \n\nSo sorry about their rudeness. Good luck.",
          "created_utc": 1690562783.0
        },
        {
          "id": "jttrtw5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1690563472.0
        }
      ]
    },
    {
      "id": "junwjgq",
      "author": "Initial-Succotash-37",
      "body": "I agree!!!",
      "created_utc": 1691091869.0,
      "score": 1,
      "context": [
        {
          "id": "juni3vr",
          "author": "Initial-Succotash-37",
          "body": "This is just like getting bullied for being overweight. I am on the larger side of things and people can be so nasty \n\nSorry you are going through this.",
          "created_utc": 1691086678.0
        },
        {
          "id": "junuvlf",
          "author": "lilcottonsocks226",
          "body": "^ this is something so many people just do not seem to get. it’s the same on any side of the spectrum. this is why we should just take body size out of the conversation. everyone is valid regardless of how we look.",
          "created_utc": 1691091261.0
        }
      ]
    },
    {
      "id": "jtx2vgf",
      "author": "Haoma-Health",
      "body": "It's straight-up, but it's also polite!",
      "created_utc": 1690620338.0,
      "score": 3,
      "context": [
        {
          "id": "jtu6kd9",
          "author": "blutlm",
          "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
          "created_utc": 1690568930.0
        },
        {
          "id": "jtvl7vz",
          "author": "lilcottonsocks226",
          "body": "shock factor, here for it 🥲",
          "created_utc": 1690589078.0
        },
        {
          "id": "jtw9tcc",
          "author": "MarieEtch",
          "body": "I had a manager that would say something similar, except she had lupus + fibromyalgia that caused her to lose weight and she had noooo problem telling people that made comments. Definitely free to use that line, too. We literally owe no one an explanation, but it might make them think before they open their mouth again.",
          "created_utc": 1690600889.0
        }
      ]
    },
    {
      "id": "juifpto",
      "author": "lilcottonsocks226",
      "body": "yes. and how we should be careful what we say to people because you never know someone’s struggles, past or present",
      "created_utc": 1690998843.0,
      "score": 1,
      "context": [
        {
          "id": "jtu6kd9",
          "author": "blutlm",
          "body": "\"You're so cute and tiny!\"\n\"Thanks. I have an eating disorder\"",
          "created_utc": 1690568930.0
        },
        {
          "id": "jtvl7vz",
          "author": "lilcottonsocks226",
          "body": "shock factor, here for it 🥲",
          "created_utc": 1690589078.0
        },
        {
          "id": "jud536z",
          "author": "blutlm",
          "body": "I really like this line bc it forces them to think about how these types of compliments only fuel the disorder",
          "created_utc": 1690908974.0
        }
      ]
    }
  ]
}