{
  "id": "15j2m1t",
  "subreddit": "EatingDisorders",
  "author": "Glutenfree_Forever",
  "created_utc": 1691259363.0,
  "title": "How to accept that your body is changing?",
  "selftext": "So you guys how do you accept the fact that in recovery your body IS changing? Whats the best method to cope with it? \nLately I feel really really down about seeing my body changes during ana recovery (plus the weight gain of course) \nAny advice how to accept the fact that my body is getting bigger?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/15j2m1t/how_to_accept_that_your_body_is_changing/",
  "score": 51,
  "num_comments": 24,
  "comments": [
    {
      "id": "juy2vj5",
      "author": "CommonExact9702",
      "body": "My suggestion would be to stay off the internet and go places where real people exist.  Swimming pools, beaches, resorts…people of all body shapes and sizes going about life normally….laughing and living life.",
      "created_utc": 1691268775.0,
      "score": 68,
      "context": []
    },
    {
      "id": "juy9pv7",
      "author": "icantsthwim",
      "body": "i’ve gained 15-20 pounds in recovery and everyone is telling me i look healthy, and commenting on my weight. it’s been really triggering lately, but other than besides stepping on the scale i thought my body looked good. i think it’s mostly just the having to buy a new wardrobe (jeans) and the scale. keep the eating habits or exercise the same daily and it should be a mental thing that recovery is good and healthy as long as everything is moderate.",
      "created_utc": 1691271626.0,
      "score": 20,
      "context": []
    },
    {
      "id": "juyj2mx",
      "author": "itssammmm",
      "body": "i haven’t weighed myself in years and i think this has really helped me personally. when i used to weigh myself, i would base my life on that number. everytime i would eat a meal, drink something, eat a snack, even drive by a restaurant, go shopping and try on clothes in a store, that number would pop in my head and it would be all i could think about. i have absolutely no idea how much i weigh now, and that has helped me live a more peaceful life. i do see changes in my body, but i’ve learned that i have to accept that, as time goes by, my social life, my friends/family, my jobs, my style, my music taste, and esp my body/weight, will all change and it’s the natural way of life.",
      "created_utc": 1691275723.0,
      "score": 15,
      "context": []
    },
    {
      "id": "juyjaj8",
      "author": "lkingthegr8",
      "body": "I find it hard but I just look to my future, old self. I dont want a body that is worn down and weakened by having a low weight my whole life. I dont want to be bigger, but I also want to live a life where I can physically do things when I'm in my 30s, 40s, 50s up to the 80s without being held by back by my 20 year old insecurities. \n\nNo one cares about how others look. at most, people might see and think a flying thought about someone's body and never think about them again. Bodies are meant to consume food and energy. imagine a little monkey purposely restricting what it eats, or eating and throwing it up alone. it's sad, and it's not natural. they eat to have energy and a body to allow them to climb and swing on branches. we are little monkeys. just eat to feel physically well, to do the things you want to do. you dont wanna age prematurely, with illnesses in your late 20s caused by being an unattainable weight. my sister developed osteoporosis at age 22 because of restriction. you don't wanna be that person with no energy when you're young.\n\na skinny body is not normal and does not make you feel good in the long run. you'll just be hindered as you get older and regret it all.",
      "created_utc": 1691275813.0,
      "score": 10,
      "context": []
    },
    {
      "id": "juywxpm",
      "author": "None",
      "body": "What worked for me was complete avoidance. No scales, no mirror, no pictues. I was not happy with any of those for a long time. After about 6 months of that I reached an acceptance point. Idk if thats really healthy, but it worked for me.",
      "created_utc": 1691281988.0,
      "score": 9,
      "context": []
    },
    {
      "id": "juyu6sf",
      "author": "velogirl",
      "body": "I’ve gained 35 pounds so far and the only thing that has helped is lifting heavy weights and following body positive/fat positive IGs. Also stay tf off the scale.",
      "created_utc": 1691280695.0,
      "score": 7,
      "context": []
    },
    {
      "id": "juzca1o",
      "author": "drowningdoll",
      "body": "In early recovery I set firm boundaries with family/friends about ensuring zero comments on food/weight even my outfits (good or bad). Personally, I limited mirror time for a few months. Also take all your old clothes, put them in a box that’s hard to get to. You can donate them but that took me a year. Avoidance isn’t healthy long term, but in the beginning it is about preventing relapse. I focused entirely on the life benefits. I could paint again, go to school, had dreams and thoughts about more than food. After a while I exposed myself to feeling the discomfort of my body in mirrors, I figured out my pants size. But in the beginning it’s knowing it is uncomfortable and at times just plain awful. But it’ll pass in time.",
      "created_utc": 1691289356.0,
      "score": 5,
      "context": []
    },
    {
      "id": "juziuhp",
      "author": "silllybands",
      "body": "I just tell myself everyday how hot I look and that everyone wants me",
      "created_utc": 1691292681.0,
      "score": 5,
      "context": []
    },
    {
      "id": "juyx7po",
      "author": "korinna81",
      "body": "I am stessed about comments: Huh! You gained weight! - i am training to answer: Yes! Thankfully I did!",
      "created_utc": 1691282119.0,
      "score": 4,
      "context": []
    },
    {
      "id": "juz0z2d",
      "author": "Such-Cattle-4946",
      "body": "I try focusing on what my body can do, and the increased energy I have, instead of what it looks like. I also try to.thank my body every night for what it did for me that day. (my legs for walking where I needed to go, my arms for carrying my books, my eyes for guiding my steps, etc.) my therapist recommended it. It sounds lame, but when I do it, I do feel better because it reminds me my body is more than just what it looks like.\n\nI also agree that getting off the internet and outside into the real world is helpful.",
      "created_utc": 1691283890.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jv23nor",
      "author": "Medstudentgirl2002",
      "body": "I gained 20-25 pounds, I experienced accepting my body kind of like a grieving process. First denial, not wanting to see change, missing my ‘old’ body, but eventually I learned to embrace my new curves. It takes time, and being in therapy also helps",
      "created_utc": 1691345396.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jv4l0jv",
      "author": "Fr0gg033",
      "body": "- Limiting internet use, particularly those that are triggering. And limiting in the night when your more susceptible to it.\n- Limiting contact with anyone irl who is triggering. You don’t need them.\n- Staying off the scale.\n- Making real life enjoyable so weight isn’t the only thing that you think or value yourself by.\n- Probably muscle building. At least you’ll feel stronger.",
      "created_utc": 1691387980.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jv54xce",
      "author": "None",
      "body": "I can’t stress enough the importance of getting off instagram twitter and facebook. \n\nAnd not watching tv shows or movies with unrealistically beautiful/thin/fit actors. People sometimes think it’s weird when I avoid tv shows, but F them. \nI just say “I wouldn’t enjoy watching this,” and try to leave it at that, or “oh I’ve seen this already.” \n\nAs for social media: Instagram is the worst because everyone has access to photo editing apps. One big dysmorphia-dysphoria echo chamber.",
      "created_utc": 1691403829.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jvi363n",
      "author": "mommacoty1",
      "body": "I fill my mirror with body acceptance & ED recovery quotes, so I can look at those instead of fixating on my appearance.  Buying clothes that feel comfortable fitting my current size makes the start of the day easier, and greatly lessens the chance of spiraling with NGL thoughts.  I pay attention to other people and how they are living their lives in whatever size they are.  I hang out with the people in my life who love me regardless of my size, and remind myself that nobody cares what my number on the scale is.",
      "created_utc": 1691618141.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jvivxr5",
      "author": "Lopsided_Wrangler_55",
      "body": "My recommendation to you is to stay in the day. Ultimately that is all that matters- how can you reinforce a positive relationship with yourself today in the present moment? -- instead of focusing on this looming need to gain weight-  or the fear about where you will end up. I was always scared I would gain too much. I never did.  In reality your body won't change THAT much week to week even if you are putting on a pound a week or something. But it will FEEL like it is changing a lot - because you are aware of being on this weight gain mission. It also will plateau when you reach your set point weight- aka where you really should be. Once I felt good there, I started weight lifting - feeling really strong and fit and developed a new relationship with myself. It is all possible it just happens in steps and you can not skip ahead all at once. I know how uncomfortable it can feel, trust me. You are not alone but this is temporary.\n\nI don't know what I weigh and for me, just taking that piece out of the equation felt really healthy- who cares, you know?  I know I weight more than when I was struggling with anorexia :) but I have to tell you- I am finally, after many years of being \"recovered\" but still struggling with body image--  understanding where my body is meant to be naturally and actually seeing it in a positive light. I fought it my whole life- so it is sometimes hard or weird to admit that there might even be things you like about how you look with some more weight on :) Flip the narrative - it is ok to reject what your mind is telling you. You have a habit of being self critical and when you start to imagine a new way of living- your ego mind is just going to try to tear you down because it wants to keep the habit- it is afraid of change.  So you actually have to start playing mind games with yourself - when you get silent and you hear a voice inside your head criticizing you- bullying you, speak back, and say no thank you. The more you shut it down and become aware of it- the more it the voice will diminish. It feels like there is safety in criticizing yourself but it's really just paralyzing and keeps you stuck in a loop.\n\nThe way to reinforce positive self talk is to do the things that give you real joy. It could be being with children, playing a sport, singing, Something that you can get yourself involved in. Get you into your body and out of your ruminating mind- remember that you are so much more than your outward appearance- and your experience on earth is not measured by your weight. It is about how much joy you have, how you impact those around you. The focus of the eating disorder puts you in a dark narrow hole- blocks your creativity or ability to thrive. It keeps you literally small. There is so much more that you can do and be in the world :) Recovery and gaining weight is just your bridge- and eventually you realize how little the weight control gave you and really how much attention it took away. Sending love!",
      "created_utc": 1691630010.0,
      "score": 3,
      "context": []
    },
    {
      "id": "juyqaxl",
      "author": "None",
      "body": "Tbh the thing that works for me is just telling myself to get tf over it",
      "created_utc": 1691278866.0,
      "score": 2,
      "context": []
    },
    {
      "id": "juy7nfa",
      "author": "Crazy_Pomegranate725",
      "body": "I’d agree with this comment, limiting your internet use and the places you visit on the internet will help a lot",
      "created_utc": 1691270761.0,
      "score": 16,
      "context": [
        {
          "id": "juy2vj5",
          "author": "CommonExact9702",
          "body": "My suggestion would be to stay off the internet and go places where real people exist.  Swimming pools, beaches, resorts…people of all body shapes and sizes going about life normally….laughing and living life.",
          "created_utc": 1691268775.0
        }
      ]
    },
    {
      "id": "jvj5lbe",
      "author": "EastDark9",
      "body": "This is helpful advice. I’m in recovery, and the pants size and comments have been a trigger lately too. I’m not stepping on the scale.\n\nModeration is hard for me because I worry about the slippery slope of rules and control I tend to create.\n\nDo you have any advice? How are you tackling moderation?",
      "created_utc": 1691634233.0,
      "score": 2,
      "context": [
        {
          "id": "juy9pv7",
          "author": "icantsthwim",
          "body": "i’ve gained 15-20 pounds in recovery and everyone is telling me i look healthy, and commenting on my weight. it’s been really triggering lately, but other than besides stepping on the scale i thought my body looked good. i think it’s mostly just the having to buy a new wardrobe (jeans) and the scale. keep the eating habits or exercise the same daily and it should be a mental thing that recovery is good and healthy as long as everything is moderate.",
          "created_utc": 1691271626.0
        }
      ]
    },
    {
      "id": "jwowjrz",
      "author": "DruidicLove",
      "body": "I can't step on the scale either, I won't like the number I see regardless of whether it's considered healthy, Im working on just eating consistently. I've been doing essentially straight fat and I'm doing well so far. But that scale is my enemy.",
      "created_utc": 1692344122.0,
      "score": 1,
      "context": [
        {
          "id": "juy9pv7",
          "author": "icantsthwim",
          "body": "i’ve gained 15-20 pounds in recovery and everyone is telling me i look healthy, and commenting on my weight. it’s been really triggering lately, but other than besides stepping on the scale i thought my body looked good. i think it’s mostly just the having to buy a new wardrobe (jeans) and the scale. keep the eating habits or exercise the same daily and it should be a mental thing that recovery is good and healthy as long as everything is moderate.",
          "created_utc": 1691271626.0
        }
      ]
    },
    {
      "id": "jvj5v2h",
      "author": "EastDark9",
      "body": "Thank you! These are helpful, and I appreciate this.\n\nIncreasing contact with supportive people has been helpful for me as well.",
      "created_utc": 1691634356.0,
      "score": 1,
      "context": [
        {
          "id": "jv4l0jv",
          "author": "Fr0gg033",
          "body": "- Limiting internet use, particularly those that are triggering. And limiting in the night when your more susceptible to it.\n- Limiting contact with anyone irl who is triggering. You don’t need them.\n- Staying off the scale.\n- Making real life enjoyable so weight isn’t the only thing that you think or value yourself by.\n- Probably muscle building. At least you’ll feel stronger.",
          "created_utc": 1691387980.0
        }
      ]
    },
    {
      "id": "jvlhrwx",
      "author": "fruitfulfairy",
      "body": "yes! and i want to add that some people overshoot their set point weight when recovering & thats totally normal too",
      "created_utc": 1691681084.0,
      "score": 2,
      "context": [
        {
          "id": "jvivxr5",
          "author": "Lopsided_Wrangler_55",
          "body": "My recommendation to you is to stay in the day. Ultimately that is all that matters- how can you reinforce a positive relationship with yourself today in the present moment? -- instead of focusing on this looming need to gain weight-  or the fear about where you will end up. I was always scared I would gain too much. I never did.  In reality your body won't change THAT much week to week even if you are putting on a pound a week or something. But it will FEEL like it is changing a lot - because you are aware of being on this weight gain mission. It also will plateau when you reach your set point weight- aka where you really should be. Once I felt good there, I started weight lifting - feeling really strong and fit and developed a new relationship with myself. It is all possible it just happens in steps and you can not skip ahead all at once. I know how uncomfortable it can feel, trust me. You are not alone but this is temporary.\n\nI don't know what I weigh and for me, just taking that piece out of the equation felt really healthy- who cares, you know?  I know I weight more than when I was struggling with anorexia :) but I have to tell you- I am finally, after many years of being \"recovered\" but still struggling with body image--  understanding where my body is meant to be naturally and actually seeing it in a positive light. I fought it my whole life- so it is sometimes hard or weird to admit that there might even be things you like about how you look with some more weight on :) Flip the narrative - it is ok to reject what your mind is telling you. You have a habit of being self critical and when you start to imagine a new way of living- your ego mind is just going to try to tear you down because it wants to keep the habit- it is afraid of change.  So you actually have to start playing mind games with yourself - when you get silent and you hear a voice inside your head criticizing you- bullying you, speak back, and say no thank you. The more you shut it down and become aware of it- the more it the voice will diminish. It feels like there is safety in criticizing yourself but it's really just paralyzing and keeps you stuck in a loop.\n\nThe way to reinforce positive self talk is to do the things that give you real joy. It could be being with children, playing a sport, singing, Something that you can get yourself involved in. Get you into your body and out of your ruminating mind- remember that you are so much more than your outward appearance- and your experience on earth is not measured by your weight. It is about how much joy you have, how you impact those around you. The focus of the eating disorder puts you in a dark narrow hole- blocks your creativity or ability to thrive. It keeps you literally small. There is so much more that you can do and be in the world :) Recovery and gaining weight is just your bridge- and eventually you realize how little the weight control gave you and really how much attention it took away. Sending love!",
          "created_utc": 1691630010.0
        }
      ]
    },
    {
      "id": "jvj760w",
      "author": "icantsthwim",
      "body": "I learned that when I made meals for other people I always gave them a better plate than what I ate, so I act like i’m plating someone else’s plate instead lol. May be odd advice but it’s helped made me realize it’s normal to eat meals. \nI struggle with moderation when I smoke and get the munchies but i’ve been eating healthier snacks like fruit or granola mixes, pickles lol, crackers and salami, smoothies, stuff like that. pickles have 0 calories and fruit = natural sugars so it helps with cravings",
      "created_utc": 1691634951.0,
      "score": 1,
      "context": [
        {
          "id": "juy9pv7",
          "author": "icantsthwim",
          "body": "i’ve gained 15-20 pounds in recovery and everyone is telling me i look healthy, and commenting on my weight. it’s been really triggering lately, but other than besides stepping on the scale i thought my body looked good. i think it’s mostly just the having to buy a new wardrobe (jeans) and the scale. keep the eating habits or exercise the same daily and it should be a mental thing that recovery is good and healthy as long as everything is moderate.",
          "created_utc": 1691271626.0
        },
        {
          "id": "jvj5lbe",
          "author": "EastDark9",
          "body": "This is helpful advice. I’m in recovery, and the pants size and comments have been a trigger lately too. I’m not stepping on the scale.\n\nModeration is hard for me because I worry about the slippery slope of rules and control I tend to create.\n\nDo you have any advice? How are you tackling moderation?",
          "created_utc": 1691634233.0
        }
      ]
    },
    {
      "id": "jwy2xq2",
      "author": "icantsthwim",
      "body": "i wish i never stepped on the scale, in my head i only thought i gained 5 pounds, but seeing how much i actually did and my weight has sent me into a spiral lately. \nthe self guilt has been hard.",
      "created_utc": 1692498125.0,
      "score": 3,
      "context": [
        {
          "id": "juy9pv7",
          "author": "icantsthwim",
          "body": "i’ve gained 15-20 pounds in recovery and everyone is telling me i look healthy, and commenting on my weight. it’s been really triggering lately, but other than besides stepping on the scale i thought my body looked good. i think it’s mostly just the having to buy a new wardrobe (jeans) and the scale. keep the eating habits or exercise the same daily and it should be a mental thing that recovery is good and healthy as long as everything is moderate.",
          "created_utc": 1691271626.0
        },
        {
          "id": "jwowjrz",
          "author": "DruidicLove",
          "body": "I can't step on the scale either, I won't like the number I see regardless of whether it's considered healthy, Im working on just eating consistently. I've been doing essentially straight fat and I'm doing well so far. But that scale is my enemy.",
          "created_utc": 1692344122.0
        }
      ]
    },
    {
      "id": "jwy8nfq",
      "author": "DruidicLove",
      "body": "I have been eating carnivore for months, the lack of variety and restriction is friendly for me because I hate having too many options, but I had to give my scale away, because both knowing and not knowing my weight prompted anxiety.\n\nI absolutely feel that discrepancy between what you think you gained vs what actually happened, the guilt we put on ourselves is terrible, and I'm working on judging myself less, but it will take time.",
      "created_utc": 1692500937.0,
      "score": 1,
      "context": [
        {
          "id": "juy9pv7",
          "author": "icantsthwim",
          "body": "i’ve gained 15-20 pounds in recovery and everyone is telling me i look healthy, and commenting on my weight. it’s been really triggering lately, but other than besides stepping on the scale i thought my body looked good. i think it’s mostly just the having to buy a new wardrobe (jeans) and the scale. keep the eating habits or exercise the same daily and it should be a mental thing that recovery is good and healthy as long as everything is moderate.",
          "created_utc": 1691271626.0
        },
        {
          "id": "jwowjrz",
          "author": "DruidicLove",
          "body": "I can't step on the scale either, I won't like the number I see regardless of whether it's considered healthy, Im working on just eating consistently. I've been doing essentially straight fat and I'm doing well so far. But that scale is my enemy.",
          "created_utc": 1692344122.0
        },
        {
          "id": "jwy2xq2",
          "author": "icantsthwim",
          "body": "i wish i never stepped on the scale, in my head i only thought i gained 5 pounds, but seeing how much i actually did and my weight has sent me into a spiral lately. \nthe self guilt has been hard.",
          "created_utc": 1692498125.0
        }
      ]
    }
  ]
}