{
  "id": "15vwzry",
  "subreddit": "EatingDisorders",
  "author": "MakkaPakka__uwu",
  "created_utc": 1692492799.0,
  "title": "I feel uncomfortable when my body parts touch each other",
  "selftext": "I don't know if this is related to this sub but I really want to talk about it because I really want to know what this is called. I don't have this feeling when I am hungry. But when I am full, I start to feel every body part that touches each other (or touches my clothes) very intensely. My arms touching my sides, my belly folds touching each other, my legs touching each other make me EXTREMELY uncomfortable. Also tight clothes that wrap around these body parts make me super uncomfortable too. It feels like stranger hands holding my body parts and it is a disgusting feeling. I have never been very heavy in my life so I don't know if this feeling would be worse if I was heavier. But it definitely gets less when I am skinnier. The only time I didn't have this feeling was when I was at a very low BMI and was starving myself so I never felt full. I can't find people that understands this feeling anywhere and I don't know what it is called. But as I am eating regular amounts and I am at a normal BMI now, I just feel very very uncomfortable half of the day, everyday. Can you guys guess why this might be happening, or what this might be called?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/15vwzry/i_feel_uncomfortable_when_my_body_parts_touch/",
  "score": 78,
  "num_comments": 12,
  "comments": [
    {
      "id": "jx0isdn",
      "author": "fatt_toadd",
      "body": "Yes, I really understand you! It's Disgusting feeling... I sympathize, but I understand...",
      "created_utc": 1692548796.0,
      "score": 12,
      "context": []
    },
    {
      "id": "jx0wqt5",
      "author": "JadeMoon085",
      "body": "I'm going through the same thing. And for some God awful reason, all of the weight gain has gone to my right hip and thigh. It's so uncomfortable and it looks weird and I just cant deal with it. Im to the point of avoiding mirrors. Im so bloated and uncomfortable in tight clothing, but some of the tighter clothing masks that giant right hip. My friends and family say they cant notice anything, but I can see it from a mile away. I feel every last pound and inch that has gone back on to my body. It's the hardest thing to deal with. I had a lot of fear of weight gain, but that has more or less turned into the here and now fear of feeling gross and bloated and the new fat is very present and very disproportionate. I'm going out of my mind. I have been heavier, but I have a very strong fear of getting back to that heavy.",
      "created_utc": 1692554201.0,
      "score": 9,
      "context": []
    },
    {
      "id": "jx2erq6",
      "author": "velogirl",
      "body": "It’s sensory issues probably related to being on the spectrum. I have the same issue. The more you expose yourself the easier it gets.",
      "created_utc": 1692576365.0,
      "score": 6,
      "context": []
    },
    {
      "id": "jx1lp85",
      "author": "Tschenney",
      "body": "You are not alone, I feel the same way. Yesterday I had really bad water retentions in my legs due to the heat and they were so swollen the whole day that my calves rubbed against each other. Usually they don’t even touch when I stand straight. My sister said she couldn’t see any difference, but I thought I looked like I whale and felt like one too.",
      "created_utc": 1692564017.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jx0yqcy",
      "author": "Own-Researcher-1986",
      "body": "I sympathize so much. You are not alone. I try to avoid this by choosing clothing that allows me to not be tugged or pulled on.",
      "created_utc": 1692554977.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jx5tet7",
      "author": "manders556",
      "body": "Hello friend (24 f here been in recovery from anorexia nervosa purge subtype for 10 years now)\n\nYes, what you described in general is incredibly common if you have an eating disorder. It's common for people with this illness to be HYPER-AWARE of their body-- both appearance AND physical sensations. It's also not uncommon to have poor body image or even body dysmorphia paired with the experience. \n\nFor me, I know that the ONLY reason I felt guilt, shame, and wanted to purge or compensate for what I had eaten had everything to do with the basic fact that I had been conditioned and learned to associate feelings of being \"full\" with being a \"bad\" thing and even having disordered cognitions such as I'm not allowed to feel full, being full means I'm big. What I was also associating with being full influenced my feelings around being full. And this makes absolute sense because our thoughts directly influence our feelings and behaviors. \n\nAfter years of therapy and seeing intuitive dieticians, I am so at peace with food right now and have learned to trust my body. I've developed a more neutral mindset surrounding bodies and food. I know that being full isn't a BAD thing and being hungry isn't a GOOD thing. NOT honoring my hunger/fullness cues is what fuels/maintains the disorder and prevents one from ever being able to re-connect with their body.\n\nThe experience of having an eating disorder within itself is enough to drive body distrust and disconnection. Connection to the body is how we come back home to our bodies. When your body feels foreign and like you can't trust it, that can drive poor body image and in general we can be more sensitive to physical body sensations due to our thoughts and beliefs about our bodies.\n\nOur thoughts truly matter. Be kind to your mind. Be kind to your body.",
      "created_utc": 1692640557.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jx72lyv",
      "author": "Reasonable_Carob_539",
      "body": "I sympathize with this so much. I also have sensory issues with clothes too. I gained weight in my arms and it made it really difficult to feel “okay”. What helped me feel better was getting a nice sweater that fit me well. The soft fabric between my side and arms made it comfier!",
      "created_utc": 1692657366.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jxcs0au",
      "author": "EastDark9",
      "body": "I was just thinking of this today with the\nheat. My thighs were touching, and now that I’ve gained weight in recovery, I feel like I can feel my whole body differently. It’s an awkward feeling to be hyper aware of every part of my skin and where it touches other parts of my body and clothes. I think my mind is getting used to this new size. It’s almost like I feel like I’m living in someone else’s body after being so thin for so long. You are not alone.\n\nI am thankful though that food and calories aren’t constantly on my mind any longer. Other areas of my life are getting so much better!",
      "created_utc": 1692754027.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzctq80",
      "author": "Sea-Fix-3520",
      "body": "I hate my arms and I need to exercise.I hate getting old.i have to go to a yoga class and gym that's low-key.i see women with tight exercise clothes and I wouldn't go out with tight form fitting pants or tops. I have neck lines and  am getting swollen glands at times and I look ugly so I need to do something, also I have varicose veins.my bad luck.they could have been worse so I am grateful.",
      "created_utc": 1693991477.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k0zckef",
      "author": "NowHeres_HumanMusic",
      "body": "I felt like I was the only person who experienced this for the longest time. It makes me feel self-conscious and just really negative about my body (feeling like I'm disgusting).\n\nEspecially feeling folds or anything. Just have to keep reminding myself that my body is normal and I'm okay.",
      "created_utc": 1694958714.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jx50v5q",
      "author": "mymeowmix",
      "body": "That makes a lot of sense. I have the same issue with body parts touching each other and was recently diagnosed with autism. It makes it so much harder when multiple mental health/neurological issues feed into each other.",
      "created_utc": 1692629952.0,
      "score": 3,
      "context": [
        {
          "id": "jx2erq6",
          "author": "velogirl",
          "body": "It’s sensory issues probably related to being on the spectrum. I have the same issue. The more you expose yourself the easier it gets.",
          "created_utc": 1692576365.0
        }
      ]
    },
    {
      "id": "jzcp8po",
      "author": "Sea-Fix-3520",
      "body": "I hate mirrors and changes in my body as I get older.i hate taking a shower and I will not try on clothes.I want to do yoga and find a better place to live.i am still vaping.i walk and I go for acupuncture.",
      "created_utc": 1693987846.0,
      "score": 1,
      "context": [
        {
          "id": "jx5tet7",
          "author": "manders556",
          "body": "Hello friend (24 f here been in recovery from anorexia nervosa purge subtype for 10 years now)\n\nYes, what you described in general is incredibly common if you have an eating disorder. It's common for people with this illness to be HYPER-AWARE of their body-- both appearance AND physical sensations. It's also not uncommon to have poor body image or even body dysmorphia paired with the experience. \n\nFor me, I know that the ONLY reason I felt guilt, shame, and wanted to purge or compensate for what I had eaten had everything to do with the basic fact that I had been conditioned and learned to associate feelings of being \"full\" with being a \"bad\" thing and even having disordered cognitions such as I'm not allowed to feel full, being full means I'm big. What I was also associating with being full influenced my feelings around being full. And this makes absolute sense because our thoughts directly influence our feelings and behaviors. \n\nAfter years of therapy and seeing intuitive dieticians, I am so at peace with food right now and have learned to trust my body. I've developed a more neutral mindset surrounding bodies and food. I know that being full isn't a BAD thing and being hungry isn't a GOOD thing. NOT honoring my hunger/fullness cues is what fuels/maintains the disorder and prevents one from ever being able to re-connect with their body.\n\nThe experience of having an eating disorder within itself is enough to drive body distrust and disconnection. Connection to the body is how we come back home to our bodies. When your body feels foreign and like you can't trust it, that can drive poor body image and in general we can be more sensitive to physical body sensations due to our thoughts and beliefs about our bodies.\n\nOur thoughts truly matter. Be kind to your mind. Be kind to your body.",
          "created_utc": 1692640557.0
        }
      ]
    }
  ]
}