{
  "id": "162lx02",
  "subreddit": "EatingDisorders",
  "author": "_useless_lesbian_",
  "created_utc": 1693128962.0,
  "title": "my mother’s having weight loss surgery, and i feel like shit",
  "selftext": "my mother is going to have weight loss surgery soon (gastric bypass). i know it’s selfish, i know it’s unfair, but i feel like shit when she talks about it. i want to cry when i hear about how much weight she’s gonna lose. i compare obsessively when she mentions what she has to eat in preparation and what she’ll be eating afterwards. i’m not thin; i don’t just say that because of body dysmorphia, my weight really is over average. so i ruminate on how i’d feel if she got thinner than me. currently, it’s the main internal justification (or excuse) i have for continuing my disordered behaviours.\n\nshe doesn’t know that i have an eating disorder so i can’t really ask her to talk about it less even if i wanted to. i don’t trust her to know about any of my struggles. we don’t have a great relationship because of how she was in my childhood. besides, if i asked her to talk less about it to me, she’d dismiss me, and continue. i’ve tried to ask her not to talk about it in more vague terms, and she just says it’s fine because she’s only talking about herself.\n\ni don’t know what to do…",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/162lx02/my_mothers_having_weight_loss_surgery_and_i_feel/",
  "score": 57,
  "num_comments": 26,
  "comments": [
    {
      "id": "jxzi8ue",
      "author": "dragonagelesbian",
      "body": "I'm so sorry :( my mom's on Ozempic and I feel the same exact way. Honestly, my biggest piece of advice is as much distance and time away from your mom as possible. If you're still living with her, try avoiding sharing meals with only her. I live away from my mom and it does wonders for my mental health.\n\nAlso, weight above average ≠ bad body weight. Hugs!",
      "created_utc": 1693158948.0,
      "score": 27,
      "context": []
    },
    {
      "id": "jxzuhd9",
      "author": "manders556",
      "body": "Yeah, I also have a mom heavily influenced by diet-culture--thank God not to the point where web sh she would get a stomach amputation surgery for a pre-concieved problem (being overweight) \n\nIn reality, genetics is incredibly real and valid and at the end of the day influences our bodies set point range. Some people ARE naturally overweight and that is the healthiest weight for them. That's where their body likes to chill. Correlation isn't causation, so not where single health issue in a overweight individual is directly because of their weight but due to rampant and chronic weight-stigma in society-- it's simply not safe to exist in a larger body. \n\nIt's sad, it shouldn't be this way. Body diversity is very real and has always existed. Fat people have always existed and will continue to exist. Body diversity is beautiful. \n\nAll I can say is, match yo the beat of your own drum, talk to supports if you have them, and do what you need to stay safe. If that means distancing yourself from toxic messages and mentalities surrounding food, start really coming up with a game plan to move out so you can have that necessary space to heal.",
      "created_utc": 1693163859.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jy0o6dj",
      "author": "rainbowsnake03",
      "body": "I feel this, my mom can eat whatever she wants, consume thousands of calories, but because she have Crohn’s disease the calories don’t really get to her, but here I am I eat anything and it sticks with me :/ I feel so fat compared to her",
      "created_utc": 1693176307.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy2u6xr",
      "author": "iloveyoukatyaz",
      "body": "My sister got liposuction, so not the same as a band, but I relate so hard to this. I would recommend trying to just zone out when she starts talking about it. It's not ideal, but it's how I learnt to deal with it.",
      "created_utc": 1693223613.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jy0n2nj",
      "author": "meepdevop",
      "body": "T h e r a p y",
      "created_utc": 1693175803.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jxzv1n7",
      "author": "girthakitt",
      "body": "I agree with distancing from her as suggested, especially since you already verbalized your feelings to her and she kind of dismissed them. Weight loss surgery is a temporary fix and it won’t fix what’s mentally there. It’s one thing to be excited about the surgery and weight loss, but another to be inconsiderate of others feelings. \n\nI had the gastric sleeve done and it didn’t fix my binge eating, and it does take work to be cognizant of how I made other people feel about it, so I stopped talking about it eventually. I hope she can get to that point also, but in the meantime give yourself some love that she isn’t ready to give you right now.",
      "created_utc": 1693164098.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jxzqz6d",
      "author": "funkydyke",
      "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
      "created_utc": 1693162401.0,
      "score": -2,
      "context": []
    },
    {
      "id": "jy73oda",
      "author": "None",
      "body": "Hey. My mom has been the biggest reason for my eating disorder and my body dismorphia. I completely understand. If i was in your situation id be upset. Id be mad. Its okay though. Id youre not in therapy i think you should. I started going to the gym along with theeapy. Dont let your mom control your life.",
      "created_utc": 1693290226.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jytzaqi",
      "author": "Specific-Rip-8353",
      "body": "I’ve been in recovery for 5 years or more now and my best friend since childhood had gastric bypass surgery a few months ago and this has been the closest I’ve been to relapsing in a long time seeing the transformation… I’m so pleased for her because it’s made such a huge positive difference in her life, she’s never posted or said anything insensitive at all but I’m just too far gone mentally that seeing the process has made me want to restrict so badly…. I just have to unfollow her social media posts and pray I don’t end up having bad days where I go and search for the content anyway… but I know how difficult it is and to have somebody even closer to you that you feel uncomfortable sharing your feelings with and that you can’t just press the ‘mute’ button on must be so difficult for you… I really hope things ease for you soon",
      "created_utc": 1693675024.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jy1lww7",
      "author": "_useless_lesbian_",
      "body": "thank you for the kind words, and i’m sorry you’re going through this too :( it sucks. i live away at uni most of the time, including right now, so it’s definitely not as hard as it could be. but when she calls me or when i’m back over there during breaks, it’s not great. i’ll keep in mind to not have meals with her alone when i’m back there, that’s a really good idea.",
      "created_utc": 1693192208.0,
      "score": 5,
      "context": [
        {
          "id": "jxzi8ue",
          "author": "dragonagelesbian",
          "body": "I'm so sorry :( my mom's on Ozempic and I feel the same exact way. Honestly, my biggest piece of advice is as much distance and time away from your mom as possible. If you're still living with her, try avoiding sharing meals with only her. I live away from my mom and it does wonders for my mental health.\n\nAlso, weight above average ≠ bad body weight. Hugs!",
          "created_utc": 1693158948.0
        }
      ]
    },
    {
      "id": "jy1pa4m",
      "author": "_useless_lesbian_",
      "body": "to be fair to her, her weight is impacting her health - mostly because she has other conditions, like arthritis. a significantly high weight does make that worse. in short, i can understand that she is a good candidate for surgery… but then again i also know that she overeats due to stress/emotion (by her own admission), and that she doesn’t do therapy (despite the fact that she used to work in the mental health field & is diagnosed with depression & her mental health has often negatively impacted our relationship), so i kinda wish she’d act on that underlying problem. idk. it’s hard for me to separate my logical beliefs about the situation vs my selfish feelings related to my eating disorder. \n\nwhen it comes to my own body, though, i think you’re right about everyone having different natural body types and i probably am around the weight i \"should\" be naturally. living in a world that prioritises thinness over health is really damaging. i live away at uni most of the year anyway, but yeah i do need to plan for breaks back at my parents’ place.",
      "created_utc": 1693194044.0,
      "score": 3,
      "context": [
        {
          "id": "jxzuhd9",
          "author": "manders556",
          "body": "Yeah, I also have a mom heavily influenced by diet-culture--thank God not to the point where web sh she would get a stomach amputation surgery for a pre-concieved problem (being overweight) \n\nIn reality, genetics is incredibly real and valid and at the end of the day influences our bodies set point range. Some people ARE naturally overweight and that is the healthiest weight for them. That's where their body likes to chill. Correlation isn't causation, so not where single health issue in a overweight individual is directly because of their weight but due to rampant and chronic weight-stigma in society-- it's simply not safe to exist in a larger body. \n\nIt's sad, it shouldn't be this way. Body diversity is very real and has always existed. Fat people have always existed and will continue to exist. Body diversity is beautiful. \n\nAll I can say is, match yo the beat of your own drum, talk to supports if you have them, and do what you need to stay safe. If that means distancing yourself from toxic messages and mentalities surrounding food, start really coming up with a game plan to move out so you can have that necessary space to heal.",
          "created_utc": 1693163859.0
        }
      ]
    },
    {
      "id": "jy1mvs4",
      "author": "_useless_lesbian_",
      "body": "it sucks cause i feel guilty for thinking like this, but it’s also genuinely upsetting for me. plus she had a pretty major role in my development of an eating disorder. i hope things get easier for you and your mom.",
      "created_utc": 1693192733.0,
      "score": 1,
      "context": [
        {
          "id": "jy0o6dj",
          "author": "rainbowsnake03",
          "body": "I feel this, my mom can eat whatever she wants, consume thousands of calories, but because she have Crohn’s disease the calories don’t really get to her, but here I am I eat anything and it sticks with me :/ I feel so fat compared to her",
          "created_utc": 1693176307.0
        }
      ]
    },
    {
      "id": "jy1njm8",
      "author": "_useless_lesbian_",
      "body": "i am in therapy dw! just unfortunately don’t see my therapist very often since she’s usually pretty overbooked lol. plus it’s nice to get opinions from people who actually get it.",
      "created_utc": 1693193087.0,
      "score": 1,
      "context": [
        {
          "id": "jy0n2nj",
          "author": "meepdevop",
          "body": "T h e r a p y",
          "created_utc": 1693175803.0
        }
      ]
    },
    {
      "id": "jxzutc7",
      "author": "manders556",
      "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
      "created_utc": 1693164002.0,
      "score": -2,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        }
      ]
    },
    {
      "id": "jy5uc8b",
      "author": "Cranberry_Lips",
      "body": "I used to work on a unit that took post-gastric bypass patients. I would not recommend that surgery lightly to anyone. It's very painful and it forces you to completely change your eating habits. Sometimes it causes permanent damage and like you said, inability to not just absorb nutrients, but medicine as well. I would literally try everything else before having this surgery.",
      "created_utc": 1693267098.0,
      "score": 1,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        }
      ]
    },
    {
      "id": "jy24bro",
      "author": "meepdevop",
      "body": "Understandable. I have had issues with overeating and anorexia at different points in life (different traumas causing different reactions). It was rude of me to just put that as an answer—but as someone on the other side, I couldn’t think of where to even begin. \n\nNow that you’ve said your comment, I do have a couple ideas that may give a pinch of clarity.\n\nWhile it’s all too easy to compare your body to others, it’s leading you somewhere emotionally difficult. That much is clear. Perhaps a different way to try thinking about it (easier said than done) would be to see it like you’re both on the same team in a relay race. The race to being a healthy weight, I suppose. She got the turn to cross this finish line first, hitting the goal. You don’t sound like you resent Mom for doing this; however, it’s clearly striking a chord—especially when you ask her nicely to drop the subject, she doesn’t. Parents can be…challenging to get to see your perspective, much less respect a boundary they may see you as being “immature” about (when really you’re just communicating your needs in the way you can for now). That often can’t be solved until they stop seeing you as a child and instead begin seeing the adult you are. That’s THEM needing therapy or harsh wake-up calls or both, none of which is your job to make happen for her. \n\nGoing back to the race. Some people walk, jog, or sprint—she took a shortcut, and it sounds like that’ll be fine. (It’s not cheating; just different.) PLEASE don’t be mean to yourself if you can’t do the same for yourself that she’s having done with this surgery—if anything, maybe use it as motivation that it’s possible to plan something like that out for yourself in the future (if that appeals to you). Or you could walk/jog/sprint the race. Whichever way, it’s about YOU being comfortable with the plan and its result. There are no rules, so as long as you’re not hurting yourself, your weight journey is yours. It’ll take as long as it takes, and every success will be YOURS.\n\nBest of luck.",
      "created_utc": 1693204013.0,
      "score": 1,
      "context": [
        {
          "id": "jy0n2nj",
          "author": "meepdevop",
          "body": "T h e r a p y",
          "created_utc": 1693175803.0
        },
        {
          "id": "jy1njm8",
          "author": "_useless_lesbian_",
          "body": "i am in therapy dw! just unfortunately don’t see my therapist very often since she’s usually pretty overbooked lol. plus it’s nice to get opinions from people who actually get it.",
          "created_utc": 1693193087.0
        }
      ]
    },
    {
      "id": "jy09ig7",
      "author": "Far_Dragonfruit1191",
      "body": "Simply weren't meant to lose weight? What are you talking about. I don't think gastric bypass is the best option for weight loss. The most effective and beneficial way for an overweight or obese individual to lose weight is to eat a balanced nutritious diet that doesn't include excess amounts of calories and processed junk.dieting doesn't equal a healthy relationship with food your right but overly consuming food isn't so good either.",
      "created_utc": 1693170015.0,
      "score": 5,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        }
      ]
    },
    {
      "id": "jy6fe87",
      "author": "ForsakenReflection_",
      "body": "Food is a natural need. But consistently eating more than you’re burning when you’re already overweight isn’t a need. And having too many excess fat will destroy your organs anyway.\n\nI’m obviously not saying that anyone who is struggling with a restrictive ED needs to lose weight or SHOULD lose weight. But a lot of overweight people without restrictive EDs want to lose healthy amounts of weight and that’s ok!",
      "created_utc": 1693276210.0,
      "score": 1,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        }
      ]
    },
    {
      "id": "jy0l0w9",
      "author": "manders556",
      "body": "And ironically the dieting mentality is ultimately what leads to binging behaviors to begin with lmao",
      "created_utc": 1693174883.0,
      "score": 3,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        },
        {
          "id": "jy09ig7",
          "author": "Far_Dragonfruit1191",
          "body": "Simply weren't meant to lose weight? What are you talking about. I don't think gastric bypass is the best option for weight loss. The most effective and beneficial way for an overweight or obese individual to lose weight is to eat a balanced nutritious diet that doesn't include excess amounts of calories and processed junk.dieting doesn't equal a healthy relationship with food your right but overly consuming food isn't so good either.",
          "created_utc": 1693170015.0
        }
      ]
    },
    {
      "id": "jy6ml63",
      "author": "manders556",
      "body": " You can have a restrictive ED and be overweight. I've had 4 admissions amd was only \"underweight\" during one of them. It's about the behaviors and mentality surrounding food. The treatment for someone with a restrictive ED that presents as overweight is the same treatment regardless of weight and that treatment entails challenging the pre-occupation and obsessiveness with appearance/weight, unlearning harmful beliefs and misconceptions about bodies and health, and cultivating body connection which requires letting go of the need to manipulate and control the body, which always fights back.",
      "created_utc": 1693279660.0,
      "score": 2,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        },
        {
          "id": "jy6fe87",
          "author": "ForsakenReflection_",
          "body": "Food is a natural need. But consistently eating more than you’re burning when you’re already overweight isn’t a need. And having too many excess fat will destroy your organs anyway.\n\nI’m obviously not saying that anyone who is struggling with a restrictive ED needs to lose weight or SHOULD lose weight. But a lot of overweight people without restrictive EDs want to lose healthy amounts of weight and that’s ok!",
          "created_utc": 1693276210.0
        }
      ]
    },
    {
      "id": "jy6np6v",
      "author": "manders556",
      "body": "\"Consistently eating more than your burning\"\n\nMy dietician would have had fun with you lol\n\nSo this shows you very much view food as a punishment/reward system which is staying in a disordered mindset surrounding food. Food is not a punishment/rewards system, and we were not meant to be calculators with food. This doesn't foster a intuitive relationship with food--but rather a ridgid, disconnected, and disordered one. \n\nDespite how much diet-culture likes to demonize eating for joy and pleasure or even for a dopamine hit (especially those of us with ADHD-prone to dopamine seeking behavior in gnereal and food naturally gives dopamine)--this is still a valid need and cinpleteky normal aspect of the eating experience and having a healthy relationship with food. \n\nSome days, we may eat more than others. This is normal. Binging behaviors are often demonized while restriction can be glamorize but the irony in that is that often times restriction and even mental restriction can be enough to trigger binging alone. \n\n The need to monitor, track, and compensate for what we eat stems from body disconnection. This shows that you do not trust your body to do its natural job with food, and the nature of dieting and disordered eating will tell us to ignore our body and not trust it so that makes a lot of sense.",
      "created_utc": 1693280235.0,
      "score": 2,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        },
        {
          "id": "jy6fe87",
          "author": "ForsakenReflection_",
          "body": "Food is a natural need. But consistently eating more than you’re burning when you’re already overweight isn’t a need. And having too many excess fat will destroy your organs anyway.\n\nI’m obviously not saying that anyone who is struggling with a restrictive ED needs to lose weight or SHOULD lose weight. But a lot of overweight people without restrictive EDs want to lose healthy amounts of weight and that’s ok!",
          "created_utc": 1693276210.0
        }
      ]
    },
    {
      "id": "jy0okmp",
      "author": "Far_Dragonfruit1191",
      "body": "Plenty of people started binging at young ages before they knew what a diet even was. Restricting heavily will definitely lead to worse binging but many people have struggled with binging since they were little. Dieting isn't bad as long as you're not too extreme or obsessive about it and you're getting enough calories and nutrient dense foods to support your body.",
      "created_utc": 1693176485.0,
      "score": 1,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        },
        {
          "id": "jy09ig7",
          "author": "Far_Dragonfruit1191",
          "body": "Simply weren't meant to lose weight? What are you talking about. I don't think gastric bypass is the best option for weight loss. The most effective and beneficial way for an overweight or obese individual to lose weight is to eat a balanced nutritious diet that doesn't include excess amounts of calories and processed junk.dieting doesn't equal a healthy relationship with food your right but overly consuming food isn't so good either.",
          "created_utc": 1693170015.0
        },
        {
          "id": "jy0l0w9",
          "author": "manders556",
          "body": "And ironically the dieting mentality is ultimately what leads to binging behaviors to begin with lmao",
          "created_utc": 1693174883.0
        }
      ]
    },
    {
      "id": "jy85ja0",
      "author": "ForsakenReflection_",
      "body": "Yes, you can have a restrictive ED and be overweight. Although for some of those EDs you have to be rapidly losing weight to have it, like anorexia. Don’t get annoyed at me for mentioning it. Get annoyed at the DSM. You’ve either gotta be at an already low weight or rapidly be losing weight.\n\nBut I wasn’t talking about people with restrictive EDs anyway. Not everyone has an ED and if someone wants to lose weight in a healthy, sustainable way, that’s fine. We shouldn’t be acting like them no longer overeating is the worst thing ever and that they’re destroying their organs by eating healthy amounts of food.",
      "created_utc": 1693314876.0,
      "score": 1,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        },
        {
          "id": "jy6fe87",
          "author": "ForsakenReflection_",
          "body": "Food is a natural need. But consistently eating more than you’re burning when you’re already overweight isn’t a need. And having too many excess fat will destroy your organs anyway.\n\nI’m obviously not saying that anyone who is struggling with a restrictive ED needs to lose weight or SHOULD lose weight. But a lot of overweight people without restrictive EDs want to lose healthy amounts of weight and that’s ok!",
          "created_utc": 1693276210.0
        },
        {
          "id": "jy6ml63",
          "author": "manders556",
          "body": " You can have a restrictive ED and be overweight. I've had 4 admissions amd was only \"underweight\" during one of them. It's about the behaviors and mentality surrounding food. The treatment for someone with a restrictive ED that presents as overweight is the same treatment regardless of weight and that treatment entails challenging the pre-occupation and obsessiveness with appearance/weight, unlearning harmful beliefs and misconceptions about bodies and health, and cultivating body connection which requires letting go of the need to manipulate and control the body, which always fights back.",
          "created_utc": 1693279660.0
        }
      ]
    },
    {
      "id": "jy86is5",
      "author": "ForsakenReflection_",
      "body": "I really don’t see food as a reward/punishment system. I’m not saying I have a healthy relationship with food bc I don’t, but you’re SO far off with your guesses. HOW is what I said proof that I think of food as punishment or a reward? I literally just talked about how some people overeat, which is a want instead of a need. I didn’t add any mortality to that or say it’s good they’re using food as a reward or that they should eat less as punishment or whatever. It’s literally a fact that some people overeat. Im not glamorising or demonising anything. \n\nNot everyone can trust their body to do its natural job with food. We live in a society full of very addictive food that doesn’t fill us up easily or keep us full for long. Our brains and bodies don’t always know when to tell us to stop eating them. My brain and body would let me starve if I listened to them because I hardly get hunger cues. Do you still think I should trust my body? >!I’m already underweight btw!<",
      "created_utc": 1693315304.0,
      "score": 1,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        },
        {
          "id": "jy6fe87",
          "author": "ForsakenReflection_",
          "body": "Food is a natural need. But consistently eating more than you’re burning when you’re already overweight isn’t a need. And having too many excess fat will destroy your organs anyway.\n\nI’m obviously not saying that anyone who is struggling with a restrictive ED needs to lose weight or SHOULD lose weight. But a lot of overweight people without restrictive EDs want to lose healthy amounts of weight and that’s ok!",
          "created_utc": 1693276210.0
        },
        {
          "id": "jy6np6v",
          "author": "manders556",
          "body": "\"Consistently eating more than your burning\"\n\nMy dietician would have had fun with you lol\n\nSo this shows you very much view food as a punishment/reward system which is staying in a disordered mindset surrounding food. Food is not a punishment/rewards system, and we were not meant to be calculators with food. This doesn't foster a intuitive relationship with food--but rather a ridgid, disconnected, and disordered one. \n\nDespite how much diet-culture likes to demonize eating for joy and pleasure or even for a dopamine hit (especially those of us with ADHD-prone to dopamine seeking behavior in gnereal and food naturally gives dopamine)--this is still a valid need and cinpleteky normal aspect of the eating experience and having a healthy relationship with food. \n\nSome days, we may eat more than others. This is normal. Binging behaviors are often demonized while restriction can be glamorize but the irony in that is that often times restriction and even mental restriction can be enough to trigger binging alone. \n\n The need to monitor, track, and compensate for what we eat stems from body disconnection. This shows that you do not trust your body to do its natural job with food, and the nature of dieting and disordered eating will tell us to ignore our body and not trust it so that makes a lot of sense.",
          "created_utc": 1693280235.0
        }
      ]
    },
    {
      "id": "jy16o60",
      "author": "manders556",
      "body": "Agree to disagree. I believe the nature of the dieting mentality is bound to lead to obsessiveness. Food rules are proven to reinforce this obsessiveness and all or nothing/black and white thinking cognitive distortions.",
      "created_utc": 1693184747.0,
      "score": 2,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        },
        {
          "id": "jy09ig7",
          "author": "Far_Dragonfruit1191",
          "body": "Simply weren't meant to lose weight? What are you talking about. I don't think gastric bypass is the best option for weight loss. The most effective and beneficial way for an overweight or obese individual to lose weight is to eat a balanced nutritious diet that doesn't include excess amounts of calories and processed junk.dieting doesn't equal a healthy relationship with food your right but overly consuming food isn't so good either.",
          "created_utc": 1693170015.0
        },
        {
          "id": "jy0l0w9",
          "author": "manders556",
          "body": "And ironically the dieting mentality is ultimately what leads to binging behaviors to begin with lmao",
          "created_utc": 1693174883.0
        },
        {
          "id": "jy0okmp",
          "author": "Far_Dragonfruit1191",
          "body": "Plenty of people started binging at young ages before they knew what a diet even was. Restricting heavily will definitely lead to worse binging but many people have struggled with binging since they were little. Dieting isn't bad as long as you're not too extreme or obsessive about it and you're getting enough calories and nutrient dense foods to support your body.",
          "created_utc": 1693176485.0
        }
      ]
    },
    {
      "id": "jy9zx91",
      "author": "manders556",
      "body": "Yes. As a psych student and someone who works in mental health and is going on to be a clinician in my senior year--I am incredibly aware of the stigma in DSM-5 diagnosis in regards to the fact that the only difference in symptoms between \"atypical\" anorexia and anorexia is literally just the weight component which reinforces weight stigma surrounding EDs and the already existing stigma that they have a certain \"look\" rather than the fact that this is a life threatening MENTAL illness--not a weight disorder. \n\nI'm genuinely confused on the point you were trying to make here to he honest. \n\nDieting behaviors and the Dieting mentality mirror the ED mentality and behaviors--there's no difference. They both encourage ignoring hunger/fullness cues, cutting our entire food groups, engages in food labeling and attaching morality to food, encourages restriction which fuels binging, and then ironically shames binging behaviors while putting restriction on a pedestal and even disguising disordered behaviors such as restriction as \"health\" promoting behaviors. \n \nMy opinion-- restriction by nature is disordered. If it weren't, it wouldn't be a literal ED behavior in the DSM-5. There's no way to make Dieting AKA ED behaviors \"health promoting\" in my opinion. \n\nMy opinion of what a HEALTHY relationship with food that encourages actual health promoting behaviors would be: intuitive eating--as was introduced to me by the professionals in recovery. Everyone was born a intuitive eaters, we lose this when we engage in diet-culture and the Dieting mentality. Dieting disconnects us from our body and teaches us we must fear and cannot trust our bodies. Intuitive eating breeds body re-connection. \n\nIf you are trying to argue that Dieting promotes a healthy relationship with food then I disagree and we can just agree to disagree because Dieting literally did fuel and encourage the development of my ED alone.",
      "created_utc": 1693339415.0,
      "score": 1,
      "context": [
        {
          "id": "jxzqz6d",
          "author": "funkydyke",
          "body": "My wife has talked about wanting gastric bypass surgery and it’s really hard for me to deal with too. It especially stresses me out because weight loss surgery makes you permanently unable to absorb enough nutrients so she’d be malnourished the rest of her life and I don’t want that for her. She says things like “it’s the most effective proven way to lose weight” but like yeah obviously it does because you’ll be malnourished as if you have anorexia",
          "created_utc": 1693162401.0
        },
        {
          "id": "jxzutc7",
          "author": "manders556",
          "body": "Yikes! Isn't that sad though! If the MOST effective way to lose weight is to amputate one of your body organs...then maybe, just maybe we simply weren't MEANT to lose weight. Maybe that's why our body literally fights back against the very mechanism of dieting. Dieting≠healthy relationship with food. \n\nAnything that denies our bodies natural needs and telling us to DESTROY our organs is a RED FLAG",
          "created_utc": 1693164002.0
        },
        {
          "id": "jy6fe87",
          "author": "ForsakenReflection_",
          "body": "Food is a natural need. But consistently eating more than you’re burning when you’re already overweight isn’t a need. And having too many excess fat will destroy your organs anyway.\n\nI’m obviously not saying that anyone who is struggling with a restrictive ED needs to lose weight or SHOULD lose weight. But a lot of overweight people without restrictive EDs want to lose healthy amounts of weight and that’s ok!",
          "created_utc": 1693276210.0
        },
        {
          "id": "jy6ml63",
          "author": "manders556",
          "body": " You can have a restrictive ED and be overweight. I've had 4 admissions amd was only \"underweight\" during one of them. It's about the behaviors and mentality surrounding food. The treatment for someone with a restrictive ED that presents as overweight is the same treatment regardless of weight and that treatment entails challenging the pre-occupation and obsessiveness with appearance/weight, unlearning harmful beliefs and misconceptions about bodies and health, and cultivating body connection which requires letting go of the need to manipulate and control the body, which always fights back.",
          "created_utc": 1693279660.0
        },
        {
          "id": "jy85ja0",
          "author": "ForsakenReflection_",
          "body": "Yes, you can have a restrictive ED and be overweight. Although for some of those EDs you have to be rapidly losing weight to have it, like anorexia. Don’t get annoyed at me for mentioning it. Get annoyed at the DSM. You’ve either gotta be at an already low weight or rapidly be losing weight.\n\nBut I wasn’t talking about people with restrictive EDs anyway. Not everyone has an ED and if someone wants to lose weight in a healthy, sustainable way, that’s fine. We shouldn’t be acting like them no longer overeating is the worst thing ever and that they’re destroying their organs by eating healthy amounts of food.",
          "created_utc": 1693314876.0
        }
      ]
    }
  ]
}