{
  "id": "168mirz",
  "subreddit": "EatingDisorders",
  "author": "RandomWeebBitch",
  "created_utc": 1693712449.0,
  "title": "How did y’all overcome the food obsessed mindset that comes with an ED",
  "selftext": "I’ve had an ED (binge and restrict) since i was in 8th grade. I’m now in my first year of college and I still struggle a lot with being obsessed with what I eat. It’s sad to admit but I literally structure my day around food. There have been time periods in my life when it has seemingly gone away but then it’ll come back full force cause something triggered it. In this case I am terrified of the freshman 15 so i am constantly watching my intake and monitoring my body. This has led to a binge restrict cycle. Literally every single day I wake up and my first thought is what is my meal plan for the day. I’m sorry if this is ranty I just want to know how other people get out of this mindset. I cannot afford therapy or any type of treatment considering I am a broke college student so what can I do?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/168mirz/how_did_yall_overcome_the_food_obsessed_mindset/",
  "score": 56,
  "num_comments": 27,
  "comments": [
    {
      "id": "jyyuq58",
      "author": "houston_veronica",
      "body": "My understanding is that restricting only worsens obsession with food. The other thing I can say is that you may want to journal your food intake and try to see what you were feeling as you ate. Trying to eat your food sitting down at the table, no other distractions, and thinking of what your food tastes like...can help. Then, logging how you feel after - are you still hungry, are you full, are you somewhere in between. Then, think of the fact that you are GOING to need to eat again - which means both bingeing and restricting are less powerful IMO. (Bingeing gets powerful because you are doing it mindlessly, not thinking about how you'll feel after - Restricting is super powerful when it comes to obsessing on food, because you are thinking that you may not eat again for a long time.  By realizing that you are promising yourself you can eat again in 4-6 hours - you hopefully take the power away from these two fears.)",
      "created_utc": 1693759149.0,
      "score": 20,
      "context": []
    },
    {
      "id": "jyzcxon",
      "author": "Cool-Apartment4640",
      "body": "What worked for me was to stay busy and focus on other things. I was in a really good place with not being obsessed with my body and food because I just got so busy. But honestly I just kind of stopped eating. And then I got depressed and stopped smoking and my ED came back full force. But I know when I was busy, I was in better control.",
      "created_utc": 1693765510.0,
      "score": 5,
      "context": []
    },
    {
      "id": "jz0wlbd",
      "author": "j-alfred-prufrock-",
      "body": "Years of therapy and vyvanse. Finally got a rx and I stopped my binge and restrict. For me, I first had to learn not to restrict after a binge and then find other ways to cope with stress. I’ve been going through a lot these past months and have only binged twice which is a huge win. Now that it doesn’t happen as often now, I don’t beat myself up for it and try to restrict. If you can get free counseling services via your college that would be the best bet.",
      "created_utc": 1693786430.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jz3agcz",
      "author": "Jesusxcraves",
      "body": "I finally had to join an anon 12 step program. It’s literally the only thing that worked for me, I’m 6 months in Recovery since yesterday",
      "created_utc": 1693833290.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jyz80ux",
      "author": "humbledbyit",
      "body": "I was able to get recovered from a similar mindset & behaviors by working a 12 step program with a recovered sponsor. I had to try everything else first to see if that would work. When it didn't I had to get to rock bottom- point at which life as it was was unbearable. Then & only then could I be open & willing to work 12 step program. I'm happy to chat more if you like",
      "created_utc": 1693763768.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jz001yw",
      "author": "None",
      "body": "I would check to see if your college offers free counseling. That’s what I’m planning on doing!",
      "created_utc": 1693773600.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jz2t93u",
      "author": "manders556",
      "body": "A few things inportant for you to understand:\n\n1. The freshmen 15 is a diet-culture myth not rooted in actual science and rooted in fear-mongeting diet-culture. Our bodies weight fluctuate throughout our entire lives--this is normal. \n\n2. Weight gain in general isn't inherently bad. That was one of the biggest fears fueling and maintaining my ED for years is just weight gain fears in general due to deeply rooted conditioned fat-phobia and being bullied for my weight as a child. \n\nAlong with the physical side of recovery and being intentional about fueling our bodies rather than being intentional about DEPRIVING Our bodies--the mental aspect will arguably be the most difficult yet most important long-term self-sustaining aspect of recovery. Weight restored≠recovered if ya mind still sick. \n\n--This is where CBT and DBT come in handy. Re-framing my thoughts alone and working on identifying disordered cognitions and their mechanisms surrounding food and purpose the behaviors serve and better ways to cope and healthier ways to think and the power of 💫AND💫 in dialectical thinking alone has helped to re-wire my brain over the years. My thoughts surrounding food are so much better and more in tune with reality. \n\nPower of AND: cldialectical thinking in general-- accepting two truths can co-exist at same time\n\n1. I can grieve/miss my old body AND never want to go back to where I was\n\n2. I can feel scared, feel it, AND do it anyways \n\nOpposite action:\n\n1. Instead of experiencing fear and wanting to runaway------> try-----------> don't avoid. Approach head on! Be brave. \n\n2. Wanting to restrict and reinforce disordered pathways------> challenge disordered thoughts and where these messages came from and challenge yourself to eat some food\n\n\n\nED treatment programs and intuitive eating dieticians/therapists throughout the years have given me lots of tools to help cope and challenge disordered beliefs. I highly reccolemd a team! We can rarely do this hard but necessary work called recovery in isolation. We can't heal in isolation period.",
      "created_utc": 1693823869.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jz5s3tf",
      "author": "Late_Living3278",
      "body": "Me same as you, scared to gain weight so keep meal whole day then after working at night super hungry",
      "created_utc": 1693869019.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jz5tijr",
      "author": "rogobuw",
      "body": "I didn’t fully recover, but personally, it was having a passion. I love maths , and it almost makes me forget the illness for hours :)! So yeah I think getting an interest might help :)",
      "created_utc": 1693869632.0,
      "score": 3,
      "context": []
    },
    {
      "id": "jz1325n",
      "author": "raeg14",
      "body": "Eat enough! Honor your hunger, then don’t restrict after. It’ll even out over time. DM me if you want, I didn’t want to type too much 💖",
      "created_utc": 1693789095.0,
      "score": 2,
      "context": []
    },
    {
      "id": "jz3ktdb",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1693837846.0,
      "score": -1,
      "context": []
    },
    {
      "id": "jz1zosh",
      "author": "idkman1768",
      "body": "Eating enough",
      "created_utc": 1693804527.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jz2xgp4",
      "author": "manders556",
      "body": "There are ways to get treatment regardless of situation. Eating disorder organizations such as project.heal offer wonderful treatment scholarships and offer free rides to evidence based treatment programs across the nation. I highly reccomemd looking into it because I don't know anyone who was able to fully recover without some type of professional intervention and we were not meant to heal in isolation. They may even have telehealth IOP options. Insurance makes the process a little easier, bit if not there ARE still options available! Your Health should come first! If that takes a dump then your grades and cognitive health will likely decline as well. I relapsed in college after maintaining and sustaining recovery for years. College can be hard in general with all types of triggers. Support can be life saving and necessary. I had to take off of school, not once but a few times! But I'm here to say I don't regret it and I'm healthier than I've ever been and have the energy to complete my degree +more! I work in a rehab. I'm completing my degree and enrolled in getting my CADC (certified drug and alcohol counselor certification)--a life stuck in my ED could never have offered me this",
      "created_utc": 1693826592.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jz5mbz7",
      "author": "No-Staff-8892",
      "body": "I didn't.",
      "created_utc": 1693866517.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jz8zk8e",
      "author": "Almondmilk913",
      "body": "For me, I came to learn that ED's are a reflection of something deeper - there are many books out there from people who have experienced them that could help. I recommend the book \"Until the Death of Me - A 15-Year Eating Disorder Recovery Journey\" by Saori Okada. She candidly shares her inner world and makes you realise that you can love yourself for who you are vs. this \"perfect\" version we are often tld to be",
      "created_utc": 1693929110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzedj5k",
      "author": "Slenso",
      "body": "I feel like it’s a mindfulness that you practice every single day. The choice to want to be healthier motivates me more than the voice to control what I’m eating these days.",
      "created_utc": 1694017653.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzld2ra",
      "author": "itsokokyxnx",
      "body": "l",
      "created_utc": 1694126595.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzttp0m",
      "author": "Ok-Maximum2228",
      "body": "I’d recommend looking into any free therapy options that may be available in your area, it sounds like it may be beneficial for you.",
      "created_utc": 1694274610.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jz2rspw",
      "author": "manders556",
      "body": "Hit the nail on the head! Restriction literally reinforces those disordered ED neural pathways. Every single time we engage in an ED behavior, we are also subconsciously lighting up these old nueral pathways that are associated with the behavior.",
      "created_utc": 1693822883.0,
      "score": 11,
      "context": [
        {
          "id": "jyyuq58",
          "author": "houston_veronica",
          "body": "My understanding is that restricting only worsens obsession with food. The other thing I can say is that you may want to journal your food intake and try to see what you were feeling as you ate. Trying to eat your food sitting down at the table, no other distractions, and thinking of what your food tastes like...can help. Then, logging how you feel after - are you still hungry, are you full, are you somewhere in between. Then, think of the fact that you are GOING to need to eat again - which means both bingeing and restricting are less powerful IMO. (Bingeing gets powerful because you are doing it mindlessly, not thinking about how you'll feel after - Restricting is super powerful when it comes to obsessing on food, because you are thinking that you may not eat again for a long time.  By realizing that you are promising yourself you can eat again in 4-6 hours - you hopefully take the power away from these two fears.)",
          "created_utc": 1693759149.0
        }
      ]
    },
    {
      "id": "jz2vook",
      "author": "manders556",
      "body": "Yes--the Binge/restrict cycle is insane. Restriction is the #1 trigger for binging episodes for a reason. Even MENTAL restriction--food rules/food lables/viewing food as a number rather than fuel can be enough to trigger the scarcity mindset surrounding food. When we feel deprived, our bodies will always fight back against the threat of restriction and binging is the natural survival response to this.\n\nI would reccomemd not necessarily tracking ones intake because this can fuel onsessiveness surrounding food especially for people who already calorie count as an ED behavior--this can be triggering. I agree with the general concept of a food journal though! I think its important to work with a team on certain things in recovery and this is one of them. \n\nOnly a dietician can really help with identifying dietary needs and could help with meal planning and the relationship with food exploring emotions role as well. It was helpful for me to keep a specific ED recovery structured food journal where I don't list calories--reinforcing viewing food as numbers-but rather simply view food as food--food groups and exploring the thoughts and emotions associated with my eating experience vs to bring more awareness and where I'm at on hunger/fullness scale to identify hunger/fullness cues which can be hard when you have an ED and we lose hunger/fullness cues from restriction. \n\nExample:\n\nBreakfast: \n\n1. Cereal- carbs/starch- Brain functions mostly off of carbs. Carbs literally= brain food \n Milk- dairy\nBanana- fruit\nPeanut butter- fat \n\nBefore meal check in:\n\nThoughts/beliefs: I like cereal--no food judgments here. I used to be afraid of PB but now I know my body needs it and it tastes good\n\nHunger scale: I'm hungry af on hunger scale I'm at a 4--stomach nearly eating itself, growling \n\nFeelings: anxious going into meal\n\nMeal intention: stay present and complete meal\n\nAfter meal check in:\n\n Hunger scale: I'm at a 7--satisfied\n\nThoughts/beliefs about food: no guilt attached to food due to no more food rules but when PB was off limits I felt emmense guilt when letting myself have it. Now I eat it with no guilt but rather joy \n\nFeelings:  content",
      "created_utc": 1693825477.0,
      "score": 4,
      "context": [
        {
          "id": "jyyuq58",
          "author": "houston_veronica",
          "body": "My understanding is that restricting only worsens obsession with food. The other thing I can say is that you may want to journal your food intake and try to see what you were feeling as you ate. Trying to eat your food sitting down at the table, no other distractions, and thinking of what your food tastes like...can help. Then, logging how you feel after - are you still hungry, are you full, are you somewhere in between. Then, think of the fact that you are GOING to need to eat again - which means both bingeing and restricting are less powerful IMO. (Bingeing gets powerful because you are doing it mindlessly, not thinking about how you'll feel after - Restricting is super powerful when it comes to obsessing on food, because you are thinking that you may not eat again for a long time.  By realizing that you are promising yourself you can eat again in 4-6 hours - you hopefully take the power away from these two fears.)",
          "created_utc": 1693759149.0
        }
      ]
    },
    {
      "id": "jyzydl6",
      "author": "RandomWeebBitch",
      "body": "Thanks!",
      "created_utc": 1693773027.0,
      "score": 2,
      "context": [
        {
          "id": "jyyuq58",
          "author": "houston_veronica",
          "body": "My understanding is that restricting only worsens obsession with food. The other thing I can say is that you may want to journal your food intake and try to see what you were feeling as you ate. Trying to eat your food sitting down at the table, no other distractions, and thinking of what your food tastes like...can help. Then, logging how you feel after - are you still hungry, are you full, are you somewhere in between. Then, think of the fact that you are GOING to need to eat again - which means both bingeing and restricting are less powerful IMO. (Bingeing gets powerful because you are doing it mindlessly, not thinking about how you'll feel after - Restricting is super powerful when it comes to obsessing on food, because you are thinking that you may not eat again for a long time.  By realizing that you are promising yourself you can eat again in 4-6 hours - you hopefully take the power away from these two fears.)",
          "created_utc": 1693759149.0
        }
      ]
    },
    {
      "id": "jz0wxtn",
      "author": "RandomWeebBitch",
      "body": "i’ll definitely check that out👍🏾",
      "created_utc": 1693786572.0,
      "score": 1,
      "context": [
        {
          "id": "jz001yw",
          "author": "None",
          "body": "I would check to see if your college offers free counseling. That’s what I’m planning on doing!",
          "created_utc": 1693773600.0
        }
      ]
    },
    {
      "id": "jz2wkjq",
      "author": "manders556",
      "body": "Most people in early recovery don't have a great concept of what \"enough\" even means. This is why seeking a intuitive eating dietician specifically can be beneficial. Most people with EDs have a skewed and distorted view of food and need guidance, structure, and intervention from professionals with this aspect. \n\nI agree though! eat enough! Get a intuitive eating dietician that can help assist with educating on what is actually enough according to our individualized dietary needs.",
      "created_utc": 1693826039.0,
      "score": 3,
      "context": [
        {
          "id": "jz1325n",
          "author": "raeg14",
          "body": "Eat enough! Honor your hunger, then don’t restrict after. It’ll even out over time. DM me if you want, I didn’t want to type too much 💖",
          "created_utc": 1693789095.0
        }
      ]
    },
    {
      "id": "jz6bury",
      "author": "Spideriffic",
      "body": "What's the matter with you",
      "created_utc": 1693877848.0,
      "score": 1,
      "context": [
        {
          "id": "jz3ktdb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1693837846.0
        }
      ]
    },
    {
      "id": "jz335u5",
      "author": "houston_veronica",
      "body": "I agree totally with your view on journaling. I think I meant to say what you said - doing 'check-ins' with mindful and self-compassionate thinking.",
      "created_utc": 1693829756.0,
      "score": 4,
      "context": [
        {
          "id": "jyyuq58",
          "author": "houston_veronica",
          "body": "My understanding is that restricting only worsens obsession with food. The other thing I can say is that you may want to journal your food intake and try to see what you were feeling as you ate. Trying to eat your food sitting down at the table, no other distractions, and thinking of what your food tastes like...can help. Then, logging how you feel after - are you still hungry, are you full, are you somewhere in between. Then, think of the fact that you are GOING to need to eat again - which means both bingeing and restricting are less powerful IMO. (Bingeing gets powerful because you are doing it mindlessly, not thinking about how you'll feel after - Restricting is super powerful when it comes to obsessing on food, because you are thinking that you may not eat again for a long time.  By realizing that you are promising yourself you can eat again in 4-6 hours - you hopefully take the power away from these two fears.)",
          "created_utc": 1693759149.0
        },
        {
          "id": "jz2vook",
          "author": "manders556",
          "body": "Yes--the Binge/restrict cycle is insane. Restriction is the #1 trigger for binging episodes for a reason. Even MENTAL restriction--food rules/food lables/viewing food as a number rather than fuel can be enough to trigger the scarcity mindset surrounding food. When we feel deprived, our bodies will always fight back against the threat of restriction and binging is the natural survival response to this.\n\nI would reccomemd not necessarily tracking ones intake because this can fuel onsessiveness surrounding food especially for people who already calorie count as an ED behavior--this can be triggering. I agree with the general concept of a food journal though! I think its important to work with a team on certain things in recovery and this is one of them. \n\nOnly a dietician can really help with identifying dietary needs and could help with meal planning and the relationship with food exploring emotions role as well. It was helpful for me to keep a specific ED recovery structured food journal where I don't list calories--reinforcing viewing food as numbers-but rather simply view food as food--food groups and exploring the thoughts and emotions associated with my eating experience vs to bring more awareness and where I'm at on hunger/fullness scale to identify hunger/fullness cues which can be hard when you have an ED and we lose hunger/fullness cues from restriction. \n\nExample:\n\nBreakfast: \n\n1. Cereal- carbs/starch- Brain functions mostly off of carbs. Carbs literally= brain food \n Milk- dairy\nBanana- fruit\nPeanut butter- fat \n\nBefore meal check in:\n\nThoughts/beliefs: I like cereal--no food judgments here. I used to be afraid of PB but now I know my body needs it and it tastes good\n\nHunger scale: I'm hungry af on hunger scale I'm at a 4--stomach nearly eating itself, growling \n\nFeelings: anxious going into meal\n\nMeal intention: stay present and complete meal\n\nAfter meal check in:\n\n Hunger scale: I'm at a 7--satisfied\n\nThoughts/beliefs about food: no guilt attached to food due to no more food rules but when PB was off limits I felt emmense guilt when letting myself have it. Now I eat it with no guilt but rather joy \n\nFeelings:  content",
          "created_utc": 1693825477.0
        }
      ]
    },
    {
      "id": "jz3wnut",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1693842503.0,
      "score": 2,
      "context": [
        {
          "id": "jz1325n",
          "author": "raeg14",
          "body": "Eat enough! Honor your hunger, then don’t restrict after. It’ll even out over time. DM me if you want, I didn’t want to type too much 💖",
          "created_utc": 1693789095.0
        },
        {
          "id": "jz2wkjq",
          "author": "manders556",
          "body": "Most people in early recovery don't have a great concept of what \"enough\" even means. This is why seeking a intuitive eating dietician specifically can be beneficial. Most people with EDs have a skewed and distorted view of food and need guidance, structure, and intervention from professionals with this aspect. \n\nI agree though! eat enough! Get a intuitive eating dietician that can help assist with educating on what is actually enough according to our individualized dietary needs.",
          "created_utc": 1693826039.0
        }
      ]
    },
    {
      "id": "jz6aegh",
      "author": "manders556",
      "body": "Yeah I thought i was overeating when really I was in fact undereating according to my dietician. It's crazy how distorted our perception can become. But also to be fair the stomach shrinks with restriction and so  two bites of food can feel like Thanksgiving dinner. It takes time for our bodies to adjust, but they do adjust.",
      "created_utc": 1693877176.0,
      "score": 2,
      "context": [
        {
          "id": "jz1325n",
          "author": "raeg14",
          "body": "Eat enough! Honor your hunger, then don’t restrict after. It’ll even out over time. DM me if you want, I didn’t want to type too much 💖",
          "created_utc": 1693789095.0
        },
        {
          "id": "jz2wkjq",
          "author": "manders556",
          "body": "Most people in early recovery don't have a great concept of what \"enough\" even means. This is why seeking a intuitive eating dietician specifically can be beneficial. Most people with EDs have a skewed and distorted view of food and need guidance, structure, and intervention from professionals with this aspect. \n\nI agree though! eat enough! Get a intuitive eating dietician that can help assist with educating on what is actually enough according to our individualized dietary needs.",
          "created_utc": 1693826039.0
        },
        {
          "id": "jz3wnut",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1693842503.0
        }
      ]
    }
  ]
}