{
  "id": "16e35pz",
  "subreddit": "EatingDisorders",
  "author": "designcentredhuman",
  "created_utc": 1694258174.0,
  "title": "Underweight daughter (11) feels fat and cries about it",
  "selftext": "This morning my daughter (11) shared with me that she feels fat all the time and cried about it too. The feeling started this summer.\n\nI already noticed she eats less and less (eg. skipping snack after school). She also regularly checks on her abs at random times.\n\nI'm very concerned as she is already very athletic because of the sports she does and had very little fat.\n\nWhat are some things we as parents:\n(1) should start doing\n(2) stop doing\n\nWe will also look for a therapist with my wife asap (in Toronto if anyone has recommendations).",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/16e35pz/underweight_daughter_11_feels_fat_and_cries_about/",
  "score": 207,
  "num_comments": 33,
  "comments": [
    {
      "id": "jzwu2vh",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1694318228.0,
      "score": 140,
      "context": []
    },
    {
      "id": "jzywc5r",
      "author": "Arachnid223",
      "body": "I’m 21, and I’ve had an ED since I was 10. The one thing I really wish my parents would stop doing was making ANY comment on what I was eating. It makes everything so much worse.",
      "created_utc": 1694356728.0,
      "score": 35,
      "context": []
    },
    {
      "id": "jzy74fa",
      "author": "lexlexlexx",
      "body": "I started showing signs of an ED at 11. Most likely, she is stressed/dealing with some form of anxiety or depression, and struggling with changing hormones/body that can feel super overwhelming. She needs support and curiosity related to any underlying emotional issues/life struggles, as well as alternative, positive outlets/coping mechanisms. \n\nAs far as triggers/struggles, the following comes to mind as possible.\n\nIf shes recently changed schools/friends/been rejected/done poorly in school, that could be a trigger. Sports and competition can be triggering environments as well where body types are scrutinized and compared in a way that young people can internalize.\n\nThere might be something she's experienced that you don't know about. Be curious and unconditionally supportive, but be attentive. I dont want to sound scary, but alot of SA victims struggle with eating disorders as a coping mechanism. Not saying this is it at all, just emphasizing the importance of asking questions and being curious about her life and the people in it.\n\nLead by example when it comes to food. Dont model any kind of restriction or mentioning foods as good/bad. Make sure she is eating her lunch at school. At that age, it was super easy for me to just dump my lunch in the trash with no one noticing. \n\nFeel free to DM me if you need someone to talk to. Im not a professional, but ive had an ED from 11 and was in treatment by 16. Am now 34 so have a few decades of personal insight i can share.\n\nLast thing, take care of yourself as well ♥️",
      "created_utc": 1694345602.0,
      "score": 17,
      "context": []
    },
    {
      "id": "jzyd7u8",
      "author": "None",
      "body": "i’m not a professional, but i am a teen girl who developed an ed around the age of 13, close to your daughter’s age.\n\nfirst, the fact that she told you how she felt about her body is already a better start than mine. i hid my ed out of shame and embarrassment, and to this day, i’m the only one who knows about it. it just means she trusts you, and judging by your concern, it’s clear you’re very caring parents.\n\nthe thing with ed’s is that she can’t recover unless she wants to. it’s difficult to get rid of the mindset, but unless she fixes that, it doesn’t matter how much weight she gains or loses, she’ll still be suffering mentally. i suggest seeing a therapist that specialises in eating disorders, not just a general one. make sure the therapist actually wants to work on her mental health and not just focus on her weight or body, as it would make it worse.\n\nfor what not to do, just make sure you aren’t labelling food or your bodies as good or bad. they’re all neutral things and are just apart of our lives. many children develop ed’s because of what they hear from adults around them — like dieting or ‘burning off’ food through exercise.\n\nyour daughter is very young and i’m sorry she has to go through this. i really wish the best for you and your daughter.",
      "created_utc": 1694348712.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jzylgt1",
      "author": "Dazzling-Okra-3346",
      "body": ">What are some things we as parents: (1) should start doing (2) stop doing\n\nDoes your wife body check herself or an older sister or brother?  it was a learned behavior for me to raise my shirt up and criticize. my older sister did it, and that is how i learned.\n\ndo not talk about food in a bad way. food is food. it is nutrition some food just has better nutrition. make sure you don't negatively talk about food.\n\nalso start telling her that she is more than her looks. never compliment her looks. compliment her compassion. compliment her intelligence.\n\neither way you are doing the right things. i wish you were my father when i was going through this.\n\nedit: instead my father shamed me quite a bit. the fact that you are being so compassionate tells me that this will end up being okay. \n\nalso anyone on her team's body checking? she learned it from someone at least i believe so",
      "created_utc": 1694352418.0,
      "score": 7,
      "context": []
    },
    {
      "id": "jzz18hd",
      "author": "Looony_Lovegood5",
      "body": "Number one she needs to be in therapy and potentially also meet with a registered dietitian who specializes in eating disorders. \nI would also be very aware of what the relationship to food is in your home as well. There should be absolutely no mention of good foods vs bad foods, foods that make you fat, saying something is unhealthy or bad for you, discussion of skinny vs fat. Do not pressure her to eat or overly monitor her food choices as this can start issues with control. I would be very aware of what adults she has interactions with. Are there grandparents who like to talk about weight around her, is mom talking about dieting, discussing her needing a bigger size in something, etc etc. Her peers may also be encouraging this as well.",
      "created_utc": 1694358524.0,
      "score": 4,
      "context": []
    },
    {
      "id": "jzzlzig",
      "author": "PrestigiousAd3461",
      "body": "No advice (what you and others have said about therapy and lifestyle changes is excellent), but I just wanted to commend you and your partner for being so vigilant. I'm so glad she has you, and I wish you all the best of luck working through this with her. It'll be hard and potentially lifelong work, but one day she'll able to see how lucky she is to have y'all! 😊❤️",
      "created_utc": 1694365851.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k01jtm7",
      "author": "whaledolphinately",
      "body": "definitely a therapist, and definitely provide extra verbal support and affirmations. also, anything negative you do/say about your own eating habits or body image can be super impactful for her.\n\ni recently had a very frank conversation with my mother about how in my 31 years on this earth i have never heard her say anything positive about herself, her eating habits, or how she perceives her body. it can be really detrimental to kids to have parents who consistently talk down about themselves and their bodies but expect their kids to love their own bodies. we lead by example.\n\njust something to think about!",
      "created_utc": 1694390947.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k00425j",
      "author": "skinnythinmint_LU",
      "body": "she sounds like she has a full blown eating disorder and body dysmorphia sadly. definitely get her into therapy asap and make sure it’s someone she likes. It can take time to find the right person so don’t just go with whoever. Also social media is fuel to the fire and you should severely limit her access. That’s how kids today are getting their ideas about their bodies being inadequate.",
      "created_utc": 1694372173.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k01y1ty",
      "author": "thismindhurts",
      "body": "You are very right and a wonderful parent to show concern. Personally speaking my AN onset at 8 y/o and wasn’t diagnosed until 12 because professionals were convinced I was too young and/or would outgrow it. I work in the field currently and each day I am reminded that I am far from the only one who suffered so young. If you can at all consider professional treatment (it isn’t one I’ve worked with personally or professionally but I hear phenomenal things about) I would check out Clementine. They are a Monte Nido affiliate and are fantastic with the kiddos. While a therapist or psychiatrist are an awesome start, it’s possible she might benefit from a higher level of care (like a day program) with sooner intervention https://clementineprograms.com",
      "created_utc": 1694396708.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k03wcnv",
      "author": "Sisterlauren",
      "body": "Honestly the fact she told you is a massive compliment to yourself 😊. My mum just screamed at me until I told her lol. \nAnyways not about me. You are being a fantastic mum clearly for the reason alone she felt safe to tell you. My main suggestion is to get her to a therapist asap like most people have suggested. Also as hard as it is be patient, getting angry almost makes people want to self harm/starve themselves more as a way of ‘payback’. Being kind and patient which you are already doing will play a huge part in her recovery.\nI am so sorry also, 11 is terribly young 😢",
      "created_utc": 1694439171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k0a3mhd",
      "author": "None",
      "body": "As a parent with a teen in recovery from restrictive anorexia I think you are right to be concerned. Food is medicine for recovery. When looking for a therapist please make sure they are specialized in eating disorders. Unfortunately, in Canada there is not a lot of resources for higher level of care. FBT ( family based treatment) is the only proven method for helping eating disorders in children and teens. Look into Eva Musby books and You tube videos with help to get her to eat. 3 meals and 3 snacks are the goal if she is medically stable. Unfortunately, recovery is a marathon not a sprint. Private message if you have questions. The earlier this is addressed the better. And as a bit of hope, my child is doing incredible after being hospitalized with a feeding tube and spending months in residential care over a year ago.",
      "created_utc": 1694537731.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k0ba6km",
      "author": "Heartfr0st",
      "body": "I'd argue that her telling you isn't alarming, it's a blessing.  She clearly genuinely trusts you, which can't be said for a lot of kids.  And her reaching out to you has given you important information you need to continue supporting her and nurturing that trust.\n\n\n\nHere's my actual advice:\n\nFind her a therapist that SPECIALIZES IN EATING DISORDERS.  Seriously that is so important I cannot stress that part enough.  Also be flexible to change therapists if your daughter says things aren't working.  Learn as much as you can about eating disorders from reliable sources.  Maybe have a couple group therapy sessions, not for therapy but for educational purposes.  Also, this subreddit may look like a chaotic mess, but it's a very good peek into how bad EDs can distort how we view things.  There's many posts talking about how they wish their parents did/didn't do/say xyz.  Work SO hard on changing how you talk to her.  Stop any mentions about her body (telling her she's pretty as is or is skinny or healthy will NOT help), don't comment on anyone else's body (positive or negative), don't discuss or argue about how much she's eating (or other people's eating habits), don't talk about food in general in terms of quantity or calories, and don't shame her for any strange habits you notice.  First instinct will be to try and stop bad habits as soon as possible when they appear, but that could easily lead to her hiding habits from you.\n\nYou have been given a gift.  You clearly care a lot about your daughter, so know that you have a lot of hard work ahead of you, and it will be mentally and emotionally taxing.  But she reached out and showed an immense amount of trust towards you... prove to her that the trust is well deserved.\n\n\n.\n\nI originally had these flipped, but the advice is more important than my anecdotes.  The below is my story.  It shows what a good support system looks like, and how much of a difference it can make:\n\n\nI was 23(?) when mine started, it was kinda like a switch flipped.  It sounds strange, but I could feel like a whole mental and bodily awareness shift.  As soon as I figured out what was happening to me, I reached out to the people I trusted most and told them.  That group did not include my family, and my parents still don't know I went through this.\n\nI told this group what was happening because I knew they would support me, that they wouldn't judge me, but that they would also step in and do something if things got bad.  I probably had one of the best experiences of an eating disorder in terms of support.  My friends did their best to understand, and accepted and acknowledged when they didn't understand.  They accommodated my strange eating habits, but lightly encouraged me to eat just one more bite if I could.  When I went bulimic, they didn't judge me for what is frankly a disgusting habit (we know it's gross, no need to tell us), but would hug me and say it was okay and that we would try to make tomorrow a better day.\n\nThey NEVER brought up the ED unless they saw something worrying.  They let ME initiate conversations about the disorder, which helped me feel safe and that I could share as much information as I wanted up to my comfort level.  At a certain point, I was working on separating my thoughts from the irrational eating disorder thoughts and my friends dubbed the eating disorder \"bitch brain\", so we could make fun of the thoughts as a separate entity from myself.  This was actually so helpful, but I had to be able to separate those thoughts first.  They never leapt on behaviors as being \"bitch brain\", most of the time they waited until I recognized a thought as being irrational before adding it to the \"bitch brain\" list.\n\nI was never forced into therapy or recovery, but the immense support I received was instrumental in my own decision to get help.  There was nothing but love and support and patience from my friends.  I ended up mostly recovered after about 2-2.5 years, and I'd say I'm fully recovered now 5.5 years later.  Thoughts do come back, but I can recognize them and dismiss them.",
      "created_utc": 1694552348.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k218lva",
      "author": "None",
      "body": "Buy her an Nice bike offroad one take her bikini dont mention thought behind it give her the idea she love baking and she love fitness",
      "created_utc": 1695583410.0,
      "score": 1,
      "context": []
    },
    {
      "id": "jzx2vez",
      "author": "designcentredhuman",
      "body": "Thank you, we are looking for a therapist asap. \n\nThe reason this is so alarming is the fact that she opened up about it: she is usually super private.",
      "created_utc": 1694323175.0,
      "score": 73,
      "context": [
        {
          "id": "jzwu2vh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1694318228.0
        }
      ]
    },
    {
      "id": "k00gr41",
      "author": "rcarman87",
      "body": "This. Language around food and eating and bodies impacts young minds more than people can imagine. I developed my ED at 8 due to hyper critical environments.",
      "created_utc": 1694376480.0,
      "score": 7,
      "context": [
        {
          "id": "jzywc5r",
          "author": "Arachnid223",
          "body": "I’m 21, and I’ve had an ED since I was 10. The one thing I really wish my parents would stop doing was making ANY comment on what I was eating. It makes everything so much worse.",
          "created_utc": 1694356728.0
        }
      ]
    },
    {
      "id": "jzy7xgm",
      "author": "lexlexlexx",
      "body": "Also something that comes to mind is when people talk about EDs being about \"control\", I think that can be a bit vague.\n\nThere is a power struggle as you come into your own around middle school age that somewhat coincides with bodily changes that are massive.\n\nAllowing some level of autonomy in her choices, plans for the future, goals, activities and interests can help, obviously within the bounds of whatever your parenting style is! \n\nIt all depends on the root cause, but I thought this was worth mentioning. \n\nMy therapist said to me at 16 that my problems were like steam in a pipe with a closed lid. Eventually, a crack (ED) would form. I could cover the crack, but another would inevitably form (addiction, depression, etc) if i didnt figure out how to open the lid and let the steam out. \n\nHelps to understand that its the steam that needs to be let out, not the crack that needs covering.",
      "created_utc": 1694346032.0,
      "score": 8,
      "context": [
        {
          "id": "jzy74fa",
          "author": "lexlexlexx",
          "body": "I started showing signs of an ED at 11. Most likely, she is stressed/dealing with some form of anxiety or depression, and struggling with changing hormones/body that can feel super overwhelming. She needs support and curiosity related to any underlying emotional issues/life struggles, as well as alternative, positive outlets/coping mechanisms. \n\nAs far as triggers/struggles, the following comes to mind as possible.\n\nIf shes recently changed schools/friends/been rejected/done poorly in school, that could be a trigger. Sports and competition can be triggering environments as well where body types are scrutinized and compared in a way that young people can internalize.\n\nThere might be something she's experienced that you don't know about. Be curious and unconditionally supportive, but be attentive. I dont want to sound scary, but alot of SA victims struggle with eating disorders as a coping mechanism. Not saying this is it at all, just emphasizing the importance of asking questions and being curious about her life and the people in it.\n\nLead by example when it comes to food. Dont model any kind of restriction or mentioning foods as good/bad. Make sure she is eating her lunch at school. At that age, it was super easy for me to just dump my lunch in the trash with no one noticing. \n\nFeel free to DM me if you need someone to talk to. Im not a professional, but ive had an ED from 11 and was in treatment by 16. Am now 34 so have a few decades of personal insight i can share.\n\nLast thing, take care of yourself as well ♥️",
          "created_utc": 1694345602.0
        }
      ]
    },
    {
      "id": "jzyvij4",
      "author": "designcentredhuman",
      "body": "Body checking such a fitting phrase. We never do that, but she very often lifts her t-shirt and checks her abs.\n\nI hope it will be okay, thank you for the encouragement. I'm sure we mishandle a lot of things too as parents. This whole thing might come from me: I'm the one who talked about my overweight and healthy foods. I stop of course now.",
      "created_utc": 1694356414.0,
      "score": 6,
      "context": [
        {
          "id": "jzylgt1",
          "author": "Dazzling-Okra-3346",
          "body": ">What are some things we as parents: (1) should start doing (2) stop doing\n\nDoes your wife body check herself or an older sister or brother?  it was a learned behavior for me to raise my shirt up and criticize. my older sister did it, and that is how i learned.\n\ndo not talk about food in a bad way. food is food. it is nutrition some food just has better nutrition. make sure you don't negatively talk about food.\n\nalso start telling her that she is more than her looks. never compliment her looks. compliment her compassion. compliment her intelligence.\n\neither way you are doing the right things. i wish you were my father when i was going through this.\n\nedit: instead my father shamed me quite a bit. the fact that you are being so compassionate tells me that this will end up being okay. \n\nalso anyone on her team's body checking? she learned it from someone at least i believe so",
          "created_utc": 1694352418.0
        }
      ]
    },
    {
      "id": "jzzsefv",
      "author": "Great_idea_fellow",
      "body": "I agree I have said and still say when \"ed\" is really getting to me that I feel \"fat\" no one in my childhood ever noticed that as a sign of me having an eating disorder and even in recovery I am still working on remembering fat is not a feeling but in those moments it totally feels that way.",
      "created_utc": 1694368099.0,
      "score": 2,
      "context": [
        {
          "id": "jzzlzig",
          "author": "PrestigiousAd3461",
          "body": "No advice (what you and others have said about therapy and lifestyle changes is excellent), but I just wanted to commend you and your partner for being so vigilant. I'm so glad she has you, and I wish you all the best of luck working through this with her. It'll be hard and potentially lifelong work, but one day she'll able to see how lucky she is to have y'all! 😊❤️",
          "created_utc": 1694365851.0
        }
      ]
    },
    {
      "id": "k05d7pa",
      "author": "designcentredhuman",
      "body": "Thanks, definitely something we can improve upon.",
      "created_utc": 1694458752.0,
      "score": 2,
      "context": [
        {
          "id": "k01jtm7",
          "author": "whaledolphinately",
          "body": "definitely a therapist, and definitely provide extra verbal support and affirmations. also, anything negative you do/say about your own eating habits or body image can be super impactful for her.\n\ni recently had a very frank conversation with my mother about how in my 31 years on this earth i have never heard her say anything positive about herself, her eating habits, or how she perceives her body. it can be really detrimental to kids to have parents who consistently talk down about themselves and their bodies but expect their kids to love their own bodies. we lead by example.\n\njust something to think about!",
          "created_utc": 1694390947.0
        }
      ]
    },
    {
      "id": "k06etym",
      "author": "Sporknut",
      "body": "Yes. Regardless of what I click on, follow, or block, I still get pro-diet propaganda.\n\nSocial media feeds on insecurities. Diet, “wellness,” and other exercise influencers are some of the biggest money makers. \n\nThe only way I’ve found to remove the triggers from social media is to remove social media from my life entirely.",
      "created_utc": 1694472460.0,
      "score": 3,
      "context": [
        {
          "id": "k00425j",
          "author": "skinnythinmint_LU",
          "body": "she sounds like she has a full blown eating disorder and body dysmorphia sadly. definitely get her into therapy asap and make sure it’s someone she likes. It can take time to find the right person so don’t just go with whoever. Also social media is fuel to the fire and you should severely limit her access. That’s how kids today are getting their ideas about their bodies being inadequate.",
          "created_utc": 1694372173.0
        }
      ]
    },
    {
      "id": "k05cut7",
      "author": "designcentredhuman",
      "body": "Thank you, it looks awesome but we are in Canada unfortunately.",
      "created_utc": 1694458627.0,
      "score": 1,
      "context": [
        {
          "id": "k01y1ty",
          "author": "thismindhurts",
          "body": "You are very right and a wonderful parent to show concern. Personally speaking my AN onset at 8 y/o and wasn’t diagnosed until 12 because professionals were convinced I was too young and/or would outgrow it. I work in the field currently and each day I am reminded that I am far from the only one who suffered so young. If you can at all consider professional treatment (it isn’t one I’ve worked with personally or professionally but I hear phenomenal things about) I would check out Clementine. They are a Monte Nido affiliate and are fantastic with the kiddos. While a therapist or psychiatrist are an awesome start, it’s possible she might benefit from a higher level of care (like a day program) with sooner intervention https://clementineprograms.com",
          "created_utc": 1694396708.0
        }
      ]
    },
    {
      "id": "k05bbxz",
      "author": "designcentredhuman",
      "body": "Thank you! I'm the dad, but mom is heavily involved too.",
      "created_utc": 1694458094.0,
      "score": 1,
      "context": [
        {
          "id": "k03wcnv",
          "author": "Sisterlauren",
          "body": "Honestly the fact she told you is a massive compliment to yourself 😊. My mum just screamed at me until I told her lol. \nAnyways not about me. You are being a fantastic mum clearly for the reason alone she felt safe to tell you. My main suggestion is to get her to a therapist asap like most people have suggested. Also as hard as it is be patient, getting angry almost makes people want to self harm/starve themselves more as a way of ‘payback’. Being kind and patient which you are already doing will play a huge part in her recovery.\nI am so sorry also, 11 is terribly young 😢",
          "created_utc": 1694439171.0
        }
      ]
    },
    {
      "id": "k03wmz9",
      "author": "Sisterlauren",
      "body": "Forgot to add, I would recommend not saying anything about the portions she is eating whether they are large or small, especially the former. And nothing about nutrition content. I know it’s a huge thing to deal with but just know you have a bunch of internet strangers to talk to 😊",
      "created_utc": 1694439297.0,
      "score": 1,
      "context": [
        {
          "id": "k03wcnv",
          "author": "Sisterlauren",
          "body": "Honestly the fact she told you is a massive compliment to yourself 😊. My mum just screamed at me until I told her lol. \nAnyways not about me. You are being a fantastic mum clearly for the reason alone she felt safe to tell you. My main suggestion is to get her to a therapist asap like most people have suggested. Also as hard as it is be patient, getting angry almost makes people want to self harm/starve themselves more as a way of ‘payback’. Being kind and patient which you are already doing will play a huge part in her recovery.\nI am so sorry also, 11 is terribly young 😢",
          "created_utc": 1694439171.0
        }
      ]
    },
    {
      "id": "k218sfi",
      "author": "None",
      "body": "She learn bikini gives her genetical possibility to keep thin and ect",
      "created_utc": 1695583471.0,
      "score": 1,
      "context": [
        {
          "id": "k218lva",
          "author": "None",
          "body": "Buy her an Nice bike offroad one take her bikini dont mention thought behind it give her the idea she love baking and she love fitness",
          "created_utc": 1695583410.0
        }
      ]
    },
    {
      "id": "jzx6q63",
      "author": "the_cadaver_synod",
      "body": "If she is opening up now, it’s probably because she’s already feeling overwhelmed by something. \n\nI don’t know your daughter, I don’t know if she has an ED. But I want to thank you for being an aware and informed parent. I had very progressive and involved parents who just missed the signs, and were not particularly kind when I became obviously sick.",
      "created_utc": 1694325657.0,
      "score": 49,
      "context": [
        {
          "id": "jzwu2vh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1694318228.0
        },
        {
          "id": "jzx2vez",
          "author": "designcentredhuman",
          "body": "Thank you, we are looking for a therapist asap. \n\nThe reason this is so alarming is the fact that she opened up about it: she is usually super private.",
          "created_utc": 1694323175.0
        }
      ]
    },
    {
      "id": "jzz2fc6",
      "author": "blondiesdiary",
      "body": "I feel like I can relate a lot to your daughter just from the little bit that you’ve shared. I’m 24 now, & can’t offer much advise more than what everyone else is. Therapy is huge. Weekly sessions are probably the best to start out. \n\nI was a super private kid as well & by the time I opened up to my parents about my ED, it was because I was getting scared of how deep I’d gotten myself so quickly. \nI’m not saying this to scare you, I just want to share because she may be deeper than anyone realizes. I really hope she’s not. But I can tell you that your showing you care by getting her help as soon as she came to you is HUGE. I was scared my mom was going to brush me off, but when she immediately started researching to get me treatment it reassured me I did the right thing in telling her. \nIt was also super helpful for me to have a family therapy session after I’d gotten used to my therapist- I was able to tell my parents what my triggers were and how they could support me!",
      "created_utc": 1694358916.0,
      "score": 6,
      "context": [
        {
          "id": "jzwu2vh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1694318228.0
        },
        {
          "id": "jzx2vez",
          "author": "designcentredhuman",
          "body": "Thank you, we are looking for a therapist asap. \n\nThe reason this is so alarming is the fact that she opened up about it: she is usually super private.",
          "created_utc": 1694323175.0
        }
      ]
    },
    {
      "id": "jzyu3td",
      "author": "designcentredhuman",
      "body": "The steam pipe is a great picture. I hope we can find her a similarly great therapist.\n\nI'll try to have her talk and listen as much as possible to figure out the root cause, but she's super private usually and I need to avoid her shutting down.\n\nBoth her best friends left her school (graduated to middle school, were olden than her). And she also cried about not liking school and how the girls who are in her class are all very good friends with each other but not with her.\nCould this be this distressing on its own?\n\nI really want a professional to deal with this though. I'm worried that we would do more harm  than good by trying to fix this on our own.",
      "created_utc": 1694355853.0,
      "score": 2,
      "context": [
        {
          "id": "jzy74fa",
          "author": "lexlexlexx",
          "body": "I started showing signs of an ED at 11. Most likely, she is stressed/dealing with some form of anxiety or depression, and struggling with changing hormones/body that can feel super overwhelming. She needs support and curiosity related to any underlying emotional issues/life struggles, as well as alternative, positive outlets/coping mechanisms. \n\nAs far as triggers/struggles, the following comes to mind as possible.\n\nIf shes recently changed schools/friends/been rejected/done poorly in school, that could be a trigger. Sports and competition can be triggering environments as well where body types are scrutinized and compared in a way that young people can internalize.\n\nThere might be something she's experienced that you don't know about. Be curious and unconditionally supportive, but be attentive. I dont want to sound scary, but alot of SA victims struggle with eating disorders as a coping mechanism. Not saying this is it at all, just emphasizing the importance of asking questions and being curious about her life and the people in it.\n\nLead by example when it comes to food. Dont model any kind of restriction or mentioning foods as good/bad. Make sure she is eating her lunch at school. At that age, it was super easy for me to just dump my lunch in the trash with no one noticing. \n\nFeel free to DM me if you need someone to talk to. Im not a professional, but ive had an ED from 11 and was in treatment by 16. Am now 34 so have a few decades of personal insight i can share.\n\nLast thing, take care of yourself as well ♥️",
          "created_utc": 1694345602.0
        },
        {
          "id": "jzy7xgm",
          "author": "lexlexlexx",
          "body": "Also something that comes to mind is when people talk about EDs being about \"control\", I think that can be a bit vague.\n\nThere is a power struggle as you come into your own around middle school age that somewhat coincides with bodily changes that are massive.\n\nAllowing some level of autonomy in her choices, plans for the future, goals, activities and interests can help, obviously within the bounds of whatever your parenting style is! \n\nIt all depends on the root cause, but I thought this was worth mentioning. \n\nMy therapist said to me at 16 that my problems were like steam in a pipe with a closed lid. Eventually, a crack (ED) would form. I could cover the crack, but another would inevitably form (addiction, depression, etc) if i didnt figure out how to open the lid and let the steam out. \n\nHelps to understand that its the steam that needs to be let out, not the crack that needs covering.",
          "created_utc": 1694346032.0
        }
      ]
    },
    {
      "id": "k07szo2",
      "author": "skinnythinmint_LU",
      "body": "yeah & also little girls will follow a bunch of popular social media stars that have skinny bodies and edit their photos (I’ve been there personally)",
      "created_utc": 1694493996.0,
      "score": 2,
      "context": [
        {
          "id": "k00425j",
          "author": "skinnythinmint_LU",
          "body": "she sounds like she has a full blown eating disorder and body dysmorphia sadly. definitely get her into therapy asap and make sure it’s someone she likes. It can take time to find the right person so don’t just go with whoever. Also social media is fuel to the fire and you should severely limit her access. That’s how kids today are getting their ideas about their bodies being inadequate.",
          "created_utc": 1694372173.0
        },
        {
          "id": "k06etym",
          "author": "Sporknut",
          "body": "Yes. Regardless of what I click on, follow, or block, I still get pro-diet propaganda.\n\nSocial media feeds on insecurities. Diet, “wellness,” and other exercise influencers are some of the biggest money makers. \n\nThe only way I’ve found to remove the triggers from social media is to remove social media from my life entirely.",
          "created_utc": 1694472460.0
        }
      ]
    },
    {
      "id": "k05bmmz",
      "author": "designcentredhuman",
      "body": "There's a fb group for parents with anorexia where the main message we received is almost forced re-feeding, with a carrot and stick approach. It goes directly agains the advice we got here (not talking about portions, not being pushy, etc). What's your opinion? Am I misreading one or the other?",
      "created_utc": 1694458200.0,
      "score": 1,
      "context": [
        {
          "id": "k03wcnv",
          "author": "Sisterlauren",
          "body": "Honestly the fact she told you is a massive compliment to yourself 😊. My mum just screamed at me until I told her lol. \nAnyways not about me. You are being a fantastic mum clearly for the reason alone she felt safe to tell you. My main suggestion is to get her to a therapist asap like most people have suggested. Also as hard as it is be patient, getting angry almost makes people want to self harm/starve themselves more as a way of ‘payback’. Being kind and patient which you are already doing will play a huge part in her recovery.\nI am so sorry also, 11 is terribly young 😢",
          "created_utc": 1694439171.0
        },
        {
          "id": "k03wmz9",
          "author": "Sisterlauren",
          "body": "Forgot to add, I would recommend not saying anything about the portions she is eating whether they are large or small, especially the former. And nothing about nutrition content. I know it’s a huge thing to deal with but just know you have a bunch of internet strangers to talk to 😊",
          "created_utc": 1694439297.0
        }
      ]
    },
    {
      "id": "jzyrduh",
      "author": "designcentredhuman",
      "body": "You are really kind. We might have missed the signs for ASD/ADHD, dragged our feet with getting her assessed, and life might got a bit too overwhelming for her in her pre-teens without the support she needed. We'll see.",
      "created_utc": 1694354761.0,
      "score": 22,
      "context": [
        {
          "id": "jzwu2vh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1694318228.0
        },
        {
          "id": "jzx2vez",
          "author": "designcentredhuman",
          "body": "Thank you, we are looking for a therapist asap. \n\nThe reason this is so alarming is the fact that she opened up about it: she is usually super private.",
          "created_utc": 1694323175.0
        },
        {
          "id": "jzx6q63",
          "author": "the_cadaver_synod",
          "body": "If she is opening up now, it’s probably because she’s already feeling overwhelmed by something. \n\nI don’t know your daughter, I don’t know if she has an ED. But I want to thank you for being an aware and informed parent. I had very progressive and involved parents who just missed the signs, and were not particularly kind when I became obviously sick.",
          "created_utc": 1694325657.0
        }
      ]
    },
    {
      "id": "jzyvkgg",
      "author": "lexlexlexx",
      "body": "Sounds like you're a great parent and know some of the potential triggers already.\n\nI was in a very similar position at that age, was in a new school with no close friends, all the girls had been together for years and i just always felt lonely and left out. This also led to some bullying.\n\nThis kind of stuff I think can drive us inwards as humans, seeking comfort in our inner world and of our own control/creation. When i am stressed/lonely/rejected, it is always easier to think about food and diet than my loneliness or problems.\n\nLet her know you see her, and help her find solutions to feeling left out or lonely. That will look different for everyone. \n\nA therapist should be able to help the process, though keep in mind it takes a few sessions to build rapport, so dont expect miracle results right away! It takes time.\n\nYou're doing the right thing: recognizing that she could be developing a behavioral issue that is best treated by professionals. A therapist can assess and give you some concrete steps, and early treatment/support is key.\n\nI also recommend seeking a therapist who specializes in eating disorders!",
      "created_utc": 1694356435.0,
      "score": 3,
      "context": [
        {
          "id": "jzy74fa",
          "author": "lexlexlexx",
          "body": "I started showing signs of an ED at 11. Most likely, she is stressed/dealing with some form of anxiety or depression, and struggling with changing hormones/body that can feel super overwhelming. She needs support and curiosity related to any underlying emotional issues/life struggles, as well as alternative, positive outlets/coping mechanisms. \n\nAs far as triggers/struggles, the following comes to mind as possible.\n\nIf shes recently changed schools/friends/been rejected/done poorly in school, that could be a trigger. Sports and competition can be triggering environments as well where body types are scrutinized and compared in a way that young people can internalize.\n\nThere might be something she's experienced that you don't know about. Be curious and unconditionally supportive, but be attentive. I dont want to sound scary, but alot of SA victims struggle with eating disorders as a coping mechanism. Not saying this is it at all, just emphasizing the importance of asking questions and being curious about her life and the people in it.\n\nLead by example when it comes to food. Dont model any kind of restriction or mentioning foods as good/bad. Make sure she is eating her lunch at school. At that age, it was super easy for me to just dump my lunch in the trash with no one noticing. \n\nFeel free to DM me if you need someone to talk to. Im not a professional, but ive had an ED from 11 and was in treatment by 16. Am now 34 so have a few decades of personal insight i can share.\n\nLast thing, take care of yourself as well ♥️",
          "created_utc": 1694345602.0
        },
        {
          "id": "jzy7xgm",
          "author": "lexlexlexx",
          "body": "Also something that comes to mind is when people talk about EDs being about \"control\", I think that can be a bit vague.\n\nThere is a power struggle as you come into your own around middle school age that somewhat coincides with bodily changes that are massive.\n\nAllowing some level of autonomy in her choices, plans for the future, goals, activities and interests can help, obviously within the bounds of whatever your parenting style is! \n\nIt all depends on the root cause, but I thought this was worth mentioning. \n\nMy therapist said to me at 16 that my problems were like steam in a pipe with a closed lid. Eventually, a crack (ED) would form. I could cover the crack, but another would inevitably form (addiction, depression, etc) if i didnt figure out how to open the lid and let the steam out. \n\nHelps to understand that its the steam that needs to be let out, not the crack that needs covering.",
          "created_utc": 1694346032.0
        },
        {
          "id": "jzyu3td",
          "author": "designcentredhuman",
          "body": "The steam pipe is a great picture. I hope we can find her a similarly great therapist.\n\nI'll try to have her talk and listen as much as possible to figure out the root cause, but she's super private usually and I need to avoid her shutting down.\n\nBoth her best friends left her school (graduated to middle school, were olden than her). And she also cried about not liking school and how the girls who are in her class are all very good friends with each other but not with her.\nCould this be this distressing on its own?\n\nI really want a professional to deal with this though. I'm worried that we would do more harm  than good by trying to fix this on our own.",
          "created_utc": 1694355853.0
        }
      ]
    },
    {
      "id": "k05x3i2",
      "author": "Sisterlauren",
      "body": "So sorry for calling you the mum think I was half asleep when I was posting that.  \nI guess it depends on the child as she is so young but I just know whenever there was any ‘force’ involved it made me more determined to not eat if that makes sense. But that force was done with anger. Then again my mum was a big part of the cause of my Ed so it could be completely different in your daughters case. \n\nObviously I understand you can’t just watch your daughter starve herself so kind encouragement and support will be detrimental. To be honest it sounds like you and your wife are already doing an excellent job so she has the best chance already 😊 \nHopefully with therapy she can find out what’s causing all these horrible perceptions of herself but I wish you all the best of luck 🤞",
      "created_utc": 1694465715.0,
      "score": 1,
      "context": [
        {
          "id": "k03wcnv",
          "author": "Sisterlauren",
          "body": "Honestly the fact she told you is a massive compliment to yourself 😊. My mum just screamed at me until I told her lol. \nAnyways not about me. You are being a fantastic mum clearly for the reason alone she felt safe to tell you. My main suggestion is to get her to a therapist asap like most people have suggested. Also as hard as it is be patient, getting angry almost makes people want to self harm/starve themselves more as a way of ‘payback’. Being kind and patient which you are already doing will play a huge part in her recovery.\nI am so sorry also, 11 is terribly young 😢",
          "created_utc": 1694439171.0
        },
        {
          "id": "k03wmz9",
          "author": "Sisterlauren",
          "body": "Forgot to add, I would recommend not saying anything about the portions she is eating whether they are large or small, especially the former. And nothing about nutrition content. I know it’s a huge thing to deal with but just know you have a bunch of internet strangers to talk to 😊",
          "created_utc": 1694439297.0
        },
        {
          "id": "k05bmmz",
          "author": "designcentredhuman",
          "body": "There's a fb group for parents with anorexia where the main message we received is almost forced re-feeding, with a carrot and stick approach. It goes directly agains the advice we got here (not talking about portions, not being pushy, etc). What's your opinion? Am I misreading one or the other?",
          "created_utc": 1694458200.0
        }
      ]
    },
    {
      "id": "jzzjrlw",
      "author": "cetaceansituation",
      "body": "Oof, this hit home. I'm in my 30s and have recently realized that my parents may have also missed this with me (I'm getting assessed in a few weeks). My disordered eating started before I was even in school and they also missed that/ignored it. As a result of both of those things, my life has been obliterated and I'm now in and out of hospitals and am on disability. My parents believe mental health is a sham and that people are being \"unnecessarily labled,\" but this could have been prevented or mitigated by them actually paying attention to their daughter. \n\nI'd never have felt comfortable going to them with my struggles. That your daughter does means you're doing something tremendously right. Thank you for listening to her needs and seeking to inform yourself on what she's going through. The world could use more parents like you. A+",
      "created_utc": 1694365027.0,
      "score": 10,
      "context": [
        {
          "id": "jzwu2vh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1694318228.0
        },
        {
          "id": "jzx2vez",
          "author": "designcentredhuman",
          "body": "Thank you, we are looking for a therapist asap. \n\nThe reason this is so alarming is the fact that she opened up about it: she is usually super private.",
          "created_utc": 1694323175.0
        },
        {
          "id": "jzx6q63",
          "author": "the_cadaver_synod",
          "body": "If she is opening up now, it’s probably because she’s already feeling overwhelmed by something. \n\nI don’t know your daughter, I don’t know if she has an ED. But I want to thank you for being an aware and informed parent. I had very progressive and involved parents who just missed the signs, and were not particularly kind when I became obviously sick.",
          "created_utc": 1694325657.0
        },
        {
          "id": "jzyrduh",
          "author": "designcentredhuman",
          "body": "You are really kind. We might have missed the signs for ASD/ADHD, dragged our feet with getting her assessed, and life might got a bit too overwhelming for her in her pre-teens without the support she needed. We'll see.",
          "created_utc": 1694354761.0
        }
      ]
    }
  ]
}