{
  "id": "16pwm20",
  "subreddit": "EatingDisorders",
  "author": "Financial_Run_8902",
  "created_utc": 1695448971.0,
  "title": "I don’t even care if I’m fat or skinny anymore I just want to eat normal",
  "selftext": "I honestly don’t even mind being one way or the other. I just don’t want to think about food anymore. At least not feel like I need to either starve or devour.\nI want to eat when I’m hungry maybe eat a dessert or snack if I want to and so what.\nJust enjoy life because it’s killing me. I don’t want to care so much anymore, I don’t want to think about every morsel of food that enters my mouth anymore or every bit of food that doesn’t.\nJust let me be normal no more diets because every second of my time and energy goes into worrying about it. Please tell me how to just not care.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/16pwm20/i_dont_even_care_if_im_fat_or_skinny_anymore_i/",
  "score": 84,
  "num_comments": 13,
  "comments": [
    {
      "id": "k1wgxxo",
      "author": "mindfullymoving",
      "body": "I remember saying this to myself. You sound SO much like where I was about 4 years ago.\nI was starving or stuffed. Either restricting or binging. Always thinking of food and meal plans and recipes and diets and workouts. \n\nI had friends who just “ate when they were hungry and stopped when they were full” and I absolutely could not wrap my head around that. I desperately wanted to be normal and free.\n\nI worked HARD on full recovery and am so glad I did because that normalcy and freedom is so worth it.\n\nA lot of people ask me how and that question is almost impossible to answer because it wasn’t one thing. It was 18 months of building upon strategies and foundations and mindset and behaviour changes that were different every day.\n\nHaving help through the process was definitely imperative to my success. And I know that if you want to and are willing to put in work you can get there too 💖",
      "created_utc": 1695501273.0,
      "score": 19,
      "context": []
    },
    {
      "id": "k1zoq4o",
      "author": "worcestershire_pie",
      "body": "Truth. Having a disordered mindset around something as normal and important as food is excruciating. Food is everywhere. We need it to survive. But for some reason our brains see it as the enemy, even though we'll literally die if we don't consume it. So we have no idea how to approach the normalcy that resides in it, and it's exhausting.",
      "created_utc": 1695563062.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k1whm6l",
      "author": "RisingPhoenix603",
      "body": "I FEEEL THIS! I keep saying it. I just want to be normal. A ED is the worst thing I have ever experienced. People say oh just eat or you can eat…..ummm no my brain doesn’t work that way. I’m so dam tired! Sooooo tired",
      "created_utc": 1695501517.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k1wdcef",
      "author": "Interesting-Cow8131",
      "body": "I wish I knew! I think about food constantly. In what I feel safe eating for the day. Telling myself I have to eat or it's okay to ear, not berate myself for eating \"too much\".",
      "created_utc": 1695499901.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k1zlnw0",
      "author": "InvestigatorCheap489",
      "body": "It sounds like you’re inching towards recovery. 👏🏼 This was what the beginning of recovery looked like for me. Just being so absolutely exhausted from the ED thoughts running through my mind non-stop that I reached a point where I would do almost anything to get them to stop. The question I was really caught up on was, “How do I CHOOSE to get better from something I’m not CHOOSING to do (in my case - restrict)?”\n\nYour question is similar… How do you just not care? You NEED to care, but about different things. You have to care more than you have ever cared about anything. You need to care about your physical health and believe that your behaviors are harmful (HINT: they are… no matter what your body size!) You need to care about your loved ones and the affect this is/will have on them if you continue to spiral deeper into the ED - which you will. EDs don’t maintain, they get better or they get worse. If you aren’t actively working towards getting better, then the ED is growing stronger. You have to care so much about your own mental health/peace of mind/happiness/future that you don’t give a fuck what anyone else thinks or says about your physical body. Notice I didn’t say you have to love your body - you don’t. You just have to love the rest of you so much that you begin to believe your body is the least important thing about you. When I began to see that the eating disorder was destroying all the things that make me who I am, all the things that I value and add to society, I began to shift what I cared about most. \n\nI big part of recovery, for me, has been accepting the ED as a part of me and as a part of my story. It was hard to get rid of something that I kept trying to convince myself wasn’t real. I was scared of the judgement of others if I gained weight. I had to believe that the people in my life who truly love and support me would rather see me gain an insane amount of weight and be happy than see me skinny and miserable. \n\nRecovery isn’t just about not caring if you’re fat or skinny. It is about caring so much about other things (besides you body) - your health/life, your future, your happiness, those who love you, those who need the fully nourished version of you who has something worthwhile to offer - that you choose to get better, regardless of how you feel about your body.",
      "created_utc": 1695561693.0,
      "score": 5,
      "context": []
    },
    {
      "id": "k1xzp4p",
      "author": "madz7137",
      "body": "I see you. I was you at so many points in my life. It’s so hard. I’ve been working hard on myself for years to arrive at the point I’m at now and I believe that recovery helped rewire my brain when it comes to food. I try to eat foods I know I like and that will satiate me for a good couple of hours. Re: hunger and satiety scale, I used to always be either almost fainting from hunger or overbearingly full but now my hunger cues work much better and I know automatically when i need to eat. All this comes with time and effort. You can do it!",
      "created_utc": 1695524600.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k1xeb8a",
      "author": "Due-Gas-9473",
      "body": "Me too. But I can’t becuase my rights are\nGone all I do is chew and spit out my food or else the monsters are out to get me. My bully has gone so far. I’m scared he will damage me\nMore so I. Have to keep my body strong before it’s too late. He will hurt me multiple times and call me his best whilst never hurting his worst.",
      "created_utc": 1695514907.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k1xz4kt",
      "author": "Fitkratomgirl",
      "body": "I feel the exact same way",
      "created_utc": 1695524318.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k1xb0lh",
      "author": "Financial_Run_8902",
      "body": "Can I just ask if you “dieted” over your recovery or restricted any foods….",
      "created_utc": 1695513478.0,
      "score": 2,
      "context": [
        {
          "id": "k1wgxxo",
          "author": "mindfullymoving",
          "body": "I remember saying this to myself. You sound SO much like where I was about 4 years ago.\nI was starving or stuffed. Either restricting or binging. Always thinking of food and meal plans and recipes and diets and workouts. \n\nI had friends who just “ate when they were hungry and stopped when they were full” and I absolutely could not wrap my head around that. I desperately wanted to be normal and free.\n\nI worked HARD on full recovery and am so glad I did because that normalcy and freedom is so worth it.\n\nA lot of people ask me how and that question is almost impossible to answer because it wasn’t one thing. It was 18 months of building upon strategies and foundations and mindset and behaviour changes that were different every day.\n\nHaving help through the process was definitely imperative to my success. And I know that if you want to and are willing to put in work you can get there too 💖",
          "created_utc": 1695501273.0
        }
      ]
    },
    {
      "id": "k20xkkc",
      "author": "Financial_Run_8902",
      "body": "Agreed what fucked up joke eating disorders are",
      "created_utc": 1695579607.0,
      "score": 3,
      "context": [
        {
          "id": "k1zoq4o",
          "author": "worcestershire_pie",
          "body": "Truth. Having a disordered mindset around something as normal and important as food is excruciating. Food is everywhere. We need it to survive. But for some reason our brains see it as the enemy, even though we'll literally die if we don't consume it. So we have no idea how to approach the normalcy that resides in it, and it's exhausting.",
          "created_utc": 1695563062.0
        }
      ]
    },
    {
      "id": "k1xayce",
      "author": "Financial_Run_8902",
      "body": "Ikr. I want to enjoy food not obsess over what’s in it or how much🤦🏼‍♀️🤦🏼‍♀️",
      "created_utc": 1695513450.0,
      "score": 2,
      "context": [
        {
          "id": "k1whm6l",
          "author": "RisingPhoenix603",
          "body": "I FEEEL THIS! I keep saying it. I just want to be normal. A ED is the worst thing I have ever experienced. People say oh just eat or you can eat…..ummm no my brain doesn’t work that way. I’m so dam tired! Sooooo tired",
          "created_utc": 1695501517.0
        }
      ]
    },
    {
      "id": "k1xogmq",
      "author": "mindfullymoving",
      "body": "None at all",
      "created_utc": 1695519389.0,
      "score": 7,
      "context": [
        {
          "id": "k1wgxxo",
          "author": "mindfullymoving",
          "body": "I remember saying this to myself. You sound SO much like where I was about 4 years ago.\nI was starving or stuffed. Either restricting or binging. Always thinking of food and meal plans and recipes and diets and workouts. \n\nI had friends who just “ate when they were hungry and stopped when they were full” and I absolutely could not wrap my head around that. I desperately wanted to be normal and free.\n\nI worked HARD on full recovery and am so glad I did because that normalcy and freedom is so worth it.\n\nA lot of people ask me how and that question is almost impossible to answer because it wasn’t one thing. It was 18 months of building upon strategies and foundations and mindset and behaviour changes that were different every day.\n\nHaving help through the process was definitely imperative to my success. And I know that if you want to and are willing to put in work you can get there too 💖",
          "created_utc": 1695501273.0
        },
        {
          "id": "k1xb0lh",
          "author": "Financial_Run_8902",
          "body": "Can I just ask if you “dieted” over your recovery or restricted any foods….",
          "created_utc": 1695513478.0
        }
      ]
    }
  ]
}