{
  "id": "17fquy8",
  "subreddit": "EatingDisorders",
  "author": "MeteorIntrovert",
  "created_utc": 1698190460.0,
  "title": "ariana grande",
  "selftext": "anyone else ed's gets triggered by seeing ariana grande now? 🙃\ni like that woman so much but seeing her now just gets my ed refueling and i had to unfollow her",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/17fquy8/ariana_grande/",
  "score": 327,
  "num_comments": 206,
  "comments": [
    {
      "id": "k6gnbs8",
      "author": "updown27",
      "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
      "created_utc": 1698274471.0,
      "score": 63,
      "context": []
    },
    {
      "id": "k6gjljv",
      "author": "Queenofwands1212",
      "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
      "created_utc": 1698272935.0,
      "score": 42,
      "context": []
    },
    {
      "id": "k6ju9rk",
      "author": "Littlesadsloth",
      "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
      "created_utc": 1698334670.0,
      "score": 24,
      "context": []
    },
    {
      "id": "k6lxi3j",
      "author": "_senator_patootie_",
      "body": "I always cringe when I see her. It's hard to avoid her since she is so insanely popular, but she makes my ed kick into competitive mode. Plus i hate when people say \"shes naturally thin\" like there is naturally thin and then there is sickly. Idc what anyone says shes not healthy and saying people like that are \"natural\" only makes matters worse.",
      "created_utc": 1698362542.0,
      "score": 22,
      "context": []
    },
    {
      "id": "khjfi0k",
      "author": "Parking-Start2196",
      "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
      "created_utc": 1705078427.0,
      "score": 21,
      "context": []
    },
    {
      "id": "kg28nfg",
      "author": "None",
      "body": "i don't blame you, her ig is basically a pro ana account",
      "created_utc": 1704244427.0,
      "score": 13,
      "context": []
    },
    {
      "id": "khreop9",
      "author": "d993103164",
      "body": "the camera adds ten pounds , she looks dangerously thin on camera. in real life i cant imagine. appears to have ED but in denial, both to her self and her fans.",
      "created_utc": 1705199967.0,
      "score": 12,
      "context": []
    },
    {
      "id": "k6pxozq",
      "author": "putsweynh",
      "body": "atp she does bodychecks 24/7 i love her but its obvious",
      "created_utc": 1698433466.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kehy5zh",
      "author": "pizzaondeathrow",
      "body": "her head looks huge - and her body so frail. which is classic anorexia signs when it's in its extreme stages. her face looks so sad and sunken. her chin freaks me out too, it's so sharp. i wish her to be healthy so much",
      "created_utc": 1703271132.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kfhmawh",
      "author": "Tight_Quarter5117",
      "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
      "created_utc": 1703896268.0,
      "score": 7,
      "context": []
    },
    {
      "id": "khwjerm",
      "author": "CoCo_IX",
      "body": "She’s obviously very insecure. She breaks up relationships on purpose and starves herself thinking “the thinner the better” which is untrue considering she looks sickly. The new “blonde” hair color doesn’t help either as sometimes it makes her look bald because it’s too close to her skin color and makes her look washed out. She is going through a lot but can’t admit it to the public as it may ruin her image even more than she already has. So instead, she claims she is naturally thin and “wishes she had curves.” She does not. She needs help for alot of things and I hope she gets it.",
      "created_utc": 1705282714.0,
      "score": 8,
      "context": []
    },
    {
      "id": "khmg0ag",
      "author": "Personal_Unit7194",
      "body": "It makes me feel so bad about my body because now I think being \"skinny and thin\" is how celebrities perceive as beautiful",
      "created_utc": 1705118163.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k7rsk9e",
      "author": "Fiona_9",
      "body": "so obvious and loads of celebrities are bringing ed’s back",
      "created_utc": 1699093938.0,
      "score": 7,
      "context": []
    },
    {
      "id": "khx6e53",
      "author": "sunflower_phoenix",
      "body": "Oh man just came here after watching her new music video & it’s almost impossible to ignore…multiple people in my life have eating disorders & she’s starting to tick all the boxes. Its always hard with people who are naturally skinny bc it’s hard to determine when they’ve crossed the line to clearly emaciated, but she has definitely crossed it I think…hopefully she has people in her life looking after her",
      "created_utc": 1705291811.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ki0dkiz",
      "author": "Overall_Competition4",
      "body": "Ariana just posted pics on IG from the yet of ‘yes and…?’ And they made me gasp. She looks worse than even the music video",
      "created_utc": 1705347385.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kj6aryg",
      "author": "ashtastic3",
      "body": "Just remember even Eugenia Cooney claims she’s fine and her “doctors” say she is fine. \n\nClaiming to be healthy doesn’t mean you are. Given the mortality rate of Ana, Ariana was probably healthier drinking on antidepressants and eating some fatty foods here and there. I’m not stating this as fact okay, that obviously isn’t a healthy thing to do. What I’m saying is just that… the body can overcome and adapt to some crazy stuff for long periods of time but lacking body fat and consistent nutrition isn’t really one of them.",
      "created_utc": 1706003341.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ksor7jj",
      "author": "doyoueverhaveadream",
      "body": "I’m sorry but I do not feel bad for celebrities who have all the resources in the world and a TEAM  ready to prep her meals, give her a diet best suited for her, give her the perfect work out routine and allll the treatment she could possibly need. She has everything she needs to thrive, for someone to intervene with a plan laid out for her. She is in a place where she could potentially be responsible for many young girls EDs or serve as their “inspo”. \n\nWhile it’s hard for many to even acknowledge their disorder until it’s too late, for her to body check, openly flaunt her weight and validate to all the young girls watching her every move that yes! You can naturally be this skinny! (You can’t) and yes! You can be this skinny and still be healthy! (You can’t) is not only irresponsible, but it’s disgusting. Even if she, herself, was in denial, she has a team and a family that could intervene at any moment but I guess marketing her as the bubbly adult teen is profitable. I do not feel bad for her, I feel bad for all the young fans who want to be just like her, that may already be struggling with an ED or will develop an ED, having to watch their idol destroy themselves and call it normal.",
      "created_utc": 1709210779.0,
      "score": 3,
      "context": []
    },
    {
      "id": "k6dgy6u",
      "author": "Fit_Nobody4922",
      "body": "ME",
      "created_utc": 1698228281.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ki3fnaf",
      "author": "Bettertoflygirl",
      "body": "They say that tv puts 10 pounds on you and if ari looks even thinner in person there's a problem",
      "created_utc": 1705390214.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kiiyip8",
      "author": "samswrld444",
      "body": "why don’t we all unfollow her to stop validating her?? she needs to learn this isn’t healthy and she’s destroying young girls ideals of beauty, without a fuck to give, setting examples of sleeping with married men.",
      "created_utc": 1705628535.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kik28so",
      "author": "Icy-Fun-8302",
      "body": "I used to work with her and she literally only eats jicama sticks. She has had an ED ever since she became famous.",
      "created_utc": 1705647497.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kilxo9z",
      "author": "Practical_Ad5442",
      "body": "I know a lot of people say she looks like a little child but anyone else think she looks way older? Like she is so skinny it makes her look like a frail old lady to me",
      "created_utc": 1705682616.0,
      "score": 3,
      "context": []
    },
    {
      "id": "khxjtsu",
      "author": "separ82gether",
      "body": "Remember when she licked that donut years ago at the donut shop and then put it back and they caught her on camera? I feel like she definitely has an ED. Her new video is her way of drawing even more attention to the issues she claims she doesn't want to draw attention to...",
      "created_utc": 1705298586.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kiett0w",
      "author": "Puzzleheaded-Sir8490",
      "body": "So torn on the fact that I don’t want to comment on it because the way she tries to explain it I dont think is disingenuous I think is denial because I remember the denial so don’t want to attack. But equally it triggers me so bad and on some level makes me really angry because it gets me so bad. There’s only so much therapy can do, been reasonably healthy for a long time but the chest bones look in the new clip is something that lives in my head rent free forever",
      "created_utc": 1705567903.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ksb57fw",
      "author": "Realistic-Road-6121",
      "body": "To me its scary to see people complimenting her looks as beautiful or healthy, like normalizing a weird scary standart. It almost feels like a gaslight. No one would look like a cadaver in a healthy non-ed life style, veganims does not explain it.",
      "created_utc": 1708997055.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ksjhnmd",
      "author": "sailingalongbubbles",
      "body": "She’s definitely got some mental health issues going on- ED, depression, probably anxiety, PTSD- something. She has some extreme guilt over the loss of Mac. Despite what she thinks, she needs to be trained to think it wasn’t her fault. \n\nNow she is stuck trying to ruin others’ marriages or relationships for the sake of feeling worthy of love. I don’t know the relationship with her father, but maybe a professional should take a look into it?\nSomething isn’t right.\nI hope she changes and finds the help she deserves. Underneath all of this she can be a good person. I know she’s not perfect. I can read her aura and it screams: “I’m lost, I’m confused, I’m scared, I’m overwhelmed.”",
      "created_utc": 1709131747.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kso5vvs",
      "author": "nosnhoj-mas",
      "body": "This thread made me feel sane again. I saw a recent interview w/ her and was shocked to see the state of her body. So insanely triggering. I thought it was just ED brain talking but I have only ever seen such thinness in direct connection to disorder eating or very poor health, both of which she claims not to have. I want to be body positive but it feels like she’s being dishonest or at the very least encouraging dangerous behavior by promoting this image.",
      "created_utc": 1709196943.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ksu3my0",
      "author": "Candid-Ad9983",
      "body": "I’m a little late to comment but I’m struggling myself with anorexia and I compare myself to Ariana and feel the need to be that thin. I know that’s messed up to say.",
      "created_utc": 1709291201.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ktwhfxs",
      "author": "None",
      "body": "that woman definitely has an eating disorder.",
      "created_utc": 1709896682.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ktysrcl",
      "author": "CaptainBikepath",
      "body": "I lost a dear friend to Anorexia two and a half years ago, and watching AG right now makes me feel so scared for her. I feel like I'm watching the same story play out all over again. My friend had the same delusions that she was healthy - much healthier than the rest of us. She died at age 53.",
      "created_utc": 1709928595.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kwa08gt",
      "author": "Ok-Assistance-1860",
      "body": "i am commenting on this so late because I googled whether this happened to anyone else. She did an interview in a red dress where her front ribs are showing. \n\nno one recognizes an ED like someone who's had one.",
      "created_utc": 1711242296.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ku3mqne",
      "author": "Excellent_Plant_8010",
      "body": "I came here bc I saw those new photos of her from SNL and she looked so sickly. I get it she's skinny and maybe she just has a small frame and genetics make her naturally skinny. But her arms are twigs and her face looks so thin and sickly. Google said she weighs around 110lbs but I doubt she even weighs that much. It's scary she's such an idol for young girls I hope they don't aspire to look like her. Bc that is not a good healthy look for any woman.",
      "created_utc": 1710006669.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku565nd",
      "author": "Western-Comfort-9375",
      "body": "You guys know she has lupus right?",
      "created_utc": 1710025994.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku6y1tb",
      "author": "Activist_Mom",
      "body": "Tonight on SNL",
      "created_utc": 1710056768.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kuevv1b",
      "author": "Excellent_Poet_9189",
      "body": "My brother's lovely and intelligent girlfriend from his late teen years was so beloved by our family.  Then she developed anorexia and bulemia.  It was devastating to watch and to hear her throwing up.  She was from NYC and a very well to do family who eventually got her help with the preeminent therapist in the country.  By the age of 26 she was well on the road to recovery and seemed to be healthy.  She had learned how to manage her disease.  But, she had done damage to her heart muscle over the many years of starving, binging, and purging.  She died of a heart attack at the age of 27.",
      "created_utc": 1710186085.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kupbibt",
      "author": "SuddenReturn9027",
      "body": "Olivia Rodrigo made me feel the same way",
      "created_utc": 1710349684.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kus7o4x",
      "author": "Januckey1981",
      "body": "She definitely has something going on. I was startled when I saw her honestly because I don’t follow her nor am I a huge Ari fan, but I watched her in SNL and I immediately gasped and said to my husband “What is happening with this girl?! Something has gone terribly wrong!”",
      "created_utc": 1710386054.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvdcj7v",
      "author": "Charming_Duck_793",
      "body": "i feel sad for her... you can tell, her chest and collar bones in the Yes, and ? video )):",
      "created_utc": 1710727081.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvdllm6",
      "author": "literally_angel",
      "body": "I love the story of Wicked, but I honestly don't think I can watch her in this super glamorous, feminine role looking so thin and sickly. If that makes sense. Glinda is such a vibe and I suspect her portrayal is going to be very.... weird. And triggering.",
      "created_utc": 1710731176.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvzwjka",
      "author": "RamonaHatake033",
      "body": "There’s a vanity fair image of her as Glinda and her ribcage is popping out, and her arms and neck look sickly.",
      "created_utc": 1711079086.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kwlyq7e",
      "author": "Forceablee",
      "body": "Bro.. she archived the guitar pic. I bet I have a screenshot but that just shows she’s so aware.. she archived nearly 300 posts within this week..?",
      "created_utc": 1711436997.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kjjmrwb",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1706210020.0,
      "score": 0,
      "context": []
    },
    {
      "id": "kuk2l6e",
      "author": "Tight-Pitch6488",
      "body": "Everyone else in Hollywood is losing weight right now. It’s the trendy thing to do. Why wouldn’t Ariana follow suit?",
      "created_utc": 1710267681.0,
      "score": 0,
      "context": []
    },
    {
      "id": "k6e8ln3",
      "author": "meltingrubberducks",
      "body": "Ooh same",
      "created_utc": 1698242655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k6f9yuc",
      "author": "tingsaregood",
      "body": "Yes.",
      "created_utc": 1698256354.0,
      "score": 1,
      "context": []
    },
    {
      "id": "khy5v24",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1705313736.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kof44c4",
      "author": "cherrybelle90",
      "body": "I thought ahe looked like she's got a disease and dying ",
      "created_utc": 1706785433.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksjhuk4",
      "author": "None",
      "body": "I used to love listening to her and following her and now when I see her on my instagram she is triggering my old ED days. She also doesn't even look healthy anymore.",
      "created_utc": 1709131817.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ku3m9uq",
      "author": "BellEvening6493",
      "body": "yea its like a spiral of self sabotage when i was in that mental space",
      "created_utc": 1710006515.0,
      "score": 7,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        }
      ]
    },
    {
      "id": "kupbcx6",
      "author": "SuddenReturn9027",
      "body": "Genuinely not asking to be mean and am just genuinely curious but how can sleeping with a married man be a symptom of ED?",
      "created_utc": 1710349635.0,
      "score": 3,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        }
      ]
    },
    {
      "id": "kvjkfsk",
      "author": "No_Combination_1673",
      "body": "when I was at the height of my ed my eyes were soooo sunken in, exactly how she looks without makeup",
      "created_utc": 1710828510.0,
      "score": 3,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        }
      ]
    },
    {
      "id": "kxn8vl2",
      "author": "Amazing-Aside-9477",
      "body": "No one knows the full story of the relationship drama. He could have had a very bad relationship with his baby mama and getting divorced. I don't think ari broke them up ",
      "created_utc": 1712026837.0,
      "score": 1,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        }
      ]
    },
    {
      "id": "k6gkozq",
      "author": "MeteorIntrovert",
      "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
      "created_utc": 1698273386.0,
      "score": 37,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        }
      ]
    },
    {
      "id": "kg28ia8",
      "author": "None",
      "body": "literally a body checking post. made me sick",
      "created_utc": 1704244373.0,
      "score": 9,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        }
      ]
    },
    {
      "id": "kjctkz2",
      "author": "None",
      "body": "I just looked it up, and now I regret it",
      "created_utc": 1706107839.0,
      "score": 8,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        }
      ]
    },
    {
      "id": "kcusr4c",
      "author": "sobwhen",
      "body": "been waiting for someone to mention this",
      "created_utc": 1702263762.0,
      "score": 3,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        }
      ]
    },
    {
      "id": "kscebqz",
      "author": "coneyisland92",
      "body": "I’m a bit late, I had to go google it. Jesus Christ!",
      "created_utc": 1709017769.0,
      "score": 2,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        }
      ]
    },
    {
      "id": "kpsxvmx",
      "author": "National_Way_9967",
      "body": "people intentionally confuse her being naturally “petite” with her being naturally “thin”. yes she is 5ft and she was never large for her size but that is different from someone who is just naturally skinny, especially as thin as she is today. absolutely not",
      "created_utc": 1707585055.0,
      "score": 3,
      "context": [
        {
          "id": "k6lxi3j",
          "author": "_senator_patootie_",
          "body": "I always cringe when I see her. It's hard to avoid her since she is so insanely popular, but she makes my ed kick into competitive mode. Plus i hate when people say \"shes naturally thin\" like there is naturally thin and then there is sickly. Idc what anyone says shes not healthy and saying people like that are \"natural\" only makes matters worse.",
          "created_utc": 1698362542.0
        }
      ]
    },
    {
      "id": "kutnme6",
      "author": "farahxuxa",
      "body": "someone naturally thin but looks healthy is zendaya",
      "created_utc": 1710418183.0,
      "score": 2,
      "context": [
        {
          "id": "k6lxi3j",
          "author": "_senator_patootie_",
          "body": "I always cringe when I see her. It's hard to avoid her since she is so insanely popular, but she makes my ed kick into competitive mode. Plus i hate when people say \"shes naturally thin\" like there is naturally thin and then there is sickly. Idc what anyone says shes not healthy and saying people like that are \"natural\" only makes matters worse.",
          "created_utc": 1698362542.0
        }
      ]
    },
    {
      "id": "ktt53sl",
      "author": "None",
      "body": "she literally is naturally thin tho. she’s always been skinny.",
      "created_utc": 1709840289.0,
      "score": 0,
      "context": [
        {
          "id": "k6lxi3j",
          "author": "_senator_patootie_",
          "body": "I always cringe when I see her. It's hard to avoid her since she is so insanely popular, but she makes my ed kick into competitive mode. Plus i hate when people say \"shes naturally thin\" like there is naturally thin and then there is sickly. Idc what anyone says shes not healthy and saying people like that are \"natural\" only makes matters worse.",
          "created_utc": 1698362542.0
        }
      ]
    },
    {
      "id": "khn0log",
      "author": "MajesticExpression98",
      "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
      "created_utc": 1705129772.0,
      "score": 14,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "khjjrbf",
      "author": "United-Path5601",
      "body": "It’s actually scary and reminds me sm of me at my worst, but no one is allowed to say anything about it",
      "created_utc": 1705079845.0,
      "score": 10,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "khoxyjy",
      "author": "EfficiencyNo6436",
      "body": "literally why i came to this thread rn after seeing a bit of that video. i stopped because i couldn’t even stand looking at her anymore and how uncomfortable she was reminding me of eugenia cooney ",
      "created_utc": 1705167221.0,
      "score": 9,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "khtf98d",
      "author": "Beautiful_Loan_3996",
      "body": "yes ugh :/// i came to this old ass thread just for this comment",
      "created_utc": 1705242343.0,
      "score": 7,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "ki0vhou",
      "author": "lapsedgoth",
      "body": "yeah the video has sent me spiralling",
      "created_utc": 1705353321.0,
      "score": 6,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "ki1gzww",
      "author": "Ill_Lime7067",
      "body": "I remember her saying that she’s the healthiest she’s ever been and then I felt bad for judging like…it seems a little too skinny but I don’t know if it’s my place to say or judge ? Like people can lie about stuff",
      "created_utc": 1705360447.0,
      "score": 5,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "ki3yzn6",
      "author": "DumbledoresaidCalmly",
      "body": "It’s giving Eugenia Cooney",
      "created_utc": 1705404204.0,
      "score": 4,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "khlu6y1",
      "author": "MeteorIntrovert",
      "body": "brooooo that vid fueled up my ed so bad",
      "created_utc": 1705108866.0,
      "score": 4,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "ki3kix6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1705393624.0,
      "score": 4,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "kqkyyp5",
      "author": "Automatic-Rock7968",
      "body": "I feel like the point of Yes, And? is saying yes to the accusations/concerns, and saying its not anyone's  business but hers",
      "created_utc": 1708027695.0,
      "score": 5,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "khsavyg",
      "author": "Coconutwatervodka",
      "body": "Yep I can’t watch her too much",
      "created_utc": 1705215921.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "ki9hh3q",
      "author": "None",
      "body": "Its a complete rip off Vogue...",
      "created_utc": 1705488498.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "kvddlkn",
      "author": "Charming_Duck_793",
      "body": "omg i said the same thing !! it's sad because while she could also have an autoimmune disorder, other illness etc. it reaaaallly looks like an ed. I try not to comment on other people's bodies, but i feel like at this point she looks ill and it's worrying ):",
      "created_utc": 1710727542.0,
      "score": 1,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        }
      ]
    },
    {
      "id": "kqchaau",
      "author": "ChipperSnapper",
      "body": "THISSSS",
      "created_utc": 1707887365.0,
      "score": 2,
      "context": [
        {
          "id": "kg28nfg",
          "author": "None",
          "body": "i don't blame you, her ig is basically a pro ana account",
          "created_utc": 1704244427.0
        }
      ]
    },
    {
      "id": "khrqu8p",
      "author": "badromansss",
      "body": "I dont think camera nowadays add pounds tho, that is just an old hollywood thing",
      "created_utc": 1705204931.0,
      "score": 5,
      "context": [
        {
          "id": "khreop9",
          "author": "d993103164",
          "body": "the camera adds ten pounds , she looks dangerously thin on camera. in real life i cant imagine. appears to have ED but in denial, both to her self and her fans.",
          "created_utc": 1705199967.0
        }
      ]
    },
    {
      "id": "kv5as5q",
      "author": "cheyennenotwyoming",
      "body": "Body checks?",
      "created_utc": 1710601631.0,
      "score": 1,
      "context": [
        {
          "id": "k6pxozq",
          "author": "putsweynh",
          "body": "atp she does bodychecks 24/7 i love her but its obvious",
          "created_utc": 1698433466.0
        }
      ]
    },
    {
      "id": "kp4dx7x",
      "author": "None",
      "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
      "created_utc": 1707186317.0,
      "score": 6,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        }
      ]
    },
    {
      "id": "khqe8ig",
      "author": "treaquin",
      "body": "I say this often. She looks like a child, I don’t see how you can be attracted to her without feeling like a criminal.",
      "created_utc": 1705186017.0,
      "score": 4,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        }
      ]
    },
    {
      "id": "khxla57",
      "author": "serena-saphire",
      "body": "Okay comments like this are way out of line. She is a full grown woman and is far from the realm of age play. I get that she is clinging hard to the innocent young girl look,  but to say that anyone who wants to fuck her is a pedophile is absolutely insane.",
      "created_utc": 1705299427.0,
      "score": 5,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        }
      ]
    },
    {
      "id": "kjjgdba",
      "author": "Rude_J",
      "body": "THIS.",
      "created_utc": 1706207901.0,
      "score": 2,
      "context": [
        {
          "id": "khwjerm",
          "author": "CoCo_IX",
          "body": "She’s obviously very insecure. She breaks up relationships on purpose and starves herself thinking “the thinner the better” which is untrue considering she looks sickly. The new “blonde” hair color doesn’t help either as sometimes it makes her look bald because it’s too close to her skin color and makes her look washed out. She is going through a lot but can’t admit it to the public as it may ruin her image even more than she already has. So instead, she claims she is naturally thin and “wishes she had curves.” She does not. She needs help for alot of things and I hope she gets it.",
          "created_utc": 1705282714.0
        }
      ]
    },
    {
      "id": "khnuami",
      "author": "x_x0_0x_x",
      "body": "It’s horrible that this behaviour feels promoted by massive celebrities but you’re body is most perfect when it’s healthy and provides you to make good memories and eat things that make you happy never compare yourself to anyone else once you have that mindset you’ll be happier than you ever will be worrying about your weight I wish you the best life is beautiful take care of yourself:)",
      "created_utc": 1705150835.0,
      "score": 1,
      "context": [
        {
          "id": "khmg0ag",
          "author": "Personal_Unit7194",
          "body": "It makes me feel so bad about my body because now I think being \"skinny and thin\" is how celebrities perceive as beautiful",
          "created_utc": 1705118163.0
        }
      ]
    },
    {
      "id": "khtqm50",
      "author": "Recent-Ad-2010",
      "body": "I’m the opposite, I’ve been trying very hard to gain weight esp. in my chest. I cannot wear a lot of clothes that I like because my upper body is too thin. I wish weight gain/loss was easy for women!",
      "created_utc": 1705247065.0,
      "score": 1,
      "context": [
        {
          "id": "khmg0ag",
          "author": "Personal_Unit7194",
          "body": "It makes me feel so bad about my body because now I think being \"skinny and thin\" is how celebrities perceive as beautiful",
          "created_utc": 1705118163.0
        }
      ]
    },
    {
      "id": "kv5dgvy",
      "author": "cheyennenotwyoming",
      "body": "Yep. I gave up alcohol and antidepressants I was healthier then than I am now. I have an ED and I know damn well I was healthier before. The shitty thing is she flaunts all this on social media and kids look up to her and will want to be just as small as her. Ariana triggers my ED a lot but that’s my problem not hers. But she should be more aware….",
      "created_utc": 1710602663.0,
      "score": 1,
      "context": [
        {
          "id": "kj6aryg",
          "author": "ashtastic3",
          "body": "Just remember even Eugenia Cooney claims she’s fine and her “doctors” say she is fine. \n\nClaiming to be healthy doesn’t mean you are. Given the mortality rate of Ana, Ariana was probably healthier drinking on antidepressants and eating some fatty foods here and there. I’m not stating this as fact okay, that obviously isn’t a healthy thing to do. What I’m saying is just that… the body can overcome and adapt to some crazy stuff for long periods of time but lacking body fat and consistent nutrition isn’t really one of them.",
          "created_utc": 1706003341.0
        }
      ]
    },
    {
      "id": "kv8nsbc",
      "author": "senpaistealerx",
      "body": "she has almost 400m followers. good luck.",
      "created_utc": 1710650439.0,
      "score": 1,
      "context": [
        {
          "id": "kiiyip8",
          "author": "samswrld444",
          "body": "why don’t we all unfollow her to stop validating her?? she needs to learn this isn’t healthy and she’s destroying young girls ideals of beauty, without a fuck to give, setting examples of sleeping with married men.",
          "created_utc": 1705628535.0
        }
      ]
    },
    {
      "id": "kikib89",
      "author": "MeteorIntrovert",
      "body": "how did u used to work with her",
      "created_utc": 1705659103.0,
      "score": 2,
      "context": [
        {
          "id": "kik28so",
          "author": "Icy-Fun-8302",
          "body": "I used to work with her and she literally only eats jicama sticks. She has had an ED ever since she became famous.",
          "created_utc": 1705647497.0
        }
      ]
    },
    {
      "id": "kjjmj3e",
      "author": "Heavy-Astronaut9326",
      "body": "When did you used to work with her? How was she? Did she really eat jicama sticks only?",
      "created_utc": 1706209939.0,
      "score": 1,
      "context": [
        {
          "id": "kik28so",
          "author": "Icy-Fun-8302",
          "body": "I used to work with her and she literally only eats jicama sticks. She has had an ED ever since she became famous.",
          "created_utc": 1705647497.0
        }
      ]
    },
    {
      "id": "krav7rm",
      "author": "GiaBethReds",
      "body": "Random lol I love that",
      "created_utc": 1708442212.0,
      "score": 1,
      "context": [
        {
          "id": "kik28so",
          "author": "Icy-Fun-8302",
          "body": "I used to work with her and she literally only eats jicama sticks. She has had an ED ever since she became famous.",
          "created_utc": 1705647497.0
        }
      ]
    },
    {
      "id": "kiwk10p",
      "author": "sobwhen",
      "body": "she looks older but she constantly embodies baby behaviors and mannerisms.",
      "created_utc": 1705853988.0,
      "score": 3,
      "context": [
        {
          "id": "kilxo9z",
          "author": "Practical_Ad5442",
          "body": "I know a lot of people say she looks like a little child but anyone else think she looks way older? Like she is so skinny it makes her look like a frail old lady to me",
          "created_utc": 1705682616.0
        }
      ]
    },
    {
      "id": "ksorbet",
      "author": "doyoueverhaveadream",
      "body": "Was it the one of her in the red dress? Because that’s what sent me here too, had to stop the video bc it reminded me of my body when I was at my worst.",
      "created_utc": 1709210831.0,
      "score": 1,
      "context": [
        {
          "id": "kso5vvs",
          "author": "nosnhoj-mas",
          "body": "This thread made me feel sane again. I saw a recent interview w/ her and was shocked to see the state of her body. So insanely triggering. I thought it was just ED brain talking but I have only ever seen such thinness in direct connection to disorder eating or very poor health, both of which she claims not to have. I want to be body positive but it feels like she’s being dishonest or at the very least encouraging dangerous behavior by promoting this image.",
          "created_utc": 1709196943.0
        }
      ]
    },
    {
      "id": "kstken5",
      "author": "soynugget95",
      "body": "I saw that one on tiktok today and the comments are full of her fans saying she’s healthy. The delusion is strong, I fear. Also I hate how most places (ie, social medias), people can’t even talk about it without being attacked by fans and by people desperately white-knighting for the “naturally thin”.",
      "created_utc": 1709277257.0,
      "score": 1,
      "context": [
        {
          "id": "kso5vvs",
          "author": "nosnhoj-mas",
          "body": "This thread made me feel sane again. I saw a recent interview w/ her and was shocked to see the state of her body. So insanely triggering. I thought it was just ED brain talking but I have only ever seen such thinness in direct connection to disorder eating or very poor health, both of which she claims not to have. I want to be body positive but it feels like she’s being dishonest or at the very least encouraging dangerous behavior by promoting this image.",
          "created_utc": 1709196943.0
        }
      ]
    },
    {
      "id": "kwlvlsq",
      "author": "Forceablee",
      "body": "It is good that you are aware though ❤️❤️",
      "created_utc": 1711434655.0,
      "score": 2,
      "context": [
        {
          "id": "ksu3my0",
          "author": "Candid-Ad9983",
          "body": "I’m a little late to comment but I’m struggling myself with anorexia and I compare myself to Ariana and feel the need to be that thin. I know that’s messed up to say.",
          "created_utc": 1709291201.0
        }
      ]
    },
    {
      "id": "kunyuve",
      "author": "maddylelu73",
      "body": "Source? I’ve never heard that and when you Google it, you just get info about Selena Gomez",
      "created_utc": 1710331977.0,
      "score": 1,
      "context": [
        {
          "id": "ku565nd",
          "author": "Western-Comfort-9375",
          "body": "You guys know she has lupus right?",
          "created_utc": 1710025994.0
        }
      ]
    },
    {
      "id": "kupjtcx",
      "author": "candidamber",
      "body": "That’s not confirmed. I don’t think she has lupus.",
      "created_utc": 1710352370.0,
      "score": 1,
      "context": [
        {
          "id": "ku565nd",
          "author": "Western-Comfort-9375",
          "body": "You guys know she has lupus right?",
          "created_utc": 1710025994.0
        }
      ]
    },
    {
      "id": "kv5fp4e",
      "author": "cheyennenotwyoming",
      "body": "Too many celebs are saying they have lupus when they gain weight or lose too much weight. Selena was open about hers and I feel like everyone else came out with it too.",
      "created_utc": 1710603501.0,
      "score": 1,
      "context": [
        {
          "id": "ku565nd",
          "author": "Western-Comfort-9375",
          "body": "You guys know she has lupus right?",
          "created_utc": 1710025994.0
        }
      ]
    },
    {
      "id": "kwlvnzf",
      "author": "Forceablee",
      "body": "I think this one is actually false.",
      "created_utc": 1711434697.0,
      "score": 1,
      "context": [
        {
          "id": "ku565nd",
          "author": "Western-Comfort-9375",
          "body": "You guys know she has lupus right?",
          "created_utc": 1710025994.0
        }
      ]
    },
    {
      "id": "kufcxvi",
      "author": "Striking-Purple-2780",
      "body": "I'm so sorry for your family's loss 💗",
      "created_utc": 1710191690.0,
      "score": 1,
      "context": [
        {
          "id": "kuevv1b",
          "author": "Excellent_Poet_9189",
          "body": "My brother's lovely and intelligent girlfriend from his late teen years was so beloved by our family.  Then she developed anorexia and bulemia.  It was devastating to watch and to hear her throwing up.  She was from NYC and a very well to do family who eventually got her help with the preeminent therapist in the country.  By the age of 26 she was well on the road to recovery and seemed to be healthy.  She had learned how to manage her disease.  But, she had done damage to her heart muscle over the many years of starving, binging, and purging.  She died of a heart attack at the age of 27.",
          "created_utc": 1710186085.0
        }
      ]
    },
    {
      "id": "kwlvt7h",
      "author": "Forceablee",
      "body": "Yeah… she looks really out of place which is just so sad! She’s been wanting to do this role for years actually, but she just got.. too into it..? Unfortunately she just doesn’t really fit the role 😔 I know it was her dream but I think it’s ruining her",
      "created_utc": 1711434803.0,
      "score": 1,
      "context": [
        {
          "id": "kvdllm6",
          "author": "literally_angel",
          "body": "I love the story of Wicked, but I honestly don't think I can watch her in this super glamorous, feminine role looking so thin and sickly. If that makes sense. Glinda is such a vibe and I suspect her portrayal is going to be very.... weird. And triggering.",
          "created_utc": 1710731176.0
        }
      ]
    },
    {
      "id": "kw09u48",
      "author": "Atxlvr",
      "body": "Wonder if it's related to the price of cocaine dropping suddenly over the last year",
      "created_utc": 1711086380.0,
      "score": 1,
      "context": [
        {
          "id": "kuk2l6e",
          "author": "Tight-Pitch6488",
          "body": "Everyone else in Hollywood is losing weight right now. It’s the trendy thing to do. Why wouldn’t Ariana follow suit?",
          "created_utc": 1710267681.0
        }
      ]
    },
    {
      "id": "kyrb9u6",
      "author": "None",
      "body": "Apparently from what my friend told me yesterday at dinner, ED is the new trend. (Sickly, I know, I don't know if it's true or not but it's heart breaking.)",
      "created_utc": 1712664947.0,
      "score": 1,
      "context": [
        {
          "id": "kuk2l6e",
          "author": "Tight-Pitch6488",
          "body": "Everyone else in Hollywood is losing weight right now. It’s the trendy thing to do. Why wouldn’t Ariana follow suit?",
          "created_utc": 1710267681.0
        }
      ]
    },
    {
      "id": "ki06fb9",
      "author": "EatingDisorders-ModTeam",
      "body": "Hi there, we appreciate your struggles. Unfortunately your submission has been removed for the following reason(s):\n\nYour message has been removed. Please do not encourage pro-ED comments. If you feel your message has been wrongfully deleted reply to this message with the reason.",
      "created_utc": 1705345048.0,
      "score": 1,
      "context": [
        {
          "id": "khy5v24",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1705313736.0
        }
      ]
    },
    {
      "id": "kv163ua",
      "author": "thereisbeauty7",
      "body": "To add to what others have said, your brain is a part of your body and so starving your body also starves your brain. It inhibits your ability to think about things clearly and critically, and can lead to making very poor and even unhinged life choices.",
      "created_utc": 1710529005.0,
      "score": 6,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        },
        {
          "id": "kupbcx6",
          "author": "SuddenReturn9027",
          "body": "Genuinely not asking to be mean and am just genuinely curious but how can sleeping with a married man be a symptom of ED?",
          "created_utc": 1710349635.0
        }
      ]
    },
    {
      "id": "kurvicp",
      "author": "updown27",
      "body": "Eating disorders are a mental illness. They are a symptom of a greater problem and a form of self harm. Another form of self harm is sabotaging your relationships and getting involved in messy situations you know you should not be in. Things people do in active addiction (or active ED) to self harm can include: literally hurting your body with force, starvation or substances, cheating, getting involved with partnered people, excessive lying, dating very promiscuously (to the point of harm), spontaneously quitting a job or moving to a new city, berating friends when they express concern, breaking off friendships with people who care about you, isolating yourself from friends and family, drastically change their appearance, get involved with people or groups that are harmful (drug scenes, abusive relationships), etc. Exhibiting these behaviors doesn't necessarily mean you're mentally ill, but when they are harmful to you it could be a symptom of that. This move was a risk to her career that she's spent her entire life building. She has won back public perception many times but she knew this was harmful to the people around her and potentially to herself as well. Most people with ED can confirm that at their sickest they made very poor life choices. Sometimes, people in active addiction or active ED are sought after by those who are looking to be with someone they can manipulate or harm and get away with it. Do I know all or any of this is true for Ari? Of course not. But from my personal experience it seems very obviously possible. I truly hope I am wrong.",
      "created_utc": 1710381192.0,
      "score": 1,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        },
        {
          "id": "kupbcx6",
          "author": "SuddenReturn9027",
          "body": "Genuinely not asking to be mean and am just genuinely curious but how can sleeping with a married man be a symptom of ED?",
          "created_utc": 1710349635.0
        }
      ]
    },
    {
      "id": "kusntad",
      "author": "civodar",
      "body": "I think it’s just showing how self destructive and toxic her behaviour is which can be a symptom of mental illness. An eating disorder is a destructive behaviour and sometime when people aren’t doing well their destructive tendencies get worse and can spill out in other aspects of their life.",
      "created_utc": 1710394143.0,
      "score": 1,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        },
        {
          "id": "kupbcx6",
          "author": "SuddenReturn9027",
          "body": "Genuinely not asking to be mean and am just genuinely curious but how can sleeping with a married man be a symptom of ED?",
          "created_utc": 1710349635.0
        }
      ]
    },
    {
      "id": "kwnl90w",
      "author": "Sea-Awareness-3128",
      "body": "Not that specifically they mean that shes so sick with her ED she’s not making good choices, for example her affair with a married man.",
      "created_utc": 1711467323.0,
      "score": 1,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        },
        {
          "id": "kupbcx6",
          "author": "SuddenReturn9027",
          "body": "Genuinely not asking to be mean and am just genuinely curious but how can sleeping with a married man be a symptom of ED?",
          "created_utc": 1710349635.0
        }
      ]
    },
    {
      "id": "kxn925m",
      "author": "Amazing-Aside-9477",
      "body": "I got with a \"married\" man with a baby. His wife cheated on him & they were getting divorced but up until a certain point they were legally married ",
      "created_utc": 1712026918.0,
      "score": 1,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        },
        {
          "id": "kxn8vl2",
          "author": "Amazing-Aside-9477",
          "body": "No one knows the full story of the relationship drama. He could have had a very bad relationship with his baby mama and getting divorced. I don't think ari broke them up ",
          "created_utc": 1712026837.0
        }
      ]
    },
    {
      "id": "k6gnhjj",
      "author": "updown27",
      "body": "Proud of you for unfollowing! I did the same :(",
      "created_utc": 1698274538.0,
      "score": 21,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        }
      ]
    },
    {
      "id": "k6gl7di",
      "author": "Queenofwands1212",
      "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
      "created_utc": 1698273594.0,
      "score": 26,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        }
      ]
    },
    {
      "id": "kupbhht",
      "author": "SuddenReturn9027",
      "body": "Olivia Rodrigo made me feel the same way",
      "created_utc": 1710349677.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        }
      ]
    },
    {
      "id": "ktt4vs2",
      "author": "None",
      "body": "a picture of her with her body in it is now ‘body checking’",
      "created_utc": 1709840194.0,
      "score": 1,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        },
        {
          "id": "kg28ia8",
          "author": "None",
          "body": "literally a body checking post. made me sick",
          "created_utc": 1704244373.0
        }
      ]
    },
    {
      "id": "kvtcegp",
      "author": "floratical",
      "body": "petite implies skinny and short, being short alone does not mean you are petite",
      "created_utc": 1710978881.0,
      "score": 1,
      "context": [
        {
          "id": "k6lxi3j",
          "author": "_senator_patootie_",
          "body": "I always cringe when I see her. It's hard to avoid her since she is so insanely popular, but she makes my ed kick into competitive mode. Plus i hate when people say \"shes naturally thin\" like there is naturally thin and then there is sickly. Idc what anyone says shes not healthy and saying people like that are \"natural\" only makes matters worse.",
          "created_utc": 1698362542.0
        },
        {
          "id": "kpsxvmx",
          "author": "National_Way_9967",
          "body": "people intentionally confuse her being naturally “petite” with her being naturally “thin”. yes she is 5ft and she was never large for her size but that is different from someone who is just naturally skinny, especially as thin as she is today. absolutely not",
          "created_utc": 1707585055.0
        }
      ]
    },
    {
      "id": "ku3oim5",
      "author": "Missvelveteenrabbit",
      "body": "Look at pictures from Sam and Kat to now",
      "created_utc": 1710007263.0,
      "score": 3,
      "context": [
        {
          "id": "k6lxi3j",
          "author": "_senator_patootie_",
          "body": "I always cringe when I see her. It's hard to avoid her since she is so insanely popular, but she makes my ed kick into competitive mode. Plus i hate when people say \"shes naturally thin\" like there is naturally thin and then there is sickly. Idc what anyone says shes not healthy and saying people like that are \"natural\" only makes matters worse.",
          "created_utc": 1698362542.0
        },
        {
          "id": "ktt53sl",
          "author": "None",
          "body": "she literally is naturally thin tho. she’s always been skinny.",
          "created_utc": 1709840289.0
        }
      ]
    },
    {
      "id": "ku6e599",
      "author": "tokengrip",
      "body": "not really i mean ive been watching victorious and yes shes a healthy weight but she did have curves once upon a time",
      "created_utc": 1710045118.0,
      "score": 3,
      "context": [
        {
          "id": "k6lxi3j",
          "author": "_senator_patootie_",
          "body": "I always cringe when I see her. It's hard to avoid her since she is so insanely popular, but she makes my ed kick into competitive mode. Plus i hate when people say \"shes naturally thin\" like there is naturally thin and then there is sickly. Idc what anyone says shes not healthy and saying people like that are \"natural\" only makes matters worse.",
          "created_utc": 1698362542.0
        },
        {
          "id": "ktt53sl",
          "author": "None",
          "body": "she literally is naturally thin tho. she’s always been skinny.",
          "created_utc": 1709840289.0
        }
      ]
    },
    {
      "id": "kho214p",
      "author": "None",
      "body": "She is absolutely not healthy. Yes I believe that she is naturally thin. But I don’t buy her justifying her weight loss to the fact that she reduced or stopped her anti depressant meds. It is also incredibly tone deaf to say such things that could trigger younger depressed fans to stop taking life saving medication.\n\nAs a survivor of many deep ED episodes myself (during which I was on a ton of anti anxiety and anti depressant meds, ) I can see clear signs of her being dangerously underweight.\n\nThe dead eyes, the need to wear so many layers all the time because she is so cold. The fact that we can now see every bone of her body. The state of her hair when you look at the roots, she barely has any. \n\nThe constant body checking pictures on her ig. The obvious trouble she had with singing during her last London live show. You can also see the lack of energy she displays during the choreography of her last MV, yes and? \n\nI love Ariana but I’m genuinely worried for her and the state of her body.",
      "created_utc": 1705154719.0,
      "score": 20,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        }
      ]
    },
    {
      "id": "khnecsj",
      "author": "Ok_Bumblebee123",
      "body": "It’s so clear she is suffering from an eating disorder. Her body is looking more and more emaciated with time and when people have genuine concern their comments are deleted or written off as hate. Looking at her chest in her recent music video and seeing her bones was so chilling. She needs help.",
      "created_utc": 1705139885.0,
      "score": 8,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        }
      ]
    },
    {
      "id": "kiolwjy",
      "author": "Freshflowersandhoney",
      "body": "I came here because of the music video too. She looks extremely sick. I remember her back in her Disney days and that looked like a natural weight for her and she was still small back then but now is very shocking",
      "created_utc": 1705716864.0,
      "score": 4,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        }
      ]
    },
    {
      "id": "kq8e09o",
      "author": "Free-Blueberry-2081",
      "body": "Ariana recently responded to all the uproar about how thin she now is and she commented that in her past, she was too big for her frame and at an unhealthy weight because of medications. And where she is now is her healthy weight. She stands by being this thin as healthy.",
      "created_utc": 1707832721.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        }
      ]
    },
    {
      "id": "kscek7w",
      "author": "coneyisland92",
      "body": "The fact she has said that back then was the unhealthiest body she had, I rolled my eyes. Yes, because you look so healthy now 🙄 it’s sad how much she is in denial. \n\nI also feel she is on drugs, did you see the photo of her and Ethan leaving the car? Yeah….",
      "created_utc": 1709017926.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        }
      ]
    },
    {
      "id": "kvjknfx",
      "author": "No_Combination_1673",
      "body": "anyone saying they’re the healthiest they’ve been while looking like that is….delusional. I said the saaaame thing when I was eating a meal a week, if that. I don’t know how she’s convinced everyone she’s totally physically and mentally sound…",
      "created_utc": 1710828667.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        }
      ]
    },
    {
      "id": "kstior2",
      "author": "soynugget95",
      "body": "It drives me mad and it’s also absurd because like… if she had just said “my body and my health are my own business and I’d really prefer if people respected that boundary” or something like that I’d be like, okay, she clearly has an ED but it’s her business. But the way she talks about how this is her healthiest self is honestly sick to me. It’s one thing to tell yourself that, but to tell tens of millions of people (mostly young women) that being this emaciated is the result of your healthiest behavior? That’s some shit and people SHOULD call it out.",
      "created_utc": 1709276133.0,
      "score": 7,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khjjrbf",
          "author": "United-Path5601",
          "body": "It’s actually scary and reminds me sm of me at my worst, but no one is allowed to say anything about it",
          "created_utc": 1705079845.0
        }
      ]
    },
    {
      "id": "khkk7k1",
      "author": "IapisIazuIi",
      "body": "i’ve been arianator for years and it hurts and makes me angry to see , i also had her  body at my worst, it’s a horrible position to be in bc her life is under a microscope and it’s hard for an average person to hear a comment about their body, but …",
      "created_utc": 1705091895.0,
      "score": 6,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khjjrbf",
          "author": "United-Path5601",
          "body": "It’s actually scary and reminds me sm of me at my worst, but no one is allowed to say anything about it",
          "created_utc": 1705079845.0
        }
      ]
    },
    {
      "id": "kt48zgb",
      "author": "Busy-Swan-6559",
      "body": "Sometimes I wonder if she, amongst others, has a warped idea of what “healthy” means. Some would say it’s getting all of your vitamins, so they take all of their supplements, etc. but don’t actually ever eat the foods that provide substance along with those vitamins.",
      "created_utc": 1709449125.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "ki1gzww",
          "author": "Ill_Lime7067",
          "body": "I remember her saying that she’s the healthiest she’s ever been and then I felt bad for judging like…it seems a little too skinny but I don’t know if it’s my place to say or judge ? Like people can lie about stuff",
          "created_utc": 1705360447.0
        }
      ]
    },
    {
      "id": "ki7g7n7",
      "author": "Parking-Start2196",
      "body": "yeah.  i love her and im excited for her new music as well, but its glaringly obvious now.",
      "created_utc": 1705450635.0,
      "score": 1,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "ki3kix6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1705393624.0
        }
      ]
    },
    {
      "id": "krqqq9m",
      "author": "Pessimist001",
      "body": "Exactly, it's her saying yeah I know - but don't care.\n\nIt's sad because she looked so incredibly attractive too before this and this really is not a good look at all. I'm not sure why people care to get to this place like her when it actually ruins your appearance.",
      "created_utc": 1708680510.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "kqkyyp5",
          "author": "Automatic-Rock7968",
          "body": "I feel like the point of Yes, And? is saying yes to the accusations/concerns, and saying its not anyone's  business but hers",
          "created_utc": 1708027695.0
        }
      ]
    },
    {
      "id": "khumnji",
      "author": "None",
      "body": "No, this still rings true. Have you ever tried taking a photo of your body? Pretty frustrating. Haha",
      "created_utc": 1705258357.0,
      "score": 11,
      "context": [
        {
          "id": "khreop9",
          "author": "d993103164",
          "body": "the camera adds ten pounds , she looks dangerously thin on camera. in real life i cant imagine. appears to have ED but in denial, both to her self and her fans.",
          "created_utc": 1705199967.0
        },
        {
          "id": "khrqu8p",
          "author": "badromansss",
          "body": "I dont think camera nowadays add pounds tho, that is just an old hollywood thing",
          "created_utc": 1705204931.0
        }
      ]
    },
    {
      "id": "kr4jyca",
      "author": "batshit83",
      "body": "It's true. Every time I've seen a celebrity in person I have been shocked at how tiny they are. The celebs that looks \"normal\" are very small in person, and the celebs that look very small on camera are basically child-size IRL.",
      "created_utc": 1708344101.0,
      "score": 5,
      "context": [
        {
          "id": "khreop9",
          "author": "d993103164",
          "body": "the camera adds ten pounds , she looks dangerously thin on camera. in real life i cant imagine. appears to have ED but in denial, both to her self and her fans.",
          "created_utc": 1705199967.0
        },
        {
          "id": "khrqu8p",
          "author": "badromansss",
          "body": "I dont think camera nowadays add pounds tho, that is just an old hollywood thing",
          "created_utc": 1705204931.0
        }
      ]
    },
    {
      "id": "kjdhle0",
      "author": "None",
      "body": "As someone else said it's because of the camera lens. There's photo guides out there that show how a difference lens on a camera can change the way the person looks in the photo/video  \n[Here](https://www.youtube.com/watch?v=Y0TKVDlOGk4) is a youtube video demonstrating the difference, or if you're extra lazy you can just google \"photo focal length\" and click images for a ton of side by side examples.",
      "created_utc": 1706116146.0,
      "score": 2,
      "context": [
        {
          "id": "khreop9",
          "author": "d993103164",
          "body": "the camera adds ten pounds , she looks dangerously thin on camera. in real life i cant imagine. appears to have ED but in denial, both to her self and her fans.",
          "created_utc": 1705199967.0
        },
        {
          "id": "khrqu8p",
          "author": "badromansss",
          "body": "I dont think camera nowadays add pounds tho, that is just an old hollywood thing",
          "created_utc": 1705204931.0
        }
      ]
    },
    {
      "id": "kv8n0e1",
      "author": "senpaistealerx",
      "body": "they’re saying she purposely posts/shows very thin looking photos/videos of herself",
      "created_utc": 1710650021.0,
      "score": 1,
      "context": [
        {
          "id": "k6pxozq",
          "author": "putsweynh",
          "body": "atp she does bodychecks 24/7 i love her but its obvious",
          "created_utc": 1698433466.0
        },
        {
          "id": "kv5as5q",
          "author": "cheyennenotwyoming",
          "body": "Body checks?",
          "created_utc": 1710601631.0
        }
      ]
    },
    {
      "id": "ksgolf2",
      "author": "lurk537",
      "body": "I completely agree, and plus, there are girls below the age of 15 that have curves too…",
      "created_utc": 1709080975.0,
      "score": 2,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "kp4dx7x",
          "author": "None",
          "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
          "created_utc": 1707186317.0
        }
      ]
    },
    {
      "id": "kv8naqx",
      "author": "senpaistealerx",
      "body": "THANK YOU. i can’t agree that she’s unhealthy or anything of that nature because that’s all speculation but to say someone who’s attracted to her is a p*do is truly wild as fuck. she’s 30 but looks young, however, she doesn’t look like a child. it’s being equated to being thin and with that logic, you could apply it to anyone you’d consider too thin.",
      "created_utc": 1710650175.0,
      "score": 1,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "kp4dx7x",
          "author": "None",
          "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
          "created_utc": 1707186317.0
        }
      ]
    },
    {
      "id": "kpvvqm7",
      "author": "Tight_Quarter5117",
      "body": "I disagree and you can disagree as well and we can both live our lives happily 😊",
      "created_utc": 1707627926.0,
      "score": 1,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "kp4dx7x",
          "author": "None",
          "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
          "created_utc": 1707186317.0
        }
      ]
    },
    {
      "id": "ksgp4mv",
      "author": "lurk537",
      "body": "Ok but there are plenty of minors that have gone thru puberty and therefore they have “adult-like” figures…not all age groups have one specific look.",
      "created_utc": 1709081170.0,
      "score": 3,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "khqe8ig",
          "author": "treaquin",
          "body": "I say this often. She looks like a child, I don’t see how you can be attracted to her without feeling like a criminal.",
          "created_utc": 1705186017.0
        }
      ]
    },
    {
      "id": "kiy4ws5",
      "author": "Rough-Cheesecake-641",
      "body": "It is incredibly weird. Perhaps peado is a bit harsh, but it's dangeorously close. She resembles a child at this point. I don't understand men who find this attractive. She looks ill.",
      "created_utc": 1705873586.0,
      "score": 7,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "khxla57",
          "author": "serena-saphire",
          "body": "Okay comments like this are way out of line. She is a full grown woman and is far from the realm of age play. I get that she is clinging hard to the innocent young girl look,  but to say that anyone who wants to fuck her is a pedophile is absolutely insane.",
          "created_utc": 1705299427.0
        }
      ]
    },
    {
      "id": "ki2rn95",
      "author": "Tight_Quarter5117",
      "body": "Your opinion. I do not feel it's out of line to say such.",
      "created_utc": 1705377557.0,
      "score": 2,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "khxla57",
          "author": "serena-saphire",
          "body": "Okay comments like this are way out of line. She is a full grown woman and is far from the realm of age play. I get that she is clinging hard to the innocent young girl look,  but to say that anyone who wants to fuck her is a pedophile is absolutely insane.",
          "created_utc": 1705299427.0
        }
      ]
    },
    {
      "id": "kxuua6l",
      "author": "None",
      "body": "It's projection from big girls, tall or weight-wise. They blame the fact that men are not attracted to them on women they are jealous of for being smaller, and pull the pedo excuses out of their ass. It's a shame; ladies, you don't have to be small to feel or look beautiful. ",
      "created_utc": 1712153969.0,
      "score": 1,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "khxla57",
          "author": "serena-saphire",
          "body": "Okay comments like this are way out of line. She is a full grown woman and is far from the realm of age play. I get that she is clinging hard to the innocent young girl look,  but to say that anyone who wants to fuck her is a pedophile is absolutely insane.",
          "created_utc": 1705299427.0
        }
      ]
    },
    {
      "id": "kv6ukqv",
      "author": "ashtastic3",
      "body": "Tbh I’ve come to learn people that do what Ariana is doing know damn well and are totally aware of what they’re doing.",
      "created_utc": 1710622593.0,
      "score": 1,
      "context": [
        {
          "id": "kj6aryg",
          "author": "ashtastic3",
          "body": "Just remember even Eugenia Cooney claims she’s fine and her “doctors” say she is fine. \n\nClaiming to be healthy doesn’t mean you are. Given the mortality rate of Ana, Ariana was probably healthier drinking on antidepressants and eating some fatty foods here and there. I’m not stating this as fact okay, that obviously isn’t a healthy thing to do. What I’m saying is just that… the body can overcome and adapt to some crazy stuff for long periods of time but lacking body fat and consistent nutrition isn’t really one of them.",
          "created_utc": 1706003341.0
        },
        {
          "id": "kv5dgvy",
          "author": "cheyennenotwyoming",
          "body": "Yep. I gave up alcohol and antidepressants I was healthier then than I am now. I have an ED and I know damn well I was healthier before. The shitty thing is she flaunts all this on social media and kids look up to her and will want to be just as small as her. Ariana triggers my ED a lot but that’s my problem not hers. But she should be more aware….",
          "created_utc": 1710602663.0
        }
      ]
    },
    {
      "id": "ksq4omd",
      "author": "nosnhoj-mas",
      "body": "YES! Like exactly like what I looked like at my worst and I’m genuinely upset at how much that video affected me, my brain is really fighting me on it!",
      "created_utc": 1709228919.0,
      "score": 1,
      "context": [
        {
          "id": "kso5vvs",
          "author": "nosnhoj-mas",
          "body": "This thread made me feel sane again. I saw a recent interview w/ her and was shocked to see the state of her body. So insanely triggering. I thought it was just ED brain talking but I have only ever seen such thinness in direct connection to disorder eating or very poor health, both of which she claims not to have. I want to be body positive but it feels like she’s being dishonest or at the very least encouraging dangerous behavior by promoting this image.",
          "created_utc": 1709196943.0
        },
        {
          "id": "ksorbet",
          "author": "doyoueverhaveadream",
          "body": "Was it the one of her in the red dress? Because that’s what sent me here too, had to stop the video bc it reminded me of my body when I was at my worst.",
          "created_utc": 1709210831.0
        }
      ]
    },
    {
      "id": "kyxca8g",
      "author": "TerribleAuthor7",
      "body": "Have you heard of a class of antidiabetic meds called Semaglutide aka Ozempic/Wegovy/Mounjaro, among others?",
      "created_utc": 1712759261.0,
      "score": 1,
      "context": [
        {
          "id": "kuk2l6e",
          "author": "Tight-Pitch6488",
          "body": "Everyone else in Hollywood is losing weight right now. It’s the trendy thing to do. Why wouldn’t Ariana follow suit?",
          "created_utc": 1710267681.0
        },
        {
          "id": "kw09u48",
          "author": "Atxlvr",
          "body": "Wonder if it's related to the price of cocaine dropping suddenly over the last year",
          "created_utc": 1711086380.0
        }
      ]
    },
    {
      "id": "kyxdeyb",
      "author": "TerribleAuthor7",
      "body": "It’s because BBLs are out and Ozempic is in. Celebrities such as Oprah/Elon Musk/Chelsea Handler have admitted to being on it. Oprah had to resign from the board of WW because she publicly admitted to losing weight due to the side effects of Ozempic. The Kardashians and Jenners are all reportedly taking it, Kelly Clarkson is clearly on it, Christiana Aguilera, among many others.",
      "created_utc": 1712759664.0,
      "score": 1,
      "context": [
        {
          "id": "kuk2l6e",
          "author": "Tight-Pitch6488",
          "body": "Everyone else in Hollywood is losing weight right now. It’s the trendy thing to do. Why wouldn’t Ariana follow suit?",
          "created_utc": 1710267681.0
        },
        {
          "id": "kyrb9u6",
          "author": "None",
          "body": "Apparently from what my friend told me yesterday at dinner, ED is the new trend. (Sickly, I know, I don't know if it's true or not but it's heart breaking.)",
          "created_utc": 1712664947.0
        }
      ]
    },
    {
      "id": "kv5yg6u",
      "author": "lunajustine",
      "body": "Just chiming in to say that's a fantastic point 👏",
      "created_utc": 1710610473.0,
      "score": 2,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        },
        {
          "id": "kupbcx6",
          "author": "SuddenReturn9027",
          "body": "Genuinely not asking to be mean and am just genuinely curious but how can sleeping with a married man be a symptom of ED?",
          "created_utc": 1710349635.0
        },
        {
          "id": "kv163ua",
          "author": "thereisbeauty7",
          "body": "To add to what others have said, your brain is a part of your body and so starving your body also starves your brain. It inhibits your ability to think about things clearly and critically, and can lead to making very poor and even unhinged life choices.",
          "created_utc": 1710529005.0
        }
      ]
    },
    {
      "id": "kwa0ntu",
      "author": "Ok-Assistance-1860",
      "body": "Truth. I ended up in a locked mental health unit and it had nothing to do with the ED on paper...but it had EVERYTHING to do with it because bad choices. You don't see the world right. I wish someone had told me in my twenties the long term effects...brain fog, thinner hair than never bounces back, aging WAY faster. Not worth it.",
      "created_utc": 1711242472.0,
      "score": 1,
      "context": [
        {
          "id": "k6gnbs8",
          "author": "updown27",
          "body": "Yes. You can see it in her eyes and mouth. And she said something recently like \"if you have something to say about someone's body they probably already know and *have a team of professionals helping them*\" which screams ED to me, unless she is genuinely sick some other way. Also we know she is vegan and incredibly selective about what she will eat. I really hope she has a change soon. I personally even think that her sudden relationship change and choosing to start a romance with a married man who just had a baby is a symptom of her ED and inability to make good life choices. I was hella problematic when I was my sickest and it's just too familiar.",
          "created_utc": 1698274471.0
        },
        {
          "id": "kupbcx6",
          "author": "SuddenReturn9027",
          "body": "Genuinely not asking to be mean and am just genuinely curious but how can sleeping with a married man be a symptom of ED?",
          "created_utc": 1710349635.0
        },
        {
          "id": "kv163ua",
          "author": "thereisbeauty7",
          "body": "To add to what others have said, your brain is a part of your body and so starving your body also starves your brain. It inhibits your ability to think about things clearly and critically, and can lead to making very poor and even unhinged life choices.",
          "created_utc": 1710529005.0
        }
      ]
    },
    {
      "id": "ksti53b",
      "author": "soynugget95",
      "body": "What drives me fucking crazy is the way she’s come out and said “this is because I’m eating healthy! I changed my diet to be more nutritious. I’m my healthiest self :)” and her fans fucking buy it. I also hate the way people say it’s “just because she’s petite”. I told people I was underweight and undereating because I was short, too, but it’s 100% bullshit.",
      "created_utc": 1709275785.0,
      "score": 13,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        }
      ]
    },
    {
      "id": "kt0mtwi",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1709396288.0,
      "score": 2,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        }
      ]
    },
    {
      "id": "kvt3oii",
      "author": "friendofspidey",
      "body": "Her natural body is deff her cat body",
      "created_utc": 1710975685.0,
      "score": 3,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        }
      ]
    },
    {
      "id": "k6h4o4r",
      "author": "gardenkitties",
      "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
      "created_utc": 1698281650.0,
      "score": 2,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        }
      ]
    },
    {
      "id": "kurt3ad",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1710380278.0,
      "score": 2,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        },
        {
          "id": "kg28ia8",
          "author": "None",
          "body": "literally a body checking post. made me sick",
          "created_utc": 1704244373.0
        },
        {
          "id": "ktt4vs2",
          "author": "None",
          "body": "a picture of her with her body in it is now ‘body checking’",
          "created_utc": 1709840194.0
        }
      ]
    },
    {
      "id": "ku9c48a",
      "author": "None",
      "body": "she was probably eating like shit. during her thank you next era she was just as skinny, when someone goes on a diet they’re obviously gonna drop weight.",
      "created_utc": 1710097899.0,
      "score": 1,
      "context": [
        {
          "id": "k6lxi3j",
          "author": "_senator_patootie_",
          "body": "I always cringe when I see her. It's hard to avoid her since she is so insanely popular, but she makes my ed kick into competitive mode. Plus i hate when people say \"shes naturally thin\" like there is naturally thin and then there is sickly. Idc what anyone says shes not healthy and saying people like that are \"natural\" only makes matters worse.",
          "created_utc": 1698362542.0
        },
        {
          "id": "ktt53sl",
          "author": "None",
          "body": "she literally is naturally thin tho. she’s always been skinny.",
          "created_utc": 1709840289.0
        },
        {
          "id": "ku6e599",
          "author": "tokengrip",
          "body": "not really i mean ive been watching victorious and yes shes a healthy weight but she did have curves once upon a time",
          "created_utc": 1710045118.0
        }
      ]
    },
    {
      "id": "khol37s",
      "author": "Parking-Start2196",
      "body": "i felt so bad bringing it up at first because the literal message from her \"yes, and?\" music video is for people to stop commenting on her body - especially when it comes to a possible ED (like she mentioned in that one tiktok a few months ago), but i just can't stay silent.  i know she doesn't like people comparing her body to her TUN era because she was also unhealthy then too from binge drinking.  however, i'm not out here trying to compare her old body to her new one.... i'm just recognizing signs from when my ED was bad about 7 or 8 years ago.  she's always been naturally skinny, but even when she was younger on sam & cat she didn't look this bony.  i truly love her and want the best for her & i feel like 2023 was an incredibly hard year for her.",
      "created_utc": 1705162557.0,
      "score": 7,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "kho214p",
          "author": "None",
          "body": "She is absolutely not healthy. Yes I believe that she is naturally thin. But I don’t buy her justifying her weight loss to the fact that she reduced or stopped her anti depressant meds. It is also incredibly tone deaf to say such things that could trigger younger depressed fans to stop taking life saving medication.\n\nAs a survivor of many deep ED episodes myself (during which I was on a ton of anti anxiety and anti depressant meds, ) I can see clear signs of her being dangerously underweight.\n\nThe dead eyes, the need to wear so many layers all the time because she is so cold. The fact that we can now see every bone of her body. The state of her hair when you look at the roots, she barely has any. \n\nThe constant body checking pictures on her ig. The obvious trouble she had with singing during her last London live show. You can also see the lack of energy she displays during the choreography of her last MV, yes and? \n\nI love Ariana but I’m genuinely worried for her and the state of her body.",
          "created_utc": 1705154719.0
        }
      ]
    },
    {
      "id": "kuxucnp",
      "author": "bejeweledbabie",
      "body": "Look at her recent SNL performance. People are in the comments telling her she \"looks better than ever\" and it makes me sad because she looks unwell and is breathless the whole time.",
      "created_utc": 1710472350.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "kho214p",
          "author": "None",
          "body": "She is absolutely not healthy. Yes I believe that she is naturally thin. But I don’t buy her justifying her weight loss to the fact that she reduced or stopped her anti depressant meds. It is also incredibly tone deaf to say such things that could trigger younger depressed fans to stop taking life saving medication.\n\nAs a survivor of many deep ED episodes myself (during which I was on a ton of anti anxiety and anti depressant meds, ) I can see clear signs of her being dangerously underweight.\n\nThe dead eyes, the need to wear so many layers all the time because she is so cold. The fact that we can now see every bone of her body. The state of her hair when you look at the roots, she barely has any. \n\nThe constant body checking pictures on her ig. The obvious trouble she had with singing during her last London live show. You can also see the lack of energy she displays during the choreography of her last MV, yes and? \n\nI love Ariana but I’m genuinely worried for her and the state of her body.",
          "created_utc": 1705154719.0
        }
      ]
    },
    {
      "id": "khokl83",
      "author": "Parking-Start2196",
      "body": "the chest was the thing that scared me the most... cause recently she's posted a lot of her collarbones so it's not as shocking to see, but especially when she was dancing, her chest plate was literally poking through",
      "created_utc": 1705162366.0,
      "score": 7,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "khnecsj",
          "author": "Ok_Bumblebee123",
          "body": "It’s so clear she is suffering from an eating disorder. Her body is looking more and more emaciated with time and when people have genuine concern their comments are deleted or written off as hate. Looking at her chest in her recent music video and seeing her bones was so chilling. She needs help.",
          "created_utc": 1705139885.0
        }
      ]
    },
    {
      "id": "ku3kl8t",
      "author": "LongHeelRedBottoms",
      "body": "She always has dated guys on drugs. That part isn’t new. There was a photo with white in her nose around 2016 but since attention was brought to it, I can’t find it now.",
      "created_utc": 1710005957.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "kscek7w",
          "author": "coneyisland92",
          "body": "The fact she has said that back then was the unhealthiest body she had, I rolled my eyes. Yes, because you look so healthy now 🙄 it’s sad how much she is in denial. \n\nI also feel she is on drugs, did you see the photo of her and Ethan leaving the car? Yeah….",
          "created_utc": 1709017926.0
        }
      ]
    },
    {
      "id": "kuxumhl",
      "author": "bejeweledbabie",
      "body": "She wants us to be in denial of what's in front of our eyes. It's a part of the disease. She doesn't look well right now.",
      "created_utc": 1710472471.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "kscek7w",
          "author": "coneyisland92",
          "body": "The fact she has said that back then was the unhealthiest body she had, I rolled my eyes. Yes, because you look so healthy now 🙄 it’s sad how much she is in denial. \n\nI also feel she is on drugs, did you see the photo of her and Ethan leaving the car? Yeah….",
          "created_utc": 1709017926.0
        }
      ]
    },
    {
      "id": "ksysujs",
      "author": "United-Path5601",
      "body": "Good take",
      "created_utc": 1709358420.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khjjrbf",
          "author": "United-Path5601",
          "body": "It’s actually scary and reminds me sm of me at my worst, but no one is allowed to say anything about it",
          "created_utc": 1705079845.0
        },
        {
          "id": "kstior2",
          "author": "soynugget95",
          "body": "It drives me mad and it’s also absurd because like… if she had just said “my body and my health are my own business and I’d really prefer if people respected that boundary” or something like that I’d be like, okay, she clearly has an ED but it’s her business. But the way she talks about how this is her healthiest self is honestly sick to me. It’s one thing to tell yourself that, but to tell tens of millions of people (mostly young women) that being this emaciated is the result of your healthiest behavior? That’s some shit and people SHOULD call it out.",
          "created_utc": 1709276133.0
        }
      ]
    },
    {
      "id": "ki3ze0y",
      "author": "DumbledoresaidCalmly",
      "body": "That might also just be the body dysmorphia adding those ten pounds lol",
      "created_utc": 1705404473.0,
      "score": 3,
      "context": [
        {
          "id": "khreop9",
          "author": "d993103164",
          "body": "the camera adds ten pounds , she looks dangerously thin on camera. in real life i cant imagine. appears to have ED but in denial, both to her self and her fans.",
          "created_utc": 1705199967.0
        },
        {
          "id": "khrqu8p",
          "author": "badromansss",
          "body": "I dont think camera nowadays add pounds tho, that is just an old hollywood thing",
          "created_utc": 1705204931.0
        },
        {
          "id": "khumnji",
          "author": "None",
          "body": "No, this still rings true. Have you ever tried taking a photo of your body? Pretty frustrating. Haha",
          "created_utc": 1705258357.0
        }
      ]
    },
    {
      "id": "kjdhiro",
      "author": "None",
      "body": "edit replied to the wrong person sorry",
      "created_utc": 1706116122.0,
      "score": 1,
      "context": [
        {
          "id": "khreop9",
          "author": "d993103164",
          "body": "the camera adds ten pounds , she looks dangerously thin on camera. in real life i cant imagine. appears to have ED but in denial, both to her self and her fans.",
          "created_utc": 1705199967.0
        },
        {
          "id": "khrqu8p",
          "author": "badromansss",
          "body": "I dont think camera nowadays add pounds tho, that is just an old hollywood thing",
          "created_utc": 1705204931.0
        },
        {
          "id": "khumnji",
          "author": "None",
          "body": "No, this still rings true. Have you ever tried taking a photo of your body? Pretty frustrating. Haha",
          "created_utc": 1705258357.0
        }
      ]
    },
    {
      "id": "kwlvdvp",
      "author": "Forceablee",
      "body": "She alwaysss has her shoulders/arms/chest out now and it’s always flexed.. always…",
      "created_utc": 1711434493.0,
      "score": 1,
      "context": [
        {
          "id": "k6pxozq",
          "author": "putsweynh",
          "body": "atp she does bodychecks 24/7 i love her but its obvious",
          "created_utc": 1698433466.0
        },
        {
          "id": "kv5as5q",
          "author": "cheyennenotwyoming",
          "body": "Body checks?",
          "created_utc": 1710601631.0
        },
        {
          "id": "kv8n0e1",
          "author": "senpaistealerx",
          "body": "they’re saying she purposely posts/shows very thin looking photos/videos of herself",
          "created_utc": 1710650021.0
        }
      ]
    },
    {
      "id": "ksgoz9p",
      "author": "lurk537",
      "body": "You realize there are minors that have gone thru puberty and therefore they have “adult-like” bodies? Not all age groups have one specific look, and you look goofy trying to deny that.",
      "created_utc": 1709081115.0,
      "score": 2,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "kp4dx7x",
          "author": "None",
          "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
          "created_utc": 1707186317.0
        },
        {
          "id": "kpvvqm7",
          "author": "Tight_Quarter5117",
          "body": "I disagree and you can disagree as well and we can both live our lives happily 😊",
          "created_utc": 1707627926.0
        }
      ]
    },
    {
      "id": "kvfuf10",
      "author": "favorbold",
      "body": "Their proof 😞 my best friend told me last summer that I’m so brave for being as big as I am and letting my stomach hang out like a child. And that she fasts and meditates and it’s super spiritual for her and I should practice it. She’s literally covered in rashes and turns white often because she’s so unhealthy. We see right through it girl ",
      "created_utc": 1710776487.0,
      "score": 3,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "ksti53b",
          "author": "soynugget95",
          "body": "What drives me fucking crazy is the way she’s come out and said “this is because I’m eating healthy! I changed my diet to be more nutritious. I’m my healthiest self :)” and her fans fucking buy it. I also hate the way people say it’s “just because she’s petite”. I told people I was underweight and undereating because I was short, too, but it’s 100% bullshit.",
          "created_utc": 1709275785.0
        }
      ]
    },
    {
      "id": "kvu6yhf",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1710990998.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "ksti53b",
          "author": "soynugget95",
          "body": "What drives me fucking crazy is the way she’s come out and said “this is because I’m eating healthy! I changed my diet to be more nutritious. I’m my healthiest self :)” and her fans fucking buy it. I also hate the way people say it’s “just because she’s petite”. I told people I was underweight and undereating because I was short, too, but it’s 100% bullshit.",
          "created_utc": 1709275785.0
        }
      ]
    },
    {
      "id": "kywhkec",
      "author": "TerribleAuthor7",
      "body": "She hasn’t been wearing her hair in a ponytail since early 2020 though… her hair has been down since the positions era which was in late 2020 & baggy sweatshirts and sweatpants  was her street style in 2018 -2019 which was her at her most successful. She even wore baggy sweat shirts in some of her tv appearances in 2019. \nI don’t think Ariana looks healthy (at her current weight) and I’m not one to dismiss whatever trauma might have happened to her in her younger years either but just saying.. like her style has changed quite a bit in the past 4 years. Right now, her style is more mature compared to what she used to wear earlier in her career, even with the boots.",
      "created_utc": 1712745092.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "kt0mtwi",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1709396288.0
        }
      ]
    },
    {
      "id": "k6hb3g2",
      "author": "Queenofwands1212",
      "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
      "created_utc": 1698284335.0,
      "score": 14,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        }
      ]
    },
    {
      "id": "kuxkw6o",
      "author": "None",
      "body": "obviously anorexic? we don’t know this woman.",
      "created_utc": 1710468395.0,
      "score": 1,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        },
        {
          "id": "kg28ia8",
          "author": "None",
          "body": "literally a body checking post. made me sick",
          "created_utc": 1704244373.0
        },
        {
          "id": "ktt4vs2",
          "author": "None",
          "body": "a picture of her with her body in it is now ‘body checking’",
          "created_utc": 1709840194.0
        },
        {
          "id": "kurt3ad",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710380278.0
        }
      ]
    },
    {
      "id": "kv8m3lc",
      "author": "senpaistealerx",
      "body": "where’s the source?",
      "created_utc": 1710649535.0,
      "score": 1,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        },
        {
          "id": "kg28ia8",
          "author": "None",
          "body": "literally a body checking post. made me sick",
          "created_utc": 1704244373.0
        },
        {
          "id": "ktt4vs2",
          "author": "None",
          "body": "a picture of her with her body in it is now ‘body checking’",
          "created_utc": 1709840194.0
        },
        {
          "id": "kurt3ad",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710380278.0
        }
      ]
    },
    {
      "id": "kunwjd1",
      "author": "maddylelu73",
      "body": "You could just as easily say she’s “eating like shit” now as in not enough nutrition. Its all speculation since none of us know what she eats everyday then or now. But objectively, looking at what we can see, she was a healthy weight during victorious and looks sickly skinny now. And the only reason victorious is brought up is in response to people saying she’s naturally that thin and has always been that thin. It’s proof that her body is capable of fluctuating and it is a choice for her to be that skinny now. She had a very active lifestyle at that time of victorious (and now obviously) and there’s no proof of her eating unhealthy or anything.. she was a normal healthy weight for a 16-19 year old",
      "created_utc": 1710330819.0,
      "score": 1,
      "context": [
        {
          "id": "k6lxi3j",
          "author": "_senator_patootie_",
          "body": "I always cringe when I see her. It's hard to avoid her since she is so insanely popular, but she makes my ed kick into competitive mode. Plus i hate when people say \"shes naturally thin\" like there is naturally thin and then there is sickly. Idc what anyone says shes not healthy and saying people like that are \"natural\" only makes matters worse.",
          "created_utc": 1698362542.0
        },
        {
          "id": "ktt53sl",
          "author": "None",
          "body": "she literally is naturally thin tho. she’s always been skinny.",
          "created_utc": 1709840289.0
        },
        {
          "id": "ku6e599",
          "author": "tokengrip",
          "body": "not really i mean ive been watching victorious and yes shes a healthy weight but she did have curves once upon a time",
          "created_utc": 1710045118.0
        },
        {
          "id": "ku9c48a",
          "author": "None",
          "body": "she was probably eating like shit. during her thank you next era she was just as skinny, when someone goes on a diet they’re obviously gonna drop weight.",
          "created_utc": 1710097899.0
        }
      ]
    },
    {
      "id": "kholqrt",
      "author": "None",
      "body": "You shouldn’t feel bad for bringing this up. We are not shaming her. This is just us being worried. At the height of my ED all I did was justifying myself and saying i was at my happiest and just ate better when i was starving myself.\n\nI hope we are wrong truly! This is just scary. There is no sparks behind her eyes anymore.",
      "created_utc": 1705162802.0,
      "score": 7,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "kho214p",
          "author": "None",
          "body": "She is absolutely not healthy. Yes I believe that she is naturally thin. But I don’t buy her justifying her weight loss to the fact that she reduced or stopped her anti depressant meds. It is also incredibly tone deaf to say such things that could trigger younger depressed fans to stop taking life saving medication.\n\nAs a survivor of many deep ED episodes myself (during which I was on a ton of anti anxiety and anti depressant meds, ) I can see clear signs of her being dangerously underweight.\n\nThe dead eyes, the need to wear so many layers all the time because she is so cold. The fact that we can now see every bone of her body. The state of her hair when you look at the roots, she barely has any. \n\nThe constant body checking pictures on her ig. The obvious trouble she had with singing during her last London live show. You can also see the lack of energy she displays during the choreography of her last MV, yes and? \n\nI love Ariana but I’m genuinely worried for her and the state of her body.",
          "created_utc": 1705154719.0
        },
        {
          "id": "khol37s",
          "author": "Parking-Start2196",
          "body": "i felt so bad bringing it up at first because the literal message from her \"yes, and?\" music video is for people to stop commenting on her body - especially when it comes to a possible ED (like she mentioned in that one tiktok a few months ago), but i just can't stay silent.  i know she doesn't like people comparing her body to her TUN era because she was also unhealthy then too from binge drinking.  however, i'm not out here trying to compare her old body to her new one.... i'm just recognizing signs from when my ED was bad about 7 or 8 years ago.  she's always been naturally skinny, but even when she was younger on sam & cat she didn't look this bony.  i truly love her and want the best for her & i feel like 2023 was an incredibly hard year for her.",
          "created_utc": 1705162557.0
        }
      ]
    },
    {
      "id": "kvjktn1",
      "author": "No_Combination_1673",
      "body": "people are so blinded by their fatphobia that they think looking like you’re on the verge of death is better than the tiniest bit of fat on your body",
      "created_utc": 1710828791.0,
      "score": 1,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "kho214p",
          "author": "None",
          "body": "She is absolutely not healthy. Yes I believe that she is naturally thin. But I don’t buy her justifying her weight loss to the fact that she reduced or stopped her anti depressant meds. It is also incredibly tone deaf to say such things that could trigger younger depressed fans to stop taking life saving medication.\n\nAs a survivor of many deep ED episodes myself (during which I was on a ton of anti anxiety and anti depressant meds, ) I can see clear signs of her being dangerously underweight.\n\nThe dead eyes, the need to wear so many layers all the time because she is so cold. The fact that we can now see every bone of her body. The state of her hair when you look at the roots, she barely has any. \n\nThe constant body checking pictures on her ig. The obvious trouble she had with singing during her last London live show. You can also see the lack of energy she displays during the choreography of her last MV, yes and? \n\nI love Ariana but I’m genuinely worried for her and the state of her body.",
          "created_utc": 1705154719.0
        },
        {
          "id": "kuxucnp",
          "author": "bejeweledbabie",
          "body": "Look at her recent SNL performance. People are in the comments telling her she \"looks better than ever\" and it makes me sad because she looks unwell and is breathless the whole time.",
          "created_utc": 1710472350.0
        }
      ]
    },
    {
      "id": "kpuas8o",
      "author": "OtterDisWorld",
      "body": "Being able to fully see every bump in her sternum is what really got to me, too.",
      "created_utc": 1707603314.0,
      "score": 3,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "khnecsj",
          "author": "Ok_Bumblebee123",
          "body": "It’s so clear she is suffering from an eating disorder. Her body is looking more and more emaciated with time and when people have genuine concern their comments are deleted or written off as hate. Looking at her chest in her recent music video and seeing her bones was so chilling. She needs help.",
          "created_utc": 1705139885.0
        },
        {
          "id": "khokl83",
          "author": "Parking-Start2196",
          "body": "the chest was the thing that scared me the most... cause recently she's posted a lot of her collarbones so it's not as shocking to see, but especially when she was dancing, her chest plate was literally poking through",
          "created_utc": 1705162366.0
        }
      ]
    },
    {
      "id": "ku8lh7r",
      "author": "coneyisland92",
      "body": "Sad, you think after what happened to Mac she would learn. But it’s just a thought ofc",
      "created_utc": 1710088666.0,
      "score": 2,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "kscek7w",
          "author": "coneyisland92",
          "body": "The fact she has said that back then was the unhealthiest body she had, I rolled my eyes. Yes, because you look so healthy now 🙄 it’s sad how much she is in denial. \n\nI also feel she is on drugs, did you see the photo of her and Ethan leaving the car? Yeah….",
          "created_utc": 1709017926.0
        },
        {
          "id": "ku3kl8t",
          "author": "LongHeelRedBottoms",
          "body": "She always has dated guys on drugs. That part isn’t new. There was a photo with white in her nose around 2016 but since attention was brought to it, I can’t find it now.",
          "created_utc": 1710005957.0
        }
      ]
    },
    {
      "id": "kih79na",
      "author": "wildly_domestic",
      "body": "It’s because cameras actually flatten the image. It has to do with focal length.",
      "created_utc": 1705605820.0,
      "score": 7,
      "context": [
        {
          "id": "khreop9",
          "author": "d993103164",
          "body": "the camera adds ten pounds , she looks dangerously thin on camera. in real life i cant imagine. appears to have ED but in denial, both to her self and her fans.",
          "created_utc": 1705199967.0
        },
        {
          "id": "khrqu8p",
          "author": "badromansss",
          "body": "I dont think camera nowadays add pounds tho, that is just an old hollywood thing",
          "created_utc": 1705204931.0
        },
        {
          "id": "khumnji",
          "author": "None",
          "body": "No, this still rings true. Have you ever tried taking a photo of your body? Pretty frustrating. Haha",
          "created_utc": 1705258357.0
        },
        {
          "id": "ki3ze0y",
          "author": "DumbledoresaidCalmly",
          "body": "That might also just be the body dysmorphia adding those ten pounds lol",
          "created_utc": 1705404473.0
        }
      ]
    },
    {
      "id": "kww1t7f",
      "author": "senpaistealerx",
      "body": "but that’s simply not true",
      "created_utc": 1711588403.0,
      "score": 1,
      "context": [
        {
          "id": "k6pxozq",
          "author": "putsweynh",
          "body": "atp she does bodychecks 24/7 i love her but its obvious",
          "created_utc": 1698433466.0
        },
        {
          "id": "kv5as5q",
          "author": "cheyennenotwyoming",
          "body": "Body checks?",
          "created_utc": 1710601631.0
        },
        {
          "id": "kv8n0e1",
          "author": "senpaistealerx",
          "body": "they’re saying she purposely posts/shows very thin looking photos/videos of herself",
          "created_utc": 1710650021.0
        },
        {
          "id": "kwlvdvp",
          "author": "Forceablee",
          "body": "She alwaysss has her shoulders/arms/chest out now and it’s always flexed.. always…",
          "created_utc": 1711434493.0
        }
      ]
    },
    {
      "id": "ksgr5u4",
      "author": "Tight_Quarter5117",
      "body": "What does that have to do with an adult woman who went through puberty YEARS AGO, restricting and binging to appear child-like and small? Furthermore,  you look goofy and silly trying to argue with someone online because you don't agree with what they said. You CAN just scroll bye, but hey...some look like kids and some ACT like kids.",
      "created_utc": 1709081922.0,
      "score": 1,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "kp4dx7x",
          "author": "None",
          "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
          "created_utc": 1707186317.0
        },
        {
          "id": "kpvvqm7",
          "author": "Tight_Quarter5117",
          "body": "I disagree and you can disagree as well and we can both live our lives happily 😊",
          "created_utc": 1707627926.0
        },
        {
          "id": "ksgoz9p",
          "author": "lurk537",
          "body": "You realize there are minors that have gone thru puberty and therefore they have “adult-like” bodies? Not all age groups have one specific look, and you look goofy trying to deny that.",
          "created_utc": 1709081115.0
        }
      ]
    },
    {
      "id": "kvn6x6t",
      "author": "BewilderedStudent",
      "body": "girl get a new best friend",
      "created_utc": 1710885343.0,
      "score": 5,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "ksti53b",
          "author": "soynugget95",
          "body": "What drives me fucking crazy is the way she’s come out and said “this is because I’m eating healthy! I changed my diet to be more nutritious. I’m my healthiest self :)” and her fans fucking buy it. I also hate the way people say it’s “just because she’s petite”. I told people I was underweight and undereating because I was short, too, but it’s 100% bullshit.",
          "created_utc": 1709275785.0
        },
        {
          "id": "kvfuf10",
          "author": "favorbold",
          "body": "Their proof 😞 my best friend told me last summer that I’m so brave for being as big as I am and letting my stomach hang out like a child. And that she fasts and meditates and it’s super spiritual for her and I should practice it. She’s literally covered in rashes and turns white often because she’s so unhealthy. We see right through it girl ",
          "created_utc": 1710776487.0
        }
      ]
    },
    {
      "id": "kwa16dv",
      "author": "Ok-Assistance-1860",
      "body": "i've wondered about this. both are messed up.",
      "created_utc": 1711242688.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "ksti53b",
          "author": "soynugget95",
          "body": "What drives me fucking crazy is the way she’s come out and said “this is because I’m eating healthy! I changed my diet to be more nutritious. I’m my healthiest self :)” and her fans fucking buy it. I also hate the way people say it’s “just because she’s petite”. I told people I was underweight and undereating because I was short, too, but it’s 100% bullshit.",
          "created_utc": 1709275785.0
        },
        {
          "id": "kvu6yhf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710990998.0
        }
      ]
    },
    {
      "id": "kxef5te",
      "author": "chibi_desh",
      "body": "After watching quiet on set,  I actually thought the same thing.  Most of these girls (who worked with Schneider) had been self-destructive in different ways. I wonder if this is Ariana's type of addiction/coping. It doesn't excuse any of her actions but I do have some sympathy for her. I hope she's getting ALL the help she needs if this is the case. People can call out her actions but I think the name calling and mean comments should really stop. Slightly off topic, but I can't help but draw parallels between her and Justin Bieber.",
      "created_utc": 1711894999.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "ksti53b",
          "author": "soynugget95",
          "body": "What drives me fucking crazy is the way she’s come out and said “this is because I’m eating healthy! I changed my diet to be more nutritious. I’m my healthiest self :)” and her fans fucking buy it. I also hate the way people say it’s “just because she’s petite”. I told people I was underweight and undereating because I was short, too, but it’s 100% bullshit.",
          "created_utc": 1709275785.0
        },
        {
          "id": "kvu6yhf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710990998.0
        }
      ]
    },
    {
      "id": "k6hc72a",
      "author": "gardenkitties",
      "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
      "created_utc": 1698284802.0,
      "score": 5,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        }
      ]
    },
    {
      "id": "kwa343u",
      "author": "Ok-Assistance-1860",
      "body": "the thing is...orthorexia bleeds into anorexia sooooo easily. Who DIDNT start by \"being healthy?\" Who didn't lie to themselves and say they were just \"avoiding junk\" and \"being active?\"\n\nIt's the same for Kate Middleton. I hope she is on the mend and I wish her health and happiness. Obviously her illness has caused her to lose weight. Thing is, she had many of the hallmarks of an ED ahead of becoming ill. Yet the official word was always \"she eats healthy and has always been active\"\n\nAriana, Kate, Julie Bowen, Kelly Ripa...so many high profile women over 40 blur the line between \"being healthy\" and having unhealthy relationships with food.",
      "created_utc": 1711243496.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        }
      ]
    },
    {
      "id": "kwt91it",
      "author": "Ok-Assistance-1860",
      "body": "Okay but no, she went from already fit and thin to literally her bones showing between her breasts. \n\nThere is no healthy diet and exercise program that takes a woman whose BMI is considered low to someone whose ribs show from the front. Some say well maybe it's her dance rehearsals ... oh really? If that was true then why is she even smaller than mainstream ballerinas? (who commonly have EDs by the way) \n\nNo one is saying they know for certain she is anorexic. Of course we don't. But there exists no healthy way to get to her size. For the .0001% of the population who are \"naturally\" that size, their doctor is going to be telling them to drink Boost and eat peanut butter, and do blood work to find out if they have an autoimmune disorder.\n\nThis community is full of people who know ED. It is a MORE than reasonable assumption, given the sunken eyes and fuzzy arms, to hypothesize that she has an eating issue.",
      "created_utc": 1711554035.0,
      "score": 2,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        },
        {
          "id": "kg28ia8",
          "author": "None",
          "body": "literally a body checking post. made me sick",
          "created_utc": 1704244373.0
        },
        {
          "id": "ktt4vs2",
          "author": "None",
          "body": "a picture of her with her body in it is now ‘body checking’",
          "created_utc": 1709840194.0
        },
        {
          "id": "kurt3ad",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710380278.0
        },
        {
          "id": "kuxkw6o",
          "author": "None",
          "body": "obviously anorexic? we don’t know this woman.",
          "created_utc": 1710468395.0
        }
      ]
    },
    {
      "id": "kv8m7r1",
      "author": "senpaistealerx",
      "body": "this thread is like.. wild to me cause literally what source says she has an ed? yes, she’s very skinny and has lost weight but why does everyone jump to ed? and with *zero* (being shown) cites?",
      "created_utc": 1710649597.0,
      "score": 1,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        },
        {
          "id": "kg28ia8",
          "author": "None",
          "body": "literally a body checking post. made me sick",
          "created_utc": 1704244373.0
        },
        {
          "id": "ktt4vs2",
          "author": "None",
          "body": "a picture of her with her body in it is now ‘body checking’",
          "created_utc": 1709840194.0
        },
        {
          "id": "kurt3ad",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710380278.0
        },
        {
          "id": "kuxkw6o",
          "author": "None",
          "body": "obviously anorexic? we don’t know this woman.",
          "created_utc": 1710468395.0
        }
      ]
    },
    {
      "id": "kveri25",
      "author": "None",
      "body": "apparently you cannot look at someone and tell they're underweight. fuck off, you and anime porn brain are on my nerves",
      "created_utc": 1710759420.0,
      "score": 1,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        },
        {
          "id": "kg28ia8",
          "author": "None",
          "body": "literally a body checking post. made me sick",
          "created_utc": 1704244373.0
        },
        {
          "id": "ktt4vs2",
          "author": "None",
          "body": "a picture of her with her body in it is now ‘body checking’",
          "created_utc": 1709840194.0
        },
        {
          "id": "kurt3ad",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710380278.0
        },
        {
          "id": "kuxkw6o",
          "author": "None",
          "body": "obviously anorexic? we don’t know this woman.",
          "created_utc": 1710468395.0
        }
      ]
    },
    {
      "id": "kvere50",
      "author": "None",
      "body": "yo mama",
      "created_utc": 1710759350.0,
      "score": 2,
      "context": [
        {
          "id": "k6ju9rk",
          "author": "Littlesadsloth",
          "body": "Yeppppp that photo of her in that guitar case was… wowza. Had to unfollow after that.",
          "created_utc": 1698334670.0
        },
        {
          "id": "kg28ia8",
          "author": "None",
          "body": "literally a body checking post. made me sick",
          "created_utc": 1704244373.0
        },
        {
          "id": "ktt4vs2",
          "author": "None",
          "body": "a picture of her with her body in it is now ‘body checking’",
          "created_utc": 1709840194.0
        },
        {
          "id": "kurt3ad",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1710380278.0
        },
        {
          "id": "kv8m3lc",
          "author": "senpaistealerx",
          "body": "where’s the source?",
          "created_utc": 1710649535.0
        }
      ]
    },
    {
      "id": "kvl3ups",
      "author": "bejeweledbabie",
      "body": "Yeah it's funny how quick people are to point out how unhealthy obesity is but ariana is probably just as unhealthy. It makes me sad. I know she's problematic but she was a child star. Hopefully she can find a way to really get to the root of her traumas and heal.",
      "created_utc": 1710860002.0,
      "score": 1,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "kho214p",
          "author": "None",
          "body": "She is absolutely not healthy. Yes I believe that she is naturally thin. But I don’t buy her justifying her weight loss to the fact that she reduced or stopped her anti depressant meds. It is also incredibly tone deaf to say such things that could trigger younger depressed fans to stop taking life saving medication.\n\nAs a survivor of many deep ED episodes myself (during which I was on a ton of anti anxiety and anti depressant meds, ) I can see clear signs of her being dangerously underweight.\n\nThe dead eyes, the need to wear so many layers all the time because she is so cold. The fact that we can now see every bone of her body. The state of her hair when you look at the roots, she barely has any. \n\nThe constant body checking pictures on her ig. The obvious trouble she had with singing during her last London live show. You can also see the lack of energy she displays during the choreography of her last MV, yes and? \n\nI love Ariana but I’m genuinely worried for her and the state of her body.",
          "created_utc": 1705154719.0
        },
        {
          "id": "kuxucnp",
          "author": "bejeweledbabie",
          "body": "Look at her recent SNL performance. People are in the comments telling her she \"looks better than ever\" and it makes me sad because she looks unwell and is breathless the whole time.",
          "created_utc": 1710472350.0
        },
        {
          "id": "kvjktn1",
          "author": "No_Combination_1673",
          "body": "people are so blinded by their fatphobia that they think looking like you’re on the verge of death is better than the tiniest bit of fat on your body",
          "created_utc": 1710828791.0
        }
      ]
    },
    {
      "id": "kuewblq",
      "author": "LongHeelRedBottoms",
      "body": "It’s hard and I do feel for her in a sense because there’s something wrong on the inside for her to be serial dating, cheating, ED, and possibly using. But yeah I agree with you.",
      "created_utc": 1710186237.0,
      "score": 1,
      "context": [
        {
          "id": "khjfi0k",
          "author": "Parking-Start2196",
          "body": "i love her & her new song is such a a banger! but her \"yes, and?\" music video was kinda triggering because you could see her ribs, collar bones, and spine :(",
          "created_utc": 1705078427.0
        },
        {
          "id": "khn0log",
          "author": "MajesticExpression98",
          "body": "Yep, that music video is why I’m here too. I’m shocked. Her weight in her younger years compared to now is shocking. Even TUN era, her cheeks, collarbone area, shoulders, looked more full and healthy. I don’t care what she says anymore, about how she is “at her healthiest now” and other things. I’m sorry, her body just looks restricted or unnatural, even sick, at this point. I hope she is okay.  \n\nI know there are different factors with lighting and things on a set. But it seems like she purposely tries to accentuate how thin, tiny, childlike, (whatever kind of appearance you want to call it) she is via specific poses and lighting. Which is honestly mental. \n\nI used to adore her. I will always think she is phenomenally talented and the vocalist of our generation. But I can’t wrap my mind around how she can genuinely be okay.",
          "created_utc": 1705129772.0
        },
        {
          "id": "kscek7w",
          "author": "coneyisland92",
          "body": "The fact she has said that back then was the unhealthiest body she had, I rolled my eyes. Yes, because you look so healthy now 🙄 it’s sad how much she is in denial. \n\nI also feel she is on drugs, did you see the photo of her and Ethan leaving the car? Yeah….",
          "created_utc": 1709017926.0
        },
        {
          "id": "ku3kl8t",
          "author": "LongHeelRedBottoms",
          "body": "She always has dated guys on drugs. That part isn’t new. There was a photo with white in her nose around 2016 but since attention was brought to it, I can’t find it now.",
          "created_utc": 1710005957.0
        },
        {
          "id": "ku8lh7r",
          "author": "coneyisland92",
          "body": "Sad, you think after what happened to Mac she would learn. But it’s just a thought ofc",
          "created_utc": 1710088666.0
        }
      ]
    },
    {
      "id": "kwwhpsi",
      "author": "Forceablee",
      "body": "It is either she is actually doing that, or she has such little fat left that it appears that way. You pick which you prefer cause that’s all there is, I think both. I’d upload attachments if I could, but you can see yourself on her instagram. \n\nShe was reported at 110 in early 2023, and now she is visibly probably at 100 or even less. Ontop of her complete 180 of her personality, people mature and grow but major change doesn’t come like that unless something unhealthy/dangerous is going on. Especially not at 30, same with weight. You don’t hit your lowest ever weight at 30 years old, baby you’re supposed to go thru second puberty and gain weight. \n\nYou may believe it isn’t my place or anyone’s place to comment on it, that’s valid, but to deny the plain obvious is insulting to everyone whose concerned, and outright dumb, and frankly more dangerous than having a conversation over “sparing hard feelings” \n\nIf something weren’t visibly going on, this entire thread ‘simply’ wouldn’t exist.",
      "created_utc": 1711594809.0,
      "score": 1,
      "context": [
        {
          "id": "k6pxozq",
          "author": "putsweynh",
          "body": "atp she does bodychecks 24/7 i love her but its obvious",
          "created_utc": 1698433466.0
        },
        {
          "id": "kv5as5q",
          "author": "cheyennenotwyoming",
          "body": "Body checks?",
          "created_utc": 1710601631.0
        },
        {
          "id": "kv8n0e1",
          "author": "senpaistealerx",
          "body": "they’re saying she purposely posts/shows very thin looking photos/videos of herself",
          "created_utc": 1710650021.0
        },
        {
          "id": "kwlvdvp",
          "author": "Forceablee",
          "body": "She alwaysss has her shoulders/arms/chest out now and it’s always flexed.. always…",
          "created_utc": 1711434493.0
        },
        {
          "id": "kww1t7f",
          "author": "senpaistealerx",
          "body": "but that’s simply not true",
          "created_utc": 1711588403.0
        }
      ]
    },
    {
      "id": "kv8niud",
      "author": "senpaistealerx",
      "body": "that’s in *your mind* tho. what source do you have that she’s restricting and binging? AND specifically to look like a child? *you* look goofy as hell for this entire comment. y’all love to tell people “you can just scroll” as if you couldn’t do the same.",
      "created_utc": 1710650294.0,
      "score": 1,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "kp4dx7x",
          "author": "None",
          "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
          "created_utc": 1707186317.0
        },
        {
          "id": "kpvvqm7",
          "author": "Tight_Quarter5117",
          "body": "I disagree and you can disagree as well and we can both live our lives happily 😊",
          "created_utc": 1707627926.0
        },
        {
          "id": "ksgoz9p",
          "author": "lurk537",
          "body": "You realize there are minors that have gone thru puberty and therefore they have “adult-like” bodies? Not all age groups have one specific look, and you look goofy trying to deny that.",
          "created_utc": 1709081115.0
        },
        {
          "id": "ksgr5u4",
          "author": "Tight_Quarter5117",
          "body": "What does that have to do with an adult woman who went through puberty YEARS AGO, restricting and binging to appear child-like and small? Furthermore,  you look goofy and silly trying to argue with someone online because you don't agree with what they said. You CAN just scroll bye, but hey...some look like kids and some ACT like kids.",
          "created_utc": 1709081922.0
        }
      ]
    },
    {
      "id": "kvn7wth",
      "author": "favorbold",
      "body": "She’s toast.",
      "created_utc": 1710885679.0,
      "score": 2,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "ksti53b",
          "author": "soynugget95",
          "body": "What drives me fucking crazy is the way she’s come out and said “this is because I’m eating healthy! I changed my diet to be more nutritious. I’m my healthiest self :)” and her fans fucking buy it. I also hate the way people say it’s “just because she’s petite”. I told people I was underweight and undereating because I was short, too, but it’s 100% bullshit.",
          "created_utc": 1709275785.0
        },
        {
          "id": "kvfuf10",
          "author": "favorbold",
          "body": "Their proof 😞 my best friend told me last summer that I’m so brave for being as big as I am and letting my stomach hang out like a child. And that she fasts and meditates and it’s super spiritual for her and I should practice it. She’s literally covered in rashes and turns white often because she’s so unhealthy. We see right through it girl ",
          "created_utc": 1710776487.0
        },
        {
          "id": "kvn6x6t",
          "author": "BewilderedStudent",
          "body": "girl get a new best friend",
          "created_utc": 1710885343.0
        }
      ]
    },
    {
      "id": "kzc1dn4",
      "author": "Cheaper-Pitch-9498",
      "body": "Funnily enough, they were both under the same manager and are actually good friends",
      "created_utc": 1712978018.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "ksti53b",
          "author": "soynugget95",
          "body": "What drives me fucking crazy is the way she’s come out and said “this is because I’m eating healthy! I changed my diet to be more nutritious. I’m my healthiest self :)” and her fans fucking buy it. I also hate the way people say it’s “just because she’s petite”. I told people I was underweight and undereating because I was short, too, but it’s 100% bullshit.",
          "created_utc": 1709275785.0
        },
        {
          "id": "kvu6yhf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1710990998.0
        },
        {
          "id": "kxef5te",
          "author": "chibi_desh",
          "body": "After watching quiet on set,  I actually thought the same thing.  Most of these girls (who worked with Schneider) had been self-destructive in different ways. I wonder if this is Ariana's type of addiction/coping. It doesn't excuse any of her actions but I do have some sympathy for her. I hope she's getting ALL the help she needs if this is the case. People can call out her actions but I think the name calling and mean comments should really stop. Slightly off topic, but I can't help but draw parallels between her and Justin Bieber.",
          "created_utc": 1711894999.0
        }
      ]
    },
    {
      "id": "k6hfdvr",
      "author": "Queenofwands1212",
      "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
      "created_utc": 1698286147.0,
      "score": 10,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        }
      ]
    },
    {
      "id": "kwrqgqc",
      "author": "Calicojerk",
      "body": "Kate Middleton has cancer. It’s not the same.",
      "created_utc": 1711527696.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "kwa343u",
          "author": "Ok-Assistance-1860",
          "body": "the thing is...orthorexia bleeds into anorexia sooooo easily. Who DIDNT start by \"being healthy?\" Who didn't lie to themselves and say they were just \"avoiding junk\" and \"being active?\"\n\nIt's the same for Kate Middleton. I hope she is on the mend and I wish her health and happiness. Obviously her illness has caused her to lose weight. Thing is, she had many of the hallmarks of an ED ahead of becoming ill. Yet the official word was always \"she eats healthy and has always been active\"\n\nAriana, Kate, Julie Bowen, Kelly Ripa...so many high profile women over 40 blur the line between \"being healthy\" and having unhealthy relationships with food.",
          "created_utc": 1711243496.0
        }
      ]
    },
    {
      "id": "kv9wf7r",
      "author": "Tight_Quarter5117",
      "body": "But here YOU are, responding to something you could ignore,  since you don't agree. Kinds makes YOU look goofy",
      "created_utc": 1710680643.0,
      "score": 1,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "kp4dx7x",
          "author": "None",
          "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
          "created_utc": 1707186317.0
        },
        {
          "id": "kpvvqm7",
          "author": "Tight_Quarter5117",
          "body": "I disagree and you can disagree as well and we can both live our lives happily 😊",
          "created_utc": 1707627926.0
        },
        {
          "id": "ksgoz9p",
          "author": "lurk537",
          "body": "You realize there are minors that have gone thru puberty and therefore they have “adult-like” bodies? Not all age groups have one specific look, and you look goofy trying to deny that.",
          "created_utc": 1709081115.0
        },
        {
          "id": "ksgr5u4",
          "author": "Tight_Quarter5117",
          "body": "What does that have to do with an adult woman who went through puberty YEARS AGO, restricting and binging to appear child-like and small? Furthermore,  you look goofy and silly trying to argue with someone online because you don't agree with what they said. You CAN just scroll bye, but hey...some look like kids and some ACT like kids.",
          "created_utc": 1709081922.0
        },
        {
          "id": "kv8niud",
          "author": "senpaistealerx",
          "body": "that’s in *your mind* tho. what source do you have that she’s restricting and binging? AND specifically to look like a child? *you* look goofy as hell for this entire comment. y’all love to tell people “you can just scroll” as if you couldn’t do the same.",
          "created_utc": 1710650294.0
        }
      ]
    },
    {
      "id": "k6hfyg2",
      "author": "gardenkitties",
      "body": "I didn’t know she said that before. & I know it’s terrible :(",
      "created_utc": 1698286396.0,
      "score": 2,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        }
      ]
    },
    {
      "id": "kupc15v",
      "author": "SuddenReturn9027",
      "body": "I think when she said that, she was talking about gaining weight was her eating disorder e.g. binge-eating and now she's healthy which is just so manipulative and clearly untrue",
      "created_utc": 1710349856.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        }
      ]
    },
    {
      "id": "kwt6k8i",
      "author": "Ok-Assistance-1860",
      "body": "that's why i said \"obviously she has an illness\" and specified that I am referring to her PRIOR to becoming ill. She had many elements that I associate with ED long before she ever became ill. As I said.",
      "created_utc": 1711553208.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "kwa343u",
          "author": "Ok-Assistance-1860",
          "body": "the thing is...orthorexia bleeds into anorexia sooooo easily. Who DIDNT start by \"being healthy?\" Who didn't lie to themselves and say they were just \"avoiding junk\" and \"being active?\"\n\nIt's the same for Kate Middleton. I hope she is on the mend and I wish her health and happiness. Obviously her illness has caused her to lose weight. Thing is, she had many of the hallmarks of an ED ahead of becoming ill. Yet the official word was always \"she eats healthy and has always been active\"\n\nAriana, Kate, Julie Bowen, Kelly Ripa...so many high profile women over 40 blur the line between \"being healthy\" and having unhealthy relationships with food.",
          "created_utc": 1711243496.0
        },
        {
          "id": "kwrqgqc",
          "author": "Calicojerk",
          "body": "Kate Middleton has cancer. It’s not the same.",
          "created_utc": 1711527696.0
        }
      ]
    },
    {
      "id": "kva8fpn",
      "author": "senpaistealerx",
      "body": "i feel like you think you’re cooking so i’m gonna assume you’re 15 years old. take a long look in the mirror, for your own sake.",
      "created_utc": 1710685747.0,
      "score": 1,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "kp4dx7x",
          "author": "None",
          "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
          "created_utc": 1707186317.0
        },
        {
          "id": "kpvvqm7",
          "author": "Tight_Quarter5117",
          "body": "I disagree and you can disagree as well and we can both live our lives happily 😊",
          "created_utc": 1707627926.0
        },
        {
          "id": "ksgoz9p",
          "author": "lurk537",
          "body": "You realize there are minors that have gone thru puberty and therefore they have “adult-like” bodies? Not all age groups have one specific look, and you look goofy trying to deny that.",
          "created_utc": 1709081115.0
        },
        {
          "id": "ksgr5u4",
          "author": "Tight_Quarter5117",
          "body": "What does that have to do with an adult woman who went through puberty YEARS AGO, restricting and binging to appear child-like and small? Furthermore,  you look goofy and silly trying to argue with someone online because you don't agree with what they said. You CAN just scroll bye, but hey...some look like kids and some ACT like kids.",
          "created_utc": 1709081922.0
        },
        {
          "id": "kv8niud",
          "author": "senpaistealerx",
          "body": "that’s in *your mind* tho. what source do you have that she’s restricting and binging? AND specifically to look like a child? *you* look goofy as hell for this entire comment. y’all love to tell people “you can just scroll” as if you couldn’t do the same.",
          "created_utc": 1710650294.0
        },
        {
          "id": "kv9wf7r",
          "author": "Tight_Quarter5117",
          "body": "But here YOU are, responding to something you could ignore,  since you don't agree. Kinds makes YOU look goofy",
          "created_utc": 1710680643.0
        }
      ]
    },
    {
      "id": "k6hmo5m",
      "author": "Queenofwands1212",
      "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
      "created_utc": 1698289453.0,
      "score": 9,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        }
      ]
    },
    {
      "id": "kupc1pt",
      "author": "SuddenReturn9027",
      "body": "I think when she said that, she was talking about gaining weight was her eating disorder e.g. binge-eating and now she's healthy which is just so manipulative and clearly untrue",
      "created_utc": 1710349861.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        }
      ]
    },
    {
      "id": "kva9go4",
      "author": "Tight_Quarter5117",
      "body": "I'll let you think whatever you like! I'm gonna enjoy my day regardless",
      "created_utc": 1710686138.0,
      "score": 1,
      "context": [
        {
          "id": "kfhmawh",
          "author": "Tight_Quarter5117",
          "body": "She clearly has anorexia and enjoys being \"tiny\" and \"childlike \". We all know it's not natural and that she used to be heavier and looked much healthier. Any man that dates her is weird to me. Gives Pedo vibes because how can you date a woman who looks 12? That's attractive to you as a grown man?",
          "created_utc": 1703896268.0
        },
        {
          "id": "kp4dx7x",
          "author": "None",
          "body": "Listen, I agree with this thread, but these comments are harmful. Pedophiles are attracted to actual children, not someone who is underweight or thin. Children’s bones don’t always, or even often, show like that. Exposed bones don’t equal being a child. Pedophilia is not being attracted to women who look extremely thin and bony. Pedohpilia is being attracted to people who are quite literally and obviously *children*. \n\nBeing thin or severely underweight is not necessarily correlated with being childlike. Furthermore, implying that Ariana looks like a child because she’s so thin reads to me that you’re actually implying she looks like a child because she doesn’t have womanly “curves” aka breasts/hips/butt. There are plenty of women that do not have these features. They don’t deserve to be equated to 12 year olds rather than grown women. I get what you’re going for with comments like this, but just be careful what ideas you’re actually throwing out there. Some pedophiles are attracted to 15-16 year olds who *do* have curves. \n\nI completely agree that she has body issues, likely an ED, and looks very ill and concerning. But claiming that she looks like a child because of those things? Not accurate. Potentially harmful. Make better comments.",
          "created_utc": 1707186317.0
        },
        {
          "id": "kpvvqm7",
          "author": "Tight_Quarter5117",
          "body": "I disagree and you can disagree as well and we can both live our lives happily 😊",
          "created_utc": 1707627926.0
        },
        {
          "id": "ksgoz9p",
          "author": "lurk537",
          "body": "You realize there are minors that have gone thru puberty and therefore they have “adult-like” bodies? Not all age groups have one specific look, and you look goofy trying to deny that.",
          "created_utc": 1709081115.0
        },
        {
          "id": "ksgr5u4",
          "author": "Tight_Quarter5117",
          "body": "What does that have to do with an adult woman who went through puberty YEARS AGO, restricting and binging to appear child-like and small? Furthermore,  you look goofy and silly trying to argue with someone online because you don't agree with what they said. You CAN just scroll bye, but hey...some look like kids and some ACT like kids.",
          "created_utc": 1709081922.0
        },
        {
          "id": "kv8niud",
          "author": "senpaistealerx",
          "body": "that’s in *your mind* tho. what source do you have that she’s restricting and binging? AND specifically to look like a child? *you* look goofy as hell for this entire comment. y’all love to tell people “you can just scroll” as if you couldn’t do the same.",
          "created_utc": 1710650294.0
        },
        {
          "id": "kv9wf7r",
          "author": "Tight_Quarter5117",
          "body": "But here YOU are, responding to something you could ignore,  since you don't agree. Kinds makes YOU look goofy",
          "created_utc": 1710680643.0
        },
        {
          "id": "kva8fpn",
          "author": "senpaistealerx",
          "body": "i feel like you think you’re cooking so i’m gonna assume you’re 15 years old. take a long look in the mirror, for your own sake.",
          "created_utc": 1710685747.0
        }
      ]
    },
    {
      "id": "kplo73k",
      "author": "PineFlower96",
      "body": "i followed ariana’s music since her debut album / Yours Truly era and as a registered nurse now, i can literally tell you that she’s 90% suffering from an ED 🥺 she was so gorgeous and at a healthy weight years/a few years ago. now she looks and acts like almost all the patients i had in worsening stages: denial/self-preservation (telling people her weight loss is natural), self-sabotaging behaviour, her lack of energy in recent performances, sallow-looking skin, emaciation/cachexia (skinny-ness: so skinny you can see their ribs, spines, sunken cheekbones, chest sternum…I can so definitely see how triggering Yes And? is), highly possible & insane food restrictions/not eating behind the scenes etc \n\nAnyone who denies that Ariana is clearly struggling with some form of ED needs to get their head out of their asses. most healthcare professionals will recognize that & say the same thing. really hope she gets help soon. :(",
      "created_utc": 1707459534.0,
      "score": 10,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        },
        {
          "id": "k6hmo5m",
          "author": "Queenofwands1212",
          "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
          "created_utc": 1698289453.0
        }
      ]
    },
    {
      "id": "kpu9yve",
      "author": "OtterDisWorld",
      "body": "As a Mental Health Practitioner, I completely agree. I just watched her Yes, And? video and I was floored by how emaciated she looks. You can literally see her sternum. I grew up with her and it's so sad to see her so gaunt. The video definitely triggered some of my own body dysmorphia and reminded me of when I was at my worst. I hope she seeks help soon as well.",
      "created_utc": 1707602993.0,
      "score": 4,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        },
        {
          "id": "k6hmo5m",
          "author": "Queenofwands1212",
          "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
          "created_utc": 1698289453.0
        },
        {
          "id": "kplo73k",
          "author": "PineFlower96",
          "body": "i followed ariana’s music since her debut album / Yours Truly era and as a registered nurse now, i can literally tell you that she’s 90% suffering from an ED 🥺 she was so gorgeous and at a healthy weight years/a few years ago. now she looks and acts like almost all the patients i had in worsening stages: denial/self-preservation (telling people her weight loss is natural), self-sabotaging behaviour, her lack of energy in recent performances, sallow-looking skin, emaciation/cachexia (skinny-ness: so skinny you can see their ribs, spines, sunken cheekbones, chest sternum…I can so definitely see how triggering Yes And? is), highly possible & insane food restrictions/not eating behind the scenes etc \n\nAnyone who denies that Ariana is clearly struggling with some form of ED needs to get their head out of their asses. most healthcare professionals will recognize that & say the same thing. really hope she gets help soon. :(",
          "created_utc": 1707459534.0
        }
      ]
    },
    {
      "id": "kpsxbx2",
      "author": "National_Way_9967",
      "body": "as someone who has been struggling with mild disordered eating for about a year, things like this really make me want to stop because its so sad",
      "created_utc": 1707584857.0,
      "score": 2,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        },
        {
          "id": "k6hmo5m",
          "author": "Queenofwands1212",
          "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
          "created_utc": 1698289453.0
        },
        {
          "id": "kplo73k",
          "author": "PineFlower96",
          "body": "i followed ariana’s music since her debut album / Yours Truly era and as a registered nurse now, i can literally tell you that she’s 90% suffering from an ED 🥺 she was so gorgeous and at a healthy weight years/a few years ago. now she looks and acts like almost all the patients i had in worsening stages: denial/self-preservation (telling people her weight loss is natural), self-sabotaging behaviour, her lack of energy in recent performances, sallow-looking skin, emaciation/cachexia (skinny-ness: so skinny you can see their ribs, spines, sunken cheekbones, chest sternum…I can so definitely see how triggering Yes And? is), highly possible & insane food restrictions/not eating behind the scenes etc \n\nAnyone who denies that Ariana is clearly struggling with some form of ED needs to get their head out of their asses. most healthcare professionals will recognize that & say the same thing. really hope she gets help soon. :(",
          "created_utc": 1707459534.0
        }
      ]
    },
    {
      "id": "krbn0dd",
      "author": "PineFlower96",
      "body": "Right (thanks for your work ❤️ I work with some A+ of you) it’s so sad! I love Ariana and her music, and seeing her face so many obstacles/make bad decisions that catch up to her makes me want to wrap her up in a blanket.",
      "created_utc": 1708451687.0,
      "score": 3,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        },
        {
          "id": "k6hmo5m",
          "author": "Queenofwands1212",
          "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
          "created_utc": 1698289453.0
        },
        {
          "id": "kplo73k",
          "author": "PineFlower96",
          "body": "i followed ariana’s music since her debut album / Yours Truly era and as a registered nurse now, i can literally tell you that she’s 90% suffering from an ED 🥺 she was so gorgeous and at a healthy weight years/a few years ago. now she looks and acts like almost all the patients i had in worsening stages: denial/self-preservation (telling people her weight loss is natural), self-sabotaging behaviour, her lack of energy in recent performances, sallow-looking skin, emaciation/cachexia (skinny-ness: so skinny you can see their ribs, spines, sunken cheekbones, chest sternum…I can so definitely see how triggering Yes And? is), highly possible & insane food restrictions/not eating behind the scenes etc \n\nAnyone who denies that Ariana is clearly struggling with some form of ED needs to get their head out of their asses. most healthcare professionals will recognize that & say the same thing. really hope she gets help soon. :(",
          "created_utc": 1707459534.0
        },
        {
          "id": "kpu9yve",
          "author": "OtterDisWorld",
          "body": "As a Mental Health Practitioner, I completely agree. I just watched her Yes, And? video and I was floored by how emaciated she looks. You can literally see her sternum. I grew up with her and it's so sad to see her so gaunt. The video definitely triggered some of my own body dysmorphia and reminded me of when I was at my worst. I hope she seeks help soon as well.",
          "created_utc": 1707602993.0
        }
      ]
    },
    {
      "id": "kupcqsf",
      "author": "SuddenReturn9027",
      "body": "It's much better once you can eat healthier because you can be your best weight in a healthy way, feel and look healthier. ED's never help",
      "created_utc": 1710350089.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        },
        {
          "id": "k6hmo5m",
          "author": "Queenofwands1212",
          "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
          "created_utc": 1698289453.0
        },
        {
          "id": "kplo73k",
          "author": "PineFlower96",
          "body": "i followed ariana’s music since her debut album / Yours Truly era and as a registered nurse now, i can literally tell you that she’s 90% suffering from an ED 🥺 she was so gorgeous and at a healthy weight years/a few years ago. now she looks and acts like almost all the patients i had in worsening stages: denial/self-preservation (telling people her weight loss is natural), self-sabotaging behaviour, her lack of energy in recent performances, sallow-looking skin, emaciation/cachexia (skinny-ness: so skinny you can see their ribs, spines, sunken cheekbones, chest sternum…I can so definitely see how triggering Yes And? is), highly possible & insane food restrictions/not eating behind the scenes etc \n\nAnyone who denies that Ariana is clearly struggling with some form of ED needs to get their head out of their asses. most healthcare professionals will recognize that & say the same thing. really hope she gets help soon. :(",
          "created_utc": 1707459534.0
        },
        {
          "id": "kpsxbx2",
          "author": "National_Way_9967",
          "body": "as someone who has been struggling with mild disordered eating for about a year, things like this really make me want to stop because its so sad",
          "created_utc": 1707584857.0
        }
      ]
    },
    {
      "id": "krbnbwj",
      "author": "PineFlower96",
      "body": "🫂 Always giving you strength xox You got this. How you see your body is not how other people see it, and how you see your body is vital to self-love and good health. You’ll get there!",
      "created_utc": 1708451792.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        },
        {
          "id": "k6hmo5m",
          "author": "Queenofwands1212",
          "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
          "created_utc": 1698289453.0
        },
        {
          "id": "kplo73k",
          "author": "PineFlower96",
          "body": "i followed ariana’s music since her debut album / Yours Truly era and as a registered nurse now, i can literally tell you that she’s 90% suffering from an ED 🥺 she was so gorgeous and at a healthy weight years/a few years ago. now she looks and acts like almost all the patients i had in worsening stages: denial/self-preservation (telling people her weight loss is natural), self-sabotaging behaviour, her lack of energy in recent performances, sallow-looking skin, emaciation/cachexia (skinny-ness: so skinny you can see their ribs, spines, sunken cheekbones, chest sternum…I can so definitely see how triggering Yes And? is), highly possible & insane food restrictions/not eating behind the scenes etc \n\nAnyone who denies that Ariana is clearly struggling with some form of ED needs to get their head out of their asses. most healthcare professionals will recognize that & say the same thing. really hope she gets help soon. :(",
          "created_utc": 1707459534.0
        },
        {
          "id": "kpsxbx2",
          "author": "National_Way_9967",
          "body": "as someone who has been struggling with mild disordered eating for about a year, things like this really make me want to stop because its so sad",
          "created_utc": 1707584857.0
        }
      ]
    },
    {
      "id": "krgzv1w",
      "author": "OtterDisWorld",
      "body": "Thank you! \nThank you for your work as well, it is so underappreciated but highly needed always. \nI agree, I hope she can eventually understand why people are worried about her and then from there get the help she needs.",
      "created_utc": 1708534309.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        },
        {
          "id": "k6hmo5m",
          "author": "Queenofwands1212",
          "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
          "created_utc": 1698289453.0
        },
        {
          "id": "kplo73k",
          "author": "PineFlower96",
          "body": "i followed ariana’s music since her debut album / Yours Truly era and as a registered nurse now, i can literally tell you that she’s 90% suffering from an ED 🥺 she was so gorgeous and at a healthy weight years/a few years ago. now she looks and acts like almost all the patients i had in worsening stages: denial/self-preservation (telling people her weight loss is natural), self-sabotaging behaviour, her lack of energy in recent performances, sallow-looking skin, emaciation/cachexia (skinny-ness: so skinny you can see their ribs, spines, sunken cheekbones, chest sternum…I can so definitely see how triggering Yes And? is), highly possible & insane food restrictions/not eating behind the scenes etc \n\nAnyone who denies that Ariana is clearly struggling with some form of ED needs to get their head out of their asses. most healthcare professionals will recognize that & say the same thing. really hope she gets help soon. :(",
          "created_utc": 1707459534.0
        },
        {
          "id": "kpu9yve",
          "author": "OtterDisWorld",
          "body": "As a Mental Health Practitioner, I completely agree. I just watched her Yes, And? video and I was floored by how emaciated she looks. You can literally see her sternum. I grew up with her and it's so sad to see her so gaunt. The video definitely triggered some of my own body dysmorphia and reminded me of when I was at my worst. I hope she seeks help soon as well.",
          "created_utc": 1707602993.0
        },
        {
          "id": "krbn0dd",
          "author": "PineFlower96",
          "body": "Right (thanks for your work ❤️ I work with some A+ of you) it’s so sad! I love Ariana and her music, and seeing her face so many obstacles/make bad decisions that catch up to her makes me want to wrap her up in a blanket.",
          "created_utc": 1708451687.0
        }
      ]
    },
    {
      "id": "kupclu7",
      "author": "SuddenReturn9027",
      "body": "I might be misinterpreting your comment but it sounds like you're encouraging them to have an ED?",
      "created_utc": 1710350043.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        },
        {
          "id": "k6hmo5m",
          "author": "Queenofwands1212",
          "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
          "created_utc": 1698289453.0
        },
        {
          "id": "kplo73k",
          "author": "PineFlower96",
          "body": "i followed ariana’s music since her debut album / Yours Truly era and as a registered nurse now, i can literally tell you that she’s 90% suffering from an ED 🥺 she was so gorgeous and at a healthy weight years/a few years ago. now she looks and acts like almost all the patients i had in worsening stages: denial/self-preservation (telling people her weight loss is natural), self-sabotaging behaviour, her lack of energy in recent performances, sallow-looking skin, emaciation/cachexia (skinny-ness: so skinny you can see their ribs, spines, sunken cheekbones, chest sternum…I can so definitely see how triggering Yes And? is), highly possible & insane food restrictions/not eating behind the scenes etc \n\nAnyone who denies that Ariana is clearly struggling with some form of ED needs to get their head out of their asses. most healthcare professionals will recognize that & say the same thing. really hope she gets help soon. :(",
          "created_utc": 1707459534.0
        },
        {
          "id": "kpsxbx2",
          "author": "National_Way_9967",
          "body": "as someone who has been struggling with mild disordered eating for about a year, things like this really make me want to stop because its so sad",
          "created_utc": 1707584857.0
        },
        {
          "id": "krbnbwj",
          "author": "PineFlower96",
          "body": "🫂 Always giving you strength xox You got this. How you see your body is not how other people see it, and how you see your body is vital to self-love and good health. You’ll get there!",
          "created_utc": 1708451792.0
        }
      ]
    },
    {
      "id": "kv642sa",
      "author": "PineFlower96",
      "body": "Phrasing missed a few words, sorry - I meant that the way ED individuals see their bodies (as bad) is not the same way we see them (we see that they are good). We want them to get to self-love and good health (as meant in my comment) :)",
      "created_utc": 1710612545.0,
      "score": 1,
      "context": [
        {
          "id": "k6gjljv",
          "author": "Queenofwands1212",
          "body": "I feel like it’s part of her brand at this point to be a little dainty anorexic girl but she’s actually an adult who is married lmao.",
          "created_utc": 1698272935.0
        },
        {
          "id": "k6gkozq",
          "author": "MeteorIntrovert",
          "body": "she definitely loves feeling petite n small. it's just like i didnt know bodies could be THIS thin given we're around the same height lol. had to unfollow her honestly",
          "created_utc": 1698273386.0
        },
        {
          "id": "k6gl7di",
          "author": "Queenofwands1212",
          "body": "Yeah but she has ANOREXIA. She’s not naturally that thin. It’s a result of restricting, working out, not eating, and who knows what supplements and meds she’s on. It’s not natural. She used to be a lot heavier when she was younger. She is 100% losing weight and keeping her body that size on purpose",
          "created_utc": 1698273594.0
        },
        {
          "id": "k6h4o4r",
          "author": "gardenkitties",
          "body": "Did she say that’s why she had lost so much weight recently? I saw photos but never felt like reading anything that came out about it",
          "created_utc": 1698281650.0
        },
        {
          "id": "k6hb3g2",
          "author": "Queenofwands1212",
          "body": "I mean, of course she’s not going to admit that she has anoreixa and lost weight that way, she’s going to pretend it’s natural and make all her fans think that’s her natural body, but there’s no way it is.",
          "created_utc": 1698284335.0
        },
        {
          "id": "k6hc72a",
          "author": "gardenkitties",
          "body": "Agreed. Unless she’s got some other kind of illness/medication that causes significant weight loss. But wouldn’t surprise me if it was just harmful habits.",
          "created_utc": 1698284802.0
        },
        {
          "id": "k6hfdvr",
          "author": "Queenofwands1212",
          "body": "It’s anorexia. She has come out before and said something about her eating disorder but she made it seem like she “used to have one” which is a total front. Its obvious she still has anorexia, you can clearly tell by her face, malnourishment look, pale, underweight etc",
          "created_utc": 1698286147.0
        },
        {
          "id": "k6hfyg2",
          "author": "gardenkitties",
          "body": "I didn’t know she said that before. & I know it’s terrible :(",
          "created_utc": 1698286396.0
        },
        {
          "id": "k6hmo5m",
          "author": "Queenofwands1212",
          "body": "Yeah I forget where I read it but it was a while ago and it was the whole “oh yeah I USED to have eating issues” but the truth of the matter is, that’s a cover up and that’s what a lot of celebrities and influencers are doing now, they say they USED to have an Ed and so they pretend their bodies are naturally emaciated or underweight",
          "created_utc": 1698289453.0
        },
        {
          "id": "kplo73k",
          "author": "PineFlower96",
          "body": "i followed ariana’s music since her debut album / Yours Truly era and as a registered nurse now, i can literally tell you that she’s 90% suffering from an ED 🥺 she was so gorgeous and at a healthy weight years/a few years ago. now she looks and acts like almost all the patients i had in worsening stages: denial/self-preservation (telling people her weight loss is natural), self-sabotaging behaviour, her lack of energy in recent performances, sallow-looking skin, emaciation/cachexia (skinny-ness: so skinny you can see their ribs, spines, sunken cheekbones, chest sternum…I can so definitely see how triggering Yes And? is), highly possible & insane food restrictions/not eating behind the scenes etc \n\nAnyone who denies that Ariana is clearly struggling with some form of ED needs to get their head out of their asses. most healthcare professionals will recognize that & say the same thing. really hope she gets help soon. :(",
          "created_utc": 1707459534.0
        },
        {
          "id": "kpsxbx2",
          "author": "National_Way_9967",
          "body": "as someone who has been struggling with mild disordered eating for about a year, things like this really make me want to stop because its so sad",
          "created_utc": 1707584857.0
        },
        {
          "id": "krbnbwj",
          "author": "PineFlower96",
          "body": "🫂 Always giving you strength xox You got this. How you see your body is not how other people see it, and how you see your body is vital to self-love and good health. You’ll get there!",
          "created_utc": 1708451792.0
        },
        {
          "id": "kupclu7",
          "author": "SuddenReturn9027",
          "body": "I might be misinterpreting your comment but it sounds like you're encouraging them to have an ED?",
          "created_utc": 1710350043.0
        }
      ]
    }
  ]
}