{
  "id": "17htm2x",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1698429999.0,
  "title": "\"Popular Girls\" that have disordered eating in movies",
  "selftext": "I find it odd when movies, usually with teen characters, have \"stereotypical popular girl\" characters that have disordered eating. It's especially weird to me when they portray it in a humerous way, or the realities of ed's aren't shown, just the \"im super skinny because i eat almost nothing\" part, not the side effects and internal struggles of ed's. I think it can also be harmful to some of the viewers, especially younger girls (but obviously not limited to just young girls). I think the fact that ed's are portrayed this way in some movies just goes to show how misunderstood ed's still are.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/17htm2x/popular_girls_that_have_disordered_eating_in/",
  "score": 111,
  "num_comments": 13,
  "comments": [
    {
      "id": "k6s810d",
      "author": "None",
      "body": "You just realized why western society is riddled with eating disorders lol. This has been the case for a long time. \n\nI was watching seinfeld the other day. A show i love but is def becoming dated within our new found PC culture. But theres this episode where kramer says hes dating a hefty girl, and the running joke is shes always hungry and hes struggling to feed her enough food. They finally show her on the screen and I was FLOORED at the woman they chose to play the \"hefty\" one. She was a size 6-8. She was skinny! She wasnt a rail like the rest of the girlfriends on the show but she was not fat, not curvey, no where near hefty. Quite an average body that i would never comment too skinny, too fat, shes just average.\n\nMy point is...these were the messages we were being fed all the time! I go back and watch old stuff and ive seen it a few times where they cast a size 6 and call them fat. Its absurd.",
      "created_utc": 1698471039.0,
      "score": 38,
      "context": []
    },
    {
      "id": "k6rrlve",
      "author": "Blyxons",
      "body": "I don't know about popular girl characters but that character \"Cassie\" from the British TV show \"Skins\" did huge harm to the ED community and we saw the number of EDs rise at a rapid rate because of her romanticizing it.",
      "created_utc": 1698461445.0,
      "score": 62,
      "context": []
    },
    {
      "id": "k6towa5",
      "author": "BeesElectrical87",
      "body": "Its weird that it's portrayed as popular girls though - all the people with eds that I know are high-achieving nerds and geeks, or is that just a coincidence?",
      "created_utc": 1698503780.0,
      "score": 19,
      "context": []
    },
    {
      "id": "k6tr3yk",
      "author": "Sadtacocat",
      "body": "I thought Gossip Girl had potential when they showed Blair’s ED due to her mom being very critical of her and how she was always compared to Serena. Like it had potential to go somewhere meaningful and maybe show her overcome it by building up her self-esteem. But nope, they never acknowledged it again and had her stay in a toxic relationship.",
      "created_utc": 1698504681.0,
      "score": 22,
      "context": []
    },
    {
      "id": "k6rm5wl",
      "author": "NonverbalSquirrel",
      "body": "The only show that i’ve seen that has a “popular girl with an eating disorder” that ISNT on the more pro ana is in “Ugly Betty” and it’s Amanda. She’s a skinny blonde blue eyed girl who naturally rejects carbs and comments on people being fat ETC but she tends to binge eat quite frequently on the show, especially when she’s stressed and mostly on sweets",
      "created_utc": 1698458818.0,
      "score": 17,
      "context": []
    },
    {
      "id": "k6r34rj",
      "author": "StrangerThingsSteveH",
      "body": "I agree it’s harmful that it’s just shown with skinny white popular high school girls\n\nThough eating disorders are more common in girls specifically around teenage years it seems harmful that they kind of only portray that\n\nI’m a guy who’s had an eating disorder since I was a young kid",
      "created_utc": 1698450066.0,
      "score": 15,
      "context": []
    },
    {
      "id": "k6z2xfg",
      "author": "Ok-Maximum2228",
      "body": "I especially hate that it’s always skinny girls, and it’s also weird that they experience almost zero side affects when it comes to their disorder. Eating disorders make you feel like garbage 24/7.",
      "created_utc": 1698599673.0,
      "score": 4,
      "context": []
    },
    {
      "id": "k6zbq7r",
      "author": "ButterscotchBanana13",
      "body": "Tbf it’s been this way for decades",
      "created_utc": 1698602808.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k6tber3",
      "author": "Electronic-Status379",
      "body": "“oh… wow”😼",
      "created_utc": 1698497779.0,
      "score": 33,
      "context": [
        {
          "id": "k6rrlve",
          "author": "Blyxons",
          "body": "I don't know about popular girl characters but that character \"Cassie\" from the British TV show \"Skins\" did huge harm to the ED community and we saw the number of EDs rise at a rapid rate because of her romanticizing it.",
          "created_utc": 1698461445.0
        }
      ]
    },
    {
      "id": "k6unnap",
      "author": "proxykaru",
      "body": "cassie taught me all the tricks in the book when it came to fake eating in public",
      "created_utc": 1698516539.0,
      "score": 21,
      "context": [
        {
          "id": "k6rrlve",
          "author": "Blyxons",
          "body": "I don't know about popular girl characters but that character \"Cassie\" from the British TV show \"Skins\" did huge harm to the ED community and we saw the number of EDs rise at a rapid rate because of her romanticizing it.",
          "created_utc": 1698461445.0
        }
      ]
    },
    {
      "id": "k6z2m83",
      "author": "Ok-Maximum2228",
      "body": "I especially hate the “I didn’t eat for three days so I can be beautiful,” or whatever the line was. That’s not how Ed’s actually are, there’s so much more to them. I hate Cassie almost as much as I hate Ellen from To The Bone.",
      "created_utc": 1698599560.0,
      "score": 4,
      "context": [
        {
          "id": "k6rrlve",
          "author": "Blyxons",
          "body": "I don't know about popular girl characters but that character \"Cassie\" from the British TV show \"Skins\" did huge harm to the ED community and we saw the number of EDs rise at a rapid rate because of her romanticizing it.",
          "created_utc": 1698461445.0
        }
      ]
    },
    {
      "id": "kuxfefz",
      "author": "RedDitRXIXXII",
      "body": "I know from experience and research that perfectionism can be a huge factor in developing an ED.",
      "created_utc": 1710466212.0,
      "score": 2,
      "context": [
        {
          "id": "k6towa5",
          "author": "BeesElectrical87",
          "body": "Its weird that it's portrayed as popular girls though - all the people with eds that I know are high-achieving nerds and geeks, or is that just a coincidence?",
          "created_utc": 1698503780.0
        }
      ]
    },
    {
      "id": "k6y6ncz",
      "author": "Coffee-n-chardonnay",
      "body": "And it was like one episode. It could have been a way better plot throughout the series but it’s like the writers forgot about it.",
      "created_utc": 1698586212.0,
      "score": 6,
      "context": [
        {
          "id": "k6tr3yk",
          "author": "Sadtacocat",
          "body": "I thought Gossip Girl had potential when they showed Blair’s ED due to her mom being very critical of her and how she was always compared to Serena. Like it had potential to go somewhere meaningful and maybe show her overcome it by building up her self-esteem. But nope, they never acknowledged it again and had her stay in a toxic relationship.",
          "created_utc": 1698504681.0
        }
      ]
    }
  ]
}