{
  "id": "17j7ftn",
  "subreddit": "EatingDisorders",
  "author": "Ok-Maximum2228",
  "created_utc": 1698599261.0,
  "title": "I’m scared of weight gain",
  "selftext": "I really want to be able to recover and I’m starting therapy for my ed on Tuesday, but I’m really scared of how my body might change if I go back to my previous weight. What if I don’t look the same as I did before my ed? What if I gain weight in different places? These are all thoughts that I keep having. For those of you who have recovered, did your body eventually go back to how it was before your ed? I’m just starting to remember how much more confident I was before my eating disorder and I want to go back to those days so badly.  If anyone has any advice on weight gain and recovery please let me know. It feels good hearing stories about other people’s recovery.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/17j7ftn/im_scared_of_weight_gain/",
  "score": 45,
  "num_comments": 14,
  "comments": [
    {
      "id": "k6zhrv9",
      "author": "PawdryHeppurrn",
      "body": "At the end of the day, it has to be more about your health. Confidence, for me at least, has always been tough and will always be a struggle. There are days I feel happy and confident and days I feel tremendously guilty and bad about myself. I have come to terms with the fact that I will never be completely happy, but I am doing what I'm doing for my health and that is good enough. \n\nAs for body changes, my ED did some extensive damage to parts of my life, but most of it has been internal and I feel like I've kept relatively the same shape in the same places during recovery. Our bodies are predisposed to wanting to be a certain weight and having that weight distributed in certain areas. You can tone through exercise, but there's no way to spot treat. \n\nThat's my experience, but yours will be completely unique. Your journey in recovery is worth it and YOU are worth it. It becomes a willpower struggle and even fifteen years later, my eating disorder is still a huge part of my life. Finding hobbies and support from friends and family will be key. Distractions are important. I know it's difficult and nobody can stop the intrusive thoughts, but it's such an important thing to give yourself the grace to recover.\n\nI always tell myself mental illness isn't your fault, but it is your responsibility. It does get better and it's hard work, but please believe that it is worth it.",
      "created_utc": 1698604985.0,
      "score": 9,
      "context": []
    },
    {
      "id": "k6zicdb",
      "author": "Global_Emphasis5786",
      "body": "Unfortunately recovering from an eating disorder is so complex because of these things. The act of recovering is also our trigger. \n\nI found self love yoga to be very helpful last time I recovered. It's also a co potential of reminding yourself that you likely don't see yourself correctly in the mirror. The important part is do you physically feel good, are you getting better. I believe in you",
      "created_utc": 1698605196.0,
      "score": 7,
      "context": []
    },
    {
      "id": "k70fw5v",
      "author": "Medstudentgirl2002",
      "body": "I experienced weigh gain, and the change in my body that came with it, kind of like a grieving process. I knew I had to develop better eating habits, otherwise I would never be able to recover. I gave in to that, but refused to see the change in my body for a while (as some sort of self-defense mechanism). But after a while and after I gained a significant amount of weight, I started to literally feel different in my body (legs touching while walking for example). Clothes also didn’t fit anymore, and I needed a size up when buying new ones. I absolutely hated my body at that point and it made me feel sad and unattractive. But I already came this far, I wouldn’t give up now. The weight gain stopped at some point because my body had reached its ‘set point’. I got more used to my body, started to see the beauty in my curves and finally accepted it. I feel better in my body now then I did when I was smaller. \n\nBut, it’s not always rainbows and butterflies. I have quite some days where I feel fat, ugly and unattractive. On those days I still have the urge to skip meals and eat as little as possible, and sometimes I let myself do that. It’s not the best thing to do, but sometimes I can’t find the strength to fight against those urges. Those days often happen when I ate a lot and/or unhealthy for some days in a row (not after one big meal or 1 day, I don’t panic over that anymore). I do think there is still some eating disordered behavior in that though, but I can live with it. If I follow a (somewhat) healthy diet, lift weights and get a decent amount of sleep then those bad days rarely happen. Taking good care of my body makes me feel better, which is logic and normal also for people who don’t have an ED. \n\nSo what’s important is that you create a good support system (family, friends, SO and therapist) in your recovery journey. Find something that makes you feel good about yourself and find something to distract yourself. But most importantly: don’t give up! It’s gonna be hard, but it’ll get better and it’s definitely worth it",
      "created_utc": 1698617505.0,
      "score": 6,
      "context": []
    },
    {
      "id": "k718js8",
      "author": "Ok_Toe_369",
      "body": "You are going to gain weight long before you accept your body. It’s part of the process. Don’t expect to be happy with the way you look for a while. But also remember that other people can’t see the minute differences in your body that you can. The goal in early recovery is to just be neutral with your body. \n\nI had my ED when I was younger so I actually didn’t fully go through puberty until I gained weight. So my hips got wider and my boobs got bigger (along with gaining fat in normal places). I realized that I wouldn’t be able to fit into the same size I was pre ED even if I went back to restricting/lost the weight because my body had already changed and I couldn’t unchange it. It actually helped me to cope with the weight gain knowing it was irreversible.",
      "created_utc": 1698629477.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k7dew3n",
      "author": "None",
      "body": "You're asking great questions - what if? And you probably know the answer. Nothing. Nobody cares if you're 40kg or 70kg. As long as you are happy and healthy, you can look however you want. Noone cares about the number on the scale, about your clothes size. It's your life, live it to the fullest and don't let the ED ruin it for you!",
      "created_utc": 1698850657.0,
      "score": 2,
      "context": []
    },
    {
      "id": "k70menw",
      "author": "lutrinaemountain",
      "body": "Started recovery in July and went through this. Some days I still go through this but it gets so much easier with time (I promise). In recovery I couldn’t weigh myself because I was so fixated on it. Do your best to focus on health! *Sending hugs*",
      "created_utc": 1698620105.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7f8ehm",
      "author": "kawaiicatlover1109",
      "body": "Same",
      "created_utc": 1698874658.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k7gjaa0",
      "author": "imnotyourbaby5",
      "body": "Same this is why I never want to get pregnant",
      "created_utc": 1698893813.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k88qcn7",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1699379688.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k894a15",
      "author": "BabyBundt13",
      "body": "I wouldn’t say I recovered but I got back to a point where my food wasn’t in a toilet bowl and was able to keep things down. I gained my weight back (also because I was on bed rest for half a year due to other medical issues) and was very disappointed that it came back in a different way/place. Even though I’m still insecure about my body I’d still rather be able to dress nice and feel confident again than to feel how bad I was messing up my gut and digestive system.",
      "created_utc": 1699384647.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k8rfdqc",
      "author": "Life-Programmer6905",
      "body": "Hey! I’m in recovery and have been since mid July. But have relapsed a few times, which my therapist has told me is just apart of recovery. I have started getting body dysmorphia thoughts and it’s apart of bulemia I’ve been told. Seeing yourself as bigger than you are or morphed in a weird way. I haven’t figured out a way to not think that way, but just reminding myself I’m a child of God who loves me and made me perfect in every way. Our story will change someone’s life. Keep going. Don’t give up!",
      "created_utc": 1699691678.0,
      "score": 1,
      "context": []
    },
    {
      "id": "k70am4f",
      "author": "Ok-Maximum2228",
      "body": "I agree, I’ve always had low self esteem, but my ed has only lowered my confidence. I’m mostly trying my hardest to choose recovery because of all the digestive distress and discomfort and I also want to get my period back. It’s no fun living a life where I constantly starve myself just to feel more in control and to adhere to beauty standards. I got too obsessed with the idea of having a perfectly flat stomach, when in reality I don’t think it’s possible for me with my genetics and I need to try and learn to try to accept that.",
      "created_utc": 1698615453.0,
      "score": 3,
      "context": [
        {
          "id": "k6zhrv9",
          "author": "PawdryHeppurrn",
          "body": "At the end of the day, it has to be more about your health. Confidence, for me at least, has always been tough and will always be a struggle. There are days I feel happy and confident and days I feel tremendously guilty and bad about myself. I have come to terms with the fact that I will never be completely happy, but I am doing what I'm doing for my health and that is good enough. \n\nAs for body changes, my ED did some extensive damage to parts of my life, but most of it has been internal and I feel like I've kept relatively the same shape in the same places during recovery. Our bodies are predisposed to wanting to be a certain weight and having that weight distributed in certain areas. You can tone through exercise, but there's no way to spot treat. \n\nThat's my experience, but yours will be completely unique. Your journey in recovery is worth it and YOU are worth it. It becomes a willpower struggle and even fifteen years later, my eating disorder is still a huge part of my life. Finding hobbies and support from friends and family will be key. Distractions are important. I know it's difficult and nobody can stop the intrusive thoughts, but it's such an important thing to give yourself the grace to recover.\n\nI always tell myself mental illness isn't your fault, but it is your responsibility. It does get better and it's hard work, but please believe that it is worth it.",
          "created_utc": 1698604985.0
        }
      ]
    },
    {
      "id": "k8h7594",
      "author": "EatingDisorders-ModTeam",
      "body": "No person blogs, social media or product/service advertisements",
      "created_utc": 1699518329.0,
      "score": 1,
      "context": [
        {
          "id": "k88qcn7",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1699379688.0
        }
      ]
    },
    {
      "id": "k70ddn0",
      "author": "PawdryHeppurrn",
      "body": "I feel for you so much. Chasing perfection while constantly being bombarded with impossibly high standards is exhausting. I truly believe that EDs are an extreme method of control for those of us who are self-critical to the point of hurting ourselves.\n\nI hope you crush it in recovery; you deserve to feel good about yourself! 🩷",
      "created_utc": 1698616509.0,
      "score": 3,
      "context": [
        {
          "id": "k6zhrv9",
          "author": "PawdryHeppurrn",
          "body": "At the end of the day, it has to be more about your health. Confidence, for me at least, has always been tough and will always be a struggle. There are days I feel happy and confident and days I feel tremendously guilty and bad about myself. I have come to terms with the fact that I will never be completely happy, but I am doing what I'm doing for my health and that is good enough. \n\nAs for body changes, my ED did some extensive damage to parts of my life, but most of it has been internal and I feel like I've kept relatively the same shape in the same places during recovery. Our bodies are predisposed to wanting to be a certain weight and having that weight distributed in certain areas. You can tone through exercise, but there's no way to spot treat. \n\nThat's my experience, but yours will be completely unique. Your journey in recovery is worth it and YOU are worth it. It becomes a willpower struggle and even fifteen years later, my eating disorder is still a huge part of my life. Finding hobbies and support from friends and family will be key. Distractions are important. I know it's difficult and nobody can stop the intrusive thoughts, but it's such an important thing to give yourself the grace to recover.\n\nI always tell myself mental illness isn't your fault, but it is your responsibility. It does get better and it's hard work, but please believe that it is worth it.",
          "created_utc": 1698604985.0
        },
        {
          "id": "k70am4f",
          "author": "Ok-Maximum2228",
          "body": "I agree, I’ve always had low self esteem, but my ed has only lowered my confidence. I’m mostly trying my hardest to choose recovery because of all the digestive distress and discomfort and I also want to get my period back. It’s no fun living a life where I constantly starve myself just to feel more in control and to adhere to beauty standards. I got too obsessed with the idea of having a perfectly flat stomach, when in reality I don’t think it’s possible for me with my genetics and I need to try and learn to try to accept that.",
          "created_utc": 1698615453.0
        }
      ]
    }
  ]
}