{
  "id": "189yv4p",
  "subreddit": "EatingDisorders",
  "author": "Timely-Bookkeeper288",
  "created_utc": 1701625866.0,
  "title": "my roommate talks about her eating disorder and it’s triggering me",
  "selftext": "my roommate is clearly in the midst of a restrictive eating disorder and it’s beginning to trigger me. she often tells asks me if she’ll gain weight drinking a protein shake or ask me if eating two salads a day will make her gain weight. she claims she is trying to recover and told me she ate pizza but she took off the cheese or that she ate a hamburger but took off the buns. she tells me she’s about to hit 100 pounds that she lost her period and she asks me what she should do. it’s becoming very triggering for me because i went from a restrictive eating disorder to having a problem with binge eating and i constantly feel like im being judged and i see myself fantasizing about going back to restriction. im not sure what to do",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/189yv4p/my_roommate_talks_about_her_eating_disorder_and/",
  "score": 107,
  "num_comments": 12,
  "comments": [
    {
      "id": "kbue6lb",
      "author": "None",
      "body": "have you talked to her about it and how it makes you feel? what she’s doing is kind of cruel imo even if she doesn’t have bad intentions. i’m not in recovery or anything but that would still trigger me so badly. as someone with a restrictive eating disorder, i NEVER talk badly about food around people, never mention calories, never mention how xyz will make me gain or anything like that. i don’t ever want someone to feel a fraction of the way that i do, especially because of something i’ve said. \n\ntell her that you don’t want to hear those things and that they’re harmful to you. if she won’t stop then don’t speak to her at all. every time food or weight gets brought up, walk away. i’m so sorry that you’re having to deal with that and it’s really not fair to you.",
      "created_utc": 1701627928.0,
      "score": 54,
      "context": []
    },
    {
      "id": "kbwtj5i",
      "author": "Acceptable-Bug9505",
      "body": "I don’t want to make excuses for her, but in my past I was completely unaware of how out of touch/Cruel my comments or questions were. Over time I realized how I shouldn’t say those things around/to people even if it isn’t about them, but it took time to realize. I don’t think anyone ever mentioned to me that it bothered them either. Maybe mentioning to her that it’s upsetting you is worth a shot, if she continues to do it then I’d say that’s a conscious decision, but if she can realize what she says is harmful that’s the best outcome, for you both. Protect your peace though, her feelings should not override yours.",
      "created_utc": 1701662330.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kbwjujn",
      "author": "None",
      "body": "My mom does this a lot.  Best thing you can do is kindly explain that it's hurting you and hope that she understands.  They can choose not to talk about these things and most people don't want to negatively affect others.  Chances are with a bit of explaining she'll stop doing it out loud at least, which let's face it is good for her too.  If she doesn't just maintain a healthy distance and remember her struggles are horrid but not worth hurting yourself over as if it's that bad there isn't much you can do without a professional. \n\nI would highly recommend getting some sort of therapists opinion or help with the situation as they know how to handle this stuff better than a lot of us here on Reddit will. \n\nMain thing is to keep yourself from going back, helping yourself is still helping someone.",
      "created_utc": 1701657886.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kbzf8g6",
      "author": "laney-louey",
      "body": "This is something I’ve battled with before, & I get it. It’s a hard subject to be in the middle of. From my view point and experience, my ED is very competitive so it almost turns into a competitive sport when it’s comparable to someone else’s experience. \n\nED are complex and miserable, living with mine for a decade now it’s something I’m having a hard time letting go but also trying to be better for ME & battle the urges when anything regarding weight, food & diet are brought to conversation. It’s hard, but try and not fall into that pit of competition. I hear you. You’re doing great & all the best you can. 🖤",
      "created_utc": 1701713775.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kbzzdm6",
      "author": "HypeBeastCosmo",
      "body": "Mine would drink half a package (250mg~) coffee daily and eat zucchini boiled in water for dinner. She didn’t even had to open her mouth to trigger me 😁",
      "created_utc": 1701720973.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kbvqb9n",
      "author": "None",
      "body": "Why are you letting it trigger you so much?  Is it affecting the kitchen cooking routine?  Smells?   Bathroom being occupied excessively?",
      "created_utc": 1701645519.0,
      "score": -21,
      "context": []
    },
    {
      "id": "kc3u8lz",
      "author": "FemcelStacy",
      "body": "Tell her that. Tell her she needs to stop triggering you. But understand she's in the midst of her EdD and not even remotely  healed.",
      "created_utc": 1701793323.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kd4orzx",
      "author": "miss_poetflowerr",
      "body": "You could recommend she go talk to a therapist instead of ranting so much with you",
      "created_utc": 1702436351.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kbuh23p",
      "author": "Timely-Bookkeeper288",
      "body": "im honestly scared to talk to her about it because i dont want her to dislike me and i dont want to explain why its triggering me :(",
      "created_utc": 1701628915.0,
      "score": 19,
      "context": [
        {
          "id": "kbue6lb",
          "author": "None",
          "body": "have you talked to her about it and how it makes you feel? what she’s doing is kind of cruel imo even if she doesn’t have bad intentions. i’m not in recovery or anything but that would still trigger me so badly. as someone with a restrictive eating disorder, i NEVER talk badly about food around people, never mention calories, never mention how xyz will make me gain or anything like that. i don’t ever want someone to feel a fraction of the way that i do, especially because of something i’ve said. \n\ntell her that you don’t want to hear those things and that they’re harmful to you. if she won’t stop then don’t speak to her at all. every time food or weight gets brought up, walk away. i’m so sorry that you’re having to deal with that and it’s really not fair to you.",
          "created_utc": 1701627928.0
        }
      ]
    },
    {
      "id": "kbwh623",
      "author": "prettipain",
      "body": "u need to leave",
      "created_utc": 1701656673.0,
      "score": 18,
      "context": [
        {
          "id": "kbvqb9n",
          "author": "None",
          "body": "Why are you letting it trigger you so much?  Is it affecting the kitchen cooking routine?  Smells?   Bathroom being occupied excessively?",
          "created_utc": 1701645519.0
        }
      ]
    },
    {
      "id": "kbxdn4v",
      "author": "robotomy13",
      "body": "What?",
      "created_utc": 1701674140.0,
      "score": 2,
      "context": [
        {
          "id": "kbvqb9n",
          "author": "None",
          "body": "Why are you letting it trigger you so much?  Is it affecting the kitchen cooking routine?  Smells?   Bathroom being occupied excessively?",
          "created_utc": 1701645519.0
        }
      ]
    },
    {
      "id": "kbuhtx7",
      "author": "None",
      "body": "you don’t have to go into detail about it but tell her that her comments are making you feel bad about your body and you’d appreciate it if she could stop saying things like that around you. if she won’t like you anymore cause you don’t want to hear triggering comments then she’s not someone you want to be friends with. you have to put yourself first.",
      "created_utc": 1701629189.0,
      "score": 19,
      "context": [
        {
          "id": "kbue6lb",
          "author": "None",
          "body": "have you talked to her about it and how it makes you feel? what she’s doing is kind of cruel imo even if she doesn’t have bad intentions. i’m not in recovery or anything but that would still trigger me so badly. as someone with a restrictive eating disorder, i NEVER talk badly about food around people, never mention calories, never mention how xyz will make me gain or anything like that. i don’t ever want someone to feel a fraction of the way that i do, especially because of something i’ve said. \n\ntell her that you don’t want to hear those things and that they’re harmful to you. if she won’t stop then don’t speak to her at all. every time food or weight gets brought up, walk away. i’m so sorry that you’re having to deal with that and it’s really not fair to you.",
          "created_utc": 1701627928.0
        },
        {
          "id": "kbuh23p",
          "author": "Timely-Bookkeeper288",
          "body": "im honestly scared to talk to her about it because i dont want her to dislike me and i dont want to explain why its triggering me :(",
          "created_utc": 1701628915.0
        }
      ]
    }
  ]
}