{
  "id": "18d113d",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1701971050.0,
  "title": "Help: The guy I’m dating is triggering me with body comments",
  "selftext": "So I (24f) have been dating (30m) for 5 months now. He knows about my ED and I often try to explain what’s going on in my head whenever I face challenges. He often is quite wonderful in supporting me.\n\nI’ve told him early on that I will probably gain some weight in the next months because I’m in therapy for my ED now and work with a doctor/dietist/family therapist/therapist/etcetc and I want to make it work this time. Wasn’t looking for his approval, just wanted to mention it since not mentioning it was making me anxious. HOWEVER.\n\nThere have been some instances where he comments on my body. Like: ‘I love how the weight you’ve gained looks on you/You look healthy/You finally have a lil booty now/Your boobs looked sad before (???) and now they don’t/When we met I was really confused by how your body looked but now you’ve grown into your skin a little more/I’m worried because I can feel you’re less muscular than before’\n\nComments like these are probably meant in the nicest way possible but I’ve tried explaining how these comments trigger me massively. Like, throw me into small relapses almost instantly. I wish I was stronger than this but the ED voice is still very present.\n\nHowever, he keeps on insisting that he doesn’t like it when I tell him what to say and what not to say. So the comments continue. I’ve tried explaining to him that I am just asking him to take me into account, i’m not trying to censor him in any way. This request was met with defensiveness and a stubborn: BUT I WANT TO EXPRESS MY POSITIVE EMOTIONS!!!\n\nHow to move forward send help I can’t keep on being triggered like that but I don’t know what to say anymore\n\nEDIT: he said that he tries to be respectful of my triggers but that somethings things just blurt out of his mouth",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/18d113d/help_the_guy_im_dating_is_triggering_me_with_body/",
  "score": 47,
  "num_comments": 19,
  "comments": [
    {
      "id": "kcegf50",
      "author": "pinkfrisbee",
      "body": "Personally, if I was with someone who would not stop triggering my ED or other mental health issues despite numerous conversations, I would end the relationship. Their expression of 'positive emotions' must not trump your health and wellbeing. I hope he changes his ways - if he doesn't respect your wellbeing, he doesn't deserve you imo. Stay strong ❤️",
      "created_utc": 1701977442.0,
      "score": 59,
      "context": []
    },
    {
      "id": "kcembso",
      "author": "Katniprose45",
      "body": "He sounds rather selfish and immature, honestly. His right to express himself freely does not trump your right to be in a relationship that doesn't trigger mental illness...",
      "created_utc": 1701979724.0,
      "score": 36,
      "context": []
    },
    {
      "id": "kcejm49",
      "author": "mykindabook",
      "body": "You’ve only been dating for a few months. Honestly i’m just saying In the kindest way possible: you deserve more. You don’t need to put up with comments like that for the rest of your life. There are men out there who accept your body as it is and respect your boundaries. It doesn’t sound like this man is willing to change. ☹️❤️‍🩹",
      "created_utc": 1701978680.0,
      "score": 21,
      "context": []
    },
    {
      "id": "kcejxvd",
      "author": "funkydyke",
      "body": "If he’s not responsive to you setting boundaries around this type of thing you should dump him honestly",
      "created_utc": 1701978805.0,
      "score": 19,
      "context": []
    },
    {
      "id": "kceyzkl",
      "author": "sequinsnstuff",
      "body": "He is not hearing you.  And he doesn’t want to.  He isn’t open to your experience being YOURS, not his.  He’s making it about him, which is a total red flag.  🚩",
      "created_utc": 1701984457.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kcem24e",
      "author": "Ancient-Cockroach970",
      "body": "Your body, your choice - even regarding comments on your body. If he doesn't respect your choice to not want to listen to his comments he's a dick, especially since he knows your struggling with recovery.",
      "created_utc": 1701979621.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kcfl9sx",
      "author": "None",
      "body": "My fiancé immediately stopped making comments on my body the second I went to treatment and my therapist asked. It’s a classic case of if he wanted to, he would. I’m sorry OP you deserve better <3",
      "created_utc": 1701993244.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kcgrh8h",
      "author": "SadCatLady1029",
      "body": ">However, he keeps on insisting that he doesn’t like it when I tell him what to say and what not to say.\n\nThis... upsets me. The fact that he's trying to frame this as you being controlling is at best immature and at worst a massive red flag. \n\nYes, a lot of people do not know how to help someone with an ED and might say hurtful things when they're trying to be helpful. But you have *told him* these things are not helpful (and even harmful), and he's not only continuing to say them, but stubbornly insisting that he should get to say them *even knowing* that they hurt you. Even if they are \"blurted out,\" he could acknowledge it and apologize for slipping up. He isn't. He also could share his \"positive emotions\" without commenting on specifics -- would it have been *that hard* to say \"you look amazing\" or even \"your \\[body part\\] look\\[s\\] amazing\" without commenting on how that part of you has changed? \n\nPlease, seriously consider whether this person is worth jeopardizing your recovery. It is absolutely not an unreasonable request to ask that he stop commenting on your body, especially while it goes through the changes it needs to recover.",
      "created_utc": 1702012433.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kcgums0",
      "author": "Patient_Ad_3746",
      "body": "He’s not respecting your boundaries and he’s not able to prioritize your well being over his made up victimhood AND he’s older and should be more emotionally mature. He doesn’t deserve you and I can’t imagine these qualities will age well in a relationship. Supporting someone with all of the aspects of ED recovery takes more emotional maturity than I suspect he has.",
      "created_utc": 1702014330.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kcgmnrk",
      "author": "Hellstoodstillforme",
      "body": "Those comments are not small, specially the “what about working out?”, and the constant implying you looked not good before, this is tone deaf and even mean, specially if you’ve discussed it and he still makes the comments, please prioritize your mental health and your recovery process",
      "created_utc": 1702009845.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kciespw",
      "author": "None",
      "body": "Leave his ass",
      "created_utc": 1702049774.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kcghh71",
      "author": "Remarkable-Pirate214",
      "body": "So glad for these responses. They’re all true. I hope you’re okay 🫶🏼 YOU are the important one here, especially since you’re actively working on yourself!! It’s admirable",
      "created_utc": 1702007424.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kcgma4r",
      "author": "Susm8au",
      "body": "I’m sure he means well and is just trying to encourage you to recover but doesn’t understand the power behind what he is saying. As someone who has had/has ED and also dated someone with one It’s a fine line dating someone with an ED. It’s hard to know what you say is either encouraging their recovery or your ED.  I’d suggest talking to him about body/weight related comments.  Hope your well OP.",
      "created_utc": 1702009658.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kcgu2gy",
      "author": "WoodsofNYC",
      "body": "If you have told him clearly how these comments (even though they are meant to be supportive) are triggering and he doesn’t stop, you may need to end the relationship. Before then, maybe you need to explain clearly that, even though it doesn’t make sense and even if it sounds encouraging, some words are triggering, depending on how long you’ve been together and if it’s been a long time, maybe you need to try couples therapy or find a support group. I am only a person in recovery so the following suggestion may or may not be helpful, but maybe ask him to write down his thoughts. Explain to him that you’re not ready to hear them and maybe one day you will be and if you are, then he can share them with you, that way he is able to express how he feels without triggering you. I know it’s tempting just to break up with him immediately however, he does seem supportIve. He simply doesn’t understand how to support you. Furthermore, it would be far worse to be with somebody who silently was thinking unsupportive thoughts because sometimes those thoughts come out n different ways. Finally explaining an eating disorder in an intimate relationship is difficult, and it’s difficult for a partner to understand even if this relationship doesn’t work out having the practice of discussing it with someone is good nevertheless, I would keep in mind a deadline do not give him an ultimatum. But  how many months or weeks do you want to stick around in until you see some change in his behavior. Maybe that’s sneaky but I think it might be protective for you.",
      "created_utc": 1702013978.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kck61fa",
      "author": "unVisible-Scientist",
      "body": "Dump him immediately",
      "created_utc": 1702074372.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kchc0cd",
      "author": "None",
      "body": "I would end up leaving the relationship for sure. He totally ignored you multiple times, it seemed, and if he truly respected ur recovery, he would understand and take into account the way u feel about the things he says to you. I will never be able to wrap my head around the idea of continuing something that someone tells you to stop doing especially if ur hurting that personal mentally... especially ur own partner... i wish u the best of luck! Stay safe <3",
      "created_utc": 1702027360.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kchgz8y",
      "author": "Parking_Signal_1999",
      "body": "i know exactly what you mean my mom used to do this to me all the time and i would get so triggered and it took so long for her to finally understand and with guys especially i feel like always make these type of comments to their partners naturally like it automatically comes out of their mouths lmao so it would probably be so hard or even impossible to actually get him to understand especially if he’s never been through something like that which sucks honestly i think you just have to take a step back for yourself and try to believe that the right person is out there for you and will get you and connect with you on a deeper level to where you don’t have to repeatedly explain yourself to them",
      "created_utc": 1702031555.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kcn2389",
      "author": "IronLadyRaven",
      "body": "I had something similar with someone who liked talking about child molestation and ephebophilia. \nAfter a few years of trying to convince them not to talk about it when I'm around, it didn't stick, eventually I've started feeling exhausted and realized it's not going to change.\n\nWhen it comes to personal boundaries like that, that the person refuses or fails to respect them, honestly ditch them, I don't think it's worth it.",
      "created_utc": 1702135051.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kck5e0v",
      "author": "Kinben615",
      "body": "Agree 100% you deserve someone who will support you and CHANGE their support if what they are doing isn't actually supportive.\n\nClearly he isn't helping as you're saying they are triggering you and sending you into relapses. You deserve the right to get better.",
      "created_utc": 1702074103.0,
      "score": 3,
      "context": [
        {
          "id": "kcegf50",
          "author": "pinkfrisbee",
          "body": "Personally, if I was with someone who would not stop triggering my ED or other mental health issues despite numerous conversations, I would end the relationship. Their expression of 'positive emotions' must not trump your health and wellbeing. I hope he changes his ways - if he doesn't respect your wellbeing, he doesn't deserve you imo. Stay strong ❤️",
          "created_utc": 1701977442.0
        }
      ]
    }
  ]
}