{
  "id": "18daeo1",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1701996393.0,
  "title": "Partner with ED now wants me to lose weight.",
  "selftext": "Hi everyone, would appreciate any advice of wisdom.\n\nI (31f) am in a relationship with my partner (31m) for 3 years. My partner has a lot of disordered eating behaviours and thoughts although he has never formally been diagnosed (most likely because he’s a man). As a teenager, he went for a period of about 3 years where he ate only one small meal per day, with the aim of losing weight and was for a time very underweight. He’s now a healthy weight but is very preoccupied with his weight and shape, will exercise rigidly even when unwell, will complain of feeling ‘fat’ and will restrict calories for long amounts of time before having periods of binging. He hates his body and avoids wearing T-shirts etc despite looking objectively great. So basically - classic enough eating disorder stuff as I know from a few close friends I have who suffer.\n\nMy partner however had never really considered his behaviour to be an ED and was a bit shocked when I gently raised it as a possibility. He suffers a lot from internal shame and this issue has largely remained unspoken between us, with me doing my best to be respectful of his being an adult, although I have suggested a few times he seek therapy, which he isn’t interested in. He looks on dieting as a way to make himself feel better and he doesn’t want that taken he says. He also suffers from depression.\n\nA few months ago I put on a some weight after a stressful life event. My partner has told me that this has hugely impacted his attraction to me and he wants me to lose it. We went on vacation last week and he was obviously annoyed when I indulged at all as he had decided it would be a good time for us both to lose weight. He insisted we walk a certain number of steps together everyday. \n\nI was very upset by this and it led to quite a big fight with him telling me if I didn’t lose weight he doesn’t want to be with me. I guess I’m wondering if anyone here has any insight into if this is related to his eating disorder and something I should be compassionate towards or is it unrelated? I appreciate it could well be a mix of both! Any insight or expertise into those who lack insight into their eating being a problem would also be helpful.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/18daeo1/partner_with_ed_now_wants_me_to_lose_weight/",
  "score": 49,
  "num_comments": 26,
  "comments": [
    {
      "id": "kcgck7t",
      "author": "ahhhrealbees",
      "body": "Do you want to be in a relationship where someone’s love and respect for you appears to hinge on what your body looks like? \n\nI was in a relationship like that for a long time, and let me tell ya. It doesn’t age well.",
      "created_utc": 1702005157.0,
      "score": 42,
      "context": []
    },
    {
      "id": "kcgd7n8",
      "author": "None",
      "body": "Honestly. I’ve been the partner in relationships who’s been just absolutely buried in my ED and full of denial about it. I also did not impose my rules and preoccupation with weight onto them. Yes this is probably happening because of his ED, but I don’t think it’s fair to say he’s putting it on you because he’s got an ED. This is controlling behaviour on top of his eating disorder. I know everyone is different but eating disorders are usually imposed on oneself and usually people who have them are internalizers. He’s trying to control your weight now. Do you see this trait in him for others things that aren’t ED related? Or is it just your weight he thinks he has a say in? I have a weird feeling from my own life experiences that he does this in other areas too",
      "created_utc": 1702005453.0,
      "score": 29,
      "context": []
    },
    {
      "id": "kcgefin",
      "author": "econroy",
      "body": "Regardless of his own eating issues, he has no right to shame you for something natural that happens to everyone. Fluctuations in weight are a very human thing and they are normal and expected, especially if they are in response to stress or trauma. \n\nYou can't fix him, dont waste your time and energy on trying. Know your worth and please don't tolerate this behavior. Your partners love and attraction to you should not be contingent on a mild shift in weight.",
      "created_utc": 1702006007.0,
      "score": 16,
      "context": []
    },
    {
      "id": "kcfzk1d",
      "author": "Excellent-World-476",
      "body": "I would do a quid pro quo. If he was ts you to adjust your weight, he first needs to do couples therapy where you discuss the issue.",
      "created_utc": 1701999459.0,
      "score": 29,
      "context": []
    },
    {
      "id": "kch6sf1",
      "author": "gymbunbae",
      "body": "As a person with an ED; I don't fucking care what body my partner has. I would never ever dare dream of asking my partner to change their body, because I love them for who they are, no matter what. I have adviced my partner to adopt healthier habits, because I want them to feel good and stay healthy, but this has been entirely unrelated to weight.",
      "created_utc": 1702023005.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kch32gi",
      "author": "Remarkable-Pirate214",
      "body": "Okay so I’ve had ed issues for over half my life. I have never, ever asked a partner to change their weight at all. My ed is about me, and I want everyone around me to be their natural, healthy, happy selves. I’m punishing myself, it’s not about anyone else. I find your partner’s pov quite disturbing and I’m so sorry he’s brought this up with you at all - let alone the pressure he’s putting on you ontop it!",
      "created_utc": 1702020124.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kch7qen",
      "author": "HansKolpinghuis",
      "body": "Girl, if his love is conditional to your looks... Run as fast as you can. That ain't love, that's an unresolve ED that is managing even his relationships, and you should not be responsible for it.",
      "created_utc": 1702023762.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kchjbnh",
      "author": "Parking_Signal_1999",
      "body": "as someone who 100% has lived most of their life with an ed i never once cared about what other people looked like and if i did it was because i was comparing myself to them internally. i think for men like it’s different bc most of the time they focus on our appearance even if they say they don’t. but it’s like that type of behavior is unacceptable even if he has ed issues himself. idk at least in my opinion that isn’t ed behavior like yeah maybe he’s putting his own judgement and body shame onto you but i don’t think that’s his ed talking i think it’s his soul and that’s scary i would leave if i were you bc that’s honestly disgusting and scary and ed or not you should never feel like you need to put up with that bc you don’t want to hurt him or bc he has mental health issues. most of us do have mental health issues but we still know how to be a good person and respect others so don’t let that be an excuse bc it isn’t no matter how hard it is to accept",
      "created_utc": 1702033416.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kch9zdh",
      "author": "None",
      "body": "he’s projecting, and this isn’t in any way, shape or form justifiable. i’ve had my ed for most of my life and it can manifest negative thoughts about myself and others in regards to weight but i’ve always been able to keep it to myself, never thinking of anyone less or higher because of their body. i have a partner as well, and the thought of saying what he said to you to them just makes me feel sick. \n\nplease know your worth and don’t try a “i can fix him..” attitude.",
      "created_utc": 1702025644.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kchf2n6",
      "author": "DepartmentLeast4721",
      "body": "More than an eating disorder, this sounds like him trying to take control of you, and objectifying you. The fact that he said he wasn’t attracted to you and would leave you if you didn’t lose weight isn’t love. This sounds like the beginning of a relationship in which you are constantly put down by your partner, which will cause you anxiety and damage your self esteem. Often times, these control issues will spread into other areas. An example of what could come next is him criticizing your fashion choices, then your friends, followed by your hobbies and job. I would leave as soon as you can, before you lose sight of who you are. Anyone who threatens to leave you and ruins a vacation over this isn’t healthy for you.",
      "created_utc": 1702029972.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kcik8om",
      "author": "Spinosaur_Flip",
      "body": "I appreciate that you have compassion for him, and he absolutely deserves help for what he’s going through. However, his struggles with what is clearly an eating disorder does not justify telling you to lose weight. \nUnderstanding mental health disorders can help explain behaviors, but they do not excuse behaviors. \nYou don’t deserve how he is acting. Also, I hope you’re healing ok from the stressful life event you recently experienced 💜",
      "created_utc": 1702051906.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kcgjg1x",
      "author": "ghoulettta",
      "body": "hes definitely projecting his ed onto you. this is horribly unhealthy and even with recovery someone who used to be disordered will still have disordered thoughts. if your partner is comfortable with projecting an unhealthy restrictive ed onto someone hes supposed to love and cherish, then he’s certainly not worth your time. you can’t fix or change this. an eating disorder isn’t supposed to make you a bad person.",
      "created_utc": 1702008343.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kcjt632",
      "author": "None",
      "body": "I have a diagnosed and sometimes deadly eating disorder now for 15 years and honestly with my partners I will do everything to make sure they don't suffer the same pain that I do with my weight. I know it's irrational and I know it's made me a Shell of a human being and I would never imagine wanting to be with somebody that suffers the way that I do or imposing that on them. If anything I hide it but I also go to therapy and have been getting better and thankfully, it's still a daily struggle and anytime somebody I'm dating as a straight woman, brings up their body, I instantly tell them that I am not with them for their weight and wish they would never ever worry about that and only worry about how they treat me and if they are healthy. That's as far as it goes",
      "created_utc": 1702069213.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kcjq202",
      "author": "CrunkSceneKing",
      "body": "You should probably take a break. And if his actions change and he realizes the flaws in his thinking then you can try to fix your relationship. But if his ways don’t change then it was a good idea to separate because this is clearly effecting your mental health.",
      "created_utc": 1702068004.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kck1zuq",
      "author": "None",
      "body": "Hi, I developed my eating disorder because my first ever boyfriend started projecting his onto me like this. He was an adult, I was a teenager, and he basically groomed me into it. It’s been a really long battle for me that I’m still not really winning. I would suggest breaking up if he’s not budging on this. If not breaking up, at least couples counseling.",
      "created_utc": 1702072724.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kckciaj",
      "author": "CloudGreat662",
      "body": "This is probably not the advice you're looking for, but RUN. GET OUT, NOW. This is toxicity at its core. In my opinion (and I DID have an eating disorder for a very long time), you should kind of forget everything relating to his own disordered behavior & thoughts for a moment & just be honest with yourself: do I really want to be with somebody who can't love me the same at 150 lbs as they did at 140? (I'm making these #'s up)\n\nIt should no longer be a question, your boyfriend ABSOLUTELY has an eating disorder. Of course in his mind, he's doing something good in \"making himself better\" but in reality, he's only harming his own body & mind - but ALSO dragging you down with him, which is dangerous. It sounds like you have a super healthy relationship with food & with your body & you should not only cherish that, but protect it at all costs!\n\nI personally think you need to be the complete opposite of compassionate. You don't have to be a total betch, but he needs to understand that while he's free to do & say these things to himself as a grown adult, YOU are more than your body. You're more than your looks & how attractive he finds you, and you deserve to be with somebody who can appreciate you for you, not for how hard he gets looking at you. I genuinely think this guy needs to come to terms with his own issues before he'll be capable of having a healthy relationship & the #1 red flag you should consider is that he clearly has no interest in doing that.\n\nI vote you break up with him first, because there will be a man out there who won't even notice when you put on a little weight. And if he does, he'll be smart enough to keep it to himself lol",
      "created_utc": 1702077111.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kcij13l",
      "author": "funkydyke",
      "body": "I would never let a man tell me what to do with my body like that. He sounds like an asshole. I’d dump him.",
      "created_utc": 1702051435.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kcfx3hs",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1701998400.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kckbcvx",
      "author": "classyjunebug",
      "body": "Honestly, he should not be saying all that. You’re a human being with feelings. Suggest him therapy. If he refuses and continues to project his ED onto you maybe leave him",
      "created_utc": 1702076612.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kcpmxdz",
      "author": "wisdomthealbatross",
      "body": "tbh i would leave so quick. nobody should ever treat you like that. maybe give him a chance with couple's therapy and individual therapy if you really have a lot of faith in him, but personally this is not something i would give second chances on. even if you lose weight, what's going to happen if you gain it again in the future? what if you were to get ill and gain weight? what about if you had a kid and had baby weight? or what about simply when you get older and your body doesn't look like it does when you were young? will you ever be able to continue with the relationship and not feel negatively judged by him if your weight fluctuates?",
      "created_utc": 1702171407.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kckvgu5",
      "author": "lexruns14",
      "body": "This\\^. As someone with an ED, I would never project that on to my partner. He'll go days without working out (would stress me tf out), he has a sugar stash at my place (all his favorite candies) and is almost always eating around me. I mean lucky for him it doesn't seem to go anywhere lol, but my point is that he has such freedom with food and exercise that I would never want to project my own fears on to him, I'd never want to ruin that for him. While I can appreciate where your partner is coming from, I do not agree with it, and its very damaging to you.",
      "created_utc": 1702085738.0,
      "score": 16,
      "context": [
        {
          "id": "kcgck7t",
          "author": "ahhhrealbees",
          "body": "Do you want to be in a relationship where someone’s love and respect for you appears to hinge on what your body looks like? \n\nI was in a relationship like that for a long time, and let me tell ya. It doesn’t age well.",
          "created_utc": 1702005157.0
        }
      ]
    },
    {
      "id": "kchttmp",
      "author": "None",
      "body": "Yeah, I never would have dreamed of commenting on a partner’s weight when I had an ED. I think this guy is just an ass tbh.",
      "created_utc": 1702040226.0,
      "score": 15,
      "context": [
        {
          "id": "kcgd7n8",
          "author": "None",
          "body": "Honestly. I’ve been the partner in relationships who’s been just absolutely buried in my ED and full of denial about it. I also did not impose my rules and preoccupation with weight onto them. Yes this is probably happening because of his ED, but I don’t think it’s fair to say he’s putting it on you because he’s got an ED. This is controlling behaviour on top of his eating disorder. I know everyone is different but eating disorders are usually imposed on oneself and usually people who have them are internalizers. He’s trying to control your weight now. Do you see this trait in him for others things that aren’t ED related? Or is it just your weight he thinks he has a say in? I have a weird feeling from my own life experiences that he does this in other areas too",
          "created_utc": 1702005453.0
        }
      ]
    },
    {
      "id": "kcfxj2v",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1701998589.0,
      "score": 1,
      "context": [
        {
          "id": "kcfx3hs",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1701998400.0
        }
      ]
    },
    {
      "id": "kchm7tu",
      "author": "EatingDisorders-ModTeam",
      "body": "Hi there, we appreciate your struggles. Unfortunately your submission has been removed for the following reason(s):\n\nYour message has been removed. Please do not encourage pro-ED comments. If you feel your message has been wrongfully deleted reply to this message with the reason.",
      "created_utc": 1702035564.0,
      "score": 1,
      "context": [
        {
          "id": "kcfx3hs",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1701998400.0
        }
      ]
    },
    {
      "id": "kchm96b",
      "author": "EatingDisorders-ModTeam",
      "body": "Hi there, we appreciate your struggles. Unfortunately your submission has been removed for the following reason(s):\n\nYour message has been removed. Please do not encourage pro-ED comments. If you feel your message has been wrongfully deleted reply to this message with the reason.",
      "created_utc": 1702035590.0,
      "score": 1,
      "context": [
        {
          "id": "kcfx3hs",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1701998400.0
        },
        {
          "id": "kcfxj2v",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1701998589.0
        }
      ]
    }
  ]
}