{
  "id": "18g6tfl",
  "subreddit": "EatingDisorders",
  "author": "Fun-Chicken-2634",
  "created_utc": 1702335199.0,
  "title": "Missing my sick body",
  "selftext": "I miss my sick body\nShe was angular and\nher words were as sharp as her protruding bones\nPeople didn’t know how to reach her, so they stayed away\nInstead of talking to her, they talked behind her back\n \nThe mask she wore dared them to face her, knowing they never would\nShe didn’t need them for she had no needs\nOnce she saw our mom crying because of what this sick body had become\n \nIt was a superpower really\nShe could go longer, farther, harder\nA secret game no one signed up to play, but damn it, she was good at this\n \nFor being so good it did feel bad\nThe lies, crashed blood sugar, pressure sores and all\n \nI’ve watched her shrink so many times\nThe soft place that held our babies, sunken in\nThe breasts that nourished them, reduced to nothing\nShe had no womanhood\n \nEvery pound she lost she was closer to achieving the invisibility she longed for\nSee, that is what kept us safe from prying hands\nBut it wasn’t infallible, because as it does, the darkness still found its way in\n \n“This time will be different\nWe will never be hurt again” she told me\nNo one can hurt us as bad as we hurt us\nAnd we did hurt us\nA lot\n \nPeople say recovery is brave\nBut is it truly brave when you’ve had no other choice: Sink or swim\nI am tired and I don’t want to be brave\nI don’t want to do the hard things anymore\nI miss the safety of her consuming presence\n \nNow I am alive\n \nShe is too but she is quiet. She doesn’t yell as much\nAnd she is smaller, at times, almost invisible, just like she always wanted us to be\nShe whispers comfort when I feel too much\nBut she can’t offer the healing my soul has tasted\nThere is a world beyond our sickness\nEven when I miss her",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/18g6tfl/missing_my_sick_body/",
  "score": 53,
  "num_comments": 7,
  "comments": [
    {
      "id": "kd2lej3",
      "author": "LoveThatForYouBebe",
      "body": "Wow, I felt this on a visceral level. You captured this experience so perfectly. I’m unsettled by how much it resonates.",
      "created_utc": 1702406787.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kd3c0k9",
      "author": "OneRepresentative954",
      "body": "i miss her too   even though i have ‘healed’",
      "created_utc": 1702416562.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kd3qxrt",
      "author": "Dutchie_Mike",
      "body": "Nice copy and paste read this on another site before, dont see how this makes any sense in recovery but its a nice read",
      "created_utc": 1702422172.0,
      "score": -2,
      "context": []
    },
    {
      "id": "kd44n05",
      "author": "Fun-Chicken-2634",
      "body": "Thank you ❤️ it’s quite the place to be in recovery..",
      "created_utc": 1702427859.0,
      "score": 4,
      "context": [
        {
          "id": "kd2lej3",
          "author": "LoveThatForYouBebe",
          "body": "Wow, I felt this on a visceral level. You captured this experience so perfectly. I’m unsettled by how much it resonates.",
          "created_utc": 1702406787.0
        }
      ]
    },
    {
      "id": "kd44oyk",
      "author": "Fun-Chicken-2634",
      "body": "I wonder if she will ever leave for good",
      "created_utc": 1702427882.0,
      "score": 3,
      "context": [
        {
          "id": "kd3c0k9",
          "author": "OneRepresentative954",
          "body": "i miss her too   even though i have ‘healed’",
          "created_utc": 1702416562.0
        }
      ]
    },
    {
      "id": "kd44hxw",
      "author": "Fun-Chicken-2634",
      "body": "Not a copy and paste, I wrote this yesterday so I’m not sure what you are referring to",
      "created_utc": 1702427798.0,
      "score": 4,
      "context": [
        {
          "id": "kd3qxrt",
          "author": "Dutchie_Mike",
          "body": "Nice copy and paste read this on another site before, dont see how this makes any sense in recovery but its a nice read",
          "created_utc": 1702422172.0
        }
      ]
    },
    {
      "id": "kde27r5",
      "author": "manders556",
      "body": "A common aspect of recovery that many struggle with is missing their “sick body” but romanticizing our sick body can just keep us stuck in romanticizing our illness and body obsessed. I think it’s important and there’s a difference between GRIEVING/letting go of the entire idea of your old body in recovery and staying stuck in the disordered mindset through romanticizing your sick body. Romanticizing my sick body has led to relapse in the past. I no longer romanticize it and find myself stuck in nostalgia over it but rather I genuinely grieved the idea of my sick body and felt the emotions that come with that and embraced change so that I could let go of the past. My sick body is a thing of the past and I do not want to”her” back. My sick body no longer serves me the same way it used to and that’s why I don’t find myself daydreaming or longing to become ill. I’ve fixed that part of my brain that wanted to shrink and become ill through years of therapy trauma work and reframing disordered thoughts. My body is the LEAST interesting thing about me truly which is why I don’t even find myself romanticizing and longing for my ill state.",
      "created_utc": 1702596640.0,
      "score": 2,
      "context": [
        {
          "id": "kd3qxrt",
          "author": "Dutchie_Mike",
          "body": "Nice copy and paste read this on another site before, dont see how this makes any sense in recovery but its a nice read",
          "created_utc": 1702422172.0
        }
      ]
    }
  ]
}