{
  "id": "18lfgdz",
  "subreddit": "EatingDisorders",
  "author": "beamdog77",
  "created_utc": 1702923475.0,
  "title": "Parent, new to this, advice needed",
  "selftext": "UPDATE 2\nHer blood work came back with some indicators of extreme malnutrition to the point I think she might end up admitted tomorrow. \n\n\nUPDATE\nWe went to the appointment. My pediatrician was phenomenal with asking slick questions that weren't too obvious. She told me in private she was concerned because my daughter had lost a significant amount of weight and double digits off her percentage on the growth chart. She is starting with blood tests, liver function, kidneys, diabetes testing, and much more, to validate any medical/physical reasons, and then said she'll call me tomorrow. She was very discrete in the conversation in front of my daughter which was my biggest fear. She asked my daughter a series of all kinds of questions unrelated to weight or eating and then slipped in a question about how her appetite was and my daughter said \"I don't want to eat\" and I was so relieved that she said that. I'm not sure why I was relieved, because I still want this to not be happening, but I think I also feel her admitting it is a big step and it may mean she's not shamed, and so maybe it will be easier to help. I don't know. My mind is in so many places right now. \n\nThank you to every single one of you that has commented. I can't tell you what a difference it has made for me. \n\nOriginal post:\n\nHello,\nI have an 8 year old daughter, let's call her L. \n\nL has recently started showing some red flags, such as weight loss to a now unhealthy BMI for her age, extremely underweight. She has began having an excuse why something is wrong with every meal, and why she can't eat it, including things she used to love. She's avoidant of food, snacks, milk, everything. She hides her body under baggy clothing, even when it's hot, and I have heard her talk about calories (she's eight!). I recently started offering meal replacement shakes, but she doesn't \"like\" any of them. \n\nI'm concerned. I have a pediatrician appointment this week but I'm so scared. I am scared because if I say the wrong thing to the doctor, and my daughter hears it, will it plant more seeds or make it worse? \n\nI plan to write my concerns down on paper and hand it to the pediatrician but I'm just so lost. \n\nI don't know how to help. \n\nI don't know what I'm asking but at this age, what advice would you have for me?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/18lfgdz/parent_new_to_this_advice_needed/",
  "score": 53,
  "num_comments": 40,
  "comments": [
    {
      "id": "kdxby2o",
      "author": "curlyqchicago",
      "body": "Im sorry youre dealing with this. \n\nFirst, good job for noticing these flags and setting up an appointment. \n\nSecond, understand right now that eating disorders are a specialization. Your pediatrician may not have any experience with this at ALL and they can lead you incorrectly. But they can at least assess there are not more medical things at play that could cause her to do these things. \n\n\nBut lets assume it is an eating disorder blossoming—\n\nYou need to seek out an eating disorder specialist NOW. A medical doctor and a therapist/counselor of sorts who specializes in pediatric eating disorders. Do not let anyone else treat your daughter. They may mean well but create more harm. \n\nYou are now the person to advocate for her and you also need to understand eating disorders inside and out. Not to overwhelm you, just letting you know the facts. I would definitely have a conversation with your pediatrician before the appointment, letting them know the extent of all your concerns. Do not let your daughter hear any of these concerns. Then, the doctor may speak to her with this information in mind during their assessment.\n\nNot sure what your home environment is or isnt but some basics: do not force food on her. Do not bring up food or lecture her. Do not talk about her body— good or bad. Set good examples for eating yourself. Reinforce that all bodies are normal and food is fuel.\n\nMy eating disorder started at 10-11. I am 34 years old and would not wish this on anyone, not even my enemies. My eating disorder started as a single adolescent thought – “I look ugly and fat compared to other girls.” It transformed into a coping mechanism for my anxiety, unstable home life, and my inability to name my emotions (my family never spoke about emotions). I am 24 years away from my 10 year old self. I do not think (or care) about looks or my body. Eating disorders are never just about looks. Theyre deep-seeded, anxiety-fueled coping mechanisms to a problem. You, a medical team, and your daughter need to find the problem. The problem may simply be she wants to be like other girls. (“Skinny and pretty”). It most likely has not become more than that, which is still bad, but you can make big strides and help now before it gets worse. \n\nGood luck OP. Sorry to sound short, on my cell and difficult to type out. Let me know if you have questions",
      "created_utc": 1702924976.0,
      "score": 46,
      "context": []
    },
    {
      "id": "kdy0gts",
      "author": "autieswimming",
      "body": "Oh my god what a wonderful parent you are. \nI think a lot may have helped me - hearing body positive talk from my parents, or other adults/role models, learning about food in a way that talks about nutrition, but also is fun, having more positive food memories, and having an adult listen to me and ask questions about why I was counting calories or thinking about fat in foods as a little girl. In a way that took me seriously.\nI think it can be hard to go directly to the pediatrician. If they give you guidance, great... But there's a chance your daughter then feels like she did something wrong (as I did), which is a terrible feeling and can fuel an eating disorder.",
      "created_utc": 1702933697.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kdxqeo9",
      "author": "irqsie",
      "body": "All i can say is your absolutely doing the right thing, I wish my parents did the same as you’re doing right now, and i hope you can help her 💗",
      "created_utc": 1702930121.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kdxr2b2",
      "author": "Super_Season_6971",
      "body": "Curlyqchicago gives excellent advice. This is, gulp, a mental illness. A psychiatrist, counselor, nutritionist and an MD, all experienced with ED is warranted ASAP. NEDA is a good start and may help you find the right practitioners. Depending on where you live, it may be hard to find competent practitioners. While you are waiting for those appointments 3 weeks out, keep the dialogue open. Help by teaching some coping skills to handle anxiety. Mind the social media. If your child is involved in activities such as cheer/ dance/gymnastics, ( sorry, but these are activities where body shaming can be rampant among girls.). This ED so quickly and so easily becomes an addictive- like loop. Learn everything you can about eating disorders. Good job you are working on it!",
      "created_utc": 1702930356.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kdzxqtp",
      "author": "roputsarina",
      "body": "I hate to contradict what some people are saying but maybe skirting around the subjects of EDs and disordered eating and weight loss, as much as you are trying to not put ideas in her head, might be having the unintended effect of making those subjects taboo...",
      "created_utc": 1702961981.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kdxkoc6",
      "author": "fortheloveof0",
      "body": "I have literally no advice, just want to wish you luck and say that your daughter is lucky to have you.",
      "created_utc": 1702928075.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ke1g7qr",
      "author": "Hamsssandwich",
      "body": "I agree with everything that everyone has said so I don’t have any advice, just a little encouragement!\n\nI commend you and your husband for being so kind to your daughter. This is hard on both ends. It’s hard for her, but it’s also very hard to watch your child suffer. The mom guilt is real, but you are handling this so beautifully and tenderly. Please do not get discouraged that a lot of us had eating disorders at a young age and they continued for years. \n\nAll of us DID NOT get the help we so desperately needed. You are doing things differently. You are doing the right thing. You are doing what our caregivers SHOULD have done. \n\nGreat job mama! I speak for everyone when I say, we are so SO proud of you! \n\nSending so much love to you, your husband, and your baby girl. I just sent a prayer to Jesus for you guys & I will continue doing so. \n\nYou’ve got this mama. You have it in the bag.",
      "created_utc": 1702996572.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ke6w32m",
      "author": "cryingisland",
      "body": "She is still 8, it could be arfid or something which is common in mostly children. but ive been a child in this situation and some advice i would give would be too not have doctors and specialists be the main part on this issue, 9 times out of 10 if it is a purposfull weight loss can make it worse. try to talk to her with empathy and find out whats going on before taking her to a bunch of doctors. of course, you can still make her see doctors but dont make it a telephone game between the doctors and you. try to undertsand whats going on.",
      "created_utc": 1703086824.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kea7dvj",
      "author": "Chemical_Candy343",
      "body": "There are also a lot of things that can cause an actual decrease in appetite. I deal with disordered eating as a result of having a bacterial infection called H. Pylori for the majority of my life. Imagine going through life and everything that you eat gives the same satisfaction as chewing on cardboard would. I thought I was crazy for a long time but I was actually sick and no one knew why. Don’t rule out these things as a possible factor. I’m not saying it isn’t the start of an eating disorder, but also make sure you advocate for her to be cared for thoroughly as you navigate this. I wish you the best and will keep your daughter in my prayers.",
      "created_utc": 1703133516.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kdy44rw",
      "author": "manders556",
      "body": "Yes it’s an eoedemic the age for early body dissatisfaction has gotten lower. Studies are showing children as young as 6 years old are now actively showing body dissatisfaction and body dysmorphia signs. I developed my ED at age 11. 25 f fully recovered now but wouldn’t consider myself truly recovered until this year. A decade of on and off recovery and treatment and many relapses recovery truly isn’t linear. First and foremost it’s not your fault, it’s a coping mechanism. How we talk about food and diet culture are known to fuel and exasperate the illness though. I know a lot of my ED behaviors truly were passed down learned behaviors from family due to diet-culture. I don’t know the house of dynamics with food and what you have taught your children in regards to food but I know food labeling and calling food junk is normalized but disordered and fueled my illness. Be careful how you talk about food and the messages you could be sending about food and bodies. Seek professional help. Don’t force or pressure to eat but rather encourage and promote eating opportunities for your daughter. The evidence based treatment for EDs right now is a team of trauma informed therapist and intuitive eating dietician. I didn’t get help till I was 15 and went to my first program as a minor. It’s a coping mechanism. It’s serving a purpose for her. For me it started around puberty which is already a difficult time and then culture shock and being bullied for my weight and mom that was diet culture obsessed and pediatrician that pointed out my BMI and told me to lose weight at age 11 all contributed to the development of my ED. I also found out I had ADHD and a lot of my ED struggles were also sensory issues related as well as cognitive distortions and coping mechanism. Truly a multifaceted issue. Mental health is complex. Early intervention is key. I’d recommend getting her help asap and talk to doctor for referrals for a good ED program if necessary. Treatment saved my life on many occasions. It’s a deadly disease. Eating disorders used to be number one for years now second highest mortality rate of any MENTAL ILLNESS following opioid abuse. \n\nShe is trying to cope and survive the best way she knows how right now and it happens to be a maladaptive coping mechanism. Social media can be very dangerous for minors nowadays days especially with the pro Ana content and normalized disorder eating content in general. I fear to have kids due to this. Misinformation on health and bodies is rampant and social media influencers are out here spreading false info like wildfire. A intuitive eating dietician that specializes in eating disorders and therapist that specializes in eating disorders is highly recommended",
      "created_utc": 1702935003.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdylm8p",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1702941586.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ke4da6z",
      "author": "Sea-Fix-3520",
      "body": "My mother was a wonderful cook,chef🍭🍰and she made everything great,but I was addicted to sugar and substitutes and I was out of control with food.I ate 2 deserts and I ate addictively when I came home from school.But I didn't know what to do.i tried to tell my mom, but I don't think she got it.",
      "created_utc": 1703036158.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ke5vzga",
      "author": "r1poster",
      "body": "https://youtu.be/KKSwPBUhCBo\n\nDocumentary about an 8 year old treated for anorexia. May be of some insight for your situation.",
      "created_utc": 1703068031.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ke60anl",
      "author": "themostdownbad",
      "body": "Where do you think she is learning about calories? I have seen a lot of ED content on tiktok these past few months. The comments are filled with kids and young teens.",
      "created_utc": 1703071292.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kec9hl8",
      "author": "SpeakerKitchen236",
      "body": "I think it might be pertinent to also see what content she's consuming. I hear there's a lot of influencers promoting unhealthy beauty standards on their fans. Just be virtue of the fact that they're an adult partaking in modern beauty culture. Something a kid has no business being interested in. \n\nI think the adults we look up to often model what our outlook on life will be. :/",
      "created_utc": 1703176014.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kdym7c7",
      "author": "beamdog77",
      "body": "Thank you, Copy on the Pediatrician. I'm hoping maybe they can give me a referral or point me towards resources, but I have to start there because my insurance will require referrals. And thank you for the advice about seeking out an expert vs a general therapist. Once I have a referral, I'll have some say in which provider I choose so I'll start researching NOW.   \n\n\nAnd yes, my husband and I have been so incredibly careful not to ever say anything in front of her or within ear shot as we discussed our concerns between ourselves, and I did write down some of my main concerns and will hand that to the nurse at intake, asking them not to ask any obvious questions in front of my daughter. My daughter thinks the doctors appointment is just a regular yearly physical exam, so we'll do height/weight, and I'm hoping the doctor can ask some basic slick questions without being obvious, and then I'll have my husband take my daughter out to the waiting room. I'm just not sure at her age what appropriate conversation is with her, and that's why I need help. I'm hoping to find a local parent resource where I can learn how to support and not trigger.... because I am LOST and mostly frozen.   \n\n\nAs for home, we have NEVER forced food on her, and have never withheld desert to finish food, or grounded her for not eating, or anything, BUT I admit that we used to occasionally give her a hard time about refusing to try food. But, we have slipped up and expressed frustration like, \"Really! I really need you to eat something\" and then I hate myself after. We RARELY do this, and especially have policed ourselves since we started to suspect it was more than just pickiness. We're trying hard to do better. I was never yelling or making her in trouble, but she's a very very compliant child and any level of parental disappointment is enough to upset her. She's very much a parent-pleaser, so I wish I hadn't have made those gaffs. But they are rare.   \n\n\nAnd we've tried with the food is fuel thing, like when we go for hike, I'll say things like \"Oh I can't wait to refuel with dinner. We used a ton of energy and it'll be good to feed our bodies\" but now I'm like \"Did I lay it on too thick??\" Argh, the mom-guilt is intense. I'm trying so hard, and I'm afraid I'll overcorrect or if I try harder, it's going to look like calorie obsession. \n\nThank you!",
      "created_utc": 1702941821.0,
      "score": 11,
      "context": [
        {
          "id": "kdxby2o",
          "author": "curlyqchicago",
          "body": "Im sorry youre dealing with this. \n\nFirst, good job for noticing these flags and setting up an appointment. \n\nSecond, understand right now that eating disorders are a specialization. Your pediatrician may not have any experience with this at ALL and they can lead you incorrectly. But they can at least assess there are not more medical things at play that could cause her to do these things. \n\n\nBut lets assume it is an eating disorder blossoming—\n\nYou need to seek out an eating disorder specialist NOW. A medical doctor and a therapist/counselor of sorts who specializes in pediatric eating disorders. Do not let anyone else treat your daughter. They may mean well but create more harm. \n\nYou are now the person to advocate for her and you also need to understand eating disorders inside and out. Not to overwhelm you, just letting you know the facts. I would definitely have a conversation with your pediatrician before the appointment, letting them know the extent of all your concerns. Do not let your daughter hear any of these concerns. Then, the doctor may speak to her with this information in mind during their assessment.\n\nNot sure what your home environment is or isnt but some basics: do not force food on her. Do not bring up food or lecture her. Do not talk about her body— good or bad. Set good examples for eating yourself. Reinforce that all bodies are normal and food is fuel.\n\nMy eating disorder started at 10-11. I am 34 years old and would not wish this on anyone, not even my enemies. My eating disorder started as a single adolescent thought – “I look ugly and fat compared to other girls.” It transformed into a coping mechanism for my anxiety, unstable home life, and my inability to name my emotions (my family never spoke about emotions). I am 24 years away from my 10 year old self. I do not think (or care) about looks or my body. Eating disorders are never just about looks. Theyre deep-seeded, anxiety-fueled coping mechanisms to a problem. You, a medical team, and your daughter need to find the problem. The problem may simply be she wants to be like other girls. (“Skinny and pretty”). It most likely has not become more than that, which is still bad, but you can make big strides and help now before it gets worse. \n\nGood luck OP. Sorry to sound short, on my cell and difficult to type out. Let me know if you have questions",
          "created_utc": 1702924976.0
        }
      ]
    },
    {
      "id": "kdy5b4o",
      "author": "beamdog77",
      "body": "That's what I'm scared of. To be honest, I've been noticing these red flags for while and it's getting worse and she is loosing weight and rejecting new food regularly. We do not talk about bodies or weight, we are careful of never getting into a power struggle over meals, we don't force her to finish her food, we allow dessert and snacks, and she has full access to a pantry anytime she wants food. I even allow her to help me grocery shop so she can pick foods she likes. We have desperately tried to make it not be a \"thing.\" We let her pick restaurants when we go out to eat. I tried the \"this is what dinner is and you're not getting a different dinner but I will give you milk\" thing and last night I made her literally THREE different dinners. I placed them in front of her and just prayed she would eat. She wouldn't. Nicely I would ask, \"Do you want something else?\" And made her something else. No dice. That was after eating less than a serving of cereal for breakfast and less than a quarter sandwich for lunch. \n\nMy heart is just breaking and I want to help, but I'm afraid to directly address it with her because of her age, so I'm paralyzed. \n\nSo long story short, I noticed this awhile ago, and I have tried so much that I have learned from my own attempts to research but it's just getting worse and I feel like I need professional help at this point. I am crying as I type this because it's worse than I can describe and in my heart I feel so helpless because I know something is going on. I know the rules are we can't say BMI numbers but when I calculated her BMI today I was sick.",
      "created_utc": 1702935426.0,
      "score": 3,
      "context": [
        {
          "id": "kdy0gts",
          "author": "autieswimming",
          "body": "Oh my god what a wonderful parent you are. \nI think a lot may have helped me - hearing body positive talk from my parents, or other adults/role models, learning about food in a way that talks about nutrition, but also is fun, having more positive food memories, and having an adult listen to me and ask questions about why I was counting calories or thinking about fat in foods as a little girl. In a way that took me seriously.\nI think it can be hard to go directly to the pediatrician. If they give you guidance, great... But there's a chance your daughter then feels like she did something wrong (as I did), which is a terrible feeling and can fuel an eating disorder.",
          "created_utc": 1702933697.0
        }
      ]
    },
    {
      "id": "kdybrm3",
      "author": "beamdog77",
      "body": "Thank you. I suffer from anxiety and I don't see it in her at all, except around food. She's the most easy going child in everything else. I do live in a very big city, top 10 in the US, so hopefully I can find resources. I'm just now starting to look. And no, no extracurriculars at all. And thank you.",
      "created_utc": 1702937795.0,
      "score": 5,
      "context": [
        {
          "id": "kdxr2b2",
          "author": "Super_Season_6971",
          "body": "Curlyqchicago gives excellent advice. This is, gulp, a mental illness. A psychiatrist, counselor, nutritionist and an MD, all experienced with ED is warranted ASAP. NEDA is a good start and may help you find the right practitioners. Depending on where you live, it may be hard to find competent practitioners. While you are waiting for those appointments 3 weeks out, keep the dialogue open. Help by teaching some coping skills to handle anxiety. Mind the social media. If your child is involved in activities such as cheer/ dance/gymnastics, ( sorry, but these are activities where body shaming can be rampant among girls.). This ED so quickly and so easily becomes an addictive- like loop. Learn everything you can about eating disorders. Good job you are working on it!",
          "created_utc": 1702930356.0
        }
      ]
    },
    {
      "id": "ke4xssv",
      "author": "Sea-Fix-3520",
      "body": "I was smart and an artist in school I got A,'s,but I wasn't blonde or a cheerleader or tall or socially able to get along.I already had been SA, and hated myself.But I was addicted to sugar and flour,just like I am an alcoholic and a drug addict.It is not my fault,but for me ,restricting aside, I was an alcoholic with sugar and white flour.",
      "created_utc": 1703045183.0,
      "score": 2,
      "context": [
        {
          "id": "kdxr2b2",
          "author": "Super_Season_6971",
          "body": "Curlyqchicago gives excellent advice. This is, gulp, a mental illness. A psychiatrist, counselor, nutritionist and an MD, all experienced with ED is warranted ASAP. NEDA is a good start and may help you find the right practitioners. Depending on where you live, it may be hard to find competent practitioners. While you are waiting for those appointments 3 weeks out, keep the dialogue open. Help by teaching some coping skills to handle anxiety. Mind the social media. If your child is involved in activities such as cheer/ dance/gymnastics, ( sorry, but these are activities where body shaming can be rampant among girls.). This ED so quickly and so easily becomes an addictive- like loop. Learn everything you can about eating disorders. Good job you are working on it!",
          "created_utc": 1702930356.0
        }
      ]
    },
    {
      "id": "kf665wq",
      "author": "quickthrowaway108",
      "body": "Agree with this. Sounds like there’s a lot of avoidance going on and I’m not sure how helpful that is for creating space for her to feel able to talk about it",
      "created_utc": 1703709343.0,
      "score": 1,
      "context": [
        {
          "id": "kdzxqtp",
          "author": "roputsarina",
          "body": "I hate to contradict what some people are saying but maybe skirting around the subjects of EDs and disordered eating and weight loss, as much as you are trying to not put ideas in her head, might be having the unintended effect of making those subjects taboo...",
          "created_utc": 1702961981.0
        }
      ]
    },
    {
      "id": "ke1gn12",
      "author": "beamdog77",
      "body": "Thank you. I desperately needed the encouragement. Taking her to the doctor is terrifying because it makes it real.",
      "created_utc": 1702996753.0,
      "score": 2,
      "context": [
        {
          "id": "ke1g7qr",
          "author": "Hamsssandwich",
          "body": "I agree with everything that everyone has said so I don’t have any advice, just a little encouragement!\n\nI commend you and your husband for being so kind to your daughter. This is hard on both ends. It’s hard for her, but it’s also very hard to watch your child suffer. The mom guilt is real, but you are handling this so beautifully and tenderly. Please do not get discouraged that a lot of us had eating disorders at a young age and they continued for years. \n\nAll of us DID NOT get the help we so desperately needed. You are doing things differently. You are doing the right thing. You are doing what our caregivers SHOULD have done. \n\nGreat job mama! I speak for everyone when I say, we are so SO proud of you! \n\nSending so much love to you, your husband, and your baby girl. I just sent a prayer to Jesus for you guys & I will continue doing so. \n\nYou’ve got this mama. You have it in the bag.",
          "created_utc": 1702996572.0
        }
      ]
    },
    {
      "id": "kec7b77",
      "author": "beamdog77",
      "body": "Thank you! We're at the lab now actually. The doctor was great and ordered a ton of tests.",
      "created_utc": 1703175205.0,
      "score": 2,
      "context": [
        {
          "id": "kea7dvj",
          "author": "Chemical_Candy343",
          "body": "There are also a lot of things that can cause an actual decrease in appetite. I deal with disordered eating as a result of having a bacterial infection called H. Pylori for the majority of my life. Imagine going through life and everything that you eat gives the same satisfaction as chewing on cardboard would. I thought I was crazy for a long time but I was actually sick and no one knew why. Don’t rule out these things as a possible factor. I’m not saying it isn’t the start of an eating disorder, but also make sure you advocate for her to be cared for thoroughly as you navigate this. I wish you the best and will keep your daughter in my prayers.",
          "created_utc": 1703133516.0
        }
      ]
    },
    {
      "id": "kdya4ws",
      "author": "beamdog77",
      "body": "Thank you for taking the time to reply. Yes, I have been examining my every move. My husband and I are not overly thin, but have made some jokes in the past like \"oh man, this pizza is so good, probably has a million calories\" but have never talked about calories with relation to weight, and have never ever ever uttered a word to the kids about how many calories they are eating, and have never talked about their weight. We have never said anything about anyone else's weight. I'm so so careful of this, but not perfect.  \n\nI have thought of the control aspect of it, but honestly there is no trauma or concern in her life that I'm aware of. The only thing that I can kind of think of is we're military and we had to move to a foreign country when she was a bit younger and I think maybe there were feelings of lack of control of food when we moved there and the food was so drastically and completely different, and then we moved two more times, uprooting her home and her friends. Oh my heart. I don't know if it's related but it's the only real adversity she has faced. \n\nThank you for the advice,  I am definitely going forward with getting professional help or at least someone to give me advice on what I should do to help. \n\nMaybe this is nothing and she just has a small appetite, but I'm trying to be careful here and not trigger anyone with details... I know it's more than that.",
      "created_utc": 1702937182.0,
      "score": 2,
      "context": [
        {
          "id": "kdy44rw",
          "author": "manders556",
          "body": "Yes it’s an eoedemic the age for early body dissatisfaction has gotten lower. Studies are showing children as young as 6 years old are now actively showing body dissatisfaction and body dysmorphia signs. I developed my ED at age 11. 25 f fully recovered now but wouldn’t consider myself truly recovered until this year. A decade of on and off recovery and treatment and many relapses recovery truly isn’t linear. First and foremost it’s not your fault, it’s a coping mechanism. How we talk about food and diet culture are known to fuel and exasperate the illness though. I know a lot of my ED behaviors truly were passed down learned behaviors from family due to diet-culture. I don’t know the house of dynamics with food and what you have taught your children in regards to food but I know food labeling and calling food junk is normalized but disordered and fueled my illness. Be careful how you talk about food and the messages you could be sending about food and bodies. Seek professional help. Don’t force or pressure to eat but rather encourage and promote eating opportunities for your daughter. The evidence based treatment for EDs right now is a team of trauma informed therapist and intuitive eating dietician. I didn’t get help till I was 15 and went to my first program as a minor. It’s a coping mechanism. It’s serving a purpose for her. For me it started around puberty which is already a difficult time and then culture shock and being bullied for my weight and mom that was diet culture obsessed and pediatrician that pointed out my BMI and told me to lose weight at age 11 all contributed to the development of my ED. I also found out I had ADHD and a lot of my ED struggles were also sensory issues related as well as cognitive distortions and coping mechanism. Truly a multifaceted issue. Mental health is complex. Early intervention is key. I’d recommend getting her help asap and talk to doctor for referrals for a good ED program if necessary. Treatment saved my life on many occasions. It’s a deadly disease. Eating disorders used to be number one for years now second highest mortality rate of any MENTAL ILLNESS following opioid abuse. \n\nShe is trying to cope and survive the best way she knows how right now and it happens to be a maladaptive coping mechanism. Social media can be very dangerous for minors nowadays days especially with the pro Ana content and normalized disorder eating content in general. I fear to have kids due to this. Misinformation on health and bodies is rampant and social media influencers are out here spreading false info like wildfire. A intuitive eating dietician that specializes in eating disorders and therapist that specializes in eating disorders is highly recommended",
          "created_utc": 1702935003.0
        }
      ]
    },
    {
      "id": "kdymneo",
      "author": "beamdog77",
      "body": "Thank you, that's my plan. I'm taking my husband so he can sit with her. I can't believe how utterly stressed I am about this appointment. I'm literally losing sleep over it.",
      "created_utc": 1702942002.0,
      "score": 2,
      "context": [
        {
          "id": "kdylm8p",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1702941586.0
        }
      ]
    },
    {
      "id": "kecc0hk",
      "author": "beamdog77",
      "body": "Will definitely do that",
      "created_utc": 1703176945.0,
      "score": 1,
      "context": [
        {
          "id": "kec9hl8",
          "author": "SpeakerKitchen236",
          "body": "I think it might be pertinent to also see what content she's consuming. I hear there's a lot of influencers promoting unhealthy beauty standards on their fans. Just be virtue of the fact that they're an adult partaking in modern beauty culture. Something a kid has no business being interested in. \n\nI think the adults we look up to often model what our outlook on life will be. :/",
          "created_utc": 1703176014.0
        }
      ]
    },
    {
      "id": "kdyw2en",
      "author": "manders556",
      "body": "How are you aware of her weight? Do you guys weigh her at doctors or home? Her seeing weight or the act of being weighed can be a bough to reinforce cognitive distortions. The scale alone was my biggest tool for keeping track of my weight and watching the number dropped fueled the disorder. I had to do blind weights at treatment but if possible can you have her do blind weights if she gets weighed at doctors? The scale is never a good thing and always fuels the obsession",
      "created_utc": 1702945865.0,
      "score": 2,
      "context": [
        {
          "id": "kdy0gts",
          "author": "autieswimming",
          "body": "Oh my god what a wonderful parent you are. \nI think a lot may have helped me - hearing body positive talk from my parents, or other adults/role models, learning about food in a way that talks about nutrition, but also is fun, having more positive food memories, and having an adult listen to me and ask questions about why I was counting calories or thinking about fat in foods as a little girl. In a way that took me seriously.\nI think it can be hard to go directly to the pediatrician. If they give you guidance, great... But there's a chance your daughter then feels like she did something wrong (as I did), which is a terrible feeling and can fuel an eating disorder.",
          "created_utc": 1702933697.0
        },
        {
          "id": "kdy5b4o",
          "author": "beamdog77",
          "body": "That's what I'm scared of. To be honest, I've been noticing these red flags for while and it's getting worse and she is loosing weight and rejecting new food regularly. We do not talk about bodies or weight, we are careful of never getting into a power struggle over meals, we don't force her to finish her food, we allow dessert and snacks, and she has full access to a pantry anytime she wants food. I even allow her to help me grocery shop so she can pick foods she likes. We have desperately tried to make it not be a \"thing.\" We let her pick restaurants when we go out to eat. I tried the \"this is what dinner is and you're not getting a different dinner but I will give you milk\" thing and last night I made her literally THREE different dinners. I placed them in front of her and just prayed she would eat. She wouldn't. Nicely I would ask, \"Do you want something else?\" And made her something else. No dice. That was after eating less than a serving of cereal for breakfast and less than a quarter sandwich for lunch. \n\nMy heart is just breaking and I want to help, but I'm afraid to directly address it with her because of her age, so I'm paralyzed. \n\nSo long story short, I noticed this awhile ago, and I have tried so much that I have learned from my own attempts to research but it's just getting worse and I feel like I need professional help at this point. I am crying as I type this because it's worse than I can describe and in my heart I feel so helpless because I know something is going on. I know the rules are we can't say BMI numbers but when I calculated her BMI today I was sick.",
          "created_utc": 1702935426.0
        }
      ]
    },
    {
      "id": "kdy82jd",
      "author": "autieswimming",
      "body": "I'm so so sorry, I'm a new mom myself and just now realizing how hard it must've been on my own mom to watch me go through an eating disorder. \n\nI don't have good answers, I just know that if someone... Maybe not my mom, to be honest, had asked me, it would have helped. Another parent maybe, or an older sibling, not in a confrontational way, or even a direct way, like through drawing or something. Eating disorders are so complex and layered there are probably a lot of reasons why she's behaving in this way.",
      "created_utc": 1702936419.0,
      "score": 1,
      "context": [
        {
          "id": "kdy0gts",
          "author": "autieswimming",
          "body": "Oh my god what a wonderful parent you are. \nI think a lot may have helped me - hearing body positive talk from my parents, or other adults/role models, learning about food in a way that talks about nutrition, but also is fun, having more positive food memories, and having an adult listen to me and ask questions about why I was counting calories or thinking about fat in foods as a little girl. In a way that took me seriously.\nI think it can be hard to go directly to the pediatrician. If they give you guidance, great... But there's a chance your daughter then feels like she did something wrong (as I did), which is a terrible feeling and can fuel an eating disorder.",
          "created_utc": 1702933697.0
        },
        {
          "id": "kdy5b4o",
          "author": "beamdog77",
          "body": "That's what I'm scared of. To be honest, I've been noticing these red flags for while and it's getting worse and she is loosing weight and rejecting new food regularly. We do not talk about bodies or weight, we are careful of never getting into a power struggle over meals, we don't force her to finish her food, we allow dessert and snacks, and she has full access to a pantry anytime she wants food. I even allow her to help me grocery shop so she can pick foods she likes. We have desperately tried to make it not be a \"thing.\" We let her pick restaurants when we go out to eat. I tried the \"this is what dinner is and you're not getting a different dinner but I will give you milk\" thing and last night I made her literally THREE different dinners. I placed them in front of her and just prayed she would eat. She wouldn't. Nicely I would ask, \"Do you want something else?\" And made her something else. No dice. That was after eating less than a serving of cereal for breakfast and less than a quarter sandwich for lunch. \n\nMy heart is just breaking and I want to help, but I'm afraid to directly address it with her because of her age, so I'm paralyzed. \n\nSo long story short, I noticed this awhile ago, and I have tried so much that I have learned from my own attempts to research but it's just getting worse and I feel like I need professional help at this point. I am crying as I type this because it's worse than I can describe and in my heart I feel so helpless because I know something is going on. I know the rules are we can't say BMI numbers but when I calculated her BMI today I was sick.",
          "created_utc": 1702935426.0
        }
      ]
    },
    {
      "id": "ke1khg6",
      "author": "Hamsssandwich",
      "body": "\n\nI’m so glad the encouragement was well received! Being a parent is hard. It’s hard enough without food & body dysmorphia issues. \n\nI know exactly what you mean though. I started struggling in fifth grade. My mom would just ignore it for the most part. At 20 years old, my mom could no longer deny that I had an issue, and called many places and found a wonderful hospital for me to go to. At that time she admitted to me, that she thought (when it first began at 12 years old) it was just a “phase” and that I would grow out of it. \n\nWhile it was hurtful to hear, I appreciated that she admitted it. I realized then, that she desperately didn’t want it to be real. I’m 25 now, I still struggle. \n\nI think, looking back, I would’ve appreciated somebody making it real for me. I struggled in secret, and feeling like I didn’t *really* have a problem, because if I did, somebody would have done something about it. I felt neglected, as if my problems didn’t matter like everyone else’s did. \n\nI promise you are doing the right thing. I promise. \n\nShe will be so grateful when she’s older. You are showing her great care. \n\nPlease note, in the meantime, she will most likely be angry or sad that you are doing this. You & your husband might ask yourselves “Are we doing this right?” “What if we’re doing this wrong?” “Are we hurting her?”\n\nI can assure you both though, you are doing this the right way. Treating her tenderly, like you are, will help. You are noticing the signs and taking action. That’s all you can do, mama. By making it real, you are taking control. It is no longer controlling you.",
      "created_utc": 1702998344.0,
      "score": 1,
      "context": [
        {
          "id": "ke1g7qr",
          "author": "Hamsssandwich",
          "body": "I agree with everything that everyone has said so I don’t have any advice, just a little encouragement!\n\nI commend you and your husband for being so kind to your daughter. This is hard on both ends. It’s hard for her, but it’s also very hard to watch your child suffer. The mom guilt is real, but you are handling this so beautifully and tenderly. Please do not get discouraged that a lot of us had eating disorders at a young age and they continued for years. \n\nAll of us DID NOT get the help we so desperately needed. You are doing things differently. You are doing the right thing. You are doing what our caregivers SHOULD have done. \n\nGreat job mama! I speak for everyone when I say, we are so SO proud of you! \n\nSending so much love to you, your husband, and your baby girl. I just sent a prayer to Jesus for you guys & I will continue doing so. \n\nYou’ve got this mama. You have it in the bag.",
          "created_utc": 1702996572.0
        },
        {
          "id": "ke1gn12",
          "author": "beamdog77",
          "body": "Thank you. I desperately needed the encouragement. Taking her to the doctor is terrifying because it makes it real.",
          "created_utc": 1702996753.0
        }
      ]
    },
    {
      "id": "kdycfpe",
      "author": "manders556",
      "body": "And if she has a small appetite that’s the natural outcome of restriction. After periods of restriction the stomach physically shrinks and the body stops sending hunger fullness cues as it stops trusting that you will respond to the cues it gives you since it’s used to you just ignoring the cues and engaging in restriction instead.",
      "created_utc": 1702938045.0,
      "score": 1,
      "context": [
        {
          "id": "kdy44rw",
          "author": "manders556",
          "body": "Yes it’s an eoedemic the age for early body dissatisfaction has gotten lower. Studies are showing children as young as 6 years old are now actively showing body dissatisfaction and body dysmorphia signs. I developed my ED at age 11. 25 f fully recovered now but wouldn’t consider myself truly recovered until this year. A decade of on and off recovery and treatment and many relapses recovery truly isn’t linear. First and foremost it’s not your fault, it’s a coping mechanism. How we talk about food and diet culture are known to fuel and exasperate the illness though. I know a lot of my ED behaviors truly were passed down learned behaviors from family due to diet-culture. I don’t know the house of dynamics with food and what you have taught your children in regards to food but I know food labeling and calling food junk is normalized but disordered and fueled my illness. Be careful how you talk about food and the messages you could be sending about food and bodies. Seek professional help. Don’t force or pressure to eat but rather encourage and promote eating opportunities for your daughter. The evidence based treatment for EDs right now is a team of trauma informed therapist and intuitive eating dietician. I didn’t get help till I was 15 and went to my first program as a minor. It’s a coping mechanism. It’s serving a purpose for her. For me it started around puberty which is already a difficult time and then culture shock and being bullied for my weight and mom that was diet culture obsessed and pediatrician that pointed out my BMI and told me to lose weight at age 11 all contributed to the development of my ED. I also found out I had ADHD and a lot of my ED struggles were also sensory issues related as well as cognitive distortions and coping mechanism. Truly a multifaceted issue. Mental health is complex. Early intervention is key. I’d recommend getting her help asap and talk to doctor for referrals for a good ED program if necessary. Treatment saved my life on many occasions. It’s a deadly disease. Eating disorders used to be number one for years now second highest mortality rate of any MENTAL ILLNESS following opioid abuse. \n\nShe is trying to cope and survive the best way she knows how right now and it happens to be a maladaptive coping mechanism. Social media can be very dangerous for minors nowadays days especially with the pro Ana content and normalized disorder eating content in general. I fear to have kids due to this. Misinformation on health and bodies is rampant and social media influencers are out here spreading false info like wildfire. A intuitive eating dietician that specializes in eating disorders and therapist that specializes in eating disorders is highly recommended",
          "created_utc": 1702935003.0
        },
        {
          "id": "kdya4ws",
          "author": "beamdog77",
          "body": "Thank you for taking the time to reply. Yes, I have been examining my every move. My husband and I are not overly thin, but have made some jokes in the past like \"oh man, this pizza is so good, probably has a million calories\" but have never talked about calories with relation to weight, and have never ever ever uttered a word to the kids about how many calories they are eating, and have never talked about their weight. We have never said anything about anyone else's weight. I'm so so careful of this, but not perfect.  \n\nI have thought of the control aspect of it, but honestly there is no trauma or concern in her life that I'm aware of. The only thing that I can kind of think of is we're military and we had to move to a foreign country when she was a bit younger and I think maybe there were feelings of lack of control of food when we moved there and the food was so drastically and completely different, and then we moved two more times, uprooting her home and her friends. Oh my heart. I don't know if it's related but it's the only real adversity she has faced. \n\nThank you for the advice,  I am definitely going forward with getting professional help or at least someone to give me advice on what I should do to help. \n\nMaybe this is nothing and she just has a small appetite, but I'm trying to be careful here and not trigger anyone with details... I know it's more than that.",
          "created_utc": 1702937182.0
        }
      ]
    },
    {
      "id": "kdybyze",
      "author": "manders556",
      "body": "Of course! I hope your daughter gets the early intervention and help she needs. eating disorders are not a joke. I know that when we moved from a small town in Missouri to NJ I experienced culture shock at age 11 which also contributed to the development of it. It’s very multifaceted and a coping mechanism. It can serve more than one purpose too, I know one of the purposes it serves for me was certainly control during times in my life where I got like I had none. It also doesn’t help that eating disorder mentality and behaviors are so normalized and disguised as health that it can be far too easy for sufferers to pretend to be okay or just “not hungry” or “picky eaters” and to be believed because restriction is already relatively normalized and even encouraged. She’s at an age where girls may start talking about bodies and even dieting during puberty and comparing bodies in gym class and what not. I remember in middle school being weighed and not really being aware of my body until that general age. That’s when girls start to compare and be aware of their bodies as well. I think conversations about puberty and how it’s normal for bodies to change can be helpful at this stage. Definitely seek professional intervention! You’re doing a great job at supporting your daughter just by being open to education on the disorder and seeking treatment for her! It’s hard to really know what’s going on until the truth comes out and therapy is confidential",
      "created_utc": 1702937874.0,
      "score": 1,
      "context": [
        {
          "id": "kdy44rw",
          "author": "manders556",
          "body": "Yes it’s an eoedemic the age for early body dissatisfaction has gotten lower. Studies are showing children as young as 6 years old are now actively showing body dissatisfaction and body dysmorphia signs. I developed my ED at age 11. 25 f fully recovered now but wouldn’t consider myself truly recovered until this year. A decade of on and off recovery and treatment and many relapses recovery truly isn’t linear. First and foremost it’s not your fault, it’s a coping mechanism. How we talk about food and diet culture are known to fuel and exasperate the illness though. I know a lot of my ED behaviors truly were passed down learned behaviors from family due to diet-culture. I don’t know the house of dynamics with food and what you have taught your children in regards to food but I know food labeling and calling food junk is normalized but disordered and fueled my illness. Be careful how you talk about food and the messages you could be sending about food and bodies. Seek professional help. Don’t force or pressure to eat but rather encourage and promote eating opportunities for your daughter. The evidence based treatment for EDs right now is a team of trauma informed therapist and intuitive eating dietician. I didn’t get help till I was 15 and went to my first program as a minor. It’s a coping mechanism. It’s serving a purpose for her. For me it started around puberty which is already a difficult time and then culture shock and being bullied for my weight and mom that was diet culture obsessed and pediatrician that pointed out my BMI and told me to lose weight at age 11 all contributed to the development of my ED. I also found out I had ADHD and a lot of my ED struggles were also sensory issues related as well as cognitive distortions and coping mechanism. Truly a multifaceted issue. Mental health is complex. Early intervention is key. I’d recommend getting her help asap and talk to doctor for referrals for a good ED program if necessary. Treatment saved my life on many occasions. It’s a deadly disease. Eating disorders used to be number one for years now second highest mortality rate of any MENTAL ILLNESS following opioid abuse. \n\nShe is trying to cope and survive the best way she knows how right now and it happens to be a maladaptive coping mechanism. Social media can be very dangerous for minors nowadays days especially with the pro Ana content and normalized disorder eating content in general. I fear to have kids due to this. Misinformation on health and bodies is rampant and social media influencers are out here spreading false info like wildfire. A intuitive eating dietician that specializes in eating disorders and therapist that specializes in eating disorders is highly recommended",
          "created_utc": 1702935003.0
        },
        {
          "id": "kdya4ws",
          "author": "beamdog77",
          "body": "Thank you for taking the time to reply. Yes, I have been examining my every move. My husband and I are not overly thin, but have made some jokes in the past like \"oh man, this pizza is so good, probably has a million calories\" but have never talked about calories with relation to weight, and have never ever ever uttered a word to the kids about how many calories they are eating, and have never talked about their weight. We have never said anything about anyone else's weight. I'm so so careful of this, but not perfect.  \n\nI have thought of the control aspect of it, but honestly there is no trauma or concern in her life that I'm aware of. The only thing that I can kind of think of is we're military and we had to move to a foreign country when she was a bit younger and I think maybe there were feelings of lack of control of food when we moved there and the food was so drastically and completely different, and then we moved two more times, uprooting her home and her friends. Oh my heart. I don't know if it's related but it's the only real adversity she has faced. \n\nThank you for the advice,  I am definitely going forward with getting professional help or at least someone to give me advice on what I should do to help. \n\nMaybe this is nothing and she just has a small appetite, but I'm trying to be careful here and not trigger anyone with details... I know it's more than that.",
          "created_utc": 1702937182.0
        }
      ]
    },
    {
      "id": "ke4vg8x",
      "author": "DepartmentLeast4721",
      "body": "At this age children are also highly influenced by their peers. My son just turned eight and has a friend who talks about calories and how bad they are. I’ve drilled into my son that calories are units of energy and the importance of vitamins and macronutrients to keep our “earth suits” healthy. I was proud when he told his friend that you need calories for energy and that that there are no bad foods. \nYour little one is so young and I feel your pain. The Instagram page “Kids Eat in Color” might offer some useful resources to you, but I would also seek out an ED Certified dietician. At her age, I would highly recommend the Maudsley approach, and avoid any treatment centers where she might be exposed to older children with eating disorders. As someone who entered eating disorder treatment inpatient in middle school, I can say, without a doubt, it only added fuel to the fire. \n   The fact that you care and are reaching out already speaks volumes about what a wonderful mother you are. My heart really hurts for you, and I hope you can get to the bottom of this soon. As a side note, when I was in treatment as an adolescent, there was a nine year old misdiagnosed with anorexia. It turned out she had developed an extreme phobia of germs and bacteria, after learning about food borne illnesses. She didn’t know how to articulate it or was scared to do so. Once that was figured out and addressed with exposure therapy, she quickly recovered. I’m really hoping it’s something similar with your daughter.",
      "created_utc": 1703044071.0,
      "score": 1,
      "context": [
        {
          "id": "kdy44rw",
          "author": "manders556",
          "body": "Yes it’s an eoedemic the age for early body dissatisfaction has gotten lower. Studies are showing children as young as 6 years old are now actively showing body dissatisfaction and body dysmorphia signs. I developed my ED at age 11. 25 f fully recovered now but wouldn’t consider myself truly recovered until this year. A decade of on and off recovery and treatment and many relapses recovery truly isn’t linear. First and foremost it’s not your fault, it’s a coping mechanism. How we talk about food and diet culture are known to fuel and exasperate the illness though. I know a lot of my ED behaviors truly were passed down learned behaviors from family due to diet-culture. I don’t know the house of dynamics with food and what you have taught your children in regards to food but I know food labeling and calling food junk is normalized but disordered and fueled my illness. Be careful how you talk about food and the messages you could be sending about food and bodies. Seek professional help. Don’t force or pressure to eat but rather encourage and promote eating opportunities for your daughter. The evidence based treatment for EDs right now is a team of trauma informed therapist and intuitive eating dietician. I didn’t get help till I was 15 and went to my first program as a minor. It’s a coping mechanism. It’s serving a purpose for her. For me it started around puberty which is already a difficult time and then culture shock and being bullied for my weight and mom that was diet culture obsessed and pediatrician that pointed out my BMI and told me to lose weight at age 11 all contributed to the development of my ED. I also found out I had ADHD and a lot of my ED struggles were also sensory issues related as well as cognitive distortions and coping mechanism. Truly a multifaceted issue. Mental health is complex. Early intervention is key. I’d recommend getting her help asap and talk to doctor for referrals for a good ED program if necessary. Treatment saved my life on many occasions. It’s a deadly disease. Eating disorders used to be number one for years now second highest mortality rate of any MENTAL ILLNESS following opioid abuse. \n\nShe is trying to cope and survive the best way she knows how right now and it happens to be a maladaptive coping mechanism. Social media can be very dangerous for minors nowadays days especially with the pro Ana content and normalized disorder eating content in general. I fear to have kids due to this. Misinformation on health and bodies is rampant and social media influencers are out here spreading false info like wildfire. A intuitive eating dietician that specializes in eating disorders and therapist that specializes in eating disorders is highly recommended",
          "created_utc": 1702935003.0
        },
        {
          "id": "kdya4ws",
          "author": "beamdog77",
          "body": "Thank you for taking the time to reply. Yes, I have been examining my every move. My husband and I are not overly thin, but have made some jokes in the past like \"oh man, this pizza is so good, probably has a million calories\" but have never talked about calories with relation to weight, and have never ever ever uttered a word to the kids about how many calories they are eating, and have never talked about their weight. We have never said anything about anyone else's weight. I'm so so careful of this, but not perfect.  \n\nI have thought of the control aspect of it, but honestly there is no trauma or concern in her life that I'm aware of. The only thing that I can kind of think of is we're military and we had to move to a foreign country when she was a bit younger and I think maybe there were feelings of lack of control of food when we moved there and the food was so drastically and completely different, and then we moved two more times, uprooting her home and her friends. Oh my heart. I don't know if it's related but it's the only real adversity she has faced. \n\nThank you for the advice,  I am definitely going forward with getting professional help or at least someone to give me advice on what I should do to help. \n\nMaybe this is nothing and she just has a small appetite, but I'm trying to be careful here and not trigger anyone with details... I know it's more than that.",
          "created_utc": 1702937182.0
        }
      ]
    },
    {
      "id": "kdyxvki",
      "author": "manders556",
      "body": "Also as hard as it may be I’d encourage you to try not to talk about how little she’s eaten or her body even comments out of concern can be twisted into something else. For example, hearing comments on my appearance even out of concern form mom mom saying that I look so skinny or emaciated or like a concentration camp victim or like a skeleton reinforced the disorder and I interpreted that as yayyy they can tell I lost weight! Because all that matters when I was in that state of mind is the obsession and coping mechanism. It made me feel like I was making “progress” or achieving and accomplishing goals. It also gave me a false sense of control. Commenting on food and bodies is just a no go zone honestly. Encourage eating experiences and keep being a supportive mama and providing eating opportunities and encouraging her! Distract during mealtimes with convo that’s not food related and just generally try not to comment on food and body as she may be particularly sensitive and perception could be warped.",
      "created_utc": 1702946621.0,
      "score": 2,
      "context": [
        {
          "id": "kdy0gts",
          "author": "autieswimming",
          "body": "Oh my god what a wonderful parent you are. \nI think a lot may have helped me - hearing body positive talk from my parents, or other adults/role models, learning about food in a way that talks about nutrition, but also is fun, having more positive food memories, and having an adult listen to me and ask questions about why I was counting calories or thinking about fat in foods as a little girl. In a way that took me seriously.\nI think it can be hard to go directly to the pediatrician. If they give you guidance, great... But there's a chance your daughter then feels like she did something wrong (as I did), which is a terrible feeling and can fuel an eating disorder.",
          "created_utc": 1702933697.0
        },
        {
          "id": "kdy5b4o",
          "author": "beamdog77",
          "body": "That's what I'm scared of. To be honest, I've been noticing these red flags for while and it's getting worse and she is loosing weight and rejecting new food regularly. We do not talk about bodies or weight, we are careful of never getting into a power struggle over meals, we don't force her to finish her food, we allow dessert and snacks, and she has full access to a pantry anytime she wants food. I even allow her to help me grocery shop so she can pick foods she likes. We have desperately tried to make it not be a \"thing.\" We let her pick restaurants when we go out to eat. I tried the \"this is what dinner is and you're not getting a different dinner but I will give you milk\" thing and last night I made her literally THREE different dinners. I placed them in front of her and just prayed she would eat. She wouldn't. Nicely I would ask, \"Do you want something else?\" And made her something else. No dice. That was after eating less than a serving of cereal for breakfast and less than a quarter sandwich for lunch. \n\nMy heart is just breaking and I want to help, but I'm afraid to directly address it with her because of her age, so I'm paralyzed. \n\nSo long story short, I noticed this awhile ago, and I have tried so much that I have learned from my own attempts to research but it's just getting worse and I feel like I need professional help at this point. I am crying as I type this because it's worse than I can describe and in my heart I feel so helpless because I know something is going on. I know the rules are we can't say BMI numbers but when I calculated her BMI today I was sick.",
          "created_utc": 1702935426.0
        },
        {
          "id": "kdyw2en",
          "author": "manders556",
          "body": "How are you aware of her weight? Do you guys weigh her at doctors or home? Her seeing weight or the act of being weighed can be a bough to reinforce cognitive distortions. The scale alone was my biggest tool for keeping track of my weight and watching the number dropped fueled the disorder. I had to do blind weights at treatment but if possible can you have her do blind weights if she gets weighed at doctors? The scale is never a good thing and always fuels the obsession",
          "created_utc": 1702945865.0
        }
      ]
    },
    {
      "id": "kdyzpnr",
      "author": "beamdog77",
      "body": "To put it bluntly, I have eyes. I don't want to describe it in detail here, but let's just say that the way she looks is visually shocking and she could pose for pro-ana propaganda. And she is still wearing clothing that she should have grown out of, but instead it is becoming too big. She has shorts from last spring that she put on yesterday (we live where it's still warm) and they wouldn't stay up. \n\nWe haven't weighed her in forever. We did it today under the guise of needing to know her height and weight for a size chart in an outfit she wanted for Christmas. But I was curious if her BMI because I didn't want to get blown off by the doctor. Needless to say, it seems she meets the clinical criteria cut off for the doctor to take me seriously. \n\nI have no idea what her last weight was, so I can't say how much she has lost, but based on her clothing, it's a good amount for her height. \n\nBut, I'm not sure she understands lbs anyway. She's not interested or concerned with the scale, more how she looks in the mirror and wants to be thin. \n\n But it's still a good tip because I will be careful not to focus on the scale as we move forward.",
      "created_utc": 1702947382.0,
      "score": 2,
      "context": [
        {
          "id": "kdy0gts",
          "author": "autieswimming",
          "body": "Oh my god what a wonderful parent you are. \nI think a lot may have helped me - hearing body positive talk from my parents, or other adults/role models, learning about food in a way that talks about nutrition, but also is fun, having more positive food memories, and having an adult listen to me and ask questions about why I was counting calories or thinking about fat in foods as a little girl. In a way that took me seriously.\nI think it can be hard to go directly to the pediatrician. If they give you guidance, great... But there's a chance your daughter then feels like she did something wrong (as I did), which is a terrible feeling and can fuel an eating disorder.",
          "created_utc": 1702933697.0
        },
        {
          "id": "kdy5b4o",
          "author": "beamdog77",
          "body": "That's what I'm scared of. To be honest, I've been noticing these red flags for while and it's getting worse and she is loosing weight and rejecting new food regularly. We do not talk about bodies or weight, we are careful of never getting into a power struggle over meals, we don't force her to finish her food, we allow dessert and snacks, and she has full access to a pantry anytime she wants food. I even allow her to help me grocery shop so she can pick foods she likes. We have desperately tried to make it not be a \"thing.\" We let her pick restaurants when we go out to eat. I tried the \"this is what dinner is and you're not getting a different dinner but I will give you milk\" thing and last night I made her literally THREE different dinners. I placed them in front of her and just prayed she would eat. She wouldn't. Nicely I would ask, \"Do you want something else?\" And made her something else. No dice. That was after eating less than a serving of cereal for breakfast and less than a quarter sandwich for lunch. \n\nMy heart is just breaking and I want to help, but I'm afraid to directly address it with her because of her age, so I'm paralyzed. \n\nSo long story short, I noticed this awhile ago, and I have tried so much that I have learned from my own attempts to research but it's just getting worse and I feel like I need professional help at this point. I am crying as I type this because it's worse than I can describe and in my heart I feel so helpless because I know something is going on. I know the rules are we can't say BMI numbers but when I calculated her BMI today I was sick.",
          "created_utc": 1702935426.0
        },
        {
          "id": "kdyw2en",
          "author": "manders556",
          "body": "How are you aware of her weight? Do you guys weigh her at doctors or home? Her seeing weight or the act of being weighed can be a bough to reinforce cognitive distortions. The scale alone was my biggest tool for keeping track of my weight and watching the number dropped fueled the disorder. I had to do blind weights at treatment but if possible can you have her do blind weights if she gets weighed at doctors? The scale is never a good thing and always fuels the obsession",
          "created_utc": 1702945865.0
        }
      ]
    },
    {
      "id": "kdyafwk",
      "author": "beamdog77",
      "body": "I agree, if she was older. I'm too terrified to ask her anything directly in case I'm wrong and there is nothing there and I plant this idea or make her think there is something wrong with her eating or her weight.",
      "created_utc": 1702937295.0,
      "score": 1,
      "context": [
        {
          "id": "kdy0gts",
          "author": "autieswimming",
          "body": "Oh my god what a wonderful parent you are. \nI think a lot may have helped me - hearing body positive talk from my parents, or other adults/role models, learning about food in a way that talks about nutrition, but also is fun, having more positive food memories, and having an adult listen to me and ask questions about why I was counting calories or thinking about fat in foods as a little girl. In a way that took me seriously.\nI think it can be hard to go directly to the pediatrician. If they give you guidance, great... But there's a chance your daughter then feels like she did something wrong (as I did), which is a terrible feeling and can fuel an eating disorder.",
          "created_utc": 1702933697.0
        },
        {
          "id": "kdy5b4o",
          "author": "beamdog77",
          "body": "That's what I'm scared of. To be honest, I've been noticing these red flags for while and it's getting worse and she is loosing weight and rejecting new food regularly. We do not talk about bodies or weight, we are careful of never getting into a power struggle over meals, we don't force her to finish her food, we allow dessert and snacks, and she has full access to a pantry anytime she wants food. I even allow her to help me grocery shop so she can pick foods she likes. We have desperately tried to make it not be a \"thing.\" We let her pick restaurants when we go out to eat. I tried the \"this is what dinner is and you're not getting a different dinner but I will give you milk\" thing and last night I made her literally THREE different dinners. I placed them in front of her and just prayed she would eat. She wouldn't. Nicely I would ask, \"Do you want something else?\" And made her something else. No dice. That was after eating less than a serving of cereal for breakfast and less than a quarter sandwich for lunch. \n\nMy heart is just breaking and I want to help, but I'm afraid to directly address it with her because of her age, so I'm paralyzed. \n\nSo long story short, I noticed this awhile ago, and I have tried so much that I have learned from my own attempts to research but it's just getting worse and I feel like I need professional help at this point. I am crying as I type this because it's worse than I can describe and in my heart I feel so helpless because I know something is going on. I know the rules are we can't say BMI numbers but when I calculated her BMI today I was sick.",
          "created_utc": 1702935426.0
        },
        {
          "id": "kdy82jd",
          "author": "autieswimming",
          "body": "I'm so so sorry, I'm a new mom myself and just now realizing how hard it must've been on my own mom to watch me go through an eating disorder. \n\nI don't have good answers, I just know that if someone... Maybe not my mom, to be honest, had asked me, it would have helped. Another parent maybe, or an older sibling, not in a confrontational way, or even a direct way, like through drawing or something. Eating disorders are so complex and layered there are probably a lot of reasons why she's behaving in this way.",
          "created_utc": 1702936419.0
        }
      ]
    },
    {
      "id": "ke1ouh1",
      "author": "beamdog77",
      "body": "I can't even tell you how much your words mean to me. I think half the reason I made this post was was so I wouldn't chicken out and so I could practice \"saying it out loud.\"\n\nLast night I put about 8 foods she likes on her plate, and she ate none of them. I followed it with chocolate milk, once irresistible to her, and she declined it all. Moving the food around on her plate, taking the milk with her around the house but never drinking it. 💔",
      "created_utc": 1703000044.0,
      "score": 1,
      "context": [
        {
          "id": "ke1g7qr",
          "author": "Hamsssandwich",
          "body": "I agree with everything that everyone has said so I don’t have any advice, just a little encouragement!\n\nI commend you and your husband for being so kind to your daughter. This is hard on both ends. It’s hard for her, but it’s also very hard to watch your child suffer. The mom guilt is real, but you are handling this so beautifully and tenderly. Please do not get discouraged that a lot of us had eating disorders at a young age and they continued for years. \n\nAll of us DID NOT get the help we so desperately needed. You are doing things differently. You are doing the right thing. You are doing what our caregivers SHOULD have done. \n\nGreat job mama! I speak for everyone when I say, we are so SO proud of you! \n\nSending so much love to you, your husband, and your baby girl. I just sent a prayer to Jesus for you guys & I will continue doing so. \n\nYou’ve got this mama. You have it in the bag.",
          "created_utc": 1702996572.0
        },
        {
          "id": "ke1gn12",
          "author": "beamdog77",
          "body": "Thank you. I desperately needed the encouragement. Taking her to the doctor is terrifying because it makes it real.",
          "created_utc": 1702996753.0
        },
        {
          "id": "ke1khg6",
          "author": "Hamsssandwich",
          "body": "\n\nI’m so glad the encouragement was well received! Being a parent is hard. It’s hard enough without food & body dysmorphia issues. \n\nI know exactly what you mean though. I started struggling in fifth grade. My mom would just ignore it for the most part. At 20 years old, my mom could no longer deny that I had an issue, and called many places and found a wonderful hospital for me to go to. At that time she admitted to me, that she thought (when it first began at 12 years old) it was just a “phase” and that I would grow out of it. \n\nWhile it was hurtful to hear, I appreciated that she admitted it. I realized then, that she desperately didn’t want it to be real. I’m 25 now, I still struggle. \n\nI think, looking back, I would’ve appreciated somebody making it real for me. I struggled in secret, and feeling like I didn’t *really* have a problem, because if I did, somebody would have done something about it. I felt neglected, as if my problems didn’t matter like everyone else’s did. \n\nI promise you are doing the right thing. I promise. \n\nShe will be so grateful when she’s older. You are showing her great care. \n\nPlease note, in the meantime, she will most likely be angry or sad that you are doing this. You & your husband might ask yourselves “Are we doing this right?” “What if we’re doing this wrong?” “Are we hurting her?”\n\nI can assure you both though, you are doing this the right way. Treating her tenderly, like you are, will help. You are noticing the signs and taking action. That’s all you can do, mama. By making it real, you are taking control. It is no longer controlling you.",
          "created_utc": 1702998344.0
        }
      ]
    },
    {
      "id": "kdydnrf",
      "author": "beamdog77",
      "body": "That's what I'm praying, but it's moved to her not even eating her favorite things, like leaving ice cream in her bowl. :-(",
      "created_utc": 1702938502.0,
      "score": 1,
      "context": [
        {
          "id": "kdy44rw",
          "author": "manders556",
          "body": "Yes it’s an eoedemic the age for early body dissatisfaction has gotten lower. Studies are showing children as young as 6 years old are now actively showing body dissatisfaction and body dysmorphia signs. I developed my ED at age 11. 25 f fully recovered now but wouldn’t consider myself truly recovered until this year. A decade of on and off recovery and treatment and many relapses recovery truly isn’t linear. First and foremost it’s not your fault, it’s a coping mechanism. How we talk about food and diet culture are known to fuel and exasperate the illness though. I know a lot of my ED behaviors truly were passed down learned behaviors from family due to diet-culture. I don’t know the house of dynamics with food and what you have taught your children in regards to food but I know food labeling and calling food junk is normalized but disordered and fueled my illness. Be careful how you talk about food and the messages you could be sending about food and bodies. Seek professional help. Don’t force or pressure to eat but rather encourage and promote eating opportunities for your daughter. The evidence based treatment for EDs right now is a team of trauma informed therapist and intuitive eating dietician. I didn’t get help till I was 15 and went to my first program as a minor. It’s a coping mechanism. It’s serving a purpose for her. For me it started around puberty which is already a difficult time and then culture shock and being bullied for my weight and mom that was diet culture obsessed and pediatrician that pointed out my BMI and told me to lose weight at age 11 all contributed to the development of my ED. I also found out I had ADHD and a lot of my ED struggles were also sensory issues related as well as cognitive distortions and coping mechanism. Truly a multifaceted issue. Mental health is complex. Early intervention is key. I’d recommend getting her help asap and talk to doctor for referrals for a good ED program if necessary. Treatment saved my life on many occasions. It’s a deadly disease. Eating disorders used to be number one for years now second highest mortality rate of any MENTAL ILLNESS following opioid abuse. \n\nShe is trying to cope and survive the best way she knows how right now and it happens to be a maladaptive coping mechanism. Social media can be very dangerous for minors nowadays days especially with the pro Ana content and normalized disorder eating content in general. I fear to have kids due to this. Misinformation on health and bodies is rampant and social media influencers are out here spreading false info like wildfire. A intuitive eating dietician that specializes in eating disorders and therapist that specializes in eating disorders is highly recommended",
          "created_utc": 1702935003.0
        },
        {
          "id": "kdya4ws",
          "author": "beamdog77",
          "body": "Thank you for taking the time to reply. Yes, I have been examining my every move. My husband and I are not overly thin, but have made some jokes in the past like \"oh man, this pizza is so good, probably has a million calories\" but have never talked about calories with relation to weight, and have never ever ever uttered a word to the kids about how many calories they are eating, and have never talked about their weight. We have never said anything about anyone else's weight. I'm so so careful of this, but not perfect.  \n\nI have thought of the control aspect of it, but honestly there is no trauma or concern in her life that I'm aware of. The only thing that I can kind of think of is we're military and we had to move to a foreign country when she was a bit younger and I think maybe there were feelings of lack of control of food when we moved there and the food was so drastically and completely different, and then we moved two more times, uprooting her home and her friends. Oh my heart. I don't know if it's related but it's the only real adversity she has faced. \n\nThank you for the advice,  I am definitely going forward with getting professional help or at least someone to give me advice on what I should do to help. \n\nMaybe this is nothing and she just has a small appetite, but I'm trying to be careful here and not trigger anyone with details... I know it's more than that.",
          "created_utc": 1702937182.0
        },
        {
          "id": "kdycfpe",
          "author": "manders556",
          "body": "And if she has a small appetite that’s the natural outcome of restriction. After periods of restriction the stomach physically shrinks and the body stops sending hunger fullness cues as it stops trusting that you will respond to the cues it gives you since it’s used to you just ignoring the cues and engaging in restriction instead.",
          "created_utc": 1702938045.0
        }
      ]
    },
    {
      "id": "kdz28y6",
      "author": "beamdog77",
      "body": "Thanks for this advice. We have never commented on her body. In fact, I make a conscious effort to never comment on her appearance. I let her wear mismatched clothing and be overdressed or underdressed, because I don't even want her to feel pressured about her outfits. I am certain I have never talked about her weight, but have said things like, \"you should eat more protein to have the energy to play\" but never in relation to weight. Never.",
      "created_utc": 1702948422.0,
      "score": 3,
      "context": [
        {
          "id": "kdy0gts",
          "author": "autieswimming",
          "body": "Oh my god what a wonderful parent you are. \nI think a lot may have helped me - hearing body positive talk from my parents, or other adults/role models, learning about food in a way that talks about nutrition, but also is fun, having more positive food memories, and having an adult listen to me and ask questions about why I was counting calories or thinking about fat in foods as a little girl. In a way that took me seriously.\nI think it can be hard to go directly to the pediatrician. If they give you guidance, great... But there's a chance your daughter then feels like she did something wrong (as I did), which is a terrible feeling and can fuel an eating disorder.",
          "created_utc": 1702933697.0
        },
        {
          "id": "kdy5b4o",
          "author": "beamdog77",
          "body": "That's what I'm scared of. To be honest, I've been noticing these red flags for while and it's getting worse and she is loosing weight and rejecting new food regularly. We do not talk about bodies or weight, we are careful of never getting into a power struggle over meals, we don't force her to finish her food, we allow dessert and snacks, and she has full access to a pantry anytime she wants food. I even allow her to help me grocery shop so she can pick foods she likes. We have desperately tried to make it not be a \"thing.\" We let her pick restaurants when we go out to eat. I tried the \"this is what dinner is and you're not getting a different dinner but I will give you milk\" thing and last night I made her literally THREE different dinners. I placed them in front of her and just prayed she would eat. She wouldn't. Nicely I would ask, \"Do you want something else?\" And made her something else. No dice. That was after eating less than a serving of cereal for breakfast and less than a quarter sandwich for lunch. \n\nMy heart is just breaking and I want to help, but I'm afraid to directly address it with her because of her age, so I'm paralyzed. \n\nSo long story short, I noticed this awhile ago, and I have tried so much that I have learned from my own attempts to research but it's just getting worse and I feel like I need professional help at this point. I am crying as I type this because it's worse than I can describe and in my heart I feel so helpless because I know something is going on. I know the rules are we can't say BMI numbers but when I calculated her BMI today I was sick.",
          "created_utc": 1702935426.0
        },
        {
          "id": "kdyw2en",
          "author": "manders556",
          "body": "How are you aware of her weight? Do you guys weigh her at doctors or home? Her seeing weight or the act of being weighed can be a bough to reinforce cognitive distortions. The scale alone was my biggest tool for keeping track of my weight and watching the number dropped fueled the disorder. I had to do blind weights at treatment but if possible can you have her do blind weights if she gets weighed at doctors? The scale is never a good thing and always fuels the obsession",
          "created_utc": 1702945865.0
        },
        {
          "id": "kdyxvki",
          "author": "manders556",
          "body": "Also as hard as it may be I’d encourage you to try not to talk about how little she’s eaten or her body even comments out of concern can be twisted into something else. For example, hearing comments on my appearance even out of concern form mom mom saying that I look so skinny or emaciated or like a concentration camp victim or like a skeleton reinforced the disorder and I interpreted that as yayyy they can tell I lost weight! Because all that matters when I was in that state of mind is the obsession and coping mechanism. It made me feel like I was making “progress” or achieving and accomplishing goals. It also gave me a false sense of control. Commenting on food and bodies is just a no go zone honestly. Encourage eating experiences and keep being a supportive mama and providing eating opportunities and encouraging her! Distract during mealtimes with convo that’s not food related and just generally try not to comment on food and body as she may be particularly sensitive and perception could be warped.",
          "created_utc": 1702946621.0
        }
      ]
    },
    {
      "id": "ke109li",
      "author": "manders556",
      "body": "And isn’t it sad that our healthcare is so messed up that we are told by doctors we have to get WORSE in order to be valid enough for treatment? It’s god awful. It shouldn’t have to get to rock bottom before sufferers can be taken seriously. The stigma surrounding EDs in terms of being taken seriously only when they meet the stereotypical idea of what an ED looks like is disheartening but nothing I’m not familiar with and haven’t experienced myself. Good luck, find a provider and doctor that you shouldn’t have to prove to that your daughter is “sick enough” for treatment. The behaviors and weight alone are surely enough to get her a diagnosis at this stage though. Best of luck I hope your daughter gets the help she needs and surely will with a mother like you!",
      "created_utc": 1702988778.0,
      "score": 1,
      "context": [
        {
          "id": "kdy0gts",
          "author": "autieswimming",
          "body": "Oh my god what a wonderful parent you are. \nI think a lot may have helped me - hearing body positive talk from my parents, or other adults/role models, learning about food in a way that talks about nutrition, but also is fun, having more positive food memories, and having an adult listen to me and ask questions about why I was counting calories or thinking about fat in foods as a little girl. In a way that took me seriously.\nI think it can be hard to go directly to the pediatrician. If they give you guidance, great... But there's a chance your daughter then feels like she did something wrong (as I did), which is a terrible feeling and can fuel an eating disorder.",
          "created_utc": 1702933697.0
        },
        {
          "id": "kdy5b4o",
          "author": "beamdog77",
          "body": "That's what I'm scared of. To be honest, I've been noticing these red flags for while and it's getting worse and she is loosing weight and rejecting new food regularly. We do not talk about bodies or weight, we are careful of never getting into a power struggle over meals, we don't force her to finish her food, we allow dessert and snacks, and she has full access to a pantry anytime she wants food. I even allow her to help me grocery shop so she can pick foods she likes. We have desperately tried to make it not be a \"thing.\" We let her pick restaurants when we go out to eat. I tried the \"this is what dinner is and you're not getting a different dinner but I will give you milk\" thing and last night I made her literally THREE different dinners. I placed them in front of her and just prayed she would eat. She wouldn't. Nicely I would ask, \"Do you want something else?\" And made her something else. No dice. That was after eating less than a serving of cereal for breakfast and less than a quarter sandwich for lunch. \n\nMy heart is just breaking and I want to help, but I'm afraid to directly address it with her because of her age, so I'm paralyzed. \n\nSo long story short, I noticed this awhile ago, and I have tried so much that I have learned from my own attempts to research but it's just getting worse and I feel like I need professional help at this point. I am crying as I type this because it's worse than I can describe and in my heart I feel so helpless because I know something is going on. I know the rules are we can't say BMI numbers but when I calculated her BMI today I was sick.",
          "created_utc": 1702935426.0
        },
        {
          "id": "kdyw2en",
          "author": "manders556",
          "body": "How are you aware of her weight? Do you guys weigh her at doctors or home? Her seeing weight or the act of being weighed can be a bough to reinforce cognitive distortions. The scale alone was my biggest tool for keeping track of my weight and watching the number dropped fueled the disorder. I had to do blind weights at treatment but if possible can you have her do blind weights if she gets weighed at doctors? The scale is never a good thing and always fuels the obsession",
          "created_utc": 1702945865.0
        },
        {
          "id": "kdyzpnr",
          "author": "beamdog77",
          "body": "To put it bluntly, I have eyes. I don't want to describe it in detail here, but let's just say that the way she looks is visually shocking and she could pose for pro-ana propaganda. And she is still wearing clothing that she should have grown out of, but instead it is becoming too big. She has shorts from last spring that she put on yesterday (we live where it's still warm) and they wouldn't stay up. \n\nWe haven't weighed her in forever. We did it today under the guise of needing to know her height and weight for a size chart in an outfit she wanted for Christmas. But I was curious if her BMI because I didn't want to get blown off by the doctor. Needless to say, it seems she meets the clinical criteria cut off for the doctor to take me seriously. \n\nI have no idea what her last weight was, so I can't say how much she has lost, but based on her clothing, it's a good amount for her height. \n\nBut, I'm not sure she understands lbs anyway. She's not interested or concerned with the scale, more how she looks in the mirror and wants to be thin. \n\n But it's still a good tip because I will be careful not to focus on the scale as we move forward.",
          "created_utc": 1702947382.0
        }
      ]
    },
    {
      "id": "ke1wx8h",
      "author": "Hamsssandwich",
      "body": "The only way I have been able to respond to you this way is because of Jesus. Honest. I prayed and these words are his. My heart breaks for you, mama. I am just so proud of you though. To “say it out loud” takes so much courage and bravery. You haven’t done anything wrong to cause this. \n\n**You. haven’t. done. anything. wrong.**\n\nThis is your first time at life too. \n\nOur lives are complicated by nature. It was always meant to be that way. We will never be satisfied by things we think will satisfy us. \n\nI’ve had many traumas throughout my life. Some were harder and others easier, but all have led to the same thing: Death.\n\nNot physical death. Mental. \n\nI’ve been fighting to live my whole life. Sometimes it just feels like a prison. The *only* reason I’m even here today is because of Jesus. When my soul wails, God hears me. \n\nI know your soul has been wailing for a long time. You’ve had trauma, you’ve had anxiety. You’ve dealt with tough things. You’ve dealt with other peoples selfishness. I’m so sorry. Nobody should have done the things they did, to you. \n\nI know that this issue in particular is probably one of the harder things you’ve been through, & I just wanted to let you know that God hears you. He’s heard your wails mama. He’s heard your sobs. I promise he’s heard you. \n\nYour baby is going to be okay. I promise.\n\nI love you. \n\nFrom one stranger to another, I love you so much. \n\nYour baby girl is going to be just fine.",
      "created_utc": 1703003079.0,
      "score": 2,
      "context": [
        {
          "id": "ke1g7qr",
          "author": "Hamsssandwich",
          "body": "I agree with everything that everyone has said so I don’t have any advice, just a little encouragement!\n\nI commend you and your husband for being so kind to your daughter. This is hard on both ends. It’s hard for her, but it’s also very hard to watch your child suffer. The mom guilt is real, but you are handling this so beautifully and tenderly. Please do not get discouraged that a lot of us had eating disorders at a young age and they continued for years. \n\nAll of us DID NOT get the help we so desperately needed. You are doing things differently. You are doing the right thing. You are doing what our caregivers SHOULD have done. \n\nGreat job mama! I speak for everyone when I say, we are so SO proud of you! \n\nSending so much love to you, your husband, and your baby girl. I just sent a prayer to Jesus for you guys & I will continue doing so. \n\nYou’ve got this mama. You have it in the bag.",
          "created_utc": 1702996572.0
        },
        {
          "id": "ke1gn12",
          "author": "beamdog77",
          "body": "Thank you. I desperately needed the encouragement. Taking her to the doctor is terrifying because it makes it real.",
          "created_utc": 1702996753.0
        },
        {
          "id": "ke1khg6",
          "author": "Hamsssandwich",
          "body": "\n\nI’m so glad the encouragement was well received! Being a parent is hard. It’s hard enough without food & body dysmorphia issues. \n\nI know exactly what you mean though. I started struggling in fifth grade. My mom would just ignore it for the most part. At 20 years old, my mom could no longer deny that I had an issue, and called many places and found a wonderful hospital for me to go to. At that time she admitted to me, that she thought (when it first began at 12 years old) it was just a “phase” and that I would grow out of it. \n\nWhile it was hurtful to hear, I appreciated that she admitted it. I realized then, that she desperately didn’t want it to be real. I’m 25 now, I still struggle. \n\nI think, looking back, I would’ve appreciated somebody making it real for me. I struggled in secret, and feeling like I didn’t *really* have a problem, because if I did, somebody would have done something about it. I felt neglected, as if my problems didn’t matter like everyone else’s did. \n\nI promise you are doing the right thing. I promise. \n\nShe will be so grateful when she’s older. You are showing her great care. \n\nPlease note, in the meantime, she will most likely be angry or sad that you are doing this. You & your husband might ask yourselves “Are we doing this right?” “What if we’re doing this wrong?” “Are we hurting her?”\n\nI can assure you both though, you are doing this the right way. Treating her tenderly, like you are, will help. You are noticing the signs and taking action. That’s all you can do, mama. By making it real, you are taking control. It is no longer controlling you.",
          "created_utc": 1702998344.0
        },
        {
          "id": "ke1ouh1",
          "author": "beamdog77",
          "body": "I can't even tell you how much your words mean to me. I think half the reason I made this post was was so I wouldn't chicken out and so I could practice \"saying it out loud.\"\n\nLast night I put about 8 foods she likes on her plate, and she ate none of them. I followed it with chocolate milk, once irresistible to her, and she declined it all. Moving the food around on her plate, taking the milk with her around the house but never drinking it. 💔",
          "created_utc": 1703000044.0
        }
      ]
    },
    {
      "id": "kdygewf",
      "author": "manders556",
      "body": "You’re a wonderful mother for getting her help. Hopefully a professional can evaluate her and figure out her barriers to eating and if she’s experiencing cognitive distortions surrounding food such as food labeling and attaching moral value to food. Best of luck! Some good resources Ed websites with resources—\n\nNEDA, ANAD, alliance for eating disorders\n\nMonte Nido and center for discovery have great programs for adolescents and are top ED programs right now but any program is better than none",
      "created_utc": 1702939544.0,
      "score": 2,
      "context": [
        {
          "id": "kdy44rw",
          "author": "manders556",
          "body": "Yes it’s an eoedemic the age for early body dissatisfaction has gotten lower. Studies are showing children as young as 6 years old are now actively showing body dissatisfaction and body dysmorphia signs. I developed my ED at age 11. 25 f fully recovered now but wouldn’t consider myself truly recovered until this year. A decade of on and off recovery and treatment and many relapses recovery truly isn’t linear. First and foremost it’s not your fault, it’s a coping mechanism. How we talk about food and diet culture are known to fuel and exasperate the illness though. I know a lot of my ED behaviors truly were passed down learned behaviors from family due to diet-culture. I don’t know the house of dynamics with food and what you have taught your children in regards to food but I know food labeling and calling food junk is normalized but disordered and fueled my illness. Be careful how you talk about food and the messages you could be sending about food and bodies. Seek professional help. Don’t force or pressure to eat but rather encourage and promote eating opportunities for your daughter. The evidence based treatment for EDs right now is a team of trauma informed therapist and intuitive eating dietician. I didn’t get help till I was 15 and went to my first program as a minor. It’s a coping mechanism. It’s serving a purpose for her. For me it started around puberty which is already a difficult time and then culture shock and being bullied for my weight and mom that was diet culture obsessed and pediatrician that pointed out my BMI and told me to lose weight at age 11 all contributed to the development of my ED. I also found out I had ADHD and a lot of my ED struggles were also sensory issues related as well as cognitive distortions and coping mechanism. Truly a multifaceted issue. Mental health is complex. Early intervention is key. I’d recommend getting her help asap and talk to doctor for referrals for a good ED program if necessary. Treatment saved my life on many occasions. It’s a deadly disease. Eating disorders used to be number one for years now second highest mortality rate of any MENTAL ILLNESS following opioid abuse. \n\nShe is trying to cope and survive the best way she knows how right now and it happens to be a maladaptive coping mechanism. Social media can be very dangerous for minors nowadays days especially with the pro Ana content and normalized disorder eating content in general. I fear to have kids due to this. Misinformation on health and bodies is rampant and social media influencers are out here spreading false info like wildfire. A intuitive eating dietician that specializes in eating disorders and therapist that specializes in eating disorders is highly recommended",
          "created_utc": 1702935003.0
        },
        {
          "id": "kdya4ws",
          "author": "beamdog77",
          "body": "Thank you for taking the time to reply. Yes, I have been examining my every move. My husband and I are not overly thin, but have made some jokes in the past like \"oh man, this pizza is so good, probably has a million calories\" but have never talked about calories with relation to weight, and have never ever ever uttered a word to the kids about how many calories they are eating, and have never talked about their weight. We have never said anything about anyone else's weight. I'm so so careful of this, but not perfect.  \n\nI have thought of the control aspect of it, but honestly there is no trauma or concern in her life that I'm aware of. The only thing that I can kind of think of is we're military and we had to move to a foreign country when she was a bit younger and I think maybe there were feelings of lack of control of food when we moved there and the food was so drastically and completely different, and then we moved two more times, uprooting her home and her friends. Oh my heart. I don't know if it's related but it's the only real adversity she has faced. \n\nThank you for the advice,  I am definitely going forward with getting professional help or at least someone to give me advice on what I should do to help. \n\nMaybe this is nothing and she just has a small appetite, but I'm trying to be careful here and not trigger anyone with details... I know it's more than that.",
          "created_utc": 1702937182.0
        },
        {
          "id": "kdycfpe",
          "author": "manders556",
          "body": "And if she has a small appetite that’s the natural outcome of restriction. After periods of restriction the stomach physically shrinks and the body stops sending hunger fullness cues as it stops trusting that you will respond to the cues it gives you since it’s used to you just ignoring the cues and engaging in restriction instead.",
          "created_utc": 1702938045.0
        },
        {
          "id": "kdydnrf",
          "author": "beamdog77",
          "body": "That's what I'm praying, but it's moved to her not even eating her favorite things, like leaving ice cream in her bowl. :-(",
          "created_utc": 1702938502.0
        }
      ]
    },
    {
      "id": "ke233v2",
      "author": "beamdog77",
      "body": "Thank you so much. I will pray for you as well.",
      "created_utc": 1703005338.0,
      "score": 1,
      "context": [
        {
          "id": "ke1g7qr",
          "author": "Hamsssandwich",
          "body": "I agree with everything that everyone has said so I don’t have any advice, just a little encouragement!\n\nI commend you and your husband for being so kind to your daughter. This is hard on both ends. It’s hard for her, but it’s also very hard to watch your child suffer. The mom guilt is real, but you are handling this so beautifully and tenderly. Please do not get discouraged that a lot of us had eating disorders at a young age and they continued for years. \n\nAll of us DID NOT get the help we so desperately needed. You are doing things differently. You are doing the right thing. You are doing what our caregivers SHOULD have done. \n\nGreat job mama! I speak for everyone when I say, we are so SO proud of you! \n\nSending so much love to you, your husband, and your baby girl. I just sent a prayer to Jesus for you guys & I will continue doing so. \n\nYou’ve got this mama. You have it in the bag.",
          "created_utc": 1702996572.0
        },
        {
          "id": "ke1gn12",
          "author": "beamdog77",
          "body": "Thank you. I desperately needed the encouragement. Taking her to the doctor is terrifying because it makes it real.",
          "created_utc": 1702996753.0
        },
        {
          "id": "ke1khg6",
          "author": "Hamsssandwich",
          "body": "\n\nI’m so glad the encouragement was well received! Being a parent is hard. It’s hard enough without food & body dysmorphia issues. \n\nI know exactly what you mean though. I started struggling in fifth grade. My mom would just ignore it for the most part. At 20 years old, my mom could no longer deny that I had an issue, and called many places and found a wonderful hospital for me to go to. At that time she admitted to me, that she thought (when it first began at 12 years old) it was just a “phase” and that I would grow out of it. \n\nWhile it was hurtful to hear, I appreciated that she admitted it. I realized then, that she desperately didn’t want it to be real. I’m 25 now, I still struggle. \n\nI think, looking back, I would’ve appreciated somebody making it real for me. I struggled in secret, and feeling like I didn’t *really* have a problem, because if I did, somebody would have done something about it. I felt neglected, as if my problems didn’t matter like everyone else’s did. \n\nI promise you are doing the right thing. I promise. \n\nShe will be so grateful when she’s older. You are showing her great care. \n\nPlease note, in the meantime, she will most likely be angry or sad that you are doing this. You & your husband might ask yourselves “Are we doing this right?” “What if we’re doing this wrong?” “Are we hurting her?”\n\nI can assure you both though, you are doing this the right way. Treating her tenderly, like you are, will help. You are noticing the signs and taking action. That’s all you can do, mama. By making it real, you are taking control. It is no longer controlling you.",
          "created_utc": 1702998344.0
        },
        {
          "id": "ke1ouh1",
          "author": "beamdog77",
          "body": "I can't even tell you how much your words mean to me. I think half the reason I made this post was was so I wouldn't chicken out and so I could practice \"saying it out loud.\"\n\nLast night I put about 8 foods she likes on her plate, and she ate none of them. I followed it with chocolate milk, once irresistible to her, and she declined it all. Moving the food around on her plate, taking the milk with her around the house but never drinking it. 💔",
          "created_utc": 1703000044.0
        },
        {
          "id": "ke1wx8h",
          "author": "Hamsssandwich",
          "body": "The only way I have been able to respond to you this way is because of Jesus. Honest. I prayed and these words are his. My heart breaks for you, mama. I am just so proud of you though. To “say it out loud” takes so much courage and bravery. You haven’t done anything wrong to cause this. \n\n**You. haven’t. done. anything. wrong.**\n\nThis is your first time at life too. \n\nOur lives are complicated by nature. It was always meant to be that way. We will never be satisfied by things we think will satisfy us. \n\nI’ve had many traumas throughout my life. Some were harder and others easier, but all have led to the same thing: Death.\n\nNot physical death. Mental. \n\nI’ve been fighting to live my whole life. Sometimes it just feels like a prison. The *only* reason I’m even here today is because of Jesus. When my soul wails, God hears me. \n\nI know your soul has been wailing for a long time. You’ve had trauma, you’ve had anxiety. You’ve dealt with tough things. You’ve dealt with other peoples selfishness. I’m so sorry. Nobody should have done the things they did, to you. \n\nI know that this issue in particular is probably one of the harder things you’ve been through, & I just wanted to let you know that God hears you. He’s heard your wails mama. He’s heard your sobs. I promise he’s heard you. \n\nYour baby is going to be okay. I promise.\n\nI love you. \n\nFrom one stranger to another, I love you so much. \n\nYour baby girl is going to be just fine.",
          "created_utc": 1703003079.0
        }
      ]
    }
  ]
}