{
  "id": "18o7sqm",
  "subreddit": "EatingDisorders",
  "author": "Admirable-Chart4353",
  "created_utc": 1703224066.0,
  "title": "I'm so tired of thinking about food all the time",
  "selftext": "I think about food allllll the time. Every single time I eat I think about calories and how much fat is going to come on my body. I hate my body so much and wish I was thinner constantly but I compulsively eat and then feel like shit. The only time I feel proud of myself is when I barely eat and keep in under 1000 calories in a day. I love food but I hate eating if that makes any sense. I'm so tired of it and I just really wish I had these other girls bodies so I wouldn't have to worry so much about what I eat. It's so tiring...",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/18o7sqm/im_so_tired_of_thinking_about_food_all_the_time/",
  "score": 43,
  "num_comments": 14,
  "comments": [
    {
      "id": "kegvllp",
      "author": "asolaxx",
      "body": "Same goes for me and I eat about 1600-2000 so I also feel guilty:(",
      "created_utc": 1703255975.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kegvi0o",
      "author": "Fitkratomgirl",
      "body": "Ohh I can relate to loving food but hating eating, but also loving eating so much that it scares me. I hate the feeling of guilt after eating but love thinking about food, but also hate it lol it’s tiring",
      "created_utc": 1703255931.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kehev1b",
      "author": "Interesting-Cow8131",
      "body": "Same ! It's so tiring! I think about food all the time and count down the hours until I \"can\" eat. I feel guilty eating outside of those times. Fear getting fat, even though I'm very underweight",
      "created_utc": 1703263730.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kehurb8",
      "author": "rileyyj001",
      "body": "This weekend is especially difficult for me, as I know it is for many others. The amount of attention put into the next few meals is crazy high; it feels like the whole year is riding on this.",
      "created_utc": 1703269814.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kegjmzr",
      "author": "Cokezerowh0re",
      "body": "Same hun :(",
      "created_utc": 1703250215.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kei985j",
      "author": "Lux_24601",
      "body": "In a way, I prefer thinking about food over other things in my life. When I'm hungry, my brain can't focus on other things stressing me out. \n\nFood and weight are easier to deal with for me because they feel easier to control. \"Love food but hate eating\" is the most relatable thing I've ever seen.",
      "created_utc": 1703275492.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kehq3sy",
      "author": "Dear_Friendship_2541",
      "body": "I completely relate to this. I love food but when I go to any social gathering like a lunch or a dinner I feel so uncomfortable with not knowing how many calories I may consume. it's exhausting. you're not alone <3",
      "created_utc": 1703268031.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kehqpjo",
      "author": "Youngtransgirl18",
      "body": "It gets easier through recovery like I used to manically look through the food menu at work the week before to see what I would eat and a month into recovery I stopped doing it unconsciously. Good luck 💕",
      "created_utc": 1703268261.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kewoaga",
      "author": "Sea-Fix-3520",
      "body": "I don't know how to cook meals that are good for me and not high calorie but it interesting and easy to make.i absolutely hate cooking and cleaning.",
      "created_utc": 1703539401.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kex8756",
      "author": "Sea-Fix-3520",
      "body": "I hate the Jimmy Kimmel show where they torture kids by lying to them and saying\"that I ate all your candy\" and I don't like seeing kids cry at the expense of a television show.I literally can't watch the kids cry because the fake lie the Kimmel says to hurts them as if the parents are sadistic and really took away the candy that is for children specifically .It reminds me of my parents who tortured me as did my brother.",
      "created_utc": 1703548473.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kexaaco",
      "author": "Sea-Fix-3520",
      "body": "I am too.i think I listed all my binge foods because I thought I had some control over food with sugar in it or cream and flour crust even in breaded things or quiche that I wanted to eat.And I wanted to eat a piece of 🍰,and have all the deserts I love,but if it has sugar or substitutes like dextrose or honey or corn syrup.I binge big time on oatmeal,cream of wheat and peanut butter and chocolate.if I don't eat the whole thing at once I will go back and binge until it's gone.Just like beer.wine,hard alcohol there is nothing I can have to eat ,I will finish the cake cookies and go out and get more.",
      "created_utc": 1703549424.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kf2pcon",
      "author": "PrudentAwareness9812",
      "body": "same feelings",
      "created_utc": 1703646713.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kep5sil",
      "author": "Teetsbypaige",
      "body": "This is exactly how I feel too. The holidays are especially tough. Trying to focus on listening and spending time with loved ones when there’s so much food around and food is all that you can think about is so hard.",
      "created_utc": 1703389108.0,
      "score": 2,
      "context": [
        {
          "id": "kehev1b",
          "author": "Interesting-Cow8131",
          "body": "Same ! It's so tiring! I think about food all the time and count down the hours until I \"can\" eat. I feel guilty eating outside of those times. Fear getting fat, even though I'm very underweight",
          "created_utc": 1703263730.0
        }
      ]
    },
    {
      "id": "kei8hn3",
      "author": "Lux_24601",
      "body": "All of this upcoming week is terrifying for me because right after Christmas, I'm going on vacation with my sister and parents. There's no way for me to control when or what I eat, and I'm so scared of coming home from that to see how much I weigh. Is it weird to look forward to New Year's because it's socially acceptable to eat less?",
      "created_utc": 1703275200.0,
      "score": 5,
      "context": [
        {
          "id": "kehurb8",
          "author": "rileyyj001",
          "body": "This weekend is especially difficult for me, as I know it is for many others. The amount of attention put into the next few meals is crazy high; it feels like the whole year is riding on this.",
          "created_utc": 1703269814.0
        }
      ]
    }
  ]
}