{
  "id": "18p2ivy",
  "subreddit": "EatingDisorders",
  "author": "Novel-Tone6744",
  "created_utc": 1703325569.0,
  "title": "I think my brother has bulimia",
  "selftext": "I’m 14 and my brother is 17. He’s really skinny, and lately I’ve noticed him going to the toilet after meals. Today we went out for dinner, and before we got our food he went to the toilet, and about 40 mins afterwards, right after eating he went again. I’m really scared that he’s purging.\n\nDoes this sound like bulimia or am I just overreacting? I just want to help my brother if he is struggling.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/18p2ivy/i_think_my_brother_has_bulimia/",
  "score": 47,
  "num_comments": 14,
  "comments": [
    {
      "id": "kenohfe",
      "author": "None",
      "body": "Tell him you are worried about him and ask him if he needs to talk about anything and that you would never judge him or tell anyone.",
      "created_utc": 1703365208.0,
      "score": 24,
      "context": []
    },
    {
      "id": "keogd0w",
      "author": "sophsathome",
      "body": "I would not encourage lying to him by saying you won’t tell anyone. I think verbiage is important to gain trust, so maybe say something like “I’ve just noticed you’ve been acting a little differently than before, I just want you to know that I’m here for you if you ever want to talk and Ive got your back” \n\nAnd because it’s only a suspicion at this point, I would follow -\n\nTherapy rules: as long as you aren’t hurting yourself or anyone else, a secret is a secret. If you or someone you love is hurting and you see something - say something.",
      "created_utc": 1703377231.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kenh3ra",
      "author": "eendjepadschild",
      "body": "It's definitely suspicious. I would check in with him",
      "created_utc": 1703362078.0,
      "score": 30,
      "context": []
    },
    {
      "id": "keoh6ep",
      "author": "fineboifranz",
      "body": "It can be, but I don't want to scare you, it can also by something else. Maybe start by asking him about his digestive system...  very gently abot that topic... If he is having some problems or some alergies/intolerance..  people can react as well very badly to lactose for example, it can come in your teen years, my friend's intolerance to lactose  developed when she was 16teen. Alergies can also came with time.",
      "created_utc": 1703377596.0,
      "score": 5,
      "context": []
    },
    {
      "id": "keqotoz",
      "author": "xobabysophia",
      "body": "Thank you for looking out for him. Please talk to him and ask him if there’s something going on. It could be his digestive system or he’s really doing it. Take it with a grain of salt and then let your parents know. A secret is a secret unless the other person is harming themselves.",
      "created_utc": 1703426868.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kep5hur",
      "author": "OddConclusion6664",
      "body": "Idk that sounds pretty normal, I’m thin and I go to the bathroom all the time cuz I drink a lot of water  and have to pee constantly (sorry if that’s tmi)",
      "created_utc": 1703388969.0,
      "score": 7,
      "context": []
    },
    {
      "id": "keu27bi",
      "author": "RatLover928",
      "body": "As someone who's struggled with bulimia before I can confirm this sounds a lot like it and if it is you should try to talk to him. Try not to be harsh when doing it since for a lot of people it's very difficult to talk about their ed,just assure him that you're here for him if he needs to talk and that you won't tell anyone else. He might deny it even if he does have an ed so keep an eye out if his habits change after you confront him. I wish you and your family the best,happy holidays <3",
      "created_utc": 1703483535.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kev2am3",
      "author": "manders556",
      "body": "Is it simply just that he takes awhile? Or other red flags and signs such as actually hearing vomiting or seeing traces of vomit in the toilet afterwards on the seat? Another sure sign of purging is look up what purging knuckles look like: the knuckles get irritated especially if it consistent repetitive purging there will develops scabs on the knuckles and knuckles will appear red. I struggles with anorexia purge subtype so I struggled with restriction plus compensatory behaviors such as over exercise chew n spit and purging. It’s a coping mechanism. \n\nRight now it seems to just be speculation. But if more signs appear I would start to address the issue with him in a respectful and private manner and first let it known you care and are concerned followed by your concerns and evidence for them if you have any. It’s normal for denial for even the sufferer. Many sufferers don’t think they are sick or it’s maladaptive or disordered partly due to disordered behaviors being so damn normalized in society that it’s hard to tell. But making up and compensating for what you eat while it’s rooted and encouraged by diet-culture it is not natural and shouldn’t ever ever be the new normal. And yet here we are with EDs crocheting and developing at earlier and earlier ages. Children as young as 6 years old are actively increasing in struggling with body dissatisfaction research shows. I’m a psych major and look into a lot of these studies out of passion and curiosity. The statistics and results are disheartening. Something needs to change and it truly starts with us. It starts with psycho education and being aware of language and culture and mental health. Being aware of the language we use surrounding food and unlearning associating moral value with food is a crucial part of ED recovery and any Ed treatment program will teach you about intuitive eating and teach you to challenge diet-culture myths and disordered cognitions which also were influenced by diet-culture and how society talks about food and messsages society sends about food which are not even rooted in reality such as food is “junk” or “bad” which doesn’t promote intuitive relationship with self and body but body disconnection which ironically fuels disordered behaviors even more. The only “bad” food are the ones that made Santa’s naughty list and the only “junk” food are ones that are already in the garbage. Food is food and language and messages surrounding food is important. My biggest trigger for purging behaviors alone was indeed GUILT and SHAME which was learned through our diet-culture ridden society and even advertisements on food can be seen associating guilt with food as their stinking marketing strategy by saying “ZERO guilt or GUILT FREE” all food fits and all food has nutritional value—some more than others but ALL food has value and is fuel. If you live in a household that commonly uses language that demonizes certain food groups, food labels, or attaches moral value to food then these are all recipe for development of eating disorder. I would certainly challenge that and speak about food in more neutral terms around him if that’s the case. \n\nBut so far all we know is that he takes 40 minutes in bathroom. Okay, he could be scrolling on his phone. Maybe he does have slow digestion and digestion issues. Maybe he’s constipated. Maybe he is engaging in disordered behaviors. Maybe he’s just chillin. It’s really hard to know right now. Time will tell. Just be kind and show your support in any way you can",
      "created_utc": 1703512318.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kesrtdz",
      "author": "Sea-Fix-3520",
      "body": "I was bulimic in high school and I was in so much pain that I couldn't stop,and in school one of the unpopular girls told me she put her finger down her throat when she didn't want to go to school I was eating sugar out of an addiction to corn syrup,flour,sugar, and sugar substitutes,as well as alcohol.Another girl asked me if I wanted to lose weight,and I did, because I hated the color of my teeth,not bright white,and I thought if I was super thin I would look more attractive.Plus a cop was trying to coerce me into his house and the pool of his female neighbor who I never met,but she also lived across the street from me,as did the police detective.I love sugar and my blood sugar was off too, and I carved all the sweets in my house and put my finger down my throat and threw up all the food I ate.My father yelled at me and tried to get me to confess my binging.I was too ashamed of myself.Good luck,I was depressed,as my mother died suddenly and I was mad that this cop was using me to jerk off to in his 🪟.I wanted to stop,but I was afraid of being judged.",
      "created_utc": 1703458772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kesy2qo",
      "author": "Sea-Fix-3520",
      "body": "I wrote too much,but I wanted to tell someone what was going on and what I was doing,and not get judged for it.I needed a mother to be there for me and a father to protect me maybe your guy is fine,idk.",
      "created_utc": 1703461759.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kewccpb",
      "author": "TheEmoUnicorn",
      "body": "It does sound a bit suspicious, so if I were you, definitely check in with him. Then again, there are several other reasons as to why someone may go to the bathroom a lot. I drink a lot of water, and I mean A LOT plus a lot of caffeine so I gotta go to the bathroom a lot sometimes/some days. But yeah, I would definitely check in with your brother.",
      "created_utc": 1703534263.0,
      "score": 1,
      "context": []
    },
    {
      "id": "key06ge",
      "author": "StormyVenus",
      "body": "That is suspicious, just being honest here, when I was his age, long time ago, I smoked  and would leave to use the ladies room to have a cigarette. Tobacco can for some people be an appetite suppressant or for some people a treat after a meal. Maybe he doesn’t want his   family to know he smokes. Some people smoke to control their appetite. From experience I know nicotine does that, it controls your appetite . 🪄I pray this helps🙏",
      "created_utc": 1703561570.0,
      "score": 1,
      "context": []
    },
    {
      "id": "keu5l8c",
      "author": "Novel-Tone6744",
      "body": "Thank you so much ❤️",
      "created_utc": 1703485911.0,
      "score": 1,
      "context": [
        {
          "id": "keu27bi",
          "author": "RatLover928",
          "body": "As someone who's struggled with bulimia before I can confirm this sounds a lot like it and if it is you should try to talk to him. Try not to be harsh when doing it since for a lot of people it's very difficult to talk about their ed,just assure him that you're here for him if he needs to talk and that you won't tell anyone else. He might deny it even if he does have an ed so keep an eye out if his habits change after you confront him. I wish you and your family the best,happy holidays <3",
          "created_utc": 1703483535.0
        }
      ]
    },
    {
      "id": "keu5q87",
      "author": "Novel-Tone6744",
      "body": "I hope so. I’m so sorry you went through all that.",
      "created_utc": 1703486014.0,
      "score": 1,
      "context": [
        {
          "id": "kesy2qo",
          "author": "Sea-Fix-3520",
          "body": "I wrote too much,but I wanted to tell someone what was going on and what I was doing,and not get judged for it.I needed a mother to be there for me and a father to protect me maybe your guy is fine,idk.",
          "created_utc": 1703461759.0
        }
      ]
    }
  ]
}