{
  "id": "195wott",
  "subreddit": "EatingDisorders",
  "author": "alxandruhgh",
  "created_utc": 1705176048.0,
  "title": "counting calories has destroyed me",
  "selftext": "everyday i wake up at 4am to count and plan my calorie intake. today i had two slices of toast and an apple, and feel guilty about getting a burrito tonight with my boyfriend. I don’t know what to do, I feel like calorie counting and calorie apps has consumed my life and made me miserable. Advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/195wott/counting_calories_has_destroyed_me/",
  "score": 65,
  "num_comments": 15,
  "comments": [
    {
      "id": "khpy61w",
      "author": "Interesting-Cow8131",
      "body": "No advice as I don't calorie count. But I do restrict and constantly weigh myself throughout the day. It's exhausting mentally and emotionally. Just know that you are not alone",
      "created_utc": 1705180158.0,
      "score": 18,
      "context": []
    },
    {
      "id": "khq77ar",
      "author": "asolaxx",
      "body": "Counting calories fucked me up. It triggered my binge eating. I would rather gain 5 kgs instead of counting, at the same time I am so afraid of gaining that I can’t stop counting calories. My mind is messed up.",
      "created_utc": 1705183484.0,
      "score": 10,
      "context": []
    },
    {
      "id": "khrbiqj",
      "author": "notreallycapricon",
      "body": "I was like that , but one day I just thought of simplifying the calculation, didn't count every ingredient, just the ones with the highest calorie density. For example, if I ate 1 pound chicken salad ( including the leafs and vegetables), I would just take the calorie intake of 1 pound of chicken. About 85-90 % of the time the calculation comes out to be more than the actual calories of the food , which also creates an ever so slightly calorie deficit. I also like some suggestions about not counting calories at all , but in my case I was not able to give that up , it was always I can't eat everything willy nilly and also can't spend my whole day just trying to figure out how much I ate .\n\nOne more suggestion is be kind to yourself when you mess up . For example think of your friend trying to do the same and messes by eating fried chicken, will you immediately assume and forget all the progress they have made till now , no , right? Why is that ?When we can show so much compassion for others yet we fall short on treating ourselves well. These might be some of the reasons why we might have EDs , but remember being kind and forgiving yourself is not such a bad thing after all , it's fine to have a good meal once in a while , something we enjoy . In today's scenario it's almost impossible to predict what we'll eat at any given time as understandably in social settings we can't just sit there and refuse to eat everything, similarly when hanging out with your SO you'd want to spend a good time , you can't do that when you always stick to rules set up by yourself . Cross the line a little from time to time , I'd say it'll help get peace with yourself a little.",
      "created_utc": 1705198728.0,
      "score": 6,
      "context": []
    },
    {
      "id": "khrhcsp",
      "author": "Big-Confidence4193",
      "body": "I say this all the time but seek professional help. That’s only what got me stop. However be warned once your in recoveryc you will still want to count calories in your head. And at least for me I can do it acuratelty and though it’s hard to delete the calorie counting apps. It’s even harder to turn the calorie counter in your brain off. That’s why it’s best to get a therapist and dietian involved. Hang in there it gets better",
      "created_utc": 1705201045.0,
      "score": 3,
      "context": []
    },
    {
      "id": "khsz6f1",
      "author": "pin_kshit",
      "body": "yesterday I had kind of a big breakfast because I had a long day ahead, and I rememeber panicking all day about it. Today I woke up, and I was the same, nothing had happened. I hadn't magically gained a bunch of weight for eating a little bit more than usual in advance to a long day, the only difference is that I had more energy.\n\nWhat helps stop or reduce calorie counting is asking myself \"what will happen if I eat this\". Maybe the instinctive answer will be \"gain weight\", but you need to keep questioning yourself \"is that actually realistic?\", and the answer is no. Eating a burrito, an extra plate of something or a snack won't have an impact on your weight, and even if it changes ever so slighlty, weight fluctuations are very normal (it means your body is doing its job, moving things along the way and sustaining you in order to live).\n\nSo keep questioning yourself, and be kind to yourself too, because the actual consecuences of eating are non-existent, the only thing that will come out of you eating that burrito is having more energy and being more lively in order to be able to have a better time and be more present <3",
      "created_utc": 1705233494.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kht9d6o",
      "author": "funnyhunny99",
      "body": "if you have any calorie counting apps, delete them. i know what it feels like to have a rolodex of calorie counts in my head and they are hard to get rid of but just try to challenge those impulses in small ways. maybe if there’s a food you don’t know the calorie information for, try challenging yourself not to look it up. when that feeling is a little more tolerable, try not calculating your calories for one day a week. it can take awhile but thats how i did it. it slowly becomes more and more manageable over time and soon it won’t feel like a number that controls your life.",
      "created_utc": 1705239523.0,
      "score": 3,
      "context": []
    },
    {
      "id": "khshlde",
      "author": "Remarkable-Pirate214",
      "body": "Sorry if this is a bad suggestion but have you tried intuitive eating? It’s not a fix-everything tactic but it starts to get you thinking differently about food.\n\nStart with something small, like citrusy fruit, or chocolate is fantastic for this. Anything tasty. Look at it, study it, feel it in your hands. Appreciate it. Then smell it. Take a small bite and feel it in your mouth, the temperature, taste, texture. Then do this for a meal. It’s honestly one of life’s joys and I’d love you to experience some of it x",
      "created_utc": 1705220606.0,
      "score": 1,
      "context": []
    },
    {
      "id": "khuivuw",
      "author": "synchrohobbit",
      "body": "Treatment.",
      "created_utc": 1705257054.0,
      "score": 0,
      "context": []
    },
    {
      "id": "khuqq6s",
      "author": "manders556",
      "body": "Perspective coming from (25f) 10 years experience in eating disorder recovery. Also in school to be a professional counselor—specifically art therapist. I have been in and out of treatment all levels of care. \n\nAhhh yes, you are not alone unfortunately in this struggle. Many women and men have been conditioned to view food as numbers and our bodies as something we are to fear and not trust. This may be rooted in fat-phobia and diet-culture but the reality is that fat people have always existed and health does come in all sizes. You can be overweight and have a completely healthy relationship with food and lab results. Weight alone is not a great or reliable indicator of health and genetics often plays the biggest role anyways. \n\nCalorie counting is disguised as a health promoting behavior by diet-culture when in reality restriction and monitoring every bite you eat and tracking intake breeds an unnatural, obsessive, and disordered relationship with food. \n\nI do not know how long you have been struggling or your age or if you have a good support system or are willing to take that step to seek out treatment and support which is available btw!\n\nBad news— it’s very difficult to re-wire our brains and likely will take time, support (like professional support and evidenced based treatments such as CBT and DBT specific designed for OCD, depression and eating disorders), and trial and error. Just two years even I was still not in a great spot and associating food with numbers despite years of trying to unlearn this behavior. \n\nThe reality is, this behavior is often reinforced by society due to diet-culture and calories are plastered everywhere and on menus making going out to eat an even more anxiety provoking experience for many. That’s why treatment programs and support groups are also available and intuitive eating groups as well. Having supportive mealtime and group therapy with ppl going through the same thing can be so therapeutic in the right environment! \n\nGood news- we CAN RE-wire our brains due to neuroplasticity. After consistently working on my self and with the right support and treatment team I was able to unlearn a lot of my cognitive distortions, challenge my food fears, and unlearn associating food with a stupid number and viewing food for what it is: food and fuel, family, connection, joy, culture, being alive. Rather than viewing food as “good” vs “bad” or a stupid number.\n\nWorking with intuitive eating dieticians throughout the years helped me to work on relationship with food and body. Food rules and restriction literally disconnect us from our bodies and eating experiences and natural hunger fullness cues. Restriction literally disrupts and disregulated the nervous system and disregulated hunger fullness cues. \n\nThat’s why in the beginning intuitive eating can feel counter intuitive because you may have to force yourself to eat when you’re not hungry because until you’re nervous system gets regulated again with regulated meals— you can’t trust ya hunger cues ironically because the restriction disregulated it so you may not feel hungry but ya body still needs more than what you were giving it. Once it regulates with consistent regulated meals (3 meals a day and snacks) your hunger fullness cues will regulate again and you can start to work on the intuitive and trusting your body part. \n\nHelp is available, I could recover on my own with no support and there is a specific treatment for eating disorders as it is a specialty in the field.",
      "created_utc": 1705259782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "khw9kmk",
      "author": "glitterpawdoughnuts",
      "body": "DELETE all apps that count calories. Find someone to help you be accountable to and then start therapy. You can do this.",
      "created_utc": 1705278986.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ki36i7o",
      "author": "AliasHormiguita",
      "body": "You're not alone in this! This habit did not appear in your life overnight, it took a bit for you to learn and it will most likely take the same amount of time to get rid of,  if not longer, but with consistent work it WILL happen and you'll forget how long it even took to go to bed without even thinking about calories whatsoever.  Something that I recommend is to NOT DO THIS ALONE. Communicating with your support system, boyfriend, family, and sharing what's going on will not only keep you accountable, but will help you to not feel alone in this battle. You're incredibly strong for even  asking for advice here too! yet cannot stress the importance of being surrounded by love and support 24/7!\n\nIt's not a sign of weakness to ask for extra support.. Consider having your loved ones go grocery shopping with you or even do it for you. Ask them to cover the nutrition facts or even peel labels off products if possible.  Allow them prepare food for you a few times per week and give up some control.  I know this is one of the hardest things to do, but ED hates  it and will weaken when you disregard it's wishes more and more.. My partner suggested to to be in charge of all my meals and snacks for only one day per week ( it would be Sundays for us, since it was our day off ) and it was such a scary decision for me, but it got easier over time and even made our relationship stronger.  I could never fathom even looking forward to sundays  and having \"fun foods\" with him.. I slowly regained my freedom back, and enjoyed our outings and dinner dights at home. I sometimes feel challenged by my inner turmoils to this day, but it's part of recovery! Doing something to challenge your one biggest fear Is like watering a seed consistently and at  the right time every day.  I promise It will flourish over time and all the colors will become visible!\n\nMake a list of your triggers, and the reason why you decided to count calories. Finding the root of this is crucial to solve this. Outweight the pros and cons of such urge and be mindful of what is most important to you everytime you are about to engage in such behavior.\n\nTalking to a professional to find cbt/ dbt excercises that work for you will help you gather tools to surf this habit as well.  Practice mindfulness, Square breathing, Progressive muscle relaxation, journaling, and distraction to keep your running thoughts at bay before, during, and after your meals. Maybe going for a small mindful stroll after meals to help with anxiety, whatever constructive activity helps YOU.\n\nFollowing a plate model also helped me balance my meals without stressing over the calories,  (Half plate starches, a quarter plate protein, a quarter of fruit/veg, visible fat, and a drink)  Be sure to adjust your meals according to what your health practitioners suggest if you have one  :)\n\nI know this is extremely hard, but regaining freedom and piece of mind is truly the best thing you could get after all that time spent in detrimental cycles.  It's so worth it..\n\nI wish you the best of luck on this journey, and always feel free to ask for more support!\n\nYou got this! <3",
      "created_utc": 1705384577.0,
      "score": 1,
      "context": []
    },
    {
      "id": "khqp8vf",
      "author": "ThatOneEmo2004",
      "body": "Same here\nI stopped counting with family intervention but I find myself adding it all up anyway and having the most intense panic attacks I’ve had\nI can’t even rely on my hunger cues because they’re fucked but the urge to just binge anything in sight is insane",
      "created_utc": 1705190121.0,
      "score": 5,
      "context": [
        {
          "id": "khq77ar",
          "author": "asolaxx",
          "body": "Counting calories fucked me up. It triggered my binge eating. I would rather gain 5 kgs instead of counting, at the same time I am so afraid of gaining that I can’t stop counting calories. My mind is messed up.",
          "created_utc": 1705183484.0
        }
      ]
    },
    {
      "id": "khruqth",
      "author": "alxandruhgh",
      "body": "i genuinely really appreciate this comment, more than you might think. thank you so much",
      "created_utc": 1705206722.0,
      "score": 3,
      "context": [
        {
          "id": "khrbiqj",
          "author": "notreallycapricon",
          "body": "I was like that , but one day I just thought of simplifying the calculation, didn't count every ingredient, just the ones with the highest calorie density. For example, if I ate 1 pound chicken salad ( including the leafs and vegetables), I would just take the calorie intake of 1 pound of chicken. About 85-90 % of the time the calculation comes out to be more than the actual calories of the food , which also creates an ever so slightly calorie deficit. I also like some suggestions about not counting calories at all , but in my case I was not able to give that up , it was always I can't eat everything willy nilly and also can't spend my whole day just trying to figure out how much I ate .\n\nOne more suggestion is be kind to yourself when you mess up . For example think of your friend trying to do the same and messes by eating fried chicken, will you immediately assume and forget all the progress they have made till now , no , right? Why is that ?When we can show so much compassion for others yet we fall short on treating ourselves well. These might be some of the reasons why we might have EDs , but remember being kind and forgiving yourself is not such a bad thing after all , it's fine to have a good meal once in a while , something we enjoy . In today's scenario it's almost impossible to predict what we'll eat at any given time as understandably in social settings we can't just sit there and refuse to eat everything, similarly when hanging out with your SO you'd want to spend a good time , you can't do that when you always stick to rules set up by yourself . Cross the line a little from time to time , I'd say it'll help get peace with yourself a little.",
          "created_utc": 1705198728.0
        }
      ]
    },
    {
      "id": "khrusmq",
      "author": "alxandruhgh",
      "body": "thank you so much, i’m currently trying to get started.",
      "created_utc": 1705206746.0,
      "score": 2,
      "context": [
        {
          "id": "khrhcsp",
          "author": "Big-Confidence4193",
          "body": "I say this all the time but seek professional help. That’s only what got me stop. However be warned once your in recoveryc you will still want to count calories in your head. And at least for me I can do it acuratelty and though it’s hard to delete the calorie counting apps. It’s even harder to turn the calorie counter in your brain off. That’s why it’s best to get a therapist and dietian involved. Hang in there it gets better",
          "created_utc": 1705201045.0
        }
      ]
    }
  ]
}