{
  "id": "19f2q5h",
  "subreddit": "EatingDisorders",
  "author": "Short-Art-2620",
  "created_utc": 1706163205.0,
  "title": "Dear eating disorder (goodbye)",
  "selftext": "Dear eating disorder self,\n\nI’m writing this with the intention of saying goodbye for good. You have been with me for a long time and have changed my life and shaped who I am. I often wonder what life would have been like without you entwined within me.\n\nYou have given me a channel to direct my anger, my sadness, my shame and insecurities. When I face hard things in life, you have allowed me to hide and escape the blame and disappointment. Those are the times that you are there for me, waiting with open arms, and the moments where you feel so right. \n\nBut I am strong enough now to say goodbye to you. I know there will be times when my strength wavers, that I will feel a strong pull towards you as a way to get through. \n\nI know now the price I would have to pay to keep you protecting me though. I would have to betray my body, who did nothing wrong but just exists, I would have to betray my values of compassion, I would be moving away from a fulfilling life, a good quality of life, and grateful moments. By having you protect me from the disappointments and fears, you are also protecting me from feeling any kind of vitality in life.\n\nI now know that when life gets hard, turning towards you does not help to address these difficulties. Even though it feels so right, I know you are not meeting my needs, you’re not allowing me to grow and do the hard stuff that needs to be done. How is restricting doing anything to help, other than making my life smaller and slower.\n\nIt’s time for me to grow in my confidence, in my worth, and in my ability to get my needs met. \n\nAnd on the other hand, I am actually grateful for all that you have lead me to. You ripped me to my core and forced me to find my soul, to examine my life and being. I know you won’t ever fully go away. I’ve cried so much about this but I’ve accepted it. Your pull will be my reminder to be true to myself, to speak up and get my needs met. And I know I will be strong to be able to notice and pay attention without losing myself within you.\n\nGoodbye, \nE",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/19f2q5h/dear_eating_disorder_goodbye/",
  "score": 49,
  "num_comments": 7,
  "comments": [
    {
      "id": "kjhgshi",
      "author": "None",
      "body": "This is such a powerful read and I wish you all the best You are an incredibly strong person and I know you are going to have an amazing life ahead of you especially now after choosing recovery 🩵",
      "created_utc": 1706178171.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kjjgzmt",
      "author": "gibbonalert",
      "body": "Your strong, just keep going and you will be free. Wish you all the best❣️",
      "created_utc": 1706208105.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kjpyism",
      "author": "EXT4000",
      "body": "This is such a powerful read, full of courage and hope. I’ve witnessed this many times in my career and the positives are boundless. Myself and few friends made this short video last year on just this, your letter reminded me of it. Take care and stay positive. https://vimeo.com/cpwproductions/hersong",
      "created_utc": 1706306289.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kjyv3kr",
      "author": "Cautious_Bandicoot_4",
      "body": "This is really inspiring. Thank you for posting it and good luck! Enjoy the rest of your life 💜",
      "created_utc": 1706459560.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kkaujm8",
      "author": "SUZQ154",
      "body": "Your words are so unique, and your letter is a reminder to me to continue to be honest and understanding of who I am now.  Thank  you so much for sharing!\n\nYour last paragraph struck me.  I, too, am grateful for my ED.  It brought me to \"rock bottom\" and eventually to a life filled with joy, peace, and love.  My life is now grounded in faith and belief in Jesus Christ.  I am thankful my ED helped me to this place.\n\nAgain, thank you for sharing a very creative and inspiring letter of hope!",
      "created_utc": 1706642559.0,
      "score": 2,
      "context": []
    },
    {
      "id": "koei1go",
      "author": "Short-Art-2620",
      "body": "Wow that’s awesome, thanks for sharing this 💜",
      "created_utc": 1706769259.0,
      "score": 1,
      "context": [
        {
          "id": "kjpyism",
          "author": "EXT4000",
          "body": "This is such a powerful read, full of courage and hope. I’ve witnessed this many times in my career and the positives are boundless. Myself and few friends made this short video last year on just this, your letter reminded me of it. Take care and stay positive. https://vimeo.com/cpwproductions/hersong",
          "created_utc": 1706306289.0
        }
      ]
    },
    {
      "id": "koei98z",
      "author": "Short-Art-2620",
      "body": "Aw thank you💜Im glad at least something good came out of your pain:)",
      "created_utc": 1706769394.0,
      "score": 1,
      "context": [
        {
          "id": "kkaujm8",
          "author": "SUZQ154",
          "body": "Your words are so unique, and your letter is a reminder to me to continue to be honest and understanding of who I am now.  Thank  you so much for sharing!\n\nYour last paragraph struck me.  I, too, am grateful for my ED.  It brought me to \"rock bottom\" and eventually to a life filled with joy, peace, and love.  My life is now grounded in faith and belief in Jesus Christ.  I am thankful my ED helped me to this place.\n\nAgain, thank you for sharing a very creative and inspiring letter of hope!",
          "created_utc": 1706642559.0
        }
      ]
    }
  ]
}