{
  "id": "1ag24ki",
  "subreddit": "EatingDisorders",
  "author": "somehowfunny",
  "created_utc": 1706760727.0,
  "title": "worried my brother has an ED",
  "selftext": "My brother is a teenager, and he’s very involved in the trend of “looksmaxxing.” He works out regularly and generally eats healthy, so he is already a very fit and healthy looking person. However, he is very insecure about his image, even if he tries not to show it. He’s constantly “mewing” and trying to get me involved in his facial improvement stuff. Recently (specifically winter break), I began to note his eating habits. He eats one meal a day: one can of chicken, 4 carrots exactly, and only drinks water mixed in with a powder supplement for some kind of face reshaping(?). Some of this sounds pretty normal, but considering how much a teen boy who is working out for hours a day should be eating, I’m worried this is unhealthy. He spends a lot of time away from home, so it is really not known to me what he’s eating. He’s been mentioning a thing from his tiktok page called “starvemaxxing,” which I’m 99.9% sure is just starving yourself. The other day, I hear him mentioning to my father how he has only had about 140 calories that day, and they were all from his canned chicken. Today, he takes me to a dairy queen, which is unusual, because I know he’s been strict on his diet, and he gets a large thing but then he goes to the bathroom. I’m worried he’s throwing up because it would not be out of character for him, but he says nothing when he comes back.\n\nHow do I help a teenage boy who’s too insecure to help himself? I’m very worried about him",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1ag24ki/worried_my_brother_has_an_ed/",
  "score": 78,
  "num_comments": 5,
  "comments": [
    {
      "id": "kogosh7",
      "author": "yaboytheo1",
      "body": "This is 100% an ED but I don’t really have any advice on helping, teenagers are incredibly difficult to help",
      "created_utc": 1706809334.0,
      "score": 63,
      "context": []
    },
    {
      "id": "kof1eac",
      "author": "None",
      "body": "Oh... I've been also seeing this trend a lot, and generally, the looksmaxxing community is insecure men who do things, sometimes even harmful (like \"bone smashing) in hope of looking like their favorite models (what kind of delusion is that...) The idea of improving your appearance is great don't get me wrong, but this community is SO toxic it's almost impossible to be healthy mentally or even physically.\n\nSo I'm not a professional but when you eat 140 cals a day, that looks very much like an ED...I'd say talk to him first about his self image, because if he does that I think it comes from a low self image sadly. Also, try to be as nice as u can so he can open up :) \n\nAnd if he's okay with it talk with your parents about the situation, since he's a teenager i believe his parents can restrict his access to social media ? I think a social media break will be beneficial because maybe he'll take a step back and realize how crazy this trend is hopefully...\n\nAlso, seeing a good therapist would be a good idea :) I don't wanna scare you but that's a great thing you wanna help him now, because knowing how influenced teenagers can be and how harmful this community is, things can get worse with time... \n\nHope it helped and wish the best to you and your brother !",
      "created_utc": 1706783467.0,
      "score": 18,
      "context": []
    },
    {
      "id": "kohaamy",
      "author": "c0untcockulitus",
      "body": "Man, I'm not a fan of social media platforms like tiktok because they spread around ridiculous rhetoric that influences a hugeeeee audience. This whole \"_____maxxing\" and \"starvemaxxing\" trend that is going around is just another way of creating a swarm of insecurities in people and putting the idea in their minds that they are not good enough as is and need to push themselves to become perfect. Try gently bringing up with your brother that you're worried about him. You could say \"Hey, how have you been doing recently?\", \"Hey, I wanted to check in with you and see how you've been feeling lately\", or \"I've noticed some habits that you've been exhibiting and I was wondering if you'd be open to talk about them and/or how you've been doing. I care about you and I would like to know what's been going on in your life. Are you doing alright?\". These could help lead to a potentially productive, helpful, and insightful conversation between you two that could help you and him to take a step forward and move in the right direction without making him feel uncomfortable or like he's being interrogated.",
      "created_utc": 1706816640.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kogm5q6",
      "author": "RareScreen0",
      "body": "Starvemaxxing this is just another one from tiktok",
      "created_utc": 1706808450.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kokxh7h",
      "author": "RealBENIS",
      "body": "Genuinely a really tough pickle to be in these days with social media absolutely ravaging the brains of young boys. All I can possibly think is that encouraging him to do some sort of hobby or interest that isn’t just a nauseating degree of self-flagellation might help him build a sense of self that replaces his need to be seen as whatever the heck he thinks he needs to be seen as. Remind him he is valuable without that. Ask him how he values other people and if he would demand that of them. Perhaps find some sort of positive media to slowly propagandize into a better outlook? Personally I find it hard not to scrutinize somebody like that directly. But given that you care about him and he’s a teenager, it’s likely that attacking the problem head-on could result in him digging in his heels and putting up walls. Most of all I think you should do your best to foster a relationship with him where he knows that whatever your opinion, you have his best interests in mind. \n\nEven going to an ED clinic, it is incredibly hard to imagine combatting the Goliath threat that is the diet, fitness, and appearance industry. I’m sorry you have to see a loved one go through this. I know it’s probably extremely overwhelming. Good luck.\n\nOh and if you or him are at all into the medium,  [here is a link](https://podcasts.apple.com/us/podcast/behind-the-bastards/id1373812661?i=1000541220221) to a podcast episode about one of the first fitness influencers - a man who was so obsessed with it that he killed his own infant child. People like this guy are the root of the diet and fitness industry, and it has never changed even a tiny bit. It is still run by a bunch of hapless lunatics and greedy ghouls.",
      "created_utc": 1706878556.0,
      "score": 3,
      "context": []
    }
  ]
}