{
  "id": "1b3bqb4",
  "subreddit": "EatingDisorders",
  "author": "Material_Ad4807",
  "created_utc": 1709241636.0,
  "title": "Is it normal to be really angry and defensive when someone is trying to help you with an eating disorder?",
  "selftext": "Is it pretty common for the person with the eating disorder to become angry, defensive, or lash out at a loved one when the loved one is suggesting treatment or trying to encourage recovery? Looking for any insight on this and I’m having a hard time finding anything. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1b3bqb4/is_it_normal_to_be_really_angry_and_defensive/",
  "score": 49,
  "num_comments": 15,
  "comments": [
    {
      "id": "kssqm2x",
      "author": "maraisthecat",
      "body": "Yes. \n\nMy eating disorder began when I was around 12 years old. I was in therapy at the time for other reasons and my therapist/psychiatrist regularly called me out for it. I refused to listen (Thought it was just a \"willpower\"  issue that I could stop when I wanted).\n\nI was in denial with myself up until about 2 years ago (I'm now 27) and have mostly recovered.",
      "created_utc": 1709262032.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ksw85yg",
      "author": "None",
      "body": "1000%. The amount of fights me and my dad have is insane. But deep down I’m grateful he’s trying, because I know for a fact I wouldn’t have bothered to try if he didn’t encourage it, im still slightly annoyed it took him 9 years tho, even though he said he knew the whole time",
      "created_utc": 1709321049.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kswew5v",
      "author": "None",
      "body": "Depends.  Yeah it’s common to be in denial, ashamed etc.\n\nBut it’s not just “go to treatment and recover”, like it’ll fix anything.  If you don’t have insurance, treatment can be thousands of dollars a day.  Therapists won’t work with you if you admit you have an ED and they don’t have specialized treatment (as you’re a liability).  They’ll say, I’m referring you to a higher level of care, but if you can’t access it due to location or being too poor, you’re just coping alone.\n\nSome of us have had EDs for decades as a result of childhood trauma, treatment doesn’t really have a place for us similar to “harm reduction”.  Some of us have tried treatment but are neurodivergent, so common treatment models can be unhelpful to adhd/autistic people.  Which is hard.\n\nSometimes people are trying and they don’t want to talk about it too.  Sometimes they just want a friend yanno, not another voice in their life pushing them. 💕 I get your worried, but just saying, “I’m here no matter what” and actually being there means more yanno?\n\nAnd “recovery” is hard in a society that doesn’t actually acknowledge or treat you well if you aren’t thin.  Many people don’t want treatment unless they “feel like they deserve it”.  I’ve even had medical providers be fatphobic while I was attempting to get treatment for bulimia lol.  It’s so heartbreaking, and someone can take a while to want to try again.\n\nIn the end, EDs are bullshit, but it’s best to be there and when they’re ready, they’ll know you’re safe. 💕",
      "created_utc": 1709323328.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ksw9jsg",
      "author": "abrillvv",
      "body": "i really do think so, i normally completely snap when someone mentions my eating, weight, or their diet etc. it makes me so incredibly upset and i’m not the type of person who gets angry easily",
      "created_utc": 1709321519.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kswm3l4",
      "author": "VivaCity890",
      "body": "Absolutely. There can be a number of reasons as to why. If someone is malnourished/not eating well they’re also likely going to be irritable. Shame and guilt are also a huge part of a lot of people’s EDs, and when confronted about things that make us feel guilty/shameful, getting defensive can be a very common response. \n\nAnother reason I’ve noticed for defensiveness also has to do with the nature of eating disorders themselves. I tend to think of EDs as mental parasites: they take over your mind, your thoughts, and do whatever they can to stay alive/active in your mind. Someone trying to help an ED sufferer recover threatens the existence of the ED. The ED doesn’t like this and wants to keep itself active in the mind of the host it’s taken over - e.g. reject the notion of recovery. Recovery is a threat to the ED, so the ED will do whatever it can to stay alive. \n\nOverall though, for whatever reason, this is a common trend.",
      "created_utc": 1709325792.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ksxdng1",
      "author": "DeepSeeker333",
      "body": "Yes, it's completely normal. Because your internal ED voice feels threatened. It's been your coping mechanism. So it's only natural for your eating disorder to lash out and feel threatened when you are trying to get rid of it. Just try to become aware of what internal dialogue you choose to listen to. Will it be your recovery voice or ED voice? \nYou can do this. Recovery is possible",
      "created_utc": 1709335622.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kt5ig8p",
      "author": "MaryContrary26",
      "body": "I know ED's are shrouded in mystery and most people can't relate so think of it as an addiction, because it is and ask yourself, do addicts generally thank their families and friends for encouraging treatment when they're not ready to recover?",
      "created_utc": 1709477222.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kswkggb",
      "author": "Classic-Tale-9278",
      "body": "Yep. It’s a sign of malnourishment",
      "created_utc": 1709325231.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kswpzre",
      "author": "rileybeaner",
      "body": "oh absolutely. the amount of things i have said to my parents that i wish i could take back is outstanding, not to mention how much lying i was doing and being defensive 24/7. Even just last summer my aunt texted me a long and sweet message about my eating and i completely ignored it and was annoyed by her. i eventually replied but at first i didn’t even consider what she was saying, just immediately got irritated when i read it. but most of all, my relationship with my mother has never been the same since before my eating disorder.",
      "created_utc": 1709327117.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ksz1c4h",
      "author": "Deeray95",
      "body": "Every day of my life ….. it’s heart breaking for the helper\nFocusing in the fact that their brain is malnourished and therefore it can’t fight through voice of the eating disorder\nAnd make sure you have support for yourself",
      "created_utc": 1709363900.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kt2rc8r",
      "author": "NothingFlat2109",
      "body": "I'm the same, I lash out when people try to help and I feel bad for it afterwards lol",
      "created_utc": 1709424076.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kt3z54j",
      "author": "Sensitive_Ad_920",
      "body": "extremely normal 🙏 i was forced into recovery bc i was dying and regardless i still wanted nothing to do w it 🧏‍♀️ im ngl they caused me a lot of grief but i wasn’t much better, i was cussing at everyone for everything, literally screaming at the top of my lungs 😭 just know that once you take the help you won’t regret it, it’s a long process and journey but eventually you’ll get there! you got this",
      "created_utc": 1709443257.0,
      "score": 2,
      "context": []
    },
    {
      "id": "la5pn3n",
      "author": "Inner-Programmer-153",
      "body": "honestly the most annoying part is when they ask you every second did you eat did you eat",
      "created_utc": 1719288103.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ksuf1as",
      "author": "Material_Ad4807",
      "body": "Thank you. I guess I really had no idea how bad it was.",
      "created_utc": 1709297587.0,
      "score": 6,
      "context": [
        {
          "id": "kssqm2x",
          "author": "maraisthecat",
          "body": "Yes. \n\nMy eating disorder began when I was around 12 years old. I was in therapy at the time for other reasons and my therapist/psychiatrist regularly called me out for it. I refused to listen (Thought it was just a \"willpower\"  issue that I could stop when I wanted).\n\nI was in denial with myself up until about 2 years ago (I'm now 27) and have mostly recovered.",
          "created_utc": 1709262032.0
        }
      ]
    },
    {
      "id": "ksyo140",
      "author": "maraisthecat",
      "body": "Good luck on your journey!! It's not an easy one, but I promise it's worth it. ❤️",
      "created_utc": 1709355726.0,
      "score": 4,
      "context": [
        {
          "id": "kssqm2x",
          "author": "maraisthecat",
          "body": "Yes. \n\nMy eating disorder began when I was around 12 years old. I was in therapy at the time for other reasons and my therapist/psychiatrist regularly called me out for it. I refused to listen (Thought it was just a \"willpower\"  issue that I could stop when I wanted).\n\nI was in denial with myself up until about 2 years ago (I'm now 27) and have mostly recovered.",
          "created_utc": 1709262032.0
        },
        {
          "id": "ksuf1as",
          "author": "Material_Ad4807",
          "body": "Thank you. I guess I really had no idea how bad it was.",
          "created_utc": 1709297587.0
        }
      ]
    }
  ]
}