{
  "id": "1bb5ie9",
  "subreddit": "EatingDisorders",
  "author": "Morgentau7",
  "created_utc": 1710059474.0,
  "title": "I started dating a woman (23) with ED and I really like her. Can you tell me what I should know about this illness and how I can support her?",
  "selftext": "\nShe told me a few things about it and I can definitely ask her for more informations, but I don’t want her to have the feeling that she needs to talk about this often. I want her to feel safe and happy, and not being confronted with the illness more often than necessary. \n\nShe is in Therapy, has the ED for at least 6 years I guess, maybe more and said she is in her last steps of her Therapy. Eating would just be like at 20% of being a problem left rn. The illness causes her Acne which doesn’t make her any less beautiful but I know that making comments on appearance are always difficult.\n\nShe told me that I‘m the first man since her illness appeared with whom she could be intimate or be dating at all. She said that being with me really helps her and she was happy and smiling all day long after our first kiss.\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1bb5ie9/i_started_dating_a_woman_23_with_ed_and_i_really/",
  "score": 40,
  "num_comments": 15,
  "comments": [
    {
      "id": "ku8rks5",
      "author": "gymbunbae",
      "body": "This may not apply to everyone, and may depend on where someone is in their journet, but for most of us, it's best to never comment on our bodies, appearance, what we eat, how much, or how often. Compliment and value us for other things than our appearance, instead of saying we look nice, tell us our outfit is awesome, or that our makeup is well done, compliment the skill behind the look. And do not ever speak of food in moral terms. Food is food. It's not good nor bad. It's not healthy or unhealthy. It's fuel. It's nutrients. It's neutral.",
      "created_utc": 1710090782.0,
      "score": 37,
      "context": []
    },
    {
      "id": "ku96epj",
      "author": "Aaandor",
      "body": "I'm speaking from my own experience now, but any comments about my body or food make things worse, and I remember feeling awful when someone next to me said what a fast metabolism they had and how much they can eat and not get fat (I was very jealous back then). In my case, I don't  want the subject of my ed to be ignored or avoided on purpose, you should give her safe space to talk about it when she needs to. Don't comment how much she already ate or how little, show her how much you care and tell that you are going to be for her anytime she needs to.",
      "created_utc": 1710095882.0,
      "score": 13,
      "context": []
    },
    {
      "id": "kua0qao",
      "author": "three6666",
      "body": "don’t force her to eat, especially on excursions/dates unless if she’s at risk of medical emergency/passing out. shoving food in our faces often makes it worse and makes us want to restrict/control more \n\nwhen she’s not in an episode or a bad mental state, ask what her safe foods / restaurants are. prioritize getting those when going out/spending time together",
      "created_utc": 1710106564.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ku96fz7",
      "author": "StockReporter5",
      "body": "i would honestly just scroll through some of these forums and get an idea of what people with ed’s go through. not all will be applicable to her, but it could help you be more familiar with the spectrum of eating disorders. definitely don’t comment on what, how much, or when she’s eating. overall, just being an open and nonjudgmental listener is the best thing u can do for her🌟",
      "created_utc": 1710095894.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ku9tblz",
      "author": "Warrior-Skye",
      "body": "If I were to look at myself, I would like to hear that I can go to other people with everything, without judgement.  That that person sees how hard I am working on recovery, but if things ever slow down, I can let them know.  \n\nIn addition, I would just be open about the fact that you don't know what you can and cannot say and that you don't want to trigger things.  That's why you don't make comments about food or appearance.  If my partner didn't say anything about how I look, I would also be afraid that he doesn't think I'm beautiful, but if I know that he does that to help me, that's different.  In other words, talk.  Discuss your concerns and say that you are not sure what you can and cannot say, she will appreciate it.",
      "created_utc": 1710104005.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kuaq3zg",
      "author": "iwtvgirlie25",
      "body": "speaking for myself here, but my boyfriend is very good about it so here’s some things he does that i recommend:\n-helping me grocery shop (or just being there to make it easy, he also encourages me to try things when i say “oh this might be good” or “i’ve never had this before!”)\n-checking in with me on what’s good or not good (safe food/unsafe food) that week cause it’s ever changing\n-keeping stocked on snacks i like & always open about anything i eat/want/drink\n-never commenting on if something is healthy or unhealthy\n-eating with me/matching me “if you eat one bite/piece, i’ll eat the same”\ntell her she’s pretty and beautiful forever & always, don’t comment on her body per se but a nice “you look so cute today” or “i love your hair today” or “i like this outfit/dress” \nhe also often says “oh you’d look really cute in this” when we see cool clothes at stores\njust be attentive to her and try to understand her personal preference and boundaries",
      "created_utc": 1710115961.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kuix9az",
      "author": "None",
      "body": "stock up on her safe foods ! my partner currently is stocking up on my safe foods & crossing out labels / calories. also, this isn't for everyone but eat WITH her. don't just stare / watch her eat, it can make her more self conscious & some ppl feel the need to hide when they eat. maybe you both get off at 6 so have dinner WITH her around 7/730. also don't comment on how much / little she's eating. just talk about anything but food while food is in front of her. tell her about your day or a new show you are watching !",
      "created_utc": 1710253780.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kul5dhz",
      "author": "Beginning-Ad4376",
      "body": "always ask if she’d like anything when your eating. it helps bring comfort. eat a larger portion than her. communication is key, eating disorders rip apart relationships & if things get too hard for her than you may have to leave to save yourself.",
      "created_utc": 1710281048.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kubocf4",
      "author": "moveslikejagger129",
      "body": "First off, I am really happy that you care for her so much like this. I know that my bf was really supportive in my recovery, which I am still in, and it would've been much harder without him, so I commend you. I feel like the other comments have really hit the point home. I would advise against commenting on her body, even if it is positive. For people with ED's, it can be hard to accept or believe comments like that, even if they come from a place of good faith. I would recommend complimenting her on her personality or accomplishments, or something other than her physical appearance for the present moment. I would ask her what she is comfortable with discussing or not, and keeping an open and loving heart for communication is key, because sometimes we feel like we don't have people to turn to. This is all from my own personal experience, but these may be a good start :)",
      "created_utc": 1710130629.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kv2r6f1",
      "author": "princess_karis",
      "body": "This is such a beautiful gift you are giving her. I opened up to a hinge date a few years ago about my long history of disordered eating and how it ruled my life. I thought it would scare him away but he said he wanted to understand and support me. This man is now my husband and I can honestly say having him in my life was a big motivation for me to save me. Let me be clear, he did not save me by doing anything in particular other than loving me. Sometimes loving someone and holding space for them is the most precious gift.",
      "created_utc": 1710550039.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kua556y",
      "author": "Morgentau7",
      "body": "Thats a good idea! Safe foods and restaurants. Thank you for that!",
      "created_utc": 1710108105.0,
      "score": 2,
      "context": [
        {
          "id": "kua0qao",
          "author": "three6666",
          "body": "don’t force her to eat, especially on excursions/dates unless if she’s at risk of medical emergency/passing out. shoving food in our faces often makes it worse and makes us want to restrict/control more \n\nwhen she’s not in an episode or a bad mental state, ask what her safe foods / restaurants are. prioritize getting those when going out/spending time together",
          "created_utc": 1710106564.0
        }
      ]
    },
    {
      "id": "kua4z5b",
      "author": "Morgentau7",
      "body": "Thank you for your side on this! :) \n\nWe actually talk a lot and she said that I‘m the first man ever where she doesn’t feel judged, we‘re she feels safe and where she can talk openly about everything. She smiles a lot. I think we‘re on a good way. \n\nRegarding food and looks, yes those topics are difficult to phrase but I try my best. I tell her that she‘s beautiful but she knows that I also mean her character too, her as a whole. And regarding food: I enjoy food, I dont stress at all and I don’t force anything. I’m just natural, kind and caring cause thats me and it feels like I make her happy. I just dont want to do something wrong.",
      "created_utc": 1710108045.0,
      "score": 2,
      "context": [
        {
          "id": "ku9tblz",
          "author": "Warrior-Skye",
          "body": "If I were to look at myself, I would like to hear that I can go to other people with everything, without judgement.  That that person sees how hard I am working on recovery, but if things ever slow down, I can let them know.  \n\nIn addition, I would just be open about the fact that you don't know what you can and cannot say and that you don't want to trigger things.  That's why you don't make comments about food or appearance.  If my partner didn't say anything about how I look, I would also be afraid that he doesn't think I'm beautiful, but if I know that he does that to help me, that's different.  In other words, talk.  Discuss your concerns and say that you are not sure what you can and cannot say, she will appreciate it.",
          "created_utc": 1710104005.0
        }
      ]
    },
    {
      "id": "kuixsil",
      "author": "Morgentau7",
      "body": "She actually hasn’t told me about her safe foods yet. We ate Pizza together, had yogurt and cereals for breakfast and I just talked about food in a sense when I really like stuff and I comment on the taste of it in a sense of smalltalk. \nShe is in Therapy and at the end of a long process, maybe she is healed to some extent but I‘m not shure. Maybe I will start that topic next week again to learn more.",
      "created_utc": 1710253973.0,
      "score": 2,
      "context": [
        {
          "id": "kuix9az",
          "author": "None",
          "body": "stock up on her safe foods ! my partner currently is stocking up on my safe foods & crossing out labels / calories. also, this isn't for everyone but eat WITH her. don't just stare / watch her eat, it can make her more self conscious & some ppl feel the need to hide when they eat. maybe you both get off at 6 so have dinner WITH her around 7/730. also don't comment on how much / little she's eating. just talk about anything but food while food is in front of her. tell her about your day or a new show you are watching !",
          "created_utc": 1710253780.0
        }
      ]
    },
    {
      "id": "kuc2e1e",
      "author": "Warrior-Skye",
      "body": "It sounds like you're doing a really good job already!  And you are doing very well.  I would say keep it up.  \n\nI just wanted to add to my first response: I now see upon re-reading that my first sentence is not very clear when translating it.  What I meant by this is that I would like to hear from my partner so that I can always go to them with everything.  This went weird somewhere with translation",
      "created_utc": 1710139385.0,
      "score": 2,
      "context": [
        {
          "id": "ku9tblz",
          "author": "Warrior-Skye",
          "body": "If I were to look at myself, I would like to hear that I can go to other people with everything, without judgement.  That that person sees how hard I am working on recovery, but if things ever slow down, I can let them know.  \n\nIn addition, I would just be open about the fact that you don't know what you can and cannot say and that you don't want to trigger things.  That's why you don't make comments about food or appearance.  If my partner didn't say anything about how I look, I would also be afraid that he doesn't think I'm beautiful, but if I know that he does that to help me, that's different.  In other words, talk.  Discuss your concerns and say that you are not sure what you can and cannot say, she will appreciate it.",
          "created_utc": 1710104005.0
        },
        {
          "id": "kua4z5b",
          "author": "Morgentau7",
          "body": "Thank you for your side on this! :) \n\nWe actually talk a lot and she said that I‘m the first man ever where she doesn’t feel judged, we‘re she feels safe and where she can talk openly about everything. She smiles a lot. I think we‘re on a good way. \n\nRegarding food and looks, yes those topics are difficult to phrase but I try my best. I tell her that she‘s beautiful but she knows that I also mean her character too, her as a whole. And regarding food: I enjoy food, I dont stress at all and I don’t force anything. I’m just natural, kind and caring cause thats me and it feels like I make her happy. I just dont want to do something wrong.",
          "created_utc": 1710108045.0
        }
      ]
    },
    {
      "id": "kudumch",
      "author": "N1Nentity",
      "body": "The fact that she's at a place in recovery where she is able to speak vulnerably to you about it is a green flag IMO. As you're aware there's things you shouldn't say and topics to avoid. Without her ability to communicate, you'd feel like you're walking on eggshells non-stop, so I'm glad you're communicating well. EDs can really torment people and cause a great deal of dysregulation, and there's a higher likelihood of them in person's with certain other mental health issues, like borderline personality disorder.  Obviously not saying that's the case here, but one thing I wish I would've learned years ago was how deeply rooted in trauma, self-image, and self-worth EDs often are. I think having that awareness will help you show up consistently with the empathy she needs. As others have said though it sounds like you're doing well and just need to keep talking with her about it, and reading through the ED sub to understand others' experiences with it will help you too. Best of luck.",
      "created_utc": 1710173702.0,
      "score": 1,
      "context": [
        {
          "id": "ku9tblz",
          "author": "Warrior-Skye",
          "body": "If I were to look at myself, I would like to hear that I can go to other people with everything, without judgement.  That that person sees how hard I am working on recovery, but if things ever slow down, I can let them know.  \n\nIn addition, I would just be open about the fact that you don't know what you can and cannot say and that you don't want to trigger things.  That's why you don't make comments about food or appearance.  If my partner didn't say anything about how I look, I would also be afraid that he doesn't think I'm beautiful, but if I know that he does that to help me, that's different.  In other words, talk.  Discuss your concerns and say that you are not sure what you can and cannot say, she will appreciate it.",
          "created_utc": 1710104005.0
        },
        {
          "id": "kua4z5b",
          "author": "Morgentau7",
          "body": "Thank you for your side on this! :) \n\nWe actually talk a lot and she said that I‘m the first man ever where she doesn’t feel judged, we‘re she feels safe and where she can talk openly about everything. She smiles a lot. I think we‘re on a good way. \n\nRegarding food and looks, yes those topics are difficult to phrase but I try my best. I tell her that she‘s beautiful but she knows that I also mean her character too, her as a whole. And regarding food: I enjoy food, I dont stress at all and I don’t force anything. I’m just natural, kind and caring cause thats me and it feels like I make her happy. I just dont want to do something wrong.",
          "created_utc": 1710108045.0
        }
      ]
    }
  ]
}