{
  "id": "1bfl20q",
  "subreddit": "EatingDisorders",
  "author": "Ferret_Hefty",
  "created_utc": 1710527862.0,
  "title": "Any guys here with an ED? ",
  "selftext": "I’ve always been scared to open up to a therapist or anyone about my avoidant/restrictive eating habits because i’m a dude and i feel it’s treatment is catered to women and teen girls. \n\nIt’s a very confusing and difficult thing to deal with and i was just wondering if any guys here have the same issues and how do u address it?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1bfl20q/any_guys_here_with_an_ed/",
  "score": 40,
  "num_comments": 19,
  "comments": [
    {
      "id": "kv1y624",
      "author": "No_Philosophy7921",
      "body": "Im non binary, not a guy, but id like to offer some support if that’s alright. \n\nEating disorders are wildly misunderstood. They are absolutely not specific to a gender, and in many cases they have far less to do with appearance than they do with control and self harm. They’re an unhealthy coping mechanism that anybody can develop. You know this, obviously, but as a gender queer person I can relate to the idea that it feels too feminine to suffer with. That’s a stupid narrative pushed by people who don’t know the first thing about eating disorders. \n\nYou deserve help. The best thing I can think for you to do is find an eating disorder specific therapist who is already knowledgeable about them. They will understand the complexities far better than a standard therapist. In my experience, unfortunately many don’t get it. I’ve had some that have reduced it to me wanting to fit size 0 pants and it’s so insulting. The mental health care system needs a lot of work, and the shame and stigma is still very much there. \n\nStill, don’t let it discourage you from seeking help. It might be better to open up to people who you trust in your life first, so you have people on your team who can help you. I’m proud of you for taking the first step of reaching out on here. There is help available, and you will get there❤️ take care",
      "created_utc": 1710538823.0,
      "score": 17,
      "context": []
    },
    {
      "id": "kv24xwl",
      "author": "DizzyTCat",
      "body": "Bloke here. And a long way from being a teenager. To be honest, the most confusing and difficult part for me was actually when I was diagnosed with an ED - like you say, it’s just not something blokes get… </sarcasm>\n\nWhether I’ve just been lucky, but I’ve never felt judged or dismissed for being a guy by either my GP, psychiatrist or psychologist. They’ve been really good in helping me come up with ways of recovering that fit in with my life. I have been selective in who I’ve told about and limited it those who I felt would be supportive, so they understand why/if I ever feel the need to remove myself from any social situation when I’m with them.\n\nHope you feel able to reach out to a professional, and it’s as much as a relief as it was for me.",
      "created_utc": 1710541346.0,
      "score": 15,
      "context": []
    },
    {
      "id": "kv1xnhg",
      "author": "onelittlepill",
      "body": "Not a guy, but you 100% deserve the help they can provide you. I know there are a lot of guys with it, and the treatments should be available to all. Remember that a therapist is confidential, and is there for YOU. Strongly encourage you to reach out. No one should suffer this alone. 💞",
      "created_utc": 1710538634.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kv1yrrd",
      "author": "Throwaway55557783",
      "body": "Remember, guy, girl, who fucking cares. We are all human, we all have issues, and at the end of the day, humans deserve health and happiness. Trust me, fuck that stigma. Go for it. Get the help. The longer you wait the worse it gets, the less likely you are to get the help. \n\n-a 21 y/o male currently in recovery from a restrictive ED",
      "created_utc": 1710539041.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kv52q8l",
      "author": "smyles07",
      "body": "I am a guy. 32-year-old male. I have sought treatment in the past, and I actually ran into a treatment provider that only allows females. But that was only one of the providers that was like that. I was pretty shocked though. Men, eating disorders are definitely the minority, or at least the diagnosed minority. The hardest part is finding any in person group sessions. Regardless of whether you’re a male or female.\n\nMy eating disorder has run the gamut from anorexia to binge eating disorder to bulimia. I agree with everyone else, though, the nuances of everyone’s individual disorder have very little to do with gender, and more to do with other factors. Stay safe, everyone.",
      "created_utc": 1710598388.0,
      "score": 7,
      "context": []
    },
    {
      "id": "kv25la3",
      "author": "In_The_Play",
      "body": "I am a guy, and I did find it a little bit harder to be diagnosed initially, but once I was referred to the eating disorder service my treatment wasn't any difference.\n\nThere are a wide variety of different eating disorders, they present in very very different ways - I did find, as someone with ARFID, that they didn't always know what to do with me, but that wasn't to do with my gender. And they are pretty experienced at dealing with a lot of very different issues, so I would be shocked if your gender actually made a difference when it comes to treatment/therapy etc. They will have had plenty of experience of different eating disorders, with both men and women, and the different ways they can present.\n\nAt times I found it a bit challenging to talk to my friends about it because it is stereotypically feminine. But after a while I stopped caring - at the end of the day this just comes from ignorance. There shouldn't be any additional stigma around EDs for men, and anyone who thinks otherwise is just ignorant.",
      "created_utc": 1710541593.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kv53lvy",
      "author": "redditmeuser",
      "body": "Guy here.\n35 years of eating disorder.\n3 years recovered.\n\nMan. Totally felt what you meant. Felt like the whole of society only seems eating disorders as female.\nFelt like discussing was perceived as weak. Un manly.\n\nChick's don't like hearing about it on dates.\n\nStunted my size growth all my life. Unattractive quality in a man.\n\n\nGot recovered at age 35.\n\n\nYa know what man. I was wrong. People hear me talk about it now. I don't whine but I'm very honest about the experience. I make boundaries about its triggers n I enforce them quickly. People respect that. I've a few ED friends n we support each other on the bad days of it.\nA woman not like my words? FO. Not my problem. Hope your son n partner find more compassion.\nI was Into the wrong kind of women. I was into the wrong kind of thinking about my ED. I built that world of rejection based on it. \nTook time to learn. Hard lessons. Self esteem needed to be rebuilt. Now my boundaries and self respect are high enough that when some attacks it accidentally or intentionally..  I don't even consider my body or mind at fault. Bad behaviour is on them. My behaviour is on me.\n\nYou can use it to filter people who are good, compassionate, educated, supportive friends.\n\nDon't internalise the story around the ED. You got a illness that's treatable. Treat it. \nYou'd never treat a person with a treatable illness badly I bet. You'd offer them consideration.\nOffer that to yourself.\n\nGet advice. Accept help. Create spaces safe for you.",
      "created_utc": 1710598754.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kv2mpk7",
      "author": "elhazelenby",
      "body": "Yep, it sucks. I don't want recovery but never had anyone deny my problems (no diagnosis) because of my gender and was offered help by my therapist but I refused it. It does still feel isolating being a guy. Saying that I don't think anyone gets it being a guy with ED.",
      "created_utc": 1710548268.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kv4dhlu",
      "author": "Alex22451",
      "body": "I’m a trans guy and everyone online always assumes I’m a girl just because I have an ed, even when I clearly state that I’m a guy.",
      "created_utc": 1710584531.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kv4lzbb",
      "author": "Agreeable-Egg-8045",
      "body": "I am not a guy. I go to a zoom therapy group which is like peer support and there is a guy that comes pretty much every week . I hope he feels just as welcome and comfortable as everyone else. He seems to enjoy being part of the group and says he finds it very helpful. You may find there are more guys with EDs in services than you think. I hope you are able to get the support you need. If I can help in any way I will. You deserve support and I hope you get it!",
      "created_utc": 1710590267.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kv5y41p",
      "author": "trazeat",
      "body": "You're not alone. I felt the exact same way as a 22-year-old dude when I was initially seeking help. The frustration is most of the literature is tailored to females and the effects on female biology. My advice is to get help as quickly as possible because you really run the risk of letting things slip (talking from my own experience here) if you don't address it earlier on. The effects and behaviours around eating/exercise habits can become harder to break the longer you leave it.   \n\n\nMy DMs are always open if ever you need a chat. I'm 25 now and have come a long way from those tough times. I know how lonely that can feel, so please don't hesitate to reach out.",
      "created_utc": 1710610349.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kv3ta1x",
      "author": "sandopsio",
      "body": "I'm not a guy but I was in treatment for my ED and in the time that I was there, there were 20 or 30 guys. You're not alone.",
      "created_utc": 1710568940.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kvoikik",
      "author": "None",
      "body": "I'm a guy, and I feel you. Had issues with unintentional anorexia from the age of 10 until I was around 17-18. Went to a doctor about my mouth feeling like it was burning and fatigue with joint pain. A few tests later, I had to speak to a dietican who was concerned that my BMI was 16.6. I had several nutritional deficiencies going on and my white blood count was elevated. After a chat, I was told I had anorexia and needed to adjust my dietry habits. I tried for over a year and made some progress, but I always relapse eventually. Im 26 now and still dealing with it. I've realized that my issues with food stem from childhood issues and need professional help for me to overcome. That's about as far as I've got though. No idea who/where to go to for help.",
      "created_utc": 1710903438.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kv40dwa",
      "author": "furry_anus_explosion",
      "body": "I definitely had issues with it. I was anorexic for abt 4 years. In recovery and doing a lot better now. It gets better bro but it ain’t easy. I still have some habits that I haven’t kicked but I no longer restrict myself the way I used to. \n\nFor me, it was mainly a form of self punishment because I was severely depressed, and then obviously lead to body image problems. \n\nOnce I broke up with my girlfriend it got easier for me to get healthy again. Also my doctor telling me I’m borderline diabetic now because I guess it somehow causes that. \n\nDefinitely reach out bro, it does get easier. I can’t really remember what exactly changed for me, but sometime within the last year of leaving my ex I started to recover.",
      "created_utc": 1710574202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kv5n23m",
      "author": "VAS_4x4",
      "body": "Yup",
      "created_utc": 1710606266.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kv5qe8p",
      "author": "Twister2418",
      "body": "Yeah bro, we’re here.",
      "created_utc": 1710607510.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kvlblry",
      "author": "Chicanolad",
      "body": "40, M, and I just joined this group cause I am really disoriented after realizing/being diagnosed with an eating disorder. The gender thing isn’t very stigmatizing for me. But the lack of self awareness, that I feel like I was last to know, is really a hard pill to swallow. I told an old friend from Seoul about it, and she made light of it. But as I explained to her, it’s taken me 40+ years to figure out how this society has fucked with my head. There’s more of us out there than anyone realizes. I’m glad you’re here and this place is here for us to realize that",
      "created_utc": 1710862709.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kv5g6gw",
      "author": "onelittlepill",
      "body": "So sorry that you have to deal with that on top of everything else. Just know there are people out there like me, who care and wish the best for you. Eating disorders can affect anyone, and everyone who has one deserves to be able to get the help they need. The world is better with ALL of us in it. 💞",
      "created_utc": 1710603685.0,
      "score": 2,
      "context": [
        {
          "id": "kv4dhlu",
          "author": "Alex22451",
          "body": "I’m a trans guy and everyone online always assumes I’m a girl just because I have an ed, even when I clearly state that I’m a guy.",
          "created_utc": 1710584531.0
        }
      ]
    },
    {
      "id": "kv6sbo3",
      "author": "TheCatsMeowNYC",
      "body": "Just wanted to second this. My teem daughter was in an intensive out patient program last year and there were several male teens who were in the program with her. The stereotype may be it’s a female issue but EDs can happen to anyone. Hope you seek help and get on the road to recovery",
      "created_utc": 1710621719.0,
      "score": 1,
      "context": [
        {
          "id": "kv3ta1x",
          "author": "sandopsio",
          "body": "I'm not a guy but I was in treatment for my ED and in the time that I was there, there were 20 or 30 guys. You're not alone.",
          "created_utc": 1710568940.0
        }
      ]
    }
  ]
}