{
  "id": "1bsw5a6",
  "subreddit": "EatingDisorders",
  "author": "Old_Signal1507",
  "created_utc": 1711951436.0,
  "title": "Is this a common sign of ED?",
  "selftext": "I’ve experienced many symptoms but do you ever enjoy baking/cooking for other people but never eat what you’ve made? As in you purposely prepare food to be around it but don’t eat it? Can someone explain? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1bsw5a6/is_this_a_common_sign_of_ed/",
  "score": 63,
  "num_comments": 18,
  "comments": [
    {
      "id": "kxl3ex1",
      "author": "Infamous_Nobody8607",
      "body": "Hiya :) I have experienced this too. At the height of my ED I was baking and cooking multiple times a day but I would never ever eat any of it - I'd just feed it all to my parents. I think its the EDs way of eating but through other people, eating with your eyes and hands but not your mouth if that makes sense. By preparing the food and making it and then having others eat it your ED gets to be around food but control every single part of it. It could also be a way of the ED trying to compare your food intake with others by making the people around you 'eat more' than you. I'm not an expert, this is just my own experience with this and this is what it was like for me. Hope this helps, stay safe xx",
      "created_utc": 1711998438.0,
      "score": 33,
      "context": []
    },
    {
      "id": "kxjmss2",
      "author": "villxx1",
      "body": "This is so crazy because when my relationship with food started becoming worse, I found myself doing this exact thing! I’d make “healthy” banana bread or “healthy” muffins for my family but never eat them. I’d sometimes eat a little but never more than the first day I baked them. My cousin even made a comment being like “classic her always baking but never eating what she makes”",
      "created_utc": 1711980492.0,
      "score": 14,
      "context": []
    },
    {
      "id": "kxl6cc3",
      "author": "-abby-normal",
      "body": "Yes it’s common. It’s a way to experience food without eating. If you’re making the food for other people it can be a subconscious way to make sure the people you love are getting enough food because you know how much it sucks to not eat enough and also can be a way to enjoy the social/communal aspect of food without having to actually eat it.",
      "created_utc": 1711999424.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kxlghlg",
      "author": "the_cadaver_synod",
      "body": "Yes. It’s a common symptom, and one I used to experience. For me, it was a combination of getting to experience food while also showing my “control” over it. I also thought it might be a little sneaky, as in, if I’m always in the kitchen, people might not notice that I’m not eating enough because they associate me with cooking. \n\nI think biologically, no matter how sick someone is, humans want to prepare food and have that sensory experience any way they’re able to. \n\nI’ve been in recovery for almost ten years, and I still catch myself getting into really elaborate meal prep for friends/family/parties and then feeling some kind of aversion to eating the meal. This is despite the fact that I don’t restrict anymore, and have very minimal residual behavioral symptoms.",
      "created_utc": 1712002810.0,
      "score": 8,
      "context": []
    },
    {
      "id": "kxlj8sf",
      "author": "Rymdflickan",
      "body": "I LOVE baking, but I don't eat what I bake :( I give it to my parents :) wish I had the courage to eat it though",
      "created_utc": 1712003727.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kxn3g5d",
      "author": "No_Lifeguard7215",
      "body": "It’s super common for individuals with eating disorders to have obsessions with food, including cooking, collecting recipes, smelling, etc. Pretty much everything but eating it. There are studies done from years ago with prisoners of war which demonstrate that when their food intake was limited/eliminated, they focused on the idea of food, almost like an obsession. Our minds work in very interesting ways.",
      "created_utc": 1712024594.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kxqwmts",
      "author": "MercyKills333",
      "body": "I did that in high school, I never realized there was a correlation! I thought I just liked baking a lot, but now that I think about it, I only cooked a lot when I was anorexic, ever since I've recovered I've mostly felt like cooking's a chore.  🤔",
      "created_utc": 1712087557.0,
      "score": 4,
      "context": []
    },
    {
      "id": "kxlndfm",
      "author": "Interesting-Cow8131",
      "body": "Yes, this is common for those who restrict. For me, it's like I'm eating vicariously through the cooking process. And even just looking at recipes. I also cook myself a lot of food and eat very little of it at a time. Sometimes, I end up throwing some of it out cause it's gone bad",
      "created_utc": 1712005132.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxq7fkx",
      "author": "spooonfairy",
      "body": "yes. there’s a food fixation that comes with this and obsessive preparing without eating is common. i baked A LOT in hs and brought it to teachers and friends",
      "created_utc": 1712079292.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxslhys",
      "author": "degasballetsculpture",
      "body": "Yes me too, also sometimes seeing the amount of butter/sugar that would go in the entire thing would make me want to stay away because I knew I would end up eating half the tray and purge it up later",
      "created_utc": 1712110161.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kxmh7k2",
      "author": "Odd-Run3640",
      "body": "It might be common for people with eating disorders, but it’s also common for people without disordered eating to not eat what they bake or cook as well. I’ve known people who cook so much they just do it to relax or because they like cooking for other people, but don’t necessarily like to eat pastries or whatever because they would be doing so all the time. Regardless, if you’re concerned for yourself, try to nip it in the bud and speak to a mental health professional and perhaps also a nutritionist.",
      "created_utc": 1712016122.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kxyg19l",
      "author": "Trick-Ad115",
      "body": "yes, in the height of my ED, i was baking multiple times a week. i made batch of 30 cookies and only had one or two over the course of multiple days- gave away the rest. \n\nmade two loaves of brioche bread, gave away one loaf, and the other one got moldy in my fridge 😭",
      "created_utc": 1712198343.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmq30oh",
      "author": "None",
      "body": "My cousin’s daughter did this. She was 15 and her father was a professional baker and showed her how to make and ice some\nIncredible cakes and baked goods. These would be served to us all when visiting but she would never eat any.  There was a great deal of suspension of belief while everyone exclaimed over the beautiful cakes but the deeper issue remained unmentioned. She got treatment eventually and is going OK.",
      "created_utc": 1726119138.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kxkwoho",
      "author": "Big-Confidence4193",
      "body": "That alone? Not necessarily. But if you’re asking the question it’s probably best to reach out to a dietician",
      "created_utc": 1711996189.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kxrybw6",
      "author": "GodSaves24",
      "body": "Yes, I’ve experienced this too",
      "created_utc": 1712101226.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ky0uukp",
      "author": "IcyBackground5035",
      "body": "honestly thought i was the only one, i started to bake out of no where. cookies, brownies, etc. but i never ate any of it, i gave it all to my family and friends",
      "created_utc": 1712243772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kydoy2z",
      "author": "whisperingcherry",
      "body": "Yup, it’s normal! When engaging in disordered behaviour, you literally obsess over food. I used to ask my friends all the time when we could go to eat lunch, only for me to not even put food on my plate. Why? Because I got to see others eat. It’s a form of eating for your brain, cause you’re eating through others. My heart goes out to you. Don’t give up. Xx",
      "created_utc": 1712439188.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kyso308",
      "author": "Fun_Intention_5371",
      "body": "Totally normal. \n\nI like to bake, but hate to cook. \n\nI'll bake a bunch of stuff and then never touch it.",
      "created_utc": 1712683090.0,
      "score": 1,
      "context": []
    }
  ]
}