{
  "id": "1buf4h9",
  "subreddit": "EatingDisorders",
  "author": "slssasha",
  "created_utc": 1712105007.0,
  "title": "i’ve recovered ",
  "selftext": "i would just like to share my recovery story to hopefully give someone hope about recovery.\nwhen i was about ten i was on an antidepressant which caused me to gain weight. my mother was always super critical of her weight so i internalized that and that’s where my ed began. at first it was intrusive thoughts as i was cooking that would ruin my appetite which turned into skipping lunch at school and then breakfast too. it came to a point where i would walk for a few miles a day and barely eat and fast for long periods of time. this all happened from the age of 10 to 12. eventually, when i was twelve i ended up in a mental hospital for the first time and they immediately took notice of my weight (i was very underweight) and that’s when my recovery started. at first it was forced, in the mental hospital they would give me a protein shake with two meals a day. after getting out of the mental hospital i immediately went back to how i was but now my family noticed and supported me to slowly start recovery. at this point it was so mentally exhausting for me to keep up with my ed and i wanted to recover and not hate myself. it took a lot of time and effort but eventually i went back to a healthy weight and i’ve gotten a much better relationship with food and my body. i am by no means perfect with either, i still have issues with food sometimes and i don’t love my body but i’m learning to accept myself. i feel a lot better now and i’ve been in recovery for a few years now. recovery is possible and you can do it",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1buf4h9/ive_recovered/",
  "score": 40,
  "num_comments": 7,
  "comments": [
    {
      "id": "kxsmuke",
      "author": "etheiareal",
      "body": "What was the biggest thing that helped in recovery ?",
      "created_utc": 1712110701.0,
      "score": 10,
      "context": []
    },
    {
      "id": "kxsgodz",
      "author": "None",
      "body": "I'm so glad you're recovering and good luck❤️❤️",
      "created_utc": 1712108267.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kxsuyc4",
      "author": "pretty-evanescence",
      "body": "thank you so much for telling your story, this really helped me. I'm glad you're doing better!",
      "created_utc": 1712114044.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kxvd6sx",
      "author": "DutyDismal105",
      "body": "I love reading this. Gives me hope for my wife.\nThank you",
      "created_utc": 1712160317.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ky0ml8b",
      "author": "Dizzy_Resource_3620",
      "body": "I am so happy for you and I wish you all the best! You are an inspiration to others! Thank you for sharing your story.",
      "created_utc": 1712240863.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kxw9xol",
      "author": "-abby-normal",
      "body": "I am so glad you’ve recovered. Happy for you",
      "created_utc": 1712170782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "kxsn3jv",
      "author": "slssasha",
      "body": "accepting that i’ll never be perfect but that doesn’t make me unworthy and also having foods i enjoy but also are healthy. those are the two main things but there are so many different things that helped. it’s also good to have someone who understands what you’re going through and supports you",
      "created_utc": 1712110800.0,
      "score": 15,
      "context": [
        {
          "id": "kxsmuke",
          "author": "etheiareal",
          "body": "What was the biggest thing that helped in recovery ?",
          "created_utc": 1712110701.0
        }
      ]
    }
  ]
}