{
  "id": "1bwu1ck",
  "subreddit": "EatingDisorders",
  "author": "Infamous-Spinach5016",
  "created_utc": 1712353379.0,
  "title": "I feel bad",
  "selftext": "Do you ever feel guilt when other people around you notice what you’re doing/eating and then you worry that you are making them feel greedy etc for eating normal amounts? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1bwu1ck/i_feel_bad/",
  "score": 44,
  "num_comments": 10,
  "comments": [
    {
      "id": "ky9rwfa",
      "author": "44lily",
      "body": "especially when they might be going through the same thing, I dont want to upset them",
      "created_utc": 1712372145.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kybujts",
      "author": "consort_oflady_vader",
      "body": "I do the opposite. If I feel like people are watching me eat at times, my appetite drops to zero. Then, I get more self-conscious because my plate is basically full.",
      "created_utc": 1712414924.0,
      "score": 11,
      "context": []
    },
    {
      "id": "kyev5gt",
      "author": "Serpent-of-Jade",
      "body": "I’ve recently begun hating when people watch me eat and usually eat alone because I feel like someone’s gonna see me eating too much and call me fat or something. My grandparents always tell me “keep eating like that and you’ll grow big” all the time and it makes me feel horrible about my body weight. \n\nI’m basically anorexic btw.",
      "created_utc": 1712455937.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kyeqtgn",
      "author": "Effective_Advisor157",
      "body": "in my experience, people without EDs don’t think of eating/food as a competition like we do sometimes. I was always obsessed with being the person who ate the fewest at the dinner table but no one else saw food like that, they just saw me struggling.",
      "created_utc": 1712454158.0,
      "score": 5,
      "context": []
    },
    {
      "id": "kyff077",
      "author": "EconomyCourage7055",
      "body": "I definitely relate to that. I feel like i can’t ever talk about how i’m feeling because i don’t want the other person to feel bad. Like sometimes i just wanna vent about how big i feel but then i remember the people around me are bigger so i just feel horrible about myself.",
      "created_utc": 1712465304.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kymr1gb",
      "author": "Double-Seaweed417",
      "body": "i don’t usually eat in school because i’m self conscious and i have anorexia and my friend eats infront of me but i can tell that’s she’s uncomfortable. she always hides her food in her pocket and breaks tiny bits off. i have no idea what to do",
      "created_utc": 1712590605.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kyk2vi4",
      "author": "U-suck-i-rule-420",
      "body": "Literally same.",
      "created_utc": 1712540186.0,
      "score": 2,
      "context": [
        {
          "id": "kybujts",
          "author": "consort_oflady_vader",
          "body": "I do the opposite. If I feel like people are watching me eat at times, my appetite drops to zero. Then, I get more self-conscious because my plate is basically full.",
          "created_utc": 1712414924.0
        }
      ]
    },
    {
      "id": "kyycy02",
      "author": "Jaynepie_",
      "body": "the right people will listen and love and support you. it’s such a hard step to take. i recommend reaching out to someone who’s helped you during a hard time. someone who’s been there for you through something already. sometimes it’s hard to believe that someone else truly cares. that someone wants to listen and help when we’re hurting. \n  finding someone that has already been there for you before, you’ll have a different comfort level and security. you won’t feel that they’ll feel bad about themselves. they’ll feel bad because they want for you to feel good. and that’s okay. it’s showing they care for you and your well-being. allow them. i’ve told two people of my struggles. it has been VERY helpful towards my recovery thus far. \n  remember that you’re allowed to feel the way you feel. you’re allowed to want to vent your emotions. anyone who pushes you away for that isn’t worth keeping around. anyone who puts you down or makes you feel invalidated isn’t worth keeping around. you deserve people who support you at your lowest. and help you strive to reach your highest. \n  i wish you luck on your recovery ❤️ you’re not alone and you are seen.",
      "created_utc": 1712771975.0,
      "score": 2,
      "context": [
        {
          "id": "kyff077",
          "author": "EconomyCourage7055",
          "body": "I definitely relate to that. I feel like i can’t ever talk about how i’m feeling because i don’t want the other person to feel bad. Like sometimes i just wanna vent about how big i feel but then i remember the people around me are bigger so i just feel horrible about myself.",
          "created_utc": 1712465304.0
        }
      ]
    },
    {
      "id": "kyyd3ez",
      "author": "Jaynepie_",
      "body": "omg i’m sorry for the wall of text x_x",
      "created_utc": 1712772026.0,
      "score": 2,
      "context": [
        {
          "id": "kyff077",
          "author": "EconomyCourage7055",
          "body": "I definitely relate to that. I feel like i can’t ever talk about how i’m feeling because i don’t want the other person to feel bad. Like sometimes i just wanna vent about how big i feel but then i remember the people around me are bigger so i just feel horrible about myself.",
          "created_utc": 1712465304.0
        }
      ]
    }
  ]
}