{
  "id": "1bygzs0",
  "subreddit": "EatingDisorders",
  "author": "pinkman_ce",
  "created_utc": 1712527786.0,
  "title": "Realized I had an eating disorder as a kid ",
  "selftext": "So, for the moment I’ve been thinking a lot about my childhood and one main thing about it was my relationship with food. (7-11 year old)\n\n1. My parents were always screaming at me to eat « EAT » « EAT » ect.. I think this traumatized me a bit.\n2. I would make promises to myself that « I’ll never get fat, never » the idea of being fat horrified me, I didn’t understand how people could get fat and be happy. \n3. Never eating what my mom prepared me for lunch ( I would throw it away) \n4. Always separating my plate in half and negotiating with my parents on the quantity I would eat. \n5. Couldn’t eat fucking meat. I would drink water and at the same time eat, in order to be able to swallow it. \n\nWhen I started high school I started to realize how skinny I was and found my body really ugly so I decided to gain a bit of weight. \nNow I find myself too fat and try to become healthier while eating normal portions of food 🤗 (puberty hitted me like a truck)\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1bygzs0/realized_i_had_an_eating_disorder_as_a_kid/",
  "score": 45,
  "num_comments": 6,
  "comments": [
    {
      "id": "kykn83c",
      "author": "Adventurier95",
      "body": "I didn't realise my ED had developed from childhood until I spent some time with a behavioural psychologist.\n\nI was never allowed a glass of milk, I'd be told off if I was caught with one because milk was for the grown ups tea, so water only.\n\nI was the only one who had to have chicken paste in my sandwiches, everyone else got real chicken/ham and the paste was so horrible I never ate them and skipped lunch.\n\nI had a strong dislike for mushrooms but since the step mother liked them they would always be in dinner and I'd get an ear full if I asked for no mushrooms, resulted in me hardly eating dinner a lot.\n\nNo snacks ever existed for me in the house, parents had their own adult stuff, no one ever bought anything for me ever.\n\nIt was 20 years later this behavioural psychologist told me that I was essentially neglected as a child, mainly through the use of food resulting in a shitty relationship with food in general, otherwise known as an ED!",
      "created_utc": 1712549217.0,
      "score": 12,
      "context": []
    },
    {
      "id": "kyl8kih",
      "author": "Katttio",
      "body": "Honestly, it took be a good amount of thinking, and I mean actual good amount of introspection to realise that I've always had disordered eating since I was a child.\n\nMy family never really had a lot of money. We lived on the borderline of poverty for a long time. My parents are really emotionally immature and abusive. They never really knew how to 'feed' their kids and what meals to prepare for them. So, most of the time, I would eat the same thing.\nThey would buy cheap, processed food like ham, processed cheese, hotdogs etc. Mom would make homemade meals about 3 times a week, but they were always the same 4 different kinds.\n\nMost of the days, I would eat the same thing for breakfast, lunch and dinner - processed ham, bacon, cheese etc.\nMy parents never really prioritized vegetables and VERY rarely made salads and similar stuff.\n\nA lot of times, when we were at our lowest point, I'd just eat straight up bread as a meal or a snack. Just a piece of plain bread, not even toast.\n\nI was UW throughout my whole life and absolutely everyone commented on my weight and my 'skinny' features.\nIt pretty much became my identity.\n\nOnce we got a little better with money, my parents would mostly buy us cheap snacks, so I'd binge on wayyy too much sugar and little to no protein or fiber.\n\nNot only that, but my whole family was also very judgmental of everybody and would frequently secretly comment on other people's appearance and behavior. Sometimes inside the family - my dad would constantly shame my mom for 'being fat' and for 'letting herself go'. They fought a lot, both verbally and physically.\n\nIt's crazy that I thought that all of this was normal and healthy too... \n\nI'm not even sure why I wrote all of this, but maybe someone would be able to relate to my story!",
      "created_utc": 1712562838.0,
      "score": 6,
      "context": []
    },
    {
      "id": "kykj5qh",
      "author": "pathyrical",
      "body": "Just commenting on one of your points. Fat people can be perfectly happy. I was very overweight at one point in my life mostly from medical issues and partially because my weight truly did not bother me for most of my life. \n\nIt didn't stop me from finding love, having amazing friendships, getting into a really good school, or getting a really good job. You can be fat and do all of these things. Plus, you can eat good food on top. \n\n\nThe only issue with being fat outside of my own head was certain people. Some people can be mean to you if they think you are ugly. Those people are already disgusting to me and so that never really bothered me- truly good people are not like that and I only hang out with truly good people. \n\nBut yeah, in general my life before disorder was pretty happy whether I was normal or fat.",
      "created_utc": 1712547211.0,
      "score": 9,
      "context": []
    },
    {
      "id": "kyttxem",
      "author": "Jaynepie_",
      "body": "i’ve started on my journey to recovery a few months ago. since so early on i still struggle, a lot. but have ultimately made progress in my recovery. part of this for me was finding the root to my ed. i’d come to a realization that my parents were the root and cause. and it hurts me to know this. cause i know this wasn’t their intention.. i’ll provide some examples that lead me to, as a child, limit my food and hyperfixate on trying to remain skinny. \n\n1. i, at a young age, was undiagnosed with adhd. (diagnosed 2 years ago, age 18) and with that comes sensory issues. i was a picky eater (still am, but working on it). i remember being forced to stay at the table until my food was done. and i would sit there and cry because it was food that i just couldn’t bring myself to eat due to undiagnosed sensory issues as a kid. ex. parents made burgers, the burger they gave me had lots of charred spots. i hate the taste and texture of char. i sat there and cried until bedtime. ate everything but the burger. i got yelled at and went to bed with no full belly. this traumatized me\n\n2. i was maybe 10-11 years old. i remember leaving a restaurant with a full happy belly from my dinner. my belly was poking out some. as a belly does. as a child having no care about it at all. my dad continues to, in front of our whole immediate family, poke my stomach and tell me i should do some sit-ups. that my tummy was too big… that scarred me. and today i struggle the absolute most with my tummy and it’s size. if it pokes out too much, i feel disgusting. unlovable. (i now know this is untrue, but i continue to struggle because of this one experience)\n\n3. my mom, a plus sized woman, all my life has adored how skinny i was. idolizing my slim body and putting her own body down. it hurts me, to this day, to hear her talk like that. i grew up watching a beautiful plus sized woman putting herself down. wishing she was skinny like me… i felt i had to be skinny for her to love me… for she doesn’t like her plus sized body, why would she like mine (if i had one) i love fashion. i love cute clothes and putting together cute outfits. i dread showing them to her. because i feel she always compares herself to me. ex. “you’re so lucky to have the body you do, i could never pull off something cute like that. i always wished i was skinny like you”\n  this hurts me SO BAD. this hurts an extra amount because it’s my MOM 🥺 i think she’s the most beautiful woman in the world. and it hurts so badly to see her hate herself. and to compare herself to me… to me. a woman with an eating disorder…\n  and i won’t forget to mention, fashion is a passion for me. and her words make me feel i can’t pull off the outfits i want to wear if i gain weight… \n\ni’ll leave it at the 3 main points for sake of readability. but i’ve been struggling with (self diagnosed) anorexia since i was 10-12 years old. i am now 20 and currently in recovery. it is NEVER too late to recover. i know it’s a long rough journey. but i know my mind and body will thank me. and your mind and body will thank you too. if you read this, thank you for listening to part of my story to recovery. and i wish you the best in yours. \n\nyou are loved, you are beautiful, you are deserving of feeling comfortable in your body.\n\nand to the op, i believe in you wholeheartedly.",
      "created_utc": 1712697183.0,
      "score": 3,
      "context": []
    },
    {
      "id": "kyx8s9p",
      "author": "apholeswatereye",
      "body": "It took me a lot of years to realize that I developed eating disorder when I was a kid. Seeing my relatives body shaming my cousins who were fat really scarred me deep which in turn made me determined to never get fat. I loved the idea how they praised me as a thin boy. And as a kid I thought the only thing that could make me fat was food. I would often argue with my parents to not give me food. Years later during my teenage, I started getting acne and later hair fall, which people kept telling was because of puberty. Going through hacks after hacks, medications after medications didn't do a thing. My body got weaker and my bone weak. At the age of 23-24, I've realized that it was all because of this ED. Everytime I see any sign of physical ailment, or just a tiny bit of puffy face, I feel like puking all the food I eat. I feel tired most of the time, and get easily burnt if I miss eating. I'm 26 now, trying to atleast eat the amount necessary to operate my body, and consciously avoid every possibility of extra eating. I wish my relationship with food wasn't this complicated.",
      "created_utc": 1712757985.0,
      "score": 2,
      "context": []
    },
    {
      "id": "kyniukv",
      "author": "Adventurier95",
      "body": "Definitely relate to the plain bread thing, I remember putting pepper on and folding it, it was all I was allowed",
      "created_utc": 1712600400.0,
      "score": 4,
      "context": [
        {
          "id": "kyl8kih",
          "author": "Katttio",
          "body": "Honestly, it took be a good amount of thinking, and I mean actual good amount of introspection to realise that I've always had disordered eating since I was a child.\n\nMy family never really had a lot of money. We lived on the borderline of poverty for a long time. My parents are really emotionally immature and abusive. They never really knew how to 'feed' their kids and what meals to prepare for them. So, most of the time, I would eat the same thing.\nThey would buy cheap, processed food like ham, processed cheese, hotdogs etc. Mom would make homemade meals about 3 times a week, but they were always the same 4 different kinds.\n\nMost of the days, I would eat the same thing for breakfast, lunch and dinner - processed ham, bacon, cheese etc.\nMy parents never really prioritized vegetables and VERY rarely made salads and similar stuff.\n\nA lot of times, when we were at our lowest point, I'd just eat straight up bread as a meal or a snack. Just a piece of plain bread, not even toast.\n\nI was UW throughout my whole life and absolutely everyone commented on my weight and my 'skinny' features.\nIt pretty much became my identity.\n\nOnce we got a little better with money, my parents would mostly buy us cheap snacks, so I'd binge on wayyy too much sugar and little to no protein or fiber.\n\nNot only that, but my whole family was also very judgmental of everybody and would frequently secretly comment on other people's appearance and behavior. Sometimes inside the family - my dad would constantly shame my mom for 'being fat' and for 'letting herself go'. They fought a lot, both verbally and physically.\n\nIt's crazy that I thought that all of this was normal and healthy too... \n\nI'm not even sure why I wrote all of this, but maybe someone would be able to relate to my story!",
          "created_utc": 1712562838.0
        }
      ]
    }
  ]
}