{
  "id": "1cdyckt",
  "subreddit": "EatingDisorders",
  "author": "insufferablesaur",
  "created_utc": 1714169938.0,
  "title": "People do care",
  "selftext": "I first developed an eating disorder at 13 years old. I remember feeling afraid, overwhelmed, alone, and exhausted. No one could understand what I was going through, not even myself, and it felt like nobody cared.\n\n10 years later, here I am. I hadn’t relapsed in almost 5 years, but I’ve been anxious and stressed with school work, a divorce, trying to keep up with a social life, and taking care of my daughter. \n\nI felt emotions I was all too familiar with. Criticizing every piece of my body, wearing baggy clothes to hide myself, and declining invitations to hang out because I felt ashamed. And then I started restricting again. \n\nIm type 1 diabetic, so my body started getting weak very fast. I’ve been losing my balance and feeling like I’m going to faint constantly. I felt alone and unworthy again.\n\nBut then…\n\nMy daughter, my beautiful baby girl who just turned 2, walked over to me as I sat on the couch and brought me a piece of bread and said “Have some”, as she nibbled on a piece next to me. For the past 3 days, she has brought me a few pieces of food from the plates I prepare for her and she tells me “Eat some more”, and sits next to me eating.\n\nMy baby girl noticed. My baby girl felt it. And my baby girl cared, when I never thought anybody would.\n\nAnd you have someone that cares too. Maybe they’re too little to express it, maybe they’re unsure of how to talk to you, or maybe they’re a little too far away to hold you and tell you how much you mean to them, and that they want you to take care of yourself for many more years to come.\n\nBut they do. Somebody cares about you, and they will continue to while you learn to care about yourself ❤️",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1cdyckt/people_do_care/",
  "score": 51,
  "num_comments": 5,
  "comments": [
    {
      "id": "l1ic246",
      "author": "pathyrical",
      "body": "🥹🥹 that is so heartwarming. i am sending my love as well and i hope you are able to find strength in the love of those around you.",
      "created_utc": 1714230302.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l1ixrys",
      "author": "Minute_Drawer7777",
      "body": "i’m actually really overwhelmed with emotions reading that. thats so touching, i really hope both of you have a smooth change 🤍🌤️ thank you for sharing, this is so hope inducing!",
      "created_utc": 1714238433.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l1jg8dl",
      "author": "houston_veronica",
      "body": "You are a blessing to me, to all of us. This post is so moving, and I rarely feel like I can cry over a post. This one got me. I'm so proud of you for being aware and resolving to get better again. You can do this. You have a beautiful baby girl that needs you. <3",
      "created_utc": 1714245357.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l1jif2b",
      "author": "None",
      "body": "That's sweet. I'm glad that you've found some sunshine in an otherwise dark place.",
      "created_utc": 1714246196.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l1kds3w",
      "author": "Ashamed_Ad8162",
      "body": "That is so darling that your baby thought of you. Sending hugs!!",
      "created_utc": 1714258636.0,
      "score": 1,
      "context": []
    }
  ]
}