{
  "id": "1ce5puy",
  "subreddit": "EatingDisorders",
  "author": "Conscious_Minute_696",
  "created_utc": 1714191877.0,
  "title": "How long have you? ",
  "selftext": "I’ve had an ED (Bulimia) for twelve years. Wondering how how long some of you have been fighting? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1ce5puy/how_long_have_you/",
  "score": 41,
  "num_comments": 92,
  "comments": [
    {
      "id": "l1h7u21",
      "author": "Equal-Art6604",
      "body": "25 years. It's not worth it. Please get help and be fully dedicated to recovery as early as possible.",
      "created_utc": 1714209059.0,
      "score": 32,
      "context": []
    },
    {
      "id": "l1hio48",
      "author": "-Akw1224-",
      "body": "I started restricting at age 12. My mother would oink at me like a pig if I had a snack late at night. It’s been over 10 years of battling with the thoughts from childhood like that, restriction, and then binging heavily.",
      "created_utc": 1714216743.0,
      "score": 30,
      "context": []
    },
    {
      "id": "l1hgr7h",
      "author": "itfeelsgoodtoliedown",
      "body": "I developed bulimia at 17. I was active just about daily until I was 45. I managed to stop then but it rested its ugly head a little when I was about 50. I’m 54 now and have been “better “ for those 4 years. It’s a hell of a disease.\n\nEditing to add: please everybody, get help and be well <3",
      "created_utc": 1714215531.0,
      "score": 19,
      "context": []
    },
    {
      "id": "l1gvl03",
      "author": "No_Cartographer6305",
      "body": "I’ve had anorexia/atypical anorexia for around 5 years but I think a lot of the initial feelings that let to ED behaviors started years before that.",
      "created_utc": 1714199936.0,
      "score": 15,
      "context": []
    },
    {
      "id": "l1h8m3o",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1714209654.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l1iihek",
      "author": "willienelsonfan",
      "body": "I had anorexia from 10-20. I got better naturally in college and my main struggle is ARFID now. I’ve been seeing a dietician for a year and I’m making progress beyond my wildest dreams.",
      "created_utc": 1714232729.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l1hetny",
      "author": "helpmykeyboardbroken",
      "body": "i’ve cycled through 3 EDs which is pretty fun.\n\nI developed BED when I was 10 because my parents were (unknowingly) under feeding me (I was an elite athlete and was burning and insane amount of cals because I was training so much so I ended up bingeing constantly)\n\nThis translated into Bulimia when I was around 13, I stopped training as much and I was still bingeing so I gained weight and my mum made a comment about how much weight I had gained and so I transitioned to Bulimia.\n\nWhen I was 14 I was was EDNOS because I decided that the purging wasn’t doing enough and I should just stop eating. It was more of a AN/BN hybrid because I would switch back and forth really rapidly between behaviours.\n\nWhen i was early 16-late 15 I fully transitioned to anorexia but never go underweight enough to get the label so I was just ‘atypical’ which is more common but it didn’t feel ‘special’.\n\nI’ve been in semi-recovery, which just means as long as I stay within a certain weight range I don’t engage in behaviours but as soon as I go above it’s all over lmao\n\nTldr, around 9 years but multiple behaviour switches",
      "created_utc": 1714214234.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l1hpugc",
      "author": "Cute_Barnacle_2235",
      "body": "I started my ED when I was 13 and became bulimic by 15 which carried on until I turned 18, but I'm still struggling with my ED when it comes to calorie counting or restriction. Im now 22 and I'm glad I've at least managed to move past the bulimia. After extensive therapy I realised it just made me feel worse than if I just kept the food down.\nSo please make sure you reach out for help and support. You can get through this 💪",
      "created_utc": 1714220714.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l1i4bl2",
      "author": "iconicpistol",
      "body": "13 years but I've been in recovery for about 2,5 years now.",
      "created_utc": 1714227244.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l1hoo6n",
      "author": "None",
      "body": "17 years. crazy to think it’s been more than half my lifetime",
      "created_utc": 1714220112.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l1io6wd",
      "author": "MoulinSarah",
      "body": "31 years and counting",
      "created_utc": 1714234841.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l1hup7x",
      "author": "Imcrazybutimfree1",
      "body": "I started getting bad thoughts about my body and food at 8/9 and I developed anorexia at 10 and im Now 16, still not recovered I just can’t find the will to get better",
      "created_utc": 1714223096.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l1hvbvk",
      "author": "Annual-Ad9638",
      "body": "20+ years...",
      "created_utc": 1714223387.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l1i29ch",
      "author": "skinny_genes96",
      "body": "13 years & I'm fucking over it. Trying really hard to recover, but this disease is a bitch to recover from.",
      "created_utc": 1714226400.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l1io60s",
      "author": "VastReveries",
      "body": "Bulimia for 12 years as well. I'm also a qualified professional who can work at eating disorder facilities. I've been to treatment multiple times.",
      "created_utc": 1714234832.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l1hlhmz",
      "author": "obeseanimegirl",
      "body": "7 now, which is wild. Never thought id develop anorexia but i did. My mom’s side of the family all has it in secrecy (they’re all religious), and I got it from them constantly counting calories growing up. I told myself I’d never get that bad and I did anyway. Having my mom’s side of the family all being relatively thin and being the chubby kid was humiliating. Now I have my mom and dad’s side of the family all telling me to gain weight. It’s hell",
      "created_utc": 1714218395.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l1hltcf",
      "author": "topazstars",
      "body": "26 years",
      "created_utc": 1714218576.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l1i3vsn",
      "author": "m80kamikaze",
      "body": "I have no clue what is wrong with me.  I started losing weight and working out and have gotten amazing results from it but along the way I started calorie counting.  I think I take it too far and have become reluctant to eat due to it.  I know this is probably minuscule to what a lot of people deal with but it’s been messing with me hard mentally for a couple months.   I have my goal weight and getting to it is annoying and I never want to eat when the scale is giving me a number I dread.  This might be the wrong place to say this but I just wanted to get it off my chest.",
      "created_utc": 1714227066.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l1iwveo",
      "author": "LissaRiRi",
      "body": "Ive had restrictive eating disorders since 12. I'm 28 now. Not underweight enough to look sick... but the health issues are adding up. It's scary",
      "created_utc": 1714238095.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l1k8b2f",
      "author": "cryingtoelliotsmith",
      "body": "6 years but not consistently. like at times I'd be fine but then be bad again for periods",
      "created_utc": 1714256354.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l1h36ub",
      "author": "Losing_lab",
      "body": "I’ve been actually starving myself for about 4 years now but I’ve hated my body basically my whole life",
      "created_utc": 1714205531.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l1hnqj9",
      "author": "cluelesspleb_",
      "body": "since i was like 8/9? so about 6 years",
      "created_utc": 1714219620.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l1ht69f",
      "author": "Livdonna",
      "body": "Restriction started at 12 but I wasn’t formally diagnosed with an ED til 16 — doctors kept saying i’d “grow out of it” - boy, I WISH that was the case.  It’s been part of my life for 15 years & I am so sick of it",
      "created_utc": 1714222376.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l1i10bw",
      "author": "None",
      "body": "15 years give or take but the first time I purged wasn't because of ED but to get attention from my abusive parents hoping they'd care if I was sick with a stomach ache.",
      "created_utc": 1714225871.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l1iq68h",
      "author": "justsaying825",
      "body": "off and on for 23 years. very much on for the past 4.",
      "created_utc": 1714235583.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l1ivjeu",
      "author": "WhereBagel",
      "body": "20 years and it's just getting worse. I'm trying to force myself to recover now because at this point the next steps would be palliative.",
      "created_utc": 1714237597.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l1iwb7o",
      "author": "BubbleFart13",
      "body": "I've struggled with restricting and over exercising since I was around 12-13. I developed a huge problem with binge eating and working out excessively to burn it off in 2020. Now I'm trying to actually eat healthy appropriate portions and work out a normal amount.",
      "created_utc": 1714237886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l1j9b1d",
      "author": "OwlConscious703",
      "body": "40 years. Other than bulimia, I’ve cycled through them all pretty much.",
      "created_utc": 1714242735.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l1hh0be",
      "author": "Fast-alex1",
      "body": "In total about 8",
      "created_utc": 1714215695.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1i8dal",
      "author": "tr0ublematic",
      "body": "16 years, will turn 17 this year. A round of EDNOS —> AN-R —> BN —> EDNOS lol",
      "created_utc": 1714228867.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1i95f7",
      "author": "InevitableHospital38",
      "body": "12 years…",
      "created_utc": 1714229171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1j2jqi",
      "author": "None",
      "body": "its been 4 years for me, im 18 and it started at 14, went to treatment at 15. still struggling but hoping for the light at the end of the tunnel. it takes years to battle such a severe illness.",
      "created_utc": 1714240197.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1j4ob2",
      "author": "DifficultyMurky5428",
      "body": "Nine years.",
      "created_utc": 1714240985.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1j5alg",
      "author": "90scyber",
      "body": "half my life",
      "created_utc": 1714241218.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1j7rrq",
      "author": "Mysterious_Estate910",
      "body": "I had bulimia when I was 11-13, I am 14 and will be 15 in a few months. I'm not perfect or fully recovered, sometimes I slip. Sometimes I restrict. But I'm in therapy on the road to recovery.",
      "created_utc": 1714242156.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1jfd3u",
      "author": "BipolarSkeleton",
      "body": "Just shy of 15 years in and out of IP/residential/IOP/OP you name it I did it \n\nI was recovered for about 2.5 years and it took everything in me to do that but I desperately wanted to have a child but had basically never had a period I was able to get pregnant and have my son but basically relapsed immediately after giving birth now the ED is back with a tight tight grip \n\nThis is absolutely not the life I wanted I hate this disease and it kills me when I see children staring to have disordered eating",
      "created_utc": 1714245025.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1jh32d",
      "author": "-moldytoast-",
      "body": "20 years and counting",
      "created_utc": 1714245682.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1jkvf4",
      "author": "minniemoroll",
      "body": "10 years. i started restricting at 8, i’m 17 now (turning 18) \ni got diagnosed with ednos at 14 and it’s been kinda up and down ever since. :P",
      "created_utc": 1714247140.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1joj4w",
      "author": "twopillsandredwine",
      "body": "three almost four years.",
      "created_utc": 1714248555.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1js0sp",
      "author": "Sky_Maxwell",
      "body": "So far, three years…It hasn’t gotten easier for me…",
      "created_utc": 1714249892.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1js87j",
      "author": "MelloYelloMarshmello",
      "body": "I had Bulimia for 9 years. I’m 5 years without having a relapse this summer.\n\nMy teeth, tongue and throat thank me. Recently found out that having done it for so many years puts me at a high risk for throat cancer.\n\nIt was the hardest thing ever to get over and even 5 years without it I still think about it all the time. Even yesterday I was at all you can eat sushi, which was always such a big trigger. I over ate, my stomach hurt, everyone was still eating, the food looked so good. It took everything in my power not to.",
      "created_utc": 1714249971.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1jtr51",
      "author": "mothw1ng",
      "body": "Almost 20 years, I’ve had it since I was 5",
      "created_utc": 1714250565.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1jtz60",
      "author": "Lonely-Iron-1038",
      "body": "17 years :/",
      "created_utc": 1714250652.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1jvisg",
      "author": "_whatsnewpussycat_",
      "body": "I (31F) only got an actual clinical diagnosis this year for an ED, but I'd say I've been going through it for about 20 years. \n.",
      "created_utc": 1714251248.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1jvx14",
      "author": "Live_Setting_3091",
      "body": "17 years bulimia and I’m 33. Early on I had anorexic tendencies but it quickly morphed to bulimia. \n\nI am battling recovery and have had long stretches of recovery (3 year) within that 17 year. Unfortunately, I relapsed a year ago due to a personal life event. As they say…old habits die hard…. It is a very humbling experience and I am coming to terms with the urges/risk being a life long thing. I just want to be healthy.",
      "created_utc": 1714251403.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1jwc73",
      "author": "None",
      "body": "I’m 25(M) had a very bad eating disorder for 6 months then one day decided that I don’t want this to go on anymore and it’s ruining my life and am now in day 7 of recovery. It’s not been easy, but I decided enough is enough and it needs to stop. I used my family and girlfriend as motivation for myself to get better and have an actual meaning to recover. I’m still trying to get a dentist to check my teeth as they are very rough but apart from that. That was my story and it was a battle.",
      "created_utc": 1714251568.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1k1tp8",
      "author": "TrooperJordan",
      "body": "I’ve ran through “all the ED’s” (so probably EDNOS) in 13 years coming up on 14, I fucking hate it",
      "created_utc": 1714253717.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1k4k2w",
      "author": "looneylibra",
      "body": "20 years ..",
      "created_utc": 1714254815.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1k507i",
      "author": "ItsThe_____ForMe",
      "body": "I’ve been undiagnosed for 3 years so far, I’m really trying to dig myself out of the hole but I’m just surprised that no one around me has noticed.",
      "created_utc": 1714254996.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1k6ak2",
      "author": "G-OASIS",
      "body": "I had an eating disorder for 10 years. From about age 16 to 25. I had spouts of recovery but the longest I went without throwing up was maybe a few months. Luckily (that’s how I see it now), my hair started falling out from my body not getting enough nutrients. That was my final straw. \n\nI am turning 30 in six months and am so relieved with the relationship I have with food and with my body. I haven’t thrown up in almost 5 years! It was a long journey but I will always attribute it to therapy, mindfulness, yoga/meditation, intuitive eating, and SUPPORT. You should really open up about it to people in your life. They will keep you accountable and motivated. The power of vulnerability is so strong!!",
      "created_utc": 1714255520.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1kf3dp",
      "author": "Severe-Chipmunk-7828",
      "body": "since i was nine or ten",
      "created_utc": 1714259196.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1l419a",
      "author": "buginarug420",
      "body": "8 ish years anorexia and body dysmorphia. Past 1.5 years I’ve started to struggle with binging. 22 now and I’m tired of this life. Trying to get into recovery for real this time but it’s so fucking hard",
      "created_utc": 1714270125.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1l67bh",
      "author": "Menapocalypse1",
      "body": "47 years with basically an ednos",
      "created_utc": 1714271107.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1l6fxd",
      "author": "Efficient_Bagpipe_10",
      "body": "17 years and finally in recovery!!!",
      "created_utc": 1714271215.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1lfbgz",
      "author": "jarosunshine",
      "body": "34 years of lapses and pseudo recovery. This time around is absolutely the worst lapse yet, my body is so tired.",
      "created_utc": 1714275452.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1lhfsf",
      "author": "Crimson-Rose28",
      "body": "Ten years now with anorexia b/p subtype but I remember feeling fat when I was in kindergarten.",
      "created_utc": 1714276573.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1lix5x",
      "author": "incandescent_glow13",
      "body": "same here, 12 years. My bulimia has shifted in the last year though because I'm restricting alot and barely purging anymore.",
      "created_utc": 1714277383.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1mb01r",
      "author": "hotsjen",
      "body": "I've had an anorexia for 8 years. My symptoms showed up when i was 13. I had times when i could eat without much issue but they didn't last long most of the time",
      "created_utc": 1714296412.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1md20j",
      "author": "None",
      "body": "16 years.",
      "created_utc": 1714297974.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1mgw2u",
      "author": "lilithumbra",
      "body": "I had some serious issues with anorexia between 12 and 20. At 21 i gained a lot of weight but I managed to lose it in a healthy way, eating properly and going to the gym. I still worry about my body but not in the same obsessive way.",
      "created_utc": 1714300762.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1mj012",
      "author": "DandelionBouquet12",
      "body": "I’ve struggled with my eating disorder for 21 years since I was 10, and have been actively in recovery for 7 years. It’s a fight each day, but it gets easier as time goes on and going to residential treatment saved my life",
      "created_utc": 1714302199.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1ncgpj",
      "author": "yanfuwu",
      "body": "2 years",
      "created_utc": 1714316100.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1nt2yw",
      "author": "dontbitemynose",
      "body": "It's been up and down and varied for about 6 years. I see a therapist and it's gotten a bit better over time, but Ive come to accept that my relationship to food will always be challenging.",
      "created_utc": 1714322320.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1o2es5",
      "author": "Ashamed_Ad8162",
      "body": "I developed anorexia at 13. I started purging at 15, without any binging behavior. I sort of recovered at 16, during the pandemic, and relapsed into anorexia in 2021 at 18. Now, I just turned 21 and I have ARFID related to the GI issues related to my anorexia. I’ve grown up with an eating disorder and I’ve been flipping between bouts of all out disorder and glimpses of recovery for so long. I hope someday I’ll be able to look back and say I made it, I recovered, but I know that’s not super realistic.",
      "created_utc": 1714325723.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1oid3m",
      "author": "b15495",
      "body": "Purge disorder - 21 years.",
      "created_utc": 1714331472.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1p969r",
      "author": "Impossible-Tough5741",
      "body": "From 15 to 30. I’ve been recovering on and off for the last 10. Personally. Not professionally.",
      "created_utc": 1714341265.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1pia64",
      "author": "T0_mie",
      "body": "8 years with anorexia:(",
      "created_utc": 1714344853.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1rlxal",
      "author": "MeowMe40",
      "body": "My multiple EDs began around age 8 so..36 years. Although I still don't have a \"normal\" relationship with food, therapy, meds and time have all helped. I haven't had an episode in about 2 years. 🎉",
      "created_utc": 1714386298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1sbp0h",
      "author": "bleep_bloop_bluup",
      "body": "\n\nI started restricting in 7th grade, and now I'm in senior high, and I hate it. It's like a tiresome cycle of resting that I'm getting tired of. I was a chubby kid growing up getting bullied being called fat and a pig but I never dwell on that because eating feels good, and I grew up in a household where there's lots of food and there's no shame in eating a lot. But then when I started high school everything started. The restriction started at first. I started not eating breakfast, then I purposely made my lunch smaller, and yes, it did make me lose weight. I got compliments and I love it, so every Saturday and Sunday I would only eat lunch and dinner. The snacks that I often eat, I cut them down, my portion size got smaller not only for lunch but also for dinner. Then pandemic strikes. I don't know what happened but I ate then ate then ate then ate, then I didn't realize I was enormous. I was big, the biggest that I've been. I realized this when the ban had been lifted when I was called fat and shamed for it. So this is where it got worse. I searched a lot of ways to lose weight then I found a lot of ideas but then I learned about calorie counting and those apps that help you with it. At first it was not toxic. I started at 1500 calories but then I want fat change so I lowered it to 1300 but then I want to fasten my weight from 1500, it become 500 calorie then I started exercising rigorously while fasting then I did lose weight weight I was very happy about it I feel the sense of accomplishment that I love so much and in those times I would watch movies, k-dramas and videos of people having eating disorder and Instead of looking at their suffering I was looking at their body at how skinny they were and how many years and months did it take so I can do it to then school started I was not able to do the things I been doing so I stopped it but then someone told me that I was starting to get fat again and I saw the people around me too they were very skinny and I wanted to like them so I started again I would fast for 20 hours and eating so little then I lost weight I become skinnier than before and every time I look at the mirror and pictures I feel so accomplished and very happy yet it's not enough I started doing those HIIT workouts and would exercise till I drop I would lose 1000 calories for doing HIIT workouts and I started eating a lot and would feel guilty and it's tiring so tiring.\n\n( I'm sorry for my grammar and punctuation I didn't proofread this because it hurts so much)",
      "created_utc": 1714398868.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1t8e6c",
      "author": "LilEarthquakes86",
      "body": "27 years. Started at 11, and I’m 38 now.",
      "created_utc": 1714410302.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1uf7g1",
      "author": "Ok-Tourist-1615",
      "body": "On and off since I’ve been 10, so about 15 years ",
      "created_utc": 1714424974.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1uipi5",
      "author": "I_need_to_vent44",
      "body": "It's hard to pinpoint it. I first started to hate my body and think of it as too big when I was about 8 or 9 years old. I didn't count calories until I was 14 but I would skip meals on purpose and throw my school lunch and snack out when I was as young as 8. At 14 I started counting for the first time. The symptoms went kinda into the background after a year because of other stuff like auditory hallucinations so I had other stuff to deal with, and I got way worse in the ED department at around 18 or 19 years old. I'm 22 now and it's still a horrible battle. \n\n\n\nDoesn't help that I'm not formally diagnosed and most psychiatrists mock me because I'm a trans guy. They say that I have to pick one - I can either have an eating disorder but they'll treat me as a woman and think of me as such or I can be a man but men don't have eating disorders.",
      "created_utc": 1714426223.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1uveh8",
      "author": "None",
      "body": "7 years and i’m 15",
      "created_utc": 1714431014.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1xfdul",
      "author": "Trustissues_ky",
      "body": "I have anorexia b/p type I’m 24 now and started when i was 16 so 8 years. Trying some sort of treatment I’m praying it works so done living like this",
      "created_utc": 1714478785.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1xucrw",
      "author": "C0rpseBr1deB1tch",
      "body": "I was 13 or 12 when I started restricting food, I’m 17 now.",
      "created_utc": 1714485122.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l206rp9",
      "author": "None",
      "body": "16 years",
      "created_utc": 1714514374.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l231nhi",
      "author": "Flora2941",
      "body": "16 years now, but trying to recover",
      "created_utc": 1714567143.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l23c3bq",
      "author": "waist_ed",
      "body": "I started making myself puke when I was 12. Diagnosed with anorexia B/P subtype. I’ll be 30 this year and although I’m weight restored I still restrict and purge when I feel overly full. The secrecy and sneaking around my partner is the worst part, besides the dental bills!",
      "created_utc": 1714571462.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l3emjlv",
      "author": "Vitikarm",
      "body": "6 years. Started in elementary school and now I’m about to go to college. I recovered for 3 years, but there has always been constant thoughts of restricting and relapsing. It truly sticks with you no matter what…",
      "created_utc": 1715331293.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l1j44dm",
      "author": "Conscious_Minute_696",
      "body": "I recently got into therapy. Thank you. What do you mean by it’s not worth it?",
      "created_utc": 1714240778.0,
      "score": 4,
      "context": [
        {
          "id": "l1h7u21",
          "author": "Equal-Art6604",
          "body": "25 years. It's not worth it. Please get help and be fully dedicated to recovery as early as possible.",
          "created_utc": 1714209059.0
        }
      ]
    },
    {
      "id": "l1jcfpe",
      "author": "clelnn",
      "body": "oh my , I’m so sorry hun :( ❤️ little u didn’t deserve that at all",
      "created_utc": 1714243920.0,
      "score": 8,
      "context": [
        {
          "id": "l1hio48",
          "author": "-Akw1224-",
          "body": "I started restricting at age 12. My mother would oink at me like a pig if I had a snack late at night. It’s been over 10 years of battling with the thoughts from childhood like that, restriction, and then binging heavily.",
          "created_utc": 1714216743.0
        }
      ]
    },
    {
      "id": "l1jwj4u",
      "author": "_whatsnewpussycat_",
      "body": "I'm so sorry this happened to you. I can definitely relate though. My mom was also a big catalyst for my ED. She had me doing cabbage soup diets in like 6th grade and then just continued to encourage some pretty disordered behaviors. She went as far as \"allowing\" me to taste a brownie as long as I spit it out and didn't swallow any. She even stood next to the trash can to make sure...I was 24.  I'm in recovery now for BED . For reference, I'm 31 now.",
      "created_utc": 1714251642.0,
      "score": 7,
      "context": [
        {
          "id": "l1hio48",
          "author": "-Akw1224-",
          "body": "I started restricting at age 12. My mother would oink at me like a pig if I had a snack late at night. It’s been over 10 years of battling with the thoughts from childhood like that, restriction, and then binging heavily.",
          "created_utc": 1714216743.0
        }
      ]
    },
    {
      "id": "l1hh3i0",
      "author": "Fast-alex1",
      "body": "You’re so strong can’t imagine what your body went through and your mental state as well",
      "created_utc": 1714215754.0,
      "score": 7,
      "context": [
        {
          "id": "l1hgr7h",
          "author": "itfeelsgoodtoliedown",
          "body": "I developed bulimia at 17. I was active just about daily until I was 45. I managed to stop then but it rested its ugly head a little when I was about 50. I’m 54 now and have been “better “ for those 4 years. It’s a hell of a disease.\n\nEditing to add: please everybody, get help and be well <3",
          "created_utc": 1714215531.0
        }
      ]
    },
    {
      "id": "l1j4cr4",
      "author": "Conscious_Minute_696",
      "body": "I hope things get better for you 💕 sending you love and support.",
      "created_utc": 1714240864.0,
      "score": 2,
      "context": [
        {
          "id": "l1h8m3o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1714209654.0
        }
      ]
    },
    {
      "id": "l1m9fgf",
      "author": "Thebest_122",
      "body": "Me too I have experienced it all I feel like and I am only 16.",
      "created_utc": 1714295215.0,
      "score": 3,
      "context": [
        {
          "id": "l1hetny",
          "author": "helpmykeyboardbroken",
          "body": "i’ve cycled through 3 EDs which is pretty fun.\n\nI developed BED when I was 10 because my parents were (unknowingly) under feeding me (I was an elite athlete and was burning and insane amount of cals because I was training so much so I ended up bingeing constantly)\n\nThis translated into Bulimia when I was around 13, I stopped training as much and I was still bingeing so I gained weight and my mum made a comment about how much weight I had gained and so I transitioned to Bulimia.\n\nWhen I was 14 I was was EDNOS because I decided that the purging wasn’t doing enough and I should just stop eating. It was more of a AN/BN hybrid because I would switch back and forth really rapidly between behaviours.\n\nWhen i was early 16-late 15 I fully transitioned to anorexia but never go underweight enough to get the label so I was just ‘atypical’ which is more common but it didn’t feel ‘special’.\n\nI’ve been in semi-recovery, which just means as long as I stay within a certain weight range I don’t engage in behaviours but as soon as I go above it’s all over lmao\n\nTldr, around 9 years but multiple behaviour switches",
          "created_utc": 1714214234.0
        }
      ]
    },
    {
      "id": "l1ujwen",
      "author": "I_need_to_vent44",
      "body": "Oh yeah I feel you on the weight range. But my problem is that I also very adamantly refuse to weigh myself (it's a huge trigger because my grandparents would regularly weigh me when I was a kid and my grandma would have unpleasant comments about my weight if she didn't like the number and would praise me if it was low enough), which means that I tell if I crossed that weight range only by feel. Which is not correct sometimes.",
      "created_utc": 1714426657.0,
      "score": 1,
      "context": [
        {
          "id": "l1hetny",
          "author": "helpmykeyboardbroken",
          "body": "i’ve cycled through 3 EDs which is pretty fun.\n\nI developed BED when I was 10 because my parents were (unknowingly) under feeding me (I was an elite athlete and was burning and insane amount of cals because I was training so much so I ended up bingeing constantly)\n\nThis translated into Bulimia when I was around 13, I stopped training as much and I was still bingeing so I gained weight and my mum made a comment about how much weight I had gained and so I transitioned to Bulimia.\n\nWhen I was 14 I was was EDNOS because I decided that the purging wasn’t doing enough and I should just stop eating. It was more of a AN/BN hybrid because I would switch back and forth really rapidly between behaviours.\n\nWhen i was early 16-late 15 I fully transitioned to anorexia but never go underweight enough to get the label so I was just ‘atypical’ which is more common but it didn’t feel ‘special’.\n\nI’ve been in semi-recovery, which just means as long as I stay within a certain weight range I don’t engage in behaviours but as soon as I go above it’s all over lmao\n\nTldr, around 9 years but multiple behaviour switches",
          "created_utc": 1714214234.0
        }
      ]
    },
    {
      "id": "l1m9w4x",
      "author": "Thebest_122",
      "body": "It’s difficult definitely at being 16. I have been struggling because of being in high school a lot of girls talk about not eating as if they are better than everyone. Yes ITS HARD to get better and want to but seeing we are the same age I understand. The thing that has helped me is thinking of my future. For me it’s being able to help others. I know it’s also hard to see a future for yourself but I can’t sit here and say that it will get better but I can say you have a future. I really do hope for you that you can find a will to want to get better. I hope you have a good day!!!",
      "created_utc": 1714295565.0,
      "score": 1,
      "context": [
        {
          "id": "l1hup7x",
          "author": "Imcrazybutimfree1",
          "body": "I started getting bad thoughts about my body and food at 8/9 and I developed anorexia at 10 and im Now 16, still not recovered I just can’t find the will to get better",
          "created_utc": 1714223096.0
        }
      ]
    },
    {
      "id": "l1ikvrj",
      "author": "None",
      "body": "EDs come in many different forms, you’re no less valid than anyone else. As someone who’s battled with restriction basically my entire life it’s nothing but pain and I hope you’re ok",
      "created_utc": 1714233611.0,
      "score": 3,
      "context": [
        {
          "id": "l1i3vsn",
          "author": "m80kamikaze",
          "body": "I have no clue what is wrong with me.  I started losing weight and working out and have gotten amazing results from it but along the way I started calorie counting.  I think I take it too far and have become reluctant to eat due to it.  I know this is probably minuscule to what a lot of people deal with but it’s been messing with me hard mentally for a couple months.   I have my goal weight and getting to it is annoying and I never want to eat when the scale is giving me a number I dread.  This might be the wrong place to say this but I just wanted to get it off my chest.",
          "created_utc": 1714227066.0
        }
      ]
    },
    {
      "id": "l2509cp",
      "author": "Old_Variation_7699",
      "body": "It's an evil cycle... More working out less food...\nPlease stop while you can! I know I'm terminal.  I'm a 45 year old woman who has lost her colon due to laxative abuse. I've lost half a lung due to my immune system being weak. I developed a fungus that grew in my lung. And it came back exactly 1 year later. I take a stupid amount of potassium just to keep my heart beating.\nAnd with all that, you'd think I would stop. But I can't and sadly enough, I don't want to. I'm at my lowest weight & weakest state. It has its hands around my throat and ill only be free when I am gone... only for the beast to take another prisoner.",
      "created_utc": 1714592315.0,
      "score": 1,
      "context": [
        {
          "id": "l1sbp0h",
          "author": "bleep_bloop_bluup",
          "body": "\n\nI started restricting in 7th grade, and now I'm in senior high, and I hate it. It's like a tiresome cycle of resting that I'm getting tired of. I was a chubby kid growing up getting bullied being called fat and a pig but I never dwell on that because eating feels good, and I grew up in a household where there's lots of food and there's no shame in eating a lot. But then when I started high school everything started. The restriction started at first. I started not eating breakfast, then I purposely made my lunch smaller, and yes, it did make me lose weight. I got compliments and I love it, so every Saturday and Sunday I would only eat lunch and dinner. The snacks that I often eat, I cut them down, my portion size got smaller not only for lunch but also for dinner. Then pandemic strikes. I don't know what happened but I ate then ate then ate then ate, then I didn't realize I was enormous. I was big, the biggest that I've been. I realized this when the ban had been lifted when I was called fat and shamed for it. So this is where it got worse. I searched a lot of ways to lose weight then I found a lot of ideas but then I learned about calorie counting and those apps that help you with it. At first it was not toxic. I started at 1500 calories but then I want fat change so I lowered it to 1300 but then I want to fasten my weight from 1500, it become 500 calorie then I started exercising rigorously while fasting then I did lose weight weight I was very happy about it I feel the sense of accomplishment that I love so much and in those times I would watch movies, k-dramas and videos of people having eating disorder and Instead of looking at their suffering I was looking at their body at how skinny they were and how many years and months did it take so I can do it to then school started I was not able to do the things I been doing so I stopped it but then someone told me that I was starting to get fat again and I saw the people around me too they were very skinny and I wanted to like them so I started again I would fast for 20 hours and eating so little then I lost weight I become skinnier than before and every time I look at the mirror and pictures I feel so accomplished and very happy yet it's not enough I started doing those HIIT workouts and would exercise till I drop I would lose 1000 calories for doing HIIT workouts and I started eating a lot and would feel guilty and it's tiring so tiring.\n\n( I'm sorry for my grammar and punctuation I didn't proofread this because it hurts so much)",
          "created_utc": 1714398868.0
        }
      ]
    },
    {
      "id": "l1jj79b",
      "author": "Equal-Art6604",
      "body": "I'm happy to hear that you got into therapy! That’s wonderful! I mean that having an eating disorder is not worth the devastation that it can/will have on one’s life. \n\nSorry, my response was sort of a message to everyone. At 41, if I could go back in time and tell my 16-year-old self to get help right away, I would. I would show that girl so much love and compassion.",
      "created_utc": 1714246499.0,
      "score": 19,
      "context": [
        {
          "id": "l1h7u21",
          "author": "Equal-Art6604",
          "body": "25 years. It's not worth it. Please get help and be fully dedicated to recovery as early as possible.",
          "created_utc": 1714209059.0
        },
        {
          "id": "l1j44dm",
          "author": "Conscious_Minute_696",
          "body": "I recently got into therapy. Thank you. What do you mean by it’s not worth it?",
          "created_utc": 1714240778.0
        }
      ]
    },
    {
      "id": "l1m9j5q",
      "author": "helpmykeyboardbroken",
      "body": "That sucks, I hope everything gets better for you, sending you lots of positive vibes and all the good shit :)",
      "created_utc": 1714295293.0,
      "score": 2,
      "context": [
        {
          "id": "l1hetny",
          "author": "helpmykeyboardbroken",
          "body": "i’ve cycled through 3 EDs which is pretty fun.\n\nI developed BED when I was 10 because my parents were (unknowingly) under feeding me (I was an elite athlete and was burning and insane amount of cals because I was training so much so I ended up bingeing constantly)\n\nThis translated into Bulimia when I was around 13, I stopped training as much and I was still bingeing so I gained weight and my mum made a comment about how much weight I had gained and so I transitioned to Bulimia.\n\nWhen I was 14 I was was EDNOS because I decided that the purging wasn’t doing enough and I should just stop eating. It was more of a AN/BN hybrid because I would switch back and forth really rapidly between behaviours.\n\nWhen i was early 16-late 15 I fully transitioned to anorexia but never go underweight enough to get the label so I was just ‘atypical’ which is more common but it didn’t feel ‘special’.\n\nI’ve been in semi-recovery, which just means as long as I stay within a certain weight range I don’t engage in behaviours but as soon as I go above it’s all over lmao\n\nTldr, around 9 years but multiple behaviour switches",
          "created_utc": 1714214234.0
        },
        {
          "id": "l1m9fgf",
          "author": "Thebest_122",
          "body": "Me too I have experienced it all I feel like and I am only 16.",
          "created_utc": 1714295215.0
        }
      ]
    },
    {
      "id": "l1wxoby",
      "author": "helpmykeyboardbroken",
      "body": "same here, I try not to weigh myself but sometimes the body dysmorphia is too much",
      "created_utc": 1714467879.0,
      "score": 2,
      "context": [
        {
          "id": "l1hetny",
          "author": "helpmykeyboardbroken",
          "body": "i’ve cycled through 3 EDs which is pretty fun.\n\nI developed BED when I was 10 because my parents were (unknowingly) under feeding me (I was an elite athlete and was burning and insane amount of cals because I was training so much so I ended up bingeing constantly)\n\nThis translated into Bulimia when I was around 13, I stopped training as much and I was still bingeing so I gained weight and my mum made a comment about how much weight I had gained and so I transitioned to Bulimia.\n\nWhen I was 14 I was was EDNOS because I decided that the purging wasn’t doing enough and I should just stop eating. It was more of a AN/BN hybrid because I would switch back and forth really rapidly between behaviours.\n\nWhen i was early 16-late 15 I fully transitioned to anorexia but never go underweight enough to get the label so I was just ‘atypical’ which is more common but it didn’t feel ‘special’.\n\nI’ve been in semi-recovery, which just means as long as I stay within a certain weight range I don’t engage in behaviours but as soon as I go above it’s all over lmao\n\nTldr, around 9 years but multiple behaviour switches",
          "created_utc": 1714214234.0
        },
        {
          "id": "l1ujwen",
          "author": "I_need_to_vent44",
          "body": "Oh yeah I feel you on the weight range. But my problem is that I also very adamantly refuse to weigh myself (it's a huge trigger because my grandparents would regularly weigh me when I was a kid and my grandma would have unpleasant comments about my weight if she didn't like the number and would praise me if it was low enough), which means that I tell if I crossed that weight range only by feel. Which is not correct sometimes.",
          "created_utc": 1714426657.0
        }
      ]
    },
    {
      "id": "l1mrc6h",
      "author": "None",
      "body": "ditto❤️",
      "created_utc": 1714307082.0,
      "score": 2,
      "context": [
        {
          "id": "l1h7u21",
          "author": "Equal-Art6604",
          "body": "25 years. It's not worth it. Please get help and be fully dedicated to recovery as early as possible.",
          "created_utc": 1714209059.0
        },
        {
          "id": "l1j44dm",
          "author": "Conscious_Minute_696",
          "body": "I recently got into therapy. Thank you. What do you mean by it’s not worth it?",
          "created_utc": 1714240778.0
        },
        {
          "id": "l1jj79b",
          "author": "Equal-Art6604",
          "body": "I'm happy to hear that you got into therapy! That’s wonderful! I mean that having an eating disorder is not worth the devastation that it can/will have on one’s life. \n\nSorry, my response was sort of a message to everyone. At 41, if I could go back in time and tell my 16-year-old self to get help right away, I would. I would show that girl so much love and compassion.",
          "created_utc": 1714246499.0
        }
      ]
    }
  ]
}