{
  "id": "1cl4sdp",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1714951948.0,
  "title": "I’m here to say it gets better. ",
  "selftext": "I’m here to say it gets better.\n\nI’m a Gen Z - I was a teen during the instagram/youtube/tumblr/pornhub era that was the 2010s.\nI grew up during the first wave of social media culture. While beauty standards have existed for ages and ages, the digital age has pushed eating disorders onto us in a particularly visually deceptive, falsely glamorizing, and inescapable way. Social media fosters eating disorders for all genders.\n\nI’m here to say that at 23 years old, I am out of the woods and have been in a linear recovery pattern for years now. I look back at my teenage eating disorder and sigh a breath of relief that I am no where near that tremendously dark place anymore. I’ve come so far. \n\nYou have so much to look forward to!\n\nSomething I’ve noticed, that comes with mental maturity after committing to recovery, is that I simply do not torture myself like I used to. \nIt was bad - counting every calorie, using more than half my brain everyday planning every single meal and exercise routine - my lack of confidence made me miss out on so much in my teens. (Listen to the song Teen Idle by Marina and the Diamonds) \nUsing all my alone time to think so much about something as meaningless and shallow as my body and diet made me a less interesting and intelligent person than I otherwise could have been. \n\nI do occasionally get swept under the tide, but I can’t entertain the torture and negativity for longer than 10-15 minutes.\nI know that as I age and mature in this perspective, I will have less and less patience for the negative thoughts.\n\nRecovery can last your whole life. It can be your new religion.\n\nI say no to myself every time I slip up. When I temporarily slip into the fantasy of imagining myself as an immortally skinny, youthful person, I don’t stay there for long. It doesn’t even hit the way it used to - it’s genuinely not my dream anymore. I brush off those thoughts as completely stupid, sheeplike, and meaningless - nothing but a self-sabotaging distraction on my path towards happiness and joy. \n\nI do not lie to myself as much anymore. I have developed true boundaries with myself when it comes to stupid body criticisms, letting diet culture in, and any other thoughts that feel like getting sucked into that dark eating disorder black hole that’s been orbiting my solar system since puberty. \n\nI don’t care about my weight - there’s nothing wrong with it. I feel drop dead gorgeous most of the time, even through my frequent weight fluctuations, because I have completely accepted them as a part of being a human on earth, going through seasons and aging. \n\nUltimately, I don’t want to just be another pretty face. I want to be someone unique, with talent, passion, and wisdom. So many pretty faces end up just being pretty faces and nothing more, until they are no longer even that - I’d rather use my time putting beauty to the side and focusing on developing passions, skills, and finding a love for life outside of my own shallow, fleeting looks. \n\nIt gets better, but of course, there’s times where your traumatic ED may come up again. For me, it was the last few months of a difficult relationship where I felt our love slowly die and wither away. My ED also came up during my first few months living alone while I had an abusive boss at work. Over-focusing on my body was a familiar escape from the pain of what I was going through. \nI also still struggle before planned events and vacations, but the difference now is that I am so much quicker to accept myself and shine regardless. Even in my darkest, most stressful times when I feel triggered and vulnerable to slip into my ED, I still don’t spend as much brain power focused on my ED like I did in my teens. I also don’t really let the ED go beyond my thoughts anymore-I haven’t dieted in years. I don’t let the thoughts affect my behavior or routine. Sometimes I might grab for something a bit more modest to wear if I feel that would make me most comfortable, but I never let the ED stop me from going out and living my life. \n\nMy ED will never be as bad as it once was again, I know it. I just got so sick and tired of being MISERABLE. Sick and tired.\n\nI know exactly why many young teenagers raised by the internet struggle with eating disorders, because I was one of them. I read this subreddit sometimes and I remember how terrible everything once was. I wanted to send words of love and encouragement to anybody still in that place. You will one day love your body so much more. You will look back at pictures and realize you looked totally fine and cute and normal.\n\n\n\n\nOne thing though: relearning how to take care of yourself and eat in a structured manner is extremely hard. I wish I had focused on eating breakfast in my teen years instead of dieting so maybe it would be more of a habit now. I live alone and sometimes I neglect my nutritional needs because I’m simply not disciplined in having 3 meals at the same time everyday bc I was constantly dieting for years until I was 20. I still eat enough, of course!!!! but sometimes I wonder if I’d notice an improvement in mental health and productivity if I could stick to regularly eating 3 medium meals a day at distinct times like a normal person. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1cl4sdp/im_here_to_say_it_gets_better/",
  "score": 37,
  "num_comments": 8,
  "comments": [
    {
      "id": "l2t59bq",
      "author": "Equal-Judge8142",
      "body": "I am 24 and I feel as though this was written by someone with many more years of wisdom than I have. I am not committed to recovery yet, but I will make an effort to come back and read this when things get really bad. As someone who has struggled with my ED for almost a decade, and the gravitational pull you can feel from having that planet circling in your solar system; I want to say that I am happy for your recovery and determination towards a brighter, healthier future. I sincerely wish you inner and outer peace in your life as you go forward. 💕",
      "created_utc": 1714989892.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l2ssn5p",
      "author": "giselleepisode234",
      "body": "This is so helpful to me! I grew up in the same era and I can relate to it",
      "created_utc": 1714980256.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l2ugzq3",
      "author": "RisingPhoenix603",
      "body": "So happy to hear you are recovering! Great job. I’m 50 and got anorexia,bulimia when my husband walked out of our 20 year marriage for no reason. They called it trauma based or something like that. My hearts failing, my liver is junk. My platelets are -101 as of Wednesday. No help in my area. I live doing everything you said. Counting,restricting,planning. I’m so tired. I have an expiration date cuz I can’t do this anymore.",
      "created_utc": 1715011229.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l3ilj01",
      "author": "FallsFire",
      "body": "I’m glad you made this post. Some days are way harder than others. I’m 23 and I still don’t eat 3 full meals a day as much as I used to. I was in a terrible car accident last July which caused my boyfriend and I to rollover in his truck multiple times. we are okay now but my eating habits have changed. I don’t know if is a trauma induced eating disorder but after all of that I was terrified of eating. I lost about 50-60 pounds. I was hardly eating because I was scared or I wasn’t hungry. Things are finally starting to get better. trauma is a hard thing to deal with but I’m still kicking. I am finally eating more and snacking and eating breakfast. Thank you for sharing your personal story. You are so strong. You got this ! 💞",
      "created_utc": 1715390694.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l2u5shw",
      "author": "None",
      "body": "Thank you for your well wishes ♥️\nI’m so glad this resonated with you, I made this post for people to read when they are struggling so that they can feel loved and understood. \n\nI understand how hard it is to truly stop - but the commitment to recovery will be made when the time is right for you. It will be a no-brainer. You will intimately know that you cannot keep doing this anymore and you have no choice but to love yourself. I wish you so well ♥️",
      "created_utc": 1715007230.0,
      "score": 2,
      "context": [
        {
          "id": "l2t59bq",
          "author": "Equal-Judge8142",
          "body": "I am 24 and I feel as though this was written by someone with many more years of wisdom than I have. I am not committed to recovery yet, but I will make an effort to come back and read this when things get really bad. As someone who has struggled with my ED for almost a decade, and the gravitational pull you can feel from having that planet circling in your solar system; I want to say that I am happy for your recovery and determination towards a brighter, healthier future. I sincerely wish you inner and outer peace in your life as you go forward. 💕",
          "created_utc": 1714989892.0
        }
      ]
    },
    {
      "id": "l2u38dw",
      "author": "None",
      "body": "It’s so hard, but we are in this together ♥️",
      "created_utc": 1715006298.0,
      "score": 2,
      "context": [
        {
          "id": "l2ssn5p",
          "author": "giselleepisode234",
          "body": "This is so helpful to me! I grew up in the same era and I can relate to it",
          "created_utc": 1714980256.0
        }
      ]
    },
    {
      "id": "l2ul7l4",
      "author": "None",
      "body": "The neurotic ED cyclical behavior is so so so exhausting and torturous. Your situation seems genuinely heartbreaking and traumatic. If you can get through this, you can get through anything.\n\nJust like your username - you’re a phoenix that can rise from the ashes! \n“You can’t rise from the ashes until you burn the house down.” - a quote from a song called Burn The House Down by Kimberly Perry. \nI think you might really like this song (and album). I believe Kimberly Perry wrote it about her divorce. \n[Burn the House Down by Kimberly Perry](https://open.spotify.com/track/5KpQarJoKOCoeBVgzowmPD?si=YeAvFEBjRXuXkjck61-4mQ)",
      "created_utc": 1715012715.0,
      "score": 2,
      "context": [
        {
          "id": "l2ugzq3",
          "author": "RisingPhoenix603",
          "body": "So happy to hear you are recovering! Great job. I’m 50 and got anorexia,bulimia when my husband walked out of our 20 year marriage for no reason. They called it trauma based or something like that. My hearts failing, my liver is junk. My platelets are -101 as of Wednesday. No help in my area. I live doing everything you said. Counting,restricting,planning. I’m so tired. I have an expiration date cuz I can’t do this anymore.",
          "created_utc": 1715011229.0
        }
      ]
    },
    {
      "id": "l2vmka7",
      "author": "giselleepisode234",
      "body": "Thank you for your kind words :)",
      "created_utc": 1715025696.0,
      "score": 1,
      "context": [
        {
          "id": "l2ssn5p",
          "author": "giselleepisode234",
          "body": "This is so helpful to me! I grew up in the same era and I can relate to it",
          "created_utc": 1714980256.0
        },
        {
          "id": "l2u38dw",
          "author": "None",
          "body": "It’s so hard, but we are in this together ♥️",
          "created_utc": 1715006298.0
        }
      ]
    }
  ]
}