{
  "id": "1crblbc",
  "subreddit": "EatingDisorders",
  "author": "vibincyborg",
  "created_utc": 1715637213.0,
  "title": "i make sure everyone around me is eating well not because i care but because im selfish",
  "selftext": "okay so yeah as the title says i often find myself being super aware of others eating habits and making sure that they eat properly but i feel awful every time because the only reason i do it is because i know if they eat less than me and i notice them losing weight faster than me (whether it be from intentional starvation or just happenstance) then i develop this really intense jealousy that just doesn't disappear. does anyone else feel this? and how do you deal with it",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1crblbc/i_make_sure_everyone_around_me_is_eating_well_not/",
  "score": 65,
  "num_comments": 10,
  "comments": [
    {
      "id": "l3y8yde",
      "author": "Relevant-Yak-204",
      "body": "Oh my god. I thought I was the only one. I make sure people eat cuz I love to abstractly feed myself though seeing others eat what I can’t. But I also make sure they are fed cuz deep down, I don’t want them to get thinner. Not for them to get bigger but to stay their weight and not get thinner. I get so annoyed when one of my friends would say “I haven’t eaten” and it’s 3pm. Or once they asked what they eat during their break at work and they said “just water haha.” Like ok congrats you don’t have an appetite. And I would get mad I would have an appetite. And then I would feel guilty for getting mad. Cuz to be it sounds like a badge of honor or a boast and in my worst, I would feel so good and proud people knew me as the person who didn’t eat. So it’s this jealousy that others are trying to be this person. ED’s are such a fucked up mental illness. How to deal with it? I don’t know. I just try my best when I get these emotions to ignore them and block them out. I honestly don’t know another way. The thoughts come here and there but if they are getting lesser, that’s a step. :/",
      "created_utc": 1715656385.0,
      "score": 24,
      "context": []
    },
    {
      "id": "l3z1cg6",
      "author": "Fresh-Bluebird3493",
      "body": "Yeah I kind of just do it as a means of deflection at this point tbh. I just don’t have the energy to put emphasis on other people’s eating habits anymore. People eat. It’s not a cause for concern in most cases. At this point, it’s because it makes me look better to say something positive that’s backed up by science even though my own mind and body screams the opposite. \n\nSome people overexert themselves into the lives of others with eating disorders. I used to do this. But genuinely can’t be assed anymore. Plus I’m not gonna get much info from them tbh. This was mostly when I was younger and it’s not like they really had any awareness. People just go through hard times. The knowledge I have now exceeds what I knew when I was younger by a long shot. I have everything I need now. I can’t help others. I can’t help myself. It’s just not going to happen so I don’t really try in the same way anymore. It’s not that simple. And I already got what I wanted once so I can do it again, but better this time.",
      "created_utc": 1715673911.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l3zs1si",
      "author": "None",
      "body": "idk if it makes you feel better but jules from rhony was on video doing exactly this more than once in her single season and it’s what caused the other girls to basically accuse her of having an ED, it’s pretty common and known to be sign",
      "created_utc": 1715690380.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l40mvvl",
      "author": "Neat-Lock-3956",
      "body": "Seriously same here. I kinda got mad at boyfriend getting sick cause I'm secretly jealous that he'll loose all the weight. And that's so messed up ik. I was a real bitch to him when he was sick. This illness is deep rooted.",
      "created_utc": 1715701754.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l426b0j",
      "author": "None",
      "body": "Omg no I thought I was so mean for this too. I get competitive about this sort of thing (along with other random things). I don't even mean to think like this either, it just sort of happens?",
      "created_utc": 1715720447.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l4340hp",
      "author": "Semper-Lux",
      "body": "This isn't all that rare -- Anorexia tends to be a pretty competitive disorder; CBT is the usual route for dealing with it.",
      "created_utc": 1715733116.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l43e013",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1715737034.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4bs73u",
      "author": "Waste-Necessary2756",
      "body": "It’s pretty normal! Unfortunately an eating disorder is a MENTAL disorder, so it’s only normal to have ugly thoughts, I happen to always look at other people body just to validate myself, and I feel all shitty, but again, it’s our disorder who makes us have these habits, I wish you well!",
      "created_utc": 1715877054.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l41acmh",
      "author": "None",
      "body": "I had a friend that did this and yes, it's selfish and they probably know exactly what you are doing.",
      "created_utc": 1715709566.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l44r2v4",
      "author": "EatingDisorders-ModTeam",
      "body": "Your submission has been removed for the following reason(s):\n\nRule 1: Be Kind\n\nTreat others with respect. Discrimination, hate speech, and bullying are not allowed. This includes any form of mistreatment based on race, gender, sexual orientation, age, disability, or other characteristics.\n\nPlease review the [rules](https://www.reddit.com/r/EatingDisorders/wiki/index/rules/) before posting, and feel free to [send a modmail](https://www.reddit.com/message/compose?to=/r/EatingDisorders) if you have any questions.",
      "created_utc": 1715764616.0,
      "score": 1,
      "context": [
        {
          "id": "l43e013",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1715737034.0
        }
      ]
    }
  ]
}