{
  "id": "1cwiys7",
  "subreddit": "EatingDisorders",
  "author": "Kindly_Structure_265",
  "created_utc": 1716220578.0,
  "title": "Brother’s thin girlfriend called herself fat and triggered my ED",
  "selftext": "I (F27) have struggled with disordered eating and body dysmorphia since I was a pre-teen. I’ve reached as close to “body neutrality” as possible the past few years, trying to practice joyful movement and see food as fuel.\n\nMy brother’s girlfriend is very thin and also taller than me. My mom is gossipy, and a few months ago, she told me “Can you believe [brother’s girlfriend] told [brother] she feels she’s too big and needs to lose weight?! She’s already tiny!” and I’ve been spiraling ever since. My response was “If she thinks she’s big, I can’t imagine how she sees us.” \n\nWithout going into specifics, I am literally the exact average height, clothing size, and even shoe size (lol) for a woman my age in the United States. Most of my close friends happen to be about my size or larger, and my mom is plus size and has been her whole life. Most of the other women in my family are plus size as well. My brother’s girlfriend is one of the only thin women in my life.\n\nEver since my mom said this to me, it’s all I can pay attention to when I’m around my brother’s girlfriend or especially when we’re in photos together (which is pretty often). I look at the photos and feel like I’m literally double her size. I imagine how disgusted she must feel by my body or my mother’s body. She is such a kind girl and I know she probably isn’t thinking negatively about us at all. I know it’s probably just an internal battle with herself. She could even be in this subreddit, who knows.\n\nBut I also struggle with (reverse?) body dysmorphia and while I generally can look in the mirror and find an angle of myself I’m pleased with, I’m always SHOCKED with how I look in photos, because it doesn’t fit the mental image I have of myself at all.\n\nAll of this has thrown me back into disordered eating (anorexia and then binging) and punishing my body with exercise to the point of feeling sick. I imagine a photo with me and my brother’s girlfriend where we’re closer to the same size and I want that so badly.\n\nI’d love some advice for how to work through this. Do I avoid being in photos? Do I tell my mom to refrain from mentioning anyone’s body size from now on? She’s currently on a weight loss journey herself and has been excitedly texting me updates and progress photos, which makes this more challenging…\n\nJust feeling really bummed to be back in this headspace 😕\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1cwiys7/brothers_thin_girlfriend_called_herself_fat_and/",
  "score": 113,
  "num_comments": 18,
  "comments": [
    {
      "id": "l4xbql1",
      "author": "BuniiBoo",
      "body": "Thing is, I never really cared about anyone else’s body. I even admired and thought of bigger bodies as beautiful (all bodies, really), but _my_ body had to be a very specific shape and size and X, Y, Z, or I was not okay. I cannot stress enough how very little I judged other women’s bodies negatively. More often than not, it was “omg she’s so pretty she has ____ and I wish I looked like that!!” I was sick. My whole world was “do I look okay?”. Not how you, or she, or they, looked, but how I looked. It was all consuming; there was no room for anything else. \n\nTherapy is a beautiful thing, and it would be appropriate to seek assistance in this situation.",
      "created_utc": 1716236788.0,
      "score": 108,
      "context": []
    },
    {
      "id": "l4xuyk9",
      "author": "Sea-Fix-3520",
      "body": "My cardiologist asked me if I have a scale,like,do you see how fat you are?I have been in recovery for years for anorexia and bulimia for years.Plus I have to keep  taking methadone and it made me gain 40lbs .I threw out my scale for a reason.",
      "created_utc": 1716243983.0,
      "score": 27,
      "context": []
    },
    {
      "id": "l4xbtt0",
      "author": "Mysterious_Wrap916",
      "body": "Avoiding photos will only further the anxiety and discomfort with them and will become a larger hurdle for you to get over in the future. You may have heard the saying “secrets keep us sick” (I’ve typically heard this within eating disorder treatment) but the statement is true. I would have a conversation with your mom, and other members of your family that you trust, to set a boundary about discussing the size of other people’s bodies, or even their own and be open about your current struggles. This sounds like a time to really lean into your supports and let them know you are having these mental battles.",
      "created_utc": 1716236821.0,
      "score": 21,
      "context": []
    },
    {
      "id": "l4xdhkf",
      "author": "Impressive-Manner565",
      "body": "If it’s triggering your ED I would definitely let your mom know that what she’s saying is distressing you. Maybe try to reframe from taking pictures with your brothers girlfriend/looking at other pictures for now. I would suggest you try to talk to a therapist if you have not already. \n\nRemember we are all meant to be different shapes and sizes. Body size and frame are a natural variation like hair color, skin color, shoe size etc. it would be impossible/unhealthy to try to make a poodle look like a chihuahua. Try to get in touch with a mental health expect because regardless of how you feel about your body you still need to nourish it",
      "created_utc": 1716237423.0,
      "score": 15,
      "context": []
    },
    {
      "id": "l4xnrji",
      "author": "ScotchTapeConnosieur",
      "body": "She has an ED too most likely",
      "created_utc": 1716241186.0,
      "score": 22,
      "context": []
    },
    {
      "id": "l51clpe",
      "author": "20Keller12",
      "body": "Try to think of it like this:\n\n>I imagine how disgusted she must feel by my body or my mother’s body.\n\nDo you feel this way when you look at people bigger than you?",
      "created_utc": 1716307292.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l4ztwp4",
      "author": "jammyraspberry",
      "body": "I look at other women who have a higher BMI than me and who wear bigger sizes than I do and I think they look perfect and slim, but when I look at myself I see fat. My judgment of my own body is never a judgment of somebody else’s. I’m sure she doesn’t think anything bad about your body at all. This is 100% about her.",
      "created_utc": 1716281273.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l4ymgf8",
      "author": "putonthespotlight",
      "body": "I'm so sorry this is happening. I will say this: Anxiety feeds off of anxiety. I'm kind of getting the vibe that she has an ED too/is anxious about her body. Are you anxious about your body around her? She might be feeling the same about her body. Highly doubt she thinks negatively about.you/your size at all. Probably just hard on herself. ",
      "created_utc": 1716255677.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l5i2mgc",
      "author": "bodhiali",
      "body": "I would definitely advise you to have a discussion with your mom and if you haven’t yet, tell her about your eating disorder. Tell her how serious it is, how quickly you can fall back into it even with lots of progress, and ask her to please not mention body sizes, including her own weight loss journey. \n\nI think it’s possible to portray this situation to her in a way that focuses on yourself and how certain discussions affect you, rather than casting blame on her or judging her as it may make her defensive. Not saying you would do that, but it’s important to consider how it’s brought up. If possible, you can look up articles targeted towards her POV: for example, “My daughter/son has an ED, how can i support her/him?”\n\nI would look that type of thing up so you can have resources you can show her, and hopefully if she loves and cares about you she will take the time to understand what you’re going through. \n\nIt doesn’t mean she can’t tell you about her successes, but maybe she can learn to phrase it differently and talk about how she’s been feeling about her health lately, rather than how she now views her body.\n\nBest of luck OP, and i’m sorry you’re going through this :( In the meantime, please do seek out therapy or if you already go, tell your therapist you’ve been struggling lately!",
      "created_utc": 1716572851.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l4ym43x",
      "author": "putonthespotlight",
      "body": "I feel this so much. Have genuinely never thought of another woman as ugly in my life. It's just how picky I am with myself ",
      "created_utc": 1716255533.0,
      "score": 20,
      "context": [
        {
          "id": "l4xbql1",
          "author": "BuniiBoo",
          "body": "Thing is, I never really cared about anyone else’s body. I even admired and thought of bigger bodies as beautiful (all bodies, really), but _my_ body had to be a very specific shape and size and X, Y, Z, or I was not okay. I cannot stress enough how very little I judged other women’s bodies negatively. More often than not, it was “omg she’s so pretty she has ____ and I wish I looked like that!!” I was sick. My whole world was “do I look okay?”. Not how you, or she, or they, looked, but how I looked. It was all consuming; there was no room for anything else. \n\nTherapy is a beautiful thing, and it would be appropriate to seek assistance in this situation.",
          "created_utc": 1716236788.0
        }
      ]
    },
    {
      "id": "l4y1vyk",
      "author": "r1poster",
      "body": "This. I'm sure OP knows this as well, but it is worth it to reiterate.\n\nIt is a very blinded, hypocritical disorder—we are so hateful of ourselves, but loving of others. I'm not sure if the GF struggles with ED, but her comments about herself are suggesting a BDD mindset, imo.\n\nHowever... it's another story entirely to not let someone else's behaviors with ED trigger your own :/ It's so hard to remove emotion from body-critical comments. The ED voice so often latches onto these comments and obsessively analyzes any negative meaning from them that it can.",
      "created_utc": 1716246832.0,
      "score": 12,
      "context": [
        {
          "id": "l4xbql1",
          "author": "BuniiBoo",
          "body": "Thing is, I never really cared about anyone else’s body. I even admired and thought of bigger bodies as beautiful (all bodies, really), but _my_ body had to be a very specific shape and size and X, Y, Z, or I was not okay. I cannot stress enough how very little I judged other women’s bodies negatively. More often than not, it was “omg she’s so pretty she has ____ and I wish I looked like that!!” I was sick. My whole world was “do I look okay?”. Not how you, or she, or they, looked, but how I looked. It was all consuming; there was no room for anything else. \n\nTherapy is a beautiful thing, and it would be appropriate to seek assistance in this situation.",
          "created_utc": 1716236788.0
        }
      ]
    },
    {
      "id": "l51luvm",
      "author": "Leadster77",
      "body": "This. Exactly this. I can admire plus size women. Especially when they dress to show of their curves.\n\nBut that does not apply to me. \n\nWe are so tough on ourselves. I wish I could see myself as I see other plussize women.",
      "created_utc": 1716310524.0,
      "score": 5,
      "context": [
        {
          "id": "l4xbql1",
          "author": "BuniiBoo",
          "body": "Thing is, I never really cared about anyone else’s body. I even admired and thought of bigger bodies as beautiful (all bodies, really), but _my_ body had to be a very specific shape and size and X, Y, Z, or I was not okay. I cannot stress enough how very little I judged other women’s bodies negatively. More often than not, it was “omg she’s so pretty she has ____ and I wish I looked like that!!” I was sick. My whole world was “do I look okay?”. Not how you, or she, or they, looked, but how I looked. It was all consuming; there was no room for anything else. \n\nTherapy is a beautiful thing, and it would be appropriate to seek assistance in this situation.",
          "created_utc": 1716236788.0
        }
      ]
    },
    {
      "id": "l601vcu",
      "author": "None",
      "body": "Honestly too relatable. If I wasn't me and I saw someone who looked exactly how I look now I'd just think \"urgh I wish I looked like that!\" But since that IS how I look I hate me, not anyone else, if that makes sense of how it is??",
      "created_utc": 1716887783.0,
      "score": 2,
      "context": [
        {
          "id": "l4xbql1",
          "author": "BuniiBoo",
          "body": "Thing is, I never really cared about anyone else’s body. I even admired and thought of bigger bodies as beautiful (all bodies, really), but _my_ body had to be a very specific shape and size and X, Y, Z, or I was not okay. I cannot stress enough how very little I judged other women’s bodies negatively. More often than not, it was “omg she’s so pretty she has ____ and I wish I looked like that!!” I was sick. My whole world was “do I look okay?”. Not how you, or she, or they, looked, but how I looked. It was all consuming; there was no room for anything else. \n\nTherapy is a beautiful thing, and it would be appropriate to seek assistance in this situation.",
          "created_utc": 1716236788.0
        }
      ]
    },
    {
      "id": "l5ibqmg",
      "author": "None",
      "body": "yea its very likely, i look back on photos i use to take n i was really thin but durin that time thought i was fat. body dysmorphia def isnt fun.",
      "created_utc": 1716576113.0,
      "score": 1,
      "context": [
        {
          "id": "l4xnrji",
          "author": "ScotchTapeConnosieur",
          "body": "She has an ED too most likely",
          "created_utc": 1716241186.0
        }
      ]
    },
    {
      "id": "l6nk8vr",
      "author": "freaking_scared",
      "body": "Or body dismorphia.",
      "created_utc": 1717263952.0,
      "score": 1,
      "context": [
        {
          "id": "l4xnrji",
          "author": "ScotchTapeConnosieur",
          "body": "She has an ED too most likely",
          "created_utc": 1716241186.0
        }
      ]
    },
    {
      "id": "l4zw4yn",
      "author": "No-Common-5772",
      "body": "It makes me wonder how people can even be pro ana… tumblr and twitter are so bad for it",
      "created_utc": 1716283010.0,
      "score": 3,
      "context": [
        {
          "id": "l4xbql1",
          "author": "BuniiBoo",
          "body": "Thing is, I never really cared about anyone else’s body. I even admired and thought of bigger bodies as beautiful (all bodies, really), but _my_ body had to be a very specific shape and size and X, Y, Z, or I was not okay. I cannot stress enough how very little I judged other women’s bodies negatively. More often than not, it was “omg she’s so pretty she has ____ and I wish I looked like that!!” I was sick. My whole world was “do I look okay?”. Not how you, or she, or they, looked, but how I looked. It was all consuming; there was no room for anything else. \n\nTherapy is a beautiful thing, and it would be appropriate to seek assistance in this situation.",
          "created_utc": 1716236788.0
        },
        {
          "id": "l4ym43x",
          "author": "putonthespotlight",
          "body": "I feel this so much. Have genuinely never thought of another woman as ugly in my life. It's just how picky I am with myself ",
          "created_utc": 1716255533.0
        }
      ]
    },
    {
      "id": "l5icnme",
      "author": "ScotchTapeConnosieur",
      "body": "Don’t I know it. We just completed successful treatment of our daughters ED. At the height her beliefs about her appearance were downright delusional. We had to remove all mirrors from the house. Thank god that’s behind us. A brutal slog (we did FBT.)",
      "created_utc": 1716576441.0,
      "score": 2,
      "context": [
        {
          "id": "l4xnrji",
          "author": "ScotchTapeConnosieur",
          "body": "She has an ED too most likely",
          "created_utc": 1716241186.0
        },
        {
          "id": "l5ibqmg",
          "author": "None",
          "body": "yea its very likely, i look back on photos i use to take n i was really thin but durin that time thought i was fat. body dysmorphia def isnt fun.",
          "created_utc": 1716576113.0
        }
      ]
    },
    {
      "id": "l6nkvd6",
      "author": "ScotchTapeConnosieur",
      "body": "Or both",
      "created_utc": 1717264180.0,
      "score": 1,
      "context": [
        {
          "id": "l4xnrji",
          "author": "ScotchTapeConnosieur",
          "body": "She has an ED too most likely",
          "created_utc": 1716241186.0
        },
        {
          "id": "l6nk8vr",
          "author": "freaking_scared",
          "body": "Or body dismorphia.",
          "created_utc": 1717263952.0
        }
      ]
    }
  ]
}