{
  "id": "1czfusr",
  "subreddit": "EatingDisorders",
  "author": "TAEJ0NG",
  "created_utc": 1716538924.0,
  "title": "will eating disorder ever go away?",
  "selftext": "i feel like once you experience any type of eating disorders, they will forever be a part of you. i consider myself “recovered” just because im weight restored now but the thoughts will never leave me alone. i just try to not act on them but they’re always there whenever i eat. i don’t know what to do anymore. i just threw up again im so tired of this",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1czfusr/will_eating_disorder_ever_go_away/",
  "score": 40,
  "num_comments": 20,
  "comments": [
    {
      "id": "l5ksojv",
      "author": "r1poster",
      "body": "I think it depends on the treatment that's been pursued. I've only been in therapy for it intermittently, and I still have ED thoughts.\n\nI genuinely think that having ED thoughts are like riding a bike—you can't unlearn them. The type of insane mental gymnastics your brain does with ED and/or BDD are extremely difficult to make go away completely. You can learn ways to challenge and distance yourself from these thoughts, but they're still going to be there.\n\nBut I could be wrong. I've seen people say they're fully recovered.",
      "created_utc": 1716615406.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l5lnl7e",
      "author": "FurrCoatNoKnickers",
      "body": "I think of it being akin to an addiction. Former Alcoholics who become sober are able to live incredibly happy and fulfilling lives, but either consistently or sporadically go to AA. They know it can be an issue, so they take the steps to ensure sobriety. There will be great days and bad days, but If you consistently put in the work the new habits and thoughts will take on, and life will be normal. It will get better with time. Soon you’ll realize there’s more time between slip ups, the thoughts when eating get less loud and less often. It doesn’t mean the thoughts don’t pop up every now and then, or there might be a slip up, but you’re more equipped to deal with them to continue living a happy recovered life. \n\nI’ve had an ED since I was 10, and went to inpatient treatment. I have had slip ups, and occasional thoughts, but considered myself recovered because I am leading a happy and healthy life. It’s not a black and white thing, I have my moments but i implement the things that make me feel better and focus on how I’m doing better and the desire to be better.",
      "created_utc": 1716637921.0,
      "score": 11,
      "context": []
    },
    {
      "id": "l5ll2cp",
      "author": "Pissingf4g",
      "body": "It depends on how long you’ve been struggling . Some studies have shown that people who’ve struggled for 3-7+ years never “fully recover” , disordered thoughts typically remain . But , I think if you learn to live with and ignore em successfully (through redirecting those thoughts or distractions) that you could be considered fully recovered \n\nJust stinks that usually most people don’t get help soon enough and end up with it for their whole lives in some way or another",
      "created_utc": 1716636403.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l5l8wuq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1716627395.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l5lycjg",
      "author": "lumpy_space_queenie",
      "body": "It depends on what recovery means to the individual, I think. Some are in active recovery, and believe they will be for the rest of their lives. They look at recovery as a set of coping skills you learn to use by habit to beat the ED thoughts that still come up. \n\nOthers believe you can totally get rid of the thoughts, compulsions, fears, and never think twice about them. \n\nFor me, I think recovery looks more like the first one. But if people are able to accomplish the 2nd, I don’t see why you couldn’t. I believe either is possible, and good.",
      "created_utc": 1716643600.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l5lzs1j",
      "author": "sockpotatoes",
      "body": "I felt this way for a few years and had bigger lapses where I would be symptomatic for weeks at a time, and smaller ones where I would purge once without fully slipping back into hold habits. I have trouble with catastrophic thinking, so my therapist had me think of these little ones as slip ups instead of lapses. To me, a lapse basically meant I was back at square one. Which isn’t true. You’re never back a square one. \nAnyway, I now consider myself fully recovered. I do still have thoughts from my ed every so often but I can ignore them. Or if they’re persistent, I tell them to stfu or I try to remember how miserable and isolated I was during the thick of it. If I notice a pattern of worsening thoughts, I book a therapy session. I’ve been seeing the same ed therapist for 7 years now so I go when I need it.",
      "created_utc": 1716644276.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l5kz3hd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1716619875.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l5maoa8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1716648925.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l5oyttk",
      "author": "neopronoun_dropper",
      "body": "I’d agree that most people don’t recover fully and probably never will. But I promise, my thoughts are gone. There is no more eating disorder in my mind and body. Cognitive Behavior Therapy. Make sure you battle your thoughts even when you’re not at the table eating. It’s about how you feel when commercials come on TV, and how you act when you come across a mirror, and how you let the eating disorder invade your thoughts, when it’s affecting a part of your life that doesn’t depend on your survival directly, and instead your quality of life. \n\nI reached a point where a person literally criticized me for eating “like a pig” at the age of 12, 8 years ago, and I felt nothing… Didn’t bother me at all… I just thought, “Oh, wow, cool, I don’t have to fight as hard to get myself to eat so much and try to restore my weight so aggressively. I’m free.” I almost grieve the fact that I had the eating disorder, and I failed at having it so hard, that there is so little of it left… I have this competitive sense in me. If anyone mentions having anorexia at a younger age, or battling it for longer than I did, I used to get jealous, for a few years that I recovered so aggressively. But that disappeared when I was around 17, and I don’t even have that anymore.",
      "created_utc": 1716689948.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l5mwyiy",
      "author": "kwibaby",
      "body": "My psychologist said you learn to live with it. It stays with you forever but you learn to deal with it :/ so idk. I still have mine.",
      "created_utc": 1716657691.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l5nmco3",
      "author": "r090491",
      "body": "It will be 20 years “recovered”. Not one day goes by without an ED thought. I just learned to ignore them.",
      "created_utc": 1716667926.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l5op2wj",
      "author": "alexisseffy",
      "body": "I’ve had anorexia for over 5 years and have been through several treatments (outpatient, iop, php, inpatient) and have not gotten better. Even when I was weight restored I was still mentally very unwell. I wish I could just recover and never have another disordered thought again but I feel like it will always be with me to some extent. Maybe some people who were sick at a very young age or for a short period of time can recover and go back to “normal” but I can’t see a way out of it at this point personally. Eventually I want to be recovered, or at least at a point where my ED no longer controls me and I can live a normal life.",
      "created_utc": 1716685251.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l5sp93m",
      "author": "Itchy_Mycologist_853",
      "body": "I don’t tend to describe myself as being recovered, but as being in remission. In the way that it can go away for a time, improve but may well come back (though I hope not). A similar way that you would describe someone’s cancer being in remission. It can totally be eradicated, but requires screening and care to make sure it doesn’t come back. Despite that, it might come back and treatment may need starting again. \n\nI similarly describe it to an addiction as well. \n\nI’ve been weight restored for 4 years and in remission for that time too. I’ve had the best relationship with food, and have been described by family as having the healthiest relationship with food than anyone they know. Does it mean I don’t get disordered thoughts sometimes? No, they still happen. But I check in with myself, what I’ve worked for and why I’ve done it and carry on with my healthy habits.",
      "created_utc": 1716757827.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l5tdoik",
      "author": "kittenspace_",
      "body": "i feel this so hard, the thoughts have not left me alone for now 48 hours almost and i want to punch myself in the face. i've been dealing with this on and off for nine years & i'm not trying to be dramatic but yeah sometimes it feels like it is never ending. it feels paralyzing 🥲. i wish i could say it would go away but i unfortunately think they literally never will. if anyone has tips let me know cause ive tried everything under the sun and moon and am so frustrated that i have to deal with this, as im sure you are to",
      "created_utc": 1716768302.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l5p2lk7",
      "author": "None",
      "body": "Not weight restored yet, almost there, but yes those thoughts have went away",
      "created_utc": 1716691800.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l761nnp",
      "author": "CorrectDiscount4657",
      "body": "I feel like they will never truly ever go away. It takes a lot of effort to stick to being better. Whenever I think I’m doing better it somehow sneaks up on me and I tend to relapse and it’s coming back again. Almost 7 years and I think I relapse every single year.",
      "created_utc": 1717558028.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l5kttt2",
      "author": "TAEJ0NG",
      "body": "the bike was an excellent example and i truly think the same. l don’t know what is considered “fully recovered” anymore…because i genuinely can’t believe that a person with a history of ED is fully freed from the thoughts",
      "created_utc": 1716616171.0,
      "score": 6,
      "context": [
        {
          "id": "l5ksojv",
          "author": "r1poster",
          "body": "I think it depends on the treatment that's been pursued. I've only been in therapy for it intermittently, and I still have ED thoughts.\n\nI genuinely think that having ED thoughts are like riding a bike—you can't unlearn them. The type of insane mental gymnastics your brain does with ED and/or BDD are extremely difficult to make go away completely. You can learn ways to challenge and distance yourself from these thoughts, but they're still going to be there.\n\nBut I could be wrong. I've seen people say they're fully recovered.",
          "created_utc": 1716615406.0
        }
      ]
    },
    {
      "id": "l5lriqh",
      "author": "Positive-Court",
      "body": "I say I'm fully recovered, but there's still stuff that ~mildly~ triggers me & I have to stay aware that no, I can't just stop eating, and that I also don't have to compensate.\n\n\nIt's really mild and something I can push to away, though. I think the bike comparison is excellent, cause in my mind- these 'triggers' would be normal to other people, hell, even pre-ed me, and they could restrict or compensate but because they didn't know the end goal, it fades away for them once the trigger ends. Meanwhile with us, we know that end goal, and once we start peddling? Unlike normies-or even or pre-ED selves- we stay on that bike.",
      "created_utc": 1716640124.0,
      "score": 2,
      "context": [
        {
          "id": "l5ksojv",
          "author": "r1poster",
          "body": "I think it depends on the treatment that's been pursued. I've only been in therapy for it intermittently, and I still have ED thoughts.\n\nI genuinely think that having ED thoughts are like riding a bike—you can't unlearn them. The type of insane mental gymnastics your brain does with ED and/or BDD are extremely difficult to make go away completely. You can learn ways to challenge and distance yourself from these thoughts, but they're still going to be there.\n\nBut I could be wrong. I've seen people say they're fully recovered.",
          "created_utc": 1716615406.0
        }
      ]
    },
    {
      "id": "l5ssuyl",
      "author": "turtleshell20",
      "body": "I find it interesting that you mentioned it could depend on the treatment pursued. I have been fortunate enough to receive many rounds of treatment at all levels of care. I have been in treatment with many people. some of whom have fully recovered and do not want to go back to their ed. and some who are still stuck in the relapse/treatment cycle years later. I have been out of treatment for almost 2 years now, but am not fully recovered. I still have urges every day and ed thoughts at all times. I am physically recovered but not mentally recovered at all. I feel it really depends on the person and what led to the development of their ed. I wish treatment would have “cured” me. there are a lot of flaws with the treatment system. it’s a long term battle for many of us. I like your bike analogy! We gotta keep fighting for freedom!",
      "created_utc": 1716759263.0,
      "score": 1,
      "context": [
        {
          "id": "l5ksojv",
          "author": "r1poster",
          "body": "I think it depends on the treatment that's been pursued. I've only been in therapy for it intermittently, and I still have ED thoughts.\n\nI genuinely think that having ED thoughts are like riding a bike—you can't unlearn them. The type of insane mental gymnastics your brain does with ED and/or BDD are extremely difficult to make go away completely. You can learn ways to challenge and distance yourself from these thoughts, but they're still going to be there.\n\nBut I could be wrong. I've seen people say they're fully recovered.",
          "created_utc": 1716615406.0
        }
      ]
    },
    {
      "id": "l5le5y1",
      "author": "TAEJ0NG",
      "body": "i’m so sorry i know how hard it is\nat least you know that you’re not alone in this🫂 i hope that one day we can all find peace with our bodies and food again",
      "created_utc": 1716631529.0,
      "score": 3,
      "context": [
        {
          "id": "l5l8wuq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1716627395.0
        }
      ]
    },
    {
      "id": "l5le23y",
      "author": "TAEJ0NG",
      "body": "i’m so sorry🫂i feel you i miss the days when i didn’t care about food this much and had a healthy relationship with it :( but i genuinely hope that we all find peace one day",
      "created_utc": 1716631445.0,
      "score": 2,
      "context": [
        {
          "id": "l5kz3hd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1716619875.0
        }
      ]
    },
    {
      "id": "l5npb0v",
      "author": "TAEJ0NG",
      "body": "that’s such a beautiful example..thank you :)",
      "created_utc": 1716669158.0,
      "score": 2,
      "context": [
        {
          "id": "l5maoa8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1716648925.0
        }
      ]
    },
    {
      "id": "l76sxkf",
      "author": "TAEJ0NG",
      "body": "i’m so proud of you! :) i hope one day i can get where you at right now\ni’ll try my best :)",
      "created_utc": 1717574525.0,
      "score": 1,
      "context": [
        {
          "id": "l5oyttk",
          "author": "neopronoun_dropper",
          "body": "I’d agree that most people don’t recover fully and probably never will. But I promise, my thoughts are gone. There is no more eating disorder in my mind and body. Cognitive Behavior Therapy. Make sure you battle your thoughts even when you’re not at the table eating. It’s about how you feel when commercials come on TV, and how you act when you come across a mirror, and how you let the eating disorder invade your thoughts, when it’s affecting a part of your life that doesn’t depend on your survival directly, and instead your quality of life. \n\nI reached a point where a person literally criticized me for eating “like a pig” at the age of 12, 8 years ago, and I felt nothing… Didn’t bother me at all… I just thought, “Oh, wow, cool, I don’t have to fight as hard to get myself to eat so much and try to restore my weight so aggressively. I’m free.” I almost grieve the fact that I had the eating disorder, and I failed at having it so hard, that there is so little of it left… I have this competitive sense in me. If anyone mentions having anorexia at a younger age, or battling it for longer than I did, I used to get jealous, for a few years that I recovered so aggressively. But that disappeared when I was around 17, and I don’t even have that anymore.",
          "created_utc": 1716689948.0
        }
      ]
    }
  ]
}