{
  "id": "1d2v1hu",
  "subreddit": "EatingDisorders",
  "author": "HeadFault6866",
  "created_utc": 1716931482.0,
  "title": "My brother's wife (F40) is Bulimic and does not seem to care.",
  "selftext": "They have 3 kids between the 2 of them. Dead bedroom relationship and there simply is no reasoning with this spouse. They do it openly where in a sitting, they would go to the washroom 3 to 4 times to purge, binge eat like there is no tomorrow. I am talking $100-200 worth of takeout per day.\n\nEarly in there marriage, the normal approach of being supportive and visiting professionals were taken but a decade on, she has totally embraced this and does not seem to care. The other day, kids came back from school hungry where she just cooked 2 pounds worth of shrimp and ate them alone and immediately purged. Kids had fast food.\n\nMy brother relies on takeout food and an air-fryer to eat as he also works full time and doesn't have much time once all is said and done.\n\nShe has recently managed to get an Ozempic injection to maintain this vicious cycle.\n\nMy brother is basically numb at this point and has given up. Kids are practically raising themselves. Brother oversees their schoolwork and has conversations with them about school/life issues when he can. Mother's affection is that of a pet owner to a pet. A couple of spontaneous hugs and kisses throughout the day.\n\nIf it matters, she is confirmed diagnosed with bipolar disorder. I personally feel that there is no resolve in this. My brother is in the marriage for the kids but I don't feel like it makes much of a difference. Is she at the point of no return? She consciously and clearly does not care. She is intelligent and educated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1d2v1hu/my_brothers_wife_f40_is_bulimic_and_does_not_seem/",
  "score": 38,
  "num_comments": 29,
  "comments": [
    {
      "id": "l66ysgz",
      "author": "valerieflames",
      "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
      "created_utc": 1716999421.0,
      "score": 58,
      "context": []
    },
    {
      "id": "l674t10",
      "author": "Fit-Cauliflower-9229",
      "body": "Oh that’s sad…\n\nMake sure the kids eat well and don’t copy her habit!\n\nThere’s a vegan mom in the school my mom’s working at. It’s clear when you talk to her that her choice of diet is because of an ED, and not a conviction for the animal cause. Sadly she also forces her nutrition plan into her kid, because « they’ll look thin that way ☺️» they’re not allowed carbs or cookies, even if it’s vegan.\n\nAll my courage to her and her husband but also, be careful about the kids. Look for signs, do they look thin? Do they start copying her? Is she trying to tell them what to eat?",
      "created_utc": 1717001495.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l66oel3",
      "author": "treger6",
      "body": "On an unconscious level, they are both aware. This vicious cycle of control and addiction has likely been a part of her life for the longest time. It resembles an out-of-body experience, almost as if one is possessed. It seems like this has sadly become their new normal, which is why it is accepted as normal. Perhaps your family could consider intervening with an intervention. Remember, there is always hope!",
      "created_utc": 1716995815.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l677x0d",
      "author": "econroy",
      "body": "The ozempic could very well help reduce her urges to binge.\n\nShe cares. I guarantee it. As someone who suffers from long term bulimia, at a certain point it is more manageable to just resign yourself to it. However, making a public spectacle of your behaviors is inexcusable and shameful. \n\nMy concern is for the children. They absorb her habits and behaviors like sponges and I hope to God they manage to come out of that upbringing with normal relationships with food and body. This is unlikely. Please speak to your brother and get them in therapy asap, if that's at all doable. The damage their mother has done/is doing could ruin them.",
      "created_utc": 1717002569.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l68gpjs",
      "author": "Logical_Step_749",
      "body": "I’m so sorry. This is heartbreaking. I’m glad these kids have a caring family member in you. \n\n1. Even if a parent tries to hide an eating disorder like this, kids pick up on it, so the fact that it is out in the open is even more heartbreaking and scary. My mother had a an unhealthy relationship with food and because of that and other trauma from our childhood my siblings and I all have different iterations of eating disorders, but we are working through it. \n\n2. As for staying in the marriage for the kids- again I only know the details you have shared but perhaps you could raise the question to your brother- is that’s what’s best for the kids? Not only in terms of their daily exposure to their mother’s eating disorder but also the model of a marriage they are seeing. \n\n3. It sounds like this feeling of numbness from your brother and her seemingly not caring is a survival mechanism and again I doubt she doesn’t care. She may be just so far deep into her eating disorder. In my experience, my eating disorder was a way to cope with my emotions- I used food to numb my emotions. \n\n4. There are medications like vyvanse that can specifically help with binge eating disorder. \n\nI would say she really needs to see an eating disorder therapist. There are outpatient and partial hospitalization programs that could really help her too. I realize she may not be in the place to be willing to get help but if your brother could speak with a therapist that could be a helpful starting point to give him the support he needs and knowledge of how to approach this. I know this may not be financially feasible, so a great place to start could also be support groups, which could be less intimidating. There are free support groups for not only for those who are suffering from eating disorders but also for loved ones of those who are. \nIf your brother isn’t willing at this point to do that, if you have the time and emotional capacity, you could consider doing so yourself and this way you could get advice or resources from others. \n\nhttps://www.allianceforeatingdisorders.com/groups/",
      "created_utc": 1717018061.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6ihb2z",
      "author": "neopronoun_dropper",
      "body": "Sometimes you give up, because it’s too hard and you don’t think it’s worth living. It’s also not a choice to binge, just to be clear. Binge eating is really out of your control, and it takes a lot of therapy to stop. You purge because you feel disgusting and guilty afterwards and don’t know what else to do. I also have Bipolar Disorder. Bipolar Disorder has the highest suicide rate of all mental illnesses. Are you sure she doesn’t care? Has she given up, and doesn’t care to live? because if so, then she could probably benefit from a psychiatric stay in a hospital, which is common for bulimia, plus a lot of the time that’s a good way to break the cycle, which is hard to do for most people. Are you sure she knows that one day her esophagus might tear in half and she’s instantly be dead? Is she getting the intensive care that she really deserves?",
      "created_utc": 1717180105.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6qdcjt",
      "author": "I_need_to_vent44",
      "body": "Well first of all she should be in therapy for her bipolar and potentially taking medication. Impulsive behaviours that occur during manic episodes can worsen her bulimia, along with her potentially being seen as chaotic and unpredictable to the kids, which is not something you want, believe me.\n\n\n\nI used to have bulimia with compensatory behaviour that was not vomiting and later developed anorexia, so I can't be of help here, but I trust that the bullimics here know what they're saying when they say that Ozempic helped them.",
      "created_utc": 1717307934.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l67snd6",
      "author": "AnybodyLow",
      "body": "I was thinking this too. I don’t think anyone enjoys having bulimia, it’s compulsive and it’s a cycle that’s hard to stop even when you’re trying your hardest. I’ve heard people talk about ozempic as almost being a miracle for their food thoughts/urges, it’s such an interesting pov to think about",
      "created_utc": 1717009673.0,
      "score": 28,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        }
      ]
    },
    {
      "id": "l68ug5d",
      "author": "VastReveries",
      "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
      "created_utc": 1717023195.0,
      "score": 2,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        }
      ]
    },
    {
      "id": "l6e9el6",
      "author": "SunnieDays1980",
      "body": "If they have a true ED, no diet will help.  They need to learn to eat a variety in moderation and learn that all food is good food.  It’s so hard to recover from this disease. She’ll need meal support.  They binge because they restrict so much, they’re starving, it makes sense.  I was there many years ago but I’m recovered now.  She needs to work with an ED specific registered dietician.  Even if she took the ozempic and lost the weight, the bulimia issue would still be there.  I thought I was my biggest when I was at my smallest…it really plays tricks on you.",
      "created_utc": 1717110294.0,
      "score": 1,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        }
      ]
    },
    {
      "id": "l6a606l",
      "author": "HeadFault6866",
      "body": "One isn't a big eater and the other 2 eat a lot (growing up teen boys). However, the color green barely visits their eating table.",
      "created_utc": 1717043945.0,
      "score": 3,
      "context": [
        {
          "id": "l674t10",
          "author": "Fit-Cauliflower-9229",
          "body": "Oh that’s sad…\n\nMake sure the kids eat well and don’t copy her habit!\n\nThere’s a vegan mom in the school my mom’s working at. It’s clear when you talk to her that her choice of diet is because of an ED, and not a conviction for the animal cause. Sadly she also forces her nutrition plan into her kid, because « they’ll look thin that way ☺️» they’re not allowed carbs or cookies, even if it’s vegan.\n\nAll my courage to her and her husband but also, be careful about the kids. Look for signs, do they look thin? Do they start copying her? Is she trying to tell them what to eat?",
          "created_utc": 1717001495.0
        }
      ]
    },
    {
      "id": "lbgp5kr",
      "author": "None",
      "body": "my mom is just like this!",
      "created_utc": 1720023947.0,
      "score": 1,
      "context": [
        {
          "id": "l674t10",
          "author": "Fit-Cauliflower-9229",
          "body": "Oh that’s sad…\n\nMake sure the kids eat well and don’t copy her habit!\n\nThere’s a vegan mom in the school my mom’s working at. It’s clear when you talk to her that her choice of diet is because of an ED, and not a conviction for the animal cause. Sadly she also forces her nutrition plan into her kid, because « they’ll look thin that way ☺️» they’re not allowed carbs or cookies, even if it’s vegan.\n\nAll my courage to her and her husband but also, be careful about the kids. Look for signs, do they look thin? Do they start copying her? Is she trying to tell them what to eat?",
          "created_utc": 1717001495.0
        }
      ]
    },
    {
      "id": "l6a6gri",
      "author": "HeadFault6866",
      "body": "I used to binge eat during a very stressful period of my life and I totally can relate to the out-of-body experience. I essentially became an animal when eating. I stopped that by placing a mirror in front of myself while eating. I am okay now but do still binge on rare occasions.\n\nShe is extremely defensive about pretty much everything let alone her ED. She didn't grow up with much affection and she's a closed book. Our interactions with here depend on her mood at the time. She will randomly start talking about a topic and we will happily engage but if she's all quite we simply do not. Most visits to their households are a hello wave to her or literally no interaction. \n\nEarly on in their marriage we tried to be more proactive but that has lead to conflict every single time.",
      "created_utc": 1717044207.0,
      "score": 3,
      "context": [
        {
          "id": "l66oel3",
          "author": "treger6",
          "body": "On an unconscious level, they are both aware. This vicious cycle of control and addiction has likely been a part of her life for the longest time. It resembles an out-of-body experience, almost as if one is possessed. It seems like this has sadly become their new normal, which is why it is accepted as normal. Perhaps your family could consider intervening with an intervention. Remember, there is always hope!",
          "created_utc": 1716995815.0
        }
      ]
    },
    {
      "id": "l68ho9l",
      "author": "lumpy_space_queenie",
      "body": ">at a certain point it is more manageable to just resign yourself to it \n\n😔 thank you for putting my thoughts into words",
      "created_utc": 1717018412.0,
      "score": 3,
      "context": [
        {
          "id": "l677x0d",
          "author": "econroy",
          "body": "The ozempic could very well help reduce her urges to binge.\n\nShe cares. I guarantee it. As someone who suffers from long term bulimia, at a certain point it is more manageable to just resign yourself to it. However, making a public spectacle of your behaviors is inexcusable and shameful. \n\nMy concern is for the children. They absorb her habits and behaviors like sponges and I hope to God they manage to come out of that upbringing with normal relationships with food and body. This is unlikely. Please speak to your brother and get them in therapy asap, if that's at all doable. The damage their mother has done/is doing could ruin them.",
          "created_utc": 1717002569.0
        }
      ]
    },
    {
      "id": "l6a6vfm",
      "author": "HeadFault6866",
      "body": "Oh I wish. I don't think she wants to. We have some of the best mental health facilities around us and just a short drive at that but I don't think there is any willingness. \n\nThe boys take to their father and are very outgoing but have unhealthy junk food diets. The daughter has become more withdrawn as she goes through her teen years. She is very emotionally intelligent and mature but I think the unstable/unconventional household dynamics are taking a toll on her.",
      "created_utc": 1717044443.0,
      "score": 0,
      "context": [
        {
          "id": "l677x0d",
          "author": "econroy",
          "body": "The ozempic could very well help reduce her urges to binge.\n\nShe cares. I guarantee it. As someone who suffers from long term bulimia, at a certain point it is more manageable to just resign yourself to it. However, making a public spectacle of your behaviors is inexcusable and shameful. \n\nMy concern is for the children. They absorb her habits and behaviors like sponges and I hope to God they manage to come out of that upbringing with normal relationships with food and body. This is unlikely. Please speak to your brother and get them in therapy asap, if that's at all doable. The damage their mother has done/is doing could ruin them.",
          "created_utc": 1717002569.0
        }
      ]
    },
    {
      "id": "l6l88zh",
      "author": "HeadFault6866",
      "body": "I really don't know. It's impossible to sometimes talk about very casual topics, let alone this...",
      "created_utc": 1717223229.0,
      "score": 1,
      "context": [
        {
          "id": "l6ihb2z",
          "author": "neopronoun_dropper",
          "body": "Sometimes you give up, because it’s too hard and you don’t think it’s worth living. It’s also not a choice to binge, just to be clear. Binge eating is really out of your control, and it takes a lot of therapy to stop. You purge because you feel disgusting and guilty afterwards and don’t know what else to do. I also have Bipolar Disorder. Bipolar Disorder has the highest suicide rate of all mental illnesses. Are you sure she doesn’t care? Has she given up, and doesn’t care to live? because if so, then she could probably benefit from a psychiatric stay in a hospital, which is common for bulimia, plus a lot of the time that’s a good way to break the cycle, which is hard to do for most people. Are you sure she knows that one day her esophagus might tear in half and she’s instantly be dead? Is she getting the intensive care that she really deserves?",
          "created_utc": 1717180105.0
        }
      ]
    },
    {
      "id": "l67uj1y",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717010318.0,
      "score": 16,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l67snd6",
          "author": "AnybodyLow",
          "body": "I was thinking this too. I don’t think anyone enjoys having bulimia, it’s compulsive and it’s a cycle that’s hard to stop even when you’re trying your hardest. I’ve heard people talk about ozempic as almost being a miracle for their food thoughts/urges, it’s such an interesting pov to think about",
          "created_utc": 1717009673.0
        }
      ]
    },
    {
      "id": "l6bgy9k",
      "author": "AnybodyLow",
      "body": "I’m not saying this in an argumentative way, but what’s the difference with bulimia being partially treated with a drug vs using other drugs to help with opioid addiction? Obviously just a drug isn’t going to help, and therapy and getting down to the root cause is essential. I think EDs are extremely complex, both chemically and emotionally. Taking care of the chemical aspect might assist in helping the emotional component",
      "created_utc": 1717073668.0,
      "score": 8,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l68ug5d",
          "author": "VastReveries",
          "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
          "created_utc": 1717023195.0
        }
      ]
    },
    {
      "id": "l6e1qkb",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717107433.0,
      "score": 2,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l68ug5d",
          "author": "VastReveries",
          "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
          "created_utc": 1717023195.0
        }
      ]
    },
    {
      "id": "l6a6tej",
      "author": "treger6",
      "body": "Wow, great work. I applaud you. Sounds like you have reconditioned your brain which has decreased your urges! \n\nSounds like a very difficult situation your family is in. Needless to say change needs to happen, ASAP. \n\nI sincerely hope brighter days on the horizons for your family!",
      "created_utc": 1717044410.0,
      "score": 1,
      "context": [
        {
          "id": "l66oel3",
          "author": "treger6",
          "body": "On an unconscious level, they are both aware. This vicious cycle of control and addiction has likely been a part of her life for the longest time. It resembles an out-of-body experience, almost as if one is possessed. It seems like this has sadly become their new normal, which is why it is accepted as normal. Perhaps your family could consider intervening with an intervention. Remember, there is always hope!",
          "created_utc": 1716995815.0
        },
        {
          "id": "l6a6gri",
          "author": "HeadFault6866",
          "body": "I used to binge eat during a very stressful period of my life and I totally can relate to the out-of-body experience. I essentially became an animal when eating. I stopped that by placing a mirror in front of myself while eating. I am okay now but do still binge on rare occasions.\n\nShe is extremely defensive about pretty much everything let alone her ED. She didn't grow up with much affection and she's a closed book. Our interactions with here depend on her mood at the time. She will randomly start talking about a topic and we will happily engage but if she's all quite we simply do not. Most visits to their households are a hello wave to her or literally no interaction. \n\nEarly on in their marriage we tried to be more proactive but that has lead to conflict every single time.",
          "created_utc": 1717044207.0
        }
      ]
    },
    {
      "id": "l6n1g3o",
      "author": "Witty-Bid1612",
      "body": "This is so tough, and I'm sorry. Been there (but with a different issue). Honestly, until people are ready to change, the best you can do in my experience is create your own healthy boundaries around it. And maybe be honest with your brother that you're so very sorry, but due to his wife's continued unchecked mental health issues you simply don't feel comfortable spending time there, for your own health and wellbeing. It's hard, but ultimately these are adults who have to manage their own issues. Maybe let him know that he and the kids are welcome to visit you (you can show them super healthy attitudes towards food!) but it's not good for you mentally to spend time around his wife. \n\nPeople hate when we set out boundaries but they exist to protect you, not the other person. It just sucks when you have to do it with family. :( Hopefully your brother would take that to heart and instill his own boundaries with his wife, maybe help her get help. Good luck, OP. These are really not easy situations all around.",
      "created_utc": 1717257203.0,
      "score": 1,
      "context": [
        {
          "id": "l66oel3",
          "author": "treger6",
          "body": "On an unconscious level, they are both aware. This vicious cycle of control and addiction has likely been a part of her life for the longest time. It resembles an out-of-body experience, almost as if one is possessed. It seems like this has sadly become their new normal, which is why it is accepted as normal. Perhaps your family could consider intervening with an intervention. Remember, there is always hope!",
          "created_utc": 1716995815.0
        },
        {
          "id": "l6a6gri",
          "author": "HeadFault6866",
          "body": "I used to binge eat during a very stressful period of my life and I totally can relate to the out-of-body experience. I essentially became an animal when eating. I stopped that by placing a mirror in front of myself while eating. I am okay now but do still binge on rare occasions.\n\nShe is extremely defensive about pretty much everything let alone her ED. She didn't grow up with much affection and she's a closed book. Our interactions with here depend on her mood at the time. She will randomly start talking about a topic and we will happily engage but if she's all quite we simply do not. Most visits to their households are a hello wave to her or literally no interaction. \n\nEarly on in their marriage we tried to be more proactive but that has lead to conflict every single time.",
          "created_utc": 1717044207.0
        }
      ]
    },
    {
      "id": "l6aqn8g",
      "author": "econroy",
      "body": "Just because you're near some of \"the best mental health facilities\" and yet she continues to be sick doesnt mean she doesn't care. You said she put effort into trying to recover and change when she was younger. Chances are, she's been living with this for a very long time and despite her best efforts she has still found herself failing time and time again at getting better. It's very hard not to give up on yourself when that happens. I speak from experience. \n\nI'm not defending her behavior because again, doing it publicly and in a way that harms children is never okay. That's like shooting heroin right in front of your kids. But I am trying to offer perspective from someone who lives with this chronically. \n\nI could be reading your words wrong and projecting my own insecurities onto your text, but you seem to speak with zero empathy and a lot of anger. I absolutely understand where that is coming from, especially when the source is someone who has not lived with this disease and therefore could not possibly understand how deep it can go. However, if it has gotten to this point you need to either find a way to get your brother out of the situation (convince him to divorce), or separate yourself from him AND her. Clearly this is affecting you, and if you spew the same vitriol to her face as you are expressing here, it will just drive her deeper and deeper into herself and her bulimia. EDs thrive on shame.",
      "created_utc": 1717058100.0,
      "score": 2,
      "context": [
        {
          "id": "l677x0d",
          "author": "econroy",
          "body": "The ozempic could very well help reduce her urges to binge.\n\nShe cares. I guarantee it. As someone who suffers from long term bulimia, at a certain point it is more manageable to just resign yourself to it. However, making a public spectacle of your behaviors is inexcusable and shameful. \n\nMy concern is for the children. They absorb her habits and behaviors like sponges and I hope to God they manage to come out of that upbringing with normal relationships with food and body. This is unlikely. Please speak to your brother and get them in therapy asap, if that's at all doable. The damage their mother has done/is doing could ruin them.",
          "created_utc": 1717002569.0
        },
        {
          "id": "l6a6vfm",
          "author": "HeadFault6866",
          "body": "Oh I wish. I don't think she wants to. We have some of the best mental health facilities around us and just a short drive at that but I don't think there is any willingness. \n\nThe boys take to their father and are very outgoing but have unhealthy junk food diets. The daughter has become more withdrawn as she goes through her teen years. She is very emotionally intelligent and mature but I think the unstable/unconventional household dynamics are taking a toll on her.",
          "created_utc": 1717044443.0
        }
      ]
    },
    {
      "id": "l68umwq",
      "author": "VastReveries",
      "body": "Using ozempic to treat bulimia is honestly just perpetuating disordered eating behaviors. It doesn't tackle the root cause of the issues.",
      "created_utc": 1717023267.0,
      "score": 8,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l67snd6",
          "author": "AnybodyLow",
          "body": "I was thinking this too. I don’t think anyone enjoys having bulimia, it’s compulsive and it’s a cycle that’s hard to stop even when you’re trying your hardest. I’ve heard people talk about ozempic as almost being a miracle for their food thoughts/urges, it’s such an interesting pov to think about",
          "created_utc": 1717009673.0
        },
        {
          "id": "l67uj1y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717010318.0
        }
      ]
    },
    {
      "id": "l6csx0f",
      "author": "VastReveries",
      "body": "A chemical agent to aid an addiction in the addition of specialized therapy is not always a bad thing. However, I don't think it is wise to compare the chemical treatment of substance abuse to the chemical treatment of an eating diaorder. This is an opinion shared by my therapist who used to run eating disorder clinics. The mechanism of \"addiction\" to an eating disorder is not the same. In addition, Ozempic is not approved as a treatment for bulimia which is why I don't think there should be any discussion in favor of that method on this subreddit. I'd argue that this new Ozempic culture is incredibly disordered in a large percentage of cases (not all).\n\nWith that in mind, I'd like you to consider what the medications can potentially do to perpetuate disordered eating and diet culture mentality. If we use a stimulant such as Vyvanse, its mechanism of action is to suppress appetite. While appetite can be a component of eating disorders, appetite is not what fuels a disorder.  There are plenty of people who receive appetite suppressants to \"help\" binge eating with no therapy, and the medication is not enough. There are people who get gastric bypass procedures to try and \"control their eating\" who will still binge eat and engage in disordered eating behaviors. \n\nIn summary, chemical treatment can be okay, but it should never be the sole form of treatment. Drugs should be used in accordance with what they are used to treat, and discussing non-approved off-label use should not be encouraged on a subreddit meant to be more recovery-oriented.",
      "created_utc": 1717091753.0,
      "score": 5,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l68ug5d",
          "author": "VastReveries",
          "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
          "created_utc": 1717023195.0
        },
        {
          "id": "l6bgy9k",
          "author": "AnybodyLow",
          "body": "I’m not saying this in an argumentative way, but what’s the difference with bulimia being partially treated with a drug vs using other drugs to help with opioid addiction? Obviously just a drug isn’t going to help, and therapy and getting down to the root cause is essential. I think EDs are extremely complex, both chemically and emotionally. Taking care of the chemical aspect might assist in helping the emotional component",
          "created_utc": 1717073668.0
        }
      ]
    },
    {
      "id": "l6e9x9n",
      "author": "VastReveries",
      "body": "Food addiction is a term used by diet culture and not supported by the scientific community. I already explained in detail that a medication can aid a problem, but it cannot solve it. I also said that Ozempic is not approved for use for bulimia, so it isn't appropriate to support its use for that on a recovery-oriented subreddit.",
      "created_utc": 1717110493.0,
      "score": 1,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l68ug5d",
          "author": "VastReveries",
          "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
          "created_utc": 1717023195.0
        },
        {
          "id": "l6e1qkb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717107433.0
        }
      ]
    },
    {
      "id": "l695oo8",
      "author": "Wrong-Tell8996",
      "body": "Agreed. I used to use a drug outside of its intended purpose to lose weight, and it really started the downward spiral of my anorexia.  \nI hate seeing ozempic ads on reddit, I find them very triggering. As someone who's been on plenty of meds--trying to fix her disordered eating issues with the, \"miracle weight loss drug,\" doesn't make sense to me.",
      "created_utc": 1717027705.0,
      "score": 7,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l67snd6",
          "author": "AnybodyLow",
          "body": "I was thinking this too. I don’t think anyone enjoys having bulimia, it’s compulsive and it’s a cycle that’s hard to stop even when you’re trying your hardest. I’ve heard people talk about ozempic as almost being a miracle for their food thoughts/urges, it’s such an interesting pov to think about",
          "created_utc": 1717009673.0
        },
        {
          "id": "l67uj1y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717010318.0
        },
        {
          "id": "l68umwq",
          "author": "VastReveries",
          "body": "Using ozempic to treat bulimia is honestly just perpetuating disordered eating behaviors. It doesn't tackle the root cause of the issues.",
          "created_utc": 1717023267.0
        }
      ]
    },
    {
      "id": "l6n0k0g",
      "author": "Witty-Bid1612",
      "body": "I saw a YouTube that made a good point about this: Ozempic apparently removes the urges to binge/overeat, then you're left with all of the emotions you haven't dealt with, that caused the issues in the first place. Which is supposedly why people say there is so much depression/anxiety on Ozemic -- all the feelings are still there! No way out but through. Ugh.",
      "created_utc": 1717256884.0,
      "score": 3,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l67snd6",
          "author": "AnybodyLow",
          "body": "I was thinking this too. I don’t think anyone enjoys having bulimia, it’s compulsive and it’s a cycle that’s hard to stop even when you’re trying your hardest. I’ve heard people talk about ozempic as almost being a miracle for their food thoughts/urges, it’s such an interesting pov to think about",
          "created_utc": 1717009673.0
        },
        {
          "id": "l67uj1y",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717010318.0
        },
        {
          "id": "l68umwq",
          "author": "VastReveries",
          "body": "Using ozempic to treat bulimia is honestly just perpetuating disordered eating behaviors. It doesn't tackle the root cause of the issues.",
          "created_utc": 1717023267.0
        }
      ]
    },
    {
      "id": "l6f0xp4",
      "author": "wh0thi5",
      "body": "I mostly agree with you, but just because a medication is not approved to treat a specific disorder yet does not mean it never will be or that it’s counterproductive to speculate ways it might be helpful in the treatment of that disorder. \n\nI work in rheumatology and a LOT of the medications we use to treat various rheumatic/arthritic conditions became approved treatments because people noticed that the medication was helping with symptoms of another ailment. For example, Cymbalta is one of the best drugs (imo) for treating fibromyalgia and arthritic pain and for a while that would have been an off label use until it was approved as a treatment for those conditions. It started out just as an antidepressant. \n\nSemaglutides started out as diabetes medications, and for a while prescribing them for weight loss/BED was off-label. I don’t think it’s irresponsible to speculate that GLPs could be helpful with bulimia in combination with other therapies",
      "created_utc": 1717121148.0,
      "score": 3,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l68ug5d",
          "author": "VastReveries",
          "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
          "created_utc": 1717023195.0
        },
        {
          "id": "l6bgy9k",
          "author": "AnybodyLow",
          "body": "I’m not saying this in an argumentative way, but what’s the difference with bulimia being partially treated with a drug vs using other drugs to help with opioid addiction? Obviously just a drug isn’t going to help, and therapy and getting down to the root cause is essential. I think EDs are extremely complex, both chemically and emotionally. Taking care of the chemical aspect might assist in helping the emotional component",
          "created_utc": 1717073668.0
        },
        {
          "id": "l6csx0f",
          "author": "VastReveries",
          "body": "A chemical agent to aid an addiction in the addition of specialized therapy is not always a bad thing. However, I don't think it is wise to compare the chemical treatment of substance abuse to the chemical treatment of an eating diaorder. This is an opinion shared by my therapist who used to run eating disorder clinics. The mechanism of \"addiction\" to an eating disorder is not the same. In addition, Ozempic is not approved as a treatment for bulimia which is why I don't think there should be any discussion in favor of that method on this subreddit. I'd argue that this new Ozempic culture is incredibly disordered in a large percentage of cases (not all).\n\nWith that in mind, I'd like you to consider what the medications can potentially do to perpetuate disordered eating and diet culture mentality. If we use a stimulant such as Vyvanse, its mechanism of action is to suppress appetite. While appetite can be a component of eating disorders, appetite is not what fuels a disorder.  There are plenty of people who receive appetite suppressants to \"help\" binge eating with no therapy, and the medication is not enough. There are people who get gastric bypass procedures to try and \"control their eating\" who will still binge eat and engage in disordered eating behaviors. \n\nIn summary, chemical treatment can be okay, but it should never be the sole form of treatment. Drugs should be used in accordance with what they are used to treat, and discussing non-approved off-label use should not be encouraged on a subreddit meant to be more recovery-oriented.",
          "created_utc": 1717091753.0
        }
      ]
    },
    {
      "id": "l6ekwq8",
      "author": "publichealthnerd46",
      "body": "My ED therapist said she thinks of disordered eating behaviors as more of a compulsion than an addiction. Some similar features, but biologically different. I also agree with your stance on Ozempic. I think in this case there would be a huge risk of that bulimia taking on more anorexia features. It is common for people to \"switch\" disorders (I put that in quotes because it's not the best word but gets the point across), or experience features of multiple disorders at the same time, such as binge-purge type of anorexia.",
      "created_utc": 1717114775.0,
      "score": 2,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l68ug5d",
          "author": "VastReveries",
          "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
          "created_utc": 1717023195.0
        },
        {
          "id": "l6e1qkb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717107433.0
        },
        {
          "id": "l6e9x9n",
          "author": "VastReveries",
          "body": "Food addiction is a term used by diet culture and not supported by the scientific community. I already explained in detail that a medication can aid a problem, but it cannot solve it. I also said that Ozempic is not approved for use for bulimia, so it isn't appropriate to support its use for that on a recovery-oriented subreddit.",
          "created_utc": 1717110493.0
        }
      ]
    },
    {
      "id": "l6eevr5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717112396.0,
      "score": 2,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l68ug5d",
          "author": "VastReveries",
          "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
          "created_utc": 1717023195.0
        },
        {
          "id": "l6e1qkb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717107433.0
        },
        {
          "id": "l6e9x9n",
          "author": "VastReveries",
          "body": "Food addiction is a term used by diet culture and not supported by the scientific community. I already explained in detail that a medication can aid a problem, but it cannot solve it. I also said that Ozempic is not approved for use for bulimia, so it isn't appropriate to support its use for that on a recovery-oriented subreddit.",
          "created_utc": 1717110493.0
        }
      ]
    },
    {
      "id": "l6fdige",
      "author": "VastReveries",
      "body": "I understand that it's okay to speculate, but I don't think a recovery-oriented subreddit is a place to discuss the use of Ozempic to \"treat\" an eating disorder. It perpetuates disordered eating behaviors.",
      "created_utc": 1717126524.0,
      "score": 1,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l68ug5d",
          "author": "VastReveries",
          "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
          "created_utc": 1717023195.0
        },
        {
          "id": "l6bgy9k",
          "author": "AnybodyLow",
          "body": "I’m not saying this in an argumentative way, but what’s the difference with bulimia being partially treated with a drug vs using other drugs to help with opioid addiction? Obviously just a drug isn’t going to help, and therapy and getting down to the root cause is essential. I think EDs are extremely complex, both chemically and emotionally. Taking care of the chemical aspect might assist in helping the emotional component",
          "created_utc": 1717073668.0
        },
        {
          "id": "l6csx0f",
          "author": "VastReveries",
          "body": "A chemical agent to aid an addiction in the addition of specialized therapy is not always a bad thing. However, I don't think it is wise to compare the chemical treatment of substance abuse to the chemical treatment of an eating diaorder. This is an opinion shared by my therapist who used to run eating disorder clinics. The mechanism of \"addiction\" to an eating disorder is not the same. In addition, Ozempic is not approved as a treatment for bulimia which is why I don't think there should be any discussion in favor of that method on this subreddit. I'd argue that this new Ozempic culture is incredibly disordered in a large percentage of cases (not all).\n\nWith that in mind, I'd like you to consider what the medications can potentially do to perpetuate disordered eating and diet culture mentality. If we use a stimulant such as Vyvanse, its mechanism of action is to suppress appetite. While appetite can be a component of eating disorders, appetite is not what fuels a disorder.  There are plenty of people who receive appetite suppressants to \"help\" binge eating with no therapy, and the medication is not enough. There are people who get gastric bypass procedures to try and \"control their eating\" who will still binge eat and engage in disordered eating behaviors. \n\nIn summary, chemical treatment can be okay, but it should never be the sole form of treatment. Drugs should be used in accordance with what they are used to treat, and discussing non-approved off-label use should not be encouraged on a subreddit meant to be more recovery-oriented.",
          "created_utc": 1717091753.0
        },
        {
          "id": "l6f0xp4",
          "author": "wh0thi5",
          "body": "I mostly agree with you, but just because a medication is not approved to treat a specific disorder yet does not mean it never will be or that it’s counterproductive to speculate ways it might be helpful in the treatment of that disorder. \n\nI work in rheumatology and a LOT of the medications we use to treat various rheumatic/arthritic conditions became approved treatments because people noticed that the medication was helping with symptoms of another ailment. For example, Cymbalta is one of the best drugs (imo) for treating fibromyalgia and arthritic pain and for a while that would have been an off label use until it was approved as a treatment for those conditions. It started out just as an antidepressant. \n\nSemaglutides started out as diabetes medications, and for a while prescribing them for weight loss/BED was off-label. I don’t think it’s irresponsible to speculate that GLPs could be helpful with bulimia in combination with other therapies",
          "created_utc": 1717121148.0
        }
      ]
    },
    {
      "id": "l6fe0t2",
      "author": "VastReveries",
      "body": "\"Food addiction\" is a word perpetuated by diet culture. I understand disordered eating behaviors are habitual, but that doesn't make \"food addiction\" or \"sugar addiction\" valid terms to be used.",
      "created_utc": 1717126769.0,
      "score": 0,
      "context": [
        {
          "id": "l66ysgz",
          "author": "valerieflames",
          "body": "I’m wondering if ozempic could potentially help her by helping to stop the binges thus stopping the purges.",
          "created_utc": 1716999421.0
        },
        {
          "id": "l68ug5d",
          "author": "VastReveries",
          "body": "This isn't an appropriate use of the drug. There are much bigger problems here, and I can guarantee you as a professional that a medication won't fix this.",
          "created_utc": 1717023195.0
        },
        {
          "id": "l6e1qkb",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717107433.0
        },
        {
          "id": "l6e9x9n",
          "author": "VastReveries",
          "body": "Food addiction is a term used by diet culture and not supported by the scientific community. I already explained in detail that a medication can aid a problem, but it cannot solve it. I also said that Ozempic is not approved for use for bulimia, so it isn't appropriate to support its use for that on a recovery-oriented subreddit.",
          "created_utc": 1717110493.0
        },
        {
          "id": "l6eevr5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717112396.0
        }
      ]
    }
  ]
}