{
  "id": "1d5jvfx",
  "subreddit": "EatingDisorders",
  "author": "Gloomy_March_7677",
  "created_utc": 1717237048.0,
  "title": "Started passing out * update* (and thank you) ",
  "selftext": "\na year ago i originally posted the below\n\n“i’ve reached a point in my body where i’ve recently started passing out some days and i know it’s bad i’m trying to get better but today i passed out and hit my head and i think it’s kinda been a wake up call, no one around me knows how i’m struggling and i live alone, do i reach out and tell someone about these passing out fits? or do i just keep ignoring them and carrying on”\n\nto which i received a dozen comments telling me to go get help immediately, at this time my bmi was seriously low and still wanted to get lower (it’s true when they say you’ll never stop at your dream weight) the comments i received on this post were harsh but the shake my deeply malnourished brain needed. \n\ni wanted to come back and say thank you to everyone who commented and this subreddit! when something in your brain is telling you to ask for help it’s the part of you that wants to live and dream! \n\nSince this post i have recovered to a healthy body weight, travelled the world, lived in new york and recently started law school! all things i never thought i could do, i wanted to be valued for my body and beauty because i didn’t believe i had anything else to offer. I put in the extremely hard work (and it was extremely hard) but my mind is at a place now where i can look back at these things and not wish to be the person i was when i posted that. When i look back i see a person who was so close to death and throwing away my chance smile and laugh for what? someone to look at my sucken eyes, rib cage and thigh gap and think “wow she’s pretty” because trust me that’s not what their thinking. \n\nif anyone wants to reach out for help, it’ll be the best think you ever do, don’t throw away your smile and laugh for looking good in a photo because that’s not what you’ll remember about when you took that photo. \n\nThank you everyone again. \n\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1d5jvfx/started_passing_out_update_and_thank_you/",
  "score": 56,
  "num_comments": 6,
  "comments": [
    {
      "id": "l6qfzsr",
      "author": "dungeonsovereign",
      "body": "I’m so proud of you OP, I’ve had a very similar journey. Here’s to being healthier and happier! 🥂",
      "created_utc": 1717309697.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l6qjr3x",
      "author": "rorythebookworm",
      "body": "I really look up to you!⭐️✨",
      "created_utc": 1717312323.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l6rkmkl",
      "author": "Loreannexx",
      "body": "its always so inspiring to hear such a story ! Congratulations on the recovery ❤️‍🩹",
      "created_utc": 1717335784.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6rknkb",
      "author": "Loreannexx",
      "body": "its always so inspiring to hear such a story ! Congratulations on the recovery ❤️‍🩹",
      "created_utc": 1717335795.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l6qv2jd",
      "author": "Sick_Nuggets_69",
      "body": "That is incredible!!! I’m so happy for you!!!",
      "created_utc": 1717320732.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l79uhk1",
      "author": "DamageCorrect",
      "body": "This is a wonderful update!",
      "created_utc": 1717619666.0,
      "score": 1,
      "context": []
    }
  ]
}