{
  "id": "1d5xz2s",
  "subreddit": "EatingDisorders",
  "author": "spoildsweet",
  "created_utc": 1717279105.0,
  "title": "I’m worried my bf’s bad eating habits are making me want to relapse",
  "selftext": "Hey everyone :) I’ve been recovered from a restrictive ED for about 18 months now, but I recently got a bf and I’m struggling again. \n\nFor context, when I first met him, I wondered if he had an ED himself as he never seems to eat much and he’s pretty skinny, but later realised he’s just one of those teen boys who has a fast metabolism and a small appetite which keeps him from gaining weight. Actually, he often brings up how he wants to gain weight for his health/for aesthetic reasons. My problem is that being around someone who never really seems hungry, or who buys food but doesn’t eat most of it, is starting to push me back into old mindsets. I really like him and he’s an amazing person, I feel so guilty letting something like this get in between us but I can’t seem to help it. \n\nIt seems like any time I spend with him I end up not eating anything. Last week I was at his house for about 8 hours and we didn’t anything cos he never brought food up and I was too embarrassed to say I was hungry. \n\nIf anyone has any advice that’d be so helpful. I’m still not sure if he may have an ED or if he’s just genuinely never hungry, but either way I can feel myself getting worse and I don’t know how to resolve this. It feels like I’m just making a big deal of something not that important \n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1d5xz2s/im_worried_my_bfs_bad_eating_habits_are_making_me/",
  "score": 46,
  "num_comments": 14,
  "comments": [
    {
      "id": "l6sio2r",
      "author": "seesawdna",
      "body": "maybe you should bring it up, I did with my boyfriend about my recovery and he was very supportive about it . He has weird eating habits too but tries to help me with my overthinking. If you feel comfortable enough you should consider this.",
      "created_utc": 1717349017.0,
      "score": 22,
      "context": []
    },
    {
      "id": "l6sxewr",
      "author": "Anonymoususerstories",
      "body": "ME TOO OMG SAME SITUATION ITS FRUSTRATING",
      "created_utc": 1717354426.0,
      "score": 16,
      "context": []
    },
    {
      "id": "l6syo6r",
      "author": "None",
      "body": "that's a sad situation I'm sorry.  \nhe could really have a small appetite and fast metabolism yeah. If it's taking you back into bad habits you should try to bring it up with him, since talking about weight with him is OK since he's talking about wanting to gain weight right. If he's really nice then he'll be supportive.  \nif you can't get yourself to talk to him about it or ask for food first, maybe just take a snack in your bag to eat when you hang out, so you don't have to ask him if it's too embarrassing. it would be a little more food which is good. some protein bars taste p good actually. lol",
      "created_utc": 1717354886.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l6ubb18",
      "author": "mooglebb",
      "body": "That sounds soo tough--i'm so sorry that's happening! I agree with the other comments though about if you're comfortable enough, maybe bringing up the fact that restrictive eating is something you've struggled with, and how it's really important for your recovery journey to make sure you eat consistent meals to prevent slipping backwards. It sounds like like he's a sweet guy, and since he often mentions wanting to gain weight for his own health, approach it as a way to also hold each other accountable for making sure you both eat. It's scary opening up about this stuff, but it sounds like in order for a healthy relationship, and for your own physical and mental health, it's something that needs to be approached! you guys got this :)",
      "created_utc": 1717374002.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l6ux0gu",
      "author": "PathxFind3r",
      "body": "Have you sought professional help? Communicating to him how you feel is important",
      "created_utc": 1717383332.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6xcgzm",
      "author": "strawberryknots",
      "body": "i recommend talking about or at least hinting about how you feel because i know i had the same problem till i started hinting my problems and he caught on eventually so we discussed everything and he was very understanding and comforting about it. it may be hard but it’s better than falling into bad habits as communication is also very important in a relationship and trust he will understand it as most people are very understanding about ed’s especially when in recovery.",
      "created_utc": 1717429752.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6ybuc1",
      "author": "Alert-Anteater-4188",
      "body": "omg i never found anyone who struggles with the same thing i do!! im so sorry u have to feel this way and i fully understand how triggering and frustrating it is to see someone just naturally not think about food and be skinny without knowing anything abt eds or calories :,) my bf of 4 years is exactly the same and he never really cares abt macros or calories and is very sedentary and as someone with ortho and anorexia its so frustrating and hard to wrap my head around his way of living and how he can just look like that. im still trying to find a way of dealing with this ... ive been recovering for years .. i think around 2? and i still have no idea how to cope :,) i would say to maybe talk to him about it if u feel comfortable enough? u guys can eat / cook together! to me that doenst really work as my bf eats really small portions and its still triggering .. but im sure theres a way out there! be open and honest and im sure he will understand your situation and want to help u <3 take care and i hope u will feel better soon !!",
      "created_utc": 1717441592.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l73hibl",
      "author": "Outrageous-Till2753",
      "body": "well, if he wants to gain weight and you are hungry, the only logical thing would be for both of you to eat! \n\nalso, coming from a guy, of course i can’t speak for everyone, but i don’t think you should ever be ashamed of eating, even if that means eating more than your partner or eating something that isn’t as nutritious as what your partner is eating. i’ve never been in a situation where i was like “oh wow this person is eating a lot”, at least not before my disordered eating habits started. because if you’re normal around food, you really don’t pay attention to how much or what other people really eat. at least that’s my experience. \n\non another note, remember the freedom you have. the tasty foods, the amazing dates, the shared ice creams and movie nights. the life you have. a life that is exhausting when all you focus on is calories and food. \n\nlast but not least, no matter how old or young you are, no matter how fresh the relationship and no matter how scary it might seem: communication is key to absolutely everything. and again, this should be a fairly easy talk to have since he wants to gain weight anyway, so eating more together doesn’t sound like a bad idea from any standpoint in my eyes. \n\ndon’t be ashamed to be hungry, just because some dumbass made you believe women don’t deserve to be hungry or any of that bullshit! best of luck :)",
      "created_utc": 1717523585.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l6sqeb0",
      "author": "Tasteslikeakiwi",
      "body": "Just because you have ED, doesn’t mean he does too, that’s unfair of you to think. I swear most men are just like him. It’s important that you be open and honest about YOUR problem. Let him know, I’m sure he will understand. I think a good way of him helping is making sure you eat even if he doesn’t. Because making him feel guilty about not eating is pretty unfair. \n\nFurthermore, if he triggers you, I don’t think you’re ready for a relationship, you’re being co-dependent and that’s extremely unhealthy. And it will continue on in all your relationships. Have you taken therapy?",
      "created_utc": 1717351841.0,
      "score": -8,
      "context": []
    },
    {
      "id": "l7jds0d",
      "author": "spoildsweet",
      "body": "Thank you! I think you’re right, it’s probably best to bring it up to him rather than just stewing on it myself\n\nI’m pretty nervous but I’m trying to remember he’s a good person and he’s not gonna judge me",
      "created_utc": 1717772720.0,
      "score": 1,
      "context": [
        {
          "id": "l6sio2r",
          "author": "seesawdna",
          "body": "maybe you should bring it up, I did with my boyfriend about my recovery and he was very supportive about it . He has weird eating habits too but tries to help me with my overthinking. If you feel comfortable enough you should consider this.",
          "created_utc": 1717349017.0
        }
      ]
    },
    {
      "id": "l7jdz82",
      "author": "spoildsweet",
      "body": "Thank you ! Bringing a snack is a good idea actually, don’t know why I didn’t think of that",
      "created_utc": 1717772788.0,
      "score": 2,
      "context": [
        {
          "id": "l6syo6r",
          "author": "None",
          "body": "that's a sad situation I'm sorry.  \nhe could really have a small appetite and fast metabolism yeah. If it's taking you back into bad habits you should try to bring it up with him, since talking about weight with him is OK since he's talking about wanting to gain weight right. If he's really nice then he'll be supportive.  \nif you can't get yourself to talk to him about it or ask for food first, maybe just take a snack in your bag to eat when you hang out, so you don't have to ask him if it's too embarrassing. it would be a little more food which is good. some protein bars taste p good actually. lol",
          "created_utc": 1717354886.0
        }
      ]
    },
    {
      "id": "l7je7wj",
      "author": "spoildsweet",
      "body": "Thank you for your advice! Honestly, I’ve got way more support than I was expecting, this has made me more confident that this is something worth talking to him about",
      "created_utc": 1717772872.0,
      "score": 2,
      "context": [
        {
          "id": "l6ubb18",
          "author": "mooglebb",
          "body": "That sounds soo tough--i'm so sorry that's happening! I agree with the other comments though about if you're comfortable enough, maybe bringing up the fact that restrictive eating is something you've struggled with, and how it's really important for your recovery journey to make sure you eat consistent meals to prevent slipping backwards. It sounds like like he's a sweet guy, and since he often mentions wanting to gain weight for his own health, approach it as a way to also hold each other accountable for making sure you both eat. It's scary opening up about this stuff, but it sounds like in order for a healthy relationship, and for your own physical and mental health, it's something that needs to be approached! you guys got this :)",
          "created_utc": 1717374002.0
        }
      ]
    },
    {
      "id": "l7jf2fk",
      "author": "spoildsweet",
      "body": "I have had some professional help for my ED, although it was about a year ago so we never discussed relationships \nI do agree communication is important, after reading all the comments I think I’m gonna try to tell him how I feel",
      "created_utc": 1717773159.0,
      "score": 1,
      "context": [
        {
          "id": "l6ux0gu",
          "author": "PathxFind3r",
          "body": "Have you sought professional help? Communicating to him how you feel is important",
          "created_utc": 1717383332.0
        }
      ]
    },
    {
      "id": "l6tuclk",
      "author": "Idiot_Introvert",
      "body": "Did you even read the post? They said he doesn’t have an ED",
      "created_utc": 1717366958.0,
      "score": 1,
      "context": [
        {
          "id": "l6sqeb0",
          "author": "Tasteslikeakiwi",
          "body": "Just because you have ED, doesn’t mean he does too, that’s unfair of you to think. I swear most men are just like him. It’s important that you be open and honest about YOUR problem. Let him know, I’m sure he will understand. I think a good way of him helping is making sure you eat even if he doesn’t. Because making him feel guilty about not eating is pretty unfair. \n\nFurthermore, if he triggers you, I don’t think you’re ready for a relationship, you’re being co-dependent and that’s extremely unhealthy. And it will continue on in all your relationships. Have you taken therapy?",
          "created_utc": 1717351841.0
        }
      ]
    }
  ]
}