{
  "id": "1dakgti",
  "subreddit": "EatingDisorders",
  "author": "69clementines",
  "created_utc": 1717790989.0,
  "title": "Told my boyfriend about my eating disorder but his response (work out more!) just made it worse",
  "selftext": "I (F30) have been seeing my boyfriend (M23) for a few months now. I had a bad eating disorder in my early 20s but since then I’ve been doing really well other than the odd bad dayor so. I’ve always been able to snap myself back out of it quickly. No man I’ve dated since has ever triggered anything in me until this guy..\nWhen I first started seeing my boyfriend I noticed he followed a lot of very skinny insta models.. like VERY skinny. Some of the pictures he had liked were extremely shocking to me (skeletal women with visible rib cages) and it felt like a punch in the stomach and from there it’s just completely reignited my insecurities with my body and made me question how he could be attracted to me when I am so much bigger than these girls. \nSince then I’ve been restricting food again and exercising a lot. It got obsessive and even though I’ve been losing weight I’ve just felt worse and worse about myself and still not good enough. My boyfriend does compliment me a lot, but other than my boobs he’s not ever made a compliment specifically about my body, just generic ‘you look hot/sexy’. The last guy I was seeing’s jaw would literally drop every time he saw me naked and he would tell me repeatedly that I have the most perfect body he’s ever seen, so in comparison to him, plus the instagram pictures, I just know I don’t have his ideal body.\n\nAnyway things started getting bad recently and I decided to let him in on how I was feeling. His response was ‘if you want to be skinny then just go to the gym more’.. I told him how much I’d been working out and he was like ‘well not rigorously enough’ and he was discussing like meal plans and stuff too. It just made me feel 10000x worse about myself, like he was agreeing with my ED. Not once did he reassure me and say I was already skinny. Tbh that’s all I really needed. For him to say I am skinny and he’s super attracted to me and I would have been fine. \n\nI know he was coming from a clueless place, just trying to be supportive and clearly hadn’t got a clue about EDs so I encouraged him to research it but he got a bit annoyed with me when I mentioned it. He reluctantly agreed but I’m not sure he actually will. \n\nIn every other way he’s the perfect boyfriend and I love him so much but I just feel so much worse after telling him and I wish I just didn’t say anything. How can I make myself feel better and not focus on his encouragement to workout more? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1dakgti/told_my_boyfriend_about_my_eating_disorder_but/",
  "score": 61,
  "num_comments": 21,
  "comments": [
    {
      "id": "l7nzufe",
      "author": "Obvious_Smoke3633",
      "body": "Staying with this man will ruin you. I've been in your shoes before, and it doesn't get better. He doesn't care about your physical or mental well-being. Staying with him would be another form of self-harm. You can do better than this.",
      "created_utc": 1717848953.0,
      "score": 81,
      "context": []
    },
    {
      "id": "l7oc9tm",
      "author": "I_need_to_vent44",
      "body": "Yeeeeeaaaaa don't do this to yourself. It doesn't matter that he \"doesn't mean it\". Most people who hurt other people don't mean it. Intentions are rarely malicious but words and actions hurt either way. Parents who hit their children do it \"for the child's good\" and they genuinely believe that. Still, we understand that it's absolutely awful and incredibly harmful.\n\n\n\nYour boyfriend's behaviour is harmful to you and he doesn't seem to be receptive to the idea of changing it. I've been in a similar boat with family and ex-friends and let me tell you, it is BAD to be surrounded by people who encourage and support your eating disorder.\n\n\n\n\nIf you tell someone \"I haven't eaten in three days and the day before that I had a salad so you know I need to go run 14 km today even though it's raining because it will burn XXX calories haha.\" and they tell you \"Yassss you should do it!! That's so stonks!!\" Get out of there.",
      "created_utc": 1717854857.0,
      "score": 23,
      "context": []
    },
    {
      "id": "l7o70kn",
      "author": "pathyrical",
      "body": "someone like that is so disgusting to me lol. I don't date men who have severely unrealistic preferences for women's bodies, which is often a symptom of internet/porn/instagram brainrot. I actually hate thinking that those people can get any girlfriends at all. Anorexia has one of the highest mortality rates of any psychiatric disorder. Do not let this man help kill you oh my god. \n\nHaving a boyfriend helped me recover (this was years ago) because he ate all my meals with me and reassured me over and over that I was still beautiful and he still loved me even when i was gaining recovery weight 🙏. And he encouraged me not to hurt myself exercising because I would exercise until I was in so so much pain. Having pure love during this process is so so valuable and can be so helpful in those dark moments. So honestly your bf making your illness worse is so infuriating. \n\nmaybe he doesn't understand that he's hurting you but that doesn't mean he isn't. it also doesn't have to be an additional burden on you to try and \"educate\" him on the impact of your mental illness if he heard you the first time and failed to read the room. \n\nIf he really was the prefect boyfriend he would care about your obvious distress around this topic and not give you more tips on how to hurt yourself more effectively lol. The perfect boyfriend listens when you say that his actions are hurting you. \n\nAnyway. I would say it is really important with all the information you have to think a lot about what is best for you. If you think he is able to listen to you and change the way he offers support to not make your mental illness worse (and maybe make it better) then maybe he is the perfect boyfriend and you should keep him in your life. If you look at him and you already know he can't support you like that then you're lying to yourself lol. What are you going to do the next time you have a problem he doesn't understand, you could get screwed again! Romantic partners should not make your life worse!!! That is not what they are for!!!",
      "created_utc": 1717852521.0,
      "score": 18,
      "context": []
    },
    {
      "id": "l7ofsdp",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1717856326.0,
      "score": 18,
      "context": []
    },
    {
      "id": "l7p19pu",
      "author": "Wrong-Tell8996",
      "body": "I understand you care about him, but you need to care about yourself too, and this guy does not seem like a willing participant in that.  \nSome people do not know how to approach people with EDs... my boyfriend didn't handle it well at first but that was about him learning not to pressure me to eat/shame me for not eating... your boyfriend is encouraging you to enter the downward spiral. Even without knowing how to approach an ED, when you're sharing vulnerability about your body and all that, his response was to encourage it by telling you that you aren't working out rigorously enough?  \nThen he got annoyed with you when you suggested resources to help him understand... you should feel safe sharing these things with your boyfriend, and even if he doesn't know how to respond, he demonstrated impatience and dismissiveness and reluctance in trying to figure out how to support you. Doesn't sound like he showed compassion or patience for what you were feeling.\n\nYOU are worth it. Dealing with a guy spending his time scrolling through instagram is not worth it and telling you you're not working out rigorously enough? Also not worth it.  \nDon't focus on comparing yourself to all those instagram girls or feeling like you're not enough. You are enough for a man who will appreciate you and be there for you. Focus on returning to healing and self-love, since it seems he's not very interested in being a part of that you know? Commenting on your boobs and saying you're hot doesn't constitute as being there for your well-being.\n\nI know it's hard but he sounds like a vacuum for your self-confidence. He can have other qualities but this is an important issue and he's encouraging an unhealthy mindset. You are important. Please take care of yourself. This is about your health, and really doesn't seem like he's going to be a contributor to that.\n\nIf he actually tries to change and start encouraging you to be healthy and love yourself, that's one thing. If not, quite simply, you really should get out. Sorry for what you're going through. I believe in your strength",
      "created_utc": 1717864595.0,
      "score": 9,
      "context": []
    },
    {
      "id": "l7s563h",
      "author": "yuviana",
      "body": "you’re 30, he’s 23 of course he doesn’t understand anything. Dump his ass and date people who have the same level of maturity and empathy as you. Please.",
      "created_utc": 1717914313.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l7pk7ux",
      "author": "kwumpus",
      "body": "He’s 23 he might still be somewhat attracted to women that haven’t like fully gone through puberty or you know have but are still very skinny (just wait haha).  And EDs are very difficult to explain to most ppl esp when you appear to be ok.   Overall I can promise you men are much more attracted to women that look like they have enough fat on them to get their periods at the minimum.  I had an earring disorder at 14 at 21 I was on a mood stabiliser that kept my weight low.  When I went off it I gained some weight and although of course I was sadly upset with it I noticed that after I gained some weight there was a lot more male attention.\nAlso while I had no control over my eating at the time I couldn’t tell but I look back at when my weight was low and I look like I’m dying.  At age 25 I actually fully developed.",
      "created_utc": 1717871820.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l7rkjr3",
      "author": "Substantial_Glass348",
      "body": "Yeah as a man, that sounds v weird to me - being attracted to skinny with rib cage exposed etc. I think the vast majority of people (any sex) are attracted to health/well nourished bodies as biologically we’re attracted to good hormonal functioning, energy, etc",
      "created_utc": 1717902407.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7szw6m",
      "author": "jammyraspberry",
      "body": "Date someone your own age.",
      "created_utc": 1717935374.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l7pn8qw",
      "author": "None",
      "body": "Um, yeah, about him... Don't do it. Put yourself absolutely first. It's not his intention (the road to hell is paved)- it's his lack of understanding the IMPACT his idiotic, superficial comments  are having on you. Try to prioritize your well- being.",
      "created_utc": 1717872983.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7t41b4",
      "author": "blondie5912",
      "body": "I mean, he’s 23 and youre 30.",
      "created_utc": 1717937417.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7tyw8c",
      "author": "AppearancePretend8",
      "body": "dump him sis he is so ignorant and it’s such a turn off plus it will only ruin your mental and physical health even more, he ain’t worth it",
      "created_utc": 1717949705.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7xtfay",
      "author": "MercurialChickadee",
      "body": "People who are “perfect in most ways” are uncommon. He’s likely a talented actor and sociologist… mind you I’m not seeing he’s psycopathic or sociopathic, but he might be somewhat weak in sympathy…",
      "created_utc": 1718011789.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l7vr1zs",
      "author": "Freezingcoldk",
      "body": "He did mean it girl don’t be delusional sorry. His ideal body for a woman is skeletal, he wants you to workout and diet more, he doesn’t complement your body like he actually means it.\nAny adult in these times would have at least a slight grasp on what an ed is and even if not it’s just common decency to react with concern to obviously concerning information like come on.\nFrom what you’re describing it want him being “clueless” it was him being enthusiastic about the idea of you becoming skinny enough for him.",
      "created_utc": 1717972931.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7vzlyr",
      "author": "lunavrses",
      "body": "he doesn\"t contribute to your well being, never change your self for a man. you will always find someone better",
      "created_utc": 1717976475.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7x13f1",
      "author": "None",
      "body": "This man will not do any good. I have had an ED for a while now and I had a gf who was like this. Seriously, it doesn’t get any better and even though they seem perfect, it’s often because you are blinding yourself to the negatives. While it might seem to be alright at the time, you will regret it later",
      "created_utc": 1717992920.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l8006ac",
      "author": "lifeofduder",
      "body": "Apologies in advance if it doesn't go down well but I'm not pretending to offend anyone. You should leave this guy, he's very toxic for you. That kind of comments are out of place and clearly it's messing with your mental and physical health. You even risk going back to the dark place an eating disorder is. You deserve someone better. Good luck!",
      "created_utc": 1718044139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l87o36l",
      "author": "ethelcainfan",
      "body": "Break up is the only answer, staying with man like that is not worth it",
      "created_utc": 1718159329.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l8a72cq",
      "author": "nona1717",
      "body": "Dump him. He’s a literal child.",
      "created_utc": 1718206335.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l93cyin",
      "author": "Ok-Original-4569",
      "body": "omg break up with him immediately",
      "created_utc": 1718675364.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l7so8v5",
      "author": "seal_from_brazil",
      "body": "Just broke up with my 21-year-old boyfriend (I'm 27). And yes, you're right",
      "created_utc": 1717928104.0,
      "score": 5,
      "context": [
        {
          "id": "l7ofsdp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717856326.0
        }
      ]
    },
    {
      "id": "l7pd1wz",
      "author": "AmbitiousContest9361",
      "body": "Oh girl…. Im so sorry, arent u scared? Lately I have been in some similar situation with some other guy but we were not even dating and it was so fucking scary. Im so sorry that we go through this",
      "created_utc": 1717869066.0,
      "score": 3,
      "context": [
        {
          "id": "l7ofsdp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1717856326.0
        }
      ]
    }
  ]
}