{
  "id": "1dc7b72",
  "subreddit": "EatingDisorders",
  "author": "supercberryeliz",
  "created_utc": 1717975337.0,
  "title": "I think my best friend might be my biggest trigger.",
  "selftext": "I (21F) have known my best friend (21F) for just about 12 years. We grew up dancing at the same ballet studio and after graduating from high school we ended up going to the same college. We’re both pursuing a degree and dance and now we currently live together. She has always been significantly smaller than me. While I’m 5’7 with an average build. She is 5’2 and extremely petite.\n\n I love her with all my heart, but I’ve noticed that since we moved in together my eating disorder has not improved at all. If anything it’s only gotten worse. Over the summer I was doing really good. I was healing a lot of the bad habits that I had and I was finally beginning to feel happy in my body. Since moving in and being around her more often I can’t help but compare myself. I’m worried that my brain may subconsciously be using her as “thinspo”.\n\nI’ve tried so hard not to, but sometimes it just feels all consuming. I’m working towards improving self-esteem and I’ve been too ashamed to communicate the fact that I have an eating disorder to her. From what she’s told me she’s never had any body image issues. I’m just not quite sure that she would understand. \n\nI really do love her and I want to be able to be around her more without secretly hating myself, but I just don’t know how. I’m doing everything in my power to make sure that it doesn’t affect our relationship, but it’s really affecting me mentally. It’s gotten so bad that I have refused to be in in pictures, videos and social media post because I’m so ashamed of my body. I just don’t know what to do. Does anyone have any advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1dc7b72/i_think_my_best_friend_might_be_my_biggest_trigger/",
  "score": 38,
  "num_comments": 5,
  "comments": [
    {
      "id": "l7wsnq6",
      "author": "turtleshell20",
      "body": "I’m right there with you. I’m 23F and my best friend of 10+ years is naturally petite and muscular. I have been trying to recover for over 5 years and I always compare myself to her. I love her so much but my ed gets so loud when we are together. it sucks for one of the most supportive people in my recovery to be a physical trigger. we gotta keep working towards recovery. I try to focus on the amazing and beautiful aspects of our friendship and the unwavering support she has shown since I started treatment several years ago.",
      "created_utc": 1717988696.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l7xbgpl",
      "author": "lunavrses",
      "body": "I struggled with this a lot as well. But if I'm being honest, the goal is to not become triggered by people around you. I know it seems hard because when I was deep in my ed, just seeing a skinny person would trigger me. But once I learnt to love myself and recover, I no longer compared myself to others -- most importantly, I accepted the fact that there are people that are skinnier than me and **that's okay** because everyone is different. **They are not you.** So stop trying to compare yourself to a person that's not you. Your friend hasn't done anything to you and never blame them for saying \"you're triggering me\" because ultimately, the harsh truth is that you have not overcome your ed and inner voice. My best advice would be that every time you have a negative thought come in your brain, observe that thought -- do not attach your self with it and see where that thought comes from. Once you realize that your eded negative thoughts are not created by you, you will feel more at peace.",
      "created_utc": 1717998997.0,
      "score": 8,
      "context": []
    },
    {
      "id": "l87020t",
      "author": "adamwazgood",
      "body": "There’s not much you can really say, unless you feel like being around her is unhealthy enough for you to move away for your own well-being. Coming from someone with on and off ED, it’s not exactly fair to just say you’re envious of someone being skinnier than you so you have to completely ditch them after a decade. However, if it is truly making a toll on your mental health, your BEST FRIEND of TWELVE YEARS will understand that being around a trigger while you have a mental disorder simply isn’t okay for you, even if nobody’s at fault. If she’s mature enough to know that a “petite” body can be a trigger for someone with ED, and that you’ve struggled with it, I can’t see a reason why you couldn’t be just as close with her without being around her constantly. Have faith in those you love and trust, and do what you need to for your happiness, I hope everything works out man.",
      "created_utc": 1718149044.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l8og7vw",
      "author": "Nameless-666-Gaylord",
      "body": "my best friend of about five years is very skinny and works out often, i’m so glad to see other stories like mine. she’s about 4’11 and i’m 5’5. she’s much skinner than i and im already close to being dangerously skinny. love seeing others like me! i’m here if you need someone 💙",
      "created_utc": 1718421423.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l81bjw8",
      "author": "puppymouse",
      "body": "It's okay to stay friends just move out. Live with people who are not dancers.",
      "created_utc": 1718060732.0,
      "score": 1,
      "context": []
    }
  ]
}