{
  "id": "1de1lgy",
  "subreddit": "EatingDisorders",
  "author": "Cinderstar23",
  "created_utc": 1718180596.0,
  "title": "I think my boyfriend (26) is triggered by my (25) disordered eating. ",
  "selftext": "My boyfriend has struggled with anorexia and bulimia nervosa severely when he was younger. He is recovered but, ever since i moved in i think its gotten worse. I caught him calorie-rationalizing the other day, and he hasn't been eating much lately and wanting to go to the gym a lot. He is extremely sensitive about his ed and he almost always pretends like nothing is wrong when i mention these things. I can tell he knows i know and is uncomfortable to say the truth.\n\nI struggle with an eating addiction, and i tend to eat in big portions, spend a lot of money on food, and get seconds often. But he's been teaching me how to eat kinder and save money, but i think me losing weight and him having to help me is triggering him (i am still very plus size despite the weight loss). \n\n How can i help him with out making him feel backed into a corner? What would you want from a partner if you struggled with an eating disorder? Im going to put the scale away for sure tonight. I love him so much and i want to be a safe space for him. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1de1lgy/i_think_my_boyfriend_26_is_triggered_by_my_25/",
  "score": 42,
  "num_comments": 8,
  "comments": [
    {
      "id": "l8blcu2",
      "author": "ExaminationOwn2431",
      "body": "the best idea is to have a nice sit down conversation but don’t push him to say anything he doesn’t want to but you should tell him that your there and want to help if he needs . but you juts need to tell me how you feel and what you have noticed and tell him you won’t judge and only want to do what best at least this is what i would do hope it helps but juts make sure you when when you have ed it hard to admit to people and to the people you love the most and you don’t want them to be disappointed",
      "created_utc": 1718223052.0,
      "score": 14,
      "context": []
    },
    {
      "id": "l8eu0rj",
      "author": "autumnartist25",
      "body": "I wanted to add onto the other commenter's advice and say that putting the scale away is great, but also framing it less as you trying to lose weight but instead you both being on your own journeys to eat and be healthier and support each other. You both have disordered eating at other ends of the spectrum and that's going to result in some different mindsets, but taking the focus away from you just losing weight and eating less but instead as you say, being kinder to yourself and bettering your relationship with food, which you both need to do and can do together.\n\nSending love to you both OP 💖",
      "created_utc": 1718279019.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l8ha5is",
      "author": "Old-Friendship9613",
      "body": "First off, I want to commend you for being so attuned to his behaviors and for wanting to create a safe, supportive space for him. That's huge. My advice would be to pick a time when you're both relatively calm and not actively engaging in any disordered behaviors. Come at it from that place of love and concern, not accusation. Something like, \"Babe, I've noticed some patterns recently that have me a little worried about your eating habits. I know how hard you've worked on your recovery, and I want to make sure you're doing okay. Is this something you feel comfortable talking about?\" Validate that it's probably really tough for him to see you working on developing a healthier relationship with food. Maybe suggest you could both explore some new coping mechanisms or activities that have nothing to do with food, exercise or bodies. And don't be afraid to gently encourage him to consider revisiting a therapist or support group, at least for a little while. Those can be such a lifeline. At the end of the day, you can't force recovery on him. But you can control your own responses and continue to model compassionate self-care. Put the scale away, ditch the diet talk, and concentrate on all the other amazing things about each other beyond your appearances. I'm rooting for both of you to get to a better place. Just know that you're being an incredible partner simply by wanting to have his back through this struggle.",
      "created_utc": 1718310372.0,
      "score": 7,
      "context": []
    },
    {
      "id": "l8lwq6a",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1718385582.0,
      "score": -1,
      "context": []
    },
    {
      "id": "l8bn710",
      "author": "Cinderstar23",
      "body": "Thank you ❤️",
      "created_utc": 1718223660.0,
      "score": 4,
      "context": [
        {
          "id": "l8blcu2",
          "author": "ExaminationOwn2431",
          "body": "the best idea is to have a nice sit down conversation but don’t push him to say anything he doesn’t want to but you should tell him that your there and want to help if he needs . but you juts need to tell me how you feel and what you have noticed and tell him you won’t judge and only want to do what best at least this is what i would do hope it helps but juts make sure you when when you have ed it hard to admit to people and to the people you love the most and you don’t want them to be disappointed",
          "created_utc": 1718223052.0
        }
      ]
    },
    {
      "id": "l8g2sc0",
      "author": "Cinderstar23",
      "body": "Thank you so much ❤️❤️ i have been a bit harsh on myself lately so that might be why they've been a bit triggered lately.",
      "created_utc": 1718295929.0,
      "score": 5,
      "context": [
        {
          "id": "l8eu0rj",
          "author": "autumnartist25",
          "body": "I wanted to add onto the other commenter's advice and say that putting the scale away is great, but also framing it less as you trying to lose weight but instead you both being on your own journeys to eat and be healthier and support each other. You both have disordered eating at other ends of the spectrum and that's going to result in some different mindsets, but taking the focus away from you just losing weight and eating less but instead as you say, being kinder to yourself and bettering your relationship with food, which you both need to do and can do together.\n\nSending love to you both OP 💖",
          "created_utc": 1718279019.0
        }
      ]
    },
    {
      "id": "l8lyg1k",
      "author": "Cinderstar23",
      "body": "Im sorry. I dont get it? Could you maybe explain your thought process behind this?",
      "created_utc": 1718386158.0,
      "score": 2,
      "context": [
        {
          "id": "l8lwq6a",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1718385582.0
        }
      ]
    },
    {
      "id": "l8goovu",
      "author": "autumnartist25",
      "body": "No problem at all 💖 it's easy to be hard on yourself, and we all get triggered by things our loved ones do sometimes without them meaning anything by it, so try not to blame yourself either!",
      "created_utc": 1718303225.0,
      "score": 2,
      "context": [
        {
          "id": "l8eu0rj",
          "author": "autumnartist25",
          "body": "I wanted to add onto the other commenter's advice and say that putting the scale away is great, but also framing it less as you trying to lose weight but instead you both being on your own journeys to eat and be healthier and support each other. You both have disordered eating at other ends of the spectrum and that's going to result in some different mindsets, but taking the focus away from you just losing weight and eating less but instead as you say, being kinder to yourself and bettering your relationship with food, which you both need to do and can do together.\n\nSending love to you both OP 💖",
          "created_utc": 1718279019.0
        },
        {
          "id": "l8g2sc0",
          "author": "Cinderstar23",
          "body": "Thank you so much ❤️❤️ i have been a bit harsh on myself lately so that might be why they've been a bit triggered lately.",
          "created_utc": 1718295929.0
        }
      ]
    }
  ]
}