{
  "id": "1dh1etg",
  "subreddit": "EatingDisorders",
  "author": "Right_Relation_6285",
  "created_utc": 1718519040.0,
  "title": "Have you been affected by others' opinions about your body?",
  "selftext": "I need to express something that’s been on my mind for a while. It frustrates me that people always feel the need to comment on my body—whether it’s my parent, grandparent, acquaintances, or even the person I was intimate with. Each of them, in their own way, has negatively impacted how I feel about my body.\n\nOnce, I went out with someone who placed their hands around my waist and said they loved how thin I was. Initially, I appreciated the compliment, but soon after, I became obsessed with staying the same and never changing. I started feeling distressed even when I was just bloated because I wanted to look perfect and feel good in my body. But eventually, it felt like everything was an illusion, and I wanted to change everything about myself, from my nails to my skin, my blood to my hair.\n\nSometimes people tell me I look “fuller” and seem pleased about it. In those moments, I just want to disappear. But I also dislike it when they say I look thinner, as now they say it with worry. I no longer have a clear image of what my body really looks like, and I believe this confusion comes from listening to so many conflicting comments about the same body I’ve had all my life and taking them to heart.\n\nI wish I could simply enjoy being myself.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1dh1etg/have_you_been_affected_by_others_opinions_about/",
  "score": 57,
  "num_comments": 16,
  "comments": [
    {
      "id": "l8xtio9",
      "author": "None",
      "body": "I’ve had to set a boundary with a lot of people in my life with this. If someone says something, I say: “please do not make any comments on my body.” Most are totally fine with it but others get defensive e.g. “What! I was giving you a compliment!” I dont explain anything. Just don’t comment, period! Good luck❤️",
      "created_utc": 1718586665.0,
      "score": 17,
      "context": []
    },
    {
      "id": "l8yay8w",
      "author": "Megan3356",
      "body": "What you are describing has happened to me over and over again. And it just feels worse when people closest to you do it (for me that would be my parents and SO). I haven’t found a way out of such horrible experiences. Usually i would cut ties with people however in this case it can not be. Plus no amount of me trying to educate people to be less rude etc has worked.",
      "created_utc": 1718594907.0,
      "score": 12,
      "context": []
    },
    {
      "id": "l8ykqz7",
      "author": "Silvesa8686",
      "body": "My fiancés parents told me last Christmas that they could tell I’d gained weight (as a compliment). Never something you want to hear as someone with an ED past. I’ve been on a downward spiral ever since. Uhg. Let’s just stop commenting on women’s bodies, please!",
      "created_utc": 1718600394.0,
      "score": 10,
      "context": []
    },
    {
      "id": "l8znuf5",
      "author": "Current-Relative4355",
      "body": "Yeah I hated the “compliments” acknowledging I had lost weight. It validated/affirmed my concerns that people were in fact judging or seeing me as “fat” before and then once again perceiving and judging my body and almost confirming that yes thinner was better (since i never received compliments before when i weighed a little more). \n\nIt’s never helpful! Does a lot more harm than they realize. Sorry you’re dealing with this, I feel you 100%. The best you can do is ask people not to comment on your body in any way or just change the topic or leave the conversation and distract yourself in something else.",
      "created_utc": 1718626575.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l90999x",
      "author": "None",
      "body": "Yes. That's why I've been a celibate lone wolf forever. I don't want to hear it. \n\nA man once came into the library where I worked. He'd been stalking me online through the library website. I had to transfer to another branch for awhile. Then I came back and he saw me. He came right up to the reference desk and yelled. \"You've put on a tremendous amount of weight.\" Then he laughed and left. My coworker came out to gloat over what he said because she was jealous when I was cute and skinny. That's something that's been burned into my brain. But he stopped sending me rape threats through email and the reference ask a librarian website. \n\nI'm naturally fat. Getting thin takes monumental effort. Fat is my protection against men being sexually interested in me. Fat is also how they bully, shame, and insult me too.",
      "created_utc": 1718635445.0,
      "score": 6,
      "context": []
    },
    {
      "id": "l8w6c7g",
      "author": "BrilliantAngle7753",
      "body": "People feel so free to say anything that comes into their selfish brains! F them, you do you!!🌝",
      "created_utc": 1718562750.0,
      "score": 5,
      "context": []
    },
    {
      "id": "l8zp1ji",
      "author": "autumnartist25",
      "body": "Last year I asked my friends to not give me compliments or comments based on my body, after a friend (meaning well) told me I was \"scary skinny with a good ass\" (a real double edged sword of a comment for my ED). My bf is an exception because he knows what to say most of the time, and we've been together for two years so I can normally laugh about it if he says something accidentally triggering now, though when we started dating he would often be a source of my ED thoughts. My family MOSTLY doesn't comment anymore, though a few people I've not seen much since I was really sick will sometimes come out with the \"you look better\" and I have to talk myself down and remind myself they mean well.\n\nIt sucks people make comments, and I wish we could live in a world where appearances didn't matter so much. I think of my family as kind of a lost cause for mental health awareness, except my mum who has finally after ten years learnt a lot about my ED and BPD and stopped making ignorant comments. It's hard for people to understand EDs, some people think we want to hear we're thin, some people think we want to get better and that is synonymous with weight gain and don't understand the mental ramifications that has, because surely if you're \"bigger\" you must be totally fine now.",
      "created_utc": 1718627164.0,
      "score": 4,
      "context": []
    },
    {
      "id": "l8zs4n2",
      "author": "None",
      "body": "When I was thin people would ask how I did it. I would tell them Overeaters Anonymous and invite them to a meeting. That shut them up.",
      "created_utc": 1718628613.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l953l4d",
      "author": "None",
      "body": "Yes. The reason why I developed an ED is because even as a child people treated my female body as public property to comment on",
      "created_utc": 1718711525.0,
      "score": 3,
      "context": []
    },
    {
      "id": "l90d20t",
      "author": "Icy-Lack8297",
      "body": "i feel this when people comment on other people’s body’s. like when adults start pointing out the way people look or little details about them it makes me so self conscious 😭",
      "created_utc": 1718636794.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l91a1w0",
      "author": "Fresh-Peach5437",
      "body": "I’ve gone through a lot and was a stress eater overweight but I got a lot of negativity for it so I did a 360 in the other direction and now I get complaints about being too underweight",
      "created_utc": 1718647960.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l9427a7",
      "author": "anonymouse_696",
      "body": "It takes a lot to become comfortable with defending your body. But once you accept that put simply, no two people are exactly alike, it will become easier to set boundaries in this regard. \n\nMy favorite way to defend my own body is by reminding others, “yeah and if I made fun of [an insecurity of theirs], I’d be the bad guy. So why is it okay for you to say things about MY body?” That typically does wonders on people who don’t get the hint the first time. \n\nIt’s not okay to bully people because of their body or appearance. Ever. No matter who someone is in relation to you. And once you’re above a certain age, this is common sense. So don’t allow people too much grace in this regard, or they’ll continue taking advantage of it.",
      "created_utc": 1718686938.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l9b4r1l",
      "author": "Puzzleheaded_Let6810",
      "body": "Unfortunately, this is partly why ED begin. I’m 59. I’ve been struggling with an ED since 16. The bullying about my weight from kids at school, to family members, to strangers has never left my head. I’m at a good place now. However, it really is a daily, if not hour by hour struggle. I’m eating a high protein lifestyle. That has curbed my cravings almost completely. I talk back to ED, and let him know that he no longer has control of me. A fantastic book to read is; Goodbye ED, Hello ME. Author is Jenni Schaefer.",
      "created_utc": 1718805441.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l9oyubz",
      "author": "None",
      "body": "very much so. my dad would make awful comments about my body, my weight, and my eating habits for YEARS, as young as age 12. I still hear him in the back of my head anytime I eat carbs, telling me about how bad carbs are for you while he drinks a beer.",
      "created_utc": 1719014156.0,
      "score": 2,
      "context": []
    },
    {
      "id": "l93bdfx",
      "author": "Breeana92",
      "body": "I’ve even had people at work make negative comments about it. And i mean random people, not even anyone close to me (not that it would excuse it). Basically had a breakdown in my car over it. Why people feel the need to do that (especially random people with no place in your life) is beyond comprehension for me.",
      "created_utc": 1718674760.0,
      "score": 1,
      "context": []
    },
    {
      "id": "l9e6r95",
      "author": "None",
      "body": "i think this is the main reason why my ed developed. people comparing my body to theirs, idolizing being skinny, etc. i wish it wasn’t always about how i look too- i haven’t been able to set that boundary with my family yet :/\n\nbest of luck",
      "created_utc": 1718844457.0,
      "score": 1,
      "context": []
    }
  ]
}