{
  "id": "1dnky9k",
  "subreddit": "EatingDisorders",
  "author": "TheshizAlt",
  "created_utc": 1719254565.0,
  "title": "Eating Disorder Residential Treatment: What to Expect",
  "selftext": "Hey all. I went to residential ED treatment last year and also work at an ED treatment facility, and wanted to make a \"what to expect\" post. Not sure how common these are but I figured I'd try to see if it is helpful at all. For brevity, from here on, I will refer to residential eating disorder treatment as \"ED res\".\n\nTo start, I want to make a few points:\n\n1. Going to ED res is absolutely worth it if you are struggling hard. No shame in it and if you feel like you may need it, you probably do. It's tough in the right ways sometimes but it's very good.\n2. Everyone does ED res treatment differently so I will try to keep things pretty general.\n3. Make sure to ask lots of questions about the program during intake and study any handbooks you receive in line with point #1.\n4. Res is *not* the same as inpatient although people tend to use them interchangeably.\n\n***What to expect in ED res***\n\n1. *Everything* from counseling to daily living tasks is centered around ED treatment in one way or another. For instance, things that may trigger ED behaviors will likely be prohibited or at least discouraged. This includes things like movies, books, conversation topics, etc. \n2. You will likely meet with each of your treatment team members (usually psychiatrist, therapist, dietitian, and PCP) once per week, maybe a few times per week depending on the program.\n3. Staff should always be present to support you whenever needed. If it appears like you are struggling at any point, they should check in with you and you can go see them if needed. Take advantage of this and don't pretend like you are OK if you really are not. This is a big part of their job.\n4. Bathroom activities will usually be monitored. Expect extra support following toileting tasks because this makes it harder to engage in ED behaviors. Mirrors will likely be shrouded partially. Staff won't follow you around and *certainly* won't watch you shower or anything like that but they will be present to support you when/if needed.\n5. You will have a set bedtime/wake up time but on weekends they may be a bit more lenient and in some programs, being in your room may not necessarily be lights-out (i.e. you may still be allowed to read with a lamp). I found that this is a good way to correct any bad sleep habits and you'll find the extra rest makes a huge difference.\n6. Nicotine products are generally allowed but only during set times of the day like outside breaks. You should be able to get patches/nicotine lozenges as needed from nursing.\n7. During meals staff will be present and their main duties involve helping to observe/address any ED behaviors, documenting completion, providing meal coaching, helping keep peoples' minds off of the tasks at hand by leading games and conversations, serving food itself, diffusing any conflicts, etc. You should expect that meal times are when you will get most of your therapeutic support/practice.\n8. Most of your day will involve going to groups when you are not engaged in meals and/or individual sessions. HOWEVER, lots of downtime will be given and activities like art, reading, talking with loved ones and friends, watching movies, bonding with your peers/staff, etc. are all highly encouraged.\n9. Nursing will pass out meds every day and as needed per request (PRN or \"pro re nata\").\n10. Your vitals will be monitored daily and you should expect lab tests now and then. You will regularly be asked about anything that is discomforting and/or unusual that you may notice.\n11. You will generally need to ask for bathroom breaks outside of scheduled ones due to bathrooms being kept locked.\n12. You should expect to have access to your electronics at set times, but this is not always the case. For instance, in my program I was allowed to use my phone when not in group at any time but some places have specific timeframes where it is allowed.\n13. You will be able to go on shopping trips now and then and you can order things/have people mail things to you but it's a good idea to bring any books, art supplies, portable gaming devices, laptops, etc. with you ahead of time.\n14. Remember that everyone is there for an ED, thus everyone has bad days and daily struggles. It's worth it to make friends and confide in each other and can make your stay *much* better, but it is up to you.\n15. You will be able to meet with family, friends, and other support people at times, usually once a week if you'd like. Take advantage of this. Having your s/o, closest family member, best friend, etc. come visit you for even a half hour every week can make all the difference.\n16. Generally, ED programs do not want you to work, take classes, etc. while in res. You will want to set up leave, paid leave, school absence, etc. before you begin treatment if possible. Stay on top of your weekly paid leave requirements and extend your benefits as needed.\n17. Finally, **prioritize your recovery** and **don't rush to get out of there**. I know ED res can be tough but I felt like I left before I was truly ready and this made things hard when I got home. Do a lot of self-talk and remind yourself that you are there to work on yourself and take all the time you need.\n\nHope that helps. I know this is a lot, but for me, knowing these things ahead of time made things much less scary.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1dnky9k/eating_disorder_residential_treatment_what_to/",
  "score": 41,
  "num_comments": 5,
  "comments": [
    {
      "id": "la5u113",
      "author": "cyber-dust",
      "body": "I am involved in a startup.  A residential eating disorder facility. I think this is a great post. Keeping things short and to the point!!",
      "created_utc": 1719290317.0,
      "score": 5,
      "context": []
    },
    {
      "id": "la6f2qf",
      "author": "humilityaboveallelse",
      "body": "hey thank you for posting this, i really appreciate it! i’ve been wondering if i need more help.\nhow would someone get into res?\nand how is your stay determined (if someone needed leave from work, what would you even say? how would you know how much time you need lol although i’m still casual so i’d probably lose my job tbh..)",
      "created_utc": 1719303840.0,
      "score": 3,
      "context": []
    },
    {
      "id": "laae264",
      "author": "smehdoihaveto",
      "body": "I am going to add a few things as someone who worked previously in RTC (primarily for MH but also comorbidity with ED) for adolescent specific since I know many on reddit are minors...  RTC for under 18s can look very different and more restrictive than what's listed above, and may include:\n\n\n*No access to phones and especially social media \n\n\n*Family therapy is often required; parents are often kept in loop on progress though the treatment team will often be mindful and dedicated to preserving your privacy as much as possible. \n\n\n*No substance use permitted at all \n\n\n*If concerns for your safety, 1:1 supervision until evaluation at inpatient level \n\n\n*If found to be negatively impacting others treatment and not following program rules, may be referred out to different program or level of care  \n\n\n*Dedicated school time is often scheduled, depending on state law requirements and the length of the program \n\n\n*It's okay also to not make friends or not want to get close with others in treatment. Honor your boundaries!",
      "created_utc": 1719359950.0,
      "score": 1,
      "context": []
    },
    {
      "id": "la7zcmr",
      "author": "TheshizAlt",
      "body": "Aw thank you! I will do my best to speak for this, and it'll be wordy.\n\nThe first step is contacting whatever program you are interested in. Some people want to get another professional's opinion first but if you really feel like you need help on an ED res level, you can make the decision on your own. In the call the admission coordinator/intake specialist will get a lot of info on you such as your eating habits, history of ED-related behavior, any health/mental health concerns, some of your personal history, support system, etc. You can say straight up you think you need res but ultimately they'll need to screen you to determine if you qualify for their care (i.e., you have an eating disorder) and if so they'll recommend a level of care. Be transparent and give every last detail about your ED struggles.\n\nThere are 5 possible levels of care in ED treatment (inpatient, res, partial hospitalization \\[PHP\\], intensive outpatient \\[IOP\\], and outpatient) and they'll see what you would do best in and recommend that. When I called I said I was interested primarily in PHP but would be open to Res, and they started me in PHP but stepped me up to Res when it became apparent that I needed more help. A step up, or a movement to a higher level of care, is always an option too if Res feels like too much of a commitment at first, which for many it is, assuming you qualify for a lower level of care.\n\nDepending on where you live (I am assuming you are in the US), there are laws that workplaces are required to honor about job security while you go into any medical treatment necessitating time off of work. Most states have their own programs but in general all states must adhere to FMLA (Family and Medical Leave Act) laws. According to FMLA, you can be eligible for \"12 workweeks of leave in a 12-month period\" (https://www.dol.gov/agencies/whd/fmla). and can extend this through your workplace if needed. You would need to go through HR at your company to start the process on this and once approved your company *must* protect your employment while in res within the time allowance (12 workweeks) but they will not pay you for the absence. You would need to go through your state's paid leave program, if your state offers one, which is its own process, or short term disability.\n\nI would personally recommend preparing to spend the *maximum* allotted time granted by FMLA if you proceed with Res. Every program is different but I have found that in general, most ED treatment programs at the Res level are around 6-8 weeks baseline but more often than not people have that extended unless they do very well early on. In my line of work (ED care coordinator) I *very* rarely see people discharge at or before 8 weeks without insurance-related issues or personal choice.\n\nAs far as what to say, you really don't need to tell your workplace anything other than you need time off for medical treatment and want to get FMLA benefits. You are in no way obligated to say what that medical treatment is other than making it clear you won't be able to work, but you can be more specific if you would like. Although, when completing FMLA paperwork, you'll likely need to basically describe where you will be getting care. If you have doubts about your workplace's perspective you can (and should) go see a doctor or therapist/social worker first to get some sort of documentation indicating that they think you need care, and you can directly ask the clinician for this.\n\nHope this helps.",
      "created_utc": 1719330562.0,
      "score": 3,
      "context": [
        {
          "id": "la6f2qf",
          "author": "humilityaboveallelse",
          "body": "hey thank you for posting this, i really appreciate it! i’ve been wondering if i need more help.\nhow would someone get into res?\nand how is your stay determined (if someone needed leave from work, what would you even say? how would you know how much time you need lol although i’m still casual so i’d probably lose my job tbh..)",
          "created_utc": 1719303840.0
        }
      ]
    },
    {
      "id": "laa56to",
      "author": "humilityaboveallelse",
      "body": "thank you so much for taking the time to answer this in such a lengthy response, it was really helpful! i’m actually in aus so idk how different it will be but hopefully it’s fairly similar",
      "created_utc": 1719356606.0,
      "score": 3,
      "context": [
        {
          "id": "la6f2qf",
          "author": "humilityaboveallelse",
          "body": "hey thank you for posting this, i really appreciate it! i’ve been wondering if i need more help.\nhow would someone get into res?\nand how is your stay determined (if someone needed leave from work, what would you even say? how would you know how much time you need lol although i’m still casual so i’d probably lose my job tbh..)",
          "created_utc": 1719303840.0
        },
        {
          "id": "la7zcmr",
          "author": "TheshizAlt",
          "body": "Aw thank you! I will do my best to speak for this, and it'll be wordy.\n\nThe first step is contacting whatever program you are interested in. Some people want to get another professional's opinion first but if you really feel like you need help on an ED res level, you can make the decision on your own. In the call the admission coordinator/intake specialist will get a lot of info on you such as your eating habits, history of ED-related behavior, any health/mental health concerns, some of your personal history, support system, etc. You can say straight up you think you need res but ultimately they'll need to screen you to determine if you qualify for their care (i.e., you have an eating disorder) and if so they'll recommend a level of care. Be transparent and give every last detail about your ED struggles.\n\nThere are 5 possible levels of care in ED treatment (inpatient, res, partial hospitalization \\[PHP\\], intensive outpatient \\[IOP\\], and outpatient) and they'll see what you would do best in and recommend that. When I called I said I was interested primarily in PHP but would be open to Res, and they started me in PHP but stepped me up to Res when it became apparent that I needed more help. A step up, or a movement to a higher level of care, is always an option too if Res feels like too much of a commitment at first, which for many it is, assuming you qualify for a lower level of care.\n\nDepending on where you live (I am assuming you are in the US), there are laws that workplaces are required to honor about job security while you go into any medical treatment necessitating time off of work. Most states have their own programs but in general all states must adhere to FMLA (Family and Medical Leave Act) laws. According to FMLA, you can be eligible for \"12 workweeks of leave in a 12-month period\" (https://www.dol.gov/agencies/whd/fmla). and can extend this through your workplace if needed. You would need to go through HR at your company to start the process on this and once approved your company *must* protect your employment while in res within the time allowance (12 workweeks) but they will not pay you for the absence. You would need to go through your state's paid leave program, if your state offers one, which is its own process, or short term disability.\n\nI would personally recommend preparing to spend the *maximum* allotted time granted by FMLA if you proceed with Res. Every program is different but I have found that in general, most ED treatment programs at the Res level are around 6-8 weeks baseline but more often than not people have that extended unless they do very well early on. In my line of work (ED care coordinator) I *very* rarely see people discharge at or before 8 weeks without insurance-related issues or personal choice.\n\nAs far as what to say, you really don't need to tell your workplace anything other than you need time off for medical treatment and want to get FMLA benefits. You are in no way obligated to say what that medical treatment is other than making it clear you won't be able to work, but you can be more specific if you would like. Although, when completing FMLA paperwork, you'll likely need to basically describe where you will be getting care. If you have doubts about your workplace's perspective you can (and should) go see a doctor or therapist/social worker first to get some sort of documentation indicating that they think you need care, and you can directly ask the clinician for this.\n\nHope this helps.",
          "created_utc": 1719330562.0
        }
      ]
    }
  ]
}