{
  "id": "1dwgd2o",
  "subreddit": "EatingDisorders",
  "author": "TrafficNatural7476",
  "created_utc": 1720236841.0,
  "title": "has anyone tried recovering on their own? ",
  "selftext": "hey there! \n\ni have a general question. has anyone tried recovering on their own? at what point should admit myself? i can afford treatment out of pocket and i’m really spiraling. i don’t even know where to start with food, what meals do i eat? how much should i eat? what are regular meals? i’ve been knee deep in my disorder since i was 8 idk what to do and i’m all alone. \n\nany advice would be great! \n\nthanks! ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1dwgd2o/has_anyone_tried_recovering_on_their_own/",
  "score": 45,
  "num_comments": 29,
  "comments": [
    {
      "id": "lbujvgp",
      "author": "dungeonsovereign",
      "body": "Hey OP, I was in your same position. I was anorexic (& had binge/purge/exercise issues) and recovered (mostly) all on my own, without any treatment plan or external help. Not everyone can do it and every case is different, but I’ll give you my two cents on the matter.\n\nFirst of all, congratulations on trying to recover. You’ve made the right choice, my friend, and I’m proud of you.\n\nFocus more on how you’re feeling than how much you’re eating. Don’t worry about how much is a “normal” amount because you aren’t in a normal situation. If you’re dizzy/cold/hungry/headache/etc, eat. Wear loose fitting clothes, don’t weigh yourself and get rid of any home scales, try not to look at yourself in mirrors/pictures too much, drink lots of water, eat plenty of fibre and carbs, try to avoid looking at the calories on food or eat food you don’t know the calories of if you’ve memorised them, surround yourself with loved ones, put away any tight / too small clothing, and HONOUR YOUR CRAVINGS. It’s very likely that you’ll experience “extreme hunger” a little while after you start trying to recover. This is not binge eating and it is not unhealthy. It is a normal part of recovery coming from your body finally being out of starvation mode and wanting to make up for lost time. If you need to eat more than three meals a day, eat those extra meals. If you need to have a snack fifteen minutes after dinner, eat that damn snack. Listen to your body and try to care for it and give it what it wants after ignoring it for so long. It’s trying to heal you, and you can’t recover if you don’t let it do so. On the flip side, if you experience low appetite / fullness even when not eating enough try drinking tea, getting nourishing liquids like smoothies/shakes/soup, and prepping meals that are easier to handle for when it’s hard to get enough food in. \n\nIf you have the compulsion to exercise or purge, what I liked to do early in recovery was go on a short, slow walk and use my cellphone to take a picture of ten beautiful things. Flowers, dogs, cars, anything that struck me as lovely. It helped take my mind off of myself and my body, and that motion eased those self destructive feelings without hurting me or straining my body.\n\nAbove all else, never give up. It might be hard, you might feel shitty sometimes, but this will not be hard forever. In a year, or five years, or ten years, you’ll be looking back on this time and thanking yourself profusely for not letting yourself waste away due to this disease.\n\nI’d also STRONGLY recommend checking out @_thewellnessdiaries on TikTok and YouTube! She was my saving grace early in recovery, and is one of the only recovery accounts that has genuinely helped me a great deal with my eating habits and negative thought patterns.\n\n“It doesn’t matter how slowly you go, so long as you do not stop.”\n\nI believe in you and I know you can do this! Feel free to DM me if you ever need any more advice or support :)",
      "created_utc": 1720238825.0,
      "score": 40,
      "context": []
    },
    {
      "id": "lbvcard",
      "author": "pussilanimity",
      "body": "If I had the resources I'd opt for getting professional help. I've tried recovering on my own and it's really hard - not at all impossible, but... yeah, if I had the choice I'd choose to get the help. \nGood luck, OP ❤️",
      "created_utc": 1720256935.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lbycroi",
      "author": "maraisthecat",
      "body": "Hey! First off, so sorry you're dealing with this. I had severe bulimia/BED for 12 years. I wouldn't wish it on my worst enemy. \n\nEverybody is very different with their recovery so take my advice with a grain of salt. \n\nFor years, I tried to recover on my own. I told myself it was just a \"willpower,\" thing etc. However, once it started impacting my job, I had to seek treatment. \n\nTherapy was a massive game changer for sure. Once I started seeing it as a medical condition and not a personal failure, it really helped. My therapist really helped me dig down into the issues of where my disorder came from. It was definitely helpful, but  I think I can mostly attribute my recovery to my change in lifestyle. In many ways, my disorder was never about the food. \n\nSo I quit my toxic job, stopped obsessing over my appearance/how people perceived me, and prioritized my health/wellness. Again, everybody is different, but I personally found it detrimental to have meal plans etc. since it just lent itself to my obsession with food and my body. I stopped labeling foods and \"good\"/\"bad\" and learnt to be flexible. \n\nAgain, I found therapy to be massively helpful in this regard (Particularly a very liberal one who specializes in attachment issues), but I had to change as well. New friends, social media breaks, etc. \n\nIf you can afford it, I would recommend getting treatment for sure. Sorry for the long post! Feel free to DM me :)",
      "created_utc": 1720302506.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lbuvbhl",
      "author": "runninginbubbles",
      "body": "At one point you're going to be on your own. Full recovery happens when you're making the decisions yourself, without anyone watching. Some people absolutely need a facility to get going but in the end it really has to come from you.",
      "created_utc": 1720245291.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lbvkapw",
      "author": "bogummyy",
      "body": "\n\ni really suggest see-ing a professional as there are usually underlying issues that trigger the disorder.\n\npersonally, i have a tendency to binge/purge & i wouldn’t say that i’ve fully recovered. I have pockets of moments where i stop doing it all together but once i relapsed, it gets really bad and doesn’t go away easily..",
      "created_utc": 1720262659.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lbvzsx7",
      "author": "Less_Row4641",
      "body": "Personally, I have tried (and failed) recovering on my own. It'll go well for a while, sometimes even years, but I somehow always fall back harder. If you can afford it, and since you've been dealing with it for so long, I'd strongly suggest getting professional help.\n\n  \nOther than that; congrats on finding the courage! Good job, and if you're willing to do it by yourself, it will be so much easier with a professional. Good luck! x",
      "created_utc": 1720271214.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lbw2nr7",
      "author": "cosmicflamexo",
      "body": "yeah, I have a fear of therapy/mental health workers due to some trauma, any recovery I've done has been on my own. I was doing pretty good for a while too up until everyone and their dog started commenting on my weight gain. Relapsed bad rn but when I do recover again (not if, when) it'll be on my own.",
      "created_utc": 1720272497.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lbwc2nz",
      "author": "Change01789",
      "body": "I accidentally recovered on my own. My ED was different than most. I had an abusive mother than coached my ED. But when I moved out I developed a different type of ED because I lacked control in any other aspect of my life. It progressively got worse for 4 years until I moved in with my dad again. Rebuilding our relationship and creating new family memories, without having my addicted mother ruining every moment, healed my inner child. I found new ways to cope with trauma and pain, and healed more than just my ED. I learned how to live healthier mentally and physically once I was living in a safe environment.",
      "created_utc": 1720276357.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lbxus5r",
      "author": "None",
      "body": "hi! \ni am completely recovered, and it took about 3 years to get to where i am now.\n\ni say start off with small fear foods and work your way up. also, slowly but surely up your food intake every week. dont overcomplicate it.\n\nit will get better. ❤️",
      "created_utc": 1720295865.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lby8s5b",
      "author": "cmsawyer12",
      "body": "Yep. With the right support system you can do it",
      "created_utc": 1720300993.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lc04oji",
      "author": "Badaa1865",
      "body": "Yeah, 3-4 failed tries, the one I’m on is successful but I’m 👌🏽 close to relapsing. It’s extremely hard so if you can get professional help",
      "created_utc": 1720331059.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lc0gfri",
      "author": "Ill_World3087",
      "body": "Congrats dude !! There are so many people to support you on this arduous journey. Please, please, please do not give up on yourself. Relapses will happen but they are not the end of the world. Be gentle with yourself and as forgiving as you are with your most beloved friends. \n\nPersonally I found that talk therapy didn’t get me very far, though did provide a safe person to hold me accountable. I suggest finding someone in your life you trust that you can confide in, without judgement. Tell people about what you’re experiencing- you may find that they are compassionate and understanding. Many people have a difficult relationship with food these days. \nRemove all scales from your house, or put them somewhere you can’t easily access them. Along with every other triggering item that isn’t helping your recovery. For me this meant putting away a favorite pair of shorts, and a beautiful dress that no longer fit. I still love them and hold onto them, but I no longer pine to fit into them again. \n\nFor me, what helped was having a semblance of a routine. Meaning a high protein breakfast (even though eating in the morning used to make me violently ill), a snack or two to get me through the day, and at least something for dinner. Being too strict makes me wanna vom (haha) but if I have no structure I just don’t eat all day until I binge at the end of the night (& then really vom). \nExercise (not overboard) helps me eat with a lot more peace of mind. Not in a I-only-deserve-to-eat-when-I-work-out kind of way but in a “if I don’t eat I’ll perish” way. Being strong is a lot better of a feeling than feeling shakey and weak after a purge. Finding motivations in my future to look forward to has also helped a lot. Like I want to have kids and big family, but I don’t want to still be leaching my trauma out onto them. So having a healthy body and mind— free from the torture of thinking about food/my body every waking hour of the day, is a hell of a motivator. \n\nEventually you’ll get tired of living with an eating disorder but I hope and pray you can overcome this before then. You’re already on the right path. You got this !",
      "created_utc": 1720338880.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lc0yjhi",
      "author": "MorgenMermaid",
      "body": "Yeah... basically forced to do it without help because they straight up told me \"we dont WANT to help you, so youre gonna have to do it on your own\".\nSo if they ever tell me to come there to get their help ill graphically, and in great detail, describe how they should off themselves.\n\nIm not completely out of my anorexia but at least im not starving myself anymore :/",
      "created_utc": 1720351644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lc14r8e",
      "author": "monkey-marker04",
      "body": "i personally don’t recommend it. you need someone to keep you accountable, so yes you can recover on your own, but making sure you have someone educated who can make sure you’re eating enough and not engaging in ed behaviors is crucial to actually recovering",
      "created_utc": 1720355159.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lc1qn5u",
      "author": "saalinskiii",
      "body": "I did and were actually successful with it. I started upping my calories until maintenance. That first helped to get comfortable with a normal amount of food again. I also cut out exercise as best as possible. After that I slowly started introducing exercise again but increased calories so I could gain weight to get to a normal BMI again. The recovery after that took me 5 years and a lot of relapses. It takes a lot of time to be able to accept your body and to not focus on food all the time.",
      "created_utc": 1720364487.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lc39q87",
      "author": "DanaDles",
      "body": "Yes bc I can’t afford treatment . I’m in therapy but that’s it.",
      "created_utc": 1720383896.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lc4ryg8",
      "author": "CaseTarot",
      "body": "If you can afford treatment then find a place that is best suited for where you are at and your personal needs. It’s ok to get help. Food, meals, portions, therapy- that’s all best suited to professional counselors, nutritionists, and therapists. If you don’t have to do it on your own don’t.",
      "created_utc": 1720404650.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcaovqd",
      "author": "Idontknowme11",
      "body": "Tried and failed continuously. I think what you need to do on your own is fully commit to recovery. I think while I was trying on my own I convinced myself I was committed to recovery when in reality I was fooling myself. It wasn’t until I opened up to my therapist and started seeing a nutritionist that specializes in EDs that I fully committed to getting better. Bulimia had taken over my life. I still struggle with severe body dysmorphia and food issues BUT I haven’t purged in 3 months now and have been committed to recovery for a year now. I wish I could say you could do it on your own, and maybe you can, but for me personally, reaching out for help from professionals and my loved ones was the only way.  I wish you the best of luck and all the love in the world, this disease is a beast that only takes and no one deserves to suffer alone ❤️",
      "created_utc": 1720494399.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcjtjq2",
      "author": "pharbly",
      "body": "Hello! It is definitely possible but not easy. I’ve had countless failed attempts over the past 7 years, but I have been going strong for 3 months now. I think the only reason why I’ve been able to keep it up is because I have been keeping myself in the mindset to want to recover. Try and find things that motivate you, or small goals to work towards, then when you reach those goals create new ones. It is one of the hardest things I’ve ever done but if you really want it, I believe you can do it!! I can’t really give you exact advice on nutrition since I don’t know your circumstances, but you can message me if you want and I can give you more specifics on what I’ve been doing ❤️ Good luck, you’ve got this!",
      "created_utc": 1720636121.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lcwu9gi",
      "author": "Hopeful-Cat-2785",
      "body": "I actually overcame anorexia on my own, but I strongly encourage you to go seek professional help. It's always better done that way. \nFrom the beginning of my ED to full recovery, it took me 4 years. But during those, it took me 2-3 years to understand I was anorexic in the first place.\n\nHere's what helped me get my eating habits back to normal.\n\n1) I acknowledged that I was hurting myself by starving myself or eating so much in a binge that I actually ended up sick and vomiting. Once you see that what you think is control and just keeping a nice waistline is actually making you sick ( feeling dizzy, lack of energy, irritable, always cold, always thinking about food and the next meal, binging and getting sick), you'll start to understand that there is some changes to make.\n\n2) I allowed myself to actually enjoy what were \"prohibited \" meals or foods. This is really hard. Honoring my cravings, like cookies, burgers or ice creams, things that were totally off limits before, or even just have a nice diner out with friends without thinking about the consequences, just thinking about the good time I had, this helped me a lot. And this goes with next point\n\n3) To better honor your cravings and just go back to a normal life when you do enjoy some dessert, burgers, pizzas or whatever from time to time ( in a nutshell, when you have a balanced diet), also acknowledge that no food alone is or will make you fat. It's not because you eat that pint of ice cream that you will be fat or obese tomorrow. You could even do that every night during one week and actually only gain like a pound. This was hard for me to realize, but it takes to take the step and eat the thing to realize 1 week after that what you think was a horrible meal or the biggest cheat meal of your life, actually didn't change anything about your weight or appearance. So go ahead, eat your ice cream or whatever you enjoyed in the past and is off limits now, and trust me, when you'll see that you don't become overweight overnight, you'll understand that enjoying these kinds of foods doesn't mean you're loosing control over your life/health. And it will not only heal your relationship with food, but also with yourself, because honoring a fast food craving, even if is not that nourishing for your body, is nourishing for your mind and soul, because you ate what also makes you happy. And that's as important as being physically healthy. So please, eat out with your family, eat your icecream, but when you do, do not count macros or calories. Yes, you might be over what your body needs physically that day in terms of calories but who cares? Your body doesn't and even the scale doesn't so why would you? So just enjoy your icecream without focusing on the energy that it is bringing to your body, but focus on how it is healing your soul, your memories with people, and how good it also feels when meals are more than just numbers but also good times to be respected as such.\n\n4) If you have anorexia like I did, you might be underweight. This is, of course, not true for everyone. In my case, I was, and when you understand that being too thin doesn't make you look good, and that people don't admire your good shape, but are actually concerned about your lack of meat to cover your bones, you understand that gaining a few pounds might not only make you feel good, but also more beautiful. To shake myself up, I mentally accepted to gain about 10 lbs to get some curves back and just globally be healthier. Of course it is hard to see the scale numbers going up. But once you see that even with those new pounds, you are still in a healthy weight and you look more beautiful than with that stickman waistline, you stop thinking that you need to always shed pounds to be prettier or just to be accepted. And I loved how people thought I looked better once I gained that weight back.  \nIf you are anorexic but aren't underweight or just like very thin, it's good to acknowledge that being too thin isn't actually a beauty standard for most people. Whatever the beauty industry, celebrities or instagram is trying to make you believe, thinner is usually not always better. It raises concerns about your health and actually makes you feel less beautiful and really just bad about yourself. It's always the contrary that your mind is trying to make you believe: \" you will be pretty once you reach X weight or X measurements\" : truth is, you are never satisfied about them, no matter how thin you are or how perfect your measurements are. That's just how our nature is: never believe that you are good enough, when in fact, you have always been. So good things to keep in mind: you are valuable, you are beautiful now, and you will be beautiful either way with a couple of extra pounds.\n\n5) once you get past those stages, you might or might not have gained weight. Either way, it's ok. Just understand that you're worth more than just a number in a scale. The important thing is to be healthy. Being too thin isn't. Your weight being aligned with your health, that's what's important. Not fitting into X or Y size or being X pounds. So enjoy those gained pounds or your stable weight as a victory sign of you making peace with yourself. And by then, you won't see foods as good or bad, \" safe foods\" and \" off limits foods. You will just see food for what it is : nourishment for either your body or your soul. And therefore, you gain neutrality over food. So then, you can trust yourself to make good choices for you in your daily food intake. Nothing feels risky, you are just trying to be healthy on the outside but also inside.\n\n6) after some time, when you truly feel healed,  when you feel like food isn't controlling your life anymore, that you aren't constantly thinking about food or your weight, when at last you are back to a normal relationship with food and your body, you can then track your weight. Not in a way where you always aim to be thiner but on the contrary, in a way where you just try to keep your weight/ shape stable. If because X or Y events your weight went up, try to accept that a body changes over time and it is normal. If you are gaining too much weight because of your food intake, before starting a diet or anything, ask yourself: Am I medically overweight please go see a nutritionist who will guide you, either to loose weight if necessary but in a controlled way, or just to reassure you that these are normal changes and shouldn't be concerned because not a threat to your health.\n\nI hope these tips can help you. It's not easy, and if you don't succeed on your first attempts, it's not because you lack of willpower, you're just a normal human being. Changes take time, just take a few steps at the time, and one day you'll see how much of the road you've covered and that you actually did recover.\n\nStay strong,\n\nAll my best wishes on you recovery journey!",
      "created_utc": 1720825766.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lbwgult",
      "author": "TrafficNatural7476",
      "body": "this was so beautiful omg. thank you so much for this! it’s been a rough few days but this really encouraged me!",
      "created_utc": 1720278168.0,
      "score": 4,
      "context": [
        {
          "id": "lbujvgp",
          "author": "dungeonsovereign",
          "body": "Hey OP, I was in your same position. I was anorexic (& had binge/purge/exercise issues) and recovered (mostly) all on my own, without any treatment plan or external help. Not everyone can do it and every case is different, but I’ll give you my two cents on the matter.\n\nFirst of all, congratulations on trying to recover. You’ve made the right choice, my friend, and I’m proud of you.\n\nFocus more on how you’re feeling than how much you’re eating. Don’t worry about how much is a “normal” amount because you aren’t in a normal situation. If you’re dizzy/cold/hungry/headache/etc, eat. Wear loose fitting clothes, don’t weigh yourself and get rid of any home scales, try not to look at yourself in mirrors/pictures too much, drink lots of water, eat plenty of fibre and carbs, try to avoid looking at the calories on food or eat food you don’t know the calories of if you’ve memorised them, surround yourself with loved ones, put away any tight / too small clothing, and HONOUR YOUR CRAVINGS. It’s very likely that you’ll experience “extreme hunger” a little while after you start trying to recover. This is not binge eating and it is not unhealthy. It is a normal part of recovery coming from your body finally being out of starvation mode and wanting to make up for lost time. If you need to eat more than three meals a day, eat those extra meals. If you need to have a snack fifteen minutes after dinner, eat that damn snack. Listen to your body and try to care for it and give it what it wants after ignoring it for so long. It’s trying to heal you, and you can’t recover if you don’t let it do so. On the flip side, if you experience low appetite / fullness even when not eating enough try drinking tea, getting nourishing liquids like smoothies/shakes/soup, and prepping meals that are easier to handle for when it’s hard to get enough food in. \n\nIf you have the compulsion to exercise or purge, what I liked to do early in recovery was go on a short, slow walk and use my cellphone to take a picture of ten beautiful things. Flowers, dogs, cars, anything that struck me as lovely. It helped take my mind off of myself and my body, and that motion eased those self destructive feelings without hurting me or straining my body.\n\nAbove all else, never give up. It might be hard, you might feel shitty sometimes, but this will not be hard forever. In a year, or five years, or ten years, you’ll be looking back on this time and thanking yourself profusely for not letting yourself waste away due to this disease.\n\nI’d also STRONGLY recommend checking out @_thewellnessdiaries on TikTok and YouTube! She was my saving grace early in recovery, and is one of the only recovery accounts that has genuinely helped me a great deal with my eating habits and negative thought patterns.\n\n“It doesn’t matter how slowly you go, so long as you do not stop.”\n\nI believe in you and I know you can do this! Feel free to DM me if you ever need any more advice or support :)",
          "created_utc": 1720238825.0
        }
      ]
    },
    {
      "id": "lbvulc7",
      "author": "Minute_Drawer7777",
      "body": "This was such a useful read. Oh my gosh, and I love the quote at the end. Thank you for sharing ⛅️🤍",
      "created_utc": 1720268668.0,
      "score": 3,
      "context": [
        {
          "id": "lbujvgp",
          "author": "dungeonsovereign",
          "body": "Hey OP, I was in your same position. I was anorexic (& had binge/purge/exercise issues) and recovered (mostly) all on my own, without any treatment plan or external help. Not everyone can do it and every case is different, but I’ll give you my two cents on the matter.\n\nFirst of all, congratulations on trying to recover. You’ve made the right choice, my friend, and I’m proud of you.\n\nFocus more on how you’re feeling than how much you’re eating. Don’t worry about how much is a “normal” amount because you aren’t in a normal situation. If you’re dizzy/cold/hungry/headache/etc, eat. Wear loose fitting clothes, don’t weigh yourself and get rid of any home scales, try not to look at yourself in mirrors/pictures too much, drink lots of water, eat plenty of fibre and carbs, try to avoid looking at the calories on food or eat food you don’t know the calories of if you’ve memorised them, surround yourself with loved ones, put away any tight / too small clothing, and HONOUR YOUR CRAVINGS. It’s very likely that you’ll experience “extreme hunger” a little while after you start trying to recover. This is not binge eating and it is not unhealthy. It is a normal part of recovery coming from your body finally being out of starvation mode and wanting to make up for lost time. If you need to eat more than three meals a day, eat those extra meals. If you need to have a snack fifteen minutes after dinner, eat that damn snack. Listen to your body and try to care for it and give it what it wants after ignoring it for so long. It’s trying to heal you, and you can’t recover if you don’t let it do so. On the flip side, if you experience low appetite / fullness even when not eating enough try drinking tea, getting nourishing liquids like smoothies/shakes/soup, and prepping meals that are easier to handle for when it’s hard to get enough food in. \n\nIf you have the compulsion to exercise or purge, what I liked to do early in recovery was go on a short, slow walk and use my cellphone to take a picture of ten beautiful things. Flowers, dogs, cars, anything that struck me as lovely. It helped take my mind off of myself and my body, and that motion eased those self destructive feelings without hurting me or straining my body.\n\nAbove all else, never give up. It might be hard, you might feel shitty sometimes, but this will not be hard forever. In a year, or five years, or ten years, you’ll be looking back on this time and thanking yourself profusely for not letting yourself waste away due to this disease.\n\nI’d also STRONGLY recommend checking out @_thewellnessdiaries on TikTok and YouTube! She was my saving grace early in recovery, and is one of the only recovery accounts that has genuinely helped me a great deal with my eating habits and negative thought patterns.\n\n“It doesn’t matter how slowly you go, so long as you do not stop.”\n\nI believe in you and I know you can do this! Feel free to DM me if you ever need any more advice or support :)",
          "created_utc": 1720238825.0
        }
      ]
    },
    {
      "id": "lbz1ma0",
      "author": "leeee_Oh",
      "body": "Can I dm? ive been trying to recover by myself but ive been failing for months",
      "created_utc": 1720312489.0,
      "score": 1,
      "context": [
        {
          "id": "lbycroi",
          "author": "maraisthecat",
          "body": "Hey! First off, so sorry you're dealing with this. I had severe bulimia/BED for 12 years. I wouldn't wish it on my worst enemy. \n\nEverybody is very different with their recovery so take my advice with a grain of salt. \n\nFor years, I tried to recover on my own. I told myself it was just a \"willpower,\" thing etc. However, once it started impacting my job, I had to seek treatment. \n\nTherapy was a massive game changer for sure. Once I started seeing it as a medical condition and not a personal failure, it really helped. My therapist really helped me dig down into the issues of where my disorder came from. It was definitely helpful, but  I think I can mostly attribute my recovery to my change in lifestyle. In many ways, my disorder was never about the food. \n\nSo I quit my toxic job, stopped obsessing over my appearance/how people perceived me, and prioritized my health/wellness. Again, everybody is different, but I personally found it detrimental to have meal plans etc. since it just lent itself to my obsession with food and my body. I stopped labeling foods and \"good\"/\"bad\" and learnt to be flexible. \n\nAgain, I found therapy to be massively helpful in this regard (Particularly a very liberal one who specializes in attachment issues), but I had to change as well. New friends, social media breaks, etc. \n\nIf you can afford it, I would recommend getting treatment for sure. Sorry for the long post! Feel free to DM me :)",
          "created_utc": 1720302506.0
        }
      ]
    },
    {
      "id": "lc0ml1h",
      "author": "Natali06",
      "body": "me too.due to to some issues I relapsed last december and didn't recover since then",
      "created_utc": 1720343289.0,
      "score": 1,
      "context": [
        {
          "id": "lbvkapw",
          "author": "bogummyy",
          "body": "\n\ni really suggest see-ing a professional as there are usually underlying issues that trigger the disorder.\n\npersonally, i have a tendency to binge/purge & i wouldn’t say that i’ve fully recovered. I have pockets of moments where i stop doing it all together but once i relapsed, it gets really bad and doesn’t go away easily..",
          "created_utc": 1720262659.0
        }
      ]
    },
    {
      "id": "lby8xwr",
      "author": "cmsawyer12",
      "body": "Biggest thing is accountability and commitment, that’s where treatment has a huge advantage, but if you are willing and able to hold your feet to the fire and have a support person to do the same then you can",
      "created_utc": 1720301053.0,
      "score": 1,
      "context": [
        {
          "id": "lby8s5b",
          "author": "cmsawyer12",
          "body": "Yep. With the right support system you can do it",
          "created_utc": 1720300993.0
        }
      ]
    },
    {
      "id": "lc5kp3c",
      "author": "None",
      "body": "hey i’m just replying to tell you that you’ve got this, relapsing won’t solve anything, you’ll just be worse off then before, you’ve got this!!!!!!!!!",
      "created_utc": 1720419027.0,
      "score": 2,
      "context": [
        {
          "id": "lc04oji",
          "author": "Badaa1865",
          "body": "Yeah, 3-4 failed tries, the one I’m on is successful but I’m 👌🏽 close to relapsing. It’s extremely hard so if you can get professional help",
          "created_utc": 1720331059.0
        }
      ]
    },
    {
      "id": "lc16mlv",
      "author": "maraisthecat",
      "body": "Feel free to DM for generic/high level advice/support. Just know I'm not a therapist and won't be able to talk about anything that's not outside of my own experiences. Like I said, I think therapy was super helpful. :)",
      "created_utc": 1720356119.0,
      "score": 2,
      "context": [
        {
          "id": "lbycroi",
          "author": "maraisthecat",
          "body": "Hey! First off, so sorry you're dealing with this. I had severe bulimia/BED for 12 years. I wouldn't wish it on my worst enemy. \n\nEverybody is very different with their recovery so take my advice with a grain of salt. \n\nFor years, I tried to recover on my own. I told myself it was just a \"willpower,\" thing etc. However, once it started impacting my job, I had to seek treatment. \n\nTherapy was a massive game changer for sure. Once I started seeing it as a medical condition and not a personal failure, it really helped. My therapist really helped me dig down into the issues of where my disorder came from. It was definitely helpful, but  I think I can mostly attribute my recovery to my change in lifestyle. In many ways, my disorder was never about the food. \n\nSo I quit my toxic job, stopped obsessing over my appearance/how people perceived me, and prioritized my health/wellness. Again, everybody is different, but I personally found it detrimental to have meal plans etc. since it just lent itself to my obsession with food and my body. I stopped labeling foods and \"good\"/\"bad\" and learnt to be flexible. \n\nAgain, I found therapy to be massively helpful in this regard (Particularly a very liberal one who specializes in attachment issues), but I had to change as well. New friends, social media breaks, etc. \n\nIf you can afford it, I would recommend getting treatment for sure. Sorry for the long post! Feel free to DM me :)",
          "created_utc": 1720302506.0
        },
        {
          "id": "lbz1ma0",
          "author": "leeee_Oh",
          "body": "Can I dm? ive been trying to recover by myself but ive been failing for months",
          "created_utc": 1720312489.0
        }
      ]
    },
    {
      "id": "lc5sow3",
      "author": "Badaa1865",
      "body": "Thanks, you’re really sweet :)",
      "created_utc": 1720424275.0,
      "score": 1,
      "context": [
        {
          "id": "lc04oji",
          "author": "Badaa1865",
          "body": "Yeah, 3-4 failed tries, the one I’m on is successful but I’m 👌🏽 close to relapsing. It’s extremely hard so if you can get professional help",
          "created_utc": 1720331059.0
        },
        {
          "id": "lc5kp3c",
          "author": "None",
          "body": "hey i’m just replying to tell you that you’ve got this, relapsing won’t solve anything, you’ll just be worse off then before, you’ve got this!!!!!!!!!",
          "created_utc": 1720419027.0
        }
      ]
    },
    {
      "id": "lc1c2qy",
      "author": "leeee_Oh",
      "body": "Reddit wont let me send you an invite to chat for some reason",
      "created_utc": 1720358688.0,
      "score": 1,
      "context": [
        {
          "id": "lbycroi",
          "author": "maraisthecat",
          "body": "Hey! First off, so sorry you're dealing with this. I had severe bulimia/BED for 12 years. I wouldn't wish it on my worst enemy. \n\nEverybody is very different with their recovery so take my advice with a grain of salt. \n\nFor years, I tried to recover on my own. I told myself it was just a \"willpower,\" thing etc. However, once it started impacting my job, I had to seek treatment. \n\nTherapy was a massive game changer for sure. Once I started seeing it as a medical condition and not a personal failure, it really helped. My therapist really helped me dig down into the issues of where my disorder came from. It was definitely helpful, but  I think I can mostly attribute my recovery to my change in lifestyle. In many ways, my disorder was never about the food. \n\nSo I quit my toxic job, stopped obsessing over my appearance/how people perceived me, and prioritized my health/wellness. Again, everybody is different, but I personally found it detrimental to have meal plans etc. since it just lent itself to my obsession with food and my body. I stopped labeling foods and \"good\"/\"bad\" and learnt to be flexible. \n\nAgain, I found therapy to be massively helpful in this regard (Particularly a very liberal one who specializes in attachment issues), but I had to change as well. New friends, social media breaks, etc. \n\nIf you can afford it, I would recommend getting treatment for sure. Sorry for the long post! Feel free to DM me :)",
          "created_utc": 1720302506.0
        },
        {
          "id": "lbz1ma0",
          "author": "leeee_Oh",
          "body": "Can I dm? ive been trying to recover by myself but ive been failing for months",
          "created_utc": 1720312489.0
        },
        {
          "id": "lc16mlv",
          "author": "maraisthecat",
          "body": "Feel free to DM for generic/high level advice/support. Just know I'm not a therapist and won't be able to talk about anything that's not outside of my own experiences. Like I said, I think therapy was super helpful. :)",
          "created_utc": 1720356119.0
        }
      ]
    }
  ]
}