{
  "id": "1e9oty9",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1721680870.0,
  "title": "Getting mad when someone asks if I’ve eaten",
  "selftext": "Does anyone else get really irritated and offended when someone asks if you have eaten? I don’t know why I do. It annoys me so much and makes me think that they are judging me. I think that they are making fun of me by saying this. People look at me like I’m insane when I ask them why they are asking and that I don’t like it",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1e9oty9/getting_mad_when_someone_asks_if_ive_eaten/",
  "score": 75,
  "num_comments": 25,
  "comments": [
    {
      "id": "leld00l",
      "author": "I_need_to_vent44",
      "body": "Same. My friends have a habit of asking me and it just makes me mad because there is no good answer. Whether or not I've eaten, I would never admit to it, my eating disorder is dead convinced that the right answer is \"No\" and my rational brain knows that the right answer is \"Yes\". It's a lose lose situation and I'll probably lie anyway and then I'll feel bad about lying.",
      "created_utc": 1721763124.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lemfawp",
      "author": "None",
      "body": "fr, like after i have a binge and feel like shit and then my mom asks why i'm not eating dinner and i'm scared to tell her what i've already aten",
      "created_utc": 1721775715.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lemwoq7",
      "author": "Catbun2020",
      "body": "I had a rule. No one was allowed to ask me if I ate except for two people. Everyone who knew I was in recovery knew they were allowed to ask, but no one else. I was furious when one of their girlfriends at dinner told me I needed to eat more because that was incredibly upsetting and we had to have a come to Jesus talk with her. \n\nBut honestly, just set *reasonable* boundaries with recovery",
      "created_utc": 1721782145.0,
      "score": 3,
      "context": []
    },
    {
      "id": "leme2oz",
      "author": "potatofuker1",
      "body": "I get uber pissed and annoyed. I've gotten so used to eating once maybe twice a day and get looked at like I'm nuts because I don't eat lunch at work.",
      "created_utc": 1721775276.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lena6yq",
      "author": "pawgie_pie",
      "body": "I used to hate it hun, in fact I would go all stubborn and not eat if someone told me too. \n\nSomehow it grinded my gears to the point where I promised myself that I would eat no matter what, coz to them it's not coming from a place of harm and sabotage, it's coming from care. ..\nBut yes it would piss me off to tears.",
      "created_utc": 1721787405.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lenedfz",
      "author": "HotButt_eredPotato",
      "body": "Absolutely. My boyfriend and coworkers ask me constantly if I've ate recently, and I just deadstare them or give them a playful look to try and change the subject. My coworkers treat me like a fragile porcelain doll because I'm clearly not mentally well, and everything combined just feels infantalizing. It's very frustrating having to come up with an answer",
      "created_utc": 1721789082.0,
      "score": 2,
      "context": []
    },
    {
      "id": "leo3zxj",
      "author": "pinkienewbie",
      "body": "I hate it!! I know deep down they just care about me and are trying to be helpful. But it isn’t helpful. Also if I haven’t eaten I just end up lying and saying I have anyway, so there is no real point asking. \nI’m in recovery and a few of my friends cannot seem to see I’m still the same person I was a year ago before I developed this ED. So when we talk it’s not about anything other that my ED and whether I have eaten…",
      "created_utc": 1721802013.0,
      "score": 2,
      "context": []
    },
    {
      "id": "leoqilf",
      "author": "ChemistDangerous5705",
      "body": "This question is so triggering for me...I'm just going along and then someone will pose that question and it simply awakens the ED beast and I fall back in the trap. I do know that I should not react to comments from others, but it's like a switch gets flipped on. Maybe some day I  can learn to temper my reactions. This ED madness is so very good at holding me hostage.",
      "created_utc": 1721816884.0,
      "score": 2,
      "context": []
    },
    {
      "id": "leq96md",
      "author": "Thatnerdofaperson",
      "body": "It feels like a reminder to do a chore. Absolutely frustrating, but people are just trying to look out for you. Even if it’s in the most judgmental way possible.",
      "created_utc": 1721837948.0,
      "score": 2,
      "context": []
    },
    {
      "id": "levh7ks",
      "author": "None",
      "body": "I have anorexia so I haven’t ate 90% of the time someone asks. Not eating already mentally bothers me and makes me angry and upset at the world, but then being asked if I’ve ate? Omg I go into homicide mode.",
      "created_utc": 1721916887.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lormfew",
      "author": "Silver-Internal-6815",
      "body": "For me, I have been struggling to lose weight, so I get really annoyed when somebody asks if im eating because I try to limit my diet by limiting my calories and eating better. But if dinner is something unhealthy straight up takeout, its really hard to not to eat, as eating was a way to resource guard growing up, I struggle with eating more than I should, so I try the out of sight out of mind approach. But when people keep asking me and about eating dinner, even though I have expressed my reason that some nights, I can not eat dinner as I have reached or that meal will exceed my caloric intake for the day. It will get to the point that I have to straight up argue because my feelings dont feel like they are being heard. Or if Im having a bad day, all I hear is, \"Don't worry about it, just get fatter, you will always be big anyways.\" I know it's from a place of love. it's just annoying when I am basically interrogated for refusing to eat when my concerns have been expressed, so some nights, I get rather upset.",
      "created_utc": 1727217758.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lsy2vnp",
      "author": "EasyOil7",
      "body": "Especially when they ask what you ate",
      "created_utc": 1729477875.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lelonh1",
      "author": "HappyOrganization867",
      "body": "I hate it too idk what it is but I am allergic to dairy and lactose,whey,cheese,cream,sugar,wheat white flour.they bloat my stomach and give me pain.",
      "created_utc": 1721766751.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ler9yw3",
      "author": "TarHound",
      "body": "If people ask if I’ve eaten, I’ll either lie or tell the truth depending on the person, and what I feel like. I only really get guilty if the person knows I have an ED. However I absolutely hate being asked what I’ve eaten. Especially by my mother. But that is not just ED brain fuckery I think. Before I developed an ED, I was inpatient for other stuff for over a year at a youth psych ward. I was home during weekends. Thing is, when I came home, the first, and pretty much only thing she would ask about is what I had eaten while there. It was not just a general question. She wanted me to list what I had eaten all week, as if that was the most eventful thing about my life, or only thing worth asking about. Like never mind school or the activities there or how I was doing in general. Irony is, eating sure as hell is the most eventful part of my life now. I was confused and mildly annoyed by her asking then, and I sure as hell hate being asked now.",
      "created_utc": 1721849474.0,
      "score": 1,
      "context": []
    },
    {
      "id": "leu63qp",
      "author": "Ok_Raspberry9626",
      "body": "You are not alone. For me I think i get angry because I think they would expect me to not eat because of the ED, but i have actually eaten and I get upset at that fact. I understand it's not something to be upset over but I am still working on it, do you think it's like that for you?",
      "created_utc": 1721892772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "leur0lx",
      "author": "None",
      "body": "If you are in a work setting, or when you get older, I caution you to get a handle on this. Regular adults bond over and discuss food/meals. I had an employee that was so bewildered of any mention of food it was very alienating. I once asked her \"how was your lunch\" when we had returned from the lunch hour and she looked like a deer in the headlights and shot daggers at me. I'm not trying to be unsupportive just letting you know this can have a real impact on your future if you make your issues so obvious and alienate other people about it.",
      "created_utc": 1721906154.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lewmuwi",
      "author": "StrainBroda",
      "body": "I'm happy seeing I'm not the only one triggered by this. On top of that if I'm still eating and someone is saying to me to maybe take something else or if I want more I go with NO, although I would have taken just because they've asked. Too annoying for me, I hate myself.",
      "created_utc": 1721930097.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lewpon1",
      "author": "PomeloPurple5555",
      "body": "my boyfriend does this. and i know he means well by it and he’s genuinely asking because he cares. it’s not so much the asking, it’s that when i say yes that sometimes people don’t believe it.",
      "created_utc": 1721931002.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lexjyo1",
      "author": "Fabulous_Coconut5153",
      "body": "For real though like it’s so annoying",
      "created_utc": 1721940556.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfjcns3",
      "author": "None",
      "body": "real it makes me feel stupid and i hate the attention when i say i haven’t because they just instantly assume there is something wrong with me",
      "created_utc": 1722282166.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfmy4ux",
      "author": "GabeNewellExperience",
      "body": "I honestly enjoy it. They are checking up on me and making sure I fuel my body correctly ",
      "created_utc": 1722341431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lemf4im",
      "author": "None",
      "body": "I feel this. At work people are actively annoyed at me for not eating lunch. And if I do they look at my food choices like it’s crazy",
      "created_utc": 1721775651.0,
      "score": 2,
      "context": [
        {
          "id": "leme2oz",
          "author": "potatofuker1",
          "body": "I get uber pissed and annoyed. I've gotten so used to eating once maybe twice a day and get looked at like I'm nuts because I don't eat lunch at work.",
          "created_utc": 1721775276.0
        }
      ]
    },
    {
      "id": "leusnly",
      "author": "None",
      "body": "Thank you. I’ll try and work on it. I think it stems from childhood as I had a mother who would always ask me but in a mean way and then make fun of me for eating",
      "created_utc": 1721906985.0,
      "score": 1,
      "context": [
        {
          "id": "leur0lx",
          "author": "None",
          "body": "If you are in a work setting, or when you get older, I caution you to get a handle on this. Regular adults bond over and discuss food/meals. I had an employee that was so bewildered of any mention of food it was very alienating. I once asked her \"how was your lunch\" when we had returned from the lunch hour and she looked like a deer in the headlights and shot daggers at me. I'm not trying to be unsupportive just letting you know this can have a real impact on your future if you make your issues so obvious and alienate other people about it.",
          "created_utc": 1721906154.0
        }
      ]
    },
    {
      "id": "lemfk5y",
      "author": "potatofuker1",
      "body": "It totally is. I typically only eat breakfast and dinner but I'll literally eat anything for breakfast and if I get something that isn't seen as breakfast food I get the funny looks or questions.",
      "created_utc": 1721775808.0,
      "score": 3,
      "context": [
        {
          "id": "leme2oz",
          "author": "potatofuker1",
          "body": "I get uber pissed and annoyed. I've gotten so used to eating once maybe twice a day and get looked at like I'm nuts because I don't eat lunch at work.",
          "created_utc": 1721775276.0
        },
        {
          "id": "lemf4im",
          "author": "None",
          "body": "I feel this. At work people are actively annoyed at me for not eating lunch. And if I do they look at my food choices like it’s crazy",
          "created_utc": 1721775651.0
        }
      ]
    },
    {
      "id": "leuwt7j",
      "author": "None",
      "body": "I'm sorry you went through that. Try to remember that most people are not trying to be unkind. A lot of times talking about meals is like talking about the weather and whoever is asking is really not too invested in your response. A generic, non detailed response would usually be fine.",
      "created_utc": 1721908949.0,
      "score": 2,
      "context": [
        {
          "id": "leur0lx",
          "author": "None",
          "body": "If you are in a work setting, or when you get older, I caution you to get a handle on this. Regular adults bond over and discuss food/meals. I had an employee that was so bewildered of any mention of food it was very alienating. I once asked her \"how was your lunch\" when we had returned from the lunch hour and she looked like a deer in the headlights and shot daggers at me. I'm not trying to be unsupportive just letting you know this can have a real impact on your future if you make your issues so obvious and alienate other people about it.",
          "created_utc": 1721906154.0
        },
        {
          "id": "leusnly",
          "author": "None",
          "body": "Thank you. I’ll try and work on it. I think it stems from childhood as I had a mother who would always ask me but in a mean way and then make fun of me for eating",
          "created_utc": 1721906985.0
        }
      ]
    }
  ]
}