{
  "id": "1eco6rq",
  "subreddit": "EatingDisorders",
  "author": "snuzester",
  "created_utc": 1722000756.0,
  "title": "how to stop body checking?",
  "selftext": "one of my main relapse triggers seems to be looking at myself (specifically my bare stomach area) in mirrors. i only ever wear loose shirts that dont show my stomach so i have to go out of my way to do this and sometimes i can stop myself when the urge hits, sometimes i cant and 9/10 times i will trigger myself. is it like this for anyone else? what do u guys do to stop the urge?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1eco6rq/how_to_stop_body_checking/",
  "score": 44,
  "num_comments": 9,
  "comments": [
    {
      "id": "lf4e9k8",
      "author": "None",
      "body": "Don’t know if this will be helpful but I dealt with this and the way I overcame it was just that since I already knew I’d be upset if I saw my insecurities reflected on the mirror I just sorta avoided looking at the mirror. Over time, it just became an instinct for me to avoid mirrors because I didn’t want to be put in a bad mood over seeing my body. Wish you the best of luck x",
      "created_utc": 1722041227.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lf4l4l4",
      "author": "Minimum_Plastic886",
      "body": "Sometimes I have to avoid mirrors all together because I know if the opportunity is presented then I will body check :/ its tough but all you can do is not even give yourself the chance to do it. I almost do it on purpose sometimes on days recovery is going well, which is such a weird thing because why would I want to trigger myself on purpose?? I completely get where you're coming from though, I'm early in recovery and the urges don't stop for me, I just have to distract myself from them or just try and ignore them :( it's easier said than done but I wish you all the luck and I believe in you! <3",
      "created_utc": 1722044125.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lf7nw2r",
      "author": "pussilanimity",
      "body": "when I had it real bad, I only used small mirrors so I could see my face. covered the big one I had with a scarf, and only wore baggy/oversized clothes.. \n\ngood luck, op 🌸",
      "created_utc": 1722099624.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lf8h6dc",
      "author": "Homeo_Juliet",
      "body": "My wife has body image issues. Even though she’s absolutely perfect. We had problems with the mirrors. I found a stick on window film. It made the mirror blurry so she wasn’t tempted to body check when she walked by. I only did it from the chest down. It really helped. I wish you the best ❤️",
      "created_utc": 1722110238.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lfci645",
      "author": "ContributionNeat6181",
      "body": "I avoid mirrors and don’t wear clothing that you keep touching",
      "created_utc": 1722179950.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfjcesu",
      "author": "None",
      "body": "What helps me is just having smaller mirrors so i can just see my face and not looking at my body before i leave the house. I try avoid looking through reflections in windows too because that will just ruin my self esteem. Some days i will wake up and feel confident in my outfit and how my body looks but that changes after an hour and i suddenly want to cry and just not want to go out anywhere",
      "created_utc": 1722282084.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lfn1553",
      "author": "None",
      "body": "Body checking was a compulsion for me at one point. I still feel the urge but isn’t as bad anymore. In the early days of my recovery I took a break from social media, because comparison is the thief of joy *and* it was impossible for me to ignore fitness or influencer accounts that fulfilled my pro-ana image fix. I also removed the one full length mirror we had. I eventually brought it back and if I felt the urge and stopped in front of it, I would give my reflection a wave and smile and say, how’s it going? You look great! And keep moving. The important thing is to give yourself grace and patience 🫶🏻",
      "created_utc": 1722342768.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lf62jir",
      "author": "snuzester",
      "body": "yes sometimes i trigger myself on purpose when im doing well, too :( so i get it! wishing u well <3",
      "created_utc": 1722074700.0,
      "score": 3,
      "context": [
        {
          "id": "lf4l4l4",
          "author": "Minimum_Plastic886",
          "body": "Sometimes I have to avoid mirrors all together because I know if the opportunity is presented then I will body check :/ its tough but all you can do is not even give yourself the chance to do it. I almost do it on purpose sometimes on days recovery is going well, which is such a weird thing because why would I want to trigger myself on purpose?? I completely get where you're coming from though, I'm early in recovery and the urges don't stop for me, I just have to distract myself from them or just try and ignore them :( it's easier said than done but I wish you all the luck and I believe in you! <3",
          "created_utc": 1722044125.0
        }
      ]
    },
    {
      "id": "lf8j29i",
      "author": "snuzester",
      "body": "thank you 😊 im glad your wife has you as support <3",
      "created_utc": 1722110937.0,
      "score": 3,
      "context": [
        {
          "id": "lf8h6dc",
          "author": "Homeo_Juliet",
          "body": "My wife has body image issues. Even though she’s absolutely perfect. We had problems with the mirrors. I found a stick on window film. It made the mirror blurry so she wasn’t tempted to body check when she walked by. I only did it from the chest down. It really helped. I wish you the best ❤️",
          "created_utc": 1722110238.0
        }
      ]
    }
  ]
}