{
  "id": "1eiljix",
  "subreddit": "EatingDisorders",
  "author": "Ademiniesx",
  "created_utc": 1722633457.0,
  "title": "Can bulimia turn into anorexia? ",
  "selftext": "Has any of you experienced your eating disorder change? \n Like if you have bulimia and then your bulimia turn into anorexia xx\n\nI would love to hear your stories!! ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1eiljix/can_bulimia_turn_into_anorexia/",
  "score": 55,
  "num_comments": 56,
  "comments": [
    {
      "id": "lg84xhv",
      "author": "MoulinSarah",
      "body": "Yes. Mine circles around and around. Anorexia, bed, bulimia",
      "created_utc": 1722643717.0,
      "score": 68,
      "context": []
    },
    {
      "id": "lg95axf",
      "author": "shaeshayshae",
      "body": "It happens when I'm unable to purge (for whatever reason). Mostly because my gag reflex “stops” working, so I'm forced to restrict ;-; it’s frustrating because I don’t easily restrict/starve when that happens, it either works for me or doesn’t. When it does, I can restrict/starve for a long time. When it doesn’t, I struggle a lot more trying to purge again.     \nI've been bulimic for most of my life, but I generally go through phases where it’s strictly one disorder (anorexia, bulimia, BED..)",
      "created_utc": 1722659379.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lg8pzjq",
      "author": "starfluxx",
      "body": "Absolutely. I started with binge eating- in my culture, overeating is very common, so which morphed into binging pretty easily. That led to bulimia, which led to moderate restricting, which evolved into heavy restricting, aka anorexia. Mine has taken various forms over the years.",
      "created_utc": 1722652248.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lgdpctb",
      "author": "e_87",
      "body": "honestly i feel like it’s all a cycle.",
      "created_utc": 1722730672.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lg7xs30",
      "author": "turtle__enthusiast",
      "body": "I've been through it. I went from binge eating disorder to anorexia to bulimia. The BED was a symptom of ADHD (I didn't know that at the time). I started treatment for BED and my attempts to avoid binging led to a serious fear of eating, thus anorexia. Then a year and a half later the dam broke, so to speak, and I stopped restricting. But I began purging out of the guilt and shame I felt over eating more. Five years later I got diagnosed with ADHD and started Ritalin, and now I eat more or less normally.",
      "created_utc": 1722640962.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lgayy4j",
      "author": "Global_Locksmith_154",
      "body": "seeing everyone's story makes me feel less alone in this 🥲though I would like to add a comment. Isn't this technically just ednos?\nI feel weird calling myself \"bulimic\" or whatever since I know I go through so much phases whether I restrict, high res, excessively exercise, binge and not purge, orthorexic-ish, etc.",
      "created_utc": 1722695720.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lg96ohl",
      "author": "chrmeheart",
      "body": "Yes. For me it started with restriction, then mia, back to restriction, BED, now I’m kind of in recovery with ortho tendencies… it’s weird",
      "created_utc": 1722660096.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgb3ibp",
      "author": "RisingPhoenix603",
      "body": "I had both up until 3 months ago when I was purging and passed out. Smack my face somehow on the toilet seat. Thought I broke all my teeth! Fortunately it hit under my nose and broke my nose. Woke up blood everywhere. I haven’t been able to purge since so I restrict bad. I also have a bad case of body dysmorphia. I’m 50 and all this was brought on from the trauma of my husband up and walking out on our 20 year marriage. This is the worst thing ever. I just want to eat and be ok.",
      "created_utc": 1722697334.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lg8zuks",
      "author": "None",
      "body": "mine have all just mixed and matched so I have anorexia and bulimia and sometimes it just purging and sometimes its just binging. but it changes alot",
      "created_utc": 1722656695.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg9pgt5",
      "author": "vodkadiet3",
      "body": "I’m literally in the worst cycle of two weeks being totally health conscious and taking really good of myself, then two weeks of Ed and then normal again.",
      "created_utc": 1722671491.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg9xf9x",
      "author": "pinkdaisyisback",
      "body": "When I first went to therapy for (severe) bulimia, my therapist gave me homework that included “not to purge x 1 week.” I immediately learned that 1) I wasn’t going to fail (bc I really wanted to get better as I had just given birth to my daughter) BUT 2) if I couldn’t purge than I couldn’t eat 🙁 … voila: the birth of an intense and decades long, life threatening, new ed 🤡",
      "created_utc": 1722676829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgagssl",
      "author": "None",
      "body": "they’re usually comorbid so yes that’s common",
      "created_utc": 1722688290.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgauc29",
      "author": "justmonaaaaa",
      "body": "Yes, first I had bulimia but i didn't like to purge al the time so then I had anorexia... I was getting better, like I was eating everyday and I did it great. But the last 2 weeks not.",
      "created_utc": 1722694016.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgc3bfy",
      "author": "Moosetracks7914",
      "body": "all eating disorders can shape shift. it's like whack a mole. it's never about the food or instrument of choice. it's about the feelings induced.",
      "created_utc": 1722709588.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgdnwps",
      "author": "Ok-Section-7633",
      "body": "I’ve struggled with both since I was a preteen (I’m 36 now), as well as BED.  It appears ana rears her ugly head when I’m stressed or the opposite- when I’m very happy or motivated, bulimia is the normal, BED typically comes when depressed or complacent .  I have gained and lost over 100lbs 6x in my life.  I’ve always struggled with being believed or even talking about it because my ED has been such a mixed bag, I just want to thank you for asking this question OP because I had no idea how common this is.",
      "created_utc": 1722730102.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lgfknz4",
      "author": "DontWantToUseMyMain-",
      "body": "Yes, my teeth started rotting due to bulimia which was my ”wake up call”. Unfortunately I am not strong enough to recover so instead I just eat restrictive.",
      "created_utc": 1722766477.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m33qo8e",
      "author": "Technical_Raise1715",
      "body": "I have experienced both binge eating disorder initially when I was a teenager, then I began purging through throwing up and laxative abuse after I binged and developed bulimia for years which was the worst one I thought. I didn’t know what I was doing was bulimia, I would throw up and use laxatives to avoid bloating and make myself feel empty after eating too much and regretting it. A few years later I developed anorexia to gain control and loose weight but I would still purge often even tho I didn’t binge as much. I’m almost recovered now and don’t fit into a criteria for my ED anymore but I still struggle with occasional purging as a habit but so eat a healthy and good amount.",
      "created_utc": 1734764179.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lg92c5i",
      "author": "LNGeez",
      "body": "It depends on what I’m going through. I usually end up purging but ultimately if I’m particularly depressed I will restrict, it makes things worse for a little bit then they get easier suddenly — like the restricting isn’t hard - it’s not a great cycle by any means but I’ve never felt like I struggled with just one",
      "created_utc": 1722657893.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lg9laa4",
      "author": "Glittering_goat25",
      "body": "I cycle between them but my primary diagnosis is anorexia-restriction subtype. I’ve recently been anorexia-b/p subtype. And I’m back to restriction. So yes absolutely",
      "created_utc": 1722668769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgakng0",
      "author": "SakuraSkye16",
      "body": "I have anorexia b/p subtype, which is essentially bulimia, but with an anorexic weight:v",
      "created_utc": 1722690053.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgavn8y",
      "author": "TrainerSuspicious683",
      "body": "I went from one extreme to the other, from BED to anorexia",
      "created_utc": 1722694513.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgb37z3",
      "author": "_ALLuR3",
      "body": "Yes but only after struggling with bulimia several years. I hated bulimia but couldn’t stop. My life circumstances changed where my work schedule and job itself made it extremely challenging to binge and purge. Also, my core bulimia years were as an adolescent and young adult living in my parents home—I moved out and became fully independent, things didn’t improve immediately ao I still struggled, however, there was a upward trajectory of binging and purging less and yet restricting to compensate behaviors. Bulimia was taking a savagely detrimental toll on my physical health, I was genuinely afraid I would die in my sleep, it took all of my physical strength from the dehydration and chronic electrolyte depletion. The non-ED goals I wanted to accomplish became more important and I began to shift. What saved me the most was investing in my teeth and getting veneers, I made an inner vow to myself that if I am putting that much money into my teeth, I’m not going to fuck them up again. The veneers gave me a lot of confidence & made me feel like I had a second chance to treat my body better. I haven’t purged since January but am still restricting",
      "created_utc": 1722697234.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgbazc4",
      "author": "MonkRepresentative63",
      "body": "Mine did. But only becuase I was forced to. I ended up in hospital from my bulima, the doctor told me I needed to stop purging and I said I was scared of gaining weight and she said well even if you restrict and stop purging it will be better. Ik she didn’t mean for me to move form one ed to another but in my head it sounded like I got the ok from my doctor to starve",
      "created_utc": 1722699877.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgbomd8",
      "author": "rcarman87",
      "body": "Yes, I went through both. I got tired of purging so restricting became easier to space out the periods of purging.",
      "created_utc": 1722704554.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgcv5rh",
      "author": "Mammons-Goldie",
      "body": "I had anorexia at first then I got better slowly but it quickly became binge eating then blumia. It is turning to anorexia again so yea it changed forms over years for me",
      "created_utc": 1722719329.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgd7qa5",
      "author": "ir0nicrexic",
      "body": "I used to struggle with BED when I was a kid, then it became bulimia and at the end I developed anorexia b/p subtype mostly cuz of ppl commenting on my weight",
      "created_utc": 1722723962.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgd8yzk",
      "author": "ir0nicrexic",
      "body": "I used to struggle with BED when I was a kid, then it became bulimia and at the end I developed anorexia b/p subtype mostly cuz I was really pressured by ppl commenting on my image that made me fall right into restricting",
      "created_utc": 1722724427.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgd8zv7",
      "author": "ir0nicrexic",
      "body": "I used to struggle with BED when I was a kid, then it became bulimia and at the end I developed anorexia b/p subtype mostly cuz I was really pressured by ppl commenting on my image that made me fall right into restricting",
      "created_utc": 1722724436.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgdc7n3",
      "author": "ActivityIll8075",
      "body": "Yes. It happened to me when I got an infection from bulimia. I was so afraid of the pain and bloating, I stopped eating completely",
      "created_utc": 1722725637.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgdglx8",
      "author": "Sodapop40",
      "body": "Yea of course.",
      "created_utc": 1722727316.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgdgmm9",
      "author": "Sodapop40",
      "body": "Doesn’t always tho",
      "created_utc": 1722727323.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgdgt7e",
      "author": "Sodapop40",
      "body": "Lots of people with anorexia have bulimia as well my cousin Ty even if we aren’t biological related I am still his family.",
      "created_utc": 1722727393.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgdh02p",
      "author": "Sodapop40",
      "body": "He has anorexia where he makes him self puke doesn’t eat and over exercise because his dad is a domestic violence narcissist.",
      "created_utc": 1722727464.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgdh4yz",
      "author": "Sodapop40",
      "body": "G has an eating disorder for the same reason except for she/he looks to have more muscles.",
      "created_utc": 1722727516.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgdh913",
      "author": "Sodapop40",
      "body": "I am sharing the reality of the situation with the journey though not a story.",
      "created_utc": 1722727560.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgdhcyx",
      "author": "Sodapop40",
      "body": "I support recover from Eating Disorders 100%",
      "created_utc": 1722727603.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgfdxez",
      "author": "HawkCareless3428",
      "body": "yes definitely, other way round for me",
      "created_utc": 1722761788.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgfk506",
      "author": "JeffreyFarmer",
      "body": "I was the other way around- anorexia, then when I finally started eating more, I started bingeing. Then I’d purge. Yay",
      "created_utc": 1722766116.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgfk73w",
      "author": "Legitimate_Snow7520",
      "body": "it feels like a cycle",
      "created_utc": 1722766156.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgg62a9",
      "author": "idkman1768",
      "body": "Yeah, I symptom swap allll the time",
      "created_utc": 1722777942.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgi0m72",
      "author": "Cautious-Hurry6471",
      "body": "Bros asking if a voluntary disease that you’re choosing to inflict on yourself can change☠️",
      "created_utc": 1722801159.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgl317j",
      "author": "Advertising_Mother",
      "body": "developed anorexia at 12, it was pretty bad. then became essentially orthorexic at 13 1/2  (i say essentially because it’s the only one of the three i haven’t been officially diagnosed with) suffered till about 14 when my parents caught on and i began to purge heavily, i’m now bulimic and haven’t eaten anything without throwing it up for the last 2 1/2 years. it’s pretty common for people to go from ana to mia or mia to ana, often due to forced recovery or people around them catching on.",
      "created_utc": 1722852600.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgtp1gj",
      "author": "Bitter_Wing_999",
      "body": "Yes. Very common. Mine started with restrictive behavior then turned to purging behavior for a few years before circling back.",
      "created_utc": 1722973860.0,
      "score": 1,
      "context": []
    },
    {
      "id": "li6jivc",
      "author": "ute-R-us",
      "body": "often anorexia can cause you to become bulimic, e.g. purging when you feel like you haven’t restricted enough. i found that i would just pick whichever was the easier option depending on the day",
      "created_utc": 1723690573.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lg8ug8k",
      "author": "Loreannexx",
      "body": "yep, not the other way though",
      "created_utc": 1722654194.0,
      "score": -2,
      "context": []
    },
    {
      "id": "lg9fv05",
      "author": "mrslangdon28",
      "body": "Same",
      "created_utc": 1722665362.0,
      "score": 5,
      "context": [
        {
          "id": "lg84xhv",
          "author": "MoulinSarah",
          "body": "Yes. Mine circles around and around. Anorexia, bed, bulimia",
          "created_utc": 1722643717.0
        }
      ]
    },
    {
      "id": "lll56d0",
      "author": "Cosmic_VoyagerZ",
      "body": "Has this been keeping you skinny? I used to be bulimic like 4 years ago, as of today, I been having terrible esteem leading me to purge myself when I have a piece of bread (for example) but I been also fasting for about 16 hrs night to morning, having green juice, then minimal homemade soup w no fat and lastly barely anything at nights (I had 1/2 cup of lentils and half biscuit but mostly likely i threw all away bc i felt guilty i had the biscuit . I been starving myself. ig it’s better this way? At least I’m having healthy food, not like a few month ago I was having hot Cheetos as breakfast and then ice cream at night (it kept me fat) and now ig I’m loosing weight, my sister just told me my face looks a lot skinnier buuuut, what am I doing now would be considered has anorexia, if not, what? And what is actually considered anorexia? help help help",
      "created_utc": 1725514674.0,
      "score": 2,
      "context": [
        {
          "id": "lg95axf",
          "author": "shaeshayshae",
          "body": "It happens when I'm unable to purge (for whatever reason). Mostly because my gag reflex “stops” working, so I'm forced to restrict ;-; it’s frustrating because I don’t easily restrict/starve when that happens, it either works for me or doesn’t. When it does, I can restrict/starve for a long time. When it doesn’t, I struggle a lot more trying to purge again.     \nI've been bulimic for most of my life, but I generally go through phases where it’s strictly one disorder (anorexia, bulimia, BED..)",
          "created_utc": 1722659379.0
        }
      ]
    },
    {
      "id": "lgctgze",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1722718726.0,
      "score": 3,
      "context": [
        {
          "id": "lg8pzjq",
          "author": "starfluxx",
          "body": "Absolutely. I started with binge eating- in my culture, overeating is very common, so which morphed into binging pretty easily. That led to bulimia, which led to moderate restricting, which evolved into heavy restricting, aka anorexia. Mine has taken various forms over the years.",
          "created_utc": 1722652248.0
        }
      ]
    },
    {
      "id": "lgl3cgw",
      "author": "Advertising_Mother",
      "body": "sort of, but there are also many many sub version of every ed. for example, there’s b/p ana which (according to my ex dietitian) is essentially bulimia with an “anorexic” weight (hate this explanation but that’s how it’s told) . also, with most people’s ed’s phases or cycles are very common. you are allowed to label yourself with whichever one you’d rather or brings you more comfort or more of an explanation to your feelings.  however keep in mind that only medical professionals can properly diagnose :) hope this helped a bit",
      "created_utc": 1722852798.0,
      "score": 1,
      "context": [
        {
          "id": "lgayy4j",
          "author": "Global_Locksmith_154",
          "body": "seeing everyone's story makes me feel less alone in this 🥲though I would like to add a comment. Isn't this technically just ednos?\nI feel weird calling myself \"bulimic\" or whatever since I know I go through so much phases whether I restrict, high res, excessively exercise, binge and not purge, orthorexic-ish, etc.",
          "created_utc": 1722695720.0
        }
      ]
    },
    {
      "id": "lgl3mfz",
      "author": "Advertising_Mother",
      "body": "im so sorry you’ve been through so much. i hope things turn around in your life, you’re worthy of recovery and love ❤️‍🩹",
      "created_utc": 1722852969.0,
      "score": 2,
      "context": [
        {
          "id": "lgb3ibp",
          "author": "RisingPhoenix603",
          "body": "I had both up until 3 months ago when I was purging and passed out. Smack my face somehow on the toilet seat. Thought I broke all my teeth! Fortunately it hit under my nose and broke my nose. Woke up blood everywhere. I haven’t been able to purge since so I restrict bad. I also have a bad case of body dysmorphia. I’m 50 and all this was brought on from the trauma of my husband up and walking out on our 20 year marriage. This is the worst thing ever. I just want to eat and be ok.",
          "created_utc": 1722697334.0
        }
      ]
    },
    {
      "id": "lgdro7e",
      "author": "Needingsupport333",
      "body": "Same. it’s such an odd diagnostic difference",
      "created_utc": 1722731588.0,
      "score": 1,
      "context": [
        {
          "id": "lgakng0",
          "author": "SakuraSkye16",
          "body": "I have anorexia b/p subtype, which is essentially bulimia, but with an anorexic weight:v",
          "created_utc": 1722690053.0
        }
      ]
    },
    {
      "id": "lg96zex",
      "author": "sockpotatoes",
      "body": "Yes it can? I was anorexic for years, but it shifted into bulimia as I tried to recover/make it look like I was doing good to the people around me, but really I just developed a different ed",
      "created_utc": 1722660257.0,
      "score": 4,
      "context": [
        {
          "id": "lg8ug8k",
          "author": "Loreannexx",
          "body": "yep, not the other way though",
          "created_utc": 1722654194.0
        }
      ]
    },
    {
      "id": "llnbmol",
      "author": "shaeshayshae",
      "body": "Sorry that you’re going through all of this ;-; eating disorders can be really messy at times, I can relate to that. It’s always better to seek professional advice when it comes to diagnosis, I can’t diagnose you with anything. But I think you would be interested in reading about Anorexia b/p subtype, EDNOS or OSFED :]\nThe subreddit r/fuckeatingdisorders is a nice place for similar questions, as well. I hope you get more clarity on this. ",
      "created_utc": 1725552320.0,
      "score": 2,
      "context": [
        {
          "id": "lg95axf",
          "author": "shaeshayshae",
          "body": "It happens when I'm unable to purge (for whatever reason). Mostly because my gag reflex “stops” working, so I'm forced to restrict ;-; it’s frustrating because I don’t easily restrict/starve when that happens, it either works for me or doesn’t. When it does, I can restrict/starve for a long time. When it doesn’t, I struggle a lot more trying to purge again.     \nI've been bulimic for most of my life, but I generally go through phases where it’s strictly one disorder (anorexia, bulimia, BED..)",
          "created_utc": 1722659379.0
        },
        {
          "id": "lll56d0",
          "author": "Cosmic_VoyagerZ",
          "body": "Has this been keeping you skinny? I used to be bulimic like 4 years ago, as of today, I been having terrible esteem leading me to purge myself when I have a piece of bread (for example) but I been also fasting for about 16 hrs night to morning, having green juice, then minimal homemade soup w no fat and lastly barely anything at nights (I had 1/2 cup of lentils and half biscuit but mostly likely i threw all away bc i felt guilty i had the biscuit . I been starving myself. ig it’s better this way? At least I’m having healthy food, not like a few month ago I was having hot Cheetos as breakfast and then ice cream at night (it kept me fat) and now ig I’m loosing weight, my sister just told me my face looks a lot skinnier buuuut, what am I doing now would be considered has anorexia, if not, what? And what is actually considered anorexia? help help help",
          "created_utc": 1725514674.0
        }
      ]
    },
    {
      "id": "lgi3gm7",
      "author": "starfluxx",
      "body": "I'm sure my statement applies to several, but Cajun and southern culture specifically!",
      "created_utc": 1722802129.0,
      "score": 1,
      "context": [
        {
          "id": "lg8pzjq",
          "author": "starfluxx",
          "body": "Absolutely. I started with binge eating- in my culture, overeating is very common, so which morphed into binging pretty easily. That led to bulimia, which led to moderate restricting, which evolved into heavy restricting, aka anorexia. Mine has taken various forms over the years.",
          "created_utc": 1722652248.0
        },
        {
          "id": "lgctgze",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1722718726.0
        }
      ]
    },
    {
      "id": "llnw7j2",
      "author": "Cosmic_VoyagerZ",
      "body": "Thanks!!!",
      "created_utc": 1725558804.0,
      "score": 2,
      "context": [
        {
          "id": "lg95axf",
          "author": "shaeshayshae",
          "body": "It happens when I'm unable to purge (for whatever reason). Mostly because my gag reflex “stops” working, so I'm forced to restrict ;-; it’s frustrating because I don’t easily restrict/starve when that happens, it either works for me or doesn’t. When it does, I can restrict/starve for a long time. When it doesn’t, I struggle a lot more trying to purge again.     \nI've been bulimic for most of my life, but I generally go through phases where it’s strictly one disorder (anorexia, bulimia, BED..)",
          "created_utc": 1722659379.0
        },
        {
          "id": "lll56d0",
          "author": "Cosmic_VoyagerZ",
          "body": "Has this been keeping you skinny? I used to be bulimic like 4 years ago, as of today, I been having terrible esteem leading me to purge myself when I have a piece of bread (for example) but I been also fasting for about 16 hrs night to morning, having green juice, then minimal homemade soup w no fat and lastly barely anything at nights (I had 1/2 cup of lentils and half biscuit but mostly likely i threw all away bc i felt guilty i had the biscuit . I been starving myself. ig it’s better this way? At least I’m having healthy food, not like a few month ago I was having hot Cheetos as breakfast and then ice cream at night (it kept me fat) and now ig I’m loosing weight, my sister just told me my face looks a lot skinnier buuuut, what am I doing now would be considered has anorexia, if not, what? And what is actually considered anorexia? help help help",
          "created_utc": 1725514674.0
        },
        {
          "id": "llnbmol",
          "author": "shaeshayshae",
          "body": "Sorry that you’re going through all of this ;-; eating disorders can be really messy at times, I can relate to that. It’s always better to seek professional advice when it comes to diagnosis, I can’t diagnose you with anything. But I think you would be interested in reading about Anorexia b/p subtype, EDNOS or OSFED :]\nThe subreddit r/fuckeatingdisorders is a nice place for similar questions, as well. I hope you get more clarity on this. ",
          "created_utc": 1725552320.0
        }
      ]
    }
  ]
}