{
  "id": "1elq8pp",
  "subreddit": "EatingDisorders",
  "author": "jsnwdl",
  "created_utc": 1722971181.0,
  "title": "I’m constantly thinking about food and it’s kinda ruining my life",
  "selftext": "I never had an ed diagnose but I most definitely had something bad going on and for over a year now I’ve been trying to let go of my bad habits and negative thoughts. I notice how it keeps getting better but still I seem to keep on adding up what I eat in my head and stressing myself over eating too much in total or of a certain food group a day. I’m wondering if I‘ll ever be able to let go of these thoughts or if it’s just something I have to live with by now. I hope it’s not because it’s incredibly annoying if my thoughts are constantly circling around food. It’s like a love-hate relationship. Do you guys have any tips or experiences to share?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1elq8pp/im_constantly_thinking_about_food_and_its_kinda/",
  "score": 38,
  "num_comments": 10,
  "comments": [
    {
      "id": "lgvfufk",
      "author": "None",
      "body": "I’m sorry you’re feeling this way… I’m low-key used to dealing with this, so I believe I can help. I dare say realizing that something is off or that you’ve developed a habit that’s bringing you down is very important. Diagnosis or not. \n\nTry asking yourself why exactly you’re obsessing over this. What do you think will happen if you did eat \"too much\"? What’s \"too much\" for you? What’s scaring you? I’d start by doing this, because sometimes we’re scared of doing things but we might not have wondered why exactly that might be.\n\nYou don’t have to answer me, just ask yourself and ponder it. It’s a form of auto-analysis/self-reflection. I’d also look up intuitive eating. This what’s helped me the most. There’s even a book about it. It follows the principle of mindfulness. And also, mindfulness itself might help as well.\n\nAnd don’t ever hesitate to ask for help. There’s no shame in that! I do therapy (Psychoanalysis) once a week and I also see a nutritionist specialized in intuitive eating. IDK where you’re located, but apparently in some countries you’d go to a dietitian instead of a nutritionist. This isn’t the case where I live, though. So, that might vary. Either way, what I said stands… don’t hesitate to ask for help.\n\nYou got this!",
      "created_utc": 1722995408.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lgzzf1b",
      "author": "isaacsavalanchee",
      "body": "i’m going through the same thing. it’s in my head 24/7 the numbers the calories the ingredients the guilt and negativity. some days i don’t eat and some days i eat too much.   but i’m trying to reach out to a nutritionist or a therapist that specializes in ed’s or ed behaviors",
      "created_utc": 1723062960.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh0ho5r",
      "author": "OkManufacturer4226",
      "body": "omg! thank you for this post! it's exactly my life right now :(",
      "created_utc": 1723068805.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh0r2ul",
      "author": "floralhijabi",
      "body": "Described how I feel word for word. It’s so debilitating because you slowly start to lose track of time & do less of what actually matters :( i tried not counting calories thinking it would help, but now i just limit my carb intake instead. I hate this disorder so. Much.",
      "created_utc": 1723072079.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh34pnh",
      "author": "Brandyscloset9",
      "body": "I totally get it. It's like the food noise is always in my head telling me to eat, look in my frig, look in my food pantry etc. It's like a rollercoaster and sometimes it's so stressful. I did a lot of research in line because I need to stop always having food one if the biggest things I think about. Have u heard of Berberine? I started taking the Thorne brand and of course I am trying hard to have will power and it seems to have helped rid that annoying food noise that was always in my head. Aside from always thinking about food, I stopped drinking alcohol and beer.  I even lost 6 lbs in 3 months. I wish u so the best of luck. ❤️. I know how hard it is.",
      "created_utc": 1723113615.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lgzzg39",
      "author": "isaacsavalanchee",
      "body": "you got this you’re so strong",
      "created_utc": 1723062969.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh0jjk0",
      "author": "OkManufacturer4226",
      "body": "I can't handle with this at all. I used to have binge eating, now i don't do it in the most situations, but i constantly thinking about food like you, when i can eat, i'm hangry enough, i can think half of day can i eat this piece of cake or not. \n\ni'm so tired about this, i just want to back my normal food habits, when i didn't think at all about food, just eat what i wanted. \n\nwhy i can't do it right now? because have fear i gain weight. that's a reason. \n\ni had today my first therapy session after almost 2 years break, and this question is the most important right now. my therapist said i shouldn't get food like something bad, it's just a food, and i she said i should make a notes about what i eat and which thoughts i have at this moment.\n\ni've tried to do it all this day. i will do it until next therapy (in 2 weeks).\n\nMaybe it's help you, even if it's not help me.",
      "created_utc": 1723069449.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhcc9so",
      "author": "Bitter_Wing_999",
      "body": "I can tell you that while I'm not sure if it ever 100 percent goes away it can get better and become background noise at worst. there was a long time in my life where I couldn't imagine it. I hope it happens for you. I don't think it can be forced though - the more you try to take your mind off it the more it invades, that's the human brain unfortunately. but with time and some healing it can recede to where it's not suffocating anymore. maybe for some people it goes away entirely, I don't know. I hope so.",
      "created_utc": 1723239126.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhkp6ij",
      "author": "daisyrosy_posy",
      "body": "Same. Constantly thinking about food. It’s horrible",
      "created_utc": 1723376014.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lgwkc8e",
      "author": "jsnwdl",
      "body": "Thank you!!",
      "created_utc": 1723015363.0,
      "score": 2,
      "context": [
        {
          "id": "lgvfufk",
          "author": "None",
          "body": "I’m sorry you’re feeling this way… I’m low-key used to dealing with this, so I believe I can help. I dare say realizing that something is off or that you’ve developed a habit that’s bringing you down is very important. Diagnosis or not. \n\nTry asking yourself why exactly you’re obsessing over this. What do you think will happen if you did eat \"too much\"? What’s \"too much\" for you? What’s scaring you? I’d start by doing this, because sometimes we’re scared of doing things but we might not have wondered why exactly that might be.\n\nYou don’t have to answer me, just ask yourself and ponder it. It’s a form of auto-analysis/self-reflection. I’d also look up intuitive eating. This what’s helped me the most. There’s even a book about it. It follows the principle of mindfulness. And also, mindfulness itself might help as well.\n\nAnd don’t ever hesitate to ask for help. There’s no shame in that! I do therapy (Psychoanalysis) once a week and I also see a nutritionist specialized in intuitive eating. IDK where you’re located, but apparently in some countries you’d go to a dietitian instead of a nutritionist. This isn’t the case where I live, though. So, that might vary. Either way, what I said stands… don’t hesitate to ask for help.\n\nYou got this!",
          "created_utc": 1722995408.0
        }
      ]
    }
  ]
}