{
  "id": "1em5si8",
  "subreddit": "EatingDisorders",
  "author": "HailSneazer",
  "created_utc": 1723016264.0,
  "title": "2 years in recovery",
  "selftext": "2 years ago I on August 6th at 8:00pm I was in a typical psych ward bedroom. I was crying feeling like a complete failure. My eating disorder was out of control and I was very litterally dying. I cried myself to sleep that night feeling the task before me was unachievable. The dr told me I could leave when I had 100% on most meals and at the time  it felt like he might as well have told me to summit Everest. Today on August 6th I ate a fucking cake. It was great. I didn’t think about the calories. I didn’t calculate how much I’d eaten before that day. I just enjoyed eating food and being with my wife. For those new to recovery please be aware. This is a war. Your vice wants you dead. It will never stop trying to kill you. Never take your boot off its neck. Don’t give the disorder or addiction or whatever a single moment to breath. The moment you do your life is in danger. Fight well my friends. And for those whose tonight is day one I say this. Day one feels like forever, but it isn’t, the sun will rise on day two. The first step in taking back your life. Fight well my friends. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1em5si8/2_years_in_recovery/",
  "score": 36,
  "num_comments": 6,
  "comments": [
    {
      "id": "lh28lwh",
      "author": "a-nonna-nonna",
      "body": "Thank you for sharing. I needed to hear something good about life in recovery.",
      "created_utc": 1723093630.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lh2zipr",
      "author": "rekacsenpai",
      "body": "I'm so proud of you, you're doing great!",
      "created_utc": 1723110455.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh3tr4l",
      "author": "Minute_Drawer7777",
      "body": "I’m actually on the verge of tears right now, that was actually pretty powerful. Congratulations to you, and I hope everyone here can find the freedom they deserve as well ⛅️🤍\n\nKeep inspiring!!!",
      "created_utc": 1723124452.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lhyul85",
      "author": "Gulliblehoe12332",
      "body": "I'm so proud of your 2 years of recovery!!! All the best to you and the future 🩷🩷🩷 How did you work through your recovery? (If I'm allowed to ask)",
      "created_utc": 1723580934.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ljn2hru",
      "author": "Aaaaali786",
      "body": "So proud of you 🫂",
      "created_utc": 1724462762.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ljrzwci",
      "author": "HailSneazer",
      "body": "External motivation. The first day in inpatient I was encouraged by one of the nurses to write reasons why to recover on my program binder. I didn’t want to recover. I had zero internal motivation. But my girlfriend (now wife) told me we would have to break off if I didn’t seek recovery. I didn’t want to lose her.",
      "created_utc": 1724540814.0,
      "score": 1,
      "context": [
        {
          "id": "lhyul85",
          "author": "Gulliblehoe12332",
          "body": "I'm so proud of your 2 years of recovery!!! All the best to you and the future 🩷🩷🩷 How did you work through your recovery? (If I'm allowed to ask)",
          "created_utc": 1723580934.0
        }
      ]
    }
  ]
}