{
  "id": "1emk23x",
  "subreddit": "EatingDisorders",
  "author": "alrvq",
  "created_utc": 1723056795.0,
  "title": "are self diagnosed eds valid to you?",
  "selftext": "just curious ! ^^ ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1emk23x/are_self_diagnosed_eds_valid_to_you/",
  "score": 77,
  "num_comments": 68,
  "comments": [
    {
      "id": "lh2fpvp",
      "author": "DifficultyMurky5428",
      "body": "Yes, but you need to meet diagnostic criteria. Don't get wrong, the ICD-11 and DSM-5-TR are flawed. But when it comes to layman diagnosing themselves without knowledge to compelte a differential diagnosis, it's important to meet the criteria. I had an eating disorder long before I was assessed and diagnosed. I knew that it was probable, but I was in denial. For some, self-diagnosis is the first step to reaching out for support and beginning recovery. No one should rob you of that opportunity. That said, some people romanticize eating disorders or do not understand how severe they can be. This is where meeting diagnostic criteria comes in along with self-reflection. If you're having thoughts that you're faking it or not sick enough, it's unlikely that is the case. This is the nature of EDs.",
      "created_utc": 1723097661.0,
      "score": 128,
      "context": []
    },
    {
      "id": "lh1r327",
      "author": "starfluxx",
      "body": "Absolutely 10000%. Not everyone has the ability to see doctors or specialists and even if they are able to, they aren't always listened to.",
      "created_utc": 1723085546.0,
      "score": 126,
      "context": []
    },
    {
      "id": "lh27rit",
      "author": "Lameusername000",
      "body": "It really depends. Some people will claim they have an ED bc sometimes it can be romanticized (i.e. skipping a meal or binging once does not equal an ED). Others do have an ED and know the truth and how horrendously ugly it gets. I think it’s okay to say that one has experience ED behaviors and recognize patterns as they occur. I also this it’s important to recognize when you are experiencing symptoms. But claiming to have a medical issue without seeking help doesn’t do anything. Unfortunately, most people with EDs rarely seek help on their own and it will deteriorate their health. So if you think you have an eating disorder, and you’re willing to change, you should definitely seek help.",
      "created_utc": 1723093172.0,
      "score": 52,
      "context": []
    },
    {
      "id": "lh3ynlp",
      "author": "None",
      "body": "This is a great discussion. Humans love labels. \n\nIf you feel you’re having trouble coping with any part of eating or body image, you don’t need a formal diagnosis to seek help. \n\nBeing in touch with yourself and fairly, mindfully, assessing what your body and mind are going through is a crucial first step in recovery.",
      "created_utc": 1723126110.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lh293te",
      "author": "runninginbubbles",
      "body": "My opinion wouldn't really be based on whether the person 'self-diagnosed' or not, but what they say their symptoms are. Unpopular opinion incoming - **please remember that someone 'not being valid to me' doesn't mean they don't have an issue. Me 'not believing they have an ED' doesn't mean they DON'T. My opinion really doesn't matter. You don't have to think I am valid either!** \n\nA friend of mine used to talk about the time she had an (undiagnosed) ED when we were in high school. I don't call what she 'went through' an ED for various reasons I won't get into.\n\nI think a lot of people on tiktok/instagram etc claim to have EDs that don't - they have disordered eating or get a bit obsessed with diet/exercise. I don't think many of them have valid EDs. \n\nNowdays, many of the above people could get diagnosed if they went to their doctor and listed off the symptoms they've convinced themselves they have. For example, if you scroll tiktok, you can pretty much learn what you'd need to say to get diagnosed. \n\nI used to follow a number of girls who are diagnosed who also have personality disorders, I truly believed they exaggerated their ED symptoms as a way to seek attention (seeking attention isn't necessarily bad, it's a part of their illness/trauma response).\n\nI would absolutely accept someone's ED was valid if they weren't diagnosed. But these are psychiatric illnesses, they are dangerous, and life changing. It's not just something that comes and goes.",
      "created_utc": 1723093899.0,
      "score": 25,
      "context": []
    },
    {
      "id": "lh40gdd",
      "author": "lowkeyalchie",
      "body": "Yes, they are valid. Of course not everyone who does so will be correct, but that is the nature of any diagnosis. In my own experience, though, I've never met anyone who was not at least developing an ED. It may have been in the early stages, it may have stemmed from romanticization of EDs, but it was very much there. I also very much had an ED for years before getting diagnosed, even without being underweight.",
      "created_utc": 1723126705.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lh8py0o",
      "author": "halle-lu-jah",
      "body": "Yes mostly bc my psychiatrist said i didnt fit the criteria for anorexia bc i had not hit a bmi low enough. I was close but the rapid weight loss wasnt enough i guess",
      "created_utc": 1723189296.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lh4nxoz",
      "author": "elhazelenby",
      "body": "Suspicion is fine but not as much self diagnosis, there's a difference between the two and people get them confused.",
      "created_utc": 1723134051.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lh4ongl",
      "author": "610-Kat",
      "body": "My behavior and my thoughts are definitely disordered but since I'm not underweight I'm obviously faking it. The fact that I had brain fog, couldn't sleep at night due to stomach cramps, purging and all this stuff clearly mean nothing because I also have periods of time where I act normal (I binge during that \"normal\" period) so ya know, I know there's something off but I'm careful when I talk about it, I always specify that I'm not diagnosed. (i feel like maybe a diagnosis would led me to seek professional help but I'm terrified to hear \"no you're faking it\" so I guees I'm ok with self made recovery until my next breakdown and relapse) ",
      "created_utc": 1723134268.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lh51o3z",
      "author": "javacat122",
      "body": "I’m weary about self diagnosis because I see so many people wrongly diagnose themselves, but I definitely think you can successfully diagnose yourself in some cases. I get that not everyone has access to healthcare. A big thing with eds though is that they are very glamorized and portrayed unrealistically. I feel like a lot of people subconsciously feel like restrictive eds are something they wish they could have, and then they start noticing signs of an “Ed” in themselves using the confirmation bias. \n\nAlso, there’s a huge difference between disordered eating and an eating disorder. If you actually have struggled with an ed, you can easily spot people that are uneducated about the illness and may just have some disordered habits. You also have to meet diagnostic criteria in order to be diagnosed.\n\nI am kind of weird about diagnosis in general. In life, your goal should be to not have mental illness. In my opinion the only reason you should seek a diagnosis is if you are at a loss and can’t understand what is happening to you and need professional guidance. It shouldn’t just be this casual thing.",
      "created_utc": 1723138227.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lh52ot5",
      "author": "darlingyrdoinitwrong",
      "body": "if you've got one then you know it, plain & simple. they only get worse from the moment you're aware. you may not be willing to actually admit it to yourself even, not one hundred, but even the most ED-addled of minds is aware what they are doing is inherently abnormal. this does not in any way, shape or form, change the complexities of EDs, each intricately & intensely bizarre, alienating experiences, & the fact that once you've let your brain get into such a state of trickery it's next to impossible to discern reality from the other version of you that exists.      \nthat got a bit more wordy & incoherent than i meant, sorry about that, haha; just speaking from way too many years of experience with both ana/mia. i thankfully never had to worry about getting a diagnosis, as by the time i realized how sick i was (or rather, was willing to admit it), i was also getting involuntarily hospitalized in-patient ED unit, which was an experience in & of itself.",
      "created_utc": 1723138538.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lh5rmw7",
      "author": "pink_pixieee",
      "body": "Yes.. if you starve, binge or throw up after you eat out of guilt on a regular basis, there’s a 99.9% chance you have an eating disorder",
      "created_utc": 1723146087.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lhdd9o4",
      "author": "Fizzllip",
      "body": "I never was officially diagnosed with Bulimia Nervosa or BED but i know for a fact that i had the criteria met long before I could think to self-diagnose",
      "created_utc": 1723252898.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh24iyk",
      "author": "Blyxons",
      "body": "I mean this as nice as possible:  \n  \nSelf-Diagnosed? No. As I think self diagnosis when it comes to medical issues is dangerous.   \n  \nSelf-suspecting? Yes. You can absolutely suspect you have a disorder or medical condition, however you should seek medical advice as soon as you are able to because a diagnosis can offer pathways into therapy, treatment and correctly fitted aids if you require them. Also it may end up being that you don't have that condition at all and actually have something else. \n\nPlease note before I get downvoted, this is my personal opinion which OP asked for. If they believe in self diagnosis then they are absolutely valid to feel that way.",
      "created_utc": 1723091524.0,
      "score": 34,
      "context": []
    },
    {
      "id": "lh6wz1w",
      "author": "Remarkable-Profit821",
      "body": "Yes but I have a friend who tried to diagnose me and others, that wasn’t valid. Being concerned is fine but to tell someone what they have is fkn wrong.",
      "created_utc": 1723159464.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh6xb5y",
      "author": "tatumrileysgarage",
      "body": "yes, because the majority of people with eating disorders are very secretive about them to the point that very few of them would let their doctors or families find out. the secrecy in and of itself is a component of an eating disorder. in my experience it is very easy to tell whether someone is actually struggling or just flaunting their fake romanticized version of an eating disorder.",
      "created_utc": 1723159584.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh3nx0f",
      "author": "PenguinLot",
      "body": "Absolutely, early intervention is so important in ED recovery too! I used to work at a charity that was able to offer support and therapy to people who showed any signs of disordered eating behaviours/thoughts - diagnosis or not and people could self refer to the service without needing to see a clinician",
      "created_utc": 1723122324.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lh51bmw",
      "author": "Specific-Exam-5263",
      "body": "In my country (where medical care is of high standards and heavily subsidised and/or free) - no. \n\nIn other countries where care is lower quality and often ridiculously expensive to access - yeah.",
      "created_utc": 1723138124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh5ggws",
      "author": "monkey-marker04",
      "body": "Yes, but I do know a lot of kids in my school that go around telling everyone they have an eating disorder, when they don’t.",
      "created_utc": 1723142703.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh5uq69",
      "author": "sorryagirlhasnoname",
      "body": "im too scared to go to a doctor for it in fear that everyone around me will find out. so im not doctor diagnosed, but im pretty sure i have one",
      "created_utc": 1723147004.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh6bu6x",
      "author": "None",
      "body": "Depends. I understand that a lot of people can't get a diagnosis for many reasons, like not having access to healthcare, carers who refuse to get them help, fear of being judged, etc. It's valid if you have a reason as to why you can't get a diagnosis. But I don't appreciate people who will use illnesses that people struggle with for attention, personal gain, etc. I feel like it's getting more and more common where you can find people who have found themselves in a rabbit hole surrounding a certain disorder, picked up traits from said disorder, and convinced themselves they have it. I'm not saying that isn't totally valid because them people do probably have something wrong with them. If they're convincing themselves, they have a disorder, or they knowingly say they have it for attention. It's not normal to feel like you have to have something wrong with you in order to get attention, and I think it's something that we should aim to help people with, but it still doesn't make a self-dignosis valid. It's a lot more complex, but that's basically my surface view of it.",
      "created_utc": 1723152184.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh6j0te",
      "author": "NorthLight2103",
      "body": "Yes. I myself have not had the opportunity to get diagnosed or help by a doctor, but I know that I have very disordered thinking and I know that what I have is anorexia.",
      "created_utc": 1723154548.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh6ngx9",
      "author": "Imcrazybutimfree1",
      "body": "No",
      "created_utc": 1723156091.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh8a1x7",
      "author": "_szasza",
      "body": "of course, most ppl never get diagnosed ",
      "created_utc": 1723179722.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh8ny9s",
      "author": "laurelhellll",
      "body": "i think eating disorders make the most sense to self diagnose out of a lot of mental illnesses! theyre definitely valid and i think the “needing to be diagnosed to be sick” is ridiculous",
      "created_utc": 1723187994.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lhb3df6",
      "author": "chocolatecoveredcats",
      "body": "Yes. Its so expensive and it takes a long time to get diagnosed. I feel like eds are one of those disorders That’s easier to identify yourself.",
      "created_utc": 1723224759.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lhbdsqx",
      "author": "vateijo",
      "body": "It's hard to hide an eating disorder, so yes, when you feel you have it, there is a high chance you really have it",
      "created_utc": 1723227995.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lhbnnj8",
      "author": "beans1694",
      "body": "I've been in therapy for it since I was 19 but wasn't formally diagnosed by a medical provider until I was 25. I've been struggling since I was 11. \n\nJust like I've had ADHD my whole life, but wasn't diagnosed until I was 26. \n\nSo yeah, if you meet the criteria and it's taking over your life, then yes it's absolutely valid to self diagnose/seek help. I wasn't believed because I wasn't under weight even though my hair was literally falling out and my blood work was abysmal. \n\nGetting a doctor to believe you is a fight. If you know you know.",
      "created_utc": 1723231125.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llfjtqs",
      "author": "Giraffewhiskers_23",
      "body": "I don’t trust telling my parents because when I was 12 I suspected I had depression and anxiety, when I was 15 I was actually diagnosed with mdd and gad, but ednos is the confusing part.. I was told I had ednos but my mom told me I was actually diagnosed with munchausen syndrome.. so for me it’s hard to feel safe to even ask a friend to take me somewhere and get tested or examined for that even with insurance, and IM 21 YEARS OLD!",
      "created_utc": 1725433662.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh3ncd5",
      "author": "silasylv",
      "body": "id say its completely valid with eds. disordered people are treated HORRIBLY, there are so many stereotypes and dumb assumptions. for example, an obese person could lose half their body weight and NO ONE would diagnose them with ana because they dont meet the bmi requirements. same with men, whose eds are never taken seriously. also seeing professionals costs a lot and they often have insane waiting times, so not everyone can get an official diagnosis that easily. theres also the fact that the second people find out about your ed, chances are, you’ll get forced into recovery. so people can easily lie about these things even to professionals. i got hospitalized a while ago and NO ONE thought i had an ed. ive been a foodie my whole life so i was a pretty good liar when it came down to it. so they were investigating all these medical things that could possibly cause weight loss. i only have a diagnosis rn because i got tired of lying and came clean afterwards.",
      "created_utc": 1723122107.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh3wih4",
      "author": "jarofonions",
      "body": "It depends? In theory, yes. In practice... i think a lot of people irl don't understand the extent of eds and how torturous they are, so they truly think they have one.. but it's just disordered thoughts, or a behavior here and there sometimes, etc. \n\nYesterday i saw a post by a guy i don't know on fb (but we have mutuals and i like his music) where he said he had an ed. then he described what sounded like some extreme contamination ocd (which, fair, huge overlap) and possible arfid, but then continued on to say he had anorexia, like multiple times. \n\nI also have heard people say they've had eating disorders before, but then when asked about it it's like \"oh I threw up twice in high school and it freaked me out so i just stopped\" \n\nBut generally- yes i believe it until i have evidence otherwise",
      "created_utc": 1723125392.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lh40r6o",
      "author": "Lou-eez-",
      "body": "Yup. I've had an ed for 5 years. Never been to therapy, never told any medical professionals about it at all, but I know. I think maybe swlf diagnosing a specific ed could get a bit iffy, but for me, I just say I have an ED. I used to think I had AN, but now I just say ED. Either way, it's hell to go through and a valid struggle with or without a diagnosis",
      "created_utc": 1723126803.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh55p3f",
      "author": "Sethm28",
      "body": "I self diagnosed I never really looked much into eds but if I hadn’t of recovered I would of killed myself either through the actual eating disorders or through hating my body so much I think that counts enough to allow me to self diagnose, not everyone’s capable of seeking a diagnosis like me I couldn’t stand the thought of someone questioning me about it only a few people know and I’ve never gone into detail about it",
      "created_utc": 1723139443.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh3a961",
      "author": "Efficient-Ad4245",
      "body": "10000%. i’ve never been officially diagnosed but i 100% know im eating disordered. i just did everything i could not to get caught because the cfnsiquenses of getting caught scared me too much.",
      "created_utc": 1723116508.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh3pgl9",
      "author": "United_Top824",
      "body": "I’ve never been diagnosed but I’m like 99% I have ARFID because I meet the criteria to a tee. I’m hesitant to call myself “self diagnosed” but I suspect if I went and got diagnosed that’s what it would be.",
      "created_utc": 1723122904.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lh4rukj",
      "author": "ebonylita",
      "body": "id say yes considering the fact most disordered people are young (so like young women, young men, teens) because of that alone, it affects the chances of the person getting diagnosed as they already probably are going through their ed in secrecy to begin with due to their age and other factors",
      "created_utc": 1723135250.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh4xpc5",
      "author": "meltedbeans23",
      "body": "I mean, obviously. People who self diagnose EDs for attention and internally know they genuinely dont have it, they dont matter really. They are desperate and clearly thats a sign of a separate issue. \n\nBut these mental issue terms are just labels to help guide us to self improvement. Self diagnosing yourself doesn’t hurt a single soul in the world. I mean clearly if one where to think theres an issue- theres most likely an issue?",
      "created_utc": 1723137029.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh5epri",
      "author": "p3rf3ctw3ight",
      "body": "Yes since ed's are able to be self diagnosed",
      "created_utc": 1723142175.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh22lk6",
      "author": "GoddessBee-",
      "body": "100%",
      "created_utc": 1723090579.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh2j8iv",
      "author": "None",
      "body": "Yes",
      "created_utc": 1723099831.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lh1t5su",
      "author": "MoulinSarah",
      "body": "YES",
      "created_utc": 1723086398.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh8nz9h",
      "author": "kiwisstuff",
      "body": "i think for a person to truthfully think they have an eating disorder, there has to be something wrong in their eating habits",
      "created_utc": 1723188012.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh9wpb3",
      "author": "ratxowar",
      "body": "Yes",
      "created_utc": 1723211261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhb4wzp",
      "author": "FiggyMint",
      "body": "Unequivocally yes. Though I am autistic, self diagnosed, and I think self-diagnosis in general is valid. Especially when you consider the state of the medical industry in America. No insurance, insurance won't cover, practitioners being undercut by insurance, lack of opportunities for medical workers, corporatized hospitals, traveling practitioners, mergers and acquisitions causing hospitals and networks to remove vital resources from under served communities. The list of problems is so long and continues to grow.\n\nI'm a trans woman. I previously lived as a male. Let me tell you. Whenever I brought up my weight to a healthcare professional they not only blew me off. They tended to start idolizing my body. The sheer creepiness of the last time has made it very hard for me to ever feel comfortable addressing it with another medical professional. Like the doctor was looking at me like I was some delicious treat as he was giving me a physical. When I mentioned my weight and my bmi All he had to say was a bunch of you invalidating stuff like I should be happy. At the time I was 6'1 and weighed about 122 lb. \n\nIt took me so long to recognize that I do in fact struggle with anorexia due to How the media has portrayed Anorexia over the years. I have never wanted to be skinny. I've tried very hard throughout my life to gain weight and was unaware of how my eating habits are tied to negative self-talk until a couple years ago. As I've started to learn about anorexia, I was shocked to find that I was in fact anorexic. Anorexia has most commonly been portrayed as something that is done due to body dysmorphia. That alone always made me look for other explanations.",
      "created_utc": 1723225241.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhfvfqo",
      "author": "vodkawaterbox",
      "body": "Yes! So many people go under diagnosed. When I was younger and my mom brought me to see someone out of concern, the doctors response was \"Asian people are usually small\", which is ridiculous because it is at a total disregard for the patients and family feelings as they are the ones who see it. It is also an area where not a lot of professionals have knowledge in. Certainly, you must be able to meet the dsm criteria. But this can be hard for many like myself who always refused to acknowledge I had an eating disorder and pushed it to the back of my mind all the time while it controlled me, only letting it get worse. Knowing the warning signs is very important!",
      "created_utc": 1723300085.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhgi1lc",
      "author": "Mindless-Storage6717",
      "body": "i think EDs, to me, are the only valid form of self diagnosis",
      "created_utc": 1723307940.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhhg2yo",
      "author": "r-1203",
      "body": "I think it depends. My group of friends sometimes poke fun at my ED (just jokes, I joke about it too and I find it funny) and there was a time where it was brought up. Had a girl say “I had an ED once, I was sick and didn’t eat much for a whole week!” Or how sometimes how she only has an iced coffee for breakfast. Not eating because you’re sick doesn’t make you have an eating disorder. Not eating breakfast every once in a while does not make you have an eating disorder.\n\n I was never officially diagnosed with an ED, and I don’t think I ever wanted to be if I’m being honest. It started as a summer diet, I was away from home and wanted to lose weight before school started back up. Went from a size 8 to a size 4 in about a month. Dropped my caloric intake from 1200 to 800 to 500 to nothing. Overexercised, under-ate, BMI was too low, but I was never diagnosed so people never took it seriously. My parents were mad rather than supportive or helpful with my issues. Yelled at me, belittled me, etc. And I knew I had a problem but because I was never diagnosed, I didn’t feel sick enough. \n\nSelf diagnosis can be as real as a professional one, it’s just a matter of circumstance.",
      "created_utc": 1723319718.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhowwz0",
      "author": "Spiritual-Average210",
      "body": "Yes and so are wannarexics bcs no non disordered person says \"I want to starve myself\"",
      "created_utc": 1723432830.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lhr823j",
      "author": "Compulsive_Panda",
      "body": "Yes, doctors are crap with mental health issues.",
      "created_utc": 1723475477.0,
      "score": 1,
      "context": []
    },
    {
      "id": "li17ue3",
      "author": "Notronnie1312",
      "body": "That’s like asking if you can be a self diagnosed drug addict",
      "created_utc": 1723616154.0,
      "score": 1,
      "context": []
    },
    {
      "id": "li1fqt3",
      "author": "NothingComfortable27",
      "body": "I think it depends. Those who have done research, taken time to understand the disorder and believe it fits is one thing. Walking around acting like you have an ED because you want attention then nah gtfo. Getting some form of confirmation from mental health professionals is also key.\n\nI've struggled my entire life stuck being \"self-diagnosed\" but not in a case of \"Oh I think I have this so imma say I do\" but in the sense that I've had a lot of mental health professionals I've met since the age of 13 (now 27) has told me outright \"I have an undiagnosed eating disorder\" but no one would diagnosis officially. A couple years ago i even got in with the Eating Disorder team but after two meetings I bailed not because I didn't want help but because while a low weight I was technically a healthy weight so she didn't want to take me seriously. (I was prewarned of this fact by my CPN). The Ed women came to my home for literally 5 minutes and told me I needed to eat 3 meals a day plus 2 snacks. She told me to think of her as my cheerleader only and write in this food diary. Then she left and said she'll see me in a few weeks. I was suffering from Anorexia Nervosa, both with purging and restricting,  Body Dysmorphia and potentially ARFID. I had had an extreme fear of weight gain my entire life and couldn't handle people knowing I was eating. A food diary was the worst thing possible for me. It made me more restrictive. Not to mention I'd only just got out of a Psychiatric Unit. Oh and I have sensory issues which also makes eating harder but she didn't care so why should I you know. \n\nSo yeah I guess the answer to your question lies in the how they came to claim a self diagnosis.",
      "created_utc": 1723620913.0,
      "score": 1,
      "context": []
    },
    {
      "id": "li39jov",
      "author": "Artistic_Local_1785",
      "body": "Depends on the situation and who I am talking to. There are people out there who ARE merely just skipping one meal once in their lifetime and calling it an eating disorder, so people that do that, absolutely not. But there are certain situations where someone is unable to get a diagnosis and is self aware of their situation, I think this is actually healthy in the long run, even if you are doubting your intuition. There are days as someone diagnosed that I doubt it myself.",
      "created_utc": 1723650582.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lh39fau",
      "author": "WarlordMeowMeow",
      "body": "\nYes, but I think treatment should be done with a professional because it's a mental illness, so you need professional help.\n\nImo for eating disorders in particular, if you're worrying and stressing about it each day to the point that you think you have a disorder, then clearly food has some unhealthy hold on your life and its best to address with a professional in the early stages. You don't have to be a 10 year bulimic or severe anorexic for that to be valid. That's just the untreated later stages.\n\nIts a technicality with the term, really. (You're not a professional, so you can't professionally diagnose), but I was hard core bulimic for many many years, and me never seeing a doctor didn't suddenly make the bulimia untrue or go away 😅",
      "created_utc": 1723116103.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lh3wzct",
      "author": "jarofonions",
      "body": "Ah, you put it much better than what i attempted to say lol",
      "created_utc": 1723125550.0,
      "score": 15,
      "context": [
        {
          "id": "lh2fpvp",
          "author": "DifficultyMurky5428",
          "body": "Yes, but you need to meet diagnostic criteria. Don't get wrong, the ICD-11 and DSM-5-TR are flawed. But when it comes to layman diagnosing themselves without knowledge to compelte a differential diagnosis, it's important to meet the criteria. I had an eating disorder long before I was assessed and diagnosed. I knew that it was probable, but I was in denial. For some, self-diagnosis is the first step to reaching out for support and beginning recovery. No one should rob you of that opportunity. That said, some people romanticize eating disorders or do not understand how severe they can be. This is where meeting diagnostic criteria comes in along with self-reflection. If you're having thoughts that you're faking it or not sick enough, it's unlikely that is the case. This is the nature of EDs.",
          "created_utc": 1723097661.0
        }
      ]
    },
    {
      "id": "lh30osc",
      "author": "None",
      "body": "I don't know. I always had some insight into my struggles but I didn't meet weight criteria until much later. Arguably, my mental health just declined drastically over the years throughout my adolescence. It just steadily gets worse. So I don't know if I predicted that, like some weird premonition or something, but surely, I have only gotten worse. I could also just be a late bloomer. \n\nI was always purging so it's kind of hard to deny that behaviour to yourself....but I was just so sweet and so caring as a kid. I was really depressed also, but I had a lot of innocence :) It's not that I don't have it anymore, but over time, I literally had to stop caring just because of how painful it was to keep living in my reality that I was still purging X years later and could not stop nor get any help for it. You have to survive eventually and so I shifted completely. My brain also started derailing at that time also, so I lost awareness and insight and started denying more, not just to others, but to myself as well. And honestly, that was something I had to do because I could not allow myself to be disappointed and depressed any more. There was just no point anymore. Like you have to survive eventually and find your own resilience. Denial after many years is the only way to go about this. It just turns on eventually. For some, it's more immediate than others, I think. Mine was definitely more delayed even though there's always some degree of dissociation involved regardless.\n\nSo it's not always that simple. I feel like for me, it was a steady progression mentally/ neurologically. I don't believe that anything could've lessened the psychological risk for me, ever, once that manifested. But if anything, my descent was delayed. It just means that when it hit fully, it was like really intense out of nowhere. A lot of people were like \"i don't understand what happened.\" and I was like \"I understand completely. I have been waiting for this moment my entire life.\" lol. Some things are just meant to happen. I think I absolutely put up a good fight though. But some things are impossible to combat without extensive care and support. It's just hard to identify what that is until there's an actual problem to treat that doesn't just involve dietetics and talk therapy, you know? I hope that makes sense. It must be hard though, watching a population of young people online just fail to thrive even after many years. It doesn't really always make much sense. I mean, I feel like it makes perfect sense and I have to bring it back to the neuroimaging piece because there was structural evidence of my suffering and so that was like a relief because there's actual treatment for that. The difference is night and day. It can't solve every compulsion, but it helped tremendously. I definitely feel more able now, to the point where dietetics and talk therapy sounds like it has the potential to be promising.",
      "created_utc": 1723111189.0,
      "score": 1,
      "context": [
        {
          "id": "lh2fpvp",
          "author": "DifficultyMurky5428",
          "body": "Yes, but you need to meet diagnostic criteria. Don't get wrong, the ICD-11 and DSM-5-TR are flawed. But when it comes to layman diagnosing themselves without knowledge to compelte a differential diagnosis, it's important to meet the criteria. I had an eating disorder long before I was assessed and diagnosed. I knew that it was probable, but I was in denial. For some, self-diagnosis is the first step to reaching out for support and beginning recovery. No one should rob you of that opportunity. That said, some people romanticize eating disorders or do not understand how severe they can be. This is where meeting diagnostic criteria comes in along with self-reflection. If you're having thoughts that you're faking it or not sick enough, it's unlikely that is the case. This is the nature of EDs.",
          "created_utc": 1723097661.0
        }
      ]
    },
    {
      "id": "lh20ulw",
      "author": "alrvq",
      "body": "thank you😭 i was just wondering because i dont have access to a doctor or anything like that!",
      "created_utc": 1723089764.0,
      "score": 21,
      "context": [
        {
          "id": "lh1r327",
          "author": "starfluxx",
          "body": "Absolutely 10000%. Not everyone has the ability to see doctors or specialists and even if they are able to, they aren't always listened to.",
          "created_utc": 1723085546.0
        }
      ]
    },
    {
      "id": "lh3z18x",
      "author": "paperpaperclip",
      "body": "God, this times a million. Well said.",
      "created_utc": 1723126235.0,
      "score": 5,
      "context": [
        {
          "id": "lh1r327",
          "author": "starfluxx",
          "body": "Absolutely 10000%. Not everyone has the ability to see doctors or specialists and even if they are able to, they aren't always listened to.",
          "created_utc": 1723085546.0
        }
      ]
    },
    {
      "id": "lhb5ven",
      "author": "FiggyMint",
      "body": "I'm so very grateful that you responded with this. I am so out of touch with my body and have just started working on mindfulness. My work has not been related to my eating disorder and I honestly would not have considered how important it is for me to incorporate mindfulness.",
      "created_utc": 1723225535.0,
      "score": 2,
      "context": [
        {
          "id": "lh3ynlp",
          "author": "None",
          "body": "This is a great discussion. Humans love labels. \n\nIf you feel you’re having trouble coping with any part of eating or body image, you don’t need a formal diagnosis to seek help. \n\nBeing in touch with yourself and fairly, mindfully, assessing what your body and mind are going through is a crucial first step in recovery.",
          "created_utc": 1723126110.0
        }
      ]
    },
    {
      "id": "lh71ktr",
      "author": "Enhanced_by_science",
      "body": "Yes! The point that you made about seeking a specific diagnosis having value mainly in identifying symptoms and appropriate treatment is the key here. I agree that having a mental illness, a specific diagnosis, etc. for any reason except to seek guidance in how to recover is problematic, i.e. personality disorders or attention -seeking behavior. \n\nI know that I still avoid referring to myself as having an ED basically ever, except with medical professionals.",
      "created_utc": 1723161142.0,
      "score": 4,
      "context": [
        {
          "id": "lh51o3z",
          "author": "javacat122",
          "body": "I’m weary about self diagnosis because I see so many people wrongly diagnose themselves, but I definitely think you can successfully diagnose yourself in some cases. I get that not everyone has access to healthcare. A big thing with eds though is that they are very glamorized and portrayed unrealistically. I feel like a lot of people subconsciously feel like restrictive eds are something they wish they could have, and then they start noticing signs of an “Ed” in themselves using the confirmation bias. \n\nAlso, there’s a huge difference between disordered eating and an eating disorder. If you actually have struggled with an ed, you can easily spot people that are uneducated about the illness and may just have some disordered habits. You also have to meet diagnostic criteria in order to be diagnosed.\n\nI am kind of weird about diagnosis in general. In life, your goal should be to not have mental illness. In my opinion the only reason you should seek a diagnosis is if you are at a loss and can’t understand what is happening to you and need professional guidance. It shouldn’t just be this casual thing.",
          "created_utc": 1723138227.0
        }
      ]
    },
    {
      "id": "lhr9f56",
      "author": "Compulsive_Panda",
      "body": "Also \"safe foods\", guilt, punishments like over exercising or have super restictive days. Mostly guilt. Lots of guilt.",
      "created_utc": 1723475927.0,
      "score": 2,
      "context": [
        {
          "id": "lh5rmw7",
          "author": "pink_pixieee",
          "body": "Yes.. if you starve, binge or throw up after you eat out of guilt on a regular basis, there’s a 99.9% chance you have an eating disorder",
          "created_utc": 1723146087.0
        }
      ]
    },
    {
      "id": "lh3wj83",
      "author": "No-Event4806",
      "body": "You phrased this perfectly! I think a lot of people have inklings something may be up and likely are correct when they wonder if they have an ED, but you should confirm with a medical professional for an official diagnosis (obviously there’s a little grey area if you can’t afford treatment, fatphobia, etc)",
      "created_utc": 1723125399.0,
      "score": 6,
      "context": [
        {
          "id": "lh24iyk",
          "author": "Blyxons",
          "body": "I mean this as nice as possible:  \n  \nSelf-Diagnosed? No. As I think self diagnosis when it comes to medical issues is dangerous.   \n  \nSelf-suspecting? Yes. You can absolutely suspect you have a disorder or medical condition, however you should seek medical advice as soon as you are able to because a diagnosis can offer pathways into therapy, treatment and correctly fitted aids if you require them. Also it may end up being that you don't have that condition at all and actually have something else. \n\nPlease note before I get downvoted, this is my personal opinion which OP asked for. If they believe in self diagnosis then they are absolutely valid to feel that way.",
          "created_utc": 1723091524.0
        }
      ]
    },
    {
      "id": "lh2rv3e",
      "author": "scitaris",
      "body": "I understand why and I agree for a lot of medical conditions but with EDs it's a bit different from my POV. I think a lot of peoples have EDs and are very aware they do but it's very easy to cover up if you don't want to get treated. For example, my doctors were very concerned about my low BMI to the point where they made all kinds of checks but because EDs are not associated with men, I was never seriously assessed for that. Besides \"Do you eat regularily?\" which you can just lie about.That's a problem with a lot of psychological diagnosis - you can just lie to your therapist.",
      "created_utc": 1723105424.0,
      "score": 15,
      "context": [
        {
          "id": "lh24iyk",
          "author": "Blyxons",
          "body": "I mean this as nice as possible:  \n  \nSelf-Diagnosed? No. As I think self diagnosis when it comes to medical issues is dangerous.   \n  \nSelf-suspecting? Yes. You can absolutely suspect you have a disorder or medical condition, however you should seek medical advice as soon as you are able to because a diagnosis can offer pathways into therapy, treatment and correctly fitted aids if you require them. Also it may end up being that you don't have that condition at all and actually have something else. \n\nPlease note before I get downvoted, this is my personal opinion which OP asked for. If they believe in self diagnosis then they are absolutely valid to feel that way.",
          "created_utc": 1723091524.0
        }
      ]
    },
    {
      "id": "lhr9xsr",
      "author": "Compulsive_Panda",
      "body": "It's \"free\" where I live, but there are still a lot of nuances to it. Like a lot of people with an ED would hide it from their family and friends so going to a doctor is difficult. There's also the fact that doctors are generally crap when it comes to mental health, woth EDs they often won't even diganose you until you're dangerously underweight by which time the disorder will have a much worse grip.",
      "created_utc": 1723476098.0,
      "score": 1,
      "context": [
        {
          "id": "lh51bmw",
          "author": "Specific-Exam-5263",
          "body": "In my country (where medical care is of high standards and heavily subsidised and/or free) - no. \n\nIn other countries where care is lower quality and often ridiculously expensive to access - yeah.",
          "created_utc": 1723138124.0
        }
      ]
    },
    {
      "id": "lh62uv6",
      "author": "alrvq",
      "body": "i know a lot of kids my age that do that too , it makes me mad honestly",
      "created_utc": 1723149441.0,
      "score": 3,
      "context": [
        {
          "id": "lh5ggws",
          "author": "monkey-marker04",
          "body": "Yes, but I do know a lot of kids in my school that go around telling everyone they have an eating disorder, when they don’t.",
          "created_utc": 1723142703.0
        }
      ]
    },
    {
      "id": "lh3a4ss",
      "author": "WarlordMeowMeow",
      "body": "There's a lot of free videos by professionals on YouTube and some charities if you're wanting help and can't afford to see someone.",
      "created_utc": 1723116450.0,
      "score": 3,
      "context": [
        {
          "id": "lh39fau",
          "author": "WarlordMeowMeow",
          "body": "\nYes, but I think treatment should be done with a professional because it's a mental illness, so you need professional help.\n\nImo for eating disorders in particular, if you're worrying and stressing about it each day to the point that you think you have a disorder, then clearly food has some unhealthy hold on your life and its best to address with a professional in the early stages. You don't have to be a 10 year bulimic or severe anorexic for that to be valid. That's just the untreated later stages.\n\nIts a technicality with the term, really. (You're not a professional, so you can't professionally diagnose), but I was hard core bulimic for many many years, and me never seeing a doctor didn't suddenly make the bulimia untrue or go away 😅",
          "created_utc": 1723116103.0
        }
      ]
    },
    {
      "id": "lhb9787",
      "author": "FiggyMint",
      "body": "I personally think it's worth considering that it might be due to ignorance. I personally have been on a 2-year mental health journey and it wasn't until 3 days ago that I finally was exposed to the notion that a diagnosis should only be sought after if the underlying issue is causing the person's quality of life to be decreased. I'm 41 and somehow I had never been exposed to that concept until reading a book. It's mind boggling.\n\nI don't know if it's my neurodivergence, but it has been incredibly hard for me to wrap my head around that concept and parse through what issues I've been addressing that I apparently shouldn't be focusing on since they aren't reducing my quality of life in any way, shape, or form. I have gotten so much from learning about myself. The validation has allowed me to accept myself and my limitations which has added to my quality of life. I didn't know my quality of life was being dismissed because everything was hidden from myself. I didn't know I was suffering since I conditioned myself to tune it out. I guess I just need to think about it more.\n\n Thanks for your response it is good food for thought.",
      "created_utc": 1723226564.0,
      "score": 2,
      "context": [
        {
          "id": "lh51o3z",
          "author": "javacat122",
          "body": "I’m weary about self diagnosis because I see so many people wrongly diagnose themselves, but I definitely think you can successfully diagnose yourself in some cases. I get that not everyone has access to healthcare. A big thing with eds though is that they are very glamorized and portrayed unrealistically. I feel like a lot of people subconsciously feel like restrictive eds are something they wish they could have, and then they start noticing signs of an “Ed” in themselves using the confirmation bias. \n\nAlso, there’s a huge difference between disordered eating and an eating disorder. If you actually have struggled with an ed, you can easily spot people that are uneducated about the illness and may just have some disordered habits. You also have to meet diagnostic criteria in order to be diagnosed.\n\nI am kind of weird about diagnosis in general. In life, your goal should be to not have mental illness. In my opinion the only reason you should seek a diagnosis is if you are at a loss and can’t understand what is happening to you and need professional guidance. It shouldn’t just be this casual thing.",
          "created_utc": 1723138227.0
        },
        {
          "id": "lh71ktr",
          "author": "Enhanced_by_science",
          "body": "Yes! The point that you made about seeking a specific diagnosis having value mainly in identifying symptoms and appropriate treatment is the key here. I agree that having a mental illness, a specific diagnosis, etc. for any reason except to seek guidance in how to recover is problematic, i.e. personality disorders or attention -seeking behavior. \n\nI know that I still avoid referring to myself as having an ED basically ever, except with medical professionals.",
          "created_utc": 1723161142.0
        }
      ]
    },
    {
      "id": "lh9u9me",
      "author": "Beea282",
      "body": "I agree. Which is why in the diagnosis process to it’s important to have the perspective of the patients family and friends. I understand that a lot of professionals don’t do this but it’s extremely important to have a broader perspective.  Also important is for the psychiatrist, psychologist and the nutritionist (if Ed) to talk to each other during the process. It makes it a lot easier to debate and close a diagnosis. \n\nSource: me. I’m a psychology student and a patient that has gone through the process above.",
      "created_utc": 1723210390.0,
      "score": 1,
      "context": [
        {
          "id": "lh24iyk",
          "author": "Blyxons",
          "body": "I mean this as nice as possible:  \n  \nSelf-Diagnosed? No. As I think self diagnosis when it comes to medical issues is dangerous.   \n  \nSelf-suspecting? Yes. You can absolutely suspect you have a disorder or medical condition, however you should seek medical advice as soon as you are able to because a diagnosis can offer pathways into therapy, treatment and correctly fitted aids if you require them. Also it may end up being that you don't have that condition at all and actually have something else. \n\nPlease note before I get downvoted, this is my personal opinion which OP asked for. If they believe in self diagnosis then they are absolutely valid to feel that way.",
          "created_utc": 1723091524.0
        },
        {
          "id": "lh2rv3e",
          "author": "scitaris",
          "body": "I understand why and I agree for a lot of medical conditions but with EDs it's a bit different from my POV. I think a lot of peoples have EDs and are very aware they do but it's very easy to cover up if you don't want to get treated. For example, my doctors were very concerned about my low BMI to the point where they made all kinds of checks but because EDs are not associated with men, I was never seriously assessed for that. Besides \"Do you eat regularily?\" which you can just lie about.That's a problem with a lot of psychological diagnosis - you can just lie to your therapist.",
          "created_utc": 1723105424.0
        }
      ]
    },
    {
      "id": "lhscs5j",
      "author": "Specific-Exam-5263",
      "body": "I do believe doctors being “generally crap when it comes to mental health” falls under “where care is lower quality”😊\n \nSomeone here put it as self-suspecting is absolutely fine but self-diagnosing we need to be really careful with, which I thought was really great. I really feel for people that are struggling with disordered eating but can’t access good medical care for it, but watering out the diagnoses by self-diagnosing I really think will do more harm than good on a structural level.",
      "created_utc": 1723488273.0,
      "score": 0,
      "context": [
        {
          "id": "lh51bmw",
          "author": "Specific-Exam-5263",
          "body": "In my country (where medical care is of high standards and heavily subsidised and/or free) - no. \n\nIn other countries where care is lower quality and often ridiculously expensive to access - yeah.",
          "created_utc": 1723138124.0
        },
        {
          "id": "lhr9xsr",
          "author": "Compulsive_Panda",
          "body": "It's \"free\" where I live, but there are still a lot of nuances to it. Like a lot of people with an ED would hide it from their family and friends so going to a doctor is difficult. There's also the fact that doctors are generally crap when it comes to mental health, woth EDs they often won't even diganose you until you're dangerously underweight by which time the disorder will have a much worse grip.",
          "created_utc": 1723476098.0
        }
      ]
    }
  ]
}