{
  "id": "1etnp7w",
  "subreddit": "EatingDisorders",
  "author": "clarewilliamss",
  "created_utc": 1723811921.0,
  "title": "Eating disorder treatment as a plus size person",
  "selftext": "I recently started a partial hospitalization program for my eating disorder. This is the first time I’ve ever had treatment for my eating disorder although it’s been there since I was around 8 years old and I’m 24 now. Everyone in this program is smaller than me and that can be so triggering, difficult and very much so makes me feel invalid in my eating disorder. It’s been really hard to not compare myself to others and to accept that the goal of recovery does not include losing weight and in fact may cause me to gain wait as an already “obese” person. I was wondering what anyone’s experience or advice is for someone in eating disorder treatment and trying to recover as a plus size person? Any advice, words of encouragement or suggestions are greatly appreciated!🫶🏼",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1etnp7w/eating_disorder_treatment_as_a_plus_size_person/",
  "score": 60,
  "num_comments": 32,
  "comments": [
    {
      "id": "lih0gvp",
      "author": "Comfortable_Sir8185",
      "body": "I literally was the next to largest person when I went to residential, and at first I didn’t feel “worthy” of help because of my size. While I knew I was super sick and desperately needed help, I had this panging feeling in me. One night I expressed this to my favorite therapist at the treatment center, I was bawling and crying on this conflict. She told me point blank that the doctors who evaluated me clearly believed I needed residential  treatment, or I wouldn’t be there. She stayed there with me during my whole breakdown, embracing my pain that I had on this very topic. That really changed my perspective on my “worthiness” with needing treatment. ED treatment doesn’t have a size requirement, it’s for anyone who needs it. I am sending love and light to you and would really encourage you to express this fear to your treatment team. I think you’ll be surprised to see how encouraging they’ll be.",
      "created_utc": 1723843911.0,
      "score": 49,
      "context": []
    },
    {
      "id": "likomaz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1723907429.0,
      "score": 12,
      "context": []
    },
    {
      "id": "lih589r",
      "author": "Ascendead_Teru",
      "body": "Im currently in a residential as a plus-sized person. I keep telling myself my insurance deemed me \"sick\" enough that I need treatment. If insurance thought you were fine, they would deny the claim. Sometimes that helps me remember that Im where I need to be.  \nBut I do agree, man can it be triggering to be the only plus-sized person in treatment.  I hope my little bit helped. Keep going <3",
      "created_utc": 1723845583.0,
      "score": 27,
      "context": []
    },
    {
      "id": "likza5s",
      "author": "failing__yogurt",
      "body": "Going through this right now too. I definitely feel like the odd man out in treatment because of my size and it’s super hard.",
      "created_utc": 1723911108.0,
      "score": 6,
      "context": []
    },
    {
      "id": "liid7hm",
      "author": "Odd_Curve6621",
      "body": "Just want to stay, I’m 32 doing intensive outpatient treatment. Just started this past week. It’s all virtual, but I’m still the biggest. And I really relate to your post. I hope you find peace.",
      "created_utc": 1723863026.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lilitgh",
      "author": "HoneyBadgerQueen2000",
      "body": "If you're hospitalized, I'd bring your concerns up next time you speak to a therapist. Especially since comparing yourself is triggering. \n\nEating disorders can happen at any size, it's like a spectrum. And even though low weight is the common symptom most people think of in relation to an ED, there are tons of \"normal/average\" weight, and plus sized people who suffer from them too. It's like, even though extreme weight loss is the goal for most, that's the point you want to avoid getting too bc it's alot harder to bounce back from. \n\nI'm 24, too. And although I've never been plus sized, I've compared my weight to others a ton during hospitalizations. I even got diagnosed with anorexia when I was still at an average bmi for my age at the time (19). And even though being in support groups or around others with EDs was kind of toxic sometimes, it really helped me see that not everyone wirh an ED had to be petite, small or skinny. I've met plus-sized, underweight, normal weight people, males, all kinds of people. \n\nAnd once you're recovered, you can work with doctors or nutritionists to still loss weight, just in a healthy way. But the goal for rn is to get better💛💛\n\nIf you ever need to talk, feel free to dm me any time. I wish you the best of luck <3",
      "created_utc": 1723917860.0,
      "score": 4,
      "context": []
    },
    {
      "id": "limpfox",
      "author": "gibbonalert",
      "body": "I have had both anorexia and bulimia in different phases and let me say this: I have never been so sick as I was when I had bulimia. I was a total mess. I had to go to a treatment center, it was awesome and there were much thinner persons there, and sometimes when we talked about it the anorectic persons totally understood that the disease is in the head and isn’t dependent on weight. They all understand and often people with Ed are very kind persons, according to my experience, so nobody is judging. \nIt’s also a fact that many anorectic people binge sometimes and they all know how hard it can be. I don’t know your diagnosis, but it’s worth mentioning I hope I formulated it ok.",
      "created_utc": 1723933224.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lior5p7",
      "author": "Tinslee_Bliss",
      "body": "Talk about this in the group if it feels safe enough for you. I totally understand this is triggering for you, but: Your size has nothing to do with the severity of your ED. You deserve the help, your body deserves to be taken care of, you are valid, you are beautiful and you deserve a happy and fulfilling life without an ED. Take care and stay strong 💕",
      "created_utc": 1723968191.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lig5xqc",
      "author": "Spinosaur_Flip",
      "body": "Just wanna say that your experience is valid and your eating disorder is not any less serious than someone in a smaller body. You deserve recovery and freedom and your body does too <3",
      "created_utc": 1723833921.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ligcx18",
      "author": "None",
      "body": "This was very difficult for me. I gained 40lbs after I left in patient. I am currently dealing with new symptoms and struggling with relapse over a year later. I even had to argue with a lady about a comment she said about being cold and skinny. Ed is not limited to a certain size!",
      "created_utc": 1723836191.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lin93av",
      "author": "MiladyDisdain89",
      "body": "Can't relate to being the biggest person in treatment, but only because I've never received treatment. I've been struggling with atypical anorexia for over 20 years, but have been unable to get treatment because of my size. Now, my doctors are telling me to lose weight, and it only makes it worse, because my ED issues force binge/starve cycles, and i have major hormone issues that impede any kind of loss. The smallest I've ever been was still a BMI of 19.6, and that was on calories too low to live on. \n\n\nAll this to say that I kind of get it, but to be honest I've given up on help for me. I hope to the bottom of my soul that it works for you.",
      "created_utc": 1723941000.0,
      "score": 3,
      "context": []
    },
    {
      "id": "liqww9x",
      "author": "None",
      "body": "I’m scared of this. I go to a program on Thursday for 4 days overnight. I’m plus size but my doctors keep saying I could have a medical emergency and need help. I try and remind myself it’s the ED saying I’m not valid or worthy of help. Because even the smallest people there have the same thoughts! It’s part of the disorder ya know. However, it is different for us big folks as we don’t have thin privilege or fit into the ED stereotype. I hope your program is well educated on HAES and that ED’s come in all bodies. Good luck in your program! You are so valid and worthy of this help.",
      "created_utc": 1724002899.0,
      "score": 3,
      "context": []
    },
    {
      "id": "liyc2i8",
      "author": "WitchyWeedWoman",
      "body": "Yup for so long my ED was ignored by doctors because I was obese. I was starving myself and they were old and assumed you had to be thin. Except if you start big, you’re not going to be thin immediately. People are thin because they started medium or thin. But starvation shuts our organs all down the same. I finally have a doctor who looked at my loss this past 6 months and was like “look me in the eye and tell me you did this in a healthy manner” and I started crying and she got me in intense outpatient. Fatphobia lends doctors to wait historically for people who start obese to get sick before stepping in, say it’s a big adjustment for many to feel seen. Better to treat it now before you continue harm and I may not know you but I’m proud of you for putting yourself first even if you don’t feel worthy yet 🫶🏼",
      "created_utc": 1724108904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmh1w8p",
      "author": "None",
      "body": "Yupppp",
      "created_utc": 1725991113.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m59cp4a",
      "author": "Connect-Preference-5",
      "body": "Hey, how are you doing now?",
      "created_utc": 1735943785.0,
      "score": 1,
      "context": []
    },
    {
      "id": "liho6l7",
      "author": "clarewilliamss",
      "body": "Wow thank you for this perspective and encouragement! I will definitely bring it up with my treatment team. Wishing you the best and sending my support your way!",
      "created_utc": 1723852751.0,
      "score": 13,
      "context": [
        {
          "id": "lih0gvp",
          "author": "Comfortable_Sir8185",
          "body": "I literally was the next to largest person when I went to residential, and at first I didn’t feel “worthy” of help because of my size. While I knew I was super sick and desperately needed help, I had this panging feeling in me. One night I expressed this to my favorite therapist at the treatment center, I was bawling and crying on this conflict. She told me point blank that the doctors who evaluated me clearly believed I needed residential  treatment, or I wouldn’t be there. She stayed there with me during my whole breakdown, embracing my pain that I had on this very topic. That really changed my perspective on my “worthiness” with needing treatment. ED treatment doesn’t have a size requirement, it’s for anyone who needs it. I am sending love and light to you and would really encourage you to express this fear to your treatment team. I think you’ll be surprised to see how encouraging they’ll be.",
          "created_utc": 1723843911.0
        }
      ]
    },
    {
      "id": "liktnu2",
      "author": "clarewilliamss",
      "body": "Thank you, I appreciate the support so much. It means a lot to me! I think a lot of the feelings of not being able to”sick enough” come from myself, society, media, people who don’t understand eating disorders etc. and luckily I haven’t had any patient comment on my body yet. I will definitely work to fight those thoughts and feel worthy of treatment and taking up space. Thanks again!",
      "created_utc": 1723909164.0,
      "score": 6,
      "context": [
        {
          "id": "likomaz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1723907429.0
        }
      ]
    },
    {
      "id": "lihocno",
      "author": "clarewilliamss",
      "body": "It definitely did help! Thank you for sharing your experience, I’m glad I’m not alone in this experience or feeling. Keep going my friend, we’ve got this!",
      "created_utc": 1723852816.0,
      "score": 5,
      "context": [
        {
          "id": "lih589r",
          "author": "Ascendead_Teru",
          "body": "Im currently in a residential as a plus-sized person. I keep telling myself my insurance deemed me \"sick\" enough that I need treatment. If insurance thought you were fine, they would deny the claim. Sometimes that helps me remember that Im where I need to be.  \nBut I do agree, man can it be triggering to be the only plus-sized person in treatment.  I hope my little bit helped. Keep going <3",
          "created_utc": 1723845583.0
        }
      ]
    },
    {
      "id": "lilakcj",
      "author": "clarewilliamss",
      "body": "I feel you on that, it’s very difficult feeling like the odd man out especially in treatment with so much focus on size. You’re not alone",
      "created_utc": 1723915033.0,
      "score": 2,
      "context": [
        {
          "id": "likza5s",
          "author": "failing__yogurt",
          "body": "Going through this right now too. I definitely feel like the odd man out in treatment because of my size and it’s super hard.",
          "created_utc": 1723911108.0
        }
      ]
    },
    {
      "id": "ly1e8i8",
      "author": "Flat_Assistant_2162",
      "body": "Why?? The disorder takes us up and down and all around… it’s all disordered",
      "created_utc": 1732070776.0,
      "score": 1,
      "context": [
        {
          "id": "likza5s",
          "author": "failing__yogurt",
          "body": "Going through this right now too. I definitely feel like the odd man out in treatment because of my size and it’s super hard.",
          "created_utc": 1723911108.0
        }
      ]
    },
    {
      "id": "liiji85",
      "author": "clarewilliamss",
      "body": "I’m sorry that you relate but I’m glad that you are getting treatment! You are not alone. I hope you find peace as well.",
      "created_utc": 1723865927.0,
      "score": 4,
      "context": [
        {
          "id": "liid7hm",
          "author": "Odd_Curve6621",
          "body": "Just want to stay, I’m 32 doing intensive outpatient treatment. Just started this past week. It’s all virtual, but I’m still the biggest. And I really relate to your post. I hope you find peace.",
          "created_utc": 1723863026.0
        }
      ]
    },
    {
      "id": "lilw2sf",
      "author": "clarewilliamss",
      "body": "Aw thank you, this was helpful to hear. I’m not hospitalized but I am in a partial hospitalization program that is 5 days a week from 9am to 3:30pm for 5 weeks. I will likely bring it up with my therapist! I am definitely trying my best to do things one thing at a time and as hard as it is I’m trying to focus on myself and not compare but I know that the urge to compare comes from my eating disorder and not me! Although I’m not new to mental health treatment I’m so new to this kind of treatment and to say the least it’s been extremely overwhelming!",
      "created_utc": 1723922558.0,
      "score": 2,
      "context": [
        {
          "id": "lilitgh",
          "author": "HoneyBadgerQueen2000",
          "body": "If you're hospitalized, I'd bring your concerns up next time you speak to a therapist. Especially since comparing yourself is triggering. \n\nEating disorders can happen at any size, it's like a spectrum. And even though low weight is the common symptom most people think of in relation to an ED, there are tons of \"normal/average\" weight, and plus sized people who suffer from them too. It's like, even though extreme weight loss is the goal for most, that's the point you want to avoid getting too bc it's alot harder to bounce back from. \n\nI'm 24, too. And although I've never been plus sized, I've compared my weight to others a ton during hospitalizations. I even got diagnosed with anorexia when I was still at an average bmi for my age at the time (19). And even though being in support groups or around others with EDs was kind of toxic sometimes, it really helped me see that not everyone wirh an ED had to be petite, small or skinny. I've met plus-sized, underweight, normal weight people, males, all kinds of people. \n\nAnd once you're recovered, you can work with doctors or nutritionists to still loss weight, just in a healthy way. But the goal for rn is to get better💛💛\n\nIf you ever need to talk, feel free to dm me any time. I wish you the best of luck <3",
          "created_utc": 1723917860.0
        }
      ]
    },
    {
      "id": "lin3ss0",
      "author": "clarewilliamss",
      "body": "You did, thank you! I have been diagnosed with other specific eating disorder and potentially atypical anorexia so it’s all over the place",
      "created_utc": 1723938866.0,
      "score": 2,
      "context": [
        {
          "id": "limpfox",
          "author": "gibbonalert",
          "body": "I have had both anorexia and bulimia in different phases and let me say this: I have never been so sick as I was when I had bulimia. I was a total mess. I had to go to a treatment center, it was awesome and there were much thinner persons there, and sometimes when we talked about it the anorectic persons totally understood that the disease is in the head and isn’t dependent on weight. They all understand and often people with Ed are very kind persons, according to my experience, so nobody is judging. \nIt’s also a fact that many anorectic people binge sometimes and they all know how hard it can be. I don’t know your diagnosis, but it’s worth mentioning I hope I formulated it ok.",
          "created_utc": 1723933224.0
        }
      ]
    },
    {
      "id": "lipvs07",
      "author": "clarewilliamss",
      "body": "Thank you🩷",
      "created_utc": 1723990307.0,
      "score": 2,
      "context": [
        {
          "id": "lior5p7",
          "author": "Tinslee_Bliss",
          "body": "Talk about this in the group if it feels safe enough for you. I totally understand this is triggering for you, but: Your size has nothing to do with the severity of your ED. You deserve the help, your body deserves to be taken care of, you are valid, you are beautiful and you deserve a happy and fulfilling life without an ED. Take care and stay strong 💕",
          "created_utc": 1723968191.0
        }
      ]
    },
    {
      "id": "lig9kro",
      "author": "clarewilliamss",
      "body": "Thank you so much, that is helpful to hear!",
      "created_utc": 1723835096.0,
      "score": 2,
      "context": [
        {
          "id": "lig5xqc",
          "author": "Spinosaur_Flip",
          "body": "Just wanna say that your experience is valid and your eating disorder is not any less serious than someone in a smaller body. You deserve recovery and freedom and your body does too <3",
          "created_utc": 1723833921.0
        }
      ]
    },
    {
      "id": "ligie6b",
      "author": "clarewilliamss",
      "body": "I feel you and I’m sorry you had to argue with that comment! Thanks for the reminder! Eating disorders don’t have a size, we just feel like they do because of media, society, and what we think it should look like",
      "created_utc": 1723837972.0,
      "score": 6,
      "context": [
        {
          "id": "ligcx18",
          "author": "None",
          "body": "This was very difficult for me. I gained 40lbs after I left in patient. I am currently dealing with new symptoms and struggling with relapse over a year later. I even had to argue with a lady about a comment she said about being cold and skinny. Ed is not limited to a certain size!",
          "created_utc": 1723836191.0
        }
      ]
    },
    {
      "id": "liqxj5b",
      "author": "clarewilliamss",
      "body": "Thank you! The same goes for you, I wish you the best in your program! I’m slowly learning the EDs have no size and it is our ED making us feel we are not valid. It is very difficult on us mentally but also because society doesn’t see a plus size person and assume they have an ED or that if they do, it’s not serious. We do deserve help and healing though!🩷🫶🏼 feel free to update me on your program!",
      "created_utc": 1724003105.0,
      "score": 3,
      "context": [
        {
          "id": "liqww9x",
          "author": "None",
          "body": "I’m scared of this. I go to a program on Thursday for 4 days overnight. I’m plus size but my doctors keep saying I could have a medical emergency and need help. I try and remind myself it’s the ED saying I’m not valid or worthy of help. Because even the smallest people there have the same thoughts! It’s part of the disorder ya know. However, it is different for us big folks as we don’t have thin privilege or fit into the ED stereotype. I hope your program is well educated on HAES and that ED’s come in all bodies. Good luck in your program! You are so valid and worthy of this help.",
          "created_utc": 1724002899.0
        }
      ]
    },
    {
      "id": "liyox8s",
      "author": "clarewilliamss",
      "body": "Thank you I appreciate that so much! I’m glad you were finally taken seriously!",
      "created_utc": 1724113528.0,
      "score": 1,
      "context": [
        {
          "id": "liyc2i8",
          "author": "WitchyWeedWoman",
          "body": "Yup for so long my ED was ignored by doctors because I was obese. I was starving myself and they were old and assumed you had to be thin. Except if you start big, you’re not going to be thin immediately. People are thin because they started medium or thin. But starvation shuts our organs all down the same. I finally have a doctor who looked at my loss this past 6 months and was like “look me in the eye and tell me you did this in a healthy manner” and I started crying and she got me in intense outpatient. Fatphobia lends doctors to wait historically for people who start obese to get sick before stepping in, say it’s a big adjustment for many to feel seen. Better to treat it now before you continue harm and I may not know you but I’m proud of you for putting yourself first even if you don’t feel worthy yet 🫶🏼",
          "created_utc": 1724108904.0
        }
      ]
    },
    {
      "id": "m5qmf69",
      "author": "clarewilliamss",
      "body": "Hey I’m actually struggling a lot haha there’s a longer story there if you’re interested but yeah, I’m doing pretty poorly with my ed",
      "created_utc": 1736189450.0,
      "score": 1,
      "context": [
        {
          "id": "m59cp4a",
          "author": "Connect-Preference-5",
          "body": "Hey, how are you doing now?",
          "created_utc": 1735943785.0
        }
      ]
    },
    {
      "id": "liqzbmt",
      "author": "None",
      "body": "Thank you! You can always update me too, it’s nice to have others in bigger bodies to relate to and chat with 🩷\n\nYes it’s both the ED *AND* society that makes it difficult. People in smaller bodies or who meet the stereotypes don’t always have that extra barrier as much as we do.",
      "created_utc": 1724003694.0,
      "score": 2,
      "context": [
        {
          "id": "liqww9x",
          "author": "None",
          "body": "I’m scared of this. I go to a program on Thursday for 4 days overnight. I’m plus size but my doctors keep saying I could have a medical emergency and need help. I try and remind myself it’s the ED saying I’m not valid or worthy of help. Because even the smallest people there have the same thoughts! It’s part of the disorder ya know. However, it is different for us big folks as we don’t have thin privilege or fit into the ED stereotype. I hope your program is well educated on HAES and that ED’s come in all bodies. Good luck in your program! You are so valid and worthy of this help.",
          "created_utc": 1724002899.0
        },
        {
          "id": "liqxj5b",
          "author": "clarewilliamss",
          "body": "Thank you! The same goes for you, I wish you the best in your program! I’m slowly learning the EDs have no size and it is our ED making us feel we are not valid. It is very difficult on us mentally but also because society doesn’t see a plus size person and assume they have an ED or that if they do, it’s not serious. We do deserve help and healing though!🩷🫶🏼 feel free to update me on your program!",
          "created_utc": 1724003105.0
        }
      ]
    },
    {
      "id": "m5r5y79",
      "author": "Connect-Preference-5",
      "body": "Awe I’m really sorry to hear that :/ do tell, I’m all ears",
      "created_utc": 1736195137.0,
      "score": 1,
      "context": [
        {
          "id": "m59cp4a",
          "author": "Connect-Preference-5",
          "body": "Hey, how are you doing now?",
          "created_utc": 1735943785.0
        },
        {
          "id": "m5qmf69",
          "author": "clarewilliamss",
          "body": "Hey I’m actually struggling a lot haha there’s a longer story there if you’re interested but yeah, I’m doing pretty poorly with my ed",
          "created_utc": 1736189450.0
        }
      ]
    },
    {
      "id": "lir7ic1",
      "author": "clarewilliamss",
      "body": "Exactly! I feel so alone in it as I’m the only one who is plus size and I have a twin who has anorexia and has been severely underweight and still is. It’s so difficult not to compare but we’ve got this!🩷 I’d love to chat with someone who gets it and maybe feel less alone! You can always private message me :)",
      "created_utc": 1724006420.0,
      "score": 3,
      "context": [
        {
          "id": "liqww9x",
          "author": "None",
          "body": "I’m scared of this. I go to a program on Thursday for 4 days overnight. I’m plus size but my doctors keep saying I could have a medical emergency and need help. I try and remind myself it’s the ED saying I’m not valid or worthy of help. Because even the smallest people there have the same thoughts! It’s part of the disorder ya know. However, it is different for us big folks as we don’t have thin privilege or fit into the ED stereotype. I hope your program is well educated on HAES and that ED’s come in all bodies. Good luck in your program! You are so valid and worthy of this help.",
          "created_utc": 1724002899.0
        },
        {
          "id": "liqxj5b",
          "author": "clarewilliamss",
          "body": "Thank you! The same goes for you, I wish you the best in your program! I’m slowly learning the EDs have no size and it is our ED making us feel we are not valid. It is very difficult on us mentally but also because society doesn’t see a plus size person and assume they have an ED or that if they do, it’s not serious. We do deserve help and healing though!🩷🫶🏼 feel free to update me on your program!",
          "created_utc": 1724003105.0
        },
        {
          "id": "liqzbmt",
          "author": "None",
          "body": "Thank you! You can always update me too, it’s nice to have others in bigger bodies to relate to and chat with 🩷\n\nYes it’s both the ED *AND* society that makes it difficult. People in smaller bodies or who meet the stereotypes don’t always have that extra barrier as much as we do.",
          "created_utc": 1724003694.0
        }
      ]
    },
    {
      "id": "magdsai",
      "author": "clarewilliamss",
      "body": "So sorry I never responded, I just saw this but yeah, I had to go back to php and they just kicked me out telling me I need a higher level of care like residential but not inpatient because I’m not malnourished or having medical complications. My insurance doesn’t really cover most residential treatment facilities and I worry about what it’ll be like as someone who is plus sized when most people in that setting are there to be weight restored. I don’t really have any referral or anything so I’m at a loss as to what to do because now I have no ED treatment and it’s because they kicked me out to essentially nothing :/",
      "created_utc": 1738450156.0,
      "score": 1,
      "context": [
        {
          "id": "m59cp4a",
          "author": "Connect-Preference-5",
          "body": "Hey, how are you doing now?",
          "created_utc": 1735943785.0
        },
        {
          "id": "m5qmf69",
          "author": "clarewilliamss",
          "body": "Hey I’m actually struggling a lot haha there’s a longer story there if you’re interested but yeah, I’m doing pretty poorly with my ed",
          "created_utc": 1736189450.0
        },
        {
          "id": "m5r5y79",
          "author": "Connect-Preference-5",
          "body": "Awe I’m really sorry to hear that :/ do tell, I’m all ears",
          "created_utc": 1736195137.0
        }
      ]
    }
  ]
}