{
  "id": "1f14gj8",
  "subreddit": "EatingDisorders",
  "author": "InternationalGold105",
  "created_utc": 1724613658.0,
  "title": "Things I notice during recovery",
  "selftext": "Hi everyone. I’ve noticed that recovery is often just associated with weight gain, but there’s so much more to it. I wanted to share some of the incredible positives I’ve experienced as I’ve started recovering:\n\n**1. Improved Performance:** I’m so much better at working out and playing my sport. Although I’m still getting back into shape, I actually have energy and can enjoy working out again. I’m also much stronger at soccer now.\n\n**2. Rediscovered Personality:** My personality came back. That's all. It feels amazing. I remembered I am actually funny. \n\n**3. Enhanced Intelligence:** I’ve noticed I’m so much smarter now! I did better in school during my recovery, despite the challenges. I can have deeper thoughts and conversations, and I feel more engaged in everything I do.\n\n**4. Emotional Stability:** I’m not as angry anymore. I used to snap at people when I was sick and thought I was just a mean person. Now, I’m more enjoyable to be around.\n\n**5. Positive Attention:** Boys have started to notice me and show interest. Before, they either didn’t notice me or were concerned about my health.\n\n**6. Heightened Experiences:** Everything is more vibrant—music, nature, emotions. It’s like life is in HD now.\n\n**7. Old Passions:** I’ve revisited old hobbies and interests. I actually have the time and energy to focus on things I used to enjoy.\n\n**8. Better Sleep:** My sleep has improved so much. I used to struggle with sleep, but now I can sleep in and feel rested.\n\n**9. Womanly Appreciation:** This one is kind of random but I actually feel like a woman again. I've started to appreciate my hips and curves. \n\n**10.** **Social Life:** I’m much more social and can truly enjoy events, including all the yummy food that comes with them!\n\n**11. Healthy Hair:** I have tons of baby hairs now because my hair is growing back thicker and curlier. No more bald spots!\n\n**12.** **Renewed Libido:** My sex drive has returned, and it’s amazing! I didn't realize how much I missed it. \n\nThere are A LOT more positives that come with recovery. These are just some that happened to me that I wanted to highlight. There is a reason recovery exists. It is not  \"weight gain\", it is recovery from an illness. You go from sick to healthy. You get your life back. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1f14gj8/things_i_notice_during_recovery/",
  "score": 80,
  "num_comments": 4,
  "comments": [
    {
      "id": "lk7tp1u",
      "author": "None",
      "body": "so happy for u :) this is really amazing",
      "created_utc": 1724784131.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lk1h1cw",
      "author": "Upstairs-Mongoose228",
      "body": "This was such a lovely read :D Going through each one you made me appreciate all of the positive effects of recovering. Number 6 is especially true, every day has been filled with colour. Thank you so much for this write-up!",
      "created_utc": 1724692135.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkqqb0i",
      "author": "Fast-Secretary-559",
      "body": "I agree with all of these! The main one I like is the feeling smarter. I didn’t realize how reduced my brain function really was, looking back it’s scary to think how fuzzy everything felt!",
      "created_utc": 1725055223.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llllwxe",
      "author": "Cornflakes-08",
      "body": "Sometimes you need to hit rock bottom to know what true happiness is really is , it’s amazing how alive you can feel , congrats I’m happy for you , tho idk if I’ll ever feel like that",
      "created_utc": 1725525620.0,
      "score": 1,
      "context": []
    }
  ]
}