{
  "id": "1f3wu45",
  "subreddit": "EatingDisorders",
  "author": "No_Belt7130",
  "created_utc": 1724918026.0,
  "title": "how to unlearn calories",
  "selftext": "I kind of feel like the people outside of the matrix. Once you have seen the calories on food, you can‘t unsee them. I used to eat a lot of nice food and feel great while doing it. But now that I know the calories of almost everything that I used to love, I just can‘t get myself to eat them. Favorite foods have turned into fear foods. What can I do?? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1f3wu45/how_to_unlearn_calories/",
  "score": 154,
  "num_comments": 75,
  "comments": [
    {
      "id": "lkk21mi",
      "author": "Scorpiotantrvms",
      "body": "Yeah, I get you completely. I once explained it to my therapist by comparing it to Misa’s shinigami eyes in Death Note. I just look at food and it’s like I almost see the number of calories floating above it, and it feels like a loss of innocence I can never recover from. I’m so jealous of people that don’t care about calories at all.",
      "created_utc": 1724960993.0,
      "score": 88,
      "context": []
    },
    {
      "id": "lkkgjty",
      "author": "These-Tadpole7043",
      "body": "My husband reminds me that I don’t know what a normal amount of calories is. Just like I have a different definition of “skinny” than others, I need to remember that my brain just cannot correctly compute calories due to my disorder. My brain might flip out about 500 calories, when in reality that’s a fine amount of calories for a snack. Me & my disordered brain might adamantly disagree, so I just remember I don’t know what the f I’m doing & it helps me to not even try calorie counting lol",
      "created_utc": 1724965417.0,
      "score": 36,
      "context": []
    },
    {
      "id": "lkk5wsz",
      "author": "Mid-WorldWanderer",
      "body": "Jeez I totally feel you, I always feel the same. It's like \"mmmh I'd kill for a 600 kcals Big Mac, too bad my eating day would be basically over then\"",
      "created_utc": 1724962166.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lkl1ys6",
      "author": "Organic_Werewolf_317",
      "body": "Honestly, it really does fade over time. I thought I would never be able to forget the calories in certain foods. I first went to inpatient treatment three years ago. Last month, I was cutting an avocado and was struck by the thought that I could no longer remember how many calories were in the average avocado. I could make guesses, but I wasn’t certain. I didn’t Google it to check. I just took the win and enjoyed the avocado. \n\nIt takes a lot of time and patience, but like any skill, it you don’t use it, you lose it. I stopped letting myself play the guessing game, trying to calculate the caloric value of any meal or snack. I hope you’re able to enjoy the foods you love someday, without any guilt, shame, or memorized nutrition facts getting in the way.",
      "created_utc": 1724972600.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lkknz7a",
      "author": "briannanicolegrace",
      "body": "This is something I still struggle with and I don’t know the answer. Whenever I pour my coffee creamer my brain starts counting. The struggle is real.",
      "created_utc": 1724967790.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lkkkczl",
      "author": "Specific-Oil3853",
      "body": "I am right there with you. Hang in there friend",
      "created_utc": 1724966628.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lkqsqnx",
      "author": "None",
      "body": "Everything I choose to eat is out of guilt rather than what I actually want. \n\nFood has become a chore. I can’t not think about calories. If I do eat something “unhealthy”, it’s never ending guilt afterwards, never satisfaction. There’s just no pleasure, so then I avoid them entirely. ",
      "created_utc": 1725056089.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lkkoz21",
      "author": "meta_muse",
      "body": "I totally relate to this. I also do not know what to do.",
      "created_utc": 1724968117.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkkx5tn",
      "author": "Interesting-Cow8131",
      "body": "I don't count calories or look at the nutritional label on purpose. But I mentally tell myself when making a meal \"no that's too many calories.\" Or when I see a recipe for something and see the calorie count, I think i couldn't possibly eat 500 calories in a single meal, when in fact, that's a reasonable amount for a meal",
      "created_utc": 1724970903.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkl8qyf",
      "author": "YurinaAbbieLing",
      "body": "Well for me the numbers still float around from time to time but it will disappear when you don’t really think about food. For instance you can try food you’ve never had before or never had during the “losing weight phase”. And everything takes time okay? It’s alright. Believe me you’re not alone in this fight.🫂\n\nPs. I’m not an expert or anything. I’m just another victim of this god forsaken illness.",
      "created_utc": 1724975047.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkmb89j",
      "author": "siggarette",
      "body": "I counted every calorie for almost 10 years. Literally everything down to vitamins and gum. I'm happy to say i am fully recovered now and haven't counted calories in about 5 years. \n\nWhat helped me stop was going out to eat more. Cooking and eating with friends. Eating with people in general is a good distraction. And at home make more meals that are just stuff pre mixed together so you don't know sure like chili or something. your knowledge of calories will fade over time. \n\nYou got this. It's possible. I don't reply to a lot of things on Reddit but when i see someone doubting they can recover from an ED......i gotta chime in and let you know no matter how deep you're in it it's possible to get out.",
      "created_utc": 1724990087.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkmbr5e",
      "author": "Julietjane01",
      "body": "You pretty much can’t but you can not look on the label to confirm. No confirming what you think you already know. Start with that and you’ll find maybe that the issue is more than knowing what it says. Of course things like fruit and vegetables you’ll likely always know but you don’t really need to eat those things plain. For example you could put pb on a banana without measuring peanut butter and if you feel yourself limiting yourself, you need to take an extra scoop. I have been recovered for 4 years now and if I look it’s because I want to make sure it’s enough calories not too many. I eat meals that have a very formerly scary number on the front and eat it with something on the side. I eat the stuff at restaurants regardless of calories. Actually if I ever catch myself comparing calories between dishes I’ll intentionally have whichever one is greater. Basically you have that information but it doesn’t have to stop you.",
      "created_utc": 1724990331.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkmeity",
      "author": "enord11400",
      "body": "After counting calories for close to a decade while still indulging my eating disorder, once I got to a good place and wanted to leave it behind it took about 5 years to start forgetting a lot of calorie counts. I haven't forgotten them all but they don't pop out of my brain every time I'm trying to decide what to eat like they used to. I can choose to pay attention to them or not when the information is presented to me. YMMV but it is possible to forget at least some of it. \n\nEarly on I just had to go for a \"feel the fear and do it anyway\" type approach. That involved a lot of freaking out but that was unavoidable. It will be hard to avoid this information completely in the future so you have to learn to cope with knowing it.",
      "created_utc": 1724991654.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkpvs26",
      "author": "Gloomystars",
      "body": "It gets better. It really does. But I think you want to have to change. I started therapy a few months ago and while my ED is not gone, it’s way better. A few months ago I wouldn’t even eat a single thing if it wasn’t weighed and tracked. I would binge 10k+calories then starve myself and restrict like crazy. \n\nI’m now at the point with a mix of therapy as well as medication (I was diagnosed with adhd and BED and have been prescribed vyvanse) that I only think about the calories of what I’m eating occasionally. I still binge sometimes, I still lightly restrict sometimes, I still have trouble “allowing” myself to eqt certain foods, but life is 100000x better. “Recovery” which I guess is what I’m going through is 100% worth it. Life was hell a few months ago and now it feels like I’m actually able to live. \n\nI don’t know if I will ever fully “recover” or if I’ll always have some ED tendencies. I do better some days/weeks and do worse others. But overall making a conscious effort to “fix” my ED has been life changing and I feel myself slowly improving. Look at yourself in the scale of weeks/months not single days or weeks. I find that it’s really hard for me to focus on the bigger picture especially when I have setbacks. But when I do, I see how far I’ve come. \n\nTLDR: it gets better if you want to get better",
      "created_utc": 1725045100.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkks8mi",
      "author": "None",
      "body": "same here. i knew i was too far gone when i started counting the calories in breath mints",
      "created_utc": 1724969207.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lklwh1w",
      "author": "EmLee-96",
      "body": "I told my disordered eating therapist that my goal was to not count calories and she laughed (kindly) and was like \"oh sweetie it'll be years before you can stop that\". She's working with me to disregard the 2000 calorie/day recommendation. It's been a big thing for me because I think I need to stay under that and that really isn't a lot of food. She's currently one of the top in our area (I'm very fortunate to even get 40 minutes of her time) and thinks the calorie reccomendation will be obsolete within the next decade, just like the food pyramid isn't a thing anymore.",
      "created_utc": 1724983856.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lklxaib",
      "author": "None",
      "body": "For a period of time I succeeded with \"unlearning\" calories as I lived in a good desert and commuted almost exclusively on food. I began doing most of my shopping at an Asian specialty food, fish, and produce store. It was cheap, and led to a period of switching up my diet quite a bit. \n\nIn addition, to foods that simply were entirely new to me becoming staples, if I wanted bread I had to buy the ingredients and make it myself or substitute it with something else. \n\nI wasn't really putting intentional effort into avoiding counting calories, but it ultimately happened and I stopped for a period of time.  \n\nLater on, I developed a moderate TBI, and quite literally forgot the calories in many foods... I dont recommend that route, though.",
      "created_utc": 1724984176.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lklypby",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1724984742.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkm1vup",
      "author": "jacksonchickenwangs",
      "body": "was just talking to my counselor about this. 🥺 perfect timing",
      "created_utc": 1724986036.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkm5y3c",
      "author": "NYCstateofmind",
      "body": "It does fade after time. I now couldn’t tell you the calories that I eat in a day, let alone in a single item. I think it fades away and as it’s fading you learn food neutrality, or rather unlearn the toxic diet culture messaging. I found growing some of my own food gave me an appreciation of just how much effort goes into the food & I also try to buy things from local markets and colleagues (I live in a rural area) ie my colleague has bees and makes her own raw honey, so I buy that off her.",
      "created_utc": 1724987742.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkmy8eu",
      "author": "HarviMelody",
      "body": "For me it’s the carbs too😭 what’s even worse is the fact I’m on a healthy diet now and it’s so hard to keep it healthy",
      "created_utc": 1725003110.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkof4g6",
      "author": "BabyStinkBreath",
      "body": "Check out the Maintenance Phase episode \"The Trouble with Calories.\" It really highlights how calories are not the settled science we've been led to believe and that the guidelines put out are really skewed.",
      "created_utc": 1725028389.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkrltst",
      "author": "MeDenyingReality",
      "body": "I'm.not sure how helpful this is, but there IS hope! I was very similar to you in 2015/2016, but after years in recovery other things take priority... How food tastes, how I'm feeling while enjoying it, etc. it takes time and work but it is possible! It's not as if I've forgotten the numbers... But they're tucked so far back in my brain I don't think of it anymore.",
      "created_utc": 1725067158.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkrwi6z",
      "author": "coffeesoakedpickles",
      "body": "It takes time honestly, time and the realization that your current perception of how much you should be eating is much different than that of a recovered/“normal” mindset. I used to see the calories in EVERYTHING, absolutely fucking everything and every amount of anything. It was awful, like a damn eternal algebra class from hell. I started recovering in mid 2020 and it’s been a journey but i think around the 2 year mark those numbers started to … fade, and food just became food again. I stopped seeing the numbers and started seeing the value, the memories, the livelihood, the joy in eating and choosing life over my eating disorder. It just takes time, and sometimes i still see those numbers but i am strong enough now to brush it off and remember what matters ",
      "created_utc": 1725071577.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lktn1f6",
      "author": "EDHelpNow",
      "body": "Brace yourself - I'm sorry, but calories are absolute BS. They are a unit of energy calculated in a lab if you set the food on fire and try to heat water 1 degree celsius - seriously. (science people, I know it's Kcals, but still). Calories in a lab don't translate into how your genius/incredibly complex body uses calories. I wish it did because it would mean we weren't basing our lives on a lie.  Each body uses foods differently based on what it needs. \n\nThis is blatant self-promotion, but that's why I created Eating Disorder Help Now if you're interested. Sending love your way. Your awareness of this dilemma is going to flourish into amazing self-growth. You deserve to use your amazing brain for more important things.",
      "created_utc": 1725107589.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkvr6j6",
      "author": "Party_Run_3525",
      "body": "The only thing that will heal this is time, try new foods which you don’t know the calories of, get someone else or prepare your food so you don’t know about serving sizes, make a conscious effort to stop reading food labels, everyday you have to pick to not let the calories control you and slowly but surely you will stop seeing food as a number. I’d say it took me about 2 years and even then, after a tough day, or when I’m due on my period, it can still creep back in, you just have to actively keep pushing it away, best of luck!",
      "created_utc": 1725134238.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkyq2al",
      "author": "DowntownCarob",
      "body": "Yep I got redpilled SO hard",
      "created_utc": 1725182622.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkytvk6",
      "author": "Happy_Cap7935",
      "body": "Read ‘eating in the light of the moon’ - it’ll help give you a different perspective",
      "created_utc": 1725185188.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkzfwox",
      "author": "oldmermaid",
      "body": "I never thought I’d get through the numbers and counting. For me there’s some calorie amounts that I feel I will always know. The last time I was IP was 6 years ago and the difference is that now I’m recovered it doesn’t phase me. The number doesn’t hold any weight, it’s just that … a number. And it doesn’t dictate whether I eat something or not. So yeah I know the calories in some foods but it doesn’t mean anything.\nAnd it’s moment like this when I realise something like what I’ve just typed that I’m so proud of myself because I never thought life after an eating disorder was possible for me.",
      "created_utc": 1725196654.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lljpo1u",
      "author": "OwlConfident4370",
      "body": "It’s tough when knowing the calorie content of foods turns them into fear foods. One approach to unlearning calorie fixation is to gradually shift your focus away from numbers and towards how food makes you feel. Start by reintroducing foods you used to enjoy, but try to eat them without checking the calories first.\n\nYou might also want to practice mindful eating. This involves paying attention to the taste, texture, and satisfaction of the food rather than its calorie content. Eating without distractions, like watching TV or scrolling on your phone, can help you reconnect with your body’s hunger and fullness cues.\n\nAdditionally, it might be helpful to work with a therapist who specializes in eating disorders.",
      "created_utc": 1725492808.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lklnuw0",
      "author": "Professional_Stay_46",
      "body": "That doesn't sound like a problem, but a symptom.\nIt's about what makes you feel that way about high calories.\n\nYou are not gonna get fat, or you are going to get fat based on calories, so what really bothers you is gaining weight.",
      "created_utc": 1724980583.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkk47d7",
      "author": "No_Belt7130",
      "body": "yes!! exactly like in death note haha\nI wish I could just turn it off",
      "created_utc": 1724961645.0,
      "score": 11,
      "context": [
        {
          "id": "lkk21mi",
          "author": "Scorpiotantrvms",
          "body": "Yeah, I get you completely. I once explained it to my therapist by comparing it to Misa’s shinigami eyes in Death Note. I just look at food and it’s like I almost see the number of calories floating above it, and it feels like a loss of innocence I can never recover from. I’m so jealous of people that don’t care about calories at all.",
          "created_utc": 1724960993.0
        }
      ]
    },
    {
      "id": "lkkp32r",
      "author": "meta_muse",
      "body": "That’s such a great comparison.",
      "created_utc": 1724968154.0,
      "score": 9,
      "context": [
        {
          "id": "lkk21mi",
          "author": "Scorpiotantrvms",
          "body": "Yeah, I get you completely. I once explained it to my therapist by comparing it to Misa’s shinigami eyes in Death Note. I just look at food and it’s like I almost see the number of calories floating above it, and it feels like a loss of innocence I can never recover from. I’m so jealous of people that don’t care about calories at all.",
          "created_utc": 1724960993.0
        }
      ]
    },
    {
      "id": "lkks0s3",
      "author": "These-Tadpole7043",
      "body": "Oh also! I rename them to “energy stars” hehe :)",
      "created_utc": 1724969131.0,
      "score": 22,
      "context": [
        {
          "id": "lkkgjty",
          "author": "These-Tadpole7043",
          "body": "My husband reminds me that I don’t know what a normal amount of calories is. Just like I have a different definition of “skinny” than others, I need to remember that my brain just cannot correctly compute calories due to my disorder. My brain might flip out about 500 calories, when in reality that’s a fine amount of calories for a snack. Me & my disordered brain might adamantly disagree, so I just remember I don’t know what the f I’m doing & it helps me to not even try calorie counting lol",
          "created_utc": 1724965417.0
        }
      ]
    },
    {
      "id": "lkkpb4j",
      "author": "meta_muse",
      "body": "Dude sameee",
      "created_utc": 1724968227.0,
      "score": 5,
      "context": [
        {
          "id": "lkkgjty",
          "author": "These-Tadpole7043",
          "body": "My husband reminds me that I don’t know what a normal amount of calories is. Just like I have a different definition of “skinny” than others, I need to remember that my brain just cannot correctly compute calories due to my disorder. My brain might flip out about 500 calories, when in reality that’s a fine amount of calories for a snack. Me & my disordered brain might adamantly disagree, so I just remember I don’t know what the f I’m doing & it helps me to not even try calorie counting lol",
          "created_utc": 1724965417.0
        }
      ]
    },
    {
      "id": "lkmg29j",
      "author": "No_Belt7130",
      "body": "exactly…when I see some of my friends just mindlessly snacking a bag full of 400kcal chips and then eating their lunch I think „woah that is half my daily kcals“ and thats so silly",
      "created_utc": 1724992422.0,
      "score": 10,
      "context": [
        {
          "id": "lkk5wsz",
          "author": "Mid-WorldWanderer",
          "body": "Jeez I totally feel you, I always feel the same. It's like \"mmmh I'd kill for a 600 kcals Big Mac, too bad my eating day would be basically over then\"",
          "created_utc": 1724962166.0
        }
      ]
    },
    {
      "id": "lkli56r",
      "author": "harmonystar19",
      "body": "I was going to say the same thing that it just takes time. It’s now 12 years of recovery and I honestly don’t remember the calories of anything!",
      "created_utc": 1724978493.0,
      "score": 4,
      "context": [
        {
          "id": "lkl1ys6",
          "author": "Organic_Werewolf_317",
          "body": "Honestly, it really does fade over time. I thought I would never be able to forget the calories in certain foods. I first went to inpatient treatment three years ago. Last month, I was cutting an avocado and was struck by the thought that I could no longer remember how many calories were in the average avocado. I could make guesses, but I wasn’t certain. I didn’t Google it to check. I just took the win and enjoyed the avocado. \n\nIt takes a lot of time and patience, but like any skill, it you don’t use it, you lose it. I stopped letting myself play the guessing game, trying to calculate the caloric value of any meal or snack. I hope you’re able to enjoy the foods you love someday, without any guilt, shame, or memorized nutrition facts getting in the way.",
          "created_utc": 1724972600.0
        }
      ]
    },
    {
      "id": "lkpwe07",
      "author": "Gloomystars",
      "body": "Comments like these as I’m in recovery have me really hopeful. Sometimes especially when I have setbacks, it feels like I’ll never get better. But I think I just need to give it time.",
      "created_utc": 1725045299.0,
      "score": 2,
      "context": [
        {
          "id": "lkl1ys6",
          "author": "Organic_Werewolf_317",
          "body": "Honestly, it really does fade over time. I thought I would never be able to forget the calories in certain foods. I first went to inpatient treatment three years ago. Last month, I was cutting an avocado and was struck by the thought that I could no longer remember how many calories were in the average avocado. I could make guesses, but I wasn’t certain. I didn’t Google it to check. I just took the win and enjoyed the avocado. \n\nIt takes a lot of time and patience, but like any skill, it you don’t use it, you lose it. I stopped letting myself play the guessing game, trying to calculate the caloric value of any meal or snack. I hope you’re able to enjoy the foods you love someday, without any guilt, shame, or memorized nutrition facts getting in the way.",
          "created_utc": 1724972600.0
        }
      ]
    },
    {
      "id": "lkkpcyk",
      "author": "meta_muse",
      "body": "Sameee",
      "created_utc": 1724968244.0,
      "score": 3,
      "context": [
        {
          "id": "lkknz7a",
          "author": "briannanicolegrace",
          "body": "This is something I still struggle with and I don’t know the answer. Whenever I pour my coffee creamer my brain starts counting. The struggle is real.",
          "created_utc": 1724967790.0
        }
      ]
    },
    {
      "id": "lkmg9dw",
      "author": "No_Belt7130",
      "body": "thank you, you too",
      "created_utc": 1724992524.0,
      "score": 1,
      "context": [
        {
          "id": "lkkkczl",
          "author": "Specific-Oil3853",
          "body": "I am right there with you. Hang in there friend",
          "created_utc": 1724966628.0
        }
      ]
    },
    {
      "id": "lkmggkq",
      "author": "No_Belt7130",
      "body": "thank you 🫂\nmaybe someday in the next few weeks I will try to find something small and „easy“ to eat, without knowing the kalories",
      "created_utc": 1724992626.0,
      "score": 1,
      "context": [
        {
          "id": "lkl8qyf",
          "author": "YurinaAbbieLing",
          "body": "Well for me the numbers still float around from time to time but it will disappear when you don’t really think about food. For instance you can try food you’ve never had before or never had during the “losing weight phase”. And everything takes time okay? It’s alright. Believe me you’re not alone in this fight.🫂\n\nPs. I’m not an expert or anything. I’m just another victim of this god forsaken illness.",
          "created_utc": 1724975047.0
        }
      ]
    },
    {
      "id": "lkmh39e",
      "author": "No_Belt7130",
      "body": "thank you!\nwow 10 years of calorie counting sounds so draining and exhausting…I am so glad you were able to get better",
      "created_utc": 1724992952.0,
      "score": 2,
      "context": [
        {
          "id": "lkmb89j",
          "author": "siggarette",
          "body": "I counted every calorie for almost 10 years. Literally everything down to vitamins and gum. I'm happy to say i am fully recovered now and haven't counted calories in about 5 years. \n\nWhat helped me stop was going out to eat more. Cooking and eating with friends. Eating with people in general is a good distraction. And at home make more meals that are just stuff pre mixed together so you don't know sure like chili or something. your knowledge of calories will fade over time. \n\nYou got this. It's possible. I don't reply to a lot of things on Reddit but when i see someone doubting they can recover from an ED......i gotta chime in and let you know no matter how deep you're in it it's possible to get out.",
          "created_utc": 1724990087.0
        }
      ]
    },
    {
      "id": "lkmi2ei",
      "author": "No_Belt7130",
      "body": "+ also, you calling it an ED somehow made me feel better (?) because the silly online tests „only“ said „disordered eating habits“ but I thought it was more serious than that. At the same time, though, I always think „you can‘t call this an ED…it isn‘t bad enough for that“ but at this point…I think you‘re right",
      "created_utc": 1724993459.0,
      "score": 1,
      "context": [
        {
          "id": "lkmb89j",
          "author": "siggarette",
          "body": "I counted every calorie for almost 10 years. Literally everything down to vitamins and gum. I'm happy to say i am fully recovered now and haven't counted calories in about 5 years. \n\nWhat helped me stop was going out to eat more. Cooking and eating with friends. Eating with people in general is a good distraction. And at home make more meals that are just stuff pre mixed together so you don't know sure like chili or something. your knowledge of calories will fade over time. \n\nYou got this. It's possible. I don't reply to a lot of things on Reddit but when i see someone doubting they can recover from an ED......i gotta chime in and let you know no matter how deep you're in it it's possible to get out.",
          "created_utc": 1724990087.0
        }
      ]
    },
    {
      "id": "lkmh88m",
      "author": "No_Belt7130",
      "body": "wow that sounds great actually\nhopefully one day I‘ll get there",
      "created_utc": 1724993023.0,
      "score": 2,
      "context": [
        {
          "id": "lkmbr5e",
          "author": "Julietjane01",
          "body": "You pretty much can’t but you can not look on the label to confirm. No confirming what you think you already know. Start with that and you’ll find maybe that the issue is more than knowing what it says. Of course things like fruit and vegetables you’ll likely always know but you don’t really need to eat those things plain. For example you could put pb on a banana without measuring peanut butter and if you feel yourself limiting yourself, you need to take an extra scoop. I have been recovered for 4 years now and if I look it’s because I want to make sure it’s enough calories not too many. I eat meals that have a very formerly scary number on the front and eat it with something on the side. I eat the stuff at restaurants regardless of calories. Actually if I ever catch myself comparing calories between dishes I’ll intentionally have whichever one is greater. Basically you have that information but it doesn’t have to stop you.",
          "created_utc": 1724990331.0
        }
      ]
    },
    {
      "id": "lkmhdtk",
      "author": "No_Belt7130",
      "body": "and how do I do the „cope with knowing it“-part? do you have any tips? \nalso I am glad you got better",
      "created_utc": 1724993102.0,
      "score": 1,
      "context": [
        {
          "id": "lkmeity",
          "author": "enord11400",
          "body": "After counting calories for close to a decade while still indulging my eating disorder, once I got to a good place and wanted to leave it behind it took about 5 years to start forgetting a lot of calorie counts. I haven't forgotten them all but they don't pop out of my brain every time I'm trying to decide what to eat like they used to. I can choose to pay attention to them or not when the information is presented to me. YMMV but it is possible to forget at least some of it. \n\nEarly on I just had to go for a \"feel the fear and do it anyway\" type approach. That involved a lot of freaking out but that was unavoidable. It will be hard to avoid this information completely in the future so you have to learn to cope with knowing it.",
          "created_utc": 1724991654.0
        }
      ]
    },
    {
      "id": "lkmgnsn",
      "author": "No_Belt7130",
      "body": "wow thats amazing…but that is also a lot of time 😅🥲 I wish there was a simple switch in my head, to turn it off haha",
      "created_utc": 1724992729.0,
      "score": 1,
      "context": [
        {
          "id": "lklwh1w",
          "author": "EmLee-96",
          "body": "I told my disordered eating therapist that my goal was to not count calories and she laughed (kindly) and was like \"oh sweetie it'll be years before you can stop that\". She's working with me to disregard the 2000 calorie/day recommendation. It's been a big thing for me because I think I need to stay under that and that really isn't a lot of food. She's currently one of the top in our area (I'm very fortunate to even get 40 minutes of her time) and thinks the calorie reccomendation will be obsolete within the next decade, just like the food pyramid isn't a thing anymore.",
          "created_utc": 1724983856.0
        }
      ]
    },
    {
      "id": "lkmgwow",
      "author": "No_Belt7130",
      "body": "alright, maybe I should try that\nbut it could be weird because my parents also eat those products and might wonder why the thing is covered up",
      "created_utc": 1724992857.0,
      "score": 1,
      "context": [
        {
          "id": "lklypby",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1724984742.0
        }
      ]
    },
    {
      "id": "lknbnpx",
      "author": "No_Belt7130",
      "body": "even if it is hard…please keep going!!",
      "created_utc": 1725011925.0,
      "score": 1,
      "context": [
        {
          "id": "lkmy8eu",
          "author": "HarviMelody",
          "body": "For me it’s the carbs too😭 what’s even worse is the fact I’m on a healthy diet now and it’s so hard to keep it healthy",
          "created_utc": 1725003110.0
        }
      ]
    },
    {
      "id": "lkontv1",
      "author": "No_Belt7130",
      "body": "thank you! I will do that👍",
      "created_utc": 1725031119.0,
      "score": 1,
      "context": [
        {
          "id": "lkof4g6",
          "author": "BabyStinkBreath",
          "body": "Check out the Maintenance Phase episode \"The Trouble with Calories.\" It really highlights how calories are not the settled science we've been led to believe and that the guidelines put out are really skewed.",
          "created_utc": 1725028389.0
        }
      ]
    },
    {
      "id": "lktsln0",
      "author": "No_Belt7130",
      "body": "thank you :)\nI‘ll try and educate myself a bit more on the topic",
      "created_utc": 1725109881.0,
      "score": 1,
      "context": [
        {
          "id": "lktn1f6",
          "author": "EDHelpNow",
          "body": "Brace yourself - I'm sorry, but calories are absolute BS. They are a unit of energy calculated in a lab if you set the food on fire and try to heat water 1 degree celsius - seriously. (science people, I know it's Kcals, but still). Calories in a lab don't translate into how your genius/incredibly complex body uses calories. I wish it did because it would mean we weren't basing our lives on a lie.  Each body uses foods differently based on what it needs. \n\nThis is blatant self-promotion, but that's why I created Eating Disorder Help Now if you're interested. Sending love your way. Your awareness of this dilemma is going to flourish into amazing self-growth. You deserve to use your amazing brain for more important things.",
          "created_utc": 1725107589.0
        }
      ]
    },
    {
      "id": "lkw0rru",
      "author": "No_Belt7130",
      "body": "okay I‘ll try! thank you :)",
      "created_utc": 1725137524.0,
      "score": 1,
      "context": [
        {
          "id": "lkvr6j6",
          "author": "Party_Run_3525",
          "body": "The only thing that will heal this is time, try new foods which you don’t know the calories of, get someone else or prepare your food so you don’t know about serving sizes, make a conscious effort to stop reading food labels, everyday you have to pick to not let the calories control you and slowly but surely you will stop seeing food as a number. I’d say it took me about 2 years and even then, after a tough day, or when I’m due on my period, it can still creep back in, you just have to actively keep pushing it away, best of luck!",
          "created_utc": 1725134238.0
        }
      ]
    },
    {
      "id": "lkyu3rf",
      "author": "No_Belt7130",
      "body": "okay thank you :)",
      "created_utc": 1725185341.0,
      "score": 2,
      "context": [
        {
          "id": "lkytvk6",
          "author": "Happy_Cap7935",
          "body": "Read ‘eating in the light of the moon’ - it’ll help give you a different perspective",
          "created_utc": 1725185188.0
        }
      ]
    },
    {
      "id": "lkzkb5i",
      "author": "No_Belt7130",
      "body": "I am also proud of you! that sounds amazing",
      "created_utc": 1725198362.0,
      "score": 2,
      "context": [
        {
          "id": "lkzfwox",
          "author": "oldmermaid",
          "body": "I never thought I’d get through the numbers and counting. For me there’s some calorie amounts that I feel I will always know. The last time I was IP was 6 years ago and the difference is that now I’m recovered it doesn’t phase me. The number doesn’t hold any weight, it’s just that … a number. And it doesn’t dictate whether I eat something or not. So yeah I know the calories in some foods but it doesn’t mean anything.\nAnd it’s moment like this when I realise something like what I’ve just typed that I’m so proud of myself because I never thought life after an eating disorder was possible for me.",
          "created_utc": 1725196654.0
        }
      ]
    },
    {
      "id": "lll7dq1",
      "author": "No_Belt7130",
      "body": "okay thank you",
      "created_utc": 1725515981.0,
      "score": 1,
      "context": [
        {
          "id": "lljpo1u",
          "author": "OwlConfident4370",
          "body": "It’s tough when knowing the calorie content of foods turns them into fear foods. One approach to unlearning calorie fixation is to gradually shift your focus away from numbers and towards how food makes you feel. Start by reintroducing foods you used to enjoy, but try to eat them without checking the calories first.\n\nYou might also want to practice mindful eating. This involves paying attention to the taste, texture, and satisfaction of the food rather than its calorie content. Eating without distractions, like watching TV or scrolling on your phone, can help you reconnect with your body’s hunger and fullness cues.\n\nAdditionally, it might be helpful to work with a therapist who specializes in eating disorders.",
          "created_utc": 1725492808.0
        }
      ]
    },
    {
      "id": "lkmgilu",
      "author": "No_Belt7130",
      "body": "yes, I guess it is",
      "created_utc": 1724992654.0,
      "score": 1,
      "context": [
        {
          "id": "lklnuw0",
          "author": "Professional_Stay_46",
          "body": "That doesn't sound like a problem, but a symptom.\nIt's about what makes you feel that way about high calories.\n\nYou are not gonna get fat, or you are going to get fat based on calories, so what really bothers you is gaining weight.",
          "created_utc": 1724980583.0
        }
      ]
    },
    {
      "id": "lkp2c7q",
      "author": "Cornflakes-08",
      "body": "I like your comparison haha it’s kind of accurate",
      "created_utc": 1725035650.0,
      "score": 4,
      "context": [
        {
          "id": "lkk21mi",
          "author": "Scorpiotantrvms",
          "body": "Yeah, I get you completely. I once explained it to my therapist by comparing it to Misa’s shinigami eyes in Death Note. I just look at food and it’s like I almost see the number of calories floating above it, and it feels like a loss of innocence I can never recover from. I’m so jealous of people that don’t care about calories at all.",
          "created_utc": 1724960993.0
        },
        {
          "id": "lkk47d7",
          "author": "No_Belt7130",
          "body": "yes!! exactly like in death note haha\nI wish I could just turn it off",
          "created_utc": 1724961645.0
        }
      ]
    },
    {
      "id": "lkndpay",
      "author": "girlbrainbroken",
      "body": "ENERGY STARS, this is so good!",
      "created_utc": 1725013157.0,
      "score": 5,
      "context": [
        {
          "id": "lkkgjty",
          "author": "These-Tadpole7043",
          "body": "My husband reminds me that I don’t know what a normal amount of calories is. Just like I have a different definition of “skinny” than others, I need to remember that my brain just cannot correctly compute calories due to my disorder. My brain might flip out about 500 calories, when in reality that’s a fine amount of calories for a snack. Me & my disordered brain might adamantly disagree, so I just remember I don’t know what the f I’m doing & it helps me to not even try calorie counting lol",
          "created_utc": 1724965417.0
        },
        {
          "id": "lkks0s3",
          "author": "These-Tadpole7043",
          "body": "Oh also! I rename them to “energy stars” hehe :)",
          "created_utc": 1724969131.0
        }
      ]
    },
    {
      "id": "lmbohxx",
      "author": "kiddoneedsalife",
      "body": "I'm stealing this ,:3 I struggle with seeing the numbers too and it's so hard. I overthink everything and at the end don't even eat. energy stars is such a cute name, I'll try it out to see if it helps at all.",
      "created_utc": 1725910491.0,
      "score": 2,
      "context": [
        {
          "id": "lkkgjty",
          "author": "These-Tadpole7043",
          "body": "My husband reminds me that I don’t know what a normal amount of calories is. Just like I have a different definition of “skinny” than others, I need to remember that my brain just cannot correctly compute calories due to my disorder. My brain might flip out about 500 calories, when in reality that’s a fine amount of calories for a snack. Me & my disordered brain might adamantly disagree, so I just remember I don’t know what the f I’m doing & it helps me to not even try calorie counting lol",
          "created_utc": 1724965417.0
        },
        {
          "id": "lkks0s3",
          "author": "These-Tadpole7043",
          "body": "Oh also! I rename them to “energy stars” hehe :)",
          "created_utc": 1724969131.0
        }
      ]
    },
    {
      "id": "lkp37d0",
      "author": "Cornflakes-08",
      "body": "Exactly like when you realize how much u ate in the past without counting its insane and u ask yourself “ how did I live like that “",
      "created_utc": 1725035924.0,
      "score": 5,
      "context": [
        {
          "id": "lkk5wsz",
          "author": "Mid-WorldWanderer",
          "body": "Jeez I totally feel you, I always feel the same. It's like \"mmmh I'd kill for a 600 kcals Big Mac, too bad my eating day would be basically over then\"",
          "created_utc": 1724962166.0
        },
        {
          "id": "lkmg29j",
          "author": "No_Belt7130",
          "body": "exactly…when I see some of my friends just mindlessly snacking a bag full of 400kcal chips and then eating their lunch I think „woah that is half my daily kcals“ and thats so silly",
          "created_utc": 1724992422.0
        }
      ]
    },
    {
      "id": "lkyq7lj",
      "author": "DowntownCarob",
      "body": "Yep me watching my boyfriend make his nachos and mentally tallying up the calories as he pours sour cream and avocado and cheese on them with reckless abandon",
      "created_utc": 1725182723.0,
      "score": 2,
      "context": [
        {
          "id": "lkk5wsz",
          "author": "Mid-WorldWanderer",
          "body": "Jeez I totally feel you, I always feel the same. It's like \"mmmh I'd kill for a 600 kcals Big Mac, too bad my eating day would be basically over then\"",
          "created_utc": 1724962166.0
        },
        {
          "id": "lkmg29j",
          "author": "No_Belt7130",
          "body": "exactly…when I see some of my friends just mindlessly snacking a bag full of 400kcal chips and then eating their lunch I think „woah that is half my daily kcals“ and thats so silly",
          "created_utc": 1724992422.0
        }
      ]
    },
    {
      "id": "lkmg869",
      "author": "No_Belt7130",
      "body": "wow, good to know there is hope! haha",
      "created_utc": 1724992507.0,
      "score": 3,
      "context": [
        {
          "id": "lkl1ys6",
          "author": "Organic_Werewolf_317",
          "body": "Honestly, it really does fade over time. I thought I would never be able to forget the calories in certain foods. I first went to inpatient treatment three years ago. Last month, I was cutting an avocado and was struck by the thought that I could no longer remember how many calories were in the average avocado. I could make guesses, but I wasn’t certain. I didn’t Google it to check. I just took the win and enjoyed the avocado. \n\nIt takes a lot of time and patience, but like any skill, it you don’t use it, you lose it. I stopped letting myself play the guessing game, trying to calculate the caloric value of any meal or snack. I hope you’re able to enjoy the foods you love someday, without any guilt, shame, or memorized nutrition facts getting in the way.",
          "created_utc": 1724972600.0
        },
        {
          "id": "lkli56r",
          "author": "harmonystar19",
          "body": "I was going to say the same thing that it just takes time. It’s now 12 years of recovery and I honestly don’t remember the calories of anything!",
          "created_utc": 1724978493.0
        }
      ]
    },
    {
      "id": "lkryw0f",
      "author": "Organic_Werewolf_317",
      "body": "I cannot stress this enough: I really, really did not think I would ever get better, and I didn’t believe anyone who told me otherwise. Even sitting here and writing this now, I’m in disbelief. I’m eating a second serving of dinner because I was still hungry, I’ve got an angel food cake in the oven (which I will enjoy with zero guilt), and I have absolutely no idea what I weigh.  \n\nRecovery isn’t linear. It’s been 8 years since I first admitted I had an eating disorder, and I was back in residential treatment last year. I’ve got a long ways to go before I’ll feel fully recovered, but I finally feel like I am IN recovery. There’s good days and bad days, good months and bad months, but it would take more effort to go back into my ED now than it would to keep going. \n\nBe gentle with yourself. Celebrate every milestone, no matter how small it seems. Keep going. You’ll get there.",
      "created_utc": 1725072617.0,
      "score": 2,
      "context": [
        {
          "id": "lkl1ys6",
          "author": "Organic_Werewolf_317",
          "body": "Honestly, it really does fade over time. I thought I would never be able to forget the calories in certain foods. I first went to inpatient treatment three years ago. Last month, I was cutting an avocado and was struck by the thought that I could no longer remember how many calories were in the average avocado. I could make guesses, but I wasn’t certain. I didn’t Google it to check. I just took the win and enjoyed the avocado. \n\nIt takes a lot of time and patience, but like any skill, it you don’t use it, you lose it. I stopped letting myself play the guessing game, trying to calculate the caloric value of any meal or snack. I hope you’re able to enjoy the foods you love someday, without any guilt, shame, or memorized nutrition facts getting in the way.",
          "created_utc": 1724972600.0
        },
        {
          "id": "lkpwe07",
          "author": "Gloomystars",
          "body": "Comments like these as I’m in recovery have me really hopeful. Sometimes especially when I have setbacks, it feels like I’ll never get better. But I think I just need to give it time.",
          "created_utc": 1725045299.0
        }
      ]
    },
    {
      "id": "lkn7g1s",
      "author": "YurinaAbbieLing",
      "body": "I’ll be rooting for you! 💪🏻",
      "created_utc": 1725009203.0,
      "score": 1,
      "context": [
        {
          "id": "lkl8qyf",
          "author": "YurinaAbbieLing",
          "body": "Well for me the numbers still float around from time to time but it will disappear when you don’t really think about food. For instance you can try food you’ve never had before or never had during the “losing weight phase”. And everything takes time okay? It’s alright. Believe me you’re not alone in this fight.🫂\n\nPs. I’m not an expert or anything. I’m just another victim of this god forsaken illness.",
          "created_utc": 1724975047.0
        },
        {
          "id": "lkmggkq",
          "author": "No_Belt7130",
          "body": "thank you 🫂\nmaybe someday in the next few weeks I will try to find something small and „easy“ to eat, without knowing the kalories",
          "created_utc": 1724992626.0
        }
      ]
    },
    {
      "id": "lknh12v",
      "author": "wavythewonderpony",
      "body": "EDNOS is eating disorder not otherwise specified. This is the catch-all diagnosis for many of us with disordered eating. It helps to recall that the definitions of anorexia, bulimia, and orthoexia are calculated rubrics made for psychologists and insurance companies. In reality, many people have eating disorders, but they do not fit the official definitions. For example, there are many folk who are restricting but do not have a low bmi. \n\nPlease hold yourself carefully. Look into resources for intuitive eating.",
      "created_utc": 1725015042.0,
      "score": 2,
      "context": [
        {
          "id": "lkmb89j",
          "author": "siggarette",
          "body": "I counted every calorie for almost 10 years. Literally everything down to vitamins and gum. I'm happy to say i am fully recovered now and haven't counted calories in about 5 years. \n\nWhat helped me stop was going out to eat more. Cooking and eating with friends. Eating with people in general is a good distraction. And at home make more meals that are just stuff pre mixed together so you don't know sure like chili or something. your knowledge of calories will fade over time. \n\nYou got this. It's possible. I don't reply to a lot of things on Reddit but when i see someone doubting they can recover from an ED......i gotta chime in and let you know no matter how deep you're in it it's possible to get out.",
          "created_utc": 1724990087.0
        },
        {
          "id": "lkmi2ei",
          "author": "No_Belt7130",
          "body": "+ also, you calling it an ED somehow made me feel better (?) because the silly online tests „only“ said „disordered eating habits“ but I thought it was more serious than that. At the same time, though, I always think „you can‘t call this an ED…it isn‘t bad enough for that“ but at this point…I think you‘re right",
          "created_utc": 1724993459.0
        }
      ]
    },
    {
      "id": "lkpvdq6",
      "author": "Julietjane01",
      "body": "Try taking small steps. You can get there!",
      "created_utc": 1725044968.0,
      "score": 2,
      "context": [
        {
          "id": "lkmbr5e",
          "author": "Julietjane01",
          "body": "You pretty much can’t but you can not look on the label to confirm. No confirming what you think you already know. Start with that and you’ll find maybe that the issue is more than knowing what it says. Of course things like fruit and vegetables you’ll likely always know but you don’t really need to eat those things plain. For example you could put pb on a banana without measuring peanut butter and if you feel yourself limiting yourself, you need to take an extra scoop. I have been recovered for 4 years now and if I look it’s because I want to make sure it’s enough calories not too many. I eat meals that have a very formerly scary number on the front and eat it with something on the side. I eat the stuff at restaurants regardless of calories. Actually if I ever catch myself comparing calories between dishes I’ll intentionally have whichever one is greater. Basically you have that information but it doesn’t have to stop you.",
          "created_utc": 1724990331.0
        },
        {
          "id": "lkmh88m",
          "author": "No_Belt7130",
          "body": "wow that sounds great actually\nhopefully one day I‘ll get there",
          "created_utc": 1724993023.0
        }
      ]
    },
    {
      "id": "lkqf42t",
      "author": "enord11400",
      "body": "TBH what helped me the most was making friends with someone who likes to eat out often and wanting to spend time with them badly enough that I chose that over my ED. (This is related to my personal feelings on calories and restaurants which I won't get into here.) That's not exactly helpful as a tip but the bottom line is I found something that mattered more to me. That makes it sound a lot easier than it was. There was also tons of therapy, SSRIs, and crying. \n\nI wish I had a quick way to help you. Good luck.",
      "created_utc": 1725051424.0,
      "score": 2,
      "context": [
        {
          "id": "lkmeity",
          "author": "enord11400",
          "body": "After counting calories for close to a decade while still indulging my eating disorder, once I got to a good place and wanted to leave it behind it took about 5 years to start forgetting a lot of calorie counts. I haven't forgotten them all but they don't pop out of my brain every time I'm trying to decide what to eat like they used to. I can choose to pay attention to them or not when the information is presented to me. YMMV but it is possible to forget at least some of it. \n\nEarly on I just had to go for a \"feel the fear and do it anyway\" type approach. That involved a lot of freaking out but that was unavoidable. It will be hard to avoid this information completely in the future so you have to learn to cope with knowing it.",
          "created_utc": 1724991654.0
        },
        {
          "id": "lkmhdtk",
          "author": "No_Belt7130",
          "body": "and how do I do the „cope with knowing it“-part? do you have any tips? \nalso I am glad you got better",
          "created_utc": 1724993102.0
        }
      ]
    },
    {
      "id": "lko3may",
      "author": "EmLee-96",
      "body": "Right? Hahaha I've already memorized the calories for the foods I eat regularly. My mind is like a steel trap for those! Other important things? Not so much.",
      "created_utc": 1725024539.0,
      "score": 3,
      "context": [
        {
          "id": "lklwh1w",
          "author": "EmLee-96",
          "body": "I told my disordered eating therapist that my goal was to not count calories and she laughed (kindly) and was like \"oh sweetie it'll be years before you can stop that\". She's working with me to disregard the 2000 calorie/day recommendation. It's been a big thing for me because I think I need to stay under that and that really isn't a lot of food. She's currently one of the top in our area (I'm very fortunate to even get 40 minutes of her time) and thinks the calorie reccomendation will be obsolete within the next decade, just like the food pyramid isn't a thing anymore.",
          "created_utc": 1724983856.0
        },
        {
          "id": "lkmgnsn",
          "author": "No_Belt7130",
          "body": "wow thats amazing…but that is also a lot of time 😅🥲 I wish there was a simple switch in my head, to turn it off haha",
          "created_utc": 1724992729.0
        }
      ]
    },
    {
      "id": "lkyu6re",
      "author": "Happy_Cap7935",
      "body": "<3",
      "created_utc": 1725185396.0,
      "score": 2,
      "context": [
        {
          "id": "lkytvk6",
          "author": "Happy_Cap7935",
          "body": "Read ‘eating in the light of the moon’ - it’ll help give you a different perspective",
          "created_utc": 1725185188.0
        },
        {
          "id": "lkyu3rf",
          "author": "No_Belt7130",
          "body": "okay thank you :)",
          "created_utc": 1725185341.0
        }
      ]
    },
    {
      "id": "lkmqyw8",
      "author": "Professional_Stay_46",
      "body": "I don't know your story so I can't possibly understand how you got to this point, so I can't tell you what's going to break your chain, your cravings may or may not be psychological.\n\nIt's usually both.",
      "created_utc": 1724998507.0,
      "score": 2,
      "context": [
        {
          "id": "lklnuw0",
          "author": "Professional_Stay_46",
          "body": "That doesn't sound like a problem, but a symptom.\nIt's about what makes you feel that way about high calories.\n\nYou are not gonna get fat, or you are going to get fat based on calories, so what really bothers you is gaining weight.",
          "created_utc": 1724980583.0
        },
        {
          "id": "lkmgilu",
          "author": "No_Belt7130",
          "body": "yes, I guess it is",
          "created_utc": 1724992654.0
        }
      ]
    },
    {
      "id": "lkqgxvp",
      "author": "harmonystar19",
      "body": "There is absolutely hope! :) you got this!",
      "created_utc": 1725052043.0,
      "score": 2,
      "context": [
        {
          "id": "lkl1ys6",
          "author": "Organic_Werewolf_317",
          "body": "Honestly, it really does fade over time. I thought I would never be able to forget the calories in certain foods. I first went to inpatient treatment three years ago. Last month, I was cutting an avocado and was struck by the thought that I could no longer remember how many calories were in the average avocado. I could make guesses, but I wasn’t certain. I didn’t Google it to check. I just took the win and enjoyed the avocado. \n\nIt takes a lot of time and patience, but like any skill, it you don’t use it, you lose it. I stopped letting myself play the guessing game, trying to calculate the caloric value of any meal or snack. I hope you’re able to enjoy the foods you love someday, without any guilt, shame, or memorized nutrition facts getting in the way.",
          "created_utc": 1724972600.0
        },
        {
          "id": "lkli56r",
          "author": "harmonystar19",
          "body": "I was going to say the same thing that it just takes time. It’s now 12 years of recovery and I honestly don’t remember the calories of anything!",
          "created_utc": 1724978493.0
        },
        {
          "id": "lkmg869",
          "author": "No_Belt7130",
          "body": "wow, good to know there is hope! haha",
          "created_utc": 1724992507.0
        }
      ]
    },
    {
      "id": "lknbln7",
      "author": "No_Belt7130",
      "body": "thank you 🙏💪",
      "created_utc": 1725011889.0,
      "score": 1,
      "context": [
        {
          "id": "lkl8qyf",
          "author": "YurinaAbbieLing",
          "body": "Well for me the numbers still float around from time to time but it will disappear when you don’t really think about food. For instance you can try food you’ve never had before or never had during the “losing weight phase”. And everything takes time okay? It’s alright. Believe me you’re not alone in this fight.🫂\n\nPs. I’m not an expert or anything. I’m just another victim of this god forsaken illness.",
          "created_utc": 1724975047.0
        },
        {
          "id": "lkmggkq",
          "author": "No_Belt7130",
          "body": "thank you 🫂\nmaybe someday in the next few weeks I will try to find something small and „easy“ to eat, without knowing the kalories",
          "created_utc": 1724992626.0
        },
        {
          "id": "lkn7g1s",
          "author": "YurinaAbbieLing",
          "body": "I’ll be rooting for you! 💪🏻",
          "created_utc": 1725009203.0
        }
      ]
    },
    {
      "id": "lko2hdk",
      "author": "No_Belt7130",
      "body": "ah yes I have heard of it but never thought I had it…thank you for explaining it :)",
      "created_utc": 1725024132.0,
      "score": 1,
      "context": [
        {
          "id": "lkmb89j",
          "author": "siggarette",
          "body": "I counted every calorie for almost 10 years. Literally everything down to vitamins and gum. I'm happy to say i am fully recovered now and haven't counted calories in about 5 years. \n\nWhat helped me stop was going out to eat more. Cooking and eating with friends. Eating with people in general is a good distraction. And at home make more meals that are just stuff pre mixed together so you don't know sure like chili or something. your knowledge of calories will fade over time. \n\nYou got this. It's possible. I don't reply to a lot of things on Reddit but when i see someone doubting they can recover from an ED......i gotta chime in and let you know no matter how deep you're in it it's possible to get out.",
          "created_utc": 1724990087.0
        },
        {
          "id": "lkmi2ei",
          "author": "No_Belt7130",
          "body": "+ also, you calling it an ED somehow made me feel better (?) because the silly online tests „only“ said „disordered eating habits“ but I thought it was more serious than that. At the same time, though, I always think „you can‘t call this an ED…it isn‘t bad enough for that“ but at this point…I think you‘re right",
          "created_utc": 1724993459.0
        },
        {
          "id": "lknh12v",
          "author": "wavythewonderpony",
          "body": "EDNOS is eating disorder not otherwise specified. This is the catch-all diagnosis for many of us with disordered eating. It helps to recall that the definitions of anorexia, bulimia, and orthoexia are calculated rubrics made for psychologists and insurance companies. In reality, many people have eating disorders, but they do not fit the official definitions. For example, there are many folk who are restricting but do not have a low bmi. \n\nPlease hold yourself carefully. Look into resources for intuitive eating.",
          "created_utc": 1725015042.0
        }
      ]
    },
    {
      "id": "lkpvwdj",
      "author": "No_Belt7130",
      "body": "thank you :) I‘ll try",
      "created_utc": 1725045139.0,
      "score": 2,
      "context": [
        {
          "id": "lkmbr5e",
          "author": "Julietjane01",
          "body": "You pretty much can’t but you can not look on the label to confirm. No confirming what you think you already know. Start with that and you’ll find maybe that the issue is more than knowing what it says. Of course things like fruit and vegetables you’ll likely always know but you don’t really need to eat those things plain. For example you could put pb on a banana without measuring peanut butter and if you feel yourself limiting yourself, you need to take an extra scoop. I have been recovered for 4 years now and if I look it’s because I want to make sure it’s enough calories not too many. I eat meals that have a very formerly scary number on the front and eat it with something on the side. I eat the stuff at restaurants regardless of calories. Actually if I ever catch myself comparing calories between dishes I’ll intentionally have whichever one is greater. Basically you have that information but it doesn’t have to stop you.",
          "created_utc": 1724990331.0
        },
        {
          "id": "lkmh88m",
          "author": "No_Belt7130",
          "body": "wow that sounds great actually\nhopefully one day I‘ll get there",
          "created_utc": 1724993023.0
        },
        {
          "id": "lkpvdq6",
          "author": "Julietjane01",
          "body": "Try taking small steps. You can get there!",
          "created_utc": 1725044968.0
        }
      ]
    },
    {
      "id": "lksxxwi",
      "author": "No_Belt7130",
      "body": "thank you :) I will try my best",
      "created_utc": 1725092382.0,
      "score": 1,
      "context": [
        {
          "id": "lkmeity",
          "author": "enord11400",
          "body": "After counting calories for close to a decade while still indulging my eating disorder, once I got to a good place and wanted to leave it behind it took about 5 years to start forgetting a lot of calorie counts. I haven't forgotten them all but they don't pop out of my brain every time I'm trying to decide what to eat like they used to. I can choose to pay attention to them or not when the information is presented to me. YMMV but it is possible to forget at least some of it. \n\nEarly on I just had to go for a \"feel the fear and do it anyway\" type approach. That involved a lot of freaking out but that was unavoidable. It will be hard to avoid this information completely in the future so you have to learn to cope with knowing it.",
          "created_utc": 1724991654.0
        },
        {
          "id": "lkmhdtk",
          "author": "No_Belt7130",
          "body": "and how do I do the „cope with knowing it“-part? do you have any tips? \nalso I am glad you got better",
          "created_utc": 1724993102.0
        },
        {
          "id": "lkqf42t",
          "author": "enord11400",
          "body": "TBH what helped me the most was making friends with someone who likes to eat out often and wanting to spend time with them badly enough that I chose that over my ED. (This is related to my personal feelings on calories and restaurants which I won't get into here.) That's not exactly helpful as a tip but the bottom line is I found something that mattered more to me. That makes it sound a lot easier than it was. There was also tons of therapy, SSRIs, and crying. \n\nI wish I had a quick way to help you. Good luck.",
          "created_utc": 1725051424.0
        }
      ]
    },
    {
      "id": "lksxuy0",
      "author": "No_Belt7130",
      "body": "thank you!",
      "created_utc": 1725092328.0,
      "score": 1,
      "context": [
        {
          "id": "lkl1ys6",
          "author": "Organic_Werewolf_317",
          "body": "Honestly, it really does fade over time. I thought I would never be able to forget the calories in certain foods. I first went to inpatient treatment three years ago. Last month, I was cutting an avocado and was struck by the thought that I could no longer remember how many calories were in the average avocado. I could make guesses, but I wasn’t certain. I didn’t Google it to check. I just took the win and enjoyed the avocado. \n\nIt takes a lot of time and patience, but like any skill, it you don’t use it, you lose it. I stopped letting myself play the guessing game, trying to calculate the caloric value of any meal or snack. I hope you’re able to enjoy the foods you love someday, without any guilt, shame, or memorized nutrition facts getting in the way.",
          "created_utc": 1724972600.0
        },
        {
          "id": "lkli56r",
          "author": "harmonystar19",
          "body": "I was going to say the same thing that it just takes time. It’s now 12 years of recovery and I honestly don’t remember the calories of anything!",
          "created_utc": 1724978493.0
        },
        {
          "id": "lkmg869",
          "author": "No_Belt7130",
          "body": "wow, good to know there is hope! haha",
          "created_utc": 1724992507.0
        },
        {
          "id": "lkqgxvp",
          "author": "harmonystar19",
          "body": "There is absolutely hope! :) you got this!",
          "created_utc": 1725052043.0
        }
      ]
    }
  ]
}