{
  "id": "1f3yqs9",
  "subreddit": "EatingDisorders",
  "author": "LightCold5957",
  "created_utc": 1724926298.0,
  "title": "I feel like no one cares",
  "selftext": "Hi, I know this is a mega stupid pick-me thing to say. But I feel like no one cares. I have told three people that I am in eating disorder recovery, and so far I have not heard anything or received any support. All one person has said so far is \"I look healthy.\". While it was with good intentions, all it did was make me spiral.\n\nI feel like if one of my friends was in eating disorder recovery, I would be checking on them, u know. I'm so petrified that I made a mistake by telling them or they are telling other people. And knowing them, unfortunately, I don't think that this is out of the picture.\n\nI know how awful people can be when they learn about people's eating disorders, particularly if they don't look like the typical type. One of my friends had already told someone else about my issues while I was standing next to them. I was so ashamed. I regret my decision to ask for help. Whenever I reach out, it only backfires.\n\nPeople only started caring about my issues when I became underweight. It's hard to trust people now, and the only people who are supporting me are the ones that I pay (Dietician, psychologist etc.) T\n\nThey're not my real friends I know that but I had no one else to talk to and I needed to give them some sort of explanation for why I was acting so strange otherwise, they would never talk to me again. I would rather have shit friends than be alone. I feel more lonely than ever, and I know that I'm not but I just want to feel cared for. It's so incredibly hard for me to make and sustain friendships. I'm just really lost right now.psychologist,",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1f3yqs9/i_feel_like_no_one_cares/",
  "score": 65,
  "num_comments": 26,
  "comments": [
    {
      "id": "lkhoms9",
      "author": "Blyxons",
      "body": "Honestly, it might just be the case of people not knowing what to say. It's the same with any illness when you get sick, people want to be supportive and caring but they're not quite sure how - do they pretend it's not happening and treat the person as they normally would? Or do they ask questions, talk about it and shower the person in compliments and love?\n\nIt's hard, because you don't know how the person who is sick will react or what they need in that second. Everyone is different.\n\nIt could also be the fact it's about your weight too. Weight in general is a sensitive topic. You say someone looks healthy and like you said, you could make that person spiral. You say they look skinny and you've just encouraged that person to continue their ED ways because they thrive on compliments.\n\nIn my opinion, continue with your recovery and remember that not everyone understands this journey. If you feel that your friends aren't being helpful or are making your progress more difficult then don't be afraid to distance yourself or cut them out completely. This is your life and you are in control.",
      "created_utc": 1724933811.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lkhsx1v",
      "author": "MoulinSarah",
      "body": "This is so real. I feel this with my soul.",
      "created_utc": 1724935533.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lkibqab",
      "author": "meta_muse",
      "body": "People don’t understand friend. I’ve had the same thing happen to me. Unfortunately this is a topic where the best support are those who have been through it as well.",
      "created_utc": 1724941934.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lkhuah3",
      "author": "Upstairs-Mongoose228",
      "body": "This is a completely valid feeling!! I think a large part of it can be that people don’t know how to react/what to say since it can be a very sensitive issue :)",
      "created_utc": 1724936048.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lkih52j",
      "author": "Born-Island7766",
      "body": "I understand that. Before recovery and when I first began recovery, all my family had to say was comments about how I looked sick and they were worried. My mother warned them not to comment on my body or my food intake and since then, I’ve relapsed a few times and gotten back on the recovery train and each time, it seems no one can even utter a word about being proud or supportive. They just scold me for voicing my what the ED brain is telling me, when all I want is someone to talk it through with me that isn’t a doctor of some kind.\n\nA lot of the time they don’t know what to say, which makes sense. It’s a super sensitive thing and any wrong sentence can send me spiralling, but at the same time I wish I could just have their unconditional support and have it be out in the open.\n\nRecovery feels super lonely even though I have my medical support system, so I understand where you’re coming from",
      "created_utc": 1724943605.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lkjd5pt",
      "author": "WhatEverWorksMan5",
      "body": "hey! it’s such a tough time when people we care about react this way, and I’m sorry this is what you’re experiencing.\n\ni would suggest thinking well before telling someone, and also thinking about what you want out of the conversation. how would you want someone to react, and do you think the person you’ve decided to share this with will be able to give it to you?\nthis way, next time you take the hard step to tell someone about your struggles, you’ll have a bit more control over how the situation goes, and you might be a bit better prepared for it as well.\n\nwhat can go a long way too, is telling them after the fact. “hey, i decided to be vulnerable with you about this, and when you said X, it made me feel Y because Z. how do you see this?”.\nlike many commenters said before, often people don’t know how to react. give them a second change, it might not be intentional :)",
      "created_utc": 1724953279.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lkhrfgd",
      "author": "robertsbrothers",
      "body": "Try joining a support group like EDA or OA. Or find something else local.\n\nAlso, it seems like loneliness/attention is an issue to discuss with a psychologist. A lot of our issues stem from things we don’t even pinpoint. None of your friends will be the one who continues your recovery, it’s you. Take this time to journal and reflect on yourself.",
      "created_utc": 1724934952.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkkivtx",
      "author": "ContributionNeat6181",
      "body": "A lot of people don’t know what to say. That doesn’t make it right even now after 38 years and being in recovery for a year my boyfriend still says the wrong thing all the time. The most important thing is you be healthy for you! I lost a lot of weight recently due to an illness and I was severely underweight and people kept telling me I looked great. You know when you’re healthy and when you’re not, there are some great support groups that are free online. Please feel free to reach out if you want more information. A lot of them are by age or by ED type.",
      "created_utc": 1724966156.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkl0amg",
      "author": "Regina_Lee1",
      "body": "I am so sorry you are going through this. It can be hard to trust people, especially when you are dealing with an ED. I remember from the time when I suffered from ED, I had changed schools and didn’t have any friends there, it was hard in the beginning because I didn’t want people to know what I was going through. Do not be afraid while you are going through this trial. Give yourself time to recover and when the right time comes, you will find some true friends. I hope you will be able to overcome all of this.",
      "created_utc": 1724972007.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkmu8qv",
      "author": "None",
      "body": "I think it’s just the fact that people don’t seem to understand eating disorders if they don’t have one. They can’t fathom having a fucked up relationship with food. Your a considerate person it seems like, tell your friends this is something you’re taking seriously, maybe they think your joking or half kidding",
      "created_utc": 1725000538.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lknse4l",
      "author": "None",
      "body": "First of all, I don't think it's \"pick me\", and you're allowed to want/need support and care!! That's normal!! I'm really sorry people aren't supporting you as much :(. As someone else on here said, it might be because people don't know what to say? But nonetheless, I understand it's difficult on an emotional level. Please keep recovering, even if you don't get the support from your friends <3 Do you think you could tell them honestly how you feel?",
      "created_utc": 1725020292.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lkt5al4",
      "author": "boyfriendaudio",
      "body": "just letting you know i feel the exact same but i’m proud of you for being in recovery!!",
      "created_utc": 1725097440.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lla8td9",
      "author": "JeffreyFarmer",
      "body": "I told my best friend about my ED. All she said was “oh anorexia? I feel like I have that too sometimes, I guess”. I actually thought I was going to cry, I felt so alone and regretted telling her. A few months later she told me she wanted to kill herself, and I was just speechless, even though I cared and was so worried for her. You’re friends love you so much, they just didn’t want to say anything that would make you upset, and probably chose the safest option. If you really feel like you need to spill your guts, I’d recommend counselling. I don’t listen to any of my therapist’s advice, I just use the promised anonymity to completely spill everything and let it out without feeing paranoid about it.",
      "created_utc": 1725359197.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lks23xn",
      "author": "deaddollyhaze",
      "body": "You are brave and beautiful. 💛🌻💜",
      "created_utc": 1725074061.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ll117x4",
      "author": "Happy_Cap7935",
      "body": "Trust me it’s more lonely having sh*t friends. Find an in person eating disorder support group and make new friends that way. If not I person then online",
      "created_utc": 1725216026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m74o5jw",
      "author": "GbS121212",
      "body": "Most people have their own stuff going on and don't really care. It's both a blessing (freedom!) and a curse (you're not the main character in other people's life).\n\nThe trap, here, is using your weight to communicate with others. Being underweight to show you're not ok, to force others - doctors, friends, family - to care. You have to learn to use words instead, to fight for yourself, and accept that easy access to attention and healthcare isn't worth risking your life.\n\nI'm absolutely not saying that anorexia is about getting attention. I'm saying that navigating the moment when you're not severely underweight anymore, and people start thinking you're alright when you're not, when the situation isn't so dire anymore medically speaking so suddenly having access to quality care becomes difficult- that moment is weird, and can push people in the direction of a relapse.\n\nYou need help, care, then ask for it. Demand it. \n\n I hope I managed to convey what I wanted to, without being mean or offensive. Sending only good vibes.",
      "created_utc": 1736876057.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lkhy8oo",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1724937466.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lkjy71i",
      "author": "_midnights_",
      "body": "Why does it matter if no one cares? R u doing it for attention?",
      "created_utc": 1724959794.0,
      "score": -1,
      "context": []
    },
    {
      "id": "lklc5th",
      "author": "LightCold5957",
      "body": "Thanks! Never talking to them again!",
      "created_utc": 1724976300.0,
      "score": 3,
      "context": [
        {
          "id": "lkhoms9",
          "author": "Blyxons",
          "body": "Honestly, it might just be the case of people not knowing what to say. It's the same with any illness when you get sick, people want to be supportive and caring but they're not quite sure how - do they pretend it's not happening and treat the person as they normally would? Or do they ask questions, talk about it and shower the person in compliments and love?\n\nIt's hard, because you don't know how the person who is sick will react or what they need in that second. Everyone is different.\n\nIt could also be the fact it's about your weight too. Weight in general is a sensitive topic. You say someone looks healthy and like you said, you could make that person spiral. You say they look skinny and you've just encouraged that person to continue their ED ways because they thrive on compliments.\n\nIn my opinion, continue with your recovery and remember that not everyone understands this journey. If you feel that your friends aren't being helpful or are making your progress more difficult then don't be afraid to distance yourself or cut them out completely. This is your life and you are in control.",
          "created_utc": 1724933811.0
        }
      ]
    },
    {
      "id": "lkkgxk0",
      "author": "Both_Date400",
      "body": "This is so true. I used to be made to feel like I was too heavy compared to other girls my age, went through a spiral with Ed and became obsessed. I knew it was wrong and even tried going to one of my math teachers to talk about how counting calories made me sooo much better at math, as a sort of cry for help? I guess? I have in the past 15 years become more comfy in my body but now feel too scrawny. And it makes me self conscious when people comment on how skinny I am, even in a non judgmental way, despite being really proud to put on the pounds and having a good relationship with food. I've recently had some health issues which has led to a decline in weight and now I feel unconfident again despite the part of my brain that says \"you're skinny now\" and I detest that because I want to get over that period of my life. I recognize it'll always be there but it's still frustrating. Good luck every one here on your journey, you're all beautiful in all shapes and sizes 🥰🥰",
      "created_utc": 1724965537.0,
      "score": 2,
      "context": [
        {
          "id": "lkhoms9",
          "author": "Blyxons",
          "body": "Honestly, it might just be the case of people not knowing what to say. It's the same with any illness when you get sick, people want to be supportive and caring but they're not quite sure how - do they pretend it's not happening and treat the person as they normally would? Or do they ask questions, talk about it and shower the person in compliments and love?\n\nIt's hard, because you don't know how the person who is sick will react or what they need in that second. Everyone is different.\n\nIt could also be the fact it's about your weight too. Weight in general is a sensitive topic. You say someone looks healthy and like you said, you could make that person spiral. You say they look skinny and you've just encouraged that person to continue their ED ways because they thrive on compliments.\n\nIn my opinion, continue with your recovery and remember that not everyone understands this journey. If you feel that your friends aren't being helpful or are making your progress more difficult then don't be afraid to distance yourself or cut them out completely. This is your life and you are in control.",
          "created_utc": 1724933811.0
        }
      ]
    },
    {
      "id": "lkkl87u",
      "author": "a-nonna-nonna",
      "body": "Sometimes your support crew (family and friends) have seen you struggle for a long time. Maybe they tried to be supportive earlier but you didn’t respond or they just aren’t sure what to do. \n\nPlease try asking specifically for the support you need. “Hey I’m really churning and it would help me so much if you could just listen (not problem solve) for 20 mins.” \n\nYes we support staff are this confused. We need directions.\n\nFrom the outside, eating disorders are angry, explosive, isolating, and anti-social. We have learned to tip-toe around you. We love you so much and want that old easy way of interacting. Help us find it.",
      "created_utc": 1724966905.0,
      "score": 3,
      "context": [
        {
          "id": "lkih52j",
          "author": "Born-Island7766",
          "body": "I understand that. Before recovery and when I first began recovery, all my family had to say was comments about how I looked sick and they were worried. My mother warned them not to comment on my body or my food intake and since then, I’ve relapsed a few times and gotten back on the recovery train and each time, it seems no one can even utter a word about being proud or supportive. They just scold me for voicing my what the ED brain is telling me, when all I want is someone to talk it through with me that isn’t a doctor of some kind.\n\nA lot of the time they don’t know what to say, which makes sense. It’s a super sensitive thing and any wrong sentence can send me spiralling, but at the same time I wish I could just have their unconditional support and have it be out in the open.\n\nRecovery feels super lonely even though I have my medical support system, so I understand where you’re coming from",
          "created_utc": 1724943605.0
        }
      ]
    },
    {
      "id": "lklbyon",
      "author": "LightCold5957",
      "body": "I did think about telling them. Just regretting it.",
      "created_utc": 1724976225.0,
      "score": 1,
      "context": [
        {
          "id": "lkjd5pt",
          "author": "WhatEverWorksMan5",
          "body": "hey! it’s such a tough time when people we care about react this way, and I’m sorry this is what you’re experiencing.\n\ni would suggest thinking well before telling someone, and also thinking about what you want out of the conversation. how would you want someone to react, and do you think the person you’ve decided to share this with will be able to give it to you?\nthis way, next time you take the hard step to tell someone about your struggles, you’ll have a bit more control over how the situation goes, and you might be a bit better prepared for it as well.\n\nwhat can go a long way too, is telling them after the fact. “hey, i decided to be vulnerable with you about this, and when you said X, it made me feel Y because Z. how do you see this?”.\nlike many commenters said before, often people don’t know how to react. give them a second change, it might not be intentional :)",
          "created_utc": 1724953279.0
        }
      ]
    },
    {
      "id": "lkse74a",
      "author": "LightCold5957",
      "body": "I'm not sure. I don't want them to feel like they're walking on eggshells around me, so I think for this situation it might just be better to go around acting like nothing's wrong. I told the wrong people and that's my mistake to live by. Just need to keep them close; otherwise they'll go spreading stuff around, unfortunately",
      "created_utc": 1725080088.0,
      "score": 2,
      "context": [
        {
          "id": "lknse4l",
          "author": "None",
          "body": "First of all, I don't think it's \"pick me\", and you're allowed to want/need support and care!! That's normal!! I'm really sorry people aren't supporting you as much :(. As someone else on here said, it might be because people don't know what to say? But nonetheless, I understand it's difficult on an emotional level. Please keep recovering, even if you don't get the support from your friends <3 Do you think you could tell them honestly how you feel?",
          "created_utc": 1725020292.0
        }
      ]
    },
    {
      "id": "llpa574",
      "author": "LightCold5957",
      "body": "So sorry your friend said that, and I hope you and her are doing okay! I'm in counselling right now, and so far its going really well! Thanks for ur comment",
      "created_utc": 1725574719.0,
      "score": 2,
      "context": [
        {
          "id": "lla8td9",
          "author": "JeffreyFarmer",
          "body": "I told my best friend about my ED. All she said was “oh anorexia? I feel like I have that too sometimes, I guess”. I actually thought I was going to cry, I felt so alone and regretted telling her. A few months later she told me she wanted to kill herself, and I was just speechless, even though I cared and was so worried for her. You’re friends love you so much, they just didn’t want to say anything that would make you upset, and probably chose the safest option. If you really feel like you need to spill your guts, I’d recommend counselling. I don’t listen to any of my therapist’s advice, I just use the promised anonymity to completely spill everything and let it out without feeing paranoid about it.",
          "created_utc": 1725359197.0
        }
      ]
    },
    {
      "id": "lksdw27",
      "author": "LightCold5957",
      "body": "Thankyou :)",
      "created_utc": 1725079921.0,
      "score": 2,
      "context": [
        {
          "id": "lks23xn",
          "author": "deaddollyhaze",
          "body": "You are brave and beautiful. 💛🌻💜",
          "created_utc": 1725074061.0
        }
      ]
    },
    {
      "id": "lksdvab",
      "author": "LightCold5957",
      "body": "I'll try :)",
      "created_utc": 1725079910.0,
      "score": 2,
      "context": [
        {
          "id": "lkhy8oo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1724937466.0
        }
      ]
    },
    {
      "id": "lklax6t",
      "author": "LightCold5957",
      "body": "I'm in recovery bro. I didn't tell anyone while I was struggling. I just need support through one of the hardest things I'm ever going through. It has nothing to do with attention. I don't want to feel alone anymore.",
      "created_utc": 1724975845.0,
      "score": 2,
      "context": [
        {
          "id": "lkjy71i",
          "author": "_midnights_",
          "body": "Why does it matter if no one cares? R u doing it for attention?",
          "created_utc": 1724959794.0
        }
      ]
    }
  ]
}