{
  "id": "1f7uyp8",
  "subreddit": "EatingDisorders",
  "author": "CheddarBreath",
  "created_utc": 1725352854.0,
  "title": "Empty fridge",
  "selftext": "I’m 16\n\nI’ve been to the hospital twice.\n\nI’ve noticed my mom has an eating disorder.\nIt’s taking an awful toll on me.\nShe compares everything, she has photos of me before being admitted to hospital. \nI hate eating with her, I can’t hide my intake and I wish I could. I hate how she can’t take her eyes off my body.\nI have nobody else, no other family. I don’t want to live like this.\n\nIncreasingly she’s been starting to leave the fridge empty for longer periods. I can’t take it. I’m so sad.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1f7uyp8/empty_fridge/",
  "score": 67,
  "num_comments": 13,
  "comments": [
    {
      "id": "llffir9",
      "author": "JeffreyFarmer",
      "body": "My best recommendation is to eat out with friends as much as possible. It feels super safe and honestly I've had great times even amidst the worst of my ED. If you don't have the money, ask your Mum for it. If she isn't giving you any other food you can seriously report her to CPS. You could even try get a retail job and invite friends there after your shifts. You could probably get discounts or free food.",
      "created_utc": 1725430832.0,
      "score": 24,
      "context": []
    },
    {
      "id": "llf2fks",
      "author": "Acrobatic_Act7531",
      "body": "if she's leaving the fridge empty, giving you no access to food, that is a huge problem. if you have an adult at school you can talk to (i saw you say you don't have other family), i would recommend letting them know. that would constitute a CPS call (which i understand is probably a terrifying thought) (if you're in the united states)",
      "created_utc": 1725423414.0,
      "score": 30,
      "context": []
    },
    {
      "id": "llf0tke",
      "author": "CakeDayOrDeath",
      "body": "I don't have advice, but I went through something similar as a kid (you can look at my post history if you want.)\n\nIf you ever just want to vent, you can message me.",
      "created_utc": 1725422613.0,
      "score": 8,
      "context": []
    },
    {
      "id": "llgdcfn",
      "author": "MummiesAreZombies",
      "body": "Firstly, this is a lot to be going through at 16. I developed my ED around that age but could not imagine what it would be like to have the manifestation of my eating disorder be the one to care for me. Take a deep breath and remember you have came this far and have more time to get better.\nI would go to your school counselor, they will contact the best authorities to assess your situation.\nAs for your mom. I don't know the extent, just what you hav told all of us, but it sounds like you two need to be separated for a while. If she's feeding off of you and not keeping food in the fridge then you need to tell a councelor that also.\nIt sounds like your situation could spiral before you can even blink your eyes. Especially if your mom is using you for thinspo...",
      "created_utc": 1725451726.0,
      "score": 3,
      "context": []
    },
    {
      "id": "llhmda5",
      "author": "xyzyie",
      "body": "Cases involving toxic family are the worst.\n\nFew suggestions:  \n1. I know it's hard, BUT NEVER take her seriously even if it means thinking of her as a fool or something mediocre, u must put yourself at 1 place.  \n2. Understand your mom a bit, she is mentally unwell and definitely puts her own complexions onto you, BUT she doesn't have the right to even when mentally unwell. U must depersonalize her somehow out of yourself but still have some care or something.  \n3. Not having food during adolescence can be extremely damaging, no question asked. Or if not enough to be damaging, mentally distressing. I advise you to eat out, with people u care or just buy some small cooking gadget and you can make yourself something outside. If money are the problem you could maybe have part time job.  \n4. What I'm writing for normal person may sound crazy, but you need to do anything to survive and be well.\n\n5. Maybe the most important point, confront your mother. You can scream u can do anything to make her \"AWAKE\" and aware , you can tell her you do care about her, but IF SHE IS THE ONE literally abusing her kid, u cannot have compassion towards her.\n\nPeople may say to report her, but I get ya, it is big problem, but maybe living in some foster care would be even worse. Don't forget that you're not alone and everything will be right eventually. I'm proud of you to just bear that, definitely takes balls.\n\nMaybe you don't have anyone in real life, but you still can have social community supporting you.\n\n**I wish you all the best.**",
      "created_utc": 1725467461.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lljmlgs",
      "author": "OwlConfident4370",
      "body": "I’m really sorry to hear you’re going through this. It sounds incredibly tough, and your feelings are completely valid.\n\nFirst, it’s important to prioritize your own well-being. If your mom’s behavior is affecting you this much, finding a trusted adult to talk to, like a school counselor or a teacher, can provide you with support and advice. They can help you find resources and possibly connect you with additional help.\n\nIt’s also important to take care of your own basic needs. If the fridge is often empty and it’s impacting your ability to eat properly, consider reaching out to community resources like food banks or local charities that can offer support.\n\nYou don’t have to go through this alone. Speaking to someone who can help you navigate this situation, whether it’s a counselor or another trusted adult, can make a big difference. You deserve support and care during this challenging time.",
      "created_utc": 1725491680.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llib07g",
      "author": "meta_muse",
      "body": "It’s the WORST feeling when someone is watching your intake and then at the same time… their intake is nonexistent. It’s like she’s projecting her disorder onto you. Dude I’m so sorry. My mom did a similar fucked up thing.\nWhen I was in HS I ended up staying with friends as much as I possibly could. It’s definitely better now that I’m an adult, as I moved across the country from her and we don’t speak at all. I’m technically in recovery and from what I’ve heard she hasn’t made the effort to heal at all. It is sad.",
      "created_utc": 1725475445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llkzu8p",
      "author": "Julietjane01",
      "body": "I am so sorry. As an adult I had an eating disorder and my 14 year old had one also. I could not help her or be a role model the way I was. I took recovery seriously and she did too. I had to go to residential for two months but I got better and she impressively recovered on her own. I had gotten her help (an Ed therapy and dietician ) but she hated it and she held anger towards me which I understood. That was 4 years ago. We are both doing great. She’s away at college now and we built back our relationship. Please tell your mom that her illness is hurting you and that you both need help. I hope she listens. The fridge should not be empty. That is horrible. Go to a trusted adult if she does not listen. So sorry you are going through this, keep the hope, it will get better, you just might have to advocate for yourself through you shouldn’t have to.",
      "created_utc": 1725511690.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llzfaj7",
      "author": "Lotsoflove711",
      "body": "Bless your dear heart.. a mother should be there to protect you.. keep you healthy and loved. I’m sorry you’re going through this trauma.",
      "created_utc": 1725730108.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmed9q5",
      "author": "Human_Limit5283",
      "body": "sounds like she has an ed also",
      "created_utc": 1725947637.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbzx2f4",
      "author": "None",
      "body": "Hope your ok",
      "created_utc": 1739185103.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lli682s",
      "author": "Ana_Coach",
      "body": "You didn’t mention why you’ve been to the hospital. Ed related?",
      "created_utc": 1725473771.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llfabsj",
      "author": "Theone-withthe-book",
      "body": "I second this but if you have access to any money can you try buying food when maybe she’s not home or at school or something?",
      "created_utc": 1725427690.0,
      "score": 9,
      "context": [
        {
          "id": "llf2fks",
          "author": "Acrobatic_Act7531",
          "body": "if she's leaving the fridge empty, giving you no access to food, that is a huge problem. if you have an adult at school you can talk to (i saw you say you don't have other family), i would recommend letting them know. that would constitute a CPS call (which i understand is probably a terrifying thought) (if you're in the united states)",
          "created_utc": 1725423414.0
        }
      ]
    }
  ]
}