{
  "id": "1fa1zep",
  "subreddit": "EatingDisorders",
  "author": "Important_Custard",
  "created_utc": 1725582371.0,
  "title": "I'm already dreading the holidays ",
  "selftext": "I know it's silly but I'm already dreading the holidays. I have come a long way but the holidays just feel like pure survival. \n\nMy dad is wonderful but he is the cause for my eating disorder. Growing up he always monitored what I ate. Or how much. Or expressed concern that I would gain weight. \n\nI can already feel the torture. The smell of good food that I worked hard to prepare. And then comes the indecisive torture if I will choose to eat any of it. If I dare. And then the comments from my family. Insinuating that I'm weird and why do I act like this. Which I get...but they have no idea what's going on behind the curtains. Half the time I'm just battling tears. I just hate it. All of it. \n\nI hope one day it will somehow get easier. Does anyone else dread the holidays?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1fa1zep/im_already_dreading_the_holidays/",
  "score": 41,
  "num_comments": 8,
  "comments": [
    {
      "id": "llrv060",
      "author": "Cornflakes-08",
      "body": "Man this came weirdly in a right time , today I’m going out with some friends to the mall and all I think about is the food , I’m just scared , and I don’t want anyone to notice , every since I woke up all I’m thinking about is the food , what a mess",
      "created_utc": 1725618557.0,
      "score": 6,
      "context": []
    },
    {
      "id": "llsqlub",
      "author": "emilyajackson",
      "body": "i’ve been thinking about this for the past couple days 😅 i’ve just recently developed my ed this year and just the thought of thanksgiving is giving me anxiety. i absolutely love the food but there’s no way im going to be able to bring myself to eat anymore than a couple bites. and no one even understands what im going through because everyone just keeps complimenting me on my weight loss so idk. i’m stressing lol",
      "created_utc": 1725632088.0,
      "score": 4,
      "context": []
    },
    {
      "id": "llrxcbv",
      "author": "xyzyie",
      "body": "Yea definitely there are many people that do and have it similar to you.  \nI can imagine how torteous it can be do be monitored and raise this way, literally i hate parents that do this, and think they're doing good thing. You could explain to them a bit how it is absolutely mind fucking and unhealthy telling your child this type of shit. IS IT THEIR BODY? Also you won't get fat after day week or month, you will get fat after quite bit of time while eating in moderate caloric surplus, so nothing to worry about.\n\nIf talking with them doesn't help or they don't listen sadly, you need to get trough it somehow, you can denigrate your parents in your how to be somehow like a fly just bzzzing around and being annoying, but you can live with it.  \nAbsolutely eat if you can, and do things that feel right. If you cannot live on your own or change your surroundings just get trough it, everything will be fine eventually.  \n  \nI really wish you all the best from my heart!!!",
      "created_utc": 1725619914.0,
      "score": 3,
      "context": []
    },
    {
      "id": "llsu8ab",
      "author": "Eastern_Bug5217",
      "body": "I’m so scared there’s liked 4 really big days of food in the form of holidays and also birthdays coming up AHHHHH",
      "created_utc": 1725633293.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lltwvc7",
      "author": "meta_muse",
      "body": "Ughhhhhhhhh don’t remind meeeee",
      "created_utc": 1725645626.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lluvedd",
      "author": "girldoll_guts",
      "body": "i was thinking the same thing. every year around the holidays i get so anxious. whether i eat it or not, i feel terrible either way, and its like living in my own little hell. \n\nyoure definitely not the only one who feels that way. i hope one day you can eat as much as you want during the holidays without any negative thoughts. :)",
      "created_utc": 1725656761.0,
      "score": 2,
      "context": []
    },
    {
      "id": "llwutdc",
      "author": "Royal-Ad-7987",
      "body": "I’m an eating disorder therapist. Holidays are really hard! Online support groups can be helpful. Do you have any?",
      "created_utc": 1725684852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "llx4iv9",
      "author": "bluebonic-plague",
      "body": "Oh yes, absolutely. I hate eating in front of family the most. I spent so many birthdays and parties starving because the idea of eating near them disgusts me. I feel you. And I'm Filipino so that means SO MANY FAMILY GATHERINGS and it's literally hell on earth.",
      "created_utc": 1725690580.0,
      "score": 1,
      "context": []
    }
  ]
}