{
  "id": "1fefzqn",
  "subreddit": "EatingDisorders",
  "author": "FelurianFaye",
  "created_utc": 1726075908.0,
  "title": "Help please.",
  "selftext": "I have a 16 year old son who I am starting to suspect has an eating disorder. He's lost a lost of weight in the past couple of months. He started going to the gym this past year as well, but he's not been going enough to lose the weight he has, in my opinion. \n\nI've also noticed that when he eats, he eats very quickly, then he goes to the restroom shortly after. I've recently noticed remnants of vomit in the toilets. \n\nI'm honestly scared and lost. I haven't approached him with this yet. I want to make sure when I do I am delicate and don't make it at all worse. I am signing him up for therapy as well. \n\nAny help at all on how to approach this would be greatly appreciated. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1fefzqn/help_please/",
  "score": 49,
  "num_comments": 20,
  "comments": [
    {
      "id": "lmqlx2q",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1726131958.0,
      "score": 35,
      "context": []
    },
    {
      "id": "lmpu0p8",
      "author": "Monsters97",
      "body": "Hi! Sorry you're going thru this, but glad you can recognize signs...I'm sorry for the \"novel\" & some graphic info, but this hits home & there are important things to know...\nI have a long history with Bulimia (31 yrs, off & on) & I didn't even see it in one of my daughter's at that age. Of course, I didn't have all the Dx's I finally have now, so there's A LOT I wasn't able to recognize. \nTell tale signs I know too well are the rapid weight loss,  the vomit remains, going straight to the bathroom or \"needing to take a shower\" right after dinner (in my teen years & some of my early adulthood) & possibly over exercising, but also, not eating a lot or at all in front of people, drinking a ton of fluids with meals, pretending to feel \"sick\" so needing the bathroom, toilet is clean after you come out and/or smells of perfumes or cleaning products, if he's doing this, you may still find vomit under the rim where you use a toilet brush if he's \"tried\" to clean the evidence, choking easily, food remnants coming up on their own because they're sitting in the esophagus, mouthwash, sore throats, cavities, tooth loss and one VERY noticeable one (depending on the consistency) are marks & or scabs on the knuckles- pointer, middle, ring fingers and VERY bad indigestion (which can lead to acid reflux & or a hiatal hernia (stomach sphincter no longer opens/closes properly & allowed stomach acid to come up into the esophagus & could lead to scarring or holes in the esophagus)\n\nI'm 43 now and I've probably done it a handful of times over a years time, I'm getting better, on my own, but it's a thought (more than an action) often. When I was 14, my mom threatened to put me in a hospital. That only made it worse & I became way more secretive. My ED comes from childhood trauma, undiagnosed ADHD that apparently made me even more likely than normal people to have addictions & of course my lack of self confidence & outside influence. \n\nIt's a VERY difficult & delicate thing to approach...I would recommend YOU speak to a medical Dr & a psychiatrist FIRST for professional advice. Aside from that, you could take him on a \"date\", somewhere he can't avoid the conversation. I would very gently start with asking (no accusational words) how he is, how's life, what's up? I have a 16 yr old now & my older children, I understand 16 is a hard age because nothing you say is right or is heard/taken to heart and you couldn't POSSIBLY understand because you're the parent & even less so if you're different genders. Tell him about the things you've noticed & that you are not accusing him you are only asking because you love him and care about his health. Even if he only hears part of what you're saying & maybe only agrees to see a counselor to start, that's progress. I hope this helps 🤞🏽💚",
      "created_utc": 1726114217.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lmqvts4",
      "author": "None",
      "body": "I don’t have advice on how to approach it but I can tell you what upset and triggered me from 14-30 while I suffered and that was-\n- comments on my weight (gain or loss)\n- the suggestion which I took as accusation about not eating enough or food missing or being sick (because I was in denial and also afraid to have to change)\n\nThings that helped were\n- conversation that were relatable like my mum speaking about feeling self conscious or how harsh societies expectations were\n- conversations about feeling out of control \n- conversations about wanting to look better but wanting the most out of life (my friends mother opened up about how her ED robbed her of so much of her young life due to restrictive social events and relationships then off her later years due to the health side effects)\n\nI don’t know if this helps at all but I know it will be a tough conversation and if they get defensive or angry please don’t take it personally or feel like you’ve failed.",
      "created_utc": 1726138436.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lmquz0l",
      "author": "Old-Friendship9613",
      "body": "Your instinct to address this early is spot-on. Before talking to him, it might help to learn more about eating disorders so you're well-informed. When you're ready to chat, find a quiet moment when you both have time. Start by sharing your observations using \"I\" statements - like \"I've noticed\" or \"I'm worried\" - and be specific about the changes you've seen in his eating habits and weight. Try to focus on his health rather than appearance. The key is to listen without judgment and let him know you're there to support him. It's a good move to arrange therapy, and you could also consider a check-up with his doctor. You could start the conversation like this: \"\\[Son's name\\], I've noticed some changes lately that have me worried. Can we talk about what's going on?\" Even just starting the recovery process takes time, so be patient and keep the lines of communication open. You're doing the right thing by addressing this - your son is lucky to have such a caring parent.",
      "created_utc": 1726137953.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lmqzzvi",
      "author": "Due_Improvement_6650",
      "body": "I’m 18 and i have restricting and binge-eating ed, along with occasional bulimia episodes (purging, fasting, etc.). My family has never noticed, and I think it’s because they don’t fully understand eating disorders. To them, you only seem sick if you’re deadly thin. I wish someone had talked to me sooner—maybe I wouldn’t be struggling as much.\n\nIf you’re worried about someone, it’s best to start by addressing your concerns directly. Tell him what you’ve noticed and give him a chance to respond. There are two possible outcomes: either he admits to having bulimia, or he says you’re overreacting and that he’s fine.\n\nIf he opens up about having bulimia, it becomes much easier to help him. You can support him by scheduling a visit with a psychologist, and if he’s resistant, give him time. Have a conversation with him yourself, explaining that he can still live a healthy lifestyle, lose weight, and work out without resorting to harmful habits. Share the side effects of bulimia, such as damage to his teeth, digestive issues, stomach aches, and acid reflux. And don’t forget to offer him a hug; emotional support is crucial.\n\nIf he insists that there’s no problem, keep an eye on him. If he continues these behaviors, approach him again and explain your concerns in a caring way.",
      "created_utc": 1726140621.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ln277y1",
      "author": "Great-Direction-6056",
      "body": "The thread has given you some good suggestions on dos and don'ts. It can be very very scary to see and suspect this as a parent, I want to take a moment to empathise with you. And especially that you've recognised this and take a step back to assess your next move... That can be very difficult to do. So hats off to you for that. My Mum at first acted out in fear (I didn't realise it was fear at the time, I thought I was just disappointing her). \n\nSome tips moving forward from my own experience.... \n\n1. A gentle conversation expressing concern. Be careful with this one, EDs are very secretive and they'll likely be denial and possibly going to more extreme lengths to hide his behaviours if ED thinks it's being noticed. Be aware of this. However, a conversation expressing concern, care and offering support can go a long way to connect back with him, even if the ED may not like it. \n\n\n2. I assume your son is still in education? It might be worth talking to someone at the school pastorally or the schools DSL about your concerns. They may be able to sign post to services. But most importantly, if you end up seeking therapy/support, being connected with the school in this way will help his recovery. They'll be able to keep an eye on his eating habits, but possibly even offer him a quiet place to eat meals when he begins recovery. I'd be reluctant to do this without his knowledge or before the wheels are turning in terms of accessing support, you don't want to heighten his feelings of feeling out of control or undermine trust too early on while he's still deep in ED mindset. However, he's likely skipping meals at school and having some contact with the school when recovery begins will be key in ensuring meal plans are followed and he's not hiding the fact he's skipping these meals.\n\n3. A big one! Research, read and access support for careers for loved ones with eating disorders. Most eating disorder services will offer carer support, as it's key in recovery, especially if the patient is under 18. I'd be mindful not to research to much directly on eating disorders, as it can be scary, and I think its designed to be scary to motivate those with EDs who are researching to seek support. But if you do research directly looking at resources for carers, this can be very helpful in guiding you how to navigate this and having conversations. There's some amazing books and courses out there - treading on eggshells and this book my mum was given to by the ED team really helped our relationship and ED heal - https://www.amazon.co.uk/Skills-based-Caring-Loved-Eating-Disorder/dp/1138826634?dplnkId=825bc73c-656e-49c3-a845-1580f9720a9c\n\nTry not accuse him of anything - the ED will bite back defensively. Know that sometimes you're going to be talking to the ED, and sometimes you're going to be talking to him, and you're not always going to be able to notice the difference (especially early on). If you're suspicious he's making himself sick, but reluctant to bring it up without certainty here's a few tips to look out for beyond the obvious that you've already noticed.... \n\n1. Running the tap/shower to hide the noise of vomitting (he may not be doing this currently, but this will definitely become a thing once he knows people have noticed)\n\n2. Going to the toilet multiple times in quick succession after meals, or flushing the toilet multiple times in one sitting. This is key as the ED develops... It might only be one vomit after a meal now, but can develop into multiple toilet trips/purgers after a meal.\n\n3. Loo roll left in the toilet. Again, might happen later on.... I used to put loo roll in to hide the remains knowing my mum was listening out for a few flushes. \n\n4. Drinking more during meal times... Possibly even specific drinks, such as fizzy pop, which can make it easier to purge. \n\n5. Eating food in a specific order. For example, veg first and then more fearing foods last. this comes from a untrue belief that the food they ate last that they fear will come up first.\n\n6. Social media use. Unsure if you have access to his social media, or have any protections/age restrictions on tech, or parental tracking. Heartbreakingly, there is a LOT of pro eating disorder content online that targets young people specifically, especially on tiktok currently. Tiktok is notoriously bad with cookies streamlining content and harmful content not being removed quick enough. It really is contributing to dramatic increases of eating disorders in the young. Unknown to me, my mum created a Tumblr account when I was younger (it used to be Tumblr for this stuff when I was young, before tiktok) and followed me to keep an eye on what I was sharing and posting. Wasn't until I logged back in years after to unfollow all the proED accounts and turn it all into poetry, that I discovered she did this! She never bought it up to me, but was telling my therapy team when there was something concerning. I would have been mad if I knew this in the moment, but respected it years after.\n\n7. Marshmallows. Marshmallows do not flush, they float, even after being vomitting. If you want confirmation... Try and get him to eat some marshmallows after a meal, maybe on a hot chocolate. Maybe just a hot chocolate, and not even at meal times. And then listen out if there's multiple flushes after his toilet trip. Hopefully he'll be unaware of this fact about marshmallows, and you'll be able to listen out for the multiple flushes, or look out for a lot of extra toilet roll being used to help it flush/hide it. If you decide to do this, I really would not tell him this was done until years and years into being recovered or never. Don't then approach the conversation starting as \"I know you're doing it because of this\", as this will set you on the back foot trust wise and the ED will get even more secretive.  Only do this for your own confirmation, and still approach the conversation as expressing concern and hope he's honest (he might not be, but you will know if he isn't).\n\nPlease know if you ever get stumped, have a question, hit a wall (and you will) or need support or advice, this group is here. Taking care of yourself through this process is key in being able to help him in the best way possible, make sure you have a support network in place for yourself to regulate your own emotions and support you. It's going to be hard... But if all of this is done in a delicate, mindful and most importantly caring way, your relationship with your son will come out so so so much stronger post recovery. But it's a hell of a journey, so make sure you have support in place for yourself.",
      "created_utc": 1726306503.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lmrbid8",
      "author": "FlightAffectionate22",
      "body": "It sounds like he is engaging in purging behavior, and about a third to a fourth of people with bulimia are men. If I were now a regular teenage boy, i'd be able to tell my parents if I got accidentally sick and vomited unintentionally. Finding traces of vomit is a very common way parents and others suspect a person has an eating disorder.  I  am not sure i'd advise you to urge a school counselor to talk to him, but you might speak to one and see what they would advise. I don't know if you should say something or not right now, but if you ask the professionals, they will give you guidance.  If he does have an ED, denial and anger, resentment and distancing are going to happen bc of it, so know that it is going to be a rough road.  I don't want to give you advice i'm in no place to give, but go to FB and ask in those groups, ask someone at an eating disorder center, or do a search online for PROFESSIONALS to speak to, and Google your question too: \"How do I help my child I think has an eating disorder?\". There's even videos on Youtube about your exact concern, \"How to help?\" \"Does my child have an eating disorder?\" You should also know that in bulimia, it's common to not loose a bunch of weight, but many do, esp when it's combined with anorexia. Bulimics are typically in the normal-weight range, so that keeps it even more unnoticed, untreated, and hidden. And it's more prevelant for both men and women who are into working out or in a sport that is weight/athletically-conscious. I hope your son is well; I had a very long period of bulimia and/or anorexia, and it harmed not just my health, but ate-away at so much of my life, or the life I hoped to have.",
      "created_utc": 1726145705.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmvd1hl",
      "author": "truthfully1111",
      "body": "Do you think your son is open to you attending the therapy with him? \n\nDoes your city offer group therapy? \n\nI think you may be able to approach the school counselor for advice. Maybe you can speak to a professional about your suspicions and they can refer you to someone who can help him. \n\nI wish you all the best.",
      "created_utc": 1726195613.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ln4z1kh",
      "author": "Boobie_Slayer",
      "body": "If you suspect him of having an eating disorder, I would recommend trying to talk/understand him. Let him lead the conversation, and don’t only respond with solutions.\n\nHowever, outside of conversation, I would recommend therapy and seeing a psychiatrist/doctor to check on his health to ensure safety. With this, I agree that therapy is a great idea, but if you live in a country like the US with atrocious mental health workers, you may want to be careful. It may only make it worse, so while it’s occurring, just make sure it’s something he likes with someone he enjoys.\n\nYou don’t have to listen to the advice I’m giving, but as someone who went through similar experiences, that is something I’d love for my parents/someone to do at the time.",
      "created_utc": 1726344735.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ln7iz2q",
      "author": "Yurarashi",
      "body": "I used to do this, so much of this will be based on my own experience. He goes to the gym so I'm gonig to assume that he's trying to \"cut\" so he can get a lean, muscluar figure. You can try to give him meal replacements, such as a protein shake (make sure it has it somewhere that it is a meal replacement). If his goal really is to get a lean body, tell him that this is not the way. Talk to him, but don't accuse him of anything - if he's going through such extreme lengths, then it must be a very sensitive topic for him.\n\nIt's scientifically proven that you need food to lose weight, and that not eating can have the opposite effect. Introduce him to dieting, and fully support him on it if he chooses to diet.\n\nGood luck! <3",
      "created_utc": 1726381327.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lmr04sg",
      "author": "FelurianFaye",
      "body": "Thank you 😊",
      "created_utc": 1726140688.0,
      "score": 5,
      "context": [
        {
          "id": "lmqlx2q",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1726131958.0
        }
      ]
    },
    {
      "id": "lmqqx4t",
      "author": "FelurianFaye",
      "body": "I'm so sorry that you went through that. I've not gone through any type of earing disorder, and I can only imagine the hurt you are going through and went through. \n\nI hurt for my son because I know he is hurting, and I don't know how to help him. I secretly lose sleep over this, stress constantly, cry over this. I don't want to make this about me, though. But, I do appreciate your recognition of my struggle. \n\nHe's also been using \"carts\" (vape pens, I never get it right) for the past year. He was open with me about this. I've not punished him for this. He knows my stance, my boundaries, and if I find them, I will throw them away. I want him to be kind to his body, and he knows this, isn't it.\n\nI've always tried to keep an open dialect with my children and tried to create a safe and non-judgmental relationship with my kids. He's not open with me as much anymore, nor would I expect him to be, I mean, he's a 16 year old boy, and I'm a 35 year old Female. Even yesterday, I told him, \"I know we don't talk much anymore about serious stuff, but I'm still always here, no matter the time.\" \n\nHis gym habits are sporadic. He does seem extremely into his looks and losing weight. I'm currently in the process of finding him a therapist (per his request). I just want to make sure I find a right fit. Not just the first one my insurance covers.\n\nI know this is a serious situation. I want to handle it the best way I can. I definitely don't want to make it worse. I just don't want my kid hurting.",
      "created_utc": 1726135444.0,
      "score": 5,
      "context": [
        {
          "id": "lmpu0p8",
          "author": "Monsters97",
          "body": "Hi! Sorry you're going thru this, but glad you can recognize signs...I'm sorry for the \"novel\" & some graphic info, but this hits home & there are important things to know...\nI have a long history with Bulimia (31 yrs, off & on) & I didn't even see it in one of my daughter's at that age. Of course, I didn't have all the Dx's I finally have now, so there's A LOT I wasn't able to recognize. \nTell tale signs I know too well are the rapid weight loss,  the vomit remains, going straight to the bathroom or \"needing to take a shower\" right after dinner (in my teen years & some of my early adulthood) & possibly over exercising, but also, not eating a lot or at all in front of people, drinking a ton of fluids with meals, pretending to feel \"sick\" so needing the bathroom, toilet is clean after you come out and/or smells of perfumes or cleaning products, if he's doing this, you may still find vomit under the rim where you use a toilet brush if he's \"tried\" to clean the evidence, choking easily, food remnants coming up on their own because they're sitting in the esophagus, mouthwash, sore throats, cavities, tooth loss and one VERY noticeable one (depending on the consistency) are marks & or scabs on the knuckles- pointer, middle, ring fingers and VERY bad indigestion (which can lead to acid reflux & or a hiatal hernia (stomach sphincter no longer opens/closes properly & allowed stomach acid to come up into the esophagus & could lead to scarring or holes in the esophagus)\n\nI'm 43 now and I've probably done it a handful of times over a years time, I'm getting better, on my own, but it's a thought (more than an action) often. When I was 14, my mom threatened to put me in a hospital. That only made it worse & I became way more secretive. My ED comes from childhood trauma, undiagnosed ADHD that apparently made me even more likely than normal people to have addictions & of course my lack of self confidence & outside influence. \n\nIt's a VERY difficult & delicate thing to approach...I would recommend YOU speak to a medical Dr & a psychiatrist FIRST for professional advice. Aside from that, you could take him on a \"date\", somewhere he can't avoid the conversation. I would very gently start with asking (no accusational words) how he is, how's life, what's up? I have a 16 yr old now & my older children, I understand 16 is a hard age because nothing you say is right or is heard/taken to heart and you couldn't POSSIBLY understand because you're the parent & even less so if you're different genders. Tell him about the things you've noticed & that you are not accusing him you are only asking because you love him and care about his health. Even if he only hears part of what you're saying & maybe only agrees to see a counselor to start, that's progress. I hope this helps 🤞🏽💚",
          "created_utc": 1726114217.0
        }
      ]
    },
    {
      "id": "lmxekhc",
      "author": "shenayanay",
      "body": "This hit home for me. My 13 year old is struggling and even though I also have struggled with eating disorders I'm guilty of the  things you noted that are triggering. Even if you mean well it triggers. Thank you for the reminder and I will do better! It's so hard to watch your child struggle and not offer help. I have to step back and see that I may be causing more damage than good.",
      "created_utc": 1726235120.0,
      "score": 2,
      "context": [
        {
          "id": "lmqvts4",
          "author": "None",
          "body": "I don’t have advice on how to approach it but I can tell you what upset and triggered me from 14-30 while I suffered and that was-\n- comments on my weight (gain or loss)\n- the suggestion which I took as accusation about not eating enough or food missing or being sick (because I was in denial and also afraid to have to change)\n\nThings that helped were\n- conversation that were relatable like my mum speaking about feeling self conscious or how harsh societies expectations were\n- conversations about feeling out of control \n- conversations about wanting to look better but wanting the most out of life (my friends mother opened up about how her ED robbed her of so much of her young life due to restrictive social events and relationships then off her later years due to the health side effects)\n\nI don’t know if this helps at all but I know it will be a tough conversation and if they get defensive or angry please don’t take it personally or feel like you’ve failed.",
          "created_utc": 1726138436.0
        }
      ]
    },
    {
      "id": "lmqzpk7",
      "author": "FelurianFaye",
      "body": "Thank you so much for sharing your story. Every hit of information I can get helps me better understand.",
      "created_utc": 1726140478.0,
      "score": 1,
      "context": [
        {
          "id": "lmqvts4",
          "author": "None",
          "body": "I don’t have advice on how to approach it but I can tell you what upset and triggered me from 14-30 while I suffered and that was-\n- comments on my weight (gain or loss)\n- the suggestion which I took as accusation about not eating enough or food missing or being sick (because I was in denial and also afraid to have to change)\n\nThings that helped were\n- conversation that were relatable like my mum speaking about feeling self conscious or how harsh societies expectations were\n- conversations about feeling out of control \n- conversations about wanting to look better but wanting the most out of life (my friends mother opened up about how her ED robbed her of so much of her young life due to restrictive social events and relationships then off her later years due to the health side effects)\n\nI don’t know if this helps at all but I know it will be a tough conversation and if they get defensive or angry please don’t take it personally or feel like you’ve failed.",
          "created_utc": 1726138436.0
        }
      ]
    },
    {
      "id": "lmqzwcv",
      "author": "FelurianFaye",
      "body": "Thank you for the advice. I'm definitely trying to arm myself with as much information I can so I can be available to help when he's ready.",
      "created_utc": 1726140572.0,
      "score": 1,
      "context": [
        {
          "id": "lmquz0l",
          "author": "Old-Friendship9613",
          "body": "Your instinct to address this early is spot-on. Before talking to him, it might help to learn more about eating disorders so you're well-informed. When you're ready to chat, find a quiet moment when you both have time. Start by sharing your observations using \"I\" statements - like \"I've noticed\" or \"I'm worried\" - and be specific about the changes you've seen in his eating habits and weight. Try to focus on his health rather than appearance. The key is to listen without judgment and let him know you're there to support him. It's a good move to arrange therapy, and you could also consider a check-up with his doctor. You could start the conversation like this: \"\\[Son's name\\], I've noticed some changes lately that have me worried. Can we talk about what's going on?\" Even just starting the recovery process takes time, so be patient and keep the lines of communication open. You're doing the right thing by addressing this - your son is lucky to have such a caring parent.",
          "created_utc": 1726137953.0
        }
      ]
    },
    {
      "id": "lmr17bm",
      "author": "FelurianFaye",
      "body": "I'm sorry no one saw you when you needed them to. I hope you have a beautiful outcome to this. \n\nThank you so much for the advice.",
      "created_utc": 1726141210.0,
      "score": 1,
      "context": [
        {
          "id": "lmqzzvi",
          "author": "Due_Improvement_6650",
          "body": "I’m 18 and i have restricting and binge-eating ed, along with occasional bulimia episodes (purging, fasting, etc.). My family has never noticed, and I think it’s because they don’t fully understand eating disorders. To them, you only seem sick if you’re deadly thin. I wish someone had talked to me sooner—maybe I wouldn’t be struggling as much.\n\nIf you’re worried about someone, it’s best to start by addressing your concerns directly. Tell him what you’ve noticed and give him a chance to respond. There are two possible outcomes: either he admits to having bulimia, or he says you’re overreacting and that he’s fine.\n\nIf he opens up about having bulimia, it becomes much easier to help him. You can support him by scheduling a visit with a psychologist, and if he’s resistant, give him time. Have a conversation with him yourself, explaining that he can still live a healthy lifestyle, lose weight, and work out without resorting to harmful habits. Share the side effects of bulimia, such as damage to his teeth, digestive issues, stomach aches, and acid reflux. And don’t forget to offer him a hug; emotional support is crucial.\n\nIf he insists that there’s no problem, keep an eye on him. If he continues these behaviors, approach him again and explain your concerns in a caring way.",
          "created_utc": 1726140621.0
        }
      ]
    },
    {
      "id": "lmqzh67",
      "author": "WarlordMeowMeow",
      "body": "You could try embodying some of the positive practices yourself as an example (or making it a bit more obvious and verbal)? For example, make sure you're eating meals consistently and if you're the one cooking dinners or buying groceries and you know some foods he's more comfortable keeping down than others favour those a bit more if he seems to be having a hard time.\n\nI think with eating disorders, it's hard because you want the support, but there's a lot of shame and not wanting to be noticed when doing it. So, the more that the environment passively supports, the better.\n\n There's quite a few qualified health coaches on YouTube and instagram that demystify toxic dieting and make a point of encouraging fueling your body, they'll also teach sustainable gains and loss. He may be interested in something like that?",
      "created_utc": 1726140360.0,
      "score": 5,
      "context": [
        {
          "id": "lmpu0p8",
          "author": "Monsters97",
          "body": "Hi! Sorry you're going thru this, but glad you can recognize signs...I'm sorry for the \"novel\" & some graphic info, but this hits home & there are important things to know...\nI have a long history with Bulimia (31 yrs, off & on) & I didn't even see it in one of my daughter's at that age. Of course, I didn't have all the Dx's I finally have now, so there's A LOT I wasn't able to recognize. \nTell tale signs I know too well are the rapid weight loss,  the vomit remains, going straight to the bathroom or \"needing to take a shower\" right after dinner (in my teen years & some of my early adulthood) & possibly over exercising, but also, not eating a lot or at all in front of people, drinking a ton of fluids with meals, pretending to feel \"sick\" so needing the bathroom, toilet is clean after you come out and/or smells of perfumes or cleaning products, if he's doing this, you may still find vomit under the rim where you use a toilet brush if he's \"tried\" to clean the evidence, choking easily, food remnants coming up on their own because they're sitting in the esophagus, mouthwash, sore throats, cavities, tooth loss and one VERY noticeable one (depending on the consistency) are marks & or scabs on the knuckles- pointer, middle, ring fingers and VERY bad indigestion (which can lead to acid reflux & or a hiatal hernia (stomach sphincter no longer opens/closes properly & allowed stomach acid to come up into the esophagus & could lead to scarring or holes in the esophagus)\n\nI'm 43 now and I've probably done it a handful of times over a years time, I'm getting better, on my own, but it's a thought (more than an action) often. When I was 14, my mom threatened to put me in a hospital. That only made it worse & I became way more secretive. My ED comes from childhood trauma, undiagnosed ADHD that apparently made me even more likely than normal people to have addictions & of course my lack of self confidence & outside influence. \n\nIt's a VERY difficult & delicate thing to approach...I would recommend YOU speak to a medical Dr & a psychiatrist FIRST for professional advice. Aside from that, you could take him on a \"date\", somewhere he can't avoid the conversation. I would very gently start with asking (no accusational words) how he is, how's life, what's up? I have a 16 yr old now & my older children, I understand 16 is a hard age because nothing you say is right or is heard/taken to heart and you couldn't POSSIBLY understand because you're the parent & even less so if you're different genders. Tell him about the things you've noticed & that you are not accusing him you are only asking because you love him and care about his health. Even if he only hears part of what you're saying & maybe only agrees to see a counselor to start, that's progress. I hope this helps 🤞🏽💚",
          "created_utc": 1726114217.0
        },
        {
          "id": "lmqqx4t",
          "author": "FelurianFaye",
          "body": "I'm so sorry that you went through that. I've not gone through any type of earing disorder, and I can only imagine the hurt you are going through and went through. \n\nI hurt for my son because I know he is hurting, and I don't know how to help him. I secretly lose sleep over this, stress constantly, cry over this. I don't want to make this about me, though. But, I do appreciate your recognition of my struggle. \n\nHe's also been using \"carts\" (vape pens, I never get it right) for the past year. He was open with me about this. I've not punished him for this. He knows my stance, my boundaries, and if I find them, I will throw them away. I want him to be kind to his body, and he knows this, isn't it.\n\nI've always tried to keep an open dialect with my children and tried to create a safe and non-judgmental relationship with my kids. He's not open with me as much anymore, nor would I expect him to be, I mean, he's a 16 year old boy, and I'm a 35 year old Female. Even yesterday, I told him, \"I know we don't talk much anymore about serious stuff, but I'm still always here, no matter the time.\" \n\nHis gym habits are sporadic. He does seem extremely into his looks and losing weight. I'm currently in the process of finding him a therapist (per his request). I just want to make sure I find a right fit. Not just the first one my insurance covers.\n\nI know this is a serious situation. I want to handle it the best way I can. I definitely don't want to make it worse. I just don't want my kid hurting.",
          "created_utc": 1726135444.0
        }
      ]
    },
    {
      "id": "ln00cxu",
      "author": "None",
      "body": "It’s so so hard because intent is pure and good. \n\nYou’re both doing amazing and the fact you care about their emotional health as well as physical health is a lot more than most 🫶🏻",
      "created_utc": 1726266298.0,
      "score": 1,
      "context": [
        {
          "id": "lmqvts4",
          "author": "None",
          "body": "I don’t have advice on how to approach it but I can tell you what upset and triggered me from 14-30 while I suffered and that was-\n- comments on my weight (gain or loss)\n- the suggestion which I took as accusation about not eating enough or food missing or being sick (because I was in denial and also afraid to have to change)\n\nThings that helped were\n- conversation that were relatable like my mum speaking about feeling self conscious or how harsh societies expectations were\n- conversations about feeling out of control \n- conversations about wanting to look better but wanting the most out of life (my friends mother opened up about how her ED robbed her of so much of her young life due to restrictive social events and relationships then off her later years due to the health side effects)\n\nI don’t know if this helps at all but I know it will be a tough conversation and if they get defensive or angry please don’t take it personally or feel like you’ve failed.",
          "created_utc": 1726138436.0
        },
        {
          "id": "lmxekhc",
          "author": "shenayanay",
          "body": "This hit home for me. My 13 year old is struggling and even though I also have struggled with eating disorders I'm guilty of the  things you noted that are triggering. Even if you mean well it triggers. Thank you for the reminder and I will do better! It's so hard to watch your child struggle and not offer help. I have to step back and see that I may be causing more damage than good.",
          "created_utc": 1726235120.0
        }
      ]
    },
    {
      "id": "lmrdciy",
      "author": "Due_Improvement_6650",
      "body": "you’re a great mom. if u have any questions bout talking to your son please dm me 🩷 as a teenager with an ed i can help",
      "created_utc": 1726146422.0,
      "score": 1,
      "context": [
        {
          "id": "lmqzzvi",
          "author": "Due_Improvement_6650",
          "body": "I’m 18 and i have restricting and binge-eating ed, along with occasional bulimia episodes (purging, fasting, etc.). My family has never noticed, and I think it’s because they don’t fully understand eating disorders. To them, you only seem sick if you’re deadly thin. I wish someone had talked to me sooner—maybe I wouldn’t be struggling as much.\n\nIf you’re worried about someone, it’s best to start by addressing your concerns directly. Tell him what you’ve noticed and give him a chance to respond. There are two possible outcomes: either he admits to having bulimia, or he says you’re overreacting and that he’s fine.\n\nIf he opens up about having bulimia, it becomes much easier to help him. You can support him by scheduling a visit with a psychologist, and if he’s resistant, give him time. Have a conversation with him yourself, explaining that he can still live a healthy lifestyle, lose weight, and work out without resorting to harmful habits. Share the side effects of bulimia, such as damage to his teeth, digestive issues, stomach aches, and acid reflux. And don’t forget to offer him a hug; emotional support is crucial.\n\nIf he insists that there’s no problem, keep an eye on him. If he continues these behaviors, approach him again and explain your concerns in a caring way.",
          "created_utc": 1726140621.0
        },
        {
          "id": "lmr17bm",
          "author": "FelurianFaye",
          "body": "I'm sorry no one saw you when you needed them to. I hope you have a beautiful outcome to this. \n\nThank you so much for the advice.",
          "created_utc": 1726141210.0
        }
      ]
    },
    {
      "id": "lmr1iaf",
      "author": "FelurianFaye",
      "body": "Thank you, I'll definitely look up some of those youtube videos. \n\nI haven't spoken with him yet. There's a lot going on this week, so I'm going to wait until it's slower, and I have more resources ready if he does open up.",
      "created_utc": 1726141355.0,
      "score": 5,
      "context": [
        {
          "id": "lmpu0p8",
          "author": "Monsters97",
          "body": "Hi! Sorry you're going thru this, but glad you can recognize signs...I'm sorry for the \"novel\" & some graphic info, but this hits home & there are important things to know...\nI have a long history with Bulimia (31 yrs, off & on) & I didn't even see it in one of my daughter's at that age. Of course, I didn't have all the Dx's I finally have now, so there's A LOT I wasn't able to recognize. \nTell tale signs I know too well are the rapid weight loss,  the vomit remains, going straight to the bathroom or \"needing to take a shower\" right after dinner (in my teen years & some of my early adulthood) & possibly over exercising, but also, not eating a lot or at all in front of people, drinking a ton of fluids with meals, pretending to feel \"sick\" so needing the bathroom, toilet is clean after you come out and/or smells of perfumes or cleaning products, if he's doing this, you may still find vomit under the rim where you use a toilet brush if he's \"tried\" to clean the evidence, choking easily, food remnants coming up on their own because they're sitting in the esophagus, mouthwash, sore throats, cavities, tooth loss and one VERY noticeable one (depending on the consistency) are marks & or scabs on the knuckles- pointer, middle, ring fingers and VERY bad indigestion (which can lead to acid reflux & or a hiatal hernia (stomach sphincter no longer opens/closes properly & allowed stomach acid to come up into the esophagus & could lead to scarring or holes in the esophagus)\n\nI'm 43 now and I've probably done it a handful of times over a years time, I'm getting better, on my own, but it's a thought (more than an action) often. When I was 14, my mom threatened to put me in a hospital. That only made it worse & I became way more secretive. My ED comes from childhood trauma, undiagnosed ADHD that apparently made me even more likely than normal people to have addictions & of course my lack of self confidence & outside influence. \n\nIt's a VERY difficult & delicate thing to approach...I would recommend YOU speak to a medical Dr & a psychiatrist FIRST for professional advice. Aside from that, you could take him on a \"date\", somewhere he can't avoid the conversation. I would very gently start with asking (no accusational words) how he is, how's life, what's up? I have a 16 yr old now & my older children, I understand 16 is a hard age because nothing you say is right or is heard/taken to heart and you couldn't POSSIBLY understand because you're the parent & even less so if you're different genders. Tell him about the things you've noticed & that you are not accusing him you are only asking because you love him and care about his health. Even if he only hears part of what you're saying & maybe only agrees to see a counselor to start, that's progress. I hope this helps 🤞🏽💚",
          "created_utc": 1726114217.0
        },
        {
          "id": "lmqqx4t",
          "author": "FelurianFaye",
          "body": "I'm so sorry that you went through that. I've not gone through any type of earing disorder, and I can only imagine the hurt you are going through and went through. \n\nI hurt for my son because I know he is hurting, and I don't know how to help him. I secretly lose sleep over this, stress constantly, cry over this. I don't want to make this about me, though. But, I do appreciate your recognition of my struggle. \n\nHe's also been using \"carts\" (vape pens, I never get it right) for the past year. He was open with me about this. I've not punished him for this. He knows my stance, my boundaries, and if I find them, I will throw them away. I want him to be kind to his body, and he knows this, isn't it.\n\nI've always tried to keep an open dialect with my children and tried to create a safe and non-judgmental relationship with my kids. He's not open with me as much anymore, nor would I expect him to be, I mean, he's a 16 year old boy, and I'm a 35 year old Female. Even yesterday, I told him, \"I know we don't talk much anymore about serious stuff, but I'm still always here, no matter the time.\" \n\nHis gym habits are sporadic. He does seem extremely into his looks and losing weight. I'm currently in the process of finding him a therapist (per his request). I just want to make sure I find a right fit. Not just the first one my insurance covers.\n\nI know this is a serious situation. I want to handle it the best way I can. I definitely don't want to make it worse. I just don't want my kid hurting.",
          "created_utc": 1726135444.0
        },
        {
          "id": "lmqzh67",
          "author": "WarlordMeowMeow",
          "body": "You could try embodying some of the positive practices yourself as an example (or making it a bit more obvious and verbal)? For example, make sure you're eating meals consistently and if you're the one cooking dinners or buying groceries and you know some foods he's more comfortable keeping down than others favour those a bit more if he seems to be having a hard time.\n\nI think with eating disorders, it's hard because you want the support, but there's a lot of shame and not wanting to be noticed when doing it. So, the more that the environment passively supports, the better.\n\n There's quite a few qualified health coaches on YouTube and instagram that demystify toxic dieting and make a point of encouraging fueling your body, they'll also teach sustainable gains and loss. He may be interested in something like that?",
          "created_utc": 1726140360.0
        }
      ]
    },
    {
      "id": "lmrf0ln",
      "author": "FelurianFaye",
      "body": "That means more than you know. Thank you so much!",
      "created_utc": 1726147066.0,
      "score": 1,
      "context": [
        {
          "id": "lmqzzvi",
          "author": "Due_Improvement_6650",
          "body": "I’m 18 and i have restricting and binge-eating ed, along with occasional bulimia episodes (purging, fasting, etc.). My family has never noticed, and I think it’s because they don’t fully understand eating disorders. To them, you only seem sick if you’re deadly thin. I wish someone had talked to me sooner—maybe I wouldn’t be struggling as much.\n\nIf you’re worried about someone, it’s best to start by addressing your concerns directly. Tell him what you’ve noticed and give him a chance to respond. There are two possible outcomes: either he admits to having bulimia, or he says you’re overreacting and that he’s fine.\n\nIf he opens up about having bulimia, it becomes much easier to help him. You can support him by scheduling a visit with a psychologist, and if he’s resistant, give him time. Have a conversation with him yourself, explaining that he can still live a healthy lifestyle, lose weight, and work out without resorting to harmful habits. Share the side effects of bulimia, such as damage to his teeth, digestive issues, stomach aches, and acid reflux. And don’t forget to offer him a hug; emotional support is crucial.\n\nIf he insists that there’s no problem, keep an eye on him. If he continues these behaviors, approach him again and explain your concerns in a caring way.",
          "created_utc": 1726140621.0
        },
        {
          "id": "lmr17bm",
          "author": "FelurianFaye",
          "body": "I'm sorry no one saw you when you needed them to. I hope you have a beautiful outcome to this. \n\nThank you so much for the advice.",
          "created_utc": 1726141210.0
        },
        {
          "id": "lmrdciy",
          "author": "Due_Improvement_6650",
          "body": "you’re a great mom. if u have any questions bout talking to your son please dm me 🩷 as a teenager with an ed i can help",
          "created_utc": 1726146422.0
        }
      ]
    }
  ]
}