{
  "id": "1fitbpf",
  "subreddit": "EatingDisorders",
  "author": "EntertainmentPlus231",
  "created_utc": 1726560021.0,
  "title": "Hate how normalised comments about weight change are from other men ",
  "selftext": "\n\n(M27) here. Have had a rough time for most of my adult life hating my body and struggling with ED despite being a healthy weight for most of it. \n\nHad a depressive episode for a couple of months and must have gained abit of weight, partially due to just not working as much. \n\nThe other day another colleague made a remark about it. I told him I didn’t appreciate it. He said I was being sensitive, and it escalated much more than it had to.\n\nI’ve never had these sort of interactions with women and feel like they are much more educated /empathetic about this stuff than guys are to each other (obviously not always though) \n\nAnyway I’ve really spiralled in the time after. Why can’t people just keep their mouth shut and be respectful, particularly at work. \n \nWhat are some good responses In the future? \n\nI’m not going to ignore it any longer, however it’s especially frustrating when it involves work. Since it might potentially mean getting less work. \n\nThere’s no HR or anything where I work (very male dominated industry doing sound) and I feel like my bosses wouldn’t take my side if i were to talk to them about it.\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1fitbpf/hate_how_normalised_comments_about_weight_change/",
  "score": 40,
  "num_comments": 8,
  "comments": [
    {
      "id": "lnk4fjr",
      "author": "EDstuffanon",
      "body": "I just say 'I've been severely depressed' and they back track like hell lmao",
      "created_utc": 1726575035.0,
      "score": 21,
      "context": []
    },
    {
      "id": "lnk38wo",
      "author": "yaboytheo1",
      "body": "In this kind of ‘manly’ culture, the best thing to do is to not show ‘weakness’, as silly and made up as it all is. If you’re right about the reaction to reporting, you have to just minimise each instance as much as possible. So probably best to play it off as a joke if you can, and just brush it off if you can’t. \n\nExamples:\n\n‘I was conducting a long form experiment to see what the effects of nightly pizza use does to the peak male form’ *flex guns sarcastically*\n\n‘No way! Do you *also* live in a house with no mirrors or cameras?? I’d never have known till you told me!’\n\n‘Who gives a shit man’\n\n‘Shit happens’ \n\n*directly looking him in the eyes* ‘you feeling a bit down on yourself man? I know it’s difficult to see someone look better than you every single day, just checking in’ \n\n*utter silence for long enough for them to consider what they said to you and walk it back*\n\nIf you’re friendly with the person at all, a light ‘yeah I’ve been going through it recently, feeling a bit down on myself too’ might get 1) a hasty apology and 2) them avoiding the subject forever or 3) a genuine conversation with a friend",
      "created_utc": 1726574501.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lnk1vtk",
      "author": "YuukiShao",
      "body": "I really empathize with you. Probably stay away from things that remind you of your weight or looks. ",
      "created_utc": 1726573877.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lnl0ucl",
      "author": "unacknowledgement",
      "body": "Sorry this happened to you. In the last week 4 colleagues have made a comment on my weight and appearance and honestly I've been thinking since when it became ok to do that. Like why do people geek that's OK?",
      "created_utc": 1726586741.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lnu3mrm",
      "author": "Actual_Reception2610",
      "body": "I’m sure this guy don’t have a Perf body either. This is low but I’ll throw another personal attack and then tell him to stop being emotional \n\nPpl who say they don’t have a filter and are straightforward are just plain asshole who do r have any consideration and respect for anyone cuz they would think twice before talking to ppl who matter to them.",
      "created_utc": 1726711948.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lnlwfua",
      "author": "None",
      "body": "Yeah I match rude/uncomfortable comment with more uncomfortable response. When I’ve been at my lowest and told I looked sick I use to say “thanks I am, and they’re worried I might die!” White face but who the fuck feels entitled to randomly comment someone else’s weight when they’re not in an extremely close relationships (which if you are usually you know weight is a no no)",
      "created_utc": 1726596747.0,
      "score": 8,
      "context": [
        {
          "id": "lnk4fjr",
          "author": "EDstuffanon",
          "body": "I just say 'I've been severely depressed' and they back track like hell lmao",
          "created_utc": 1726575035.0
        }
      ]
    },
    {
      "id": "lnp5rxx",
      "author": "Desperate_Air370",
      "body": "this is pretty good answer & has different possible outcomes as well. I’m sad that in this world of ours it’s more acceptable to comment on weight & being sarcastic than being quiet or kind. But that’s the way it goes so ^^ try these",
      "created_utc": 1726642807.0,
      "score": 4,
      "context": [
        {
          "id": "lnk38wo",
          "author": "yaboytheo1",
          "body": "In this kind of ‘manly’ culture, the best thing to do is to not show ‘weakness’, as silly and made up as it all is. If you’re right about the reaction to reporting, you have to just minimise each instance as much as possible. So probably best to play it off as a joke if you can, and just brush it off if you can’t. \n\nExamples:\n\n‘I was conducting a long form experiment to see what the effects of nightly pizza use does to the peak male form’ *flex guns sarcastically*\n\n‘No way! Do you *also* live in a house with no mirrors or cameras?? I’d never have known till you told me!’\n\n‘Who gives a shit man’\n\n‘Shit happens’ \n\n*directly looking him in the eyes* ‘you feeling a bit down on yourself man? I know it’s difficult to see someone look better than you every single day, just checking in’ \n\n*utter silence for long enough for them to consider what they said to you and walk it back*\n\nIf you’re friendly with the person at all, a light ‘yeah I’ve been going through it recently, feeling a bit down on myself too’ might get 1) a hasty apology and 2) them avoiding the subject forever or 3) a genuine conversation with a friend",
          "created_utc": 1726574501.0
        }
      ]
    },
    {
      "id": "lnm2b6n",
      "author": "I_need_to_vent44",
      "body": "Yeah same. Make fucked up comments, receive fucked up answers. If you make fun of me walking really slow or make comments about me not being very fast with my fingers, I am going to tell you that I've had very poor motor control as a child and had to start school a year later because of it because I couldn't even hold a pen. Might make you think twice before telling me that I clearly haven't been sewing for as long as you next time.\n\n\n\nObviously that one is pretty mild, but a lot of the time when people feel the need to make comments about my food, I just go \"I'm glad that I even forced myself to eat today, because there are days when I don't.\" and depending on how mean their comments were, I either make it more uncomfortable or not. Like I also have several physical problems that make it hard for me to eat, so I might either disclose one of them, or all of them + the eating disorder. Depending on how uncomfortable I want to make it.",
      "created_utc": 1726598578.0,
      "score": 3,
      "context": [
        {
          "id": "lnk4fjr",
          "author": "EDstuffanon",
          "body": "I just say 'I've been severely depressed' and they back track like hell lmao",
          "created_utc": 1726575035.0
        },
        {
          "id": "lnlwfua",
          "author": "None",
          "body": "Yeah I match rude/uncomfortable comment with more uncomfortable response. When I’ve been at my lowest and told I looked sick I use to say “thanks I am, and they’re worried I might die!” White face but who the fuck feels entitled to randomly comment someone else’s weight when they’re not in an extremely close relationships (which if you are usually you know weight is a no no)",
          "created_utc": 1726596747.0
        }
      ]
    }
  ]
}