{
  "id": "1fpbqpu",
  "subreddit": "EatingDisorders",
  "author": "Swimming-Wafer6547",
  "created_utc": 1727289270.0,
  "title": "Boyfriend comments on my eating",
  "selftext": "I need a outside perspective on this. I noticed my boyfriend comments on my portion sizes. \n\nFor example tonight - I asked for one more piece of bread and he said hmmm you’ve must’ve had very small lunch today, to be this hungry. I had normal lunch and for dinner I had hummus with veggies and bread. Normal dinner. \n\nSo it did upset me, I was like - what kind of comment is that? This did not happen the first time, I feel like he often comments on my portion or is looking at my plate.\n\nSo we talked about it and from his point of view he did not mean it in controlling way, in his view is conversation like any other. In my view I see this as controlling behavior. \n\nAm I just projecting my own problems with food on his comments? I am honestly confused. \n\nLet me know what you think. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1fpbqpu/boyfriend_comments_on_my_eating/",
  "score": 93,
  "num_comments": 32,
  "comments": [
    {
      "id": "loxt3ho",
      "author": "onefootback",
      "body": "you’re not wrong for feeling this way, especially considering the fact that this isn’t the first time this has happened. if he knows you have an ed and is still making these comments then he’s really shitty but honestly even if you didn’t it’s still shitty to comment on how much a person is eating",
      "created_utc": 1727307306.0,
      "score": 83,
      "context": []
    },
    {
      "id": "loyrxmk",
      "author": "Anxious-Mechanic-249",
      "body": "I would say to your boyfriend that you need him (if this is what you feel you need) to refrain from commenting on your food portions (or food in general). Because if somone said that to me personally I would’ve spiraled",
      "created_utc": 1727320730.0,
      "score": 42,
      "context": []
    },
    {
      "id": "loysxua",
      "author": "The_Bastard_Henry",
      "body": "If your boyfriend cannot take your eating issues seriously and refrain from commenting on your food intake, he is doing you more harm than good.",
      "created_utc": 1727321178.0,
      "score": 27,
      "context": []
    },
    {
      "id": "loyn9th",
      "author": "PetitePretty1",
      "body": "About a year or so ago, I went back into an outpatient ED program...my eating wasn't good at all (bingeing). I was really self conscious about it and my partner would often comment about what I was eating and how much etc. It really did a number on me. I ended up turning things around and now we both seem much happier but I've never felt comfortable eating in his presence since. He always seems to have some kind of commentary if I'm not eating what he thinks is \"healthy\".",
      "created_utc": 1727318753.0,
      "score": 10,
      "context": []
    },
    {
      "id": "loz4bx9",
      "author": "SnowDiamond828",
      "body": "so awful if my bf said this to me i would actually start crying i’m sorry op",
      "created_utc": 1727326805.0,
      "score": 10,
      "context": []
    },
    {
      "id": "loz8149",
      "author": "meta_muse",
      "body": "Omg I hate this so much for you. People commenting on what others eat is so rude. He should know that food is a sensitive topic and to keep certain things to himself. Your feelings are totally valid. Definitely have a conversation with him about it.",
      "created_utc": 1727328897.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lozd97o",
      "author": "angiebeany",
      "body": "This is why I'm staying single. Even without an eating disorder other halfs just seem to comment on whatever you eat or drink 😠. 'ooh a cup of tea' 'a sandwich?' 'you love your potatoes don't you' OMG",
      "created_utc": 1727332088.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lp063mq",
      "author": "MaryContrary26",
      "body": "No, it's not \"normal\" to comment if someone asks for an extra piece of bread at dinner. People generally wouldn't even notice because they're not tuned in to what other people eat unless they have an eating disorder or they're judgmental about what you're eating. It sounds like he's very tuned in to what you eat, making passive aggressive judgmental comments about it and when you call him out on it he denies it. He may not be overtly \"controlling\" but he's certainly being manipulative.",
      "created_utc": 1727350672.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lp195nu",
      "author": "Any_Ad_8047",
      "body": "When I first started seeing my person he would comment on my eating habits. It took me a bit but I finally just sat down and basically was like “babe I have disordered eating habits. I’m trying really hard to keep up healthier habits and your comments make me feel embarrassed about a problem I’m very well aware of”. Problem solved. Now he keeps my random comfort foods in his house, doesn’t comment when I can’t eat in front of multiple people and warms up my left overs when we’re back home. He just really didn’t know and when I explained how these comments made me feel he was understanding. Just talk to him.\n\nEta I somehow missed the part where you said you already told him how you felt! If his behavior continues I’d reconsider the relationship… sounds extreme but you should be fully supported by a partner.",
      "created_utc": 1727364883.0,
      "score": 3,
      "context": []
    },
    {
      "id": "loyfwy9",
      "author": "misstealyourmans",
      "body": "break up with him",
      "created_utc": 1727315837.0,
      "score": 4,
      "context": []
    },
    {
      "id": "loy0alc",
      "author": "FairyFortunes",
      "body": "I think he may be obsessed with your eating habits because he knows you have an eating disorder.  I don’t think he’s intentionally being controlling but his concern isn’t helpful.\n\nIf this were me, I’d say, “Hey I wanted to talk to you about something.  You know eating is a bit of a touchy subject for me.  You are so good to me.  I’m hoping you can help me with something.  I feel really flustered when you make comments about what I’m eating.  I know you’re a good person and you don’t mean to hurt me but in the moment, I get flustered and upset.  It would really help if you didn’t make any comments about my food.”\n\nThen if he comments on your food, you can remind him.  “Hey babe.  Remember when I told you it would really help me if you stopped making comments about portions and food?  Your comment is making me feel flustered and upset.  I’m sure I’ll be fine if we change the subject.”",
      "created_utc": 1727309956.0,
      "score": 4,
      "context": []
    },
    {
      "id": "loxtq3t",
      "author": "alienprincess111",
      "body": "My husband sometimes makes weird comments about my eating.  He is naturally slim and is eating constantly - like eating a full dinner, snacking on potato chips immediately after,  then eating fruit,  chips + avocado, cookies, chocolate etc.  All the way until bed.  In contrast  I restrict heavily which he somehow never notices.  If I eat a snack before bed (sometimes it's almost the only thing I eat all say), he asks me \"are you having 2nd dinner?\".  He'll also comment that all I eat is sugar, when I eat no sweets ever (I think he considers carbs sugar).  It doesnt bother me personally, but I try to hide my restriction so any comments that suggest I'm eating I consider positive.",
      "created_utc": 1727307536.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lp06vyb",
      "author": "squareishpeg",
      "body": "Ever since I'm a little kid I have been a disordered eater. I'm talking from the age of seven and up - I am now 40. My ED developed in my early teens and ramped up in college and beyond. I've had bouts of recovery, but never really long term. I am also an alcoholic and addict. I've been in recovery from substances for almost five years, but I can't seem to do the same for my ED (A, B, BE). \n\nI've never liked to eat in front of people and have always been deeply hurt when people have commented on what or how much I eat. I was the chubby kid, and even a morbidly obese adult. Even today I don't \"look\" like someone with an ED but it's there. I currently live with my sister, brother in law, brother, their daddy, and five nieces and nephews. I swear to Bob that their daddy has a frickin tracker on me every time I go to the kitchen. He just appears outta nowhere like a daggum ninja and watches me. I buy my own food, I rarely eat what the rest of the family has bought and he has me self conscious of eating my own food. Maybe I want two yogurt cups, I bought them. Maybe I want two bowls of cereal and milk - I bought them. Yet, he watches. Even my nieces and nephews will comment. It makes me incredibly self conscious to where I don't even want to eat my own food and a lot of it goes to waste. I'm on a fixed income so wasting food is just not good. Everything I buy is on manager's special, so the shelf life isn't all that long, and I tend to buy so much and literally throw it away. \n\nI'm sorry to ramble, but all of this to say I understand. I don't think it's right for anyone to comment ever, whether there's an ED or not. I'm from the south - people eat lol. I'm sorry this is happening, and I hope that he'll understand in future. Thanks for listening to me ramble. Love and light 💛",
      "created_utc": 1727351046.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp1d5az",
      "author": "papaslilpoppyseed",
      "body": "Oh, major ick.. if I were you, I'd try to discuss further and let him know you have a boundary about discussing your food or eating habits. For him it may be normal conversation, but that doesnt mean it is for you, it doesn't mean you're comfortable with it. And it doesn't mean you HAVE to be comfortable with it. I've had partners who commented on or straight up made fun of my eating before and it's unbearable at times. You should be able to feel safe with him.. not worry about what he's going to say or think about your plate.",
      "created_utc": 1727366118.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp3xbwg",
      "author": "uybeaa",
      "body": "You're completely right girl! Okay, he may not have meant to come across as controlling. But still. You have the right to feel that way, girl. It really hurts, ik, but don't be upset with your self!",
      "created_utc": 1727396358.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp477bu",
      "author": "vladsgf_",
      "body": "if someone comments on MY eating im out",
      "created_utc": 1727399986.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp57f6p",
      "author": "None",
      "body": "I think it’s nice to make him an ex boyfriend. \n\nYou can also make passive aggressive comment about HIS SMALL portion you aren’t satisfied with",
      "created_utc": 1727416272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp5tsvu",
      "author": "Julia27092000",
      "body": "I think it is strange for him to comment like this",
      "created_utc": 1727431349.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp66gnv",
      "author": "Dark_Hair_",
      "body": "Just eat and let him be",
      "created_utc": 1727438239.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp6vtyv",
      "author": "allofme6",
      "body": "Maybe he has an eating disorder, maybe he is secretly thinking you're overweight, either way this behavior is not OK.  It is never acceptable to comment like that on what other people eat, or how much. \nHe can shut the hell up or move on",
      "created_utc": 1727447887.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp9i5eo",
      "author": "clumsysav",
      "body": "People can be controlling and manipulative without being conscious of it",
      "created_utc": 1727479770.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpciw2g",
      "author": "RainUpper",
      "body": "I was a dating a girl with bulimia. I had a fair idea as to what would hurt her feelings/trigger her etc. so used to let her do what she wanted food wise. She told me people commenting as to whether she was eating too much or too little used to trigger her and make her want to binge. She always felt there was no escape from this. It's noones business but your own what you eat and how much or how little of it. Maybe try to explain that you're finding his comments too sensitive and to back off?\nOne thing, after 3 or 4 months, my girlfriends bulimia stopped. I went into the bathroom with her one time, to see what she had to endure with the bulimia and I cried. She saw it was hurting me and herself and she  stopped forcibly bringing the food up.",
      "created_utc": 1727535428.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpdhuz4",
      "author": "ContributionNeat6181",
      "body": "You need to tell him to stop it. He is feeding your eating disorder. my ex-husband used to do this and I had an eating disorder for 38 years. It was constant and it made me feel like he was right he was not!!",
      "created_utc": 1727547377.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lp76xfn",
      "author": "yeh1234gee",
      "body": "I agree, he knows he shouldn't and still does, some bfs aren't supportive of partners recovering for selfish reasons, \"what if they get fat\", honestly fuck him, he sucks",
      "created_utc": 1727451483.0,
      "score": 8,
      "context": [
        {
          "id": "loxt3ho",
          "author": "onefootback",
          "body": "you’re not wrong for feeling this way, especially considering the fact that this isn’t the first time this has happened. if he knows you have an ed and is still making these comments then he’s really shitty but honestly even if you didn’t it’s still shitty to comment on how much a person is eating",
          "created_utc": 1727307306.0
        }
      ]
    },
    {
      "id": "lp9im1p",
      "author": "clumsysav",
      "body": "This isn’t healthy honey. I’ve been there. Please remember you need to take care of yourself. Just like a recovering addict needs to avoid triggers, so do we. 💚",
      "created_utc": 1727479953.0,
      "score": 3,
      "context": [
        {
          "id": "loyn9th",
          "author": "PetitePretty1",
          "body": "About a year or so ago, I went back into an outpatient ED program...my eating wasn't good at all (bingeing). I was really self conscious about it and my partner would often comment about what I was eating and how much etc. It really did a number on me. I ended up turning things around and now we both seem much happier but I've never felt comfortable eating in his presence since. He always seems to have some kind of commentary if I'm not eating what he thinks is \"healthy\".",
          "created_utc": 1727318753.0
        }
      ]
    },
    {
      "id": "lozmptg",
      "author": "Swimming-Wafer6547",
      "body": "I did start crying a little, because it frustrates me. I do not have diagnosed ED, but I certainly have my issues with eating, I would say I am an emotional eater I just love my food. But I eat healthy most of the time, that’s why don’t understand  why he feels the need to comment.",
      "created_utc": 1727338561.0,
      "score": 4,
      "context": [
        {
          "id": "loz4bx9",
          "author": "SnowDiamond828",
          "body": "so awful if my bf said this to me i would actually start crying i’m sorry op",
          "created_utc": 1727326805.0
        }
      ]
    },
    {
      "id": "lozmvhu",
      "author": "Swimming-Wafer6547",
      "body": "thank you, I will. Even though he maybe not mean it to be hurtful, it hurts me. He just does not understand why I am making big deal out of it.",
      "created_utc": 1727338671.0,
      "score": 1,
      "context": [
        {
          "id": "loz8149",
          "author": "meta_muse",
          "body": "Omg I hate this so much for you. People commenting on what others eat is so rude. He should know that food is a sensitive topic and to keep certain things to himself. Your feelings are totally valid. Definitely have a conversation with him about it.",
          "created_utc": 1727328897.0
        }
      ]
    },
    {
      "id": "lozn58l",
      "author": "Swimming-Wafer6547",
      "body": "Right. I don’t know why people do this. It just makes me wonder if I am the odd one and these comments are completely fine and ‘normal’ people are not bothered or not even notice it?",
      "created_utc": 1727338861.0,
      "score": 1,
      "context": [
        {
          "id": "lozd97o",
          "author": "angiebeany",
          "body": "This is why I'm staying single. Even without an eating disorder other halfs just seem to comment on whatever you eat or drink 😠. 'ooh a cup of tea' 'a sandwich?' 'you love your potatoes don't you' OMG",
          "created_utc": 1727332088.0
        }
      ]
    },
    {
      "id": "lpamvvr",
      "author": "Emergency_Airline_10",
      "body": "very mature",
      "created_utc": 1727497535.0,
      "score": 1,
      "context": [
        {
          "id": "loyfwy9",
          "author": "misstealyourmans",
          "body": "break up with him",
          "created_utc": 1727315837.0
        }
      ]
    },
    {
      "id": "lozmbaw",
      "author": "Swimming-Wafer6547",
      "body": "That is really food advice, thank you. I am sure that he does not want to hurt me, we just need to communicate better and set some boundaries about this topic.",
      "created_utc": 1727338277.0,
      "score": 2,
      "context": [
        {
          "id": "loy0alc",
          "author": "FairyFortunes",
          "body": "I think he may be obsessed with your eating habits because he knows you have an eating disorder.  I don’t think he’s intentionally being controlling but his concern isn’t helpful.\n\nIf this were me, I’d say, “Hey I wanted to talk to you about something.  You know eating is a bit of a touchy subject for me.  You are so good to me.  I’m hoping you can help me with something.  I feel really flustered when you make comments about what I’m eating.  I know you’re a good person and you don’t mean to hurt me but in the moment, I get flustered and upset.  It would really help if you didn’t make any comments about my food.”\n\nThen if he comments on your food, you can remind him.  “Hey babe.  Remember when I told you it would really help me if you stopped making comments about portions and food?  Your comment is making me feel flustered and upset.  I’m sure I’ll be fine if we change the subject.”",
          "created_utc": 1727309956.0
        }
      ]
    },
    {
      "id": "lp1wluj",
      "author": "meta_muse",
      "body": "Have you confided in him whyy it hurts you so bad?",
      "created_utc": 1727372123.0,
      "score": 1,
      "context": [
        {
          "id": "loz8149",
          "author": "meta_muse",
          "body": "Omg I hate this so much for you. People commenting on what others eat is so rude. He should know that food is a sensitive topic and to keep certain things to himself. Your feelings are totally valid. Definitely have a conversation with him about it.",
          "created_utc": 1727328897.0
        },
        {
          "id": "lozmvhu",
          "author": "Swimming-Wafer6547",
          "body": "thank you, I will. Even though he maybe not mean it to be hurtful, it hurts me. He just does not understand why I am making big deal out of it.",
          "created_utc": 1727338671.0
        }
      ]
    }
  ]
}