{
  "id": "1fqvhb5",
  "subreddit": "EatingDisorders",
  "author": "cinnamonrollsssssss",
  "created_utc": 1727464070.0,
  "title": "How do you deal with triggering friends?",
  "selftext": "I hate that EVERYBODY SAYS STUPID COMMENTS ALL THE TIME.\nI don‘t care how much you weigh. I don‘t want to know that you skipped breakfast. I don‘t want to see that you always look up the nutrition data of a meal before you eat it. I don‘t want to know how many times you‘ve been to the gym this week. I don’t want to hear you say that you feel fat. I don‘t fucking care that you think I lost weight. I don’t want you to comment on my body. \nFUCK YOU. \nWhy do you always say these stupid things?\nWhy does everybody say these things???\nIf it weren‘t for you I wouldn‘t even have this stupid disorder. \nI‘m doing better and I am trying everyday but then these people come along and say stupid things and I am triggered. It hurts even more when it‘s from a friend. I don’t even know what to say in such a moment and also sometimes I simply don’t have the energy to stand up for myself or others and explain the issue. \nHow do you deal with triggers especially from close friends? (they don’t know I have an ed)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1fqvhb5/how_do_you_deal_with_triggering_friends/",
  "score": 60,
  "num_comments": 14,
  "comments": [
    {
      "id": "lpakj6d",
      "author": "alienprincess111",
      "body": "I hate when people comment that ive lost weight.  It makes me feel like they are figuring out I have an ED.  I wish people would just mind their own business.",
      "created_utc": 1727496301.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lpb58do",
      "author": "AssociateSpecific287",
      "body": " Set boundaries and tell them that you're uncomfortable. If they don't stop or listen, stop being friends with them or distance yourself even if its hard to. There are other people that you can be friends with. Always put your health first. If they're making your recovery harder than it should be, then it's not worth letting them stay if they're not willing to listen or change. you don't have to tell them about your anorexia but you need to set those boundaries theyre sooo important because if they don't know its not okay they won't even try to do a double take and stop themselves from making these types of comments. Don't take this the wrong way, but some of those comments have been normalized or are 2nd nature to some people, so a lot of times they're not doing it on purpose, nor are they trying to that's why we need to  either 1. set boundaries 2. distance ourselves from these types of people or 3. completely drop them in order to continue our recovering journey.",
      "created_utc": 1727508764.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lpb5shd",
      "author": "Lfyn13",
      "body": "I knowww, it’s so fucking annoying 😭 my friend was like ‘ohh when I eat cake I just make sure to eat nothing else for three days 😁😁’ like no.. let’s not please 😭😭",
      "created_utc": 1727509149.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpc613w",
      "author": "honalele",
      "body": "communicate that food and weight talk is not safe to talk about with you around. if you genuinely don’t want to hear those statements, tell them.",
      "created_utc": 1727530618.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpcrngi",
      "author": "immersed_in_thom",
      "body": "It’s rly hard to tackle cuz the world doesn’t operate the way we do when we are in recovery or trying to get well. Ppl are always going to make stupid comments or talk about food and “goals” etc. and guess we hafta learn to deal with this fact that the whole world won’t bend to make us feel better and make sure we are In a bubble\n I say that to my kids in eating disorder res where I work and tell them to set boundaries with family and close friends and remove themselves from conversations and situations that are too much or too triggering as well as to speak up for themselves. I remind them that they have to expect they will not b fully insulated from cruel and uncomfortable things all the time “in the real world”\nI work where I do bc I have been thru it. I know it’s maddening and it’s really fukking hard to deal with the triggers around us. but I’ve been on a mission to be an educator and advocate and teach about Ed’s. And I still practice using my voice. Idk if this helps but I understand and unfortunately it won’t always be possible to get away from these things.  That’s where our tools come in",
      "created_utc": 1727538479.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lptfrj7",
      "author": "gracey228",
      "body": "honestly it’s so hard, it feels like when people know you have anorexia especially in recovery they love to talk about their own weight issues… like my eating disorder is not a topic i want to speak on and compare. my mom does this she always tells me “i haven’t ate in two days in so skinny” “at least you have curves i have none” etc and i just try to politely tune her out .. for my own mental health",
      "created_utc": 1727793139.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpc5qrs",
      "author": "Unlikely-Ordinary653",
      "body": "Me and my bff do not participate in toxic diet culture ❤️",
      "created_utc": 1727530501.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpcbmfr",
      "author": "None",
      "body": "It’s hard. I walk away. I tried to say things but they just come back with their ingrained diet culture.",
      "created_utc": 1727532824.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpmestz",
      "author": "choisyuu",
      "body": "I went to a private school and almost EVERYONE is underweight there. Some of them are genetics and many of them have ED. Ive been struggling with ED for a year now. somedays i dont eat almost anything and the next i eat sm that is throw up. My bmi is 19 and since a lot of my friends have bmi below 17, they always proceed to make comments about my body and i always just laughed it off, but after returning home, i cried a lot. Im homeschooled now and im better off without any friends besides one. Shes naturally really skinny and its so horrible looking at myself around her, but i somehow managed to make my peace with it and now were really good friends. I wish i could help but the only thing that worked out for me was distancing myself and cutting them off, then switching to homeschooling.",
      "created_utc": 1727685566.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpofr84",
      "author": "Own-Jury-7204",
      "body": "girl i know it’s frustrating but u can’t really change people. it’s always going to trigger u. u have to learn how to deal with your triggers. i’m sorry. world is not all glitter and rainbow. people say dumb shit. just don’t listen to them",
      "created_utc": 1727716829.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lponkbd",
      "author": "Next_Example_9543",
      "body": "i js kinda pull them to the side and privately explain what’s going on and how it makes me feel and if it doesn’t stop i stop interacting with them",
      "created_utc": 1727719288.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpoy2k1",
      "author": "None",
      "body": "Because it is cultural. You will always find comments like those, they are harmful I know, but not for everyone at the same level, most of the people don't even understand how a comment about food or body can potentially hurt someome. The good thing about friends is that you can share how you feel about it and maybe they can work on it.\nIt is something deeply rooted btw, no wonder why it is called diet culture.",
      "created_utc": 1727722613.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxs8eka",
      "author": "Ok_Broccoli_8865",
      "body": "What if I’m in boarding school and live with the person? I don’t really know what to do because I am constantly with them and don’t have a choice",
      "created_utc": 1731950253.0,
      "score": 1,
      "context": [
        {
          "id": "lpb58do",
          "author": "AssociateSpecific287",
          "body": " Set boundaries and tell them that you're uncomfortable. If they don't stop or listen, stop being friends with them or distance yourself even if its hard to. There are other people that you can be friends with. Always put your health first. If they're making your recovery harder than it should be, then it's not worth letting them stay if they're not willing to listen or change. you don't have to tell them about your anorexia but you need to set those boundaries theyre sooo important because if they don't know its not okay they won't even try to do a double take and stop themselves from making these types of comments. Don't take this the wrong way, but some of those comments have been normalized or are 2nd nature to some people, so a lot of times they're not doing it on purpose, nor are they trying to that's why we need to  either 1. set boundaries 2. distance ourselves from these types of people or 3. completely drop them in order to continue our recovering journey.",
          "created_utc": 1727508764.0
        }
      ]
    }
  ]
}