{
  "id": "1frm2i3",
  "subreddit": "EatingDisorders",
  "author": "HailSneazer",
  "created_utc": 1727551634.0,
  "title": "Oposite action: the most effective and painful tool in my tool box",
  "selftext": "Ive been in recovery for over 2 years.  The one tool that has worked the best for me is Opposite action. If ED tells me to not do something, I do it, immediately. As soon as I feel the fear bite when I look at a certain food. As soon as my ED brain starts barking about how many calories something is, that means I need to eat that. If something makes the ED brain scared that means it is probably a good thing. The ED brain's goal is for me to die. Therefore anything that it doesn't like is probably a good thing.  However holy crap is that uncomfortable. Every time I violate what it wants it gets angry. It tries to make me as anxious and uncomfortable to get me not to do what it doesn't want me to do. so the best thing to do is to do the action and do it quickly. The more time I wait the more time I give it to possibly win.\n\nIn short. Opposite action, probably the number 1 reason I'm alive but holy crud does it not feel pleasant in the moment",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1frm2i3/oposite_action_the_most_effective_and_painful/",
  "score": 37,
  "num_comments": 3,
  "comments": [
    {
      "id": "lpee9xc",
      "author": "Less_Row4641",
      "body": "this is an excellent point, and absolutely not something i wanted to hear today.\n\nso thank you, because i did need it.",
      "created_utc": 1727558778.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lpolctm",
      "author": "meta_muse",
      "body": "Wow I’m honestly really impressed with your story. That takes a lot of bravery to face this and so what you did.",
      "created_utc": 1727718590.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpn1aq7",
      "author": "lady_tsunami",
      "body": "I currently only have opposite action in my skill tool box - and HOLY CRAP DOES IT SUCK. \n\nIt works. But as I tell my therapist “thanks, I hate it” - which ya know might SOUND unhelpful- but acknowledging the difficulty helps",
      "created_utc": 1727699074.0,
      "score": 1,
      "context": []
    }
  ]
}