{
  "id": "1fry4uw",
  "subreddit": "EatingDisorders",
  "author": "ThrowawayAcount120",
  "created_utc": 1727591362.0,
  "title": "I'm concerned about my daughters eating habits",
  "selftext": "Hi, I have a 14 year old daughter and over the past few months I've grown worried about her eating habits. She has lost quite a bit of weight in a short amount of time, and on multiple occasions has expressed hating her body.\n\nFrom what I can gather she doesn't eat anything most days, and on days where she does it's not a lot of food. I'll also see her make food but not eat it quite often I'm sure if thats related though. \n\nI've approached her about this once and she got very defensive and swore she was eating frequently but just didn't like eating with an audience.  \n\nI'm very worried about her. I don't know how to get her help or what to say to her. I also dont know if I'm just reading too far into things. She's my world and I would do anything to help her. \n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1fry4uw/im_concerned_about_my_daughters_eating_habits/",
  "score": 140,
  "num_comments": 59,
  "comments": [
    {
      "id": "lpgsgj1",
      "author": "Excellent-World-476",
      "body": "Get her to a doctor and don’t just sit back and watch. She won’t volunteer she has an issue and she will be angry. Those are red flags. The longer you leave it, the harder it will be to address it and treat the issue. Eating disorders are deadly illnesses.  It is common for someone with an ED to insist they eat better alone and to be untruthful about their actual intake. It is part of the illness.",
      "created_utc": 1727599812.0,
      "score": 219,
      "context": []
    },
    {
      "id": "lphgy0a",
      "author": "Separate_Tangelo7138",
      "body": "I wish when I was a teenager that someone would’ve noticed I was going through an ED so I could’ve gotten help. I mean I was in therapy for other things, but I wasn’t really underweight so the ED flew under the radar. At the time I just wanted someone to acknowledge that I was hurting, but that didn’t really happen until it really escalated when I was like 20.\n\nI would’ve been pissed at the time if someone was calling out my ED behaviors, but as an adult I would look back and really appreciate it.\n\nGood luck with your daughter, I think you’re doing the right thing by talking to a doctor. She will probably be upset temporarily, but she will always remember you were there for her.",
      "created_utc": 1727614660.0,
      "score": 50,
      "context": []
    },
    {
      "id": "lph6ck9",
      "author": "b1gballz69",
      "body": "definitely agree with the other comment, don't sit back and watch it happen. I've seen people close to me (not close enough to be able to do anything) completely deteriorate from an eating disorder and it's really scary and horrible for both you and them. \nyou're completely doing the right thing by taking her to the doctors, that will hopefully give you some peace of mind that she's in the right hands, I hope that your daughter has an easy road to recovery ❤️‍🩹 this sub is great, comment any time you need to have a bit of insight into the minds of people with eating disorders to give you a bit of an idea what your daughter's going through x",
      "created_utc": 1727609229.0,
      "score": 23,
      "context": []
    },
    {
      "id": "lphhm02",
      "author": "WayApprehensive2054",
      "body": "When I was at my lowest and worst point mentally and physically, I was still in denial and did not seek help myself. My parents had to force me (as I was a minor at the time) to see the doctor and go into treatment. I am very grateful that they did so because it saved my life. OP, your daughter may seem to be angry now but saving her life is more important than satisfying her ED. Recovery is no walk in the park either, it can be hell for the patient and their parents. Remember to keep in mind the bigger picture and that things will get better. The first step was realizing your daughter had a problem and doing something about it.",
      "created_utc": 1727614958.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lphpp4s",
      "author": "girly-worm",
      "body": "I totally agree with other comments here. And I’ll add that if this isn’t addressed now, you’ll watch her suffer with an ED for years (if that’s what’s going on). The longer this goes untreated, the harder it is to treat. I finally recovered in my 30s. Years my mother watched me go through this and there was nothing she could do when I was an adult making my own decisions - and unable to see how sick I was on my own.",
      "created_utc": 1727618319.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lpiwxnu",
      "author": "Still_Extent_5141",
      "body": "Not eating in front of others is a classic ED move. Or she's actually not eating, which is worse. Please help her without being judgmental. She didn't choose this but it's highly dangerous. Get her as much help as you can.",
      "created_utc": 1727632651.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lpjg8bc",
      "author": "toadstoolberry",
      "body": "your daughter is at the age when my eating disorder was at its absolute peak and I depleted my body down to a BMI that should’ve ended me up in the hospital. I never reached out for help, and ten years later I still heavily struggle mentally, even if my body is in a healthy(er/ish) place. please get her help while she’s young now\n\nBe prepared for her to fight you on it, maybe to resent you for a while over it. She will be so thankful in the future when she’s hopefully not still drowning in this hell hole",
      "created_utc": 1727638643.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lpjehh1",
      "author": "RMR808",
      "body": "When I was 14 my mom realized I had an eating disorder. She shamed me, got me 1 appointment with once counsellor and then never acknowledged it again. I was so incredible sick for so many years. I am 36 AND STILL battling an eating disorder (albeit to a lesser degree). I hate it. It’s been ruining my life for over 20 years. I wish my mom (and Dad!) had gotten me the help I needed. I was so young, I was a child, I needed intensive treatment, and quite frankly I still do. Please do absolutely everything in your power to save her.",
      "created_utc": 1727638106.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lpjzoe3",
      "author": "ContributionNeat6181",
      "body": "As an adult woman who had an eating disorder for 38 years, get her into treatment now! whatever she is willing to tell you is only 1/4 of what she’s doing. I waited way too long to get help and it took so long to get to recovery. I have resources if you want there are some online support groups for caregivers as well.",
      "created_utc": 1727644734.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lpidz3s",
      "author": "None",
      "body": "I was diagnosed with my ED when I was 12. My advice is yes go to Dr, but also approach the situation carefully. the approach my parents used was more traumatic than helpful, but they were just doing their best and listening to drs. I don’t want to stress you out, but if her Ed is severe, the way this is addressed can have serious ramifications on family dynamics and her in the future. I’m in my 20s and still trying to recover from the trauma of the way my ED was treated",
      "created_utc": 1727626796.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lpjpjlx",
      "author": "pleasant-thoughts",
      "body": "Take her to the GP. I struggled with eating as a teenager and it wasn’t that bad, but because these things weren’t resolved when I was younger, the issues were still there and things therefore got a lot worse once I got older. In hindsight I wish somebody would have helped me then so that I didn’t have to go through what I do / did now.",
      "created_utc": 1727641482.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lpmwarr",
      "author": "allofme6",
      "body": "Most Dr don't get enough training for ED so please try to get an ED specialized Dr",
      "created_utc": 1727696700.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lpjxpft",
      "author": "AwakeInDreamland",
      "body": "I am in current hell watching my 26 yo daughter struggle to get help/healthy.. when she was younger we had her go to a therapist who did not think she needed a higher level of care because she appeared to want to get better. She was always petite but never looked sick. She went off to college and got a job in NYC and then the pandemic hit… it spiraled her out of control and by then she was an adult.. \n\nShe is currently IP but I fear she will never fully exorcise the ED demon… and trust me when I tell you.. it is an insidious and evil demon that will stop at nothing to destroy your beautiful daughter. \n\nGET HER HELP NOW.",
      "created_utc": 1727644084.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lpixd8n",
      "author": "katieznizzle",
      "body": "Take her to a doctor asap. I wish my parents cared enough to get me help. It took me 20+ years to recover on my own. She will be really mad at you but in the end she will know you love her. You care OP. That goes a long way with kids. If my mother cared, things would have been a lot different for me. You seem like a great parent. Asking for advice just shows how much you care for her. She will appreciate you for this. It might take time but she will never forget. Good luck!",
      "created_utc": 1727632778.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpmb16b",
      "author": "brokenagain2022",
      "body": "I just want to send a virtual hug.\nI am currently dealing with the same, with my 15 year old daughter. I believe that she only eats when she is in front of me (dinner) and even then she doesn’t eat much. She will say she is tired, doesn’t feel good, just not really hungry- etc. \nShe wears huge baggy sweatshirts even on the hottest days. When I question her, she says it is cold at school. I thought for a while that she wore them because she felt uncomfortable about her body and felt better covering up more. Not I realize she does it so that we cannot see so easily how much weight she is dropping. \nCurrently waiting on a referral for her to see a therapist for an eval. So worried about her all the time, and really scared because if I am being honest, I have no idea how I will pay for therapy as we are barely making ends meet now.",
      "created_utc": 1727682790.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpmtkrx",
      "author": "archangelofthepit",
      "body": "the other comments have already given good advice, so i'd just like to pop in and say thank you for noticing. i'm 22 now, disordered since 14, and neither parent realise how badly i've struggled for that long. seeing a parent who truly cares and wants to understand is so, so refreshing. sending my love to you and your daughter, i hope she can get the medical & mental help she needs because she evidently has a fantastic emotional support system in you, and i wish you all the strength and success in the world <3",
      "created_utc": 1727695288.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpng2u2",
      "author": "None",
      "body": "my biggest advice is to keep her of social media during her recovery ❤️ good luck mamas also my parents forced me into treatment at 13 and i hated them for it. obviously now im grateful now but dont be surprised if shes not fond with the idea. do as much research as you can about eating disorders it will help you understand what she’s going through. for me my ed was accompanied by self harm and substance abuse issues so just keep an eye out for that aswell. im proud of you for helping her💕",
      "created_utc": 1727705028.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lppqlmf",
      "author": "VastReveries",
      "body": "Get her help now. I wish my parents did. I'm a registered dietitian. Please DM me, and I'll send resources.",
      "created_utc": 1727731615.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpjdajc",
      "author": "mooneyedbaby",
      "body": "You’re right to seek advice and I’m happy to see from the comments that you plan to get medical help as well. You’re doing the right thing. When I was about 10 I went through the same thing and thankfully my parents found out and shut it down immediately. They might have saved my life for all I know. Like some of the others said, the sooner yall handle this the better. Your kid will probably be angry and defensive but just trust that you’re doing what’s best and they’ll be smart enough to come around eventually once they’re older and see it differently. \nAlso I totally get the not eating for an audience thing. That probably is true, especially if there is an eating disorder happening here. I have the same issue but I would imagine that trying to desensitize them to that (through therapy or with the help of a professional) would be for the best because trust me when I say how much or sucks and how difficult it is that I have such a hard time eating around others or eating when I’m sober/not high on weed. \nI wish you and your daughter all the best luck with her recovery and y’all’s relationship as yall work on getting her healthy.",
      "created_utc": 1727637741.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpkwmfy",
      "author": "Ok_Environment_9843",
      "body": "Doctor or nutritionist. Specifically one who specializes in female bodies. As her hormones change so does her eating habits. Also a therapist. You need to teach her about how her physiological affects her mental and vice versa. I had a therapist tell me once that I always seem to starve binge purge the most around my menstrual cycle. Now at 33 I pay attention and prepare for times when I might be emotionally unregulated. Also learning about stress on the body, so yes she might lose weight fast but learning a balanced diet and healthy relationship with food with allow her to be fit over time. Also read with caution but I would Start watching movies like Kill Bill or any movie with Jennifer Lopez or Halle Berry where the leading woman needs to be healthy not THIN. That helped me. Be careful as that could be triggering. The point is start promoting people who have healthy habits and in turn healthy bodies. You might want to ask her to start doing “TikTok hangs” and download Tik Tok and scroll with her or start watching with her\nSo when she gets targeted with ED / thinspo content you can say “oh no! That girl looks unhealthy. I’m so happy you look so beautiful happy and healthy :).”",
      "created_utc": 1727657061.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpl18d0",
      "author": "ScotchTapeConnosieur",
      "body": "I want to help you get out in front of this as a parent who successfully treated our child for a restrictive eating disorder. Weight loss at that age, when she should be growing and GAINING weight can be a trigger for a physiological process that in some people leads to an eating disorder. \n\nContact [Equip Health](https://equip.health/). They helped us after dealing with other mainstream treatment modalities failed. ED’a can be incredibly hard to treat, and it’s important that you approach it with the most evidence-based modalities available. \n\nPlease DM if you’d like more info.",
      "created_utc": 1727658888.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lplfwtb",
      "author": "The_Bastard_Henry",
      "body": "Get her into therapy. And if you have the means, get a nutritionist as well to help her eat healthy and learn about how different foods affect the body. I lost YEARS of my life as a slave to anorexia and it took me just as many years to break free from it. Maybe also encourage her to read about people like us who have recovered, and how the disorder has left permanent scars on our bodies. Good luck ♥️♥️",
      "created_utc": 1727664781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lplh5ru",
      "author": "Krwb_2003",
      "body": "Just here to say I wish someone would’ve done what your doing, but my moms very heavy set so I don’t think she ever saw an issue with how skinny I was. I was deathly thin for many years cuz I wouldn’t eat. And it wasn’t until I got pregnant years after moving out of her house that I changed for the better, and now I get all kinds of comments from her",
      "created_utc": 1727665312.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lppbf9u",
      "author": "Elephant984",
      "body": "As everyone else is saying, get her help but be aware that the doctor might say everything was fine. When I went to my doctors appointments when I was having the ED, they didn’t do anything, we had to ask my therapist. The doctors said I was fine because I was at an ok weight and fine for now. They let it get really bad and even then it was my therapist saying I needed more care, not my doctor. Doctors don’t always understand what an ED is or how serious it is and my doctors just thought it would get better on its own. I would look for a nutritionist or ED clinic/program for an evaluation. I know that may seem like a lot considering it seems like she hasn’t done treatment before but if I had a nutritionist earlier I truly think my ED would be so much less of a problem! Sending love to you and your daughter and you sound amazing, she’s lucky to have you!",
      "created_utc": 1727726766.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpq7636",
      "author": "None",
      "body": "I’m starting to suspect I have an ED (I’m 20) and I tell people the same thing. Please please PLEASE get her the help she deserves and NEEDS.  I wish I didn’t do this shit, but I do. The last thing I want is a child to do this.",
      "created_utc": 1727737557.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpqlxfm",
      "author": "Pandatoke",
      "body": "Find her a doctor. I hid mine for years and still deal with the repercussions 20 years later",
      "created_utc": 1727743006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpsyvqf",
      "author": "Rude-Iron-369",
      "body": "Doctor and possibly a nutritionist.",
      "created_utc": 1727786913.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpu66u9",
      "author": "Natural_Function_342",
      "body": "Suggest you should start eating family dinners",
      "created_utc": 1727801766.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lq2rnm2",
      "author": "None",
      "body": "Try to get her in with a therapist who specializes in ED’s and a dietitian who specializes in ED’s.  Make sure they actually specialize in eating disorders. Therapists and dietitians that don’t specifically specialize in ED’s typically don’t know how to treat them",
      "created_utc": 1727921630.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lpjo3ro",
      "author": "CrazyOne8727",
      "body": "my mom used to force me to eat in front of her and although i HATED it sooo much, she was doing it for me. i wouldn’t eat all day and i would come home to 2 chicken breasts and she would sit there and not leave until i would eat them. maybe you could try making food you know she likes? it’s a shitty situation 100% but she’s young & you are her parent so unfortunately, too fucking bad for her🤷‍♀️tough love is really the only thing that will help in my opinion",
      "created_utc": 1727641040.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lpgthx9",
      "author": "ThrowawayAcount120",
      "body": "Im making an appointment in the morning. You're right, I can't sit back and watch, I can't let her get worse.",
      "created_utc": 1727600542.0,
      "score": 124,
      "context": [
        {
          "id": "lpgsgj1",
          "author": "Excellent-World-476",
          "body": "Get her to a doctor and don’t just sit back and watch. She won’t volunteer she has an issue and she will be angry. Those are red flags. The longer you leave it, the harder it will be to address it and treat the issue. Eating disorders are deadly illnesses.  It is common for someone with an ED to insist they eat better alone and to be untruthful about their actual intake. It is part of the illness.",
          "created_utc": 1727599812.0
        }
      ]
    },
    {
      "id": "lpnzwxj",
      "author": "NothingFlat2109",
      "body": "this is so important, I remember expressing similar things to my mother, but she has an avoidant coping style, so it just got worse and worse. I know it's not her fault, and it may have happened either way, but I also know it could've been different",
      "created_utc": 1727711727.0,
      "score": 3,
      "context": [
        {
          "id": "lpgsgj1",
          "author": "Excellent-World-476",
          "body": "Get her to a doctor and don’t just sit back and watch. She won’t volunteer she has an issue and she will be angry. Those are red flags. The longer you leave it, the harder it will be to address it and treat the issue. Eating disorders are deadly illnesses.  It is common for someone with an ED to insist they eat better alone and to be untruthful about their actual intake. It is part of the illness.",
          "created_utc": 1727599812.0
        }
      ]
    },
    {
      "id": "lpmf257",
      "author": "steampxnkpirate",
      "body": "happy cake day!",
      "created_utc": 1727685752.0,
      "score": 1,
      "context": [
        {
          "id": "lphgy0a",
          "author": "Separate_Tangelo7138",
          "body": "I wish when I was a teenager that someone would’ve noticed I was going through an ED so I could’ve gotten help. I mean I was in therapy for other things, but I wasn’t really underweight so the ED flew under the radar. At the time I just wanted someone to acknowledge that I was hurting, but that didn’t really happen until it really escalated when I was like 20.\n\nI would’ve been pissed at the time if someone was calling out my ED behaviors, but as an adult I would look back and really appreciate it.\n\nGood luck with your daughter, I think you’re doing the right thing by talking to a doctor. She will probably be upset temporarily, but she will always remember you were there for her.",
          "created_utc": 1727614660.0
        }
      ]
    },
    {
      "id": "lpjb3ui",
      "author": "ThrowawayAcount120",
      "body": "It's just me and her, and we have gone through a lot together. Even if the process of her getting better is long and difficult I'll stick with her. I'll always be there for her even if she hates me for it.",
      "created_utc": 1727637058.0,
      "score": 17,
      "context": [
        {
          "id": "lphhm02",
          "author": "WayApprehensive2054",
          "body": "When I was at my lowest and worst point mentally and physically, I was still in denial and did not seek help myself. My parents had to force me (as I was a minor at the time) to see the doctor and go into treatment. I am very grateful that they did so because it saved my life. OP, your daughter may seem to be angry now but saving her life is more important than satisfying her ED. Recovery is no walk in the park either, it can be hell for the patient and their parents. Remember to keep in mind the bigger picture and that things will get better. The first step was realizing your daughter had a problem and doing something about it.",
          "created_utc": 1727614958.0
        }
      ]
    },
    {
      "id": "lpj5x4d",
      "author": "ThrowawayAcount120",
      "body": "I would never judge her, she's struggling in a way I can't fully grasp. I don't have a right to say anything about whats going on in her mind. Even if I don't understand fully, my baby's hurting and I'll do anything to help her.",
      "created_utc": 1727635420.0,
      "score": 10,
      "context": [
        {
          "id": "lpiwxnu",
          "author": "Still_Extent_5141",
          "body": "Not eating in front of others is a classic ED move. Or she's actually not eating, which is worse. Please help her without being judgmental. She didn't choose this but it's highly dangerous. Get her as much help as you can.",
          "created_utc": 1727632651.0
        }
      ]
    },
    {
      "id": "lpjetd1",
      "author": "ThrowawayAcount120",
      "body": "I'm so sorry they didn't get you help when you needed it. I absolutely will do anything and everything to help her.",
      "created_utc": 1727638206.0,
      "score": 4,
      "context": [
        {
          "id": "lpjehh1",
          "author": "RMR808",
          "body": "When I was 14 my mom realized I had an eating disorder. She shamed me, got me 1 appointment with once counsellor and then never acknowledged it again. I was so incredible sick for so many years. I am 36 AND STILL battling an eating disorder (albeit to a lesser degree). I hate it. It’s been ruining my life for over 20 years. I wish my mom (and Dad!) had gotten me the help I needed. I was so young, I was a child, I needed intensive treatment, and quite frankly I still do. Please do absolutely everything in your power to save her.",
          "created_utc": 1727638106.0
        }
      ]
    },
    {
      "id": "lppbni8",
      "author": "Elephant984",
      "body": "This!!! And doctors say really negative things about ED’s/make food judgments and will tell you your weight even when you ask them not to! Everytime I go to the doctors they always let me see it or talk about it even though they know I have an ED",
      "created_utc": 1727726840.0,
      "score": 3,
      "context": [
        {
          "id": "lpmwarr",
          "author": "allofme6",
          "body": "Most Dr don't get enough training for ED so please try to get an ED specialized Dr",
          "created_utc": 1727696700.0
        }
      ]
    },
    {
      "id": "lpmuai5",
      "author": "archangelofthepit",
      "body": "i can't imagine how horrible watching your daughter struggle has been. you're right to describe it as a demon, it really does take over. sending you all the love in the world, and i believe she'll get better. recovery is hard but your love & support for her is evident through the screen and i hope things get better soon for her and you <3 you've both got this !!",
      "created_utc": 1727695665.0,
      "score": 2,
      "context": [
        {
          "id": "lpjxpft",
          "author": "AwakeInDreamland",
          "body": "I am in current hell watching my 26 yo daughter struggle to get help/healthy.. when she was younger we had her go to a therapist who did not think she needed a higher level of care because she appeared to want to get better. She was always petite but never looked sick. She went off to college and got a job in NYC and then the pandemic hit… it spiraled her out of control and by then she was an adult.. \n\nShe is currently IP but I fear she will never fully exorcise the ED demon… and trust me when I tell you.. it is an insidious and evil demon that will stop at nothing to destroy your beautiful daughter. \n\nGET HER HELP NOW.",
          "created_utc": 1727644084.0
        }
      ]
    },
    {
      "id": "lpmulta",
      "author": "archangelofthepit",
      "body": "the fact you recovered on your own is incredible, no matter how long it took, and i hope you know that and are so proud of yourself, because even as a complete stranger i'm so proud of you :•)",
      "created_utc": 1727695831.0,
      "score": 1,
      "context": [
        {
          "id": "lpixd8n",
          "author": "katieznizzle",
          "body": "Take her to a doctor asap. I wish my parents cared enough to get me help. It took me 20+ years to recover on my own. She will be really mad at you but in the end she will know you love her. You care OP. That goes a long way with kids. If my mother cared, things would have been a lot different for me. You seem like a great parent. Asking for advice just shows how much you care for her. She will appreciate you for this. It might take time but she will never forget. Good luck!",
          "created_utc": 1727632778.0
        }
      ]
    },
    {
      "id": "lpng7yg",
      "author": "AwakeInDreamland",
      "body": "You are amazing! Believe me when I tell you that having loving and supportive parents don’t always equate to success (see my post above). I hope my daughter beats this (as you did) because she has so much to offer the world even if she doesn’t think so.",
      "created_utc": 1727705080.0,
      "score": 1,
      "context": [
        {
          "id": "lpixd8n",
          "author": "katieznizzle",
          "body": "Take her to a doctor asap. I wish my parents cared enough to get me help. It took me 20+ years to recover on my own. She will be really mad at you but in the end she will know you love her. You care OP. That goes a long way with kids. If my mother cared, things would have been a lot different for me. You seem like a great parent. Asking for advice just shows how much you care for her. She will appreciate you for this. It might take time but she will never forget. Good luck!",
          "created_utc": 1727632778.0
        }
      ]
    },
    {
      "id": "ly1dqmz",
      "author": "Flat_Assistant_2162",
      "body": "How hard is your job with the disorder? I know many go into the field.. is it triggering for you?",
      "created_utc": 1732070597.0,
      "score": 1,
      "context": [
        {
          "id": "lppqlmf",
          "author": "VastReveries",
          "body": "Get her help now. I wish my parents did. I'm a registered dietitian. Please DM me, and I'll send resources.",
          "created_utc": 1727731615.0
        }
      ]
    },
    {
      "id": "lpngzsa",
      "author": "AwakeInDreamland",
      "body": "Do you mind me asking what mainstream avenues you used and how old your daughter was when you turned to Equip",
      "created_utc": 1727705360.0,
      "score": 1,
      "context": [
        {
          "id": "lpl18d0",
          "author": "ScotchTapeConnosieur",
          "body": "I want to help you get out in front of this as a parent who successfully treated our child for a restrictive eating disorder. Weight loss at that age, when she should be growing and GAINING weight can be a trigger for a physiological process that in some people leads to an eating disorder. \n\nContact [Equip Health](https://equip.health/). They helped us after dealing with other mainstream treatment modalities failed. ED’a can be incredibly hard to treat, and it’s important that you approach it with the most evidence-based modalities available. \n\nPlease DM if you’d like more info.",
          "created_utc": 1727658888.0
        }
      ]
    },
    {
      "id": "lpqm53l",
      "author": "Pandatoke",
      "body": "Thank you for coming here btw. You’ll find support here.",
      "created_utc": 1727743085.0,
      "score": 1,
      "context": [
        {
          "id": "lpqlxfm",
          "author": "Pandatoke",
          "body": "Find her a doctor. I hid mine for years and still deal with the repercussions 20 years later",
          "created_utc": 1727743006.0
        }
      ]
    },
    {
      "id": "lpgu2qe",
      "author": "Excellent-World-476",
      "body": "I’m so glad. It’s hard but this is how you show you love her.",
      "created_utc": 1727600952.0,
      "score": 22,
      "context": [
        {
          "id": "lpgsgj1",
          "author": "Excellent-World-476",
          "body": "Get her to a doctor and don’t just sit back and watch. She won’t volunteer she has an issue and she will be angry. Those are red flags. The longer you leave it, the harder it will be to address it and treat the issue. Eating disorders are deadly illnesses.  It is common for someone with an ED to insist they eat better alone and to be untruthful about their actual intake. It is part of the illness.",
          "created_utc": 1727599812.0
        },
        {
          "id": "lpgthx9",
          "author": "ThrowawayAcount120",
          "body": "Im making an appointment in the morning. You're right, I can't sit back and watch, I can't let her get worse.",
          "created_utc": 1727600542.0
        }
      ]
    },
    {
      "id": "lpkeorw",
      "author": "Ok_Victory_2977",
      "body": "Best of luck, she (or more accurately her eating disorder) will be angry, but I promise you're doing the right thing! I wish my mum hadn't ignored mine and thought it was a phase I'd grow out of, as I think so often about how different things might have been if I got help at 12,13,14 when it was early on and still so much easier to treat successfully; now I'm 31 and still revolving my entire life around my ed, it's such an ingrained coping mechanism that treatment would have  a very low chance of success. \n\nI'm genuinely so proud of you as a mum for reaching out and asking for advice, it's such a difficult situation to be in and navigate around as a parent/loved 1, especially when you want to believe ur daughter, but ur gut is telling u otherwise. Just try to always remember, it's not her answering you when she says \"I've eaten\" or \"I'm so full I ate a ton at school\" etc.. Ed's are incredibly manipulative and make us lie like professionals, on the spot and very convincingly as we will do anything to protect the ed, But she will thank you in the end as it's a lonely miserable place to be in.\n\nHonestly wishing you both the best of luck moving forward and please don't hesitate to come back and ask, if you need any advice or even just to vent, you've got this 🫂💖",
      "created_utc": 1727650115.0,
      "score": 15,
      "context": [
        {
          "id": "lpgsgj1",
          "author": "Excellent-World-476",
          "body": "Get her to a doctor and don’t just sit back and watch. She won’t volunteer she has an issue and she will be angry. Those are red flags. The longer you leave it, the harder it will be to address it and treat the issue. Eating disorders are deadly illnesses.  It is common for someone with an ED to insist they eat better alone and to be untruthful about their actual intake. It is part of the illness.",
          "created_utc": 1727599812.0
        },
        {
          "id": "lpgthx9",
          "author": "ThrowawayAcount120",
          "body": "Im making an appointment in the morning. You're right, I can't sit back and watch, I can't let her get worse.",
          "created_utc": 1727600542.0
        }
      ]
    },
    {
      "id": "lpgzxf6",
      "author": "EmLee-96",
      "body": "Proud of you OP- it'll be a difficult road, but the best road for your family.",
      "created_utc": 1727605094.0,
      "score": 13,
      "context": [
        {
          "id": "lpgsgj1",
          "author": "Excellent-World-476",
          "body": "Get her to a doctor and don’t just sit back and watch. She won’t volunteer she has an issue and she will be angry. Those are red flags. The longer you leave it, the harder it will be to address it and treat the issue. Eating disorders are deadly illnesses.  It is common for someone with an ED to insist they eat better alone and to be untruthful about their actual intake. It is part of the illness.",
          "created_utc": 1727599812.0
        },
        {
          "id": "lpgthx9",
          "author": "ThrowawayAcount120",
          "body": "Im making an appointment in the morning. You're right, I can't sit back and watch, I can't let her get worse.",
          "created_utc": 1727600542.0
        }
      ]
    },
    {
      "id": "lphd6f0",
      "author": "EmbarrassedFault6016",
      "body": "i wish you and your daughter the best luck! its scary but keep giving her unconditional support and love! you’re a good mother and i’m sure that will help with the eating with support from you <3",
      "created_utc": 1727612888.0,
      "score": 6,
      "context": [
        {
          "id": "lpgsgj1",
          "author": "Excellent-World-476",
          "body": "Get her to a doctor and don’t just sit back and watch. She won’t volunteer she has an issue and she will be angry. Those are red flags. The longer you leave it, the harder it will be to address it and treat the issue. Eating disorders are deadly illnesses.  It is common for someone with an ED to insist they eat better alone and to be untruthful about their actual intake. It is part of the illness.",
          "created_utc": 1727599812.0
        },
        {
          "id": "lpgthx9",
          "author": "ThrowawayAcount120",
          "body": "Im making an appointment in the morning. You're right, I can't sit back and watch, I can't let her get worse.",
          "created_utc": 1727600542.0
        }
      ]
    },
    {
      "id": "lpru5jz",
      "author": "None",
      "body": "She will definitely be upset. I know I was when my parents found out. But looking back, I know it was for the best. I probably would have died, had they not intervened. You're doing what's best for her, and I'm sure she will understand when she's older. Best of luck, OP. 🙂",
      "created_utc": 1727762336.0,
      "score": 1,
      "context": [
        {
          "id": "lpgsgj1",
          "author": "Excellent-World-476",
          "body": "Get her to a doctor and don’t just sit back and watch. She won’t volunteer she has an issue and she will be angry. Those are red flags. The longer you leave it, the harder it will be to address it and treat the issue. Eating disorders are deadly illnesses.  It is common for someone with an ED to insist they eat better alone and to be untruthful about their actual intake. It is part of the illness.",
          "created_utc": 1727599812.0
        },
        {
          "id": "lpgthx9",
          "author": "ThrowawayAcount120",
          "body": "Im making an appointment in the morning. You're right, I can't sit back and watch, I can't let her get worse.",
          "created_utc": 1727600542.0
        }
      ]
    },
    {
      "id": "lpkn9mz",
      "author": "None",
      "body": "You are right to get her to the doctor and she will need some therapy. It might take her some time. And it will be in a flux of getting a little better, a little worse, a little better. But you have to remind her how amazing she is and advocate for body positivity and healthy eating habits. Get her into some hobbies she loves if she’s not in them already. Best of luck. My sister got very bad in something similar and my mum wouldn’t listen when I told her to help.",
      "created_utc": 1727653349.0,
      "score": 1,
      "context": [
        {
          "id": "lphhm02",
          "author": "WayApprehensive2054",
          "body": "When I was at my lowest and worst point mentally and physically, I was still in denial and did not seek help myself. My parents had to force me (as I was a minor at the time) to see the doctor and go into treatment. I am very grateful that they did so because it saved my life. OP, your daughter may seem to be angry now but saving her life is more important than satisfying her ED. Recovery is no walk in the park either, it can be hell for the patient and their parents. Remember to keep in mind the bigger picture and that things will get better. The first step was realizing your daughter had a problem and doing something about it.",
          "created_utc": 1727614958.0
        },
        {
          "id": "lpjb3ui",
          "author": "ThrowawayAcount120",
          "body": "It's just me and her, and we have gone through a lot together. Even if the process of her getting better is long and difficult I'll stick with her. I'll always be there for her even if she hates me for it.",
          "created_utc": 1727637058.0
        }
      ]
    },
    {
      "id": "lpjbydr",
      "author": "Still_Extent_5141",
      "body": "We need more moms like you.",
      "created_utc": 1727637326.0,
      "score": 11,
      "context": [
        {
          "id": "lpiwxnu",
          "author": "Still_Extent_5141",
          "body": "Not eating in front of others is a classic ED move. Or she's actually not eating, which is worse. Please help her without being judgmental. She didn't choose this but it's highly dangerous. Get her as much help as you can.",
          "created_utc": 1727632651.0
        },
        {
          "id": "lpj5x4d",
          "author": "ThrowawayAcount120",
          "body": "I would never judge her, she's struggling in a way I can't fully grasp. I don't have a right to say anything about whats going on in her mind. Even if I don't understand fully, my baby's hurting and I'll do anything to help her.",
          "created_utc": 1727635420.0
        }
      ]
    },
    {
      "id": "lpjf799",
      "author": "RMR808",
      "body": "You are a good mom ❤️ I wish I had a mom like you when I was your girl’s age. Together you two will beat this, just be patient with her and keep loving her like you do.",
      "created_utc": 1727638325.0,
      "score": 3,
      "context": [
        {
          "id": "lpjehh1",
          "author": "RMR808",
          "body": "When I was 14 my mom realized I had an eating disorder. She shamed me, got me 1 appointment with once counsellor and then never acknowledged it again. I was so incredible sick for so many years. I am 36 AND STILL battling an eating disorder (albeit to a lesser degree). I hate it. It’s been ruining my life for over 20 years. I wish my mom (and Dad!) had gotten me the help I needed. I was so young, I was a child, I needed intensive treatment, and quite frankly I still do. Please do absolutely everything in your power to save her.",
          "created_utc": 1727638106.0
        },
        {
          "id": "lpjetd1",
          "author": "ThrowawayAcount120",
          "body": "I'm so sorry they didn't get you help when you needed it. I absolutely will do anything and everything to help her.",
          "created_utc": 1727638206.0
        }
      ]
    },
    {
      "id": "lpypvxm",
      "author": "allofme6",
      "body": "They just dint get it. And so many still use bmi which was created by a mathematician not a doctor and doesn't take into account anything other than numbers",
      "created_utc": 1727871059.0,
      "score": 2,
      "context": [
        {
          "id": "lpmwarr",
          "author": "allofme6",
          "body": "Most Dr don't get enough training for ED so please try to get an ED specialized Dr",
          "created_utc": 1727696700.0
        },
        {
          "id": "lppbni8",
          "author": "Elephant984",
          "body": "This!!! And doctors say really negative things about ED’s/make food judgments and will tell you your weight even when you ask them not to! Everytime I go to the doctors they always let me see it or talk about it even though they know I have an ED",
          "created_utc": 1727726840.0
        }
      ]
    },
    {
      "id": "lpnf84n",
      "author": "AwakeInDreamland",
      "body": "Thank you.. I hang on to small things.. like a stranger’s kind words to help me have hope. I’m really scared. :(",
      "created_utc": 1727704718.0,
      "score": 2,
      "context": [
        {
          "id": "lpjxpft",
          "author": "AwakeInDreamland",
          "body": "I am in current hell watching my 26 yo daughter struggle to get help/healthy.. when she was younger we had her go to a therapist who did not think she needed a higher level of care because she appeared to want to get better. She was always petite but never looked sick. She went off to college and got a job in NYC and then the pandemic hit… it spiraled her out of control and by then she was an adult.. \n\nShe is currently IP but I fear she will never fully exorcise the ED demon… and trust me when I tell you.. it is an insidious and evil demon that will stop at nothing to destroy your beautiful daughter. \n\nGET HER HELP NOW.",
          "created_utc": 1727644084.0
        },
        {
          "id": "lpmuai5",
          "author": "archangelofthepit",
          "body": "i can't imagine how horrible watching your daughter struggle has been. you're right to describe it as a demon, it really does take over. sending you all the love in the world, and i believe she'll get better. recovery is hard but your love & support for her is evident through the screen and i hope things get better soon for her and you <3 you've both got this !!",
          "created_utc": 1727695665.0
        }
      ]
    },
    {
      "id": "lpnddvt",
      "author": "katieznizzle",
      "body": "Thank you so much for your kind words. I started recovery in June. It’s been a long road of relearning and honestly learning simple things but it’s been worth it. It’s one of the hardest things I’ve ever done in life. Your words made me tear up!",
      "created_utc": 1727704045.0,
      "score": 2,
      "context": [
        {
          "id": "lpixd8n",
          "author": "katieznizzle",
          "body": "Take her to a doctor asap. I wish my parents cared enough to get me help. It took me 20+ years to recover on my own. She will be really mad at you but in the end she will know you love her. You care OP. That goes a long way with kids. If my mother cared, things would have been a lot different for me. You seem like a great parent. Asking for advice just shows how much you care for her. She will appreciate you for this. It might take time but she will never forget. Good luck!",
          "created_utc": 1727632778.0
        },
        {
          "id": "lpmulta",
          "author": "archangelofthepit",
          "body": "the fact you recovered on your own is incredible, no matter how long it took, and i hope you know that and are so proud of yourself, because even as a complete stranger i'm so proud of you :•)",
          "created_utc": 1727695831.0
        }
      ]
    },
    {
      "id": "lpqrsgk",
      "author": "ScotchTapeConnosieur",
      "body": "We did in-patient at Renfrew at 19 (she lost weight) and did out patient with Walden. \n\nThese programs approach ED from a psychological avenue.  We started with Equip at her last semester of college, at 21. \n\nEquip’s evidence-based approach treats restrictive disorders as PHYSIOLOGICAL disorders first, with psychological features. \n\nBasically takes the view that it’s an evolutionary response to famine conditions that some people are genetically predisposed to. Any weight loss that skews the height/weight pattern can trigger it. In our daughter’s case she had a very fast growth spurt and was training for a bike trip, causing her height/weight to become misaligned. She was always tall and thin, but at around 16 her weight fell behind her height. \n\nEquip uses family based treatment (FBT.) This approach is extremely difficult, and involves family as the front line of treatment (with an entire wrap around care team, including peer coaching for both the patient and family, as well as tons of groups and training.) \n\nIt is very confrontational  and intense and basically requires involves forcing the person to eat and gain weight. In our case we had to threaten to pull her out of school. I’m talking about plates thrown against walls, insane screaming sessions, a 3 day hold for suicidal ideation, etc etc. But in 9 months we had our daughter back and the ED had lost its grip on her. \n\nEDs are incredibly challenging and there is a great deal of misinformation in the mainstream treatment community. For one, it basically separates the patient from their family, the people that know them best and are most committed to their healing.",
      "created_utc": 1727745170.0,
      "score": 1,
      "context": [
        {
          "id": "lpl18d0",
          "author": "ScotchTapeConnosieur",
          "body": "I want to help you get out in front of this as a parent who successfully treated our child for a restrictive eating disorder. Weight loss at that age, when she should be growing and GAINING weight can be a trigger for a physiological process that in some people leads to an eating disorder. \n\nContact [Equip Health](https://equip.health/). They helped us after dealing with other mainstream treatment modalities failed. ED’a can be incredibly hard to treat, and it’s important that you approach it with the most evidence-based modalities available. \n\nPlease DM if you’d like more info.",
          "created_utc": 1727658888.0
        },
        {
          "id": "lpngzsa",
          "author": "AwakeInDreamland",
          "body": "Do you mind me asking what mainstream avenues you used and how old your daughter was when you turned to Equip",
          "created_utc": 1727705360.0
        }
      ]
    },
    {
      "id": "lpnjc02",
      "author": "archangelofthepit",
      "body": "its so frightening, but i promise the help she'll get in IP will be at least something to get her through. you're strong enough to get through this with her, i fully believe that :•) if you ever need to have a talk about it or a cry or anything at all, please message me!! i know im a stranger but sometimes it just helps to talk it through with someone who's not connected to the whole hellscape. hope is a beautiful thing <3",
      "created_utc": 1727706188.0,
      "score": 2,
      "context": [
        {
          "id": "lpjxpft",
          "author": "AwakeInDreamland",
          "body": "I am in current hell watching my 26 yo daughter struggle to get help/healthy.. when she was younger we had her go to a therapist who did not think she needed a higher level of care because she appeared to want to get better. She was always petite but never looked sick. She went off to college and got a job in NYC and then the pandemic hit… it spiraled her out of control and by then she was an adult.. \n\nShe is currently IP but I fear she will never fully exorcise the ED demon… and trust me when I tell you.. it is an insidious and evil demon that will stop at nothing to destroy your beautiful daughter. \n\nGET HER HELP NOW.",
          "created_utc": 1727644084.0
        },
        {
          "id": "lpmuai5",
          "author": "archangelofthepit",
          "body": "i can't imagine how horrible watching your daughter struggle has been. you're right to describe it as a demon, it really does take over. sending you all the love in the world, and i believe she'll get better. recovery is hard but your love & support for her is evident through the screen and i hope things get better soon for her and you <3 you've both got this !!",
          "created_utc": 1727695665.0
        },
        {
          "id": "lpnf84n",
          "author": "AwakeInDreamland",
          "body": "Thank you.. I hang on to small things.. like a stranger’s kind words to help me have hope. I’m really scared. :(",
          "created_utc": 1727704718.0
        }
      ]
    },
    {
      "id": "ly1cwo4",
      "author": "Flat_Assistant_2162",
      "body": "Wow! I have heard FBT is what gets it. ❤️",
      "created_utc": 1732070302.0,
      "score": 1,
      "context": [
        {
          "id": "lpl18d0",
          "author": "ScotchTapeConnosieur",
          "body": "I want to help you get out in front of this as a parent who successfully treated our child for a restrictive eating disorder. Weight loss at that age, when she should be growing and GAINING weight can be a trigger for a physiological process that in some people leads to an eating disorder. \n\nContact [Equip Health](https://equip.health/). They helped us after dealing with other mainstream treatment modalities failed. ED’a can be incredibly hard to treat, and it’s important that you approach it with the most evidence-based modalities available. \n\nPlease DM if you’d like more info.",
          "created_utc": 1727658888.0
        },
        {
          "id": "lpngzsa",
          "author": "AwakeInDreamland",
          "body": "Do you mind me asking what mainstream avenues you used and how old your daughter was when you turned to Equip",
          "created_utc": 1727705360.0
        },
        {
          "id": "lpqrsgk",
          "author": "ScotchTapeConnosieur",
          "body": "We did in-patient at Renfrew at 19 (she lost weight) and did out patient with Walden. \n\nThese programs approach ED from a psychological avenue.  We started with Equip at her last semester of college, at 21. \n\nEquip’s evidence-based approach treats restrictive disorders as PHYSIOLOGICAL disorders first, with psychological features. \n\nBasically takes the view that it’s an evolutionary response to famine conditions that some people are genetically predisposed to. Any weight loss that skews the height/weight pattern can trigger it. In our daughter’s case she had a very fast growth spurt and was training for a bike trip, causing her height/weight to become misaligned. She was always tall and thin, but at around 16 her weight fell behind her height. \n\nEquip uses family based treatment (FBT.) This approach is extremely difficult, and involves family as the front line of treatment (with an entire wrap around care team, including peer coaching for both the patient and family, as well as tons of groups and training.) \n\nIt is very confrontational  and intense and basically requires involves forcing the person to eat and gain weight. In our case we had to threaten to pull her out of school. I’m talking about plates thrown against walls, insane screaming sessions, a 3 day hold for suicidal ideation, etc etc. But in 9 months we had our daughter back and the ED had lost its grip on her. \n\nEDs are incredibly challenging and there is a great deal of misinformation in the mainstream treatment community. For one, it basically separates the patient from their family, the people that know them best and are most committed to their healing.",
          "created_utc": 1727745170.0
        }
      ]
    },
    {
      "id": "lpnlpdq",
      "author": "AwakeInDreamland",
      "body": "Ugh thank you!! 💕I will probably take you up. Incidentally, today is my daughter’s birthday. It is a bittersweet day, as you could probably imagine",
      "created_utc": 1727707009.0,
      "score": 1,
      "context": [
        {
          "id": "lpjxpft",
          "author": "AwakeInDreamland",
          "body": "I am in current hell watching my 26 yo daughter struggle to get help/healthy.. when she was younger we had her go to a therapist who did not think she needed a higher level of care because she appeared to want to get better. She was always petite but never looked sick. She went off to college and got a job in NYC and then the pandemic hit… it spiraled her out of control and by then she was an adult.. \n\nShe is currently IP but I fear she will never fully exorcise the ED demon… and trust me when I tell you.. it is an insidious and evil demon that will stop at nothing to destroy your beautiful daughter. \n\nGET HER HELP NOW.",
          "created_utc": 1727644084.0
        },
        {
          "id": "lpmuai5",
          "author": "archangelofthepit",
          "body": "i can't imagine how horrible watching your daughter struggle has been. you're right to describe it as a demon, it really does take over. sending you all the love in the world, and i believe she'll get better. recovery is hard but your love & support for her is evident through the screen and i hope things get better soon for her and you <3 you've both got this !!",
          "created_utc": 1727695665.0
        },
        {
          "id": "lpnf84n",
          "author": "AwakeInDreamland",
          "body": "Thank you.. I hang on to small things.. like a stranger’s kind words to help me have hope. I’m really scared. :(",
          "created_utc": 1727704718.0
        },
        {
          "id": "lpnjc02",
          "author": "archangelofthepit",
          "body": "its so frightening, but i promise the help she'll get in IP will be at least something to get her through. you're strong enough to get through this with her, i fully believe that :•) if you ever need to have a talk about it or a cry or anything at all, please message me!! i know im a stranger but sometimes it just helps to talk it through with someone who's not connected to the whole hellscape. hope is a beautiful thing <3",
          "created_utc": 1727706188.0
        }
      ]
    },
    {
      "id": "ly1dud6",
      "author": "ScotchTapeConnosieur",
      "body": "It’s really the only evidence based treatment out there.",
      "created_utc": 1732070635.0,
      "score": 1,
      "context": [
        {
          "id": "lpl18d0",
          "author": "ScotchTapeConnosieur",
          "body": "I want to help you get out in front of this as a parent who successfully treated our child for a restrictive eating disorder. Weight loss at that age, when she should be growing and GAINING weight can be a trigger for a physiological process that in some people leads to an eating disorder. \n\nContact [Equip Health](https://equip.health/). They helped us after dealing with other mainstream treatment modalities failed. ED’a can be incredibly hard to treat, and it’s important that you approach it with the most evidence-based modalities available. \n\nPlease DM if you’d like more info.",
          "created_utc": 1727658888.0
        },
        {
          "id": "lpngzsa",
          "author": "AwakeInDreamland",
          "body": "Do you mind me asking what mainstream avenues you used and how old your daughter was when you turned to Equip",
          "created_utc": 1727705360.0
        },
        {
          "id": "lpqrsgk",
          "author": "ScotchTapeConnosieur",
          "body": "We did in-patient at Renfrew at 19 (she lost weight) and did out patient with Walden. \n\nThese programs approach ED from a psychological avenue.  We started with Equip at her last semester of college, at 21. \n\nEquip’s evidence-based approach treats restrictive disorders as PHYSIOLOGICAL disorders first, with psychological features. \n\nBasically takes the view that it’s an evolutionary response to famine conditions that some people are genetically predisposed to. Any weight loss that skews the height/weight pattern can trigger it. In our daughter’s case she had a very fast growth spurt and was training for a bike trip, causing her height/weight to become misaligned. She was always tall and thin, but at around 16 her weight fell behind her height. \n\nEquip uses family based treatment (FBT.) This approach is extremely difficult, and involves family as the front line of treatment (with an entire wrap around care team, including peer coaching for both the patient and family, as well as tons of groups and training.) \n\nIt is very confrontational  and intense and basically requires involves forcing the person to eat and gain weight. In our case we had to threaten to pull her out of school. I’m talking about plates thrown against walls, insane screaming sessions, a 3 day hold for suicidal ideation, etc etc. But in 9 months we had our daughter back and the ED had lost its grip on her. \n\nEDs are incredibly challenging and there is a great deal of misinformation in the mainstream treatment community. For one, it basically separates the patient from their family, the people that know them best and are most committed to their healing.",
          "created_utc": 1727745170.0
        },
        {
          "id": "ly1cwo4",
          "author": "Flat_Assistant_2162",
          "body": "Wow! I have heard FBT is what gets it. ❤️",
          "created_utc": 1732070302.0
        }
      ]
    }
  ]
}