{
  "id": "1ftb4ms",
  "subreddit": "EatingDisorders",
  "author": "imat0rtoise",
  "created_utc": 1727742454.0,
  "title": "Is it normal to feel like I’m going to throw up after eating?",
  "selftext": "So I’ve struggled with an ed for a lot of my teen years and I’m now at the point where I can eat somewhat “normally” again. I’ve been struggling abit with my depression and anxiety in recent weeks and for the past few days after I’ve eaten I feel like I need to/am going to throw up. I’m just wondering if anyone else has experienced this and if it’s something I should be worried about \n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1ftb4ms/is_it_normal_to_feel_like_im_going_to_throw_up/",
  "score": 47,
  "num_comments": 12,
  "comments": [
    {
      "id": "lprfliw",
      "author": "None",
      "body": "i dont think it’s something to worry about, there’s gonna be times where your body can’t handle eating healthy/normal and there’s gonna be times where its easier 😊 something you’ll ease into its been slowly getting less nauseating for me but it’s more in random spurts",
      "created_utc": 1727754465.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lpro0lq",
      "author": "alejandra357",
      "body": "When I was recovering from being sick for two whole weeks and not being able to eat without getting sick (nervous collapse bc PTSD), it took me at least two or three months to get over that feeling. It sucks and I had to eat like the “normal” people (three meals a day) but with therapy and time the feeling disappeared 😀\nEating without appetite is HARD, but now after almost a year I can say I finally recovered!! My therapist says that digestion is strongly connected with emotion, so in my case meds and better habits worked for me.",
      "created_utc": 1727758752.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lps1tjz",
      "author": "Middle_Sir_2574",
      "body": "hey! i used to get this, doctor prescribed me some sort of medication for it but honestly i think i didn’t need it. i found that chewing my food well and eating slowly helped because my body wasn’t used to me eating that much food since i had been restricting for so long, it will go away eventually.",
      "created_utc": 1727767402.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lps3bz5",
      "author": "SparrowPenguin",
      "body": "Many people with ED are highly sensitive to sensory stimuli and consequently have undiagnosed sensory issues like aversions to taste, smell, and texture. Another common sensory aversion is the feeling of something going down your throat. \n\nCould this be you?",
      "created_utc": 1727768477.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpwn8xk",
      "author": "immersed_in_thom",
      "body": "I am that way esp when depressed and anxious. I struggle to swallow and also feel sick  i understand. I’m sorry I have no words of advice. Hang in there",
      "created_utc": 1727831369.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpy5tqv",
      "author": "MauveCeramics",
      "body": "HEY YOU MAY HAVE A STOMACH ULCER OR OTHER INTESTINAL ISSUE. I have always had issues with eating but I ended up with a stomach ulcer (always felt hungry, wouldn't eat, then would eat a tiny bit felt sick repeat). I eat everyday but still have irregular patterns of eating however when I was over using aspirin (gave me a massive ulcer) I began having this issue. I still have this problem occasionally and I think it also may be high stomach acid/stomach lining thinned.",
      "created_utc": 1727859365.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lpz5wta",
      "author": "jefferyeffigy",
      "body": "yeah, i often feel sick when my ed is really bad before eating",
      "created_utc": 1727877382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lq1qc50",
      "author": "Fabulous_Coconut5153",
      "body": "I have experienced this but I just take something instead since I have really bad health anxiety",
      "created_utc": 1727907051.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lprfxhr",
      "author": "None",
      "body": "also keep in mind even if it seems like your body can’t handle food it sometimes is just a mindset which ends up tricking ur brain into making urself feel ill yk",
      "created_utc": 1727754620.0,
      "score": 1,
      "context": [
        {
          "id": "lprfliw",
          "author": "None",
          "body": "i dont think it’s something to worry about, there’s gonna be times where your body can’t handle eating healthy/normal and there’s gonna be times where its easier 😊 something you’ll ease into its been slowly getting less nauseating for me but it’s more in random spurts",
          "created_utc": 1727754465.0
        }
      ]
    },
    {
      "id": "lpu4pyu",
      "author": "vvasilisa",
      "body": "It is random for me too. But when i was in recovery, I used to down protein shakes and feel so nausea.  I found using spite to chase it worked. Only thing that kept it down 😭",
      "created_utc": 1727801309.0,
      "score": 1,
      "context": [
        {
          "id": "lprfliw",
          "author": "None",
          "body": "i dont think it’s something to worry about, there’s gonna be times where your body can’t handle eating healthy/normal and there’s gonna be times where its easier 😊 something you’ll ease into its been slowly getting less nauseating for me but it’s more in random spurts",
          "created_utc": 1727754465.0
        }
      ]
    },
    {
      "id": "lpy6v7d",
      "author": "imat0rtoise",
      "body": "I do have sensory issues, I’m diagnosed autistic and I’m only eating safe foods at the moment because if what’s going on and it’s still the same thing",
      "created_utc": 1727860111.0,
      "score": 1,
      "context": [
        {
          "id": "lps3bz5",
          "author": "SparrowPenguin",
          "body": "Many people with ED are highly sensitive to sensory stimuli and consequently have undiagnosed sensory issues like aversions to taste, smell, and texture. Another common sensory aversion is the feeling of something going down your throat. \n\nCould this be you?",
          "created_utc": 1727768477.0
        }
      ]
    },
    {
      "id": "mgu3ysy",
      "author": "FunPotential1716",
      "body": "Same ",
      "created_utc": 1741518650.0,
      "score": 1,
      "context": [
        {
          "id": "lq1qc50",
          "author": "Fabulous_Coconut5153",
          "body": "I have experienced this but I just take something instead since I have really bad health anxiety",
          "created_utc": 1727907051.0
        }
      ]
    }
  ]
}