{
  "id": "1fwjder",
  "subreddit": "EatingDisorders",
  "author": "Ordinary_Paint_6122",
  "created_utc": 1728106344.0,
  "title": "I feel guilty after eating. Is there a way to get over this feeling?",
  "selftext": "I was wondering if anyone had any advice to help me get over feeling guilty after I eat. I've been telling myself it's okay to eat but no matter what I always feel guilty and disgusted with myself after eating. (used to binge eat) \n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1fwjder/i_feel_guilty_after_eating_is_there_a_way_to_get/",
  "score": 43,
  "num_comments": 8,
  "comments": [
    {
      "id": "lqik0l7",
      "author": "None",
      "body": "Following because I’m at this point too. All I can think to myself is “ you fat piece of shiiiit. How disgusting. Look at yourself. You didn’t need that. You’re fat enough. Absolutely disgusting.” And cue the panic attacks and a concerned & confused husband. \n\nIdk maybe it’s something else…still following though.",
      "created_utc": 1728161486.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lqk3o18",
      "author": "shiny99Goatie",
      "body": "I struggle with it too.  But try to tell myself that strength comes from eating, not restricting.  So hard but have to tell yourself that the voice telling you that you’re somehow wrong for eating is NOT REAL!  \n\nBut it IS hard.  It sounds real asf.  But other ppl who recovered on here say after a while it gets quieter over time (just like it got louder over time).",
      "created_utc": 1728181781.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lqmq24n",
      "author": "Ok-Data7330",
      "body": "Hi!! I totally understand you. I go through this a lot, and I feel so disgusted with myself after I eat something I was craving. I honestly don't have any great advice, but I try to say to myself that it is perfectly okay to eat. It is perfectly okay to have cravings.\n\nSo don't worry, because we can work towards feeling better together.  Stay strong!! :)",
      "created_utc": 1728229524.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lqu75g5",
      "author": "Ordinary_Paint_6122",
      "body": "Thank you to everyone that responded, it has helped me a lot",
      "created_utc": 1728334878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqzg6t0",
      "author": "fish-_enthusiast",
      "body": "After a while in recovery it goes away! It happened about a month in for me but it came back when I relapsed. Just try to switch the thoughts to be helpful instead of harmful",
      "created_utc": 1728414929.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqzuozq",
      "author": "Miserylovesbadco_",
      "body": "Try to eat healthy stuff so you don’t feel as bad about it. Fruits, veggies, something light. That’s what helps me. The guilt really doesn’t go away.",
      "created_utc": 1728419784.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lr4ns4w",
      "author": "Most_Application_951",
      "body": "You chose to eat. Why did you choose to eat? For energy, a better life, meaningful relationships, being able to work and go to school? What are the cons of eating? What are the pros of eating? What are the pros of restriction? What are the cons of restriction? \n\nIn the end, the healthy you chose to eat with a reason. How could you feel guilty for doing something you chose to do because of the reasons you will not be able to fulfill when not eating? You simply can't.",
      "created_utc": 1728498058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lqj5j3t",
      "author": "Bright-Butterfly641",
      "body": "Personally, my biggest dream is one day having a family of my own. I try to get over the guilt by thinking i’m nourishing a home (my body) that will someday house my child (when i’m pregnant). i can’t bring a child into a home that is malnourished and in constant stress. Food is what my body needs to function and provide stability and a safe place someday .. i hope that helps somehow if maybe you’re considering this :)",
      "created_utc": 1728168735.0,
      "score": 1,
      "context": []
    }
  ]
}