{
  "id": "1g20uhz",
  "subreddit": "EatingDisorders",
  "author": "Anonymous5223423432",
  "created_utc": 1728741921.0,
  "title": "Broke up with my anorexic gf",
  "selftext": "So as the title says, I broke up with my girlfriend (31) of 3 years. She told me that she suffers from eating disorders about a year into our relationship, but that she is fine now. She actually was hospitalized because of it in her teen years. We moved in together after a year or so. I must confess that I didn't take her condition seriously at first and she said she was fine now so I guessed she's cured. Several months have passed with us living together and I had to go on a restrictive diet because of my health. I wasn't overweight but had some other medical reasons for which was suggested to me to try this diet. Little did I know this triggered her disorder in a major way. When I said I'm skipping breakfast one day because we didn't have anything that I could eat, she exploded and told me \"how could you say this to me?\". I was left in awe because, in my mind, I wasn't doing anything to her. That's when she started to not eat and loose weight. When I came off of my diet, things got better again and we didn't talk about it anymore. Fast forward another year, she was triggered again by some problems in our relationship that had nothing to do with food but with her insecurities and jealousy (which was totally unfounded). This time she didn't tell me anything, just started to loose weight. She lost a lot of weight and everyone was telling her how skinny she's looking. I was telling her that she's too skinny and should eat more, but her response was always \"I'm not hungry\". ..\n\nShe and I both like parties and hanging out with friends which usually involves alcohol. Because now she was not eating enough, alcohol would really kick in faster and harder and she would get into these awfully destructive states. She would either cry or take it out on me calling me names, that I'm in love with somebody else, that I'm boring and she doesn't want to hang out with me and stuff like that... She was unrecognizable to me. Every time, the next morning, she would apologize and say that she doesn't know why she said all those things and that she loves me and wants only me for the rest of her life... Our relationship was pretty good (the best I had so far) when she was sober, but every now and then, she would get drunk and have these dramas that I didn't understand and quite frankly was getting tired of... These dramas became more frequent and I started to loose interest in her and spending my life with someone who tortures me like that was beginning to scare me. On the last incident, she not only insulted me, but threw stuff at me at a party in front of other people. I ended it that night. Of course, when she got sober, she said she didn't mean it and that she has a problem and would seek help again (she already went to therapy, but left because she was not satisfied with the therapist). When I mentioned that she should stop drinking all together, she said \"That won't happen....\". So I decided to leave which crushed her emotionally... It was really hard for me too (and still is) because I still care about her and see how good of a person she could be, but I couldn't stay and watch her taking it all out on me and basically saying \"This is the way it's going to be and I won't do anything about it. If you love me, you'll stand by me...\"\n\nAfter I moved out, I spoke to a friend of my now ex and said that she has a problem with eating disorder and alcohol and I asked her to wash out for her. I kind of doubt anything has changed because she's been going out until dawn every weekend since we've broke up. I'm suspecting that a lot of alcohol is involved. So I'm worried she went on a self destructive path rather than the opposite way...\n\nIt's hard to even imagine what she is going through. Eating disorders are a completely unknown to me. So can anyone explain to me what is it about eating disorder and alcohol abuse? Is it possible that she literally transforms herself to a completely different person?\n\nWhat I'm questioning myself is \"does she really mean all that stuff she's saying drunk or is it some sort of combination of her mental problems and alcohol?\"\n\nAlso can you suggest a book that would help me to better understand the mind of a person with an eating disorder?\n\nThank you",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1g20uhz/broke_up_with_my_anorexic_gf/",
  "score": 155,
  "num_comments": 44,
  "comments": [
    {
      "id": "lrnqe87",
      "author": "taraduffeh",
      "body": "Hmmmm. Have you ever been hangry?  Like you haven’t eaten enough that day & suddenly everything starts pissing you off? I don’t speak for everyone with an eating disorder, but I have found that my irritability gets unmanageable the less I eat. I’m currently struggling pretty bad again, and it feels like my brain isn’t working properly. You kind of feel in a haze, food is fuel ykno. And when it’s mixed with drinking?? Ooh boy. I’ve found it’s better I do not drink, because it’s a fine line between a fun time & getting myself in negatively life changing situations. \nUnfortunately, the best thing you did for yourself (& probably her) was putting up that boundary. It’s not fair to you, not many people deserve violence of any type towards them. But again, to answer your question, I would lean on the “it’s a mix of alcohol l & mental illness” side of things. But, if she’s not choosing to get help, that’s on her. The best thing you can do to her, is tell her how her actions not only effect you, but effect her. Let her know you care, but you can’t watch her kill herself (because when you are starving yourself and abusing substances, that is what you are doing). Remind her of who she was before all of this. It’s a nightmare of an illness, but I think human connection & someone helping fight the voices in our brains, is so important.",
      "created_utc": 1728784717.0,
      "score": 161,
      "context": []
    },
    {
      "id": "lro88z5",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1728792516.0,
      "score": 65,
      "context": []
    },
    {
      "id": "lroeslw",
      "author": "EuropaofAsguard",
      "body": "Skeletal Marriage by Jim Kohl on Amazon. He initially started to diet to get healthy after a scare, but it turned into something else where he lost his marriage and almost his life. Best book I ever read at what goes thru your mind.",
      "created_utc": 1728795904.0,
      "score": 28,
      "context": []
    },
    {
      "id": "lrozzg9",
      "author": "Jazzlike-Implement50",
      "body": "as someone who has dealt with both ed and alcoholism, i hope i can provide some insight. I actually went through something similar, with me being the aggressor. \n\ni met someone a couple months ago and we were goin steady for a decent amount of time. I dealt with my eating disorder behind closed doors, because the shame, guilt, and anxiety were too strong to let him in on what i was struggling with. if i wasn’t dealing with my eating disorder, i was drowning my heart in alcohol to ease the shame and strong emotions. and for awhile i called myself “healed”, but really i just band-aided the ed with alcoholism.\n\nhe got the worst side of me that has ever existed. i berated him and drunkenly told him that i was using him to fill a void… really not proud of it. there was one time i was blacked out while he tried getting me out of the car, and i quite literally told him i hated him and went down a list of reasons why he was “hateable”. bless his heart, he swallowed his pride and took me to bed. thankfully he had a good head on those shoulders and left me. \n\nNow that i’ve sought out help and reflected, it had nothing to do with him and everything to do with me. I was so incredibly insecure, sad, and overall in a self destructive cycle. it was nothing personal against him, he was a great man who unfortunately met me at a weird time in my life. \n\ni think you 100% did the right thing, and it isn’t wrong to still care for her. i will say, eating disorders on top of alcoholism is VERY detrimental to heart health, and i hope that she finds it in herself to be “sick and tired” of being sick and tired. it’s not your responsibility to ensure she’s safe and getting help, but it’s not wrong to be concerned. i wish nothing but the best for the both of you.",
      "created_utc": 1728809647.0,
      "score": 19,
      "context": []
    },
    {
      "id": "lrps2ty",
      "author": "Anonymous5223423432",
      "body": "Thank you all for your answers. It means a lot to me that you shared your stories. Some of them are scary familiar...\n\nFor days now I've been struggling if I made the right choice? Should I have stayed and try to help her? Be her support no matter how ugly it gets? Although she's addressing the ED problem and is seeking help, her not seeing the alcohol problem is something I can't help her with. She doesn't see that at all and I feel like she has to come to a point where she figures this one out by herself. What pains me is when she does eventually figure it out, I won't be there anymore. I'm slowly healing from all of this and trying to move on...\n\nWhat frightens me is the health problems you guys mentioned. Long term ones. She has hormonal issues because of it and she has heart issues which I didn't connect with this, but one of you mentioned them... Might be that those problems are from ED too. I really hope she's going to be better because she's an amazing person and I feel like she doesn't deserve this, but life's not fair, right?\n\nI will check out the books you mentioned. Thank you...\n\nAlso, I wish all of you that you heal from this horrible disease. I can see from your answers and from my experience with my ex that people who are suffering from this are very intelligent (I actually read this somewhere and it's true), self aware and empathic which are great, if not the best, values a person can have. Hope you all reach the point where you can reveal that to the people around you…",
      "created_utc": 1728825901.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lrsfkmy",
      "author": "PrizeTart0610",
      "body": "Imagine you’re starving and there’s food in a cage but you can’t get it. Now imagine you’re the one that put it in the cage.\n\nThe hardest part of anorexia for me was knowing full well I was doing it to myself. So you have the frustration of being starving and cold and irritable all the time on top of the frustration of knowing you don’t have to be like that but feeling completely unable to help yourself.",
      "created_utc": 1728857876.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lrodo7y",
      "author": "Grand_Pomegranate671",
      "body": "You did well to distance yourself from this situation, OP. People can only be helped when they want to be helped. It doesn't matter if she meant the things she said or not. Prioritise yourself and move on with your life.",
      "created_utc": 1728795299.0,
      "score": 13,
      "context": []
    },
    {
      "id": "lrnu9yb",
      "author": "shiny99Goatie",
      "body": "This is a lot.  I have a reply but I’m at work so give me a few…",
      "created_utc": 1728786310.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lrru5ik",
      "author": "_Subway_Kid_",
      "body": "I can only speak for myself:\n\nMy ED has nothing to do with food. Its just what my body ended up going to in order to cope with bullying when i was a kid and even tho i am not considered anorexic anymore (im at a healthy weight for my age and height) i still struggle a lot with it. I may look like i dont have ED but in my mind, i constantly struggle with it. I always feel like i am really fat. And its honestly a coping strategy for things that i cant control. I can control how much i eat and how much i weigh. Also, its like a form of self harm in that i can starve myself and control the pain and intensity of pain that i can feel instead of dealing with pain that i cant control. \n\nAgain, only speaking from my personal perspective: You going on a diet was triggering for her because she was probably going to eat breakfast and since you were skipping breakfast, it was in her mind as if you were telling her that she was fat or something. Like, you dont have to eat and can skip a meal but she cant. I dont know if that makes sense. And her reaction was lashing out because she struggles with that on a personal level. \n\nAnd she probably had a hard time connecting with you because ED is something that you just dont understand and its something she probably struggles with every day. \n\nI would also say that she probably hates herself tbh. Im again speaking from personal experience so this might only apply to me but my ED is connected to the way i see myself. Even though i still struggle with it, it was significantly worse when i hated myself and had a perfectionistic mindset. Now that i am beginning to accept myself as i am, i dont struggle with it like i used to. It doesnt control me anymore. The fact that she would lash out to you and then later say you were the lohl tells me that she is probably scared of being vulnerable with you. She probably really wanted to be with you and still does but was afraid at the same time. So she was sending mixed signals. It sounds like she has a lot of work to do on herself before she gets in another serious relationship. \n\nHaving said all that, its good that you broke it off because her behaviour was getting out of hand. But also, why are you just now trying to understand her ED instead of trying to understand sooner?",
      "created_utc": 1728850595.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lrsfzey",
      "author": "sweetbabyjosi",
      "body": "i’m replying to this before reading replies, so i apologize if im repeating anyone. \n\nfirst off— i’m sorry for all of this. watching a loved one suffer can be so taxing and im sure this has been heavy on you. \n\nsecond— re: alcoholism & eating disorders: eating disorders are a form of addiction of their own accord 100%. anyone who tells you otherwise is lying. eating disorders are fueled by conversation about weight, food, and bodies. it doesn’t surprise me at all that people commenting on your ex being thin only worsened the problem. that’s like adding fuel to the fire. i can be at my worst with my ED and when someone calls me thin (negatively or positively) it absolutely feeds my needs to not eat. \n\nthat said, it’s not fair of her to take these issues out on you. i know for myself personally my ED really overwhelms me and i shut down, internalizing and eating myself (no pun intended) alive inside. her ability to attack you is definitely unfair. \n\nthat said, if you still hope to continue things with her (unsure if you do) doing some research/understanding ED’s would be very beneficial, especially if they’re entirely foreign to you. i used to have a partner who restricted bc she wanted to “maintain weight” and it was INCREDIBLY triggering for me because there was so much focus on weight/food around the house. even if it feels “normal” to you that conversation can be really overwhelming for someone who struggled with food/body image. \n\nalso, i would say that my ED doesn’t CHANGE me as a person, but rather leaves me as a shell of myself. alcohol definitely hits harder due to the lack of food in my system, but even then i’m not becoming abusive towards my partner. my ED takes from me, it does not give me more. but, as always, to each their own. addictions rage in different ways for everyone.",
      "created_utc": 1728858026.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lrq4ldk",
      "author": "Fair_Cap_8336",
      "body": "Im not an alcoholic, but I did binge drink A LOT in the height of my eating disorders. Most of my drinking was to fill the empty void and loneliness I felt in the darkest times of my anorexia, bulimia, binge eating… I had it all. \nUntil I really learned to love myself and take care of my body the right way, I had a bad relationship with alcohol. I’m very lucky I don’t carry the addiction gene. Eating disorders are characterized by a lot of addictive behaviors (addicted to binge eating, addicted to portion control of food), which is why addiction to alcohol/drugs go hand in hand… then the short lived euphoria from alcohol and drugs fills a void of depression/sadness/anxiety caused by eating disorders.\nWhen your ex gf got drunk and got destructive… she was projecting all her anger and sadness onto you. Which is not healthy, she is not in a good spot to have a healthy relationship with anyone at the moment.\nI hope your ex gf finds help and a very good therapist, eating disorders are a hell of a beast to beat…",
      "created_utc": 1728830633.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrr10kf",
      "author": "cappuccinofathe",
      "body": "I’ll try my best to explain to my understanding the effects and issues that fuel anorexia and what makes it come back. I am currently in recovering and in therapy for it and things still really trigger me. People who you eat with regularly become some sort of comfort at least for me. If I was her and my partner was going on a diet even for health reasons so be open about it would really make it super hard for me not to be affected. And if I was left alone with those emotions while my partner is on an open diet I would most def release. An ed is a mental illness, buts it’s something you can control. That’s the main reason it really difficult to ever get over it. If something is out of control your brain will say “you can always starve yourself it’s something you can control” so the first aspect that my therapist told me that pretty much every person suffering from an ed has is a control issue. And it’s not about wanting to be in control of everything, it’s more like this is the only thing I can rely on, a comfort. Even if it might not seem that way to you. As for the alcohol issues I have know some people with an ed that use alcohol as a way to loose weight and suppress the voices. And it fuels anxiety and insecurities. It’s a bully in your head that never shuts up. But a bully that’s always there and will manipulate you into thinking things and doing things.",
      "created_utc": 1728841304.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrrv7wy",
      "author": "Doskozza",
      "body": "When you're at the bottom, the only thing you can do is get some help. She refused that. You've done the right thing leaving her and taking care of yourself. \n\nBut in fact the times when I was drinking at very low weight were the only moments in my life when I felt psychotic. I was scared of hilarious thing, making weird, unrealistic scenarios of people randomly attacking me, I've seen danger everywhere. But the scariest nights, and I'm still looking for someone with familiar experience, we're those when I started crying and couldn't stop for fucking hours. No particular reason, no way to calm me down, just a waterfall of unstoppable tears and sobbing, ruining every party.",
      "created_utc": 1728850940.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrsfx0w",
      "author": "angel_bunny444",
      "body": "I’ve never personally struggled with alcohol but I have struggled with an ED. In no way is her disorder an excuse for the awful things she said to you, but it could be a result of her displaced anger. Eating disorders cause a lot of pain and stress and insecurity and sometimes people who have a hard time managing it can take it out on the wrong people/blow up in bad ways. I’m sorry you’re both going through this and I wish the best for you two. :( <3",
      "created_utc": 1728858002.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrvc3o1",
      "author": "ark2468",
      "body": "Eating disorders (from someone who has one) are really mean and nasty to endure. They completely fuck with your mental state because it's not just attacking you mentally but also physically and then put you in denial that it's the lack of food. You get used to being hungry and not feeling well all the time and try to cope. When you've restricted so much to lose weight, even eating in the beginning feels worse.\n\nI did not know I had a disorder until about 3 years ago, I had it majority of my life and thought I just was depressed and anxious. When I started recovery it was so hard and so much anger and frustration came out of me. I wanted to find any solution that didn't involve eating, anything to make myself FEEL better. anything but food because at that point I was convinced i hated food, hated eating, it didn't feel good and was pretty much the worst. I hated that I needed it.\n\nIt really snowballs when it's triggered, and it takes effort sometimes to walk that back and eat when you know you need to. Your brain functions less without proper nutrition, which makes it easy to go back to the old ways of thinking, like, oh I don't really need this, food isn't going to help, I don't feel good enough to eat, or whatever those thoughts are. For each person I think it's the challenge to have strategies to identify and combat the ED thoughts that come up. Even now I wouldn't say I'm \"cured\" though i feel good about my current status. I don't think most mental disorders ever really go away, it's just something you have to learn to live with and come up with strategies to manage.\n\nI'm really sorry for what you've gone through with your wife. It sounds really painful and it's clear you care about her a lot. I hope this can help with some of the context.\n\nI listened to a podcast called \"recovery talk\" to help me understand what was going on in my brain and feel some support about the process of recovery. Def recommend that one.\n\nI also read a comic before recovery that made me realize I might have an eating disorder. It's called \"I Do Not Have An Eating Disorder\" and is on Tumblr - https://www.tumblr.com/misspixnmix/28764982537/i-do-not-have-an-eating-disorder-i-do-not-have-an?source=share\nThat comic is emotionally heavy and may be intense to read, take your time if you choose to check it out.",
      "created_utc": 1728911203.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ls1st6c",
      "author": "anofreak",
      "body": "Damn this sounds a lot like me and my boyfriend. But I don’t drink just got severe emotional issues I guess. \n\nWith a similar mind of ur gf, I say stuff I don’t mean and it comes out of impulse and annoyance. Truly when I don’t eat idk why but I become a monster. And it’s just misery and anxiety. And it feels so intense that it comes out to the person I’m kinda doing it for in a way or because. And he I guess I got too comfortable to the point where I self reflect onto him. So the stuff I say I’m really just meaning for myself. But I put it out onto him as an explosion. It’s like I need to blame someone else for my issues. And it’s kinda like not taking accountability of course, not taking care of urself correctly, and idek",
      "created_utc": 1729005266.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lt2v470",
      "author": "NWGolfBoss",
      "body": "Thank you sharing your perspective. As a dad with a 17 year old daughter battling ED daily, this perspective helps.",
      "created_utc": 1729548686.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ltrlc0v",
      "author": "Super_Progress_4374",
      "body": "Damn Dude, this is almost EXACTLY what i’m going through right now (you could look at my post if you feel inclined lol). I’m in the situation where I don’t know if i can take it anymore, as much as i love that girl to death. Can I ask how you are handling yall being broken up, or if you have any regrets etc? I’m at such a crossroads right now",
      "created_utc": 1729898667.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lrpiwou",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1728821710.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrpty3f",
      "author": "stoned_mexican",
      "body": "My wife is a researcher, and from what I remember from things she's told me, there is some relation between eating disorders and addiction. Both instances can lead to \"this solves a problem\" which can lead to a dependence.\n\nFrom a complete layman's point of view who has gotten a lot of information from their much smarter other half, ED is rooted in a desire for control. Imagine wanting to sit still and being absolutely jittery. It's an aggravatingly frustrating battle with themselves, and nothing they do will resolve it. It's a disorder because they keep thinking, \"I can do it. I am completely in control,\" while watching it slip through their fingers. They also don't want you to know because they think they can control it. So as when any person does when they are frustrated and lose control, they lash out. To anyone and everyone. You just happened to be the safest and closest lighting rod.\n\nI'm no one and nobody, and so you and everyone else can take what I say as complete bunk. However, what I do want you to know is that this was NOT about you. None of it is about you. Her problems are her problems, and you can only help people who WANT to be helped. You can't pull someone up who is constantly letting go.\n\nYou should also check in with a therapist yourself. Being with someone with ED is not easy and will definitely take its toll on you.",
      "created_utc": 1728826680.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lrr4why",
      "author": "Tracie10000",
      "body": "You can't help someone who won't help themselves.  I will add an eating disorder is never cured. There's always a chance something will trigger a person.",
      "created_utc": 1728842510.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lroutqp",
      "author": "ScottishWidow64",
      "body": "Never ever tell someone with AN they should eat or they are too skinny.",
      "created_utc": 1728806092.0,
      "score": -1,
      "context": []
    },
    {
      "id": "lro4gyo",
      "author": "Background_Mistake76",
      "body": "People are honest when they are drunk. Now, I have not had this health issues so I can not speak on if it is a combination of things - but she can try therapy. If you want to continue the relationship or not is really up to you, but I would highly suggest therapy for maybe the both of you if they offer couples counesling to non-married people",
      "created_utc": 1728790729.0,
      "score": -11,
      "context": []
    },
    {
      "id": "lrruaom",
      "author": "Minimum_Pangolin6347",
      "body": "I couldn’t have said it better myself. I think you touched on a LOT of how our minds work. I don’t think anyone can TRULY UNDERSTAND unless they themselves have gone thru it. ED NEVER go away. I might not be purging this year, but I definitely restrict. But not enough to “look anorexic”. So to everyone else, I look “fine”. When in fact, my mind is just as unhealthy if not more as it was years ago when I was severely underweight. And yes, some of us might heal ourselves and never binge, purge or restrict ever again, BUT, in my opinion, it truly never leaves our minds. To me, “it”pretty much calls the shots. “It” decides how I will feel today. How I will look today. It fucking SUCKS. ED SUCK. I wouldn’t wish this on anyone.  \n\nIn regards to people having relationships with us, I guess that all depends on how much you can handle and how much you are willing to take on. Most people will run. Most people will run extremely far away. There are those few that stick around out of love for the person, but it takes a strong heart and a strong mind to be with us let alone live with us. So that is the question that you need to ask yourself. How much do you love her and how much are you willing to take on? As the above poster said though, boundaries are extremely important as well. I wish you all the best and I hope that your ex recovers and becomes the best version of herself.",
      "created_utc": 1728850641.0,
      "score": 6,
      "context": [
        {
          "id": "lro88z5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1728792516.0
        }
      ]
    },
    {
      "id": "lrp2sxp",
      "author": "None",
      "body": "I really commend this honesty and self reflection. Thank you for sharing. I found myself lashing out at times when I was drunk and it was absolutely a reflection of how insecure I was as a person and in the relationship but it’s a form of abuse even if not premeditated or conscious. To berate someone else is horrible and I’m still shocked I did it as I spent my entire childhood being verbally abused and put down. Sobriety was essential in my healing journey. \n\nI hope OP sees this and can find comfort and some compassion for themself and their ex partner.",
      "created_utc": 1728811626.0,
      "score": 4,
      "context": [
        {
          "id": "lrozzg9",
          "author": "Jazzlike-Implement50",
          "body": "as someone who has dealt with both ed and alcoholism, i hope i can provide some insight. I actually went through something similar, with me being the aggressor. \n\ni met someone a couple months ago and we were goin steady for a decent amount of time. I dealt with my eating disorder behind closed doors, because the shame, guilt, and anxiety were too strong to let him in on what i was struggling with. if i wasn’t dealing with my eating disorder, i was drowning my heart in alcohol to ease the shame and strong emotions. and for awhile i called myself “healed”, but really i just band-aided the ed with alcoholism.\n\nhe got the worst side of me that has ever existed. i berated him and drunkenly told him that i was using him to fill a void… really not proud of it. there was one time i was blacked out while he tried getting me out of the car, and i quite literally told him i hated him and went down a list of reasons why he was “hateable”. bless his heart, he swallowed his pride and took me to bed. thankfully he had a good head on those shoulders and left me. \n\nNow that i’ve sought out help and reflected, it had nothing to do with him and everything to do with me. I was so incredibly insecure, sad, and overall in a self destructive cycle. it was nothing personal against him, he was a great man who unfortunately met me at a weird time in my life. \n\ni think you 100% did the right thing, and it isn’t wrong to still care for her. i will say, eating disorders on top of alcoholism is VERY detrimental to heart health, and i hope that she finds it in herself to be “sick and tired” of being sick and tired. it’s not your responsibility to ensure she’s safe and getting help, but it’s not wrong to be concerned. i wish nothing but the best for the both of you.",
          "created_utc": 1728809647.0
        }
      ]
    },
    {
      "id": "lrpmguh",
      "author": "Anonymous5223423432",
      "body": "This sounds so familiar. Thanks for sharing your story...",
      "created_utc": 1728823441.0,
      "score": 5,
      "context": [
        {
          "id": "lrozzg9",
          "author": "Jazzlike-Implement50",
          "body": "as someone who has dealt with both ed and alcoholism, i hope i can provide some insight. I actually went through something similar, with me being the aggressor. \n\ni met someone a couple months ago and we were goin steady for a decent amount of time. I dealt with my eating disorder behind closed doors, because the shame, guilt, and anxiety were too strong to let him in on what i was struggling with. if i wasn’t dealing with my eating disorder, i was drowning my heart in alcohol to ease the shame and strong emotions. and for awhile i called myself “healed”, but really i just band-aided the ed with alcoholism.\n\nhe got the worst side of me that has ever existed. i berated him and drunkenly told him that i was using him to fill a void… really not proud of it. there was one time i was blacked out while he tried getting me out of the car, and i quite literally told him i hated him and went down a list of reasons why he was “hateable”. bless his heart, he swallowed his pride and took me to bed. thankfully he had a good head on those shoulders and left me. \n\nNow that i’ve sought out help and reflected, it had nothing to do with him and everything to do with me. I was so incredibly insecure, sad, and overall in a self destructive cycle. it was nothing personal against him, he was a great man who unfortunately met me at a weird time in my life. \n\ni think you 100% did the right thing, and it isn’t wrong to still care for her. i will say, eating disorders on top of alcoholism is VERY detrimental to heart health, and i hope that she finds it in herself to be “sick and tired” of being sick and tired. it’s not your responsibility to ensure she’s safe and getting help, but it’s not wrong to be concerned. i wish nothing but the best for the both of you.",
          "created_utc": 1728809647.0
        }
      ]
    },
    {
      "id": "lrr1mj2",
      "author": "Lawats06",
      "body": "I’m sorry you’re going through this. I haven’t been in this position in my relationship, but as a social worker I have worked with inpatient ED clients (with addiction and without) as well as with addiction and mental health in other capacities. I also have a friend with very similar behaviour to your ex. \n\nYou could spend the rest of your life trying to help (save) her, but it will never be you to do that. It has to be her. Until she decides she wants help, no one else can make someone change. I’m sure you feel guilty, like you could have done more, etc. but please know that no matter what you did or didn’t do, it likely wouldn’t have made a difference (I mean this in the nicest way). \nPersonally, I don’t see this as alcoholism, but definitely problematic drinking, likely caused by the same emotional issues as her ED- depression, self hatred, guilt, anxiety, trauma, avoidance, you name it….\n\nI have a friend who is 28 but has had an ED since 13. Been to inpatient, outpatient, etc etc. She’s doing all the stuff to help, but it isn’t “cured”. She still struggles with it every day and has lapses. She was at my house recently and we were drinking wine, and she ended up on the floor in a ball crying about how she thinks I don’t like her, how much she hates herself, etc. She has recently realized that she gets completely out of control when she drinks, usually as a result of not eating, but also drinks more than she “should” and as much as someone who is a healthy weight (for example will drink as much as me who is 5’5 and 135 lbs.) She always cries when she drinks and regrets everything she does and says, and then spirals into more self hatred. She hasn’t stopped drinking but the last few months has reduced the amount she drinks and is more mindful. This isn’t always the case though. \nI also believe eating disorders are the hardest to recover from (if you think about it in the same lens as addiction). All are maladaptive coping strategies but if you are recovering from a substance use disorder, you can avoid people, places, and things that trigger you. \nFor EDs, food is your “drug of choice” but you CANT avoid it. It is the thing that sustains life. It’s like telling an alcoholic who wants to remain sober that he has to have 3 drinks a day but no more or less. Or putting fentanyl in front of someone in recovery from opiate use disorder every day and expecting them to remain sober (possible but makes it extraordinary difficult) That’s simply not the way recovery works. \n\nIf you want book reccos, DM and we can discuss further. I’ve read so many but want to know more about what type you’re looking for. \n\nI apologize for the rant and I hope it makes sense. I could talk about this for hours but we will never understand unless we have Ben there ourselves. \nAddiction and EDs are so complex and heartbreaking. I feel for you and everyone suffering from this. Hopefully one day your ex will get the help she needs to live a happy and healthy life.",
      "created_utc": 1728841492.0,
      "score": 3,
      "context": [
        {
          "id": "lrps2ty",
          "author": "Anonymous5223423432",
          "body": "Thank you all for your answers. It means a lot to me that you shared your stories. Some of them are scary familiar...\n\nFor days now I've been struggling if I made the right choice? Should I have stayed and try to help her? Be her support no matter how ugly it gets? Although she's addressing the ED problem and is seeking help, her not seeing the alcohol problem is something I can't help her with. She doesn't see that at all and I feel like she has to come to a point where she figures this one out by herself. What pains me is when she does eventually figure it out, I won't be there anymore. I'm slowly healing from all of this and trying to move on...\n\nWhat frightens me is the health problems you guys mentioned. Long term ones. She has hormonal issues because of it and she has heart issues which I didn't connect with this, but one of you mentioned them... Might be that those problems are from ED too. I really hope she's going to be better because she's an amazing person and I feel like she doesn't deserve this, but life's not fair, right?\n\nI will check out the books you mentioned. Thank you...\n\nAlso, I wish all of you that you heal from this horrible disease. I can see from your answers and from my experience with my ex that people who are suffering from this are very intelligent (I actually read this somewhere and it's true), self aware and empathic which are great, if not the best, values a person can have. Hope you all reach the point where you can reveal that to the people around you…",
          "created_utc": 1728825901.0
        }
      ]
    },
    {
      "id": "lrzub85",
      "author": "shiny99Goatie",
      "body": "I’ll say in my relationship I was the emotional/financial rock for most of the time.  The past couple years been a little mentally hard for me, and the past 9 months I developed what I’m sure is Anorexia.  It’s caught my partner off guard to see me this way and he waffles between halfway being there for me (in the best way he can, I guess)… he also has his own addictions…and then turning his back on me as an escape.  But it sounds like you were trying to be hella supportive.\n\nI’m constantly researching to try to understand what’s going on with me and why I’m changing.  Have you googled anorexic brain scans?  The folds between our brains actually shrink.  Alcohol also kills brain cells.  So you girlfriend/ex was probably being affected by both of those things.  One of the worse parts about this is not having any physical or mental fight in me.\n\nBUT as someone with it, i will say it was her responsibility to get help.  She has to RELENTLESSLY seek help bc the ED voice is relentless.  If she didn’t like her therapist she should’ve tried another one.  I listen to hella eating disorder podcasts (easy to find on Apple Podcasts) and try to trick myself into eating sometimes.  I’m still sinking most days but I do as much as I can to not put it on my partner a lot.  Ironically he has gained hella weight lol.\n\nAnd ED brain is kindof like having a narcissist abuser in your head\n\nThat sounds so painful that you had to witness her go through that.",
      "created_utc": 1728968835.0,
      "score": 2,
      "context": [
        {
          "id": "lrnu9yb",
          "author": "shiny99Goatie",
          "body": "This is a lot.  I have a reply but I’m at work so give me a few…",
          "created_utc": 1728786310.0
        }
      ]
    },
    {
      "id": "lrs5co2",
      "author": "Anonymous5223423432",
      "body": "Unfortunately I failed to see how big of a problem this was. She would frequently lie to me that she's good and that for example my diet doesn't affect her anymore, so I would assign most of her behavior to excess alcohol use. I'm only now realizing what kind of an illness this is. To be honest, reading all this, I doubt that I could make any difference even if I knew sooner. But if you're asking me do I feel guilty I didn't take it serious enough? Yes, I do... I guess it had to come to the breaking point for me to see this...",
      "created_utc": 1728854266.0,
      "score": 2,
      "context": [
        {
          "id": "lrru5ik",
          "author": "_Subway_Kid_",
          "body": "I can only speak for myself:\n\nMy ED has nothing to do with food. Its just what my body ended up going to in order to cope with bullying when i was a kid and even tho i am not considered anorexic anymore (im at a healthy weight for my age and height) i still struggle a lot with it. I may look like i dont have ED but in my mind, i constantly struggle with it. I always feel like i am really fat. And its honestly a coping strategy for things that i cant control. I can control how much i eat and how much i weigh. Also, its like a form of self harm in that i can starve myself and control the pain and intensity of pain that i can feel instead of dealing with pain that i cant control. \n\nAgain, only speaking from my personal perspective: You going on a diet was triggering for her because she was probably going to eat breakfast and since you were skipping breakfast, it was in her mind as if you were telling her that she was fat or something. Like, you dont have to eat and can skip a meal but she cant. I dont know if that makes sense. And her reaction was lashing out because she struggles with that on a personal level. \n\nAnd she probably had a hard time connecting with you because ED is something that you just dont understand and its something she probably struggles with every day. \n\nI would also say that she probably hates herself tbh. Im again speaking from personal experience so this might only apply to me but my ED is connected to the way i see myself. Even though i still struggle with it, it was significantly worse when i hated myself and had a perfectionistic mindset. Now that i am beginning to accept myself as i am, i dont struggle with it like i used to. It doesnt control me anymore. The fact that she would lash out to you and then later say you were the lohl tells me that she is probably scared of being vulnerable with you. She probably really wanted to be with you and still does but was afraid at the same time. So she was sending mixed signals. It sounds like she has a lot of work to do on herself before she gets in another serious relationship. \n\nHaving said all that, its good that you broke it off because her behaviour was getting out of hand. But also, why are you just now trying to understand her ED instead of trying to understand sooner?",
          "created_utc": 1728850595.0
        }
      ]
    },
    {
      "id": "lrrbwop",
      "author": "Anonymous5223423432",
      "body": "Yes, she always said it was not about the food but control. I must admit, I don't get it... Thank you for the answer though...",
      "created_utc": 1728844714.0,
      "score": 1,
      "context": [
        {
          "id": "lrr10kf",
          "author": "cappuccinofathe",
          "body": "I’ll try my best to explain to my understanding the effects and issues that fuel anorexia and what makes it come back. I am currently in recovering and in therapy for it and things still really trigger me. People who you eat with regularly become some sort of comfort at least for me. If I was her and my partner was going on a diet even for health reasons so be open about it would really make it super hard for me not to be affected. And if I was left alone with those emotions while my partner is on an open diet I would most def release. An ed is a mental illness, buts it’s something you can control. That’s the main reason it really difficult to ever get over it. If something is out of control your brain will say “you can always starve yourself it’s something you can control” so the first aspect that my therapist told me that pretty much every person suffering from an ed has is a control issue. And it’s not about wanting to be in control of everything, it’s more like this is the only thing I can rely on, a comfort. Even if it might not seem that way to you. As for the alcohol issues I have know some people with an ed that use alcohol as a way to loose weight and suppress the voices. And it fuels anxiety and insecurities. It’s a bully in your head that never shuts up. But a bully that’s always there and will manipulate you into thinking things and doing things.",
          "created_utc": 1728841304.0
        }
      ]
    },
    {
      "id": "lu0hsfa",
      "author": "Anonymous5223423432",
      "body": "I'm so sorry you're going through this.\n\nI don't regret leaving her. From this perspective, it wasn't even a choice. It was inevitable. I have good days where I'm optimistic about the future with somebody else (not a specific person as I'm not yet ready for another relationship). And I have days when I want to call her more than anything and try to fix things between us. I've looked into EDs - read a book, some articles, watched videos, a movie and I feel like I could handle her better now. Although, judging from the comments here, my newly acquired confidence has no foundation in real life.\n\nIt's hard. I really hope you won't have to go through the same thing, but also you have to set boundaries. If she crosses them, I'm afraid you'll have to leave her. Best case scenario is that she'll see what she's been doing and change. If not, you'll have to move on, day by day. I guess that's life. You'll be ok (that's what everyone keeps telling me)...",
      "created_utc": 1730039724.0,
      "score": 1,
      "context": [
        {
          "id": "ltrlc0v",
          "author": "Super_Progress_4374",
          "body": "Damn Dude, this is almost EXACTLY what i’m going through right now (you could look at my post if you feel inclined lol). I’m in the situation where I don’t know if i can take it anymore, as much as i love that girl to death. Can I ask how you are handling yall being broken up, or if you have any regrets etc? I’m at such a crossroads right now",
          "created_utc": 1729898667.0
        }
      ]
    },
    {
      "id": "lrpnxs2",
      "author": "Anonymous5223423432",
      "body": "I actually don't consider her to be an alcoholic in terms of she needs to drink every day. She doesn't. But a lot of the times she drinks, she goes all the way... She can't handle alcohol, but she drinks anyway so there's got to be a deeper issue here. \n\nI think she is an alcoholic in terms of the reason she drinks. And that is to hide herself from the mental issues. She once told me that she loves being hung over because her mind is at peace...",
      "created_utc": 1728824111.0,
      "score": 2,
      "context": [
        {
          "id": "lrpiwou",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1728821710.0
        }
      ]
    },
    {
      "id": "lrq414g",
      "author": "Anonymous5223423432",
      "body": "Thank you. I actually go to therapy every two weeks for the last two years...",
      "created_utc": 1728830436.0,
      "score": 1,
      "context": [
        {
          "id": "lrpty3f",
          "author": "stoned_mexican",
          "body": "My wife is a researcher, and from what I remember from things she's told me, there is some relation between eating disorders and addiction. Both instances can lead to \"this solves a problem\" which can lead to a dependence.\n\nFrom a complete layman's point of view who has gotten a lot of information from their much smarter other half, ED is rooted in a desire for control. Imagine wanting to sit still and being absolutely jittery. It's an aggravatingly frustrating battle with themselves, and nothing they do will resolve it. It's a disorder because they keep thinking, \"I can do it. I am completely in control,\" while watching it slip through their fingers. They also don't want you to know because they think they can control it. So as when any person does when they are frustrated and lose control, they lash out. To anyone and everyone. You just happened to be the safest and closest lighting rod.\n\nI'm no one and nobody, and so you and everyone else can take what I say as complete bunk. However, what I do want you to know is that this was NOT about you. None of it is about you. Her problems are her problems, and you can only help people who WANT to be helped. You can't pull someone up who is constantly letting go.\n\nYou should also check in with a therapist yourself. Being with someone with ED is not easy and will definitely take its toll on you.",
          "created_utc": 1728826680.0
        }
      ]
    },
    {
      "id": "lrq5bo4",
      "author": "Enhanced_by_science",
      "body": "Eating Disorders stimulate the same \"reward\" center in the brain as drugs/alcohol/gambling/sex - it specifically involves Dopamine. Individuals with either an ED or substance addiction are at a significantly higher risk of developing the other as a substitute. \n\nI've been sober for 8 years, but have struggled with my ED for 27 years. It's a hell of a lot harder when you literally have to have your \"addiction of choice\" in some manner to survive. Food sobriety (aside from not partaking in purging or compensatory behaviors) really can't exist IMO.",
      "created_utc": 1728830883.0,
      "score": 1,
      "context": [
        {
          "id": "lrpty3f",
          "author": "stoned_mexican",
          "body": "My wife is a researcher, and from what I remember from things she's told me, there is some relation between eating disorders and addiction. Both instances can lead to \"this solves a problem\" which can lead to a dependence.\n\nFrom a complete layman's point of view who has gotten a lot of information from their much smarter other half, ED is rooted in a desire for control. Imagine wanting to sit still and being absolutely jittery. It's an aggravatingly frustrating battle with themselves, and nothing they do will resolve it. It's a disorder because they keep thinking, \"I can do it. I am completely in control,\" while watching it slip through their fingers. They also don't want you to know because they think they can control it. So as when any person does when they are frustrated and lose control, they lash out. To anyone and everyone. You just happened to be the safest and closest lighting rod.\n\nI'm no one and nobody, and so you and everyone else can take what I say as complete bunk. However, what I do want you to know is that this was NOT about you. None of it is about you. Her problems are her problems, and you can only help people who WANT to be helped. You can't pull someone up who is constantly letting go.\n\nYou should also check in with a therapist yourself. Being with someone with ED is not easy and will definitely take its toll on you.",
          "created_utc": 1728826680.0
        }
      ]
    },
    {
      "id": "lrpmxiy",
      "author": "Anonymous5223423432",
      "body": "I actually heard this from other people too. Not only this, but that I shouldn't mention calories, diets, even talk about food... How can I address the issue if I can't talk about it?",
      "created_utc": 1728823654.0,
      "score": 1,
      "context": [
        {
          "id": "lroutqp",
          "author": "ScottishWidow64",
          "body": "Never ever tell someone with AN they should eat or they are too skinny.",
          "created_utc": 1728806092.0
        }
      ]
    },
    {
      "id": "lrocosd",
      "author": "onyxjade7",
      "body": "They don’t want to continue the relationship that’s clear. They had enough, tried to set boundaries. The alcoholism and eating disorder both need to be addressed. They are trying to understand it, not get back together with them. \n\nWhile I don’t understand the alcohol the eating disorder piece is hard to explain. It’s complicated and can definitely screw with one’s mind. But, abuse is never ok and good for you op for leaving. Hopefully this will be a wake up call for them to go to AA and actually work on ed recovery. Many people are in ED recovery and not actually doing the work. It’s not that they don’t want to it’s that they aren’t ready. Wishing you and them well.",
      "created_utc": 1728794782.0,
      "score": 2,
      "context": [
        {
          "id": "lro4gyo",
          "author": "Background_Mistake76",
          "body": "People are honest when they are drunk. Now, I have not had this health issues so I can not speak on if it is a combination of things - but she can try therapy. If you want to continue the relationship or not is really up to you, but I would highly suggest therapy for maybe the both of you if they offer couples counesling to non-married people",
          "created_utc": 1728790729.0
        }
      ]
    },
    {
      "id": "lrpbdal",
      "author": "lavenderlove1212",
      "body": "A lot of times it’s not honesty when someone is blackout drunk. Many times people do and say things they don’t think or wouldn’t ordinarily do sober.",
      "created_utc": 1728817492.0,
      "score": 1,
      "context": [
        {
          "id": "lro4gyo",
          "author": "Background_Mistake76",
          "body": "People are honest when they are drunk. Now, I have not had this health issues so I can not speak on if it is a combination of things - but she can try therapy. If you want to continue the relationship or not is really up to you, but I would highly suggest therapy for maybe the both of you if they offer couples counesling to non-married people",
          "created_utc": 1728790729.0
        }
      ]
    },
    {
      "id": "ltrm3ct",
      "author": "Super_Progress_4374",
      "body": "I am going through a nearly identical situation as OP. I’m struggling to understand what boundaries are okay to set. Telling her to stop drinking or “don’t do that you look perfect” and things of that nature are obviously counterproductive. I don’t know how to draw a line without just feeding into the recurring cycle of her behaviors, do yall have any ideas of what would be an acceptable boundary?",
      "created_utc": 1729898955.0,
      "score": 2,
      "context": [
        {
          "id": "lro88z5",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1728792516.0
        },
        {
          "id": "lrruaom",
          "author": "Minimum_Pangolin6347",
          "body": "I couldn’t have said it better myself. I think you touched on a LOT of how our minds work. I don’t think anyone can TRULY UNDERSTAND unless they themselves have gone thru it. ED NEVER go away. I might not be purging this year, but I definitely restrict. But not enough to “look anorexic”. So to everyone else, I look “fine”. When in fact, my mind is just as unhealthy if not more as it was years ago when I was severely underweight. And yes, some of us might heal ourselves and never binge, purge or restrict ever again, BUT, in my opinion, it truly never leaves our minds. To me, “it”pretty much calls the shots. “It” decides how I will feel today. How I will look today. It fucking SUCKS. ED SUCK. I wouldn’t wish this on anyone.  \n\nIn regards to people having relationships with us, I guess that all depends on how much you can handle and how much you are willing to take on. Most people will run. Most people will run extremely far away. There are those few that stick around out of love for the person, but it takes a strong heart and a strong mind to be with us let alone live with us. So that is the question that you need to ask yourself. How much do you love her and how much are you willing to take on? As the above poster said though, boundaries are extremely important as well. I wish you all the best and I hope that your ex recovers and becomes the best version of herself.",
          "created_utc": 1728850641.0
        }
      ]
    },
    {
      "id": "lrreg5h",
      "author": "Anonymous5223423432",
      "body": "Thank you for this comment...\n\nI mentioned in another comment that I don't consider her an alcoholic in a traditional sense and I feel like all the problems with alcohol are actually caused by ED. Having said that, alcohol is not helping. It just makes things go in a very bad direction. She can't handle it and it's a big problem. I feel she should stop drinking if she wants to heal herself...\n\nThe story with your friend hits home hard. More and more people are adding similar comments so I'm starting to realize that I was not the problem.  I'm also starting to paint the picture in my head about this awful disease. It's mind blowing to me how hard and serious this condition is. The example with alcohol and fentanyl are great to comprehend the problem...\n\nI'll DM you for the books...",
      "created_utc": 1728845537.0,
      "score": 3,
      "context": [
        {
          "id": "lrps2ty",
          "author": "Anonymous5223423432",
          "body": "Thank you all for your answers. It means a lot to me that you shared your stories. Some of them are scary familiar...\n\nFor days now I've been struggling if I made the right choice? Should I have stayed and try to help her? Be her support no matter how ugly it gets? Although she's addressing the ED problem and is seeking help, her not seeing the alcohol problem is something I can't help her with. She doesn't see that at all and I feel like she has to come to a point where she figures this one out by herself. What pains me is when she does eventually figure it out, I won't be there anymore. I'm slowly healing from all of this and trying to move on...\n\nWhat frightens me is the health problems you guys mentioned. Long term ones. She has hormonal issues because of it and she has heart issues which I didn't connect with this, but one of you mentioned them... Might be that those problems are from ED too. I really hope she's going to be better because she's an amazing person and I feel like she doesn't deserve this, but life's not fair, right?\n\nI will check out the books you mentioned. Thank you...\n\nAlso, I wish all of you that you heal from this horrible disease. I can see from your answers and from my experience with my ex that people who are suffering from this are very intelligent (I actually read this somewhere and it's true), self aware and empathic which are great, if not the best, values a person can have. Hope you all reach the point where you can reveal that to the people around you…",
          "created_utc": 1728825901.0
        },
        {
          "id": "lrr1mj2",
          "author": "Lawats06",
          "body": "I’m sorry you’re going through this. I haven’t been in this position in my relationship, but as a social worker I have worked with inpatient ED clients (with addiction and without) as well as with addiction and mental health in other capacities. I also have a friend with very similar behaviour to your ex. \n\nYou could spend the rest of your life trying to help (save) her, but it will never be you to do that. It has to be her. Until she decides she wants help, no one else can make someone change. I’m sure you feel guilty, like you could have done more, etc. but please know that no matter what you did or didn’t do, it likely wouldn’t have made a difference (I mean this in the nicest way). \nPersonally, I don’t see this as alcoholism, but definitely problematic drinking, likely caused by the same emotional issues as her ED- depression, self hatred, guilt, anxiety, trauma, avoidance, you name it….\n\nI have a friend who is 28 but has had an ED since 13. Been to inpatient, outpatient, etc etc. She’s doing all the stuff to help, but it isn’t “cured”. She still struggles with it every day and has lapses. She was at my house recently and we were drinking wine, and she ended up on the floor in a ball crying about how she thinks I don’t like her, how much she hates herself, etc. She has recently realized that she gets completely out of control when she drinks, usually as a result of not eating, but also drinks more than she “should” and as much as someone who is a healthy weight (for example will drink as much as me who is 5’5 and 135 lbs.) She always cries when she drinks and regrets everything she does and says, and then spirals into more self hatred. She hasn’t stopped drinking but the last few months has reduced the amount she drinks and is more mindful. This isn’t always the case though. \nI also believe eating disorders are the hardest to recover from (if you think about it in the same lens as addiction). All are maladaptive coping strategies but if you are recovering from a substance use disorder, you can avoid people, places, and things that trigger you. \nFor EDs, food is your “drug of choice” but you CANT avoid it. It is the thing that sustains life. It’s like telling an alcoholic who wants to remain sober that he has to have 3 drinks a day but no more or less. Or putting fentanyl in front of someone in recovery from opiate use disorder every day and expecting them to remain sober (possible but makes it extraordinary difficult) That’s simply not the way recovery works. \n\nIf you want book reccos, DM and we can discuss further. I’ve read so many but want to know more about what type you’re looking for. \n\nI apologize for the rant and I hope it makes sense. I could talk about this for hours but we will never understand unless we have Ben there ourselves. \nAddiction and EDs are so complex and heartbreaking. I feel for you and everyone suffering from this. Hopefully one day your ex will get the help she needs to live a happy and healthy life.",
          "created_utc": 1728841492.0
        }
      ]
    },
    {
      "id": "lrsj23o",
      "author": "_Subway_Kid_",
      "body": "I hope you are doing ok to yourself. And i also hope that you dont feel responsible for her response to the break up because tbh she is the one responsible for her abusive behaviour toward you.",
      "created_utc": 1728859141.0,
      "score": 2,
      "context": [
        {
          "id": "lrru5ik",
          "author": "_Subway_Kid_",
          "body": "I can only speak for myself:\n\nMy ED has nothing to do with food. Its just what my body ended up going to in order to cope with bullying when i was a kid and even tho i am not considered anorexic anymore (im at a healthy weight for my age and height) i still struggle a lot with it. I may look like i dont have ED but in my mind, i constantly struggle with it. I always feel like i am really fat. And its honestly a coping strategy for things that i cant control. I can control how much i eat and how much i weigh. Also, its like a form of self harm in that i can starve myself and control the pain and intensity of pain that i can feel instead of dealing with pain that i cant control. \n\nAgain, only speaking from my personal perspective: You going on a diet was triggering for her because she was probably going to eat breakfast and since you were skipping breakfast, it was in her mind as if you were telling her that she was fat or something. Like, you dont have to eat and can skip a meal but she cant. I dont know if that makes sense. And her reaction was lashing out because she struggles with that on a personal level. \n\nAnd she probably had a hard time connecting with you because ED is something that you just dont understand and its something she probably struggles with every day. \n\nI would also say that she probably hates herself tbh. Im again speaking from personal experience so this might only apply to me but my ED is connected to the way i see myself. Even though i still struggle with it, it was significantly worse when i hated myself and had a perfectionistic mindset. Now that i am beginning to accept myself as i am, i dont struggle with it like i used to. It doesnt control me anymore. The fact that she would lash out to you and then later say you were the lohl tells me that she is probably scared of being vulnerable with you. She probably really wanted to be with you and still does but was afraid at the same time. So she was sending mixed signals. It sounds like she has a lot of work to do on herself before she gets in another serious relationship. \n\nHaving said all that, its good that you broke it off because her behaviour was getting out of hand. But also, why are you just now trying to understand her ED instead of trying to understand sooner?",
          "created_utc": 1728850595.0
        },
        {
          "id": "lrs5co2",
          "author": "Anonymous5223423432",
          "body": "Unfortunately I failed to see how big of a problem this was. She would frequently lie to me that she's good and that for example my diet doesn't affect her anymore, so I would assign most of her behavior to excess alcohol use. I'm only now realizing what kind of an illness this is. To be honest, reading all this, I doubt that I could make any difference even if I knew sooner. But if you're asking me do I feel guilty I didn't take it serious enough? Yes, I do... I guess it had to come to the breaking point for me to see this...",
          "created_utc": 1728854266.0
        }
      ]
    },
    {
      "id": "lrue4sy",
      "author": "Shouya_Ishida1288",
      "body": "Better late than never. Thank you for keeping an open mind about this condition after the experience you went through. Truly wish more people had this empathy.",
      "created_utc": 1728890847.0,
      "score": 2,
      "context": [
        {
          "id": "lrru5ik",
          "author": "_Subway_Kid_",
          "body": "I can only speak for myself:\n\nMy ED has nothing to do with food. Its just what my body ended up going to in order to cope with bullying when i was a kid and even tho i am not considered anorexic anymore (im at a healthy weight for my age and height) i still struggle a lot with it. I may look like i dont have ED but in my mind, i constantly struggle with it. I always feel like i am really fat. And its honestly a coping strategy for things that i cant control. I can control how much i eat and how much i weigh. Also, its like a form of self harm in that i can starve myself and control the pain and intensity of pain that i can feel instead of dealing with pain that i cant control. \n\nAgain, only speaking from my personal perspective: You going on a diet was triggering for her because she was probably going to eat breakfast and since you were skipping breakfast, it was in her mind as if you were telling her that she was fat or something. Like, you dont have to eat and can skip a meal but she cant. I dont know if that makes sense. And her reaction was lashing out because she struggles with that on a personal level. \n\nAnd she probably had a hard time connecting with you because ED is something that you just dont understand and its something she probably struggles with every day. \n\nI would also say that she probably hates herself tbh. Im again speaking from personal experience so this might only apply to me but my ED is connected to the way i see myself. Even though i still struggle with it, it was significantly worse when i hated myself and had a perfectionistic mindset. Now that i am beginning to accept myself as i am, i dont struggle with it like i used to. It doesnt control me anymore. The fact that she would lash out to you and then later say you were the lohl tells me that she is probably scared of being vulnerable with you. She probably really wanted to be with you and still does but was afraid at the same time. So she was sending mixed signals. It sounds like she has a lot of work to do on herself before she gets in another serious relationship. \n\nHaving said all that, its good that you broke it off because her behaviour was getting out of hand. But also, why are you just now trying to understand her ED instead of trying to understand sooner?",
          "created_utc": 1728850595.0
        },
        {
          "id": "lrs5co2",
          "author": "Anonymous5223423432",
          "body": "Unfortunately I failed to see how big of a problem this was. She would frequently lie to me that she's good and that for example my diet doesn't affect her anymore, so I would assign most of her behavior to excess alcohol use. I'm only now realizing what kind of an illness this is. To be honest, reading all this, I doubt that I could make any difference even if I knew sooner. But if you're asking me do I feel guilty I didn't take it serious enough? Yes, I do... I guess it had to come to the breaking point for me to see this...",
          "created_utc": 1728854266.0
        }
      ]
    },
    {
      "id": "lrrdlkj",
      "author": "cappuccinofathe",
      "body": "If you don’t have much anxiety you might not be able to relate. I’ve met some people who’ve dated anorexic people in the past and don’t even try to understand. So just asking is a great thing even if you aren’t together anymore. But think of something that has always been a constant in your life. Maybe a game, club, family time, maybe you always have a dessert after dinner or you need to watch something before bed. Then think about if you rely on it, do you rely on it to be happy, to fulfill a requirement, maybe it’s just a tradition. And replace that with something harmful something that hurts you. But you rely on it, if you dont have it anymore things will get really bad in your head. So the control is a little related to ocd, it’s not a type of ocd but it’s the same compulsive issue. I recommend watching the “to the bone” movie. It might still be in Netflix, if you still want to do your best to understand eating disorders and how they hurt and control people. Even if you aren’t together anymore or don’t plan on getting back together, I think this is a good start to grow as a person. Because we all need to try to understand each other, even if it doesn’t outrightly affect us.",
      "created_utc": 1728845263.0,
      "score": 2,
      "context": [
        {
          "id": "lrr10kf",
          "author": "cappuccinofathe",
          "body": "I’ll try my best to explain to my understanding the effects and issues that fuel anorexia and what makes it come back. I am currently in recovering and in therapy for it and things still really trigger me. People who you eat with regularly become some sort of comfort at least for me. If I was her and my partner was going on a diet even for health reasons so be open about it would really make it super hard for me not to be affected. And if I was left alone with those emotions while my partner is on an open diet I would most def release. An ed is a mental illness, buts it’s something you can control. That’s the main reason it really difficult to ever get over it. If something is out of control your brain will say “you can always starve yourself it’s something you can control” so the first aspect that my therapist told me that pretty much every person suffering from an ed has is a control issue. And it’s not about wanting to be in control of everything, it’s more like this is the only thing I can rely on, a comfort. Even if it might not seem that way to you. As for the alcohol issues I have know some people with an ed that use alcohol as a way to loose weight and suppress the voices. And it fuels anxiety and insecurities. It’s a bully in your head that never shuts up. But a bully that’s always there and will manipulate you into thinking things and doing things.",
          "created_utc": 1728841304.0
        },
        {
          "id": "lrrbwop",
          "author": "Anonymous5223423432",
          "body": "Yes, she always said it was not about the food but control. I must admit, I don't get it... Thank you for the answer though...",
          "created_utc": 1728844714.0
        }
      ]
    },
    {
      "id": "lrq1qz9",
      "author": "JeffreyFarmer",
      "body": "Do not mention calories or weight specifically, or anything linked to appearance. Tell her that she will get arthritis, that her bones will break, that she won’t be able to have kids, that she’ll have severe long term heart and other medical issues.\n\nTell her that she is beautiful but her body is dying and she should love and cherish it for everything it does.\n\nI definitely resonate with her situation. Subtly limit the partying as she is likely saving her calories for drinks and that’s a hard habit to break. Encourage her to get a new therapist or join a support group.\n\nShe can get through this. Anything someone eats less than her, or mentions calories or weight, she will get triggered. Recovery is just a matter of understanding that food isn’t the enemy, it’s the disorder that is.",
      "created_utc": 1728829627.0,
      "score": 1,
      "context": [
        {
          "id": "lroutqp",
          "author": "ScottishWidow64",
          "body": "Never ever tell someone with AN they should eat or they are too skinny.",
          "created_utc": 1728806092.0
        },
        {
          "id": "lrpmxiy",
          "author": "Anonymous5223423432",
          "body": "I actually heard this from other people too. Not only this, but that I shouldn't mention calories, diets, even talk about food... How can I address the issue if I can't talk about it?",
          "created_utc": 1728823654.0
        }
      ]
    },
    {
      "id": "lrrfrsf",
      "author": "Anonymous5223423432",
      "body": "This is actually why I decided to write this post. There are things with ED I don't get at all. Thanks for the insight. Still don't get it though. You can choose anything else that you have control of. Why choose this? It will only hurt you... I guess it's not so rational as I expect it to be.\n\nStill need to do a lot more research obviously. I'll watch the movie. Thank you...",
      "created_utc": 1728845971.0,
      "score": 2,
      "context": [
        {
          "id": "lrr10kf",
          "author": "cappuccinofathe",
          "body": "I’ll try my best to explain to my understanding the effects and issues that fuel anorexia and what makes it come back. I am currently in recovering and in therapy for it and things still really trigger me. People who you eat with regularly become some sort of comfort at least for me. If I was her and my partner was going on a diet even for health reasons so be open about it would really make it super hard for me not to be affected. And if I was left alone with those emotions while my partner is on an open diet I would most def release. An ed is a mental illness, buts it’s something you can control. That’s the main reason it really difficult to ever get over it. If something is out of control your brain will say “you can always starve yourself it’s something you can control” so the first aspect that my therapist told me that pretty much every person suffering from an ed has is a control issue. And it’s not about wanting to be in control of everything, it’s more like this is the only thing I can rely on, a comfort. Even if it might not seem that way to you. As for the alcohol issues I have know some people with an ed that use alcohol as a way to loose weight and suppress the voices. And it fuels anxiety and insecurities. It’s a bully in your head that never shuts up. But a bully that’s always there and will manipulate you into thinking things and doing things.",
          "created_utc": 1728841304.0
        },
        {
          "id": "lrrbwop",
          "author": "Anonymous5223423432",
          "body": "Yes, she always said it was not about the food but control. I must admit, I don't get it... Thank you for the answer though...",
          "created_utc": 1728844714.0
        },
        {
          "id": "lrrdlkj",
          "author": "cappuccinofathe",
          "body": "If you don’t have much anxiety you might not be able to relate. I’ve met some people who’ve dated anorexic people in the past and don’t even try to understand. So just asking is a great thing even if you aren’t together anymore. But think of something that has always been a constant in your life. Maybe a game, club, family time, maybe you always have a dessert after dinner or you need to watch something before bed. Then think about if you rely on it, do you rely on it to be happy, to fulfill a requirement, maybe it’s just a tradition. And replace that with something harmful something that hurts you. But you rely on it, if you dont have it anymore things will get really bad in your head. So the control is a little related to ocd, it’s not a type of ocd but it’s the same compulsive issue. I recommend watching the “to the bone” movie. It might still be in Netflix, if you still want to do your best to understand eating disorders and how they hurt and control people. Even if you aren’t together anymore or don’t plan on getting back together, I think this is a good start to grow as a person. Because we all need to try to understand each other, even if it doesn’t outrightly affect us.",
          "created_utc": 1728845263.0
        }
      ]
    },
    {
      "id": "lrq3r7v",
      "author": "Anonymous5223423432",
      "body": "Oh my god, you just mentioned every health issue that she has. I thought it mostly impacted her mental health, but this is awful...\n\nUnfortunately we don't communicate any more. If we ever will again, I'll remember these tips you gave me. Thank you...",
      "created_utc": 1728830338.0,
      "score": 1,
      "context": [
        {
          "id": "lroutqp",
          "author": "ScottishWidow64",
          "body": "Never ever tell someone with AN they should eat or they are too skinny.",
          "created_utc": 1728806092.0
        },
        {
          "id": "lrpmxiy",
          "author": "Anonymous5223423432",
          "body": "I actually heard this from other people too. Not only this, but that I shouldn't mention calories, diets, even talk about food... How can I address the issue if I can't talk about it?",
          "created_utc": 1728823654.0
        },
        {
          "id": "lrq1qz9",
          "author": "JeffreyFarmer",
          "body": "Do not mention calories or weight specifically, or anything linked to appearance. Tell her that she will get arthritis, that her bones will break, that she won’t be able to have kids, that she’ll have severe long term heart and other medical issues.\n\nTell her that she is beautiful but her body is dying and she should love and cherish it for everything it does.\n\nI definitely resonate with her situation. Subtly limit the partying as she is likely saving her calories for drinks and that’s a hard habit to break. Encourage her to get a new therapist or join a support group.\n\nShe can get through this. Anything someone eats less than her, or mentions calories or weight, she will get triggered. Recovery is just a matter of understanding that food isn’t the enemy, it’s the disorder that is.",
          "created_utc": 1728829627.0
        }
      ]
    },
    {
      "id": "lrrix6z",
      "author": "cappuccinofathe",
      "body": "Usually it comes from people who need something to rely on, and it just never leaves. Even if you find someone later in life it’s still there. Like PTsd. It really feeds on insecurities and anxiety. It also thrives in depression. But sometimes it’s come from determination as well. It’s really easy for it to start from wanting to loose weight so you just stop eating. Then at some point the euphoria comes and your brain releases the chemicals like seratonin. Most of the time eating disorders come because we want to improve ourselves. Then we realize this isn’t good maybe I should stop, but it feels good why would I stop. Then you become dependent. So it’s more than I need control straight forward, it’s like an addiction. And for people who have addiction problems genetically it’s really hard to stop and even if you heal u can always come back. Overall it’s a mental illness that can start in many different ways. But it feeds off of any mental problem that might lie dormant or a problem you think you have under control. In my opinion it’s a lot like OCD. Maybe you have watched the show MONK he had ocd, it’s an exaggerated form for tv but it’s shows the calm you get from the compulsive behavior. Eating disorders are compulsive behaviors.",
      "created_utc": 1728846992.0,
      "score": 3,
      "context": [
        {
          "id": "lrr10kf",
          "author": "cappuccinofathe",
          "body": "I’ll try my best to explain to my understanding the effects and issues that fuel anorexia and what makes it come back. I am currently in recovering and in therapy for it and things still really trigger me. People who you eat with regularly become some sort of comfort at least for me. If I was her and my partner was going on a diet even for health reasons so be open about it would really make it super hard for me not to be affected. And if I was left alone with those emotions while my partner is on an open diet I would most def release. An ed is a mental illness, buts it’s something you can control. That’s the main reason it really difficult to ever get over it. If something is out of control your brain will say “you can always starve yourself it’s something you can control” so the first aspect that my therapist told me that pretty much every person suffering from an ed has is a control issue. And it’s not about wanting to be in control of everything, it’s more like this is the only thing I can rely on, a comfort. Even if it might not seem that way to you. As for the alcohol issues I have know some people with an ed that use alcohol as a way to loose weight and suppress the voices. And it fuels anxiety and insecurities. It’s a bully in your head that never shuts up. But a bully that’s always there and will manipulate you into thinking things and doing things.",
          "created_utc": 1728841304.0
        },
        {
          "id": "lrrbwop",
          "author": "Anonymous5223423432",
          "body": "Yes, she always said it was not about the food but control. I must admit, I don't get it... Thank you for the answer though...",
          "created_utc": 1728844714.0
        },
        {
          "id": "lrrdlkj",
          "author": "cappuccinofathe",
          "body": "If you don’t have much anxiety you might not be able to relate. I’ve met some people who’ve dated anorexic people in the past and don’t even try to understand. So just asking is a great thing even if you aren’t together anymore. But think of something that has always been a constant in your life. Maybe a game, club, family time, maybe you always have a dessert after dinner or you need to watch something before bed. Then think about if you rely on it, do you rely on it to be happy, to fulfill a requirement, maybe it’s just a tradition. And replace that with something harmful something that hurts you. But you rely on it, if you dont have it anymore things will get really bad in your head. So the control is a little related to ocd, it’s not a type of ocd but it’s the same compulsive issue. I recommend watching the “to the bone” movie. It might still be in Netflix, if you still want to do your best to understand eating disorders and how they hurt and control people. Even if you aren’t together anymore or don’t plan on getting back together, I think this is a good start to grow as a person. Because we all need to try to understand each other, even if it doesn’t outrightly affect us.",
          "created_utc": 1728845263.0
        },
        {
          "id": "lrrfrsf",
          "author": "Anonymous5223423432",
          "body": "This is actually why I decided to write this post. There are things with ED I don't get at all. Thanks for the insight. Still don't get it though. You can choose anything else that you have control of. Why choose this? It will only hurt you... I guess it's not so rational as I expect it to be.\n\nStill need to do a lot more research obviously. I'll watch the movie. Thank you...",
          "created_utc": 1728845971.0
        }
      ]
    }
  ]
}