{
  "id": "1g9sqxe",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1729630282.0,
  "title": "I think my mom has orthorexia",
  "selftext": "My mom has been like this since I was a child but it seems to have gotten worse. I never knew there was an actual term for it. \n\nShe makes everything from scratch including bread, any condiments, every vegetable or fruit has to be from a farmer or her own garden. She has even wanted to get her own chickens. She will only drink raw milk, she drinks a keifer smoothie for breakfast every single day and doesn’t eat again until dinner time. She spends hundreds of dollars to get meat from a butchered cow from a very well renowned farmer. \n\nShe says everything in the grocery store is poison, if you eat processed food you will get chronic illnesses, develop cancer and just in general die at a young age. So she is very selective buying things from the store it’s usually ingredients like cinnamon, salt, or butter. She will spend a lot of time in the store just reading every single ingredient in stuff. She also barely eats out ever and if she does she has to eat at a very expensive restaurant. \n\nShe had told people they are overweight because they drink Diet Coke and they will develop diabetes. She used to get very upset if i walked in with a McDonald’s bag even if it was only once in a while. As a kid I was always hungry and would eat dry cheerios or bread after school because she refused to buy snacks. \n\nI agree a lot of what she says that they add a lot of bad stuff to our food especially in the United States but I feel like it just continues to get more extreme. Her and my grandma are the same even saying stuff like they have to order bananas from a different country because they are supposed to have big seeds in them and that regular bananas are genetically modified. \n\nI just think it is an issue because she should be able to live her life and be able to eat French fries once in a while without feeling awful about it. She spends so many hours in the kitchen preparing food like she lives in the 1900s, I don’t know maybe this is something I shouldn’t be concerned about. I don’t think I could get her help if I wanted to",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1g9sqxe/i_think_my_mom_has_orthorexia/",
  "score": 50,
  "num_comments": 11,
  "comments": [
    {
      "id": "lt9y3vc",
      "author": "None",
      "body": "If you feel its affecting you in a negative way, try to speak to her about it. she might understand how you see it as a non-disordered person. \n\nnow i dont know ur situation, but maybe bring in other people who might think similarly as you, such as ur dad, and do an intervention kinda thing. hope it gets better :)",
      "created_utc": 1729648639.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ltd3mtl",
      "author": "lavvstarr",
      "body": "My mum worked as a psychiatric nurse and knows a lot about eating disorders as she specialised there. She says that there is some form of eating disorder there, but lots of it may come from OCD. She also suggested that she talked to a professional about the poison thoughts and her views on food because it can get worse and worse as you said it already has.",
      "created_utc": 1729700530.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ltasv0j",
      "author": "Cherryberrybean",
      "body": "My sister is like this. I am 47 and she's 40. It has destroyed our relationship. Her children are tiny and frail and she's impossible to talk to regarding anything else. They have to want the help. She doesnt so we don't really have a relationship now ",
      "created_utc": 1729662237.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ltht6pj",
      "author": "rcarman87",
      "body": "I don’t really think it sounds like she has a disorder. She’s more aware than most people of the chemicals, dyes, fillers in foods…. I don’t see it being extreme but I’m an outsider.",
      "created_utc": 1729768628.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ltie8cc",
      "author": "FloridaMomm",
      "body": "It’s possible to have disordered eating without it meeting the criteria of an ED. Especially as a child of the 90s, diet culture was so pervasive **everywhere** and disordered behaviors were rampant within every family I knew (I started South Beach when I was *7* and my family acted like carbs were the devil incarnate)\n\nYour mom’s behavior sounds disordered for sure, whether it’s enough to get a diagnosis is not clear. Ultimately all you can do is express your concerns- unless her BMI plunges to a dangerous level, she’s not going to be entered into treatment against her will. She’ll only get help if she feels she needs it",
      "created_utc": 1729777210.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ltae0g8",
      "author": "None",
      "body": "100% ortho",
      "created_utc": 1729654813.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lu8ds7l",
      "author": "Logical_Step_749",
      "body": "https://www.allianceforeatingdisorders.com/groups/virtual-friends-and-family/",
      "created_utc": 1730145995.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lud1erv",
      "author": "booreaves",
      "body": "This sounds like orthorexia. I’m so sorry, this sounds like such a tough environment to grow up in. Are you getting enough food? If not, does your school or local non-profits have a food pantry you can get things from? I’m most concerned for your well being. \n\nEveryone is going to die at some point. Using food as a weapon to avoid cancer, heart disease, diabetes and/or to attack others is not reasonable. It’s a mental disorder; I know because I’ve recovered from it. I used to do similar things. It’s almost impossible to live under that much pressure.",
      "created_utc": 1730215445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lu8db22",
      "author": "Logical_Step_749",
      "body": "OCD and eating disorders can co occur a lot as well",
      "created_utc": 1730145851.0,
      "score": 1,
      "context": [
        {
          "id": "ltd3mtl",
          "author": "lavvstarr",
          "body": "My mum worked as a psychiatric nurse and knows a lot about eating disorders as she specialised there. She says that there is some form of eating disorder there, but lots of it may come from OCD. She also suggested that she talked to a professional about the poison thoughts and her views on food because it can get worse and worse as you said it already has.",
          "created_utc": 1729700530.0
        }
      ]
    },
    {
      "id": "lu02hl3",
      "author": "sunghoon4",
      "body": "even if it's not an eating disorder I think she needs proffessional help because if this is taking over her life and even her child went hungry because she refused to buy snacks it isn't normal. ",
      "created_utc": 1730033708.0,
      "score": 0,
      "context": [
        {
          "id": "ltht6pj",
          "author": "rcarman87",
          "body": "I don’t really think it sounds like she has a disorder. She’s more aware than most people of the chemicals, dyes, fillers in foods…. I don’t see it being extreme but I’m an outsider.",
          "created_utc": 1729768628.0
        }
      ]
    }
  ]
}