{
  "id": "1gb7b1h",
  "subreddit": "EatingDisorders",
  "author": "Annoymous_stories",
  "created_utc": 1729788591.0,
  "title": "My girlfriend chews food and spits it out.",
  "selftext": "Hi so me and my girlfriend have been losing weight together for the last 8ish months. We’ve been doing it healthy, or at least I thought we were both doing it healthy.\n\nAfter dinner today I caught her eating a bar of chocolate and a bag of crisps and chewing it up before spitting it into a plastic bag, and rinsing her mouth with water. I was shocked of course and she just didn’t care. Said the y’know what doesn’t count if she does it that way.\n\nI’m not sure how to come at this. I noticed that she’s been getting a bit on the unhealthier side of the weight scale but she just told me her appetite hasn’t been that big. This is the only thing she does that is disordered and I’m really scared for her going down this path. She’s 18 and I’m close to 17 so I can’t do anything really since she’s 18 already but any advice would help ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1gb7b1h/my_girlfriend_chews_food_and_spits_it_out/",
  "score": 81,
  "num_comments": 28,
  "comments": [
    {
      "id": "ltnq1or",
      "author": "watrmeln420",
      "body": "I remember when I started doing this at 15, I’m now 18, and it spiraled into Bulimia nervosa. \n\nIt’s not worth the slight satisfaction she’s gaining. It’s a gateway into more serious EDs.",
      "created_utc": 1729849932.0,
      "score": 57,
      "context": []
    },
    {
      "id": "ltougbq",
      "author": "Lindsey7618",
      "body": "OP I'm sorry but this is definitely NOT the only disordered thing she's doing. You didn't even know she was chewing and spitting until you caught her. This is going to be hard and it will suck, but I'd seriously talk to her parents if they are good parents. I wrecked my life because of my eating disorder. I also hid things. This is going to ruin her life and it will almost definitely turn into a full blown ED *if* it hasn't already which it sounds like it may have.",
      "created_utc": 1729867015.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ltn2kht",
      "author": "None",
      "body": "Chewing and spitting behavior is a pattern of disordered eating that occurs when someone chews food but spits it out instead of swallowing it. The behavior is typically considered an attempt to get pleasure from eating without ingesting calories.\n\nChewing is the first step in the digestive process, which typically sets off a chain reaction in the body, anticipating an influx of food. However, when no food arrives, some of the mechanisms put into motion by chewing can potentially cause problems.\n\nCHSP is a very dangerous disorder in my opinion and I speak from experience. It took over my life like an addiction.",
      "created_utc": 1729834887.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ltnsrpy",
      "author": "Kindly_Bodybuilder43",
      "body": "Hey there, you've had some good answers for your friend already. I just wanted to pick up that you have been dieting at 16. I'd really urge you to refocus your energies and check in with how you are doing in general. I know dieting is very normalised, but it's not healthy or helpful for anyone to do it, especially when your body is still growing and developing. Look after yourself ❤️",
      "created_utc": 1729851588.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ltnb9ji",
      "author": "rusticterror",
      "body": "Can you tell her parents, a school psychologist, or a trusted teacher? It definitely sounds like an eating disorder in the making, if it’s not full-fledged already. I don’t want to diminish what impact you can personally have, AND you’re both kids—EDs are serious, life ruining illnesses that need adult professional help to overcome. I’m glad you’re noticing and looking out for her. I really hope she is willing to listen.",
      "created_utc": 1729840182.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ltosla0",
      "author": "katkale",
      "body": "I was 18 in college when my boyfriend got adults involved in my ED, I’m now 30 and would consider myself in recovery not using any behaviors for at least 5-6 years now. If he hadn’t told anyone I don’t know where I would be now. \n\n\nIf your gf is only chewing and spitting now, it will progress to include more behaviors and cause more damage as time goes on. You can’t fix this for her, she needs professional guidance. My college had services available for me, her school may offer something like that? My bf sat down with me and supported me while I called them. I got a therapist, psychiatrist, nutritionist and a doctor I met with on campus. When this wasn’t working they furthered my care and connected me with other professionals. \n\n\n12 years later I don’t see or talk to this ex boyfriend often, our relationship ended related to the stress my ED caused but we were also young and not meant to be together forever, but every so often I get a call from him/ I call him and just tell remind him of the huge impact he had on my life. \n\nIt’s going to be hard but she needs help. You’ve only witnessed one incident, her beliefs and views about weight loss are clearly unhealthy and there are likely more behaviors she is finding and lying about. She may be upset with you for wanting her to get help or even suggesting something is wrong. \n\nThere are resources for people supporting those with eating disorders, maybe educating yourself a little more on what behaviors may looks like and how to communicate your concerns to her would be beneficial. \n\n\nI’m so sorry your girlfriend is going through this, you are a good partner for asking for guidance and wanting to help her.",
      "created_utc": 1729866418.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ltmpoqw",
      "author": "alienprincess111",
      "body": "This is an eating disorder called chew and spit",
      "created_utc": 1729828342.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ltqr0f9",
      "author": "okiborn33",
      "body": "I've been down that road when I was that age.  I didn't chew and spit but I restricted and lost a significant amount of weight. I didn't realize how much I was depriving my body until it turned into binging. It got worse and worse over the years and now it's causing health issues, diabetes, high cholesterol, depression, etc and i'm only in my early 30s. That doesn't necessarily cause binging eating in everyone but not giving your body the essentials it needs causes malnutrition which leads into a whole other set of health issues. Maybe talking to her a little about that might help.",
      "created_utc": 1729888108.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lttlbtn",
      "author": "FlightAffectionate22",
      "body": "It's considered \"eating disorder behavior\", and people with anorexia and bulimia can engage in it often, as I did. As weird and sick as it sounds, I thought I had INVENTED it, when I never heard of it before. In high school, because I  was into the start of an ED, both A & B, and BC I didn't feel comfortable eating in the lunchroom, I'd sometimes eat my lunch in a bathroom stall and spitting out each bite, savoring the flavor, but not swallowing it to take in the dreaded calories.",
      "created_utc": 1729931590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lu4g73w",
      "author": "No_Cartoonist_4851",
      "body": "100% encourage her to see a therapist, even offer to go with her to sessions.",
      "created_utc": 1730086431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ltoh0n5",
      "author": "Annoymous_stories",
      "body": "Omg that’s horrible I’m so sorry to hear that.",
      "created_utc": 1729862485.0,
      "score": 15,
      "context": [
        {
          "id": "ltnq1or",
          "author": "watrmeln420",
          "body": "I remember when I started doing this at 15, I’m now 18, and it spiraled into Bulimia nervosa. \n\nIt’s not worth the slight satisfaction she’s gaining. It’s a gateway into more serious EDs.",
          "created_utc": 1729849932.0
        }
      ]
    },
    {
      "id": "ltogyrq",
      "author": "Annoymous_stories",
      "body": "Oh don’t worry about me honestly I journal a lot and throughout my own dieting journey I made sure I refocused on my proteins and carbs when I felt my body needed it etc 💞 I’m doing so good which is why I’m so sad my gf was struggling and I had no idea",
      "created_utc": 1729862466.0,
      "score": 9,
      "context": [
        {
          "id": "ltnsrpy",
          "author": "Kindly_Bodybuilder43",
          "body": "Hey there, you've had some good answers for your friend already. I just wanted to pick up that you have been dieting at 16. I'd really urge you to refocus your energies and check in with how you are doing in general. I know dieting is very normalised, but it's not healthy or helpful for anyone to do it, especially when your body is still growing and developing. Look after yourself ❤️",
          "created_utc": 1729851588.0
        }
      ]
    },
    {
      "id": "ltqpweo",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1729887753.0,
      "score": -12,
      "context": [
        {
          "id": "ltnsrpy",
          "author": "Kindly_Bodybuilder43",
          "body": "Hey there, you've had some good answers for your friend already. I just wanted to pick up that you have been dieting at 16. I'd really urge you to refocus your energies and check in with how you are doing in general. I know dieting is very normalised, but it's not healthy or helpful for anyone to do it, especially when your body is still growing and developing. Look after yourself ❤️",
          "created_utc": 1729851588.0
        }
      ]
    },
    {
      "id": "ltogs1p",
      "author": "Annoymous_stories",
      "body": "Yeah she’s in Uni and I’m still in highschool so I can’t speak to her guidance counsellors and we don’t even have on unfortunately. I’ve never actually met her parents, they work all the time so when we go to her house they’re just not there which obv makes me worried she could be doing other stuff alone. I’ll definitely try to talk to someone about it tho I’m not sure who",
      "created_utc": 1729862400.0,
      "score": 1,
      "context": [
        {
          "id": "ltnb9ji",
          "author": "rusticterror",
          "body": "Can you tell her parents, a school psychologist, or a trusted teacher? It definitely sounds like an eating disorder in the making, if it’s not full-fledged already. I don’t want to diminish what impact you can personally have, AND you’re both kids—EDs are serious, life ruining illnesses that need adult professional help to overcome. I’m glad you’re noticing and looking out for her. I really hope she is willing to listen.",
          "created_utc": 1729840182.0
        }
      ]
    },
    {
      "id": "mmdd1xc",
      "author": "PinetreeHugger789",
      "body": "Can I ask what the adults that got involved did to support you and how you got over this? My adult partner (31M) has been doing this regularly for over a year. \n\nI see entire containers of donuts in the trash, chewed up and spit. I can’t keep chocolate, protein bars, or even cashews in the house without him binging and spitting them. Every time I bring it up, he shuts down and says he will take care of it, but it’s been going on for about a year and there’s no sign of improvement. I’ve thought about involving a friend or family member… Where do I start with helping him?",
      "created_utc": 1744284652.0,
      "score": 1,
      "context": [
        {
          "id": "ltosla0",
          "author": "katkale",
          "body": "I was 18 in college when my boyfriend got adults involved in my ED, I’m now 30 and would consider myself in recovery not using any behaviors for at least 5-6 years now. If he hadn’t told anyone I don’t know where I would be now. \n\n\nIf your gf is only chewing and spitting now, it will progress to include more behaviors and cause more damage as time goes on. You can’t fix this for her, she needs professional guidance. My college had services available for me, her school may offer something like that? My bf sat down with me and supported me while I called them. I got a therapist, psychiatrist, nutritionist and a doctor I met with on campus. When this wasn’t working they furthered my care and connected me with other professionals. \n\n\n12 years later I don’t see or talk to this ex boyfriend often, our relationship ended related to the stress my ED caused but we were also young and not meant to be together forever, but every so often I get a call from him/ I call him and just tell remind him of the huge impact he had on my life. \n\nIt’s going to be hard but she needs help. You’ve only witnessed one incident, her beliefs and views about weight loss are clearly unhealthy and there are likely more behaviors she is finding and lying about. She may be upset with you for wanting her to get help or even suggesting something is wrong. \n\nThere are resources for people supporting those with eating disorders, maybe educating yourself a little more on what behaviors may looks like and how to communicate your concerns to her would be beneficial. \n\n\nI’m so sorry your girlfriend is going through this, you are a good partner for asking for guidance and wanting to help her.",
          "created_utc": 1729866418.0
        }
      ]
    },
    {
      "id": "ltnoqx6",
      "author": "Minimum-Leg-9618",
      "body": "its a disorder in itself?",
      "created_utc": 1729849109.0,
      "score": 2,
      "context": [
        {
          "id": "ltmpoqw",
          "author": "alienprincess111",
          "body": "This is an eating disorder called chew and spit",
          "created_utc": 1729828342.0
        }
      ]
    },
    {
      "id": "lttods5",
      "author": "Annoymous_stories",
      "body": "She said it also suppressed her appetite which I don’t believe, this that happen to you as well?",
      "created_utc": 1729933566.0,
      "score": 1,
      "context": [
        {
          "id": "lttlbtn",
          "author": "FlightAffectionate22",
          "body": "It's considered \"eating disorder behavior\", and people with anorexia and bulimia can engage in it often, as I did. As weird and sick as it sounds, I thought I had INVENTED it, when I never heard of it before. In high school, because I  was into the start of an ED, both A & B, and BC I didn't feel comfortable eating in the lunchroom, I'd sometimes eat my lunch in a bathroom stall and spitting out each bite, savoring the flavor, but not swallowing it to take in the dreaded calories.",
          "created_utc": 1729931590.0
        }
      ]
    },
    {
      "id": "ltqr4va",
      "author": "watrmeln420",
      "body": "It’s all good. You’re a wonderful partner for coming here to try and help her. I hope everything works out <3",
      "created_utc": 1729888147.0,
      "score": 6,
      "context": [
        {
          "id": "ltnq1or",
          "author": "watrmeln420",
          "body": "I remember when I started doing this at 15, I’m now 18, and it spiraled into Bulimia nervosa. \n\nIt’s not worth the slight satisfaction she’s gaining. It’s a gateway into more serious EDs.",
          "created_utc": 1729849932.0
        },
        {
          "id": "ltoh0n5",
          "author": "Annoymous_stories",
          "body": "Omg that’s horrible I’m so sorry to hear that.",
          "created_utc": 1729862485.0
        }
      ]
    },
    {
      "id": "ltr97gc",
      "author": "poilane",
      "body": "Why are you 14 on a diet and on an eating disorders subreddit? That’s already really concerning\n\nEdit: I just saw the posts you made an hour ago asking in another subreddit exactly what the OP is describing here, whether you can lose calories by spitting out food. Please go see a doctor and get off Reddit, it sounds like you’re going down the path of an ED.",
      "created_utc": 1729894213.0,
      "score": 17,
      "context": [
        {
          "id": "ltnsrpy",
          "author": "Kindly_Bodybuilder43",
          "body": "Hey there, you've had some good answers for your friend already. I just wanted to pick up that you have been dieting at 16. I'd really urge you to refocus your energies and check in with how you are doing in general. I know dieting is very normalised, but it's not healthy or helpful for anyone to do it, especially when your body is still growing and developing. Look after yourself ❤️",
          "created_utc": 1729851588.0
        },
        {
          "id": "ltqpweo",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1729887753.0
        }
      ]
    },
    {
      "id": "ltrmtv1",
      "author": "None",
      "body": "Please talk to someone around you or go to the doctors. you’re so so young and and still growing into your body. You’re on a eating disorder Reddit then in another post you say what this post had. If You’re rubbing off of others peoples habits, it’s not good for you to be on social media. Especially if you’re struggling with a potential eating disorder. 🙏🏻",
      "created_utc": 1729899233.0,
      "score": 9,
      "context": [
        {
          "id": "ltnsrpy",
          "author": "Kindly_Bodybuilder43",
          "body": "Hey there, you've had some good answers for your friend already. I just wanted to pick up that you have been dieting at 16. I'd really urge you to refocus your energies and check in with how you are doing in general. I know dieting is very normalised, but it's not healthy or helpful for anyone to do it, especially when your body is still growing and developing. Look after yourself ❤️",
          "created_utc": 1729851588.0
        },
        {
          "id": "ltqpweo",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1729887753.0
        }
      ]
    },
    {
      "id": "ltrfyp1",
      "author": "Kindly_Bodybuilder43",
      "body": "What do you mean by helpful? My disordered behaviours make me feel like they're helping me. They give me a sense of control. It's only a sense though, because the truth is the behaviours are in control and not me. They also temporally numb feelings I can't deal with by starving my brain and giving me something really compelling to focus on. But the problem is, those bad feelings don't go away, they're just pushed down and they get bigger. And the eating disorder also gives me a whole pile of new awful feelings to deal with.\n\nIt can feel like help, but it's just a sense of help disguising something really damaging. Not just physically, mentally. I feel like it helps, but it breaks me. \n\nIs there someone in your life you can trust to talk through this with?",
      "created_utc": 1729896668.0,
      "score": 5,
      "context": [
        {
          "id": "ltnsrpy",
          "author": "Kindly_Bodybuilder43",
          "body": "Hey there, you've had some good answers for your friend already. I just wanted to pick up that you have been dieting at 16. I'd really urge you to refocus your energies and check in with how you are doing in general. I know dieting is very normalised, but it's not healthy or helpful for anyone to do it, especially when your body is still growing and developing. Look after yourself ❤️",
          "created_utc": 1729851588.0
        },
        {
          "id": "ltqpweo",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1729887753.0
        }
      ]
    },
    {
      "id": "mmdgqrb",
      "author": "katkale",
      "body": "The services I got at my school helped set me up with a team, therapist, dietician, and an outpatient treatment center. They also spoke with my parents and educated them a bit on how to best talk with me about it. Getting professionals involved was the only way I made progress. It’s a hard thing to talk about with anyone, there is so much shame wrapped up in it. I think making a list of therapists in your area who specialize in male eating disorders (might be hard to find someone specifically for males but would be awesome if you could) and support him in calling. You can’t fix this for him, the professionals can’t either but they are best equipped to help. \n\n\nAs a 30 year old now, I would be so unhappy with my husband for telling another friend or family member without my knowledge. ED can be so private and about finding a sense of control. If that friend or family member cannot provide professional help, you are just breaching your partners trust. It would also be helpful for you to see a therapist for yourself if you don’t already, it can be a lot for you as well and you will need support",
      "created_utc": 1744286254.0,
      "score": 1,
      "context": [
        {
          "id": "ltosla0",
          "author": "katkale",
          "body": "I was 18 in college when my boyfriend got adults involved in my ED, I’m now 30 and would consider myself in recovery not using any behaviors for at least 5-6 years now. If he hadn’t told anyone I don’t know where I would be now. \n\n\nIf your gf is only chewing and spitting now, it will progress to include more behaviors and cause more damage as time goes on. You can’t fix this for her, she needs professional guidance. My college had services available for me, her school may offer something like that? My bf sat down with me and supported me while I called them. I got a therapist, psychiatrist, nutritionist and a doctor I met with on campus. When this wasn’t working they furthered my care and connected me with other professionals. \n\n\n12 years later I don’t see or talk to this ex boyfriend often, our relationship ended related to the stress my ED caused but we were also young and not meant to be together forever, but every so often I get a call from him/ I call him and just tell remind him of the huge impact he had on my life. \n\nIt’s going to be hard but she needs help. You’ve only witnessed one incident, her beliefs and views about weight loss are clearly unhealthy and there are likely more behaviors she is finding and lying about. She may be upset with you for wanting her to get help or even suggesting something is wrong. \n\nThere are resources for people supporting those with eating disorders, maybe educating yourself a little more on what behaviors may looks like and how to communicate your concerns to her would be beneficial. \n\n\nI’m so sorry your girlfriend is going through this, you are a good partner for asking for guidance and wanting to help her.",
          "created_utc": 1729866418.0
        },
        {
          "id": "mmdd1xc",
          "author": "PinetreeHugger789",
          "body": "Can I ask what the adults that got involved did to support you and how you got over this? My adult partner (31M) has been doing this regularly for over a year. \n\nI see entire containers of donuts in the trash, chewed up and spit. I can’t keep chocolate, protein bars, or even cashews in the house without him binging and spitting them. Every time I bring it up, he shuts down and says he will take care of it, but it’s been going on for about a year and there’s no sign of improvement. I’ve thought about involving a friend or family member… Where do I start with helping him?",
          "created_utc": 1744284652.0
        }
      ]
    },
    {
      "id": "ltodplu",
      "author": "gorerella",
      "body": "No, it’s a behaviour.",
      "created_utc": 1729861269.0,
      "score": 5,
      "context": [
        {
          "id": "ltmpoqw",
          "author": "alienprincess111",
          "body": "This is an eating disorder called chew and spit",
          "created_utc": 1729828342.0
        },
        {
          "id": "ltnoqx6",
          "author": "Minimum-Leg-9618",
          "body": "its a disorder in itself?",
          "created_utc": 1729849109.0
        }
      ]
    },
    {
      "id": "ltp5ag9",
      "author": "alienprincess111",
      "body": "I would say it is a disorder yes, especially if she is doing it to control weight",
      "created_utc": 1729870369.0,
      "score": 0,
      "context": [
        {
          "id": "ltmpoqw",
          "author": "alienprincess111",
          "body": "This is an eating disorder called chew and spit",
          "created_utc": 1729828342.0
        },
        {
          "id": "ltnoqx6",
          "author": "Minimum-Leg-9618",
          "body": "its a disorder in itself?",
          "created_utc": 1729849109.0
        }
      ]
    },
    {
      "id": "ltu66w6",
      "author": "Popular-Animator9747",
      "body": "That's correct, it suppressed your appetite and meets your food cravings without the calories.\nI've been chew spitting my food for many many years. It's an addiction and I personally believe it's an eating disorder - not just disored eating as it's officially known as.\nI would say your gf has been doing this far longer and more often than that 1 time you caught her.",
      "created_utc": 1729944002.0,
      "score": 1,
      "context": [
        {
          "id": "lttlbtn",
          "author": "FlightAffectionate22",
          "body": "It's considered \"eating disorder behavior\", and people with anorexia and bulimia can engage in it often, as I did. As weird and sick as it sounds, I thought I had INVENTED it, when I never heard of it before. In high school, because I  was into the start of an ED, both A & B, and BC I didn't feel comfortable eating in the lunchroom, I'd sometimes eat my lunch in a bathroom stall and spitting out each bite, savoring the flavor, but not swallowing it to take in the dreaded calories.",
          "created_utc": 1729931590.0
        },
        {
          "id": "lttods5",
          "author": "Annoymous_stories",
          "body": "She said it also suppressed her appetite which I don’t believe, this that happen to you as well?",
          "created_utc": 1729933566.0
        }
      ]
    },
    {
      "id": "ltrt5fn",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1729901653.0,
      "score": 2,
      "context": [
        {
          "id": "ltnsrpy",
          "author": "Kindly_Bodybuilder43",
          "body": "Hey there, you've had some good answers for your friend already. I just wanted to pick up that you have been dieting at 16. I'd really urge you to refocus your energies and check in with how you are doing in general. I know dieting is very normalised, but it's not healthy or helpful for anyone to do it, especially when your body is still growing and developing. Look after yourself ❤️",
          "created_utc": 1729851588.0
        },
        {
          "id": "ltqpweo",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1729887753.0
        },
        {
          "id": "ltrfyp1",
          "author": "Kindly_Bodybuilder43",
          "body": "What do you mean by helpful? My disordered behaviours make me feel like they're helping me. They give me a sense of control. It's only a sense though, because the truth is the behaviours are in control and not me. They also temporally numb feelings I can't deal with by starving my brain and giving me something really compelling to focus on. But the problem is, those bad feelings don't go away, they're just pushed down and they get bigger. And the eating disorder also gives me a whole pile of new awful feelings to deal with.\n\nIt can feel like help, but it's just a sense of help disguising something really damaging. Not just physically, mentally. I feel like it helps, but it breaks me. \n\nIs there someone in your life you can trust to talk through this with?",
          "created_utc": 1729896668.0
        }
      ]
    },
    {
      "id": "ltoh4xb",
      "author": "Minimum-Leg-9618",
      "body": "thats what i thought",
      "created_utc": 1729862527.0,
      "score": 2,
      "context": [
        {
          "id": "ltmpoqw",
          "author": "alienprincess111",
          "body": "This is an eating disorder called chew and spit",
          "created_utc": 1729828342.0
        },
        {
          "id": "ltnoqx6",
          "author": "Minimum-Leg-9618",
          "body": "its a disorder in itself?",
          "created_utc": 1729849109.0
        },
        {
          "id": "ltodplu",
          "author": "gorerella",
          "body": "No, it’s a behaviour.",
          "created_utc": 1729861269.0
        }
      ]
    },
    {
      "id": "ltp5g9g",
      "author": "Minimum-Leg-9618",
      "body": "i dont think chew and spit is adisorder itself tho lol sorry i think we r both confused",
      "created_utc": 1729870420.0,
      "score": 1,
      "context": [
        {
          "id": "ltmpoqw",
          "author": "alienprincess111",
          "body": "This is an eating disorder called chew and spit",
          "created_utc": 1729828342.0
        },
        {
          "id": "ltnoqx6",
          "author": "Minimum-Leg-9618",
          "body": "its a disorder in itself?",
          "created_utc": 1729849109.0
        },
        {
          "id": "ltp5ag9",
          "author": "alienprincess111",
          "body": "I would say it is a disorder yes, especially if she is doing it to control weight",
          "created_utc": 1729870369.0
        }
      ]
    },
    {
      "id": "ltp5ui3",
      "author": "alienprincess111",
      "body": "I guess you're right.  It hasn't been categorized as a disorder yet by dsm 5.",
      "created_utc": 1729870540.0,
      "score": 1,
      "context": [
        {
          "id": "ltmpoqw",
          "author": "alienprincess111",
          "body": "This is an eating disorder called chew and spit",
          "created_utc": 1729828342.0
        },
        {
          "id": "ltnoqx6",
          "author": "Minimum-Leg-9618",
          "body": "its a disorder in itself?",
          "created_utc": 1729849109.0
        },
        {
          "id": "ltp5ag9",
          "author": "alienprincess111",
          "body": "I would say it is a disorder yes, especially if she is doing it to control weight",
          "created_utc": 1729870369.0
        },
        {
          "id": "ltp5g9g",
          "author": "Minimum-Leg-9618",
          "body": "i dont think chew and spit is adisorder itself tho lol sorry i think we r both confused",
          "created_utc": 1729870420.0
        }
      ]
    },
    {
      "id": "ltp67nt",
      "author": "Minimum-Leg-9618",
      "body": "not sure what that is but i think it falls under anorexia commonly, atleast from what ive experienced and seen",
      "created_utc": 1729870653.0,
      "score": 3,
      "context": [
        {
          "id": "ltmpoqw",
          "author": "alienprincess111",
          "body": "This is an eating disorder called chew and spit",
          "created_utc": 1729828342.0
        },
        {
          "id": "ltnoqx6",
          "author": "Minimum-Leg-9618",
          "body": "its a disorder in itself?",
          "created_utc": 1729849109.0
        },
        {
          "id": "ltp5ag9",
          "author": "alienprincess111",
          "body": "I would say it is a disorder yes, especially if she is doing it to control weight",
          "created_utc": 1729870369.0
        },
        {
          "id": "ltp5g9g",
          "author": "Minimum-Leg-9618",
          "body": "i dont think chew and spit is adisorder itself tho lol sorry i think we r both confused",
          "created_utc": 1729870420.0
        },
        {
          "id": "ltp5ui3",
          "author": "alienprincess111",
          "body": "I guess you're right.  It hasn't been categorized as a disorder yet by dsm 5.",
          "created_utc": 1729870540.0
        }
      ]
    }
  ]
}