{
  "id": "1gcuyn3",
  "subreddit": "EatingDisorders",
  "author": "89404",
  "created_utc": 1729976893.0,
  "title": "I heard \"eating disorders in men are one of the most dangerous things ever\"",
  "selftext": "I'm a guy who used to have an eating disorder. I fall in the same category as a lot of other men, as my illness went unnoticed until it was almost too late. I was denied treatment twice before medical professionals took me seriously. This is the second time I hear \"eating disorders in men are one of the most dangerous things ever\" and there is definitely some truth to it imo. Female EDs are extremely severe and alarming, but how about the guys? They don't get talked about as much and I think we should change that. I survived, but there are lots of guys suffering in silence. Let's talk.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1gcuyn3/i_heard_eating_disorders_in_men_are_one_of_the/",
  "score": 42,
  "num_comments": 26,
  "comments": [
    {
      "id": "ltx7mzz",
      "author": "SnowDiamond828",
      "body": "never heard that they were especially dangerous in men, but i’m a man and have had my ED for over 3 years now",
      "created_utc": 1729982075.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ltxc31v",
      "author": "Turbulent-Ability271",
      "body": "The most dangerous thing is to lean into comparison amongst eating disorders. Each can be as severe as the other at different points in time and each can be dangerous for unique reasons. This is a competitive illness and as such, labelling one type or presentation the most dangerous is unhelpful and simply untrue. \n\nUnfortunately, none of us are unique or special for having an ED. Having a specific presentation of an eating disorder also does not make us unique. We are most unique and special when we look at all of who we are outside of the illness.",
      "created_utc": 1729983749.0,
      "score": 46,
      "context": []
    },
    {
      "id": "ltxi9lw",
      "author": "Lazy-Quantity5760",
      "body": "Here’s the stats. Usually by the time men seek treatment it’s “too late” or significantly more severe than female peers. \n\n\nMen represent up to 25% of people with eating disorders. \nEven so, women are up to five times more likely to be diagnosed and 1.5 times more likely to be treated for an eating disorder than men are. \nMen with eating disorders tend not to recognize their symptoms as problematic, in part due to the stereotype of eating disorders as being a “woman’s problem.” \nBy the time men with eating disorder symptoms present in healthcare settings, their cases tend to be more severe, in part due to their denial of symptoms, anticipated or encountered prejudice, and even denial of treatment because of their gender. \nHealthcare professionals tend to minimize the symptoms of men with eating disorders.\n\nSource: https://anad.org/eating-disorder-statistic/",
      "created_utc": 1729986079.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lty6t8n",
      "author": "Aaaaali786",
      "body": "As men, since we don’t have a cycle, the effects of an ED are also harder to catch faster. I was fairly asymptomatic at the peak of my ED but in the long-run had health issues caused by it.",
      "created_utc": 1729995623.0,
      "score": 4,
      "context": []
    },
    {
      "id": "luaq5ob",
      "author": "Fine_Possession5501",
      "body": "With full respect, I can see where you are coming from with this statement. However, there are a few misconceptions. Your thinking of how \"eating disorders in men are one of the most dangerous things ever\" is wildly devalidating to females who suffer from the same eating disorders. Maybe it's \"more commonly spoke about\" but that doesn't mean that all females feel safe enough to open up about it. There's a lot of females suffering in silence too. \n\nAnd by no means am I saying that guys don't suffer as well, and yes it may be less talked about. But it's important how you word posts like this. No hate though",
      "created_utc": 1730174246.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lu3pych",
      "author": "-abby-normal",
      "body": "I’ve never heard that before, but the reason they might’ve said that is because eating disorders in men are under-diagnosed and often caught later than female ED sufferers. Males with eating disorders may also be taken less seriously, as many people think of eating disorders as something that only affects thin white women.",
      "created_utc": 1730076325.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lu3yuah",
      "author": "None",
      "body": "problem is, we don’t get taken seriously by anyone. \nIt’s almost impossible to get help if you’re a guy with an eating disorder",
      "created_utc": 1730079572.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lv0scaw",
      "author": "redd1tpicksbadnames",
      "body": "To my knowlege this is very true. I cant tell you how many times my eating disorder took over an prevented me from having any kind of food for up to days at a time. Im nowhere near recovered and still face the daily struggles of feeling like i dont deserve to eat, like i need to earn food, or just flat out losing appetite simply because i saw or smelled food. some days the action of putting food in my mouth is nauseating and triggers my gag reflex even if its one of my favorite foods. I vape to keep the hunger at bay knowing itll make me nauseous and i constantly put myself through loops where i feel hungry until the hunger turns to nausea and then eventually the nausea goes away if i just dont eat, then i feel hungry later again but i know if i ignore it long enough the hunger simply disappears. Ive been losing weight i seriously cant afford to lose,losing a lot of muscle mass ive worked hard to build over the course of my life, my metabolism is very fast and ive lost so much muscle mass. My endurance for daily physical activities has dwindled down to almost nothing and i cant even have sex without getting tired anymore. I used to be active enough to run a mile in under 5 minutes, i used to eat all the time and theres so many other factors as to why ive gotten to where i am today but having an eating disorder after growing up eating everything in sight and being active all the time has been by far the most detrimental thing for my physical and mental health out of all the other shit thats happened in my life. If this keeps up im gonna eventually be unable to take care of myself and care may come to me involuntarily, or at some point i may just give in and fade away to nothing just the same as my appetite does; slowly and without anyone noticing. The unfortunate reality is that people just arent ready to talk about mens mental health. Nobody cares how you are as long as you can get your job done, provide for others, or overall be useful in some way. Men who struggle in western society are always kicked while theyre down and nobody cares. Men need to learn to move on without the support or approval of anyone else in order to survive and thats why we men bottle everything up. Its backwards for a man, someone known for providing and caring and protecting, would need any form of care for themselves because men should always already be in a place to do their best for others regardless of what stage of life you're in.",
      "created_utc": 1730557757.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1oclmo",
      "author": "FlightAffectionate22",
      "body": "Males are diagnosed later, and seem to be more resistant to recovery.  In the late 80s, my parents took me to our family physician and he literally laughed-out-loud over my parents' assertion I had an eating disorder. \n\nWhen no one, even doctors, teachers, coaches, parents, etc have the understanding males can have eating disorders too, it's allowed to continue and become more ingrained. \n\nIt's still framed as a \"girl's problem\", and there's sexism, effeminacy-perceptions, homophobic-anti-gay-allegations that men fear will come of admitting and seeking treatment for it. \n\nIt's growing faster for boys than girls, and finally some celebs like Zayn Malik, Ed Sheeran, Jordan Fisher, Dennis Quaid, Ashley Hamilton, Russel Brand, Elton John, etc. \n\nAs a teen boy, it's not uncommon to see thinness, when pubuerry has the effect of sharply increasing their metabolism, they are often phyically active, but even their increased hunger doesn't catch-up with their physical changes. And boys who get it tend to be heavier than normal, when there's not a cultural expectation for boys to be unrealistically thin as what still exists for women. \n\nAs a common issue for anorexic girls, they lose or lessen their periods, what alerts parents and doctors of their illness, what boys then don't. obviously. Male clothes hide both weight loss and gain better, when male clothing is rarely ever tight or body-conscious. \n\nA boy or man who is working out is given a sort of space culturally to work hard to change their bodies, and many males with EDs are in sports or weightlifting. \n\nI can't tell you how many times I openly binged at meal times in the dorms or high school, and no one said anything but almost slappinig me on the back for eating like a starving dog.  And no one ever connected my thinness to purging when that wasn't within their cultural understanding.  It was just how I lived for decades, part of my daily life, and no one outside my family even noticed it. \n\nI had been obese since 10, and at 14, was in full-blown anorexia and bulimia. I won't share numbers, but I think I can share I lost half my body weight. I would go on to struggle with it until my 40s.",
      "created_utc": 1734001917.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1ocom7",
      "author": "FlightAffectionate22",
      "body": "There's a Reddit group for males with eating disorders, btw.",
      "created_utc": 1734001969.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lu1zgja",
      "author": "Witty-Afternoon1262",
      "body": "as a woman with ana, i completely agree with you. people are unfortunately more likely to give us treatment and care because most sufferers are women, and when people see a very ill guy with ana (or any ED for that matter), they just dismiss it - “oh he’s just super skinny, what a quick metabolism !” i’m really sorry you went through that, it’s really dangerous to be overlooked like that. i see you guys, and you deserve care. we all do :/",
      "created_utc": 1730056256.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ltyn6p6",
      "author": "redditgal2001",
      "body": "My friend Raphael has anorexia.",
      "created_utc": 1730002801.0,
      "score": -1,
      "context": []
    },
    {
      "id": "ltx850p",
      "author": "89404",
      "body": "I'm sorry to hear that. I don't have the right mindset to talk about this, but what is preventing you from starting recovery? I started my recovery journey the day I got my diagnosis.",
      "created_utc": 1729982262.0,
      "score": 1,
      "context": [
        {
          "id": "ltx7mzz",
          "author": "SnowDiamond828",
          "body": "never heard that they were especially dangerous in men, but i’m a man and have had my ED for over 3 years now",
          "created_utc": 1729982075.0
        }
      ]
    },
    {
      "id": "luaow94",
      "author": "No-Draw7378",
      "body": "🏆🏆🏆",
      "created_utc": 1730173696.0,
      "score": 3,
      "context": [
        {
          "id": "ltxc31v",
          "author": "Turbulent-Ability271",
          "body": "The most dangerous thing is to lean into comparison amongst eating disorders. Each can be as severe as the other at different points in time and each can be dangerous for unique reasons. This is a competitive illness and as such, labelling one type or presentation the most dangerous is unhelpful and simply untrue. \n\nUnfortunately, none of us are unique or special for having an ED. Having a specific presentation of an eating disorder also does not make us unique. We are most unique and special when we look at all of who we are outside of the illness.",
          "created_utc": 1729983749.0
        }
      ]
    },
    {
      "id": "ltxoq5t",
      "author": "Equal-Art6604",
      "body": "Thank you for sharing this information. It is critically important that there is more awareness about EDs in men. \n\nI’ve had male friends demonstrate ED behaviors, and very few people blink an eye. In contrast, people would likely be VERY concerned if a female demonstrated the same behaviors.",
      "created_utc": 1729988545.0,
      "score": 7,
      "context": [
        {
          "id": "ltxi9lw",
          "author": "Lazy-Quantity5760",
          "body": "Here’s the stats. Usually by the time men seek treatment it’s “too late” or significantly more severe than female peers. \n\n\nMen represent up to 25% of people with eating disorders. \nEven so, women are up to five times more likely to be diagnosed and 1.5 times more likely to be treated for an eating disorder than men are. \nMen with eating disorders tend not to recognize their symptoms as problematic, in part due to the stereotype of eating disorders as being a “woman’s problem.” \nBy the time men with eating disorder symptoms present in healthcare settings, their cases tend to be more severe, in part due to their denial of symptoms, anticipated or encountered prejudice, and even denial of treatment because of their gender. \nHealthcare professionals tend to minimize the symptoms of men with eating disorders.\n\nSource: https://anad.org/eating-disorder-statistic/",
          "created_utc": 1729986079.0
        }
      ]
    },
    {
      "id": "ltxsxo7",
      "author": "89404",
      "body": "Yeah if I was a woman I would've been treated immediately. But as a male I had to almost die before anything was done.",
      "created_utc": 1729990158.0,
      "score": -1,
      "context": [
        {
          "id": "ltxi9lw",
          "author": "Lazy-Quantity5760",
          "body": "Here’s the stats. Usually by the time men seek treatment it’s “too late” or significantly more severe than female peers. \n\n\nMen represent up to 25% of people with eating disorders. \nEven so, women are up to five times more likely to be diagnosed and 1.5 times more likely to be treated for an eating disorder than men are. \nMen with eating disorders tend not to recognize their symptoms as problematic, in part due to the stereotype of eating disorders as being a “woman’s problem.” \nBy the time men with eating disorder symptoms present in healthcare settings, their cases tend to be more severe, in part due to their denial of symptoms, anticipated or encountered prejudice, and even denial of treatment because of their gender. \nHealthcare professionals tend to minimize the symptoms of men with eating disorders.\n\nSource: https://anad.org/eating-disorder-statistic/",
          "created_utc": 1729986079.0
        }
      ]
    },
    {
      "id": "m0d1phd",
      "author": "None",
      "body": "I respectfully disagree. Saying, \"Eating disorders in men are one of the most dangerous things ever\" does not diminish the seriousness of eating disorders in women. Both genders face significant challenges, but the experience for men often comes with unique barriers.      \n      \n\n\nWhat makes eating disorders particularly dangerous for men is the lack of attention and concern they receive from healthcare providers. Many men find their struggles dismissed or not taken seriously, delaying proper diagnosis and treatment. As a result, men often present with more severe symptoms when they finally seek help, which can lead to worse outcomes and potentially higher mortality rates. This is especially concerning given the stigma that discourages men from recognizing their symptoms or speaking up in the first place.      \n      \n\nAdditionally, men who identify as LGBTQ+ are 10 times more likely to develop an eating disorder than heterosexual men, highlighting the disproportionate impact on queer men. In fact, the majority of men diagnosed with eating disorders are part of the LGBTQ+ community. These factors underscore the critical need to address eating disorders in men with the same urgency and inclusivity as for women.",
      "created_utc": 1733317500.0,
      "score": 3,
      "context": [
        {
          "id": "luaq5ob",
          "author": "Fine_Possession5501",
          "body": "With full respect, I can see where you are coming from with this statement. However, there are a few misconceptions. Your thinking of how \"eating disorders in men are one of the most dangerous things ever\" is wildly devalidating to females who suffer from the same eating disorders. Maybe it's \"more commonly spoke about\" but that doesn't mean that all females feel safe enough to open up about it. There's a lot of females suffering in silence too. \n\nAnd by no means am I saying that guys don't suffer as well, and yes it may be less talked about. But it's important how you word posts like this. No hate though",
          "created_utc": 1730174246.0
        }
      ]
    },
    {
      "id": "lu4th8r",
      "author": "89404",
      "body": "Yup, and it sucks. Thankfully I finally got help for mine, nearly 4 years after it began though. I was in rough shape. Not quite dying but surely not far from it either. The first time I went to the emergency room, they basically told me I wasn't underweight enough and there was no concern (bullshit) then I went there again roughly a week later and they said \"I'm sure you'll be fine\". I went AGAIN a week later when my weight had dropped even more and I could barely eat one bite from my lunch without gagging. At that point they were like \"oh shit\" (they didn't say that but I'm sure they felt that way) and that is when my treatment began. Nobody has ever admitted a mistake was made.",
      "created_utc": 1730093437.0,
      "score": 1,
      "context": [
        {
          "id": "lu3yuah",
          "author": "None",
          "body": "problem is, we don’t get taken seriously by anyone. \nIt’s almost impossible to get help if you’re a guy with an eating disorder",
          "created_utc": 1730079572.0
        }
      ]
    },
    {
      "id": "lv0tirk",
      "author": "89404",
      "body": "Wow, idk what to say. You seem very intellectual. I hope you get over your illness, you deserve to be happy. I made the decision of \"this can't go on\" and that is why and how I started getting better. I'm almost there.",
      "created_utc": 1730558156.0,
      "score": 2,
      "context": [
        {
          "id": "lv0scaw",
          "author": "redd1tpicksbadnames",
          "body": "To my knowlege this is very true. I cant tell you how many times my eating disorder took over an prevented me from having any kind of food for up to days at a time. Im nowhere near recovered and still face the daily struggles of feeling like i dont deserve to eat, like i need to earn food, or just flat out losing appetite simply because i saw or smelled food. some days the action of putting food in my mouth is nauseating and triggers my gag reflex even if its one of my favorite foods. I vape to keep the hunger at bay knowing itll make me nauseous and i constantly put myself through loops where i feel hungry until the hunger turns to nausea and then eventually the nausea goes away if i just dont eat, then i feel hungry later again but i know if i ignore it long enough the hunger simply disappears. Ive been losing weight i seriously cant afford to lose,losing a lot of muscle mass ive worked hard to build over the course of my life, my metabolism is very fast and ive lost so much muscle mass. My endurance for daily physical activities has dwindled down to almost nothing and i cant even have sex without getting tired anymore. I used to be active enough to run a mile in under 5 minutes, i used to eat all the time and theres so many other factors as to why ive gotten to where i am today but having an eating disorder after growing up eating everything in sight and being active all the time has been by far the most detrimental thing for my physical and mental health out of all the other shit thats happened in my life. If this keeps up im gonna eventually be unable to take care of myself and care may come to me involuntarily, or at some point i may just give in and fade away to nothing just the same as my appetite does; slowly and without anyone noticing. The unfortunate reality is that people just arent ready to talk about mens mental health. Nobody cares how you are as long as you can get your job done, provide for others, or overall be useful in some way. Men who struggle in western society are always kicked while theyre down and nobody cares. Men need to learn to move on without the support or approval of anyone else in order to survive and thats why we men bottle everything up. Its backwards for a man, someone known for providing and caring and protecting, would need any form of care for themselves because men should always already be in a place to do their best for others regardless of what stage of life you're in.",
          "created_utc": 1730557757.0
        }
      ]
    },
    {
      "id": "m1oo9mz",
      "author": "89404",
      "body": "I'm sorry you had to go through that. It does sometimes feel weird being a straight white dude who almost starved himself to death.",
      "created_utc": 1734008063.0,
      "score": 2,
      "context": [
        {
          "id": "m1oclmo",
          "author": "FlightAffectionate22",
          "body": "Males are diagnosed later, and seem to be more resistant to recovery.  In the late 80s, my parents took me to our family physician and he literally laughed-out-loud over my parents' assertion I had an eating disorder. \n\nWhen no one, even doctors, teachers, coaches, parents, etc have the understanding males can have eating disorders too, it's allowed to continue and become more ingrained. \n\nIt's still framed as a \"girl's problem\", and there's sexism, effeminacy-perceptions, homophobic-anti-gay-allegations that men fear will come of admitting and seeking treatment for it. \n\nIt's growing faster for boys than girls, and finally some celebs like Zayn Malik, Ed Sheeran, Jordan Fisher, Dennis Quaid, Ashley Hamilton, Russel Brand, Elton John, etc. \n\nAs a teen boy, it's not uncommon to see thinness, when pubuerry has the effect of sharply increasing their metabolism, they are often phyically active, but even their increased hunger doesn't catch-up with their physical changes. And boys who get it tend to be heavier than normal, when there's not a cultural expectation for boys to be unrealistically thin as what still exists for women. \n\nAs a common issue for anorexic girls, they lose or lessen their periods, what alerts parents and doctors of their illness, what boys then don't. obviously. Male clothes hide both weight loss and gain better, when male clothing is rarely ever tight or body-conscious. \n\nA boy or man who is working out is given a sort of space culturally to work hard to change their bodies, and many males with EDs are in sports or weightlifting. \n\nI can't tell you how many times I openly binged at meal times in the dorms or high school, and no one said anything but almost slappinig me on the back for eating like a starving dog.  And no one ever connected my thinness to purging when that wasn't within their cultural understanding.  It was just how I lived for decades, part of my daily life, and no one outside my family even noticed it. \n\nI had been obese since 10, and at 14, was in full-blown anorexia and bulimia. I won't share numbers, but I think I can share I lost half my body weight. I would go on to struggle with it until my 40s.",
          "created_utc": 1734001917.0
        }
      ]
    },
    {
      "id": "ltxaz4u",
      "author": "SnowDiamond828",
      "body": "well it’s really hard for me for a lot of reasons, but i have made steps and i guess recovered in certain ways from bulimia. but honestly i don’t want to bc i’m just afraid of gaining weight (ridiculous i know) and have a lot of body insecurity",
      "created_utc": 1729983328.0,
      "score": 4,
      "context": [
        {
          "id": "ltx7mzz",
          "author": "SnowDiamond828",
          "body": "never heard that they were especially dangerous in men, but i’m a man and have had my ED for over 3 years now",
          "created_utc": 1729982075.0
        },
        {
          "id": "ltx850p",
          "author": "89404",
          "body": "I'm sorry to hear that. I don't have the right mindset to talk about this, but what is preventing you from starting recovery? I started my recovery journey the day I got my diagnosis.",
          "created_utc": 1729982262.0
        }
      ]
    },
    {
      "id": "ltxtzcq",
      "author": "Lazy-Quantity5760",
      "body": "I’m so sorry",
      "created_utc": 1729990566.0,
      "score": 1,
      "context": [
        {
          "id": "ltxi9lw",
          "author": "Lazy-Quantity5760",
          "body": "Here’s the stats. Usually by the time men seek treatment it’s “too late” or significantly more severe than female peers. \n\n\nMen represent up to 25% of people with eating disorders. \nEven so, women are up to five times more likely to be diagnosed and 1.5 times more likely to be treated for an eating disorder than men are. \nMen with eating disorders tend not to recognize their symptoms as problematic, in part due to the stereotype of eating disorders as being a “woman’s problem.” \nBy the time men with eating disorder symptoms present in healthcare settings, their cases tend to be more severe, in part due to their denial of symptoms, anticipated or encountered prejudice, and even denial of treatment because of their gender. \nHealthcare professionals tend to minimize the symptoms of men with eating disorders.\n\nSource: https://anad.org/eating-disorder-statistic/",
          "created_utc": 1729986079.0
        },
        {
          "id": "ltxsxo7",
          "author": "89404",
          "body": "Yeah if I was a woman I would've been treated immediately. But as a male I had to almost die before anything was done.",
          "created_utc": 1729990158.0
        }
      ]
    },
    {
      "id": "lv2758h",
      "author": "redd1tpicksbadnames",
      "body": "You got this OP!!! Hold onto that \"this cant go on\" mindset and ride the wave til the chaos is over im so proud of you for making rhe progress youve made. Dont forget things can fluxuate or change at times too, i know when i try to recover i typically lose my progress and feel stuck, but its not a linear path out of mental illness, its trial and error too see what works best tailored to you. Youve come so far, maybe havent made it yet but isnt it something wonderful to see the end goal of recovery in sight? Stick to your goals op, you got this!",
      "created_utc": 1730574170.0,
      "score": 1,
      "context": [
        {
          "id": "lv0scaw",
          "author": "redd1tpicksbadnames",
          "body": "To my knowlege this is very true. I cant tell you how many times my eating disorder took over an prevented me from having any kind of food for up to days at a time. Im nowhere near recovered and still face the daily struggles of feeling like i dont deserve to eat, like i need to earn food, or just flat out losing appetite simply because i saw or smelled food. some days the action of putting food in my mouth is nauseating and triggers my gag reflex even if its one of my favorite foods. I vape to keep the hunger at bay knowing itll make me nauseous and i constantly put myself through loops where i feel hungry until the hunger turns to nausea and then eventually the nausea goes away if i just dont eat, then i feel hungry later again but i know if i ignore it long enough the hunger simply disappears. Ive been losing weight i seriously cant afford to lose,losing a lot of muscle mass ive worked hard to build over the course of my life, my metabolism is very fast and ive lost so much muscle mass. My endurance for daily physical activities has dwindled down to almost nothing and i cant even have sex without getting tired anymore. I used to be active enough to run a mile in under 5 minutes, i used to eat all the time and theres so many other factors as to why ive gotten to where i am today but having an eating disorder after growing up eating everything in sight and being active all the time has been by far the most detrimental thing for my physical and mental health out of all the other shit thats happened in my life. If this keeps up im gonna eventually be unable to take care of myself and care may come to me involuntarily, or at some point i may just give in and fade away to nothing just the same as my appetite does; slowly and without anyone noticing. The unfortunate reality is that people just arent ready to talk about mens mental health. Nobody cares how you are as long as you can get your job done, provide for others, or overall be useful in some way. Men who struggle in western society are always kicked while theyre down and nobody cares. Men need to learn to move on without the support or approval of anyone else in order to survive and thats why we men bottle everything up. Its backwards for a man, someone known for providing and caring and protecting, would need any form of care for themselves because men should always already be in a place to do their best for others regardless of what stage of life you're in.",
          "created_utc": 1730557757.0
        },
        {
          "id": "lv0tirk",
          "author": "89404",
          "body": "Wow, idk what to say. You seem very intellectual. I hope you get over your illness, you deserve to be happy. I made the decision of \"this can't go on\" and that is why and how I started getting better. I'm almost there.",
          "created_utc": 1730558156.0
        }
      ]
    },
    {
      "id": "m1oph7f",
      "author": "FlightAffectionate22",
      "body": "Thank you for that.  Stay well.",
      "created_utc": 1734008600.0,
      "score": 1,
      "context": [
        {
          "id": "m1oclmo",
          "author": "FlightAffectionate22",
          "body": "Males are diagnosed later, and seem to be more resistant to recovery.  In the late 80s, my parents took me to our family physician and he literally laughed-out-loud over my parents' assertion I had an eating disorder. \n\nWhen no one, even doctors, teachers, coaches, parents, etc have the understanding males can have eating disorders too, it's allowed to continue and become more ingrained. \n\nIt's still framed as a \"girl's problem\", and there's sexism, effeminacy-perceptions, homophobic-anti-gay-allegations that men fear will come of admitting and seeking treatment for it. \n\nIt's growing faster for boys than girls, and finally some celebs like Zayn Malik, Ed Sheeran, Jordan Fisher, Dennis Quaid, Ashley Hamilton, Russel Brand, Elton John, etc. \n\nAs a teen boy, it's not uncommon to see thinness, when pubuerry has the effect of sharply increasing their metabolism, they are often phyically active, but even their increased hunger doesn't catch-up with their physical changes. And boys who get it tend to be heavier than normal, when there's not a cultural expectation for boys to be unrealistically thin as what still exists for women. \n\nAs a common issue for anorexic girls, they lose or lessen their periods, what alerts parents and doctors of their illness, what boys then don't. obviously. Male clothes hide both weight loss and gain better, when male clothing is rarely ever tight or body-conscious. \n\nA boy or man who is working out is given a sort of space culturally to work hard to change their bodies, and many males with EDs are in sports or weightlifting. \n\nI can't tell you how many times I openly binged at meal times in the dorms or high school, and no one said anything but almost slappinig me on the back for eating like a starving dog.  And no one ever connected my thinness to purging when that wasn't within their cultural understanding.  It was just how I lived for decades, part of my daily life, and no one outside my family even noticed it. \n\nI had been obese since 10, and at 14, was in full-blown anorexia and bulimia. I won't share numbers, but I think I can share I lost half my body weight. I would go on to struggle with it until my 40s.",
          "created_utc": 1734001917.0
        },
        {
          "id": "m1oo9mz",
          "author": "89404",
          "body": "I'm sorry you had to go through that. It does sometimes feel weird being a straight white dude who almost starved himself to death.",
          "created_utc": 1734008063.0
        }
      ]
    },
    {
      "id": "ltxbj5t",
      "author": "89404",
      "body": "Ah, I see. My quality of life improved significantly after I gained weight. You deserve to be happy too.",
      "created_utc": 1729983538.0,
      "score": 1,
      "context": [
        {
          "id": "ltx7mzz",
          "author": "SnowDiamond828",
          "body": "never heard that they were especially dangerous in men, but i’m a man and have had my ED for over 3 years now",
          "created_utc": 1729982075.0
        },
        {
          "id": "ltx850p",
          "author": "89404",
          "body": "I'm sorry to hear that. I don't have the right mindset to talk about this, but what is preventing you from starting recovery? I started my recovery journey the day I got my diagnosis.",
          "created_utc": 1729982262.0
        },
        {
          "id": "ltxaz4u",
          "author": "SnowDiamond828",
          "body": "well it’s really hard for me for a lot of reasons, but i have made steps and i guess recovered in certain ways from bulimia. but honestly i don’t want to bc i’m just afraid of gaining weight (ridiculous i know) and have a lot of body insecurity",
          "created_utc": 1729983328.0
        }
      ]
    },
    {
      "id": "ltxc57o",
      "author": "SnowDiamond828",
      "body": "well i wouldn’t say i’m unhappy, it’s just like something that’s always on my mind. i got the ED to a place where i can have a good relationship with my boyfriend and socialise normally with friends, it’s just nowhere close to being completely gone 🤷🏼‍♂️",
      "created_utc": 1729983773.0,
      "score": 2,
      "context": [
        {
          "id": "ltx7mzz",
          "author": "SnowDiamond828",
          "body": "never heard that they were especially dangerous in men, but i’m a man and have had my ED for over 3 years now",
          "created_utc": 1729982075.0
        },
        {
          "id": "ltx850p",
          "author": "89404",
          "body": "I'm sorry to hear that. I don't have the right mindset to talk about this, but what is preventing you from starting recovery? I started my recovery journey the day I got my diagnosis.",
          "created_utc": 1729982262.0
        },
        {
          "id": "ltxaz4u",
          "author": "SnowDiamond828",
          "body": "well it’s really hard for me for a lot of reasons, but i have made steps and i guess recovered in certain ways from bulimia. but honestly i don’t want to bc i’m just afraid of gaining weight (ridiculous i know) and have a lot of body insecurity",
          "created_utc": 1729983328.0
        },
        {
          "id": "ltxbj5t",
          "author": "89404",
          "body": "Ah, I see. My quality of life improved significantly after I gained weight. You deserve to be happy too.",
          "created_utc": 1729983538.0
        }
      ]
    }
  ]
}