{
  "id": "1gr7izk",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1731598667.0,
  "title": "I feel \"dirty\" without anorexia",
  "selftext": "Hi everyone. I went through a period of anorexia, but afterward, I developed binge eating and bulimia and ended up gaining weight. Now, I feel out of control, sort of 'messy' and 'dirty,' like something is always wrong. When I had anorexia, I would restrict my food and exercise compulsively, and it made me feel 'clean,' focused, in control. I’m trying to recover from the BED, but this feeling keeps pulling me back toward anorexia, like it's the only way to feel good about myself again. Has anyone else felt this way after a shift in their eating disorder? How did you deal with not feeling 'good enough' or 'focused' without anorexia?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1gr7izk/i_feel_dirty_without_anorexia/",
  "score": 118,
  "num_comments": 13,
  "comments": [
    {
      "id": "lx9i94q",
      "author": "Objective-Area-7980",
      "body": "I understand completely. I feel gross with a full bloated belly after a good meal. It feels like i am taking 3 steps back. You are not alone. We got this!! 🤍",
      "created_utc": 1731678919.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lx7lgm7",
      "author": "None",
      "body": "I completely resonate with this - I often attribute that feeling of cleanliness to my OCD & I’m not sure if that’s something you are diagnosed with but I hear anorexia & OCD overlap a lot. A lot of my food restriction is purely control & the need to feel ‘clean’ & ‘ready’ all the time - can’t explain it even. Sending hugs & am always here to chat🩵",
      "created_utc": 1731644552.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lxbarso",
      "author": "xyzleoscorpio",
      "body": "So so so relatable, you are not alone!!! Whenever I am at my skinniest and least full, I feel the cleanest. I completely get it, the feeling of disgust, feeling filthy and full after binging/eating a large meal. If I am starving, I am clean, pure, and my whole mindest just changes its bizzare. \n\nWhat mostly causes this for me is binging, if I choose to eat healthy food I won’t feel dirty afterwards, even if its a larger meal I don’t mind if it was truly consistent and healthy. But bouncing from anorexia to binging is something im currently dealing with so\nnot sure how to help with this feeling of ‘dirty’ :( \n\nAtm I exercise more or less compulsively and restrict and then binge. And to be honest, at this point I feel like the most doable solution would be to just find a balance between restricting and binging, part it in weeks/days and so on.",
      "created_utc": 1731698611.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lxb7kqo",
      "author": "Natural-Boot-1460",
      "body": "I know of so many people who have gone through this, myself included. It does get better, though, I promise, You're not alone.",
      "created_utc": 1731697652.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lxu25d7",
      "author": "None",
      "body": "I really relate to this. For me it’s a combination of the shame that comes with weight gain or my binging as I hate myself for lacking control and my OCDP (obsessive compulsive personality disorder) \nI find myself romanticising my anorexia because I felt so in control and “clean” but then I remember how I was losing hair and in constant pain \nIt’s a lose lose battle for me",
      "created_utc": 1731970299.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxw25kr",
      "author": "tinntinn5",
      "body": "Omg this is the perfect description of how i feel.",
      "created_utc": 1731998427.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ly4m0q3",
      "author": "intrepidcaribou",
      "body": "I think at a fundamental level, it's connected to come combination of shame, sexuality and control.\n\nI feel that a lot of women in particular start having eating problems when they start puberty. I was always told I would be loved if I didn't need or want things, if I wasn't sexual and I was in control of myself. So, lo and behold puberty happened, my mother freaked out an put me on a starvation diet. I realized my mom praised me so long as I kept losing weight - until I became dangerously underweight.\n\nBeing skinny and unwomanly meant men couldn't objectify me, my body could survive with very little, and I alternately earned praise from my mother for losing weight or alternately could control her with threats of starving myself to death.\n\nBut it's actually a trap. It makes your normal, human body into a prison. Because in an effort to stay \"small\", you lose out on strength, contentment and pleasure in your own body.",
      "created_utc": 1732123157.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0636ot",
      "author": "Dorian-greys-picture",
      "body": "I feel ‘clean’ or ‘pure’ when I haven’t eaten and my stomach is empty. Hunger often feels reassuring in some way. Certain foods feel clean and others feel dirty, too. So deep fried foods feel dirty and uncooked fresh vegetables feel clean. Food with ginger in it feels clean, food with tomato often feels dirty. I can’t even really explain why.",
      "created_utc": 1733211012.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxfxxbd",
      "author": "Dietlord",
      "body": "i even have to take a shower after eating, because after i eat i feel so dirty inside and outside",
      "created_utc": 1731770462.0,
      "score": 3,
      "context": [
        {
          "id": "lx9i94q",
          "author": "Objective-Area-7980",
          "body": "I understand completely. I feel gross with a full bloated belly after a good meal. It feels like i am taking 3 steps back. You are not alone. We got this!! 🤍",
          "created_utc": 1731678919.0
        }
      ]
    },
    {
      "id": "lxb8szc",
      "author": "None",
      "body": "I totally get that. It’s so hard, but you’re right, we’ll get through this together 🤍",
      "created_utc": 1731698019.0,
      "score": 2,
      "context": [
        {
          "id": "lx9i94q",
          "author": "Objective-Area-7980",
          "body": "I understand completely. I feel gross with a full bloated belly after a good meal. It feels like i am taking 3 steps back. You are not alone. We got this!! 🤍",
          "created_utc": 1731678919.0
        }
      ]
    },
    {
      "id": "lxb8a0w",
      "author": "None",
      "body": "Thank you so much for sharing this. I don't have an OCD diagnosis, but I can definitely relate to the need for control and that feeling of being 'clean' or 'ready.' It’s comforting to know I’m not alone in this. Sending hugs back your way, and I’m here to chat anytime too 🩵",
      "created_utc": 1731697863.0,
      "score": 3,
      "context": [
        {
          "id": "lx7lgm7",
          "author": "None",
          "body": "I completely resonate with this - I often attribute that feeling of cleanliness to my OCD & I’m not sure if that’s something you are diagnosed with but I hear anorexia & OCD overlap a lot. A lot of my food restriction is purely control & the need to feel ‘clean’ & ‘ready’ all the time - can’t explain it even. Sending hugs & am always here to chat🩵",
          "created_utc": 1731644552.0
        }
      ]
    },
    {
      "id": "lxbcsku",
      "author": "None",
      "body": "I completely relate to this. I’ve been stuck in the same cycle of anorexia and binging for so long, but lately, the BED has taken over. It’s wild how the mindset changes—when I’m restricting and exercising, I feel so ‘clean’ and focused. Even people around me notice and comment on how dedicated I seem, which only fuels it.\n\nBut when binging takes over, I feel like a complete failure. It got to the point where I wasn’t even purging because of my weight anymore but because the bloated, ‘dirty’ feeling was unbearable. Finding balance feels impossible sometimes, but it’s comforting to know I’m not alone in this.",
      "created_utc": 1731699226.0,
      "score": 3,
      "context": [
        {
          "id": "lxbarso",
          "author": "xyzleoscorpio",
          "body": "So so so relatable, you are not alone!!! Whenever I am at my skinniest and least full, I feel the cleanest. I completely get it, the feeling of disgust, feeling filthy and full after binging/eating a large meal. If I am starving, I am clean, pure, and my whole mindest just changes its bizzare. \n\nWhat mostly causes this for me is binging, if I choose to eat healthy food I won’t feel dirty afterwards, even if its a larger meal I don’t mind if it was truly consistent and healthy. But bouncing from anorexia to binging is something im currently dealing with so\nnot sure how to help with this feeling of ‘dirty’ :( \n\nAtm I exercise more or less compulsively and restrict and then binge. And to be honest, at this point I feel like the most doable solution would be to just find a balance between restricting and binging, part it in weeks/days and so on.",
          "created_utc": 1731698611.0
        }
      ]
    }
  ]
}