{
  "id": "1gsvabt",
  "subreddit": "EatingDisorders",
  "author": "Fair_Amphibian_9687",
  "created_utc": 1731786321.0,
  "title": "Anyone else struggling with being triggered by celebs like Ariana right now? ",
  "selftext": "I really hope none of this is triggering! After suffering from anorexia for 15 years I was able to “recover” during lockdown. I know so many people struggled during that time but for me it was the first time I was able to focus on myself. I think being forced to not have much to do with my family helped me out a lot. \n\nEven when my ed was at its worst, I was never one to really get triggered by others. But I think now I’m a healthy weight and it seems so many celebs are very thin all of a sudden, it’s really triggering me. I’m trying my best not to restrict and over exercise but I’ve noticed I’ve been focusing more on cardio than weight training again to lose a little weight. It’s like there is this huge argument in my head constantly at the moment, one part of me is screaming to just slim down a little and the other is telling me that this is just the beginning of a relapse. I can’t seem to escape all these images of celebs, especially Ariana at the moment and I think it’s what has triggered this thinking. Or is this just a normal part of recovering from an ed? Anyone else feeling extremely triggered too? \n\nI feel so stupid for thinking I was over my eating disorder. I don’t know what to do because I don’t want to let anyone know I’m struggling because they’ll all be so disappointed in me. All anyone does is say how proud they are of me for coming so far and how amazing it is they never have to worry about me anymore. I don’t want to let anyone down but I’m really struggling with these thoughts. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1gsvabt/anyone_else_struggling_with_being_triggered_by/",
  "score": 250,
  "num_comments": 52,
  "comments": [
    {
      "id": "lxo9dbk",
      "author": "runninginbubbles",
      "body": "It's hard when you've weight restored and every time you try remind yourself \"I needed to do this in order to participate in life again\" you see someone super thin who appears to be participating in life just fine. So why did I need to gain all this weight? Or \"why was I made to gain weight if she's allowed to live like that\"\nI found myself getting way more triggered by people at a healthy weight than when I'm underweight.\n It's so bloody hard. I'm sorry. Ariana looks terrible. Please take care x",
      "created_utc": 1731887220.0,
      "score": 69,
      "context": []
    },
    {
      "id": "lxnrsqp",
      "author": "Grand_Pomegranate671",
      "body": "Judging by what I see online, even people who don't struggle with an ED are triggered by Ariana, so don't be too harsh on yourself. The fact that you recognise your negative thoughts and admit them out loud is a very good sign.",
      "created_utc": 1731881174.0,
      "score": 43,
      "context": []
    },
    {
      "id": "lxmi882",
      "author": "Excellent-World-476",
      "body": "Recovery does not mean not being triggered. It means responding by using healthy coping skills.",
      "created_utc": 1731866553.0,
      "score": 67,
      "context": []
    },
    {
      "id": "lxonb5s",
      "author": "None",
      "body": "Thank you for saying something because its really been bothering me. Im a singer and I also have Ana. \n\nin LA they encourage you, and praise you for your ED. when i told people i was getting help they didnt understand why, i hadn't been able to eat for months from anxiety. im also a perfectionist and the pressure to be young and hot and thin is very much real in this industry. as someone who has admired ariana for years im so triggered by the promo for wicked and how she looks lately, it makes me wanna cry. everyone on social media brushes it off like she's naturally skinny and she's literally dying right before our eyes. she reminds me of my friends in treatment, just so lost in it. I've been relapsing from my own shit in my own life, and I just wish she would address it so people finally talked about mental health. \n\nI pray to God everyday for everyone with this disorder.",
      "created_utc": 1731892107.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lxmsii2",
      "author": "Guppy_fromtheWest",
      "body": "I feel you. Fully relapsed in Summer and I‘m triggered by all these Wicked campaigns. I wanna be skinny like her so bad",
      "created_utc": 1731869804.0,
      "score": 16,
      "context": []
    },
    {
      "id": "lxnjfw0",
      "author": "None",
      "body": "Totally relate to you! You're not stupid. I have gained a healthy weight for years and suddenly the media is full of very skinny celebrities again and especially the conversations about ozempic is triggering. Honestly my ED has never been about wanting to look like other skinny people or celebs, it never was a thing for me to notice but seeing those images does something to my brain now. I am trying to fight the urges and look away. I even stopped using social media for now.",
      "created_utc": 1731878427.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lxr4u33",
      "author": "deebaybayy",
      "body": "Absolutely 🤍\n\nIt’s been really hard with skinny-chic being on the rise once more, it’s like the early 2000s all over again, which is part of why I have an ED in the first place.",
      "created_utc": 1731936941.0,
      "score": 8,
      "context": []
    },
    {
      "id": "lxm1p2d",
      "author": "BrilliantAngle7753",
      "body": "Don't feel stupid because you are not!!! Celebrities have the same issues, thoughts and feelings as we do.  They are human just like us, their chosen profession is what makes us crave to be like them!! Do you think that Arianna does fart and have shit attacks?!! Her anxiety is probably worse than yours and mine put together and is on meds that know one but her and the doctor are aware of.  Please please don't compare your existence to theirs! The media makes us want to be like them!!🌷",
      "created_utc": 1731861069.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lxw96wm",
      "author": "intern_nomad",
      "body": "I’ve noticed a HUGE uptick in weight loss related online content due to Ariana and with Ozempic blowing up this year. People keep saying “skinny is back” etc and I’ve even found myself falling back into disordered eating habits. I got so incredibly triggered and it’s reminding of my hs days. You are not alone at all. I’m seeing the content everywhere and finding myself getting sucked in and that’s actually why I’m on here. Shit absolutely blows.",
      "created_utc": 1732002732.0,
      "score": 7,
      "context": []
    },
    {
      "id": "lxmgjax",
      "author": "OkSlide5161",
      "body": "Hi! don’t feel stupid i’ve been feeling the same exact way, i think just trying your best to stay off the internet and limit the amount of these celebrities is the best way to combat it. but, i know it’s easier said than done lol. <3",
      "created_utc": 1731865995.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lxoq0qc",
      "author": "ursparrow",
      "body": "Highly relatable. I had to block all Wicked mentions, which sucks because I’m very excited for the movie. This is also happened to me in the summer with Twisters promo because of Daisy Edgar Jones. It will pass, I promise. Just be safe and kind to yourself and censor your online content if you can.",
      "created_utc": 1731893102.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lxmq8mj",
      "author": "MoulinSarah",
      "body": "Yep",
      "created_utc": 1731869091.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lxrt6yc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1731945555.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lxtk1bi",
      "author": "Perfect_Hyena8148",
      "body": "I’m a huge wicked fan but l literally can’t watch any of the press tours. It’s far too triggering. I want to say I’m not in anyway body shaming, but when you’ve had/have an ED, you see the invisible signs",
      "created_utc": 1731964631.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lxsp6jn",
      "author": "someolive2",
      "body": "yea she is my main trigger. i commented this somewhere else when someone asked what are your triggers and got down voted for it really hard for some reason.",
      "created_utc": 1731955299.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lxosgzc",
      "author": "booreaves",
      "body": "I’m so sorry you’re struggling, and it’s completely normal. I hope you have a couple people you can disclose to for support. Even just one could make a massive difference for you. Remember, many of these celebrities and influencers are probably struggling with EDs too and either don’t know it or have reasons to keep it quiet. And, if they were your best friend they wouldn’t want you to relapse. They would want you to continue being true to you and your body.",
      "created_utc": 1731894005.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lxpdb24",
      "author": "kistberry22",
      "body": "It was nice to read I'm not alone in this. It stinks we are all having a hard time though. I have been thinking maybe I need to stop watching the media about it.. but I have loved wicked for so long and was excited.. oh well.",
      "created_utc": 1731901959.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lxo2wds",
      "author": "Moomoo-meowbitch",
      "body": "I’m actually a huge Ariana Stan and I’ve struggled with Ed’s my whole life but yup, when I watch videos of her it makes me get into that “competition” mode or jealousy.",
      "created_utc": 1731884938.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lxq42p1",
      "author": "allurinaaa",
      "body": "dude, i saw a tiktok saying that ariana and cynthia have some mutual ed friendship, that's why they're crying all the time and have lost weight..which is like an insane thing to say but yeah i get what you're saying. i feel like it's the part of the ed where you see someone else lose weight and jealousy hits. please reach out for support. you deserve it.",
      "created_utc": 1731915789.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lxpeusa",
      "author": "historysasylum",
      "body": "Yes. I really relate to what you said about recovery during lockdown too. Her presence all over social media lately has definitely woken up a restricting motivation from a deep sleep. I don’t really feel like there’s anyone I can talk to about it either. I’m so scared to let them know I’m struggling again",
      "created_utc": 1731902606.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxq2x81",
      "author": "SavingsPotential7353",
      "body": "Ariana is such a big trigger to me too,im not in ed recovery for very lond but im doing really good and im fully weight restored. Its hard not getting influenced by people, especially famous ones. I do believe recovery is about how you handle the triggers. If you think its going the wrong way talking to someone could help. I think its very strong you still have the healthy telling you might relapse, and also means you did come a far way and should be proud. Sadly most people never fully recover, and we always have to look out. Triggers will be there, we just need to learn how to manage them. And i believe you have come a long way and are strong enough to manage it!",
      "created_utc": 1731915048.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxughkk",
      "author": "grapesandcake",
      "body": "Imho, Ariana looks terrible now. I think you’ve come so far being able to overcome your eating disorder. Would it be possible to contact your healthcare provider or therapist to discuss this and deep dive into why you feel this way? And get some support too?",
      "created_utc": 1731975250.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxuvxkt",
      "author": "Live_Apple",
      "body": "I am struggling as well.  I recovered over the summer and I don't know how to handle or cope with seeing so many stars become skinny, or societal standards of being skinny.  I feel the same way about the start of a relapse.  I've checked my weight almost everyday again, and I feel the need to restrict my meals.  There's a part of me that keeps telling me \"I can lose a little more weight\" and I don't know how to stop that when I keep seeing videos and pictures of all these famous people becoming more and more thin. I've really been trying to disrupt these thoughts by telling myself \"I am healthy. I am a healthy weight, I look good.\" Sometimes it doesn't work but im going to keep trying.",
      "created_utc": 1731980615.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lxtyx2t",
      "author": "None",
      "body": "Yes, and it’s not just the images of her frame but all the comments defending her that bother me too. I just find it so hard to see how disconnected we as a society have become to what healthy looks like. \nHalf the people don’t even realise influences are using AI to edit their bodies to look different. \nEven if it isn’t ED she’s clearly unwell, whether working too hard or something else but it’s taking a toll on her health",
      "created_utc": 1731969250.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxumlhq",
      "author": "Toes24_7",
      "body": "Short response but it angers me seeing how ppl want to get skinny like these celebrities. Even though I fell victim to it back then.",
      "created_utc": 1731977381.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ly2f7j6",
      "author": "arianatoritis",
      "body": "I’m totally feeling a relapse coming for me as well. I’ve been Ariana’s biggest fan since I was a little girl. I look up to this woman. She’s taught me everything and been there for me more than my Mother. After years of trying to recover, after treatment and lots of therapy- I am suddenly in the F*** it mode. If Ariana can why shouldn’t I? Her life is worth living and she’s killing herself. My life is a crumb next to hers. My life feels like a grain of salt type amount of important. I have no family I lost them in Russia, wtf is the point of eating. I’m having a lot of knee pain and I’m 23. #SOS what do I do",
      "created_utc": 1732088147.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ly2tn6g",
      "author": "mentalhealthissexy",
      "body": "this is making me so sad to read, but I’m also super relieved because I’ve struggled to find open, not ridiculously censored discussion about her in wicked and I feel like I’m screaming into a void. I’m recovered (6 years now) and I work in child and adolescent mental health now and I’m so scared that these young girls will fall into the same deep hole I fell into and fought so hard to claw out of. I’m struggling with a lot of anger towards Ariana, wicked, the movie industry, that they could be so irresponsible with body image. Chest bones in a poofy princess gown is a travesty in 2024. Go gentle everybody, recovery is a battle and you’re a fighter ❤️",
      "created_utc": 1732097808.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ly2xozq",
      "author": "YuBeace",
      "body": "Feeling any kind of body dismorphia when looking at celebrities is not uncommon at all. Most celebrities follow insane regimes to look like the \"ideal\" person just so they can keep their fame going. They really push the boundaries of their own body AND mental health because of it. And the very rich ones will be full of little augmentations that regular people can't even hope to afford. Body image problems are like, one of the biggest issues for celebrities themselves and the people looking at them. And that's not even touching the tip of the iceberg of digital augmentations that are devilishly sneaky sometimes.\n\nSo no, you're not silly for being triggered when looking at Ariana. She's a very clear case of someone who has been adjusting herself constantly for the public view. I feel bad for her sometimes because she and her agents really seem to push the \"it's all natural\" narrative absolutely over the top. There's no way that's good for her mental health.",
      "created_utc": 1732100382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ly362dd",
      "author": "True-Godess",
      "body": "Get off the internet n social media n open a book. No ones shoving these celebrities in your face. Your making choices to consume them wether social media or internet use. Just like you don’t have to eat a donut. U don’t have to listen to her or see or hear or watch or read about her. You create your own reality.",
      "created_utc": 1732104940.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ly53j9x",
      "author": "Krabby_Sabby",
      "body": "Let me tell you, I bet she thinks about food all of the time. I bet she doesn’t even have a sex drive for her new boyfriend (whom she stole btw). She just did it for the validation she needs. Her whole life is about validation. Her life honestly seems sad and unfulfilling tbh. She doesn’t even look like herself in the face bc of all the work she’s had done. She changes her personality constantly to fit those around her. I’d hate to be her, skinny or not tbh.",
      "created_utc": 1732128456.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0i0iid",
      "author": "scorpiondoll",
      "body": "I know this post is older now but… Yes 100%\n\nI’ve been battling this just over 10yrs. Recovery, relapse, recovery, relapse, rinse & repeat. I’m sitting just at healthy weight (I’m 4’11 so already petite) but recently relapsed again and… due to some therapy / being a bit older now (a yr younger than her and just under her height) my rational brain is genuinely freaked out by her (I hope my wording doesn’t come across as shaming), but then my ED brain is like… I’ve looked like this before & now I want to be tiiiny / can do it again 💔\n\nWhen I say genuinely freaked, it’s to do with having that first-hand experience of all the horrible mental/physical symptoms that come with being such low weight… you know? \n\nPlease don’t feel stupid, you are far far from 🫂 even writing and posting this was super brave. This time of year especially is hard for so many. Sending lots of love & support your way ❤️‍🩹",
      "created_utc": 1733378911.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lxtsx31",
      "author": "None",
      "body": "Yes! The comments are what I struggle with because people defend her or attack anyone that expresses concern. There’s so many comments just dismissing the possibility of her struggling which makes me feel eurgh because I have atypical AN I.e I’m not underweight so it makes me feel likes fraud/fuels my ED.",
      "created_utc": 1731967332.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lxng7ly",
      "author": "None",
      "body": "I think she had surgery done like most celebs. I think her loss is deliberate. Idk that she has an ed but I know Jeanette has one and they grew up together on set. That means something. She probably has to trigger Jeanette. She’s just doing it the easy way via surgery whereas Jeanette is probably sticking her finger down her throat- old school and dirty.",
      "created_utc": 1731877380.0,
      "score": -1,
      "context": []
    },
    {
      "id": "lydv0gi",
      "author": "becomingleela",
      "body": "It's not really nice to say Ariana looks terrible. What if she's suffering from an eating disorder herself and this is the way people speak about her?",
      "created_utc": 1732262526.0,
      "score": 1,
      "context": [
        {
          "id": "lxo9dbk",
          "author": "runninginbubbles",
          "body": "It's hard when you've weight restored and every time you try remind yourself \"I needed to do this in order to participate in life again\" you see someone super thin who appears to be participating in life just fine. So why did I need to gain all this weight? Or \"why was I made to gain weight if she's allowed to live like that\"\nI found myself getting way more triggered by people at a healthy weight than when I'm underweight.\n It's so bloody hard. I'm sorry. Ariana looks terrible. Please take care x",
          "created_utc": 1731887220.0
        }
      ]
    },
    {
      "id": "mf0b4z9",
      "author": "kind-shark",
      "body": "Yes, this. I have never experienced an ED but I am here because I am very concerned for Ariana and I’m worried something bad will happen. Whether it’s an ED, or some other kind of illness, drug related, or other, something is definitely off and it’s scary to witness. I just want to know she is being supported in the right ways right now.",
      "created_utc": 1740625693.0,
      "score": 1,
      "context": [
        {
          "id": "lxnrsqp",
          "author": "Grand_Pomegranate671",
          "body": "Judging by what I see online, even people who don't struggle with an ED are triggered by Ariana, so don't be too harsh on yourself. The fact that you recognise your negative thoughts and admit them out loud is a very good sign.",
          "created_utc": 1731881174.0
        }
      ]
    },
    {
      "id": "lxoqfds",
      "author": "Lindsey7618",
      "body": "This! OP, reach out to those who support you! Family, friends, whoever. That's the whole point of having a support system. When you keep these thoughts to yourself, they're able to grow. When you verbalize them with someone else, it's easier to change the direction you're going.",
      "created_utc": 1731893252.0,
      "score": 13,
      "context": [
        {
          "id": "lxmi882",
          "author": "Excellent-World-476",
          "body": "Recovery does not mean not being triggered. It means responding by using healthy coping skills.",
          "created_utc": 1731866553.0
        }
      ]
    },
    {
      "id": "m5xs4az",
      "author": "Special-Stress6858",
      "body": ".",
      "created_utc": 1736284173.0,
      "score": 1,
      "context": [
        {
          "id": "lxmi882",
          "author": "Excellent-World-476",
          "body": "Recovery does not mean not being triggered. It means responding by using healthy coping skills.",
          "created_utc": 1731866553.0
        }
      ]
    },
    {
      "id": "lxuw972",
      "author": "Live_Apple",
      "body": "I think I'm relapsing now and I'm trying so hard to fight it.  I had a complete breakdown yesterday about it. Like I could feel part of myself yearning to starve myself again, but I had to fight those thoughts.",
      "created_utc": 1731980724.0,
      "score": 5,
      "context": [
        {
          "id": "lxmsii2",
          "author": "Guppy_fromtheWest",
          "body": "I feel you. Fully relapsed in Summer and I‘m triggered by all these Wicked campaigns. I wanna be skinny like her so bad",
          "created_utc": 1731869804.0
        }
      ]
    },
    {
      "id": "lxw9de7",
      "author": "intern_nomad",
      "body": "Such a good call stepping back from socials. I need to do this cause it’s been insane these last few weeks.",
      "created_utc": 1732002848.0,
      "score": 5,
      "context": [
        {
          "id": "lxnjfw0",
          "author": "None",
          "body": "Totally relate to you! You're not stupid. I have gained a healthy weight for years and suddenly the media is full of very skinny celebrities again and especially the conversations about ozempic is triggering. Honestly my ED has never been about wanting to look like other skinny people or celebs, it never was a thing for me to notice but seeing those images does something to my brain now. I am trying to fight the urges and look away. I even stopped using social media for now.",
          "created_utc": 1731878427.0
        }
      ]
    },
    {
      "id": "ly0qx7w",
      "author": "joecoolblows",
      "body": "Yep. It's all over tic tock as well. And, as a whole, more people are more savvy to the  community lingo and innuendo languages of the ed community, to the point that the recovering community has been high jacked by ed influencers looking for their cult following among their fellow collective.  A collective known to be fiercely  competitive and triggered by this competition with each other, if only in their minds. It's a hella storm. \n\nAs someone who once struggled many years with substance use, to me, this seems almost like, if there were drug dealer influencers, seeking to high jack the online substance abuse recovery community. \n\nI mean, thank God I didn't have to look at a bunch of beautiful,  influencers, over the top in their standards of petite, pretty perfection and popularity,  openly, glamorously doing a bunch of drugs, while looking peak beautiful, and like they have the most AMAZING life ever, and EVERYTHING is beyond GORGEOUS, ALL under the guise of, \"Oh, hey, this is my new HEALTHY ME, this is RECOVERY ME, because I slapped the recovery label onto my brand.  Meanwhile they weigh 90 pounds, EVERY weird angled photo is selected for how well it shows off their bones, and they are picking at a quarter of a whole wheat muffin. \n\nIt's like the world tapped into the recovery community label and high jacked it with EVERY worse behavior possible. The body check photos are insane. \n\nI only struggled with anorexia for a few years, now I'm older I don't care anymore. But, I struggled so many YEARS with other things, and it was brutal. \n\nLooking at the influencer communities, and the insanity of the manipulation is WILD. THANK GOD I never had to deal with something like this as a young person, or when my dysfunctional behaviors were at their WORST.  \n\nFood is never going to be illegal, and beauty,  is always going to be celebrated. The association of beauty with wealth, privilege, youth and thinness is A Thing. And, all those elements, with Ozempic and Influencers are a new generation's dual torches of horrific, collective dysfunctional behaviors, lightning the flame of a perfect firestorm.  \n\nIt's awful. These poor young women growing up today are being manipulated by this nonsense, and it's freaking  ridiculous.",
      "created_utc": 1732062594.0,
      "score": 3,
      "context": [
        {
          "id": "lxw96wm",
          "author": "intern_nomad",
          "body": "I’ve noticed a HUGE uptick in weight loss related online content due to Ariana and with Ozempic blowing up this year. People keep saying “skinny is back” etc and I’ve even found myself falling back into disordered eating habits. I got so incredibly triggered and it’s reminding of my hs days. You are not alone at all. I’m seeing the content everywhere and finding myself getting sucked in and that’s actually why I’m on here. Shit absolutely blows.",
          "created_utc": 1732002732.0
        }
      ]
    },
    {
      "id": "lxrvr5r",
      "author": "ashleynicolle_m",
      "body": "I don't find her skinny at all. Or a celeb. I'm assuming we are taking about Ariana from VPR. \n\nAngelina Jolie.....now that a whole other story about perfection in human form.",
      "created_utc": 1731946370.0,
      "score": -6,
      "context": [
        {
          "id": "lxrt6yc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731945555.0
        }
      ]
    },
    {
      "id": "lxpzwta",
      "author": "Miss_Tish_Tash",
      "body": "Please don’t be afraid to tell someone that you’re struggling. The power your ED holds over you is in the secrecy of it. Once you share it, the power it holds over you lessens.",
      "created_utc": 1731913168.0,
      "score": 2,
      "context": [
        {
          "id": "lxpeusa",
          "author": "historysasylum",
          "body": "Yes. I really relate to what you said about recovery during lockdown too. Her presence all over social media lately has definitely woken up a restricting motivation from a deep sleep. I don’t really feel like there’s anyone I can talk to about it either. I’m so scared to let them know I’m struggling again",
          "created_utc": 1731902606.0
        }
      ]
    },
    {
      "id": "ly6zcj3",
      "author": "breezybri55",
      "body": "I feel exactly like this. I think about my young nieces idolizing Ari and feel so scared and especially so angry. In a way, I have some outsized anger toward Ariana in particular—I know she's a victim here. But I keep wondering... where is the line? If a celebrity is clearly engaging in such a self-destructive and harming behavior, if they're wasting away, are we supposed to say nothing? I don't want additional hate or \"canceling\" aimed at her, or Cynthia, because we all know that would make it worse. But instead she's here claiming she's healthier than ever and, what, we are just going to let that stand? I know I'm just one person and ultimately can't change it, but it feels like as a society we have to have some kind of responsibility to ..... idk, at least not be celebrating and shining the spotlight incessantly on this person?? Clearly, I'm working through this myself.",
      "created_utc": 1732158642.0,
      "score": 1,
      "context": [
        {
          "id": "ly2tn6g",
          "author": "mentalhealthissexy",
          "body": "this is making me so sad to read, but I’m also super relieved because I’ve struggled to find open, not ridiculously censored discussion about her in wicked and I feel like I’m screaming into a void. I’m recovered (6 years now) and I work in child and adolescent mental health now and I’m so scared that these young girls will fall into the same deep hole I fell into and fought so hard to claw out of. I’m struggling with a lot of anger towards Ariana, wicked, the movie industry, that they could be so irresponsible with body image. Chest bones in a poofy princess gown is a travesty in 2024. Go gentle everybody, recovery is a battle and you’re a fighter ❤️",
          "created_utc": 1732097808.0
        }
      ]
    },
    {
      "id": "lz1lum7",
      "author": "EntertainerUsed7486",
      "body": "People seem to lose empathy when the person they dislike seems fine and okay in public. You have no idea how Ariana feels about herself behind closed doors.",
      "created_utc": 1732607758.0,
      "score": 1,
      "context": [
        {
          "id": "lxo9dbk",
          "author": "runninginbubbles",
          "body": "It's hard when you've weight restored and every time you try remind yourself \"I needed to do this in order to participate in life again\" you see someone super thin who appears to be participating in life just fine. So why did I need to gain all this weight? Or \"why was I made to gain weight if she's allowed to live like that\"\nI found myself getting way more triggered by people at a healthy weight than when I'm underweight.\n It's so bloody hard. I'm sorry. Ariana looks terrible. Please take care x",
          "created_utc": 1731887220.0
        },
        {
          "id": "lydv0gi",
          "author": "becomingleela",
          "body": "It's not really nice to say Ariana looks terrible. What if she's suffering from an eating disorder herself and this is the way people speak about her?",
          "created_utc": 1732262526.0
        }
      ]
    },
    {
      "id": "lxs12kh",
      "author": "PandaPandaMoo",
      "body": "This is a really unnecessary comment on a post about being triggered and recovery",
      "created_utc": 1731948023.0,
      "score": 6,
      "context": [
        {
          "id": "lxrt6yc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731945555.0
        },
        {
          "id": "lxrvr5r",
          "author": "ashleynicolle_m",
          "body": "I don't find her skinny at all. Or a celeb. I'm assuming we are taking about Ariana from VPR. \n\nAngelina Jolie.....now that a whole other story about perfection in human form.",
          "created_utc": 1731946370.0
        }
      ]
    },
    {
      "id": "lxs0bkf",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1731947791.0,
      "score": -4,
      "context": [
        {
          "id": "lxrt6yc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731945555.0
        },
        {
          "id": "lxrvr5r",
          "author": "ashleynicolle_m",
          "body": "I don't find her skinny at all. Or a celeb. I'm assuming we are taking about Ariana from VPR. \n\nAngelina Jolie.....now that a whole other story about perfection in human form.",
          "created_utc": 1731946370.0
        }
      ]
    },
    {
      "id": "m0a7zy7",
      "author": "Dsplcmnt-f-thngs0_o",
      "body": "Then couldn’t she use this opportunity to highlight her struggles with ED, rather than embrace a role that accepts an actress actively battling ED? \n\nSeems like my equivalent of applying to a job that knowingly pays males more than females… why support that?\n\nI LOVE Ariana’s music but seeing her in Wicked has me questioning where her mind is at, and whether that’s a female I want to promote (personally).",
      "created_utc": 1733268981.0,
      "score": 4,
      "context": [
        {
          "id": "lxo9dbk",
          "author": "runninginbubbles",
          "body": "It's hard when you've weight restored and every time you try remind yourself \"I needed to do this in order to participate in life again\" you see someone super thin who appears to be participating in life just fine. So why did I need to gain all this weight? Or \"why was I made to gain weight if she's allowed to live like that\"\nI found myself getting way more triggered by people at a healthy weight than when I'm underweight.\n It's so bloody hard. I'm sorry. Ariana looks terrible. Please take care x",
          "created_utc": 1731887220.0
        },
        {
          "id": "lydv0gi",
          "author": "becomingleela",
          "body": "It's not really nice to say Ariana looks terrible. What if she's suffering from an eating disorder herself and this is the way people speak about her?",
          "created_utc": 1732262526.0
        },
        {
          "id": "lz1lum7",
          "author": "EntertainerUsed7486",
          "body": "People seem to lose empathy when the person they dislike seems fine and okay in public. You have no idea how Ariana feels about herself behind closed doors.",
          "created_utc": 1732607758.0
        }
      ]
    },
    {
      "id": "lxs1l9w",
      "author": "ashleynicolle_m",
      "body": "This is also an unnecessary comment considering we are all entitled to our opinions. Now we are even!",
      "created_utc": 1731948179.0,
      "score": -8,
      "context": [
        {
          "id": "lxrt6yc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731945555.0
        },
        {
          "id": "lxrvr5r",
          "author": "ashleynicolle_m",
          "body": "I don't find her skinny at all. Or a celeb. I'm assuming we are taking about Ariana from VPR. \n\nAngelina Jolie.....now that a whole other story about perfection in human form.",
          "created_utc": 1731946370.0
        },
        {
          "id": "lxs12kh",
          "author": "PandaPandaMoo",
          "body": "This is a really unnecessary comment on a post about being triggered and recovery",
          "created_utc": 1731948023.0
        }
      ]
    },
    {
      "id": "lxs13ca",
      "author": "ashleynicolle_m",
      "body": "I'm pretty sure she was alot skinnier when she first started VPR when she was Sandy's mistress.",
      "created_utc": 1731948029.0,
      "score": -3,
      "context": [
        {
          "id": "lxrt6yc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731945555.0
        },
        {
          "id": "lxrvr5r",
          "author": "ashleynicolle_m",
          "body": "I don't find her skinny at all. Or a celeb. I'm assuming we are taking about Ariana from VPR. \n\nAngelina Jolie.....now that a whole other story about perfection in human form.",
          "created_utc": 1731946370.0
        },
        {
          "id": "lxs0bkf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731947791.0
        }
      ]
    },
    {
      "id": "m0ae1vx",
      "author": "EntertainerUsed7486",
      "body": "Why should she be vulnerable and tell millions about something so personal? You don’t demand people tell you family matters? Bank statements? So why do you feel entitled to her or her body?",
      "created_utc": 1733271128.0,
      "score": 2,
      "context": [
        {
          "id": "lxo9dbk",
          "author": "runninginbubbles",
          "body": "It's hard when you've weight restored and every time you try remind yourself \"I needed to do this in order to participate in life again\" you see someone super thin who appears to be participating in life just fine. So why did I need to gain all this weight? Or \"why was I made to gain weight if she's allowed to live like that\"\nI found myself getting way more triggered by people at a healthy weight than when I'm underweight.\n It's so bloody hard. I'm sorry. Ariana looks terrible. Please take care x",
          "created_utc": 1731887220.0
        },
        {
          "id": "lydv0gi",
          "author": "becomingleela",
          "body": "It's not really nice to say Ariana looks terrible. What if she's suffering from an eating disorder herself and this is the way people speak about her?",
          "created_utc": 1732262526.0
        },
        {
          "id": "lz1lum7",
          "author": "EntertainerUsed7486",
          "body": "People seem to lose empathy when the person they dislike seems fine and okay in public. You have no idea how Ariana feels about herself behind closed doors.",
          "created_utc": 1732607758.0
        },
        {
          "id": "m0a7zy7",
          "author": "Dsplcmnt-f-thngs0_o",
          "body": "Then couldn’t she use this opportunity to highlight her struggles with ED, rather than embrace a role that accepts an actress actively battling ED? \n\nSeems like my equivalent of applying to a job that knowingly pays males more than females… why support that?\n\nI LOVE Ariana’s music but seeing her in Wicked has me questioning where her mind is at, and whether that’s a female I want to promote (personally).",
          "created_utc": 1733268981.0
        }
      ]
    },
    {
      "id": "lxs1zn6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1731948301.0,
      "score": 0,
      "context": [
        {
          "id": "lxrt6yc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731945555.0
        },
        {
          "id": "lxrvr5r",
          "author": "ashleynicolle_m",
          "body": "I don't find her skinny at all. Or a celeb. I'm assuming we are taking about Ariana from VPR. \n\nAngelina Jolie.....now that a whole other story about perfection in human form.",
          "created_utc": 1731946370.0
        },
        {
          "id": "lxs0bkf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731947791.0
        },
        {
          "id": "lxs13ca",
          "author": "ashleynicolle_m",
          "body": "I'm pretty sure she was alot skinnier when she first started VPR when she was Sandy's mistress.",
          "created_utc": 1731948029.0
        }
      ]
    },
    {
      "id": "m5f1a7f",
      "author": "doyoueverhaveadream",
      "body": "When your fans are children and girls who look up to you, you owe them transparency atleast on that.",
      "created_utc": 1736026409.0,
      "score": 3,
      "context": [
        {
          "id": "lxo9dbk",
          "author": "runninginbubbles",
          "body": "It's hard when you've weight restored and every time you try remind yourself \"I needed to do this in order to participate in life again\" you see someone super thin who appears to be participating in life just fine. So why did I need to gain all this weight? Or \"why was I made to gain weight if she's allowed to live like that\"\nI found myself getting way more triggered by people at a healthy weight than when I'm underweight.\n It's so bloody hard. I'm sorry. Ariana looks terrible. Please take care x",
          "created_utc": 1731887220.0
        },
        {
          "id": "lydv0gi",
          "author": "becomingleela",
          "body": "It's not really nice to say Ariana looks terrible. What if she's suffering from an eating disorder herself and this is the way people speak about her?",
          "created_utc": 1732262526.0
        },
        {
          "id": "lz1lum7",
          "author": "EntertainerUsed7486",
          "body": "People seem to lose empathy when the person they dislike seems fine and okay in public. You have no idea how Ariana feels about herself behind closed doors.",
          "created_utc": 1732607758.0
        },
        {
          "id": "m0a7zy7",
          "author": "Dsplcmnt-f-thngs0_o",
          "body": "Then couldn’t she use this opportunity to highlight her struggles with ED, rather than embrace a role that accepts an actress actively battling ED? \n\nSeems like my equivalent of applying to a job that knowingly pays males more than females… why support that?\n\nI LOVE Ariana’s music but seeing her in Wicked has me questioning where her mind is at, and whether that’s a female I want to promote (personally).",
          "created_utc": 1733268981.0
        },
        {
          "id": "m0ae1vx",
          "author": "EntertainerUsed7486",
          "body": "Why should she be vulnerable and tell millions about something so personal? You don’t demand people tell you family matters? Bank statements? So why do you feel entitled to her or her body?",
          "created_utc": 1733271128.0
        }
      ]
    },
    {
      "id": "lxs23g8",
      "author": "ashleynicolle_m",
      "body": "Ariana madix....isn't she the one on Broadway?",
      "created_utc": 1731948332.0,
      "score": 0,
      "context": [
        {
          "id": "lxrt6yc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731945555.0
        },
        {
          "id": "lxrvr5r",
          "author": "ashleynicolle_m",
          "body": "I don't find her skinny at all. Or a celeb. I'm assuming we are taking about Ariana from VPR. \n\nAngelina Jolie.....now that a whole other story about perfection in human form.",
          "created_utc": 1731946370.0
        },
        {
          "id": "lxs0bkf",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731947791.0
        },
        {
          "id": "lxs13ca",
          "author": "ashleynicolle_m",
          "body": "I'm pretty sure she was alot skinnier when she first started VPR when she was Sandy's mistress.",
          "created_utc": 1731948029.0
        },
        {
          "id": "lxs1zn6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1731948301.0
        }
      ]
    },
    {
      "id": "m5g2ady",
      "author": "EntertainerUsed7486",
      "body": "32 days. Enough\n\nConvo is done",
      "created_utc": 1736038842.0,
      "score": 1,
      "context": [
        {
          "id": "lxo9dbk",
          "author": "runninginbubbles",
          "body": "It's hard when you've weight restored and every time you try remind yourself \"I needed to do this in order to participate in life again\" you see someone super thin who appears to be participating in life just fine. So why did I need to gain all this weight? Or \"why was I made to gain weight if she's allowed to live like that\"\nI found myself getting way more triggered by people at a healthy weight than when I'm underweight.\n It's so bloody hard. I'm sorry. Ariana looks terrible. Please take care x",
          "created_utc": 1731887220.0
        },
        {
          "id": "lydv0gi",
          "author": "becomingleela",
          "body": "It's not really nice to say Ariana looks terrible. What if she's suffering from an eating disorder herself and this is the way people speak about her?",
          "created_utc": 1732262526.0
        },
        {
          "id": "lz1lum7",
          "author": "EntertainerUsed7486",
          "body": "People seem to lose empathy when the person they dislike seems fine and okay in public. You have no idea how Ariana feels about herself behind closed doors.",
          "created_utc": 1732607758.0
        },
        {
          "id": "m0a7zy7",
          "author": "Dsplcmnt-f-thngs0_o",
          "body": "Then couldn’t she use this opportunity to highlight her struggles with ED, rather than embrace a role that accepts an actress actively battling ED? \n\nSeems like my equivalent of applying to a job that knowingly pays males more than females… why support that?\n\nI LOVE Ariana’s music but seeing her in Wicked has me questioning where her mind is at, and whether that’s a female I want to promote (personally).",
          "created_utc": 1733268981.0
        },
        {
          "id": "m0ae1vx",
          "author": "EntertainerUsed7486",
          "body": "Why should she be vulnerable and tell millions about something so personal? You don’t demand people tell you family matters? Bank statements? So why do you feel entitled to her or her body?",
          "created_utc": 1733271128.0
        },
        {
          "id": "m5f1a7f",
          "author": "doyoueverhaveadream",
          "body": "When your fans are children and girls who look up to you, you owe them transparency atleast on that.",
          "created_utc": 1736026409.0
        }
      ]
    }
  ]
}