{
  "id": "1gxesmd",
  "title": "All of the people on Ozempic is triggering ",
  "author": "Useful-Bicycle",
  "created_utc": 1732300364.0,
  "selftext": "So many coworkers are taking it and losing weight rapidly. They’re like tinier than me now. I’m so jealous. It makes me feel like relapsing but I can’t. Does anyone else feel this way?",
  "score": 521,
  "num_comments": 95,
  "comments": [
    {
      "id": "lyipjxi",
      "author": "Upset-Lavishness-522",
      "body": "For good or bad, these GLP-1s are here to stay. In the next couple of years the shots will be replaced by tablets, which will make them even more available.",
      "created_utc": 1732329486.0,
      "score": 145,
      "context": []
    },
    {
      "id": "lyj2a81",
      "author": "musicandmentalhealth",
      "body": "Yes. It’s so hard to stay in recovery and not fall prey to ozempic. I keep reminding myself of the side effects and my recovery and it helps but it’s still hard.",
      "created_utc": 1732334877.0,
      "score": 78,
      "context": []
    },
    {
      "id": "lyirg8g",
      "author": "etwichell",
      "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
      "created_utc": 1732330260.0,
      "score": 89,
      "context": []
    },
    {
      "id": "lyioqcf",
      "author": "alienprincess111",
      "body": "Yes.  I hate seeing people on it lose weight, and brag about it constantly on top of it.",
      "created_utc": 1732329151.0,
      "score": 97,
      "context": []
    },
    {
      "id": "lyjq13w",
      "author": "runninginbubbles",
      "body": "I feel like everyone in my life is on some weight loss journey. It's horrible and very awkward when I walk in on people talking about their diets then they just go \"hey we're just talking about work\" \n\nI get they're trying to not discuss it in front of me but yea it still is hard.",
      "created_utc": 1732347546.0,
      "score": 27,
      "context": []
    },
    {
      "id": "lyoep4t",
      "author": "Mahlisya",
      "body": "I had anorexia and now have diabetes type 1 and I actually need ozempic for my health and let me tell you it’s terrible.",
      "created_utc": 1732415043.0,
      "score": 11,
      "context": []
    },
    {
      "id": "lyiz55k",
      "author": "cloudsongs_",
      "body": "I feel jealous too. But most of those people will need to take it for life or they’ll gain back most or all of their weight, if not more, once they’re off it. Unfortunate but that’s what the studies shiw",
      "created_utc": 1732333500.0,
      "score": 43,
      "context": []
    },
    {
      "id": "lykp9ob",
      "author": "cherrie_teaa",
      "body": "i feel the same way. i feel like the ozempic trend is encouraging that early 2000's ed era to make a comeback, which is really upsetting. it took me so long to love my body again, but seeing this stuff everywhere has caused me to take many steps back. it feels like an endless cycle atp :(",
      "created_utc": 1732368393.0,
      "score": 33,
      "context": []
    },
    {
      "id": "lyju3uf",
      "author": "Golden_Amygdala",
      "body": "Yes I was on the verge of relapsing a few months ago (I had reached an unhealthily high weight and needed to loose some after having two babies and breastfeeding for basically 5 years straight) and then watching a colleague go on Ozempic was so triggering I’ve worked really hard to keep a balance and do this healthily but I absolutely want the extreme again and it’s a daily fight!",
      "created_utc": 1732350160.0,
      "score": 15,
      "context": []
    },
    {
      "id": "lym6cr4",
      "author": "EmLee-96",
      "body": "I think some doctors are partly the issue here- mine wouldn't prescribe me one because I wasn't able to maintain the eating and exercise habits that were needed to be able to avoid the side effects (i was struggling eith restriction at the time and was exercising but not losing weight and thought losing weight would allow me to eat regularly). My sister went to a new PCP for her and got one on the first appointment. It's helped her lose some weight (not as much as others), but it's really helped motivate her to do a lot of strength training and eat well on top of it (from all food groups) so she is developing really good habits. I believe the people who look saggy or experiencing the digestive issues aren't following the recommended exercise/eating habits as it's supposed to wreak havoc on your body if you don't. \n\nI've also heard though too it's helping with the \"food noise\"/cravings and even with general anxiety in some people. The research in the next decade will be interesting.",
      "created_utc": 1732386791.0,
      "score": 5,
      "context": []
    },
    {
      "id": "lyj3o9j",
      "author": "iamakaylet13",
      "body": "Yes, very much so, but I have such bad gut issues already that I would be scared to take it. The side affects sound horrible.",
      "created_utc": 1732335512.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lyjj9ad",
      "author": "Competitive-Match940",
      "body": "It’s not worth relapsing but i understand and have been in your shoes when the trend started. I felt awful about myself until I started reading how horrible these medications are for people who don’t need it and are abusing it and how bad the side effects are and it instantly changed my mind. It basically deteriorates your bones and muscles and ruins your stomach, that’s why so many people with ozempic have an almost “saggy” look. There’s a woman on tik tok named Amy and she was overweight and abused it so bad that she looks like she’s going to fall over, if you need a reason not to relapse look up her handles please. \n\nAlso the fact that people are literally abusing medication for people with diabetes and other health conditions is so nasty to me in itself. I wouldn’t be able to abuse a medication knowing that there could always end up being a shortage at any time and these people could die without it. Genuinely what’s next, is a study about insulin going to come out saying it’ll make you skinny and that’ll get taken away from the people who need it🫤",
      "created_utc": 1732343480.0,
      "score": 26,
      "context": []
    },
    {
      "id": "lykov4x",
      "author": "ThunderInMountains",
      "body": "Yes, it's triggering. I work in healthcare and keep hearing how it can trash the kidneys. It also won't work when you stop taking it. I'd hate to be on medication like that for years.",
      "created_utc": 1732368217.0,
      "score": 17,
      "context": []
    },
    {
      "id": "lyjkcea",
      "author": "whinywino89",
      "body": "I totally get this. My parents are on it and it’s insanely triggering.",
      "created_utc": 1732344117.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lylu52g",
      "author": "huuugggttfdf",
      "body": "I have mixed feelings right now because I have BED. When I'm fine I'm like fuck ozempic. But when I'm deep into behaviors I'm like I literally wouldn't be able to eat without feeling sick on ozempic and not only would I lose weight, I could kinda get my life back. When i see a commercial now its simultaneous rage and call to action kind of mood",
      "created_utc": 1732382938.0,
      "score": 10,
      "context": []
    },
    {
      "id": "lyjc4xe",
      "author": "Dissmass1980",
      "body": "Zempi’s are disgusting. They decrease bone density and ligament strength. It’s truly a poison",
      "created_utc": 1732339621.0,
      "score": 18,
      "context": []
    },
    {
      "id": "lynajoc",
      "author": "Fearless_Plum_7810",
      "body": "me to anyone on ozempic: \"yeah babe, that's great, and I actually did something similar a few years ago, but they called it something different and sent me to the hospital to feed me through my nose for 11 months, but so happy for you\"",
      "created_utc": 1732400093.0,
      "score": 9,
      "context": []
    },
    {
      "id": "lylgp8i",
      "author": "Char_Was_Taken",
      "body": "i felt this way, but then my anatomy teacher mentioned in class one day how her friends taking ozempic were mainly just losing muscle and therefore becoming weaker (and increasing their risk of osteoporosis), and that after it stops working you’ll gain all the weight back + people who take ozempic also end up looking quite strange due to the rapid weight loss (like saggy) and i stopped thinking about it so much, because at least my bones aren’t becoming hollow",
      "created_utc": 1732378569.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lylqgbv",
      "author": "None",
      "body": "Agree",
      "created_utc": 1732381741.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lypvqc3",
      "author": "tillyroberts",
      "body": "I’m right there with you, I find it all super triggering for me and my ED recovery journey.",
      "created_utc": 1732441808.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyqfiz3",
      "author": "grapesandcake",
      "body": "Don’t worry, as soon as they stop taking it they’ll regain the weight. Several studies have shown this to happen once people come off them.",
      "created_utc": 1732453312.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyqu7yu",
      "author": "themerkinmademe",
      "body": "Hard same. At least three people I know of are on it, and it took me a bit to realize just how and why it was making me uncomfortable. I’ve definitely required more examination of and vigilance with my own behaviors.",
      "created_utc": 1732459353.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyr45he",
      "author": "UselessHuman1",
      "body": "One of my friend is on it and another wants to get it prescribed. I spend most of my free time with them/texting. She's losing more weight now then I've seen her in the last 10 years. I'm pissed because I would NEVER get it prescribed even if I was their weight! It sucks. And here I am with people expecting me to just gain weight and eat more and more. \n\nSo yeah, I get it.",
      "created_utc": 1732462796.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyrtand",
      "author": "idolsymphony",
      "body": "I want to go on it but I probably can't because my doctor is worried my ed will go from one side to the other. I never had diabetes or even was pre-diabetic at my HW but I was in the danger zone.  Apparently it's helpful for people with BED so a part of me wishes I wasn't honest about everything so I could try to get him to prescribe me the meds. I know it's wrong but I'm jealous.",
      "created_utc": 1732470829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyuo0x3",
      "author": "moodyfull",
      "body": "I get it. I thought I had worked through all my ED and body dysmorphia stuff years ago in treatment. I was feeling good about my body, and no longer existed in a constant mental state of comparing my body to others’. A doctor put me on Wegovy for pre-diabetes and suddenly all of that toxic stuff came roaring back to life. I was on it for 4 months, then my employer said they would no longer cover it and I had to stop. The psychological fallout was tough, and it’s still hard when I run into a fellow plus-sizer I haven’t seen in a while and they’re suddenly looking like they fit into straight sizes. Maybe I wasn’t as “healed” as I thought, or maybe, for folks like us, body positivity or even body neutrality is a lifelong practice. We didn’t get this way overnight.",
      "created_utc": 1732505348.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyura9c",
      "author": "Stingwing4oba",
      "body": "I feel jealous that people lose weight faster than me on it and I don't want to stab myself to get 100lbs lighter. I do feel a bit triggered by people in Ozempic.",
      "created_utc": 1732506670.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyk2nqa",
      "author": "None",
      "body": "They also look weird and distorted",
      "created_utc": 1732355819.0,
      "score": 6,
      "context": []
    },
    {
      "id": "lymk7cq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1732391221.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lyo1or8",
      "author": "Ceeaychada",
      "body": "Yeah. At work some girls were talking about taking it and they aren't even overweight. To be clear, they don't currently take it but want to take it. \n\nScary times to be alive...",
      "created_utc": 1732409971.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lylixmi",
      "author": "catmarstru",
      "body": "If it makes you feel any better, I hear it ages you a great deal which is why the KarJenners are taking less. Gotta look 20 forever!",
      "created_utc": 1732379307.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lym90el",
      "author": "GlitteringAd7989",
      "body": "I’m going to be completely honest. It used to be triggering for me too. I finally with therapy developed a much healthier relationship with food. And then under my doctor’s care I started mounjaro. I actually found that the mounjaro helped me on my journey to stop binging and purging. I was able to learn helping eating habits to stop binging through therapy, but even after learning healthy eating habits there really is not anything that helps the food noise go away nor did it help my portion control so much. \n\nBut after starting mounjaro, the food noise went away. It helped me continue to see myself in a positive light and genuinely helped portion control. And since stopping it after a year, the things I become accustomed to during mounjaro have continued to stay with me. \n\nThe way I think about it is I did so much hard work on the front end to stop the purging and to develop a healthy relationship with food and my body. And then mounjaro helped give me the little boost I needed to start losing weight- something I had struggled to even start doing because I had been unsuccessful so many times. So, I 100% understand being triggered by those losing weight quickly on a GLP-1, but I wanted to put my opinion on there as somebody with an eating disorder who was on 1.",
      "created_utc": 1732387625.0,
      "score": 3,
      "context": []
    },
    {
      "id": "lyrctd3",
      "author": "kwumpus",
      "body": "Well when their pancreas’s stop working then they’ll regret it",
      "created_utc": 1732465615.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lyroka5",
      "author": "bellabunny97",
      "body": "The majority of my coworkers are older women with undiagnosed EDs but specifically I have one coworker close in age and she’ll be quick to say how much she hates to hear all of that. But she’s gotten bariatric surgery goes to the gym everyday and is now on ozempic and it’s really triggering. I also thought she was like a safe person to talk to and I just lightly mentioned dieting for myself. I didn’t even get into specifics and she looked at me and yelled that I don’t need to lose weight and it was super embarrassing so I keep my mouth shut now",
      "created_utc": 1732469319.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lytshdm",
      "author": "Toes24_7",
      "body": "Instead of feeling jealous I feel angry because I know it’s unhealthy since I deal with it first hand. Ppl don’t know what they are truly getting into and it’s sad I wouldn’t wish this on my worst enemy.",
      "created_utc": 1732493521.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lytsk7d",
      "author": "veronicatandy",
      "body": "absolutely feel you. you're not alone💕 glad to know im not either",
      "created_utc": 1732493549.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lytv33n",
      "author": "karupiin",
      "body": "Someone in my household is currently taking it, it honestly does bother me a little. It doesn’t make me want to take it though, Ozempic seems so dangerous. Especially for someone with an eating disorder. Seems like a one way ticket to hell",
      "created_utc": 1732494442.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyvht0i",
      "author": "Merfolk-18",
      "body": "No fr, i get so triggered when non disordered ppl lose weight and get thinner than me and then I feel guilty bc they are on their own journey and I should feel happy for them ig 🫠",
      "created_utc": 1732520362.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyx3u0u",
      "author": "Fun_Intention_5371",
      "body": "Same same same",
      "created_utc": 1732549177.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyx9zg5",
      "author": "Lalanic10",
      "body": "My sister just started it a few weeks ago and I’m so jealous. I am overweight and I know that my bmi likely isn’t enough to get it prescribed at the doctors office. Needless to say my ed has come back to a degree, I am eating and stuff, but I’m also hopeful that I will be able to get to my dream body since I haven’t had it since I was 8",
      "created_utc": 1732551134.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyxqbtz",
      "author": "Expensive_Use_2277",
      "body": "Oof, yeah. It’s been really tough seeing people get to their goal weights so “easily”. It’s the stuff of disordered dreams and really hard for me not to push myself with the somewhat healthy fitness and weight journey I’m currently on and fall back into some of my really bad ED habits to achieve that same thing. Or entertain the idea of getting it myself 🫠",
      "created_utc": 1732556186.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyyo5x9",
      "author": "Gally01fr",
      "body": "Yup. That really sucks...I am learning to make peace with it but for a good while, I really struggled with the \"unfairness\" of it.",
      "created_utc": 1732566639.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyytxgf",
      "author": "Capable-Exchange7309",
      "body": "You just have to remember that skinny isn’t always healthy, don’t take something you don’t need if it’s not benefiting your health",
      "created_utc": 1732568394.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz1jts1",
      "author": "lucidbaby",
      "body": "my doctor let me take it when i gained (too much weight). i’m pretty sure i’d told her about my ED already but.. i jumped at the chance. idk how to feel about it but it did definitely trigger a relapse. haven’t gotten a shot since early july but i’m now at a point where i’m scared i could end up in the hospital.",
      "created_utc": 1732606482.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz77fjs",
      "author": "oatmelody",
      "body": "it's extra weird to me bc my dad is on ozempic for other health reasons and hasn't lost a pound, neither intentionally or unintentionally.",
      "created_utc": 1732685225.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz9obik",
      "author": "Cavatopme",
      "body": "I feel the same way. I have family members on it, and it's so triggering.",
      "created_utc": 1732727077.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjeu7de",
      "author": "Salt_Ingenuity_720",
      "body": "Now I don't know if I want to start. You guys are terrifying me. I'm obese, the weight was medicslly induced. I was looking to break thru the weight loss block.\n\n I'm older with terrible arthritis and serious back issues. The doctor felt this would help with body pain by reducing the weight. Also potential Help with back healing as the weight reduced. \n\nYou guys are talking about in hospital level reactions. Panic attacks, body pain and paralysis. Why have I not heard of that before? \n\nNausea and diarrhea, yes. This epic level near death side effects, no? Never. I know people on it without serious side effects. \n\nI'm confused",
      "created_utc": 1742780944.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjtu4wd",
      "author": "None",
      "body": "Taking ozempic or GLP-1s is disordered eating. It’s just normalized.  ",
      "created_utc": 1742995104.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm7yaeq",
      "author": "quacksabbath",
      "body": "Stay in your lane. Your coworkers bodies and health concerns and weight loss are none of your concern. Just like your medical history is not their concern",
      "created_utc": 1744210235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyobvcf",
      "author": "Temporary-Wrap-6694",
      "body": "I heard that Ozempic is sometimes prescribed to treat EDs and I am a bit tempted to ask for it, not because I want to lose weight (my weight is normal and I don't want to be super skinny), but simply because I want to stop thinking and obsessing over food so much. I feel like I will never be able to eat \"intuitively\" and Ozempic makes you forget about food and only eat when you're really hungry.",
      "created_utc": 1732413925.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lyp6l7a",
      "author": "ButterflyHarpGirl",
      "body": "I’m probably preaching to the choir, but it is a medication meant for diabetes. It makes me angry that people who truly need it for what it is supposed to be used for are not able to get it, especially with the providers out there that will prescribe it willy nilly… And, yes, it is very triggering!!! I believe it is one of the worst things they hand it out, not at all aware, or don’t care, about those of us with eating disorders…",
      "created_utc": 1732426909.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lyvd3z3",
      "author": "DiabloDeSade69",
      "body": "Doesn't Ozempic just kill your cravings for food? I haven't craved food since 2012.",
      "created_utc": 1732517508.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lyjfpwd",
      "author": "SusieQu1885",
      "body": "Yup and will eventually be cheaper and affordable. I’ve seen it happen with the new blood thinners. They use to be sooooo expensive and now are being covered by insurance in Europe",
      "created_utc": 1732341499.0,
      "score": 67,
      "context": [
        {
          "id": "lyipjxi",
          "author": "Upset-Lavishness-522",
          "body": "For good or bad, these GLP-1s are here to stay. In the next couple of years the shots will be replaced by tablets, which will make them even more available.",
          "created_utc": 1732329486.0
        }
      ]
    },
    {
      "id": "mmp0v7s",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1744440022.0,
      "score": 1,
      "context": [
        {
          "id": "lyipjxi",
          "author": "Upset-Lavishness-522",
          "body": "For good or bad, these GLP-1s are here to stay. In the next couple of years the shots will be replaced by tablets, which will make them even more available.",
          "created_utc": 1732329486.0
        }
      ]
    },
    {
      "id": "lyr2nk8",
      "author": "palmtrees007",
      "body": "Ok not ranting or going hard for these drugs but I just started zepbound because I was always healthy weight but PCOS has messed up my endocrine system. I workout 6 days a week and eat clean and not a lb shed and carrying 40 extra lbs. everything has side effects but ozempic is very abrasive and people are taking it for wrong reasons. I know someone getting it under table who has already gotten sick. I had to have my panels done in order to get my meds prescribed",
      "created_utc": 1732462293.0,
      "score": 11,
      "context": [
        {
          "id": "lyj2a81",
          "author": "musicandmentalhealth",
          "body": "Yes. It’s so hard to stay in recovery and not fall prey to ozempic. I keep reminding myself of the side effects and my recovery and it helps but it’s still hard.",
          "created_utc": 1732334877.0
        }
      ]
    },
    {
      "id": "lyk6d9f",
      "author": "IconicThings",
      "body": "what were the side effects for you?",
      "created_utc": 1732358193.0,
      "score": 11,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        }
      ]
    },
    {
      "id": "lyttlnf",
      "author": "Present_Deal_1180",
      "body": "I tried the injection. I don’t need it but yk that’s just a part of eating disorders!! Also it’s so easy to get. Anyway I did the injection for two weeks (total two injections). First week I was fine. The second week I got sooooo sick. I was dizzy, nauseous, fatigued, awful. I know it’s hard. Trust me. I’ve had an ED for the past 10 or so years and I just started seeing a professional about 8 months ago. It’s tough. But we (physically and mentally) shouldn’t take these things unless prescribed/recommended by a doctor. I know it’s easy to get but please take care of yourselves!",
      "created_utc": 1732493915.0,
      "score": 3,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        }
      ]
    },
    {
      "id": "lyr34vc",
      "author": "palmtrees007",
      "body": "Which did you take ?",
      "created_utc": 1732462456.0,
      "score": 1,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        }
      ]
    },
    {
      "id": "lyr31to",
      "author": "palmtrees007",
      "body": "Fitness gym girlie here who’s been working out like crazy for years and not losing weight. I just got on one the has a different compound then ozempic. It’s for insulin resistant non diabetic people like me who if I have a tiny piece of candy, my stomach gets inflammed .. I’ll always be transparent about my journey. Our food is filled with additives so our hormones are wrecked and I needed to lose weight I look normal size but my blood pressure is high and bmi is 36.",
      "created_utc": 1732462426.0,
      "score": 8,
      "context": [
        {
          "id": "lyioqcf",
          "author": "alienprincess111",
          "body": "Yes.  I hate seeing people on it lose weight, and brag about it constantly on top of it.",
          "created_utc": 1732329151.0
        }
      ]
    },
    {
      "id": "lykneih",
      "author": "EmbracingTheWorld",
      "body": "I feel it, when I was on my weight lost journey that eventually turned into and ED all my coworkers were praising how much weight I lost etc. It felt really good, but I knew it was because of my ED that I was able to loose most of the weight so quick. None of my coworkers knew and now everyone at work is on a diet. They constantly ask me for tips and I just feel bad giving out any because of how I actually lost the weight.",
      "created_utc": 1732367574.0,
      "score": 12,
      "context": [
        {
          "id": "lyjq13w",
          "author": "runninginbubbles",
          "body": "I feel like everyone in my life is on some weight loss journey. It's horrible and very awkward when I walk in on people talking about their diets then they just go \"hey we're just talking about work\" \n\nI get they're trying to not discuss it in front of me but yea it still is hard.",
          "created_utc": 1732347546.0
        }
      ]
    },
    {
      "id": "lyp4efd",
      "author": "Thin-Use-5585",
      "body": "Awe oh no! That must be tough to manage. How long did you struggle with anorexia before getting type 1 diabetes? Do you think the anorexia messed up your body and made you get type 1?",
      "created_utc": 1732425809.0,
      "score": 1,
      "context": [
        {
          "id": "lyoep4t",
          "author": "Mahlisya",
          "body": "I had anorexia and now have diabetes type 1 and I actually need ozempic for my health and let me tell you it’s terrible.",
          "created_utc": 1732415043.0
        }
      ]
    },
    {
      "id": "lyr3e84",
      "author": "palmtrees007",
      "body": "I just started zepbound and it’s set up differently than ozempic. My goal is to just get to maintenance mode. I work out and eat super clean but PCOs has helped me gain 40 lbs and I feel gross all the time because of my hormones… I think there is a lot of misinformation out there .. I already feel like the food noise is quiet",
      "created_utc": 1732462544.0,
      "score": 3,
      "context": [
        {
          "id": "lyiz55k",
          "author": "cloudsongs_",
          "body": "I feel jealous too. But most of those people will need to take it for life or they’ll gain back most or all of their weight, if not more, once they’re off it. Unfortunate but that’s what the studies shiw",
          "created_utc": 1732333500.0
        }
      ]
    },
    {
      "id": "lym6y1h",
      "author": "bubblywaffo",
      "body": "heroine chic is 100000% coming back \n\nlook at the Kardashians. \nthey took out most of their plastic and are looking thinner and thinner.",
      "created_utc": 1732386976.0,
      "score": 14,
      "context": [
        {
          "id": "lykp9ob",
          "author": "cherrie_teaa",
          "body": "i feel the same way. i feel like the ozempic trend is encouraging that early 2000's ed era to make a comeback, which is really upsetting. it took me so long to love my body again, but seeing this stuff everywhere has caused me to take many steps back. it feels like an endless cycle atp :(",
          "created_utc": 1732368393.0
        }
      ]
    },
    {
      "id": "mjtvpve",
      "author": "None",
      "body": "For us fitness lovers, it also encourages people not to put in the work to maintain a fit physique, and some don’t even understand how the body work. You feel really good about yourself when you see your hard work paying off. ",
      "created_utc": 1742995658.0,
      "score": 2,
      "context": [
        {
          "id": "lykp9ob",
          "author": "cherrie_teaa",
          "body": "i feel the same way. i feel like the ozempic trend is encouraging that early 2000's ed era to make a comeback, which is really upsetting. it took me so long to love my body again, but seeing this stuff everywhere has caused me to take many steps back. it feels like an endless cycle atp :(",
          "created_utc": 1732368393.0
        }
      ]
    },
    {
      "id": "lyrd84c",
      "author": "kwumpus",
      "body": "Faster someone looses the weight the faster they are likely to put it back on.  The number one way to age- yo yo weight fluctuations",
      "created_utc": 1732465747.0,
      "score": 1,
      "context": [
        {
          "id": "lyju3uf",
          "author": "Golden_Amygdala",
          "body": "Yes I was on the verge of relapsing a few months ago (I had reached an unhealthily high weight and needed to loose some after having two babies and breastfeeding for basically 5 years straight) and then watching a colleague go on Ozempic was so triggering I’ve worked really hard to keep a balance and do this healthily but I absolutely want the extreme again and it’s a daily fight!",
          "created_utc": 1732350160.0
        }
      ]
    },
    {
      "id": "lykc9a4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1732361845.0,
      "score": 7,
      "context": [
        {
          "id": "lyjj9ad",
          "author": "Competitive-Match940",
          "body": "It’s not worth relapsing but i understand and have been in your shoes when the trend started. I felt awful about myself until I started reading how horrible these medications are for people who don’t need it and are abusing it and how bad the side effects are and it instantly changed my mind. It basically deteriorates your bones and muscles and ruins your stomach, that’s why so many people with ozempic have an almost “saggy” look. There’s a woman on tik tok named Amy and she was overweight and abused it so bad that she looks like she’s going to fall over, if you need a reason not to relapse look up her handles please. \n\nAlso the fact that people are literally abusing medication for people with diabetes and other health conditions is so nasty to me in itself. I wouldn’t be able to abuse a medication knowing that there could always end up being a shortage at any time and these people could die without it. Genuinely what’s next, is a study about insulin going to come out saying it’ll make you skinny and that’ll get taken away from the people who need it🫤",
          "created_utc": 1732343480.0
        }
      ]
    },
    {
      "id": "mk317kg",
      "author": "Signal_Singer8473",
      "body": "I’ve seen people who are 120 pounds getting on it to “lose that extra stubborn 20 pounds”. They’re sharing tips on lying about your BMI to online docs to get prescribed ozempic. It’s crazy what’s happening. It’s also very disordered, but no one cares it seems.",
      "created_utc": 1743113672.0,
      "score": 1,
      "context": [
        {
          "id": "lyjj9ad",
          "author": "Competitive-Match940",
          "body": "It’s not worth relapsing but i understand and have been in your shoes when the trend started. I felt awful about myself until I started reading how horrible these medications are for people who don’t need it and are abusing it and how bad the side effects are and it instantly changed my mind. It basically deteriorates your bones and muscles and ruins your stomach, that’s why so many people with ozempic have an almost “saggy” look. There’s a woman on tik tok named Amy and she was overweight and abused it so bad that she looks like she’s going to fall over, if you need a reason not to relapse look up her handles please. \n\nAlso the fact that people are literally abusing medication for people with diabetes and other health conditions is so nasty to me in itself. I wouldn’t be able to abuse a medication knowing that there could always end up being a shortage at any time and these people could die without it. Genuinely what’s next, is a study about insulin going to come out saying it’ll make you skinny and that’ll get taken away from the people who need it🫤",
          "created_utc": 1732343480.0
        }
      ]
    },
    {
      "id": "lyloaqq",
      "author": "misseviscerator",
      "body": "I’m a doctor and anecdotally seeing a lot more pancreatitis in patients who have started ozempic and have no other obvious cause (typically gallstones or alcohol). Obesity is a risk factor for pancreatitis but I was rarely seeing pancreatitis before in patients without aforementioned causes. It is also listed as an adverse effect.",
      "created_utc": 1732381046.0,
      "score": 12,
      "context": [
        {
          "id": "lykov4x",
          "author": "ThunderInMountains",
          "body": "Yes, it's triggering. I work in healthcare and keep hearing how it can trash the kidneys. It also won't work when you stop taking it. I'd hate to be on medication like that for years.",
          "created_utc": 1732368217.0
        }
      ]
    },
    {
      "id": "lyl0i1j",
      "author": "meatshoess",
      "body": "same here",
      "created_utc": 1732372899.0,
      "score": 3,
      "context": [
        {
          "id": "lyjkcea",
          "author": "whinywino89",
          "body": "I totally get this. My parents are on it and it’s insanely triggering.",
          "created_utc": 1732344117.0
        }
      ]
    },
    {
      "id": "lys3v8t",
      "author": "lull27",
      "body": "I’m on it too & if anything it’s actually helped my bulimia + binge eating massively. I obviously feel some people (who are suffering from Anorexia or Orthorexia and are already super thin) are abusing it because they may not need to stop BED or food noise, but for me it’s helped those a lot. I think people see it as another weight loss drug but I personally feel Tirzepatide in particular has a lot of health benefits.",
      "created_utc": 1732474119.0,
      "score": 3,
      "context": [
        {
          "id": "lylu52g",
          "author": "huuugggttfdf",
          "body": "I have mixed feelings right now because I have BED. When I'm fine I'm like fuck ozempic. But when I'm deep into behaviors I'm like I literally wouldn't be able to eat without feeling sick on ozempic and not only would I lose weight, I could kinda get my life back. When i see a commercial now its simultaneous rage and call to action kind of mood",
          "created_utc": 1732382938.0
        }
      ]
    },
    {
      "id": "lyw170i",
      "author": "Hot-Needleworker-450",
      "body": "Ozempic literally cured my BED. There's so much misinformation on this thread I don't even know where to start.",
      "created_utc": 1732533027.0,
      "score": 3,
      "context": [
        {
          "id": "lylu52g",
          "author": "huuugggttfdf",
          "body": "I have mixed feelings right now because I have BED. When I'm fine I'm like fuck ozempic. But when I'm deep into behaviors I'm like I literally wouldn't be able to eat without feeling sick on ozempic and not only would I lose weight, I could kinda get my life back. When i see a commercial now its simultaneous rage and call to action kind of mood",
          "created_utc": 1732382938.0
        }
      ]
    },
    {
      "id": "lynap1b",
      "author": "ygduf",
      "body": "Glp-1 helps my bed dramatically 🤷‍♂️",
      "created_utc": 1732400144.0,
      "score": 7,
      "context": [
        {
          "id": "lylu52g",
          "author": "huuugggttfdf",
          "body": "I have mixed feelings right now because I have BED. When I'm fine I'm like fuck ozempic. But when I'm deep into behaviors I'm like I literally wouldn't be able to eat without feeling sick on ozempic and not only would I lose weight, I could kinda get my life back. When i see a commercial now its simultaneous rage and call to action kind of mood",
          "created_utc": 1732382938.0
        }
      ]
    },
    {
      "id": "lymqv4q",
      "author": "teeeeelashev",
      "body": "Exactly how I feel too!",
      "created_utc": 1732393445.0,
      "score": 1,
      "context": [
        {
          "id": "lylu52g",
          "author": "huuugggttfdf",
          "body": "I have mixed feelings right now because I have BED. When I'm fine I'm like fuck ozempic. But when I'm deep into behaviors I'm like I literally wouldn't be able to eat without feeling sick on ozempic and not only would I lose weight, I could kinda get my life back. When i see a commercial now its simultaneous rage and call to action kind of mood",
          "created_utc": 1732382938.0
        }
      ]
    },
    {
      "id": "lyw1qnp",
      "author": "Hot-Needleworker-450",
      "body": "Ozempic is not a quick fix. Lipo is really the only quick fix out there, lol. Just like bariatric surgery, if you don't change your habits after starting it, you won't lose weight. The average person loses 10 lbs on Ozempic. The only thing it does is reduce your appetite which makes it easier to eat less. I lost 30 lbs on it because I was restricting so much and stopped taking it; lost another 35 and ended up UW. I lost more while off it than on. There is so much misinformation in this thread; so much \"I heard this from someone\" and I am begging you guys to read medical journals or articles from reputable sources",
      "created_utc": 1732533353.0,
      "score": 2,
      "context": [
        {
          "id": "lymk7cq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1732391221.0
        }
      ]
    },
    {
      "id": "lz09byv",
      "author": "satansbuttt666",
      "body": "\nI feel jealous of people on Ozempic. Having an ED, I went through a lot of suffering to lose the weight I did, and it feels like others are achieving that so much more easily. At the same time, I know Ozempic comes with its own set of challenges and side effects, so I try to keep that perspective in mind. I just try to remind myself that everyone’s journey is different, and we all face struggles in our own way blahblah blah",
      "created_utc": 1732585720.0,
      "score": 2,
      "context": [
        {
          "id": "lyyo5x9",
          "author": "Gally01fr",
          "body": "Yup. That really sucks...I am learning to make peace with it but for a good while, I really struggled with the \"unfairness\" of it.",
          "created_utc": 1732566639.0
        }
      ]
    },
    {
      "id": "lypymhi",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1732443649.0,
      "score": 0,
      "context": [
        {
          "id": "lyipjxi",
          "author": "Upset-Lavishness-522",
          "body": "For good or bad, these GLP-1s are here to stay. In the next couple of years the shots will be replaced by tablets, which will make them even more available.",
          "created_utc": 1732329486.0
        },
        {
          "id": "lyjfpwd",
          "author": "SusieQu1885",
          "body": "Yup and will eventually be cheaper and affordable. I’ve seen it happen with the new blood thinners. They use to be sooooo expensive and now are being covered by insurance in Europe",
          "created_utc": 1732341499.0
        }
      ]
    },
    {
      "id": "mmq9udx",
      "author": "Upset-Lavishness-522",
      "body": "Weekly tablets are unlikely.  There is one (i believe) tablet out there now for T2. There are a ton of non-FDA regulated tankers for weight loss  floating around too.",
      "created_utc": 1744464399.0,
      "score": 1,
      "context": [
        {
          "id": "lyipjxi",
          "author": "Upset-Lavishness-522",
          "body": "For good or bad, these GLP-1s are here to stay. In the next couple of years the shots will be replaced by tablets, which will make them even more available.",
          "created_utc": 1732329486.0
        },
        {
          "id": "mmp0v7s",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1744440022.0
        }
      ]
    },
    {
      "id": "ml0imb4",
      "author": "Slytherin_Sniped",
      "body": "Going through the same thing. Metabolic syndrome, PCOS and now type 2 diabetic. I just started ozempic yesterday. I’ve always been active but a viscous cycle of gain loss gain loss :( I had an eating disorder growing up but was always active in sports. It sucks as an adult now and no weight is melting.",
      "created_utc": 1743597524.0,
      "score": 1,
      "context": [
        {
          "id": "lyj2a81",
          "author": "musicandmentalhealth",
          "body": "Yes. It’s so hard to stay in recovery and not fall prey to ozempic. I keep reminding myself of the side effects and my recovery and it helps but it’s still hard.",
          "created_utc": 1732334877.0
        },
        {
          "id": "lyr2nk8",
          "author": "palmtrees007",
          "body": "Ok not ranting or going hard for these drugs but I just started zepbound because I was always healthy weight but PCOS has messed up my endocrine system. I workout 6 days a week and eat clean and not a lb shed and carrying 40 extra lbs. everything has side effects but ozempic is very abrasive and people are taking it for wrong reasons. I know someone getting it under table who has already gotten sick. I had to have my panels done in order to get my meds prescribed",
          "created_utc": 1732462293.0
        }
      ]
    },
    {
      "id": "lyki288",
      "author": "etwichell",
      "body": "Horrible pain all over my body, I couldn't really walk, and really, really, bad dizziness. Brain health wise, panic attacks and depression.",
      "created_utc": 1732365040.0,
      "score": 65,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyk6d9f",
          "author": "IconicThings",
          "body": "what were the side effects for you?",
          "created_utc": 1732358193.0
        }
      ]
    },
    {
      "id": "lytswq5",
      "author": "veronicatandy",
      "body": "my brothers friend took one dose and was hospitalized for months bc it caused some sort of serious complications (she explained it all once but I can't remember exactly what it was and I dont want to repeat it if it's incorrect, but she absolutely was on deaths door in the hospital for months)",
      "created_utc": 1732493672.0,
      "score": 1,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyk6d9f",
          "author": "IconicThings",
          "body": "what were the side effects for you?",
          "created_utc": 1732358193.0
        }
      ]
    },
    {
      "id": "mrvmn7d",
      "author": "Lost-friend-ship",
      "body": ">Also it’s so easy to get.\n\nYou keep saying that but even people who need it for diabetes have struggled. In what world is it easy to get?",
      "created_utc": 1747035589.0,
      "score": 1,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyttlnf",
          "author": "Present_Deal_1180",
          "body": "I tried the injection. I don’t need it but yk that’s just a part of eating disorders!! Also it’s so easy to get. Anyway I did the injection for two weeks (total two injections). First week I was fine. The second week I got sooooo sick. I was dizzy, nauseous, fatigued, awful. I know it’s hard. Trust me. I’ve had an ED for the past 10 or so years and I just started seeing a professional about 8 months ago. It’s tough. But we (physically and mentally) shouldn’t take these things unless prescribed/recommended by a doctor. I know it’s easy to get but please take care of yourselves!",
          "created_utc": 1732493915.0
        }
      ]
    },
    {
      "id": "mjtuyub",
      "author": "None",
      "body": "Sorry but weight is lost based on calories being burned vs what is being eaten.  So technically all your gym time is meaningless if you’re still eating more calories than you burn.  If you find your bmr and combine it with you tdee and eat under those amounts, you will lose weight naturally. ",
      "created_utc": 1742995395.0,
      "score": 1,
      "context": [
        {
          "id": "lyioqcf",
          "author": "alienprincess111",
          "body": "Yes.  I hate seeing people on it lose weight, and brag about it constantly on top of it.",
          "created_utc": 1732329151.0
        },
        {
          "id": "lyr31to",
          "author": "palmtrees007",
          "body": "Fitness gym girlie here who’s been working out like crazy for years and not losing weight. I just got on one the has a different compound then ozempic. It’s for insulin resistant non diabetic people like me who if I have a tiny piece of candy, my stomach gets inflammed .. I’ll always be transparent about my journey. Our food is filled with additives so our hormones are wrecked and I needed to lose weight I look normal size but my blood pressure is high and bmi is 36.",
          "created_utc": 1732462426.0
        }
      ]
    },
    {
      "id": "lyle1yq",
      "author": "Rude-Iron-369",
      "body": "Exactly the same position I was in lmfao. Just fueled it more tbh",
      "created_utc": 1732377679.0,
      "score": 3,
      "context": [
        {
          "id": "lyjq13w",
          "author": "runninginbubbles",
          "body": "I feel like everyone in my life is on some weight loss journey. It's horrible and very awkward when I walk in on people talking about their diets then they just go \"hey we're just talking about work\" \n\nI get they're trying to not discuss it in front of me but yea it still is hard.",
          "created_utc": 1732347546.0
        },
        {
          "id": "lykneih",
          "author": "EmbracingTheWorld",
          "body": "I feel it, when I was on my weight lost journey that eventually turned into and ED all my coworkers were praising how much weight I lost etc. It felt really good, but I knew it was because of my ED that I was able to loose most of the weight so quick. None of my coworkers knew and now everyone at work is on a diet. They constantly ask me for tips and I just feel bad giving out any because of how I actually lost the weight.",
          "created_utc": 1732367574.0
        }
      ]
    },
    {
      "id": "lypnqb3",
      "author": "Mahlisya",
      "body": "More than 15 years. Yes I do think it’s related, but the doctors told me you can never know for sure.",
      "created_utc": 1732436732.0,
      "score": 2,
      "context": [
        {
          "id": "lyoep4t",
          "author": "Mahlisya",
          "body": "I had anorexia and now have diabetes type 1 and I actually need ozempic for my health and let me tell you it’s terrible.",
          "created_utc": 1732415043.0
        },
        {
          "id": "lyp4efd",
          "author": "Thin-Use-5585",
          "body": "Awe oh no! That must be tough to manage. How long did you struggle with anorexia before getting type 1 diabetes? Do you think the anorexia messed up your body and made you get type 1?",
          "created_utc": 1732425809.0
        }
      ]
    },
    {
      "id": "lys32f5",
      "author": "lull27",
      "body": "I’m on it too & if anything it’s actually helped my bulimia + binge eating massively. I obviously feel some people (who are suffering from Anorexia or Orthorexia and are already super thin) are abusing it because they may not need to stop BED or food noise, but for me it’s helped those a lot. I think people see it as another weight loss drug but I personally feel Tirzepatide has a lot of health benefits.",
      "created_utc": 1732473880.0,
      "score": 6,
      "context": [
        {
          "id": "lyiz55k",
          "author": "cloudsongs_",
          "body": "I feel jealous too. But most of those people will need to take it for life or they’ll gain back most or all of their weight, if not more, once they’re off it. Unfortunate but that’s what the studies shiw",
          "created_utc": 1732333500.0
        },
        {
          "id": "lyr3e84",
          "author": "palmtrees007",
          "body": "I just started zepbound and it’s set up differently than ozempic. My goal is to just get to maintenance mode. I work out and eat super clean but PCOs has helped me gain 40 lbs and I feel gross all the time because of my hormones… I think there is a lot of misinformation out there .. I already feel like the food noise is quiet",
          "created_utc": 1732462544.0
        }
      ]
    },
    {
      "id": "mjx5zhb",
      "author": "cherrie_teaa",
      "body": "I agree!",
      "created_utc": 1743030657.0,
      "score": 1,
      "context": [
        {
          "id": "lykp9ob",
          "author": "cherrie_teaa",
          "body": "i feel the same way. i feel like the ozempic trend is encouraging that early 2000's ed era to make a comeback, which is really upsetting. it took me so long to love my body again, but seeing this stuff everywhere has caused me to take many steps back. it feels like an endless cycle atp :(",
          "created_utc": 1732368393.0
        },
        {
          "id": "mjtvpve",
          "author": "None",
          "body": "For us fitness lovers, it also encourages people not to put in the work to maintain a fit physique, and some don’t even understand how the body work. You feel really good about yourself when you see your hard work paying off. ",
          "created_utc": 1742995658.0
        }
      ]
    },
    {
      "id": "lyklilc",
      "author": "None",
      "body": "Just bc drs prescribe something doesn't mean it's not being abused, espc with newer meds- ppl thought if they were prescribed opiates they weren't abusing them, without any idea of the payouts the drs and others in big pharma were getting for the over prescription of opiates. Doctors are people too and not infallible. I'm not saying there's 0 cases it's being used to prevent diabetes, but a LOT of ppl see it as an easy and popular new weight loss option and I don't think all drs care enough to differentiate bw ppl who want it for that vs actually need it for diabetes prevention...",
      "created_utc": 1732366718.0,
      "score": 11,
      "context": [
        {
          "id": "lyjj9ad",
          "author": "Competitive-Match940",
          "body": "It’s not worth relapsing but i understand and have been in your shoes when the trend started. I felt awful about myself until I started reading how horrible these medications are for people who don’t need it and are abusing it and how bad the side effects are and it instantly changed my mind. It basically deteriorates your bones and muscles and ruins your stomach, that’s why so many people with ozempic have an almost “saggy” look. There’s a woman on tik tok named Amy and she was overweight and abused it so bad that she looks like she’s going to fall over, if you need a reason not to relapse look up her handles please. \n\nAlso the fact that people are literally abusing medication for people with diabetes and other health conditions is so nasty to me in itself. I wouldn’t be able to abuse a medication knowing that there could always end up being a shortage at any time and these people could die without it. Genuinely what’s next, is a study about insulin going to come out saying it’ll make you skinny and that’ll get taken away from the people who need it🫤",
          "created_utc": 1732343480.0
        },
        {
          "id": "lykc9a4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1732361845.0
        }
      ]
    },
    {
      "id": "lyow1uc",
      "author": "911pleasehold",
      "body": "It helps me too. If you would genuinely benefit from it, why shy away from it? There are side effects, yes, but there are also side effects from being overweight for extended periods of time. I could have never conquered my BED without it. Never. I tried for 20 years. Don’t care if that makes me “weak” because I know I’m healthier now 🌻\n\nKeep an open mind - as long as you are truly a candidate for it",
      "created_utc": 1732421998.0,
      "score": 3,
      "context": [
        {
          "id": "lylu52g",
          "author": "huuugggttfdf",
          "body": "I have mixed feelings right now because I have BED. When I'm fine I'm like fuck ozempic. But when I'm deep into behaviors I'm like I literally wouldn't be able to eat without feeling sick on ozempic and not only would I lose weight, I could kinda get my life back. When i see a commercial now its simultaneous rage and call to action kind of mood",
          "created_utc": 1732382938.0
        },
        {
          "id": "lynap1b",
          "author": "ygduf",
          "body": "Glp-1 helps my bed dramatically 🤷‍♂️",
          "created_utc": 1732400144.0
        }
      ]
    },
    {
      "id": "lyrlv6r",
      "author": "How-I-Roll_2023",
      "body": "Formularies are not universal.  🙄",
      "created_utc": 1732468474.0,
      "score": 0,
      "context": [
        {
          "id": "lyipjxi",
          "author": "Upset-Lavishness-522",
          "body": "For good or bad, these GLP-1s are here to stay. In the next couple of years the shots will be replaced by tablets, which will make them even more available.",
          "created_utc": 1732329486.0
        },
        {
          "id": "lyjfpwd",
          "author": "SusieQu1885",
          "body": "Yup and will eventually be cheaper and affordable. I’ve seen it happen with the new blood thinners. They use to be sooooo expensive and now are being covered by insurance in Europe",
          "created_utc": 1732341499.0
        },
        {
          "id": "lypymhi",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1732443649.0
        }
      ]
    },
    {
      "id": "ml1bunz",
      "author": "palmtrees007",
      "body": "I am happy to report months later after posting that that I’ve lost a good amount of weight, in a heathy way. Down two pant sizes! It works",
      "created_utc": 1743607353.0,
      "score": 1,
      "context": [
        {
          "id": "lyj2a81",
          "author": "musicandmentalhealth",
          "body": "Yes. It’s so hard to stay in recovery and not fall prey to ozempic. I keep reminding myself of the side effects and my recovery and it helps but it’s still hard.",
          "created_utc": 1732334877.0
        },
        {
          "id": "lyr2nk8",
          "author": "palmtrees007",
          "body": "Ok not ranting or going hard for these drugs but I just started zepbound because I was always healthy weight but PCOS has messed up my endocrine system. I workout 6 days a week and eat clean and not a lb shed and carrying 40 extra lbs. everything has side effects but ozempic is very abrasive and people are taking it for wrong reasons. I know someone getting it under table who has already gotten sick. I had to have my panels done in order to get my meds prescribed",
          "created_utc": 1732462293.0
        },
        {
          "id": "ml0imb4",
          "author": "Slytherin_Sniped",
          "body": "Going through the same thing. Metabolic syndrome, PCOS and now type 2 diabetic. I just started ozempic yesterday. I’ve always been active but a viscous cycle of gain loss gain loss :( I had an eating disorder growing up but was always active in sports. It sucks as an adult now and no weight is melting.",
          "created_utc": 1743597524.0
        }
      ]
    },
    {
      "id": "lyn1x2u",
      "author": "Aromatic_Note8944",
      "body": "I took it too and it’s horrible, I don’t know how people deal with the side effects",
      "created_utc": 1732397143.0,
      "score": 21,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyk6d9f",
          "author": "IconicThings",
          "body": "what were the side effects for you?",
          "created_utc": 1732358193.0
        },
        {
          "id": "lyki288",
          "author": "etwichell",
          "body": "Horrible pain all over my body, I couldn't really walk, and really, really, bad dizziness. Brain health wise, panic attacks and depression.",
          "created_utc": 1732365040.0
        }
      ]
    },
    {
      "id": "lyqfo0w",
      "author": "grapesandcake",
      "body": "I tried to get it prescribed for my binge eating but was told I can’t have it due to having a history of depression.",
      "created_utc": 1732453378.0,
      "score": 3,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyk6d9f",
          "author": "IconicThings",
          "body": "what were the side effects for you?",
          "created_utc": 1732358193.0
        },
        {
          "id": "lyki288",
          "author": "etwichell",
          "body": "Horrible pain all over my body, I couldn't really walk, and really, really, bad dizziness. Brain health wise, panic attacks and depression.",
          "created_utc": 1732365040.0
        }
      ]
    },
    {
      "id": "mjtw3st",
      "author": "palmtrees007",
      "body": "Hi there I’ve tried that.. my ex was a trainer. My TDEE was about 1700 a day when I’m working out at the rate I was working out. Sometimes I would do 1600-1700 because I do the plated method so I can get full with veggies and protein and the right fats/ carbs for me…\n\nI would see inches come off but not weight. Went to Dr and she checked my insulin resistance and my score was through the roof. It’s not diabetes it’s literally my body working against me\n\nIf you google PCOS, it explains it more. I’ve had Drs tell me too it’s very hard to lose weight with PCOS. I was always healthy and fit so I knew something was up\n\nAt first my ex didn’t believe me and then his friends sister told us she had the same issue and what worked for her was a high protein diet and some other tweaks and he understood better because she was always tiny and had gained weight out of nowhere",
      "created_utc": 1742995791.0,
      "score": 1,
      "context": [
        {
          "id": "lyioqcf",
          "author": "alienprincess111",
          "body": "Yes.  I hate seeing people on it lose weight, and brag about it constantly on top of it.",
          "created_utc": 1732329151.0
        },
        {
          "id": "lyr31to",
          "author": "palmtrees007",
          "body": "Fitness gym girlie here who’s been working out like crazy for years and not losing weight. I just got on one the has a different compound then ozempic. It’s for insulin resistant non diabetic people like me who if I have a tiny piece of candy, my stomach gets inflammed .. I’ll always be transparent about my journey. Our food is filled with additives so our hormones are wrecked and I needed to lose weight I look normal size but my blood pressure is high and bmi is 36.",
          "created_utc": 1732462426.0
        },
        {
          "id": "mjtuyub",
          "author": "None",
          "body": "Sorry but weight is lost based on calories being burned vs what is being eaten.  So technically all your gym time is meaningless if you’re still eating more calories than you burn.  If you find your bmr and combine it with you tdee and eat under those amounts, you will lose weight naturally. ",
          "created_utc": 1742995395.0
        }
      ]
    },
    {
      "id": "mjtwr6g",
      "author": "palmtrees007",
      "body": "I’m doing the same workouts eating my same diet and now finally down 25 lbs so the medicine is a tool",
      "created_utc": 1742996018.0,
      "score": 1,
      "context": [
        {
          "id": "lyioqcf",
          "author": "alienprincess111",
          "body": "Yes.  I hate seeing people on it lose weight, and brag about it constantly on top of it.",
          "created_utc": 1732329151.0
        },
        {
          "id": "lyr31to",
          "author": "palmtrees007",
          "body": "Fitness gym girlie here who’s been working out like crazy for years and not losing weight. I just got on one the has a different compound then ozempic. It’s for insulin resistant non diabetic people like me who if I have a tiny piece of candy, my stomach gets inflammed .. I’ll always be transparent about my journey. Our food is filled with additives so our hormones are wrecked and I needed to lose weight I look normal size but my blood pressure is high and bmi is 36.",
          "created_utc": 1732462426.0
        },
        {
          "id": "mjtuyub",
          "author": "None",
          "body": "Sorry but weight is lost based on calories being burned vs what is being eaten.  So technically all your gym time is meaningless if you’re still eating more calories than you burn.  If you find your bmr and combine it with you tdee and eat under those amounts, you will lose weight naturally. ",
          "created_utc": 1742995395.0
        }
      ]
    },
    {
      "id": "lyov2n9",
      "author": "911pleasehold",
      "body": "With a zofran prescription and time. Your body does eventually adjust and it is worth feeling sick af for a few months if your ED is BED, tbh. I’ll take it forever if I can",
      "created_utc": 1732421573.0,
      "score": 19,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyk6d9f",
          "author": "IconicThings",
          "body": "what were the side effects for you?",
          "created_utc": 1732358193.0
        },
        {
          "id": "lyki288",
          "author": "etwichell",
          "body": "Horrible pain all over my body, I couldn't really walk, and really, really, bad dizziness. Brain health wise, panic attacks and depression.",
          "created_utc": 1732365040.0
        },
        {
          "id": "lyn1x2u",
          "author": "Aromatic_Note8944",
          "body": "I took it too and it’s horrible, I don’t know how people deal with the side effects",
          "created_utc": 1732397143.0
        }
      ]
    },
    {
      "id": "lyofcun",
      "author": "aubbzz",
      "body": "I’m on week 4 & have no side effects",
      "created_utc": 1732415299.0,
      "score": 5,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyk6d9f",
          "author": "IconicThings",
          "body": "what were the side effects for you?",
          "created_utc": 1732358193.0
        },
        {
          "id": "lyki288",
          "author": "etwichell",
          "body": "Horrible pain all over my body, I couldn't really walk, and really, really, bad dizziness. Brain health wise, panic attacks and depression.",
          "created_utc": 1732365040.0
        },
        {
          "id": "lyn1x2u",
          "author": "Aromatic_Note8944",
          "body": "I took it too and it’s horrible, I don’t know how people deal with the side effects",
          "created_utc": 1732397143.0
        }
      ]
    },
    {
      "id": "lyvy7hy",
      "author": "feliciahardys",
      "body": "That’s wild. I have a history of depression and I was able to get a prescription (compounded, of course but still).",
      "created_utc": 1732531184.0,
      "score": 2,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyk6d9f",
          "author": "IconicThings",
          "body": "what were the side effects for you?",
          "created_utc": 1732358193.0
        },
        {
          "id": "lyki288",
          "author": "etwichell",
          "body": "Horrible pain all over my body, I couldn't really walk, and really, really, bad dizziness. Brain health wise, panic attacks and depression.",
          "created_utc": 1732365040.0
        },
        {
          "id": "lyqfo0w",
          "author": "grapesandcake",
          "body": "I tried to get it prescribed for my binge eating but was told I can’t have it due to having a history of depression.",
          "created_utc": 1732453378.0
        }
      ]
    },
    {
      "id": "mrvmtd2",
      "author": "Lost-friend-ship",
      "body": "As someone who restricted heavily for many years, yeah I feel like just eating a small amount normally makes me gain weight. I have to be starving and sick for anything to change ",
      "created_utc": 1747035698.0,
      "score": 1,
      "context": [
        {
          "id": "lyioqcf",
          "author": "alienprincess111",
          "body": "Yes.  I hate seeing people on it lose weight, and brag about it constantly on top of it.",
          "created_utc": 1732329151.0
        },
        {
          "id": "lyr31to",
          "author": "palmtrees007",
          "body": "Fitness gym girlie here who’s been working out like crazy for years and not losing weight. I just got on one the has a different compound then ozempic. It’s for insulin resistant non diabetic people like me who if I have a tiny piece of candy, my stomach gets inflammed .. I’ll always be transparent about my journey. Our food is filled with additives so our hormones are wrecked and I needed to lose weight I look normal size but my blood pressure is high and bmi is 36.",
          "created_utc": 1732462426.0
        },
        {
          "id": "mjtuyub",
          "author": "None",
          "body": "Sorry but weight is lost based on calories being burned vs what is being eaten.  So technically all your gym time is meaningless if you’re still eating more calories than you burn.  If you find your bmr and combine it with you tdee and eat under those amounts, you will lose weight naturally. ",
          "created_utc": 1742995395.0
        },
        {
          "id": "mjtwr6g",
          "author": "palmtrees007",
          "body": "I’m doing the same workouts eating my same diet and now finally down 25 lbs so the medicine is a tool",
          "created_utc": 1742996018.0
        }
      ]
    },
    {
      "id": "lyoldur",
      "author": "Useful-Bicycle",
      "body": "Are you on a lower than normal dose? I’ve been hearing of people with normal BMIs getting it compounded into “microdoses”",
      "created_utc": 1732417639.0,
      "score": 5,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyk6d9f",
          "author": "IconicThings",
          "body": "what were the side effects for you?",
          "created_utc": 1732358193.0
        },
        {
          "id": "lyki288",
          "author": "etwichell",
          "body": "Horrible pain all over my body, I couldn't really walk, and really, really, bad dizziness. Brain health wise, panic attacks and depression.",
          "created_utc": 1732365040.0
        },
        {
          "id": "lyn1x2u",
          "author": "Aromatic_Note8944",
          "body": "I took it too and it’s horrible, I don’t know how people deal with the side effects",
          "created_utc": 1732397143.0
        },
        {
          "id": "lyofcun",
          "author": "aubbzz",
          "body": "I’m on week 4 & have no side effects",
          "created_utc": 1732415299.0
        }
      ]
    },
    {
      "id": "lywfxkh",
      "author": "grapesandcake",
      "body": "That’s so odd. Was the prescribing organisation able to monitor your mood? Also, what do you mean by the word compounded?",
      "created_utc": 1732540446.0,
      "score": 3,
      "context": [
        {
          "id": "lyirg8g",
          "author": "etwichell",
          "body": "Don't feel bad. I took ONE shot of it and the side effects were God awful. But I understand where you're coming from.",
          "created_utc": 1732330260.0
        },
        {
          "id": "lyk6d9f",
          "author": "IconicThings",
          "body": "what were the side effects for you?",
          "created_utc": 1732358193.0
        },
        {
          "id": "lyki288",
          "author": "etwichell",
          "body": "Horrible pain all over my body, I couldn't really walk, and really, really, bad dizziness. Brain health wise, panic attacks and depression.",
          "created_utc": 1732365040.0
        },
        {
          "id": "lyqfo0w",
          "author": "grapesandcake",
          "body": "I tried to get it prescribed for my binge eating but was told I can’t have it due to having a history of depression.",
          "created_utc": 1732453378.0
        },
        {
          "id": "lyvy7hy",
          "author": "feliciahardys",
          "body": "That’s wild. I have a history of depression and I was able to get a prescription (compounded, of course but still).",
          "created_utc": 1732531184.0
        }
      ]
    }
  ]
}