{
  "id": "1gzre47",
  "subreddit": "EatingDisorders",
  "author": "ProfessionProof5284",
  "created_utc": 1732562780.0,
  "title": "Eating Disorders are NOT friends.",
  "selftext": "I was so very ill. For over 2 decades I've fought a severe and enduring illness.  I've died twice.  I've been hospitalised copious amounts of times. I let the illness control me.\n\nSo many battles and set backs during my struggles. \nNO MORE. My struggles have become my strengths. \n\n\nI promised my Granny on her death bed that I would heal, get healthy, be happy and stay consistent. And this year I've did that. All by myself. With great determination and a positive mental attitude.  Cutting the things and people who dragged me down and kept me back OUT of my life and surrounding myself with real friends.\n\nFrom taking myself away and working so hard every single day. \n\nNO days off.   I endured and still endure discomfort and tough days but I dont give up or give in to the illnes.\n. \n\nEvery night I go to bed knowing I've achieved my best.\n\n\nI am NOT my E.D or the bad things that happened to me.\n\nI am my own boss. My own leader.  My own healer and my own HERO.  I get to write the rest of my life . Not this monstrous illness that only wants to control then kill me.\n\n\nEating Disorders are NOT our friends.\n\n\nWhat kind of friend would make you starve yourself. Deprive you from food?\n\nWhat kind of friend would make you push everything and everyone you love away and isolate you?\n\n What kind of friend would make you so weak and depressed you loose all motivation? \n\nWhat kind of friend would debilitate your life and stop you from being able to do all the things you want to do and love? \n\nWhat kind of friend would consume you and put you in hospital fighting for your life? \n\nWhat kind of friend would try and KILL you? \n\nEating Disorders are NOT our friends.\n\n Eating Disorders are severe and enduring mental illnesses with the highest mortality rate of ALL mental illnesses yet still seem to be the most misunderstood and stigmatised illness. \nNo 2 Eating Disorders are the same. \nSo many people both female and male are suffering in silence right now because Eating Disorders are so often disregarded and not given the correct attention, help, treatment and care. This NEEDS TO CHANGE!!!!\n\n\nMore needs to be done to raise awareness and highlight Eating Disorders in this day and age and HELP sufferers. \n\n\nIt's time to STOP letting people die. It's time to actually put in place the correct Education, Treatment ,Care , Help, support,  resources and Safe Spaces to talk. \n \n\nI personally have lost 3 friends to this illness. One being Nikki Grahame.  This cruel illness that is a living hell and causes so many secondary illnesses.  This illness is so powerful. This illness is agonising. Torture. So painful. So cruel. So dangerous. \n\n\nI am so proud of my achievement and strength, my willpower and determination to get where I am and continue to become better each day with consistency, patience , endurance and self belief.  But i'm not stupid,  I know how severe this illness is.  I know how hard I have to work just to live my life and continue to be on the right side of health.  In control.\n\n Recovery is NOT linear. \n\nThe only way out is through.  We must fight it. We must highlight it. We must raise awareness.  We must receive better care. \n\nTo all my fellow sufferers out there , you are not alone. Please hear my words. Please do not suffer in silence.\n\n You are ment to live , not just survive. I stand with you in my constant pursuit of raising awareness and highlighting this illness. The FACTS,  not the misconstrued judgement or how it's cast in the WRONG light. I want to educate people and break the stigma. I want us all to heal.  \n\nWe must ' FEEL TO HEAL'   - A very special person once told me that and it's stayed with me since.\n\n\nAs humans we must feel,  we must communicate our problems. We must remember that our health is our wealth.   Please reach out. Please remember that you matter. You are not alone. Please don't let ignorance deter you from speaking out and Please remember...\n\n\nEating Disorders are NOT our friends.  ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1gzre47/eating_disorders_are_not_friends/",
  "score": 80,
  "num_comments": 17,
  "comments": [
    {
      "id": "lyywrcu",
      "author": "bsunflowers28",
      "body": "Incredibly proud of you! Feel to heal is such an important reminder. This was a super touching post, your journey to kindness to yourself, to recovery is one to be proud of. I hope you have the nicest of days and stay just as kind to yourself 💜",
      "created_utc": 1732569265.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lz01qv4",
      "author": "runninginbubbles",
      "body": "You knew Nikki Grahame?!?! 😍😍",
      "created_utc": 1732583042.0,
      "score": 4,
      "context": []
    },
    {
      "id": "lz1slnk",
      "author": "Desperate_Air370",
      "body": "Such a touching words, well written thoughts that are 100% true. I am so very proud of you and thankful for your writing - this is a reminder I really needed & words and questions I needed to stop at and think about the answers.\n♥️",
      "created_utc": 1732612261.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lz7l6mi",
      "author": "CycleEquivalent7782",
      "body": "So proud of you!! I know it’s been commented so many times but it’s true!! We are all proud of you!! I hope your journey keeps going up, sending my love ❤️",
      "created_utc": 1732692919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lzvtcrz",
      "author": "Responsible-Bench543",
      "body": "I needed to read this today, I always feel so alone in my struggles with an ED and it isn’t talked about enough. I agree with everything you’ve said here and I send you all of my love and strength. ",
      "created_utc": 1733067917.0,
      "score": 2,
      "context": []
    },
    {
      "id": "lz47iei",
      "author": "ProfessionProof5284",
      "body": "Well said.  It's the feeling when you feel so out of control.  That you can't control anything around you . Or someone has taken control away from you.  One thing you can control is your body. \nOr should I say anorexia does that. \n\nAnorexia and eating disorders like to creep in strong when you are weak and vunderable also.  Like a friend would.  Being all like ' hey you got me, I'm still here to turn too  '  when really they aren't friends at all.",
      "created_utc": 1732646727.0,
      "score": 1,
      "context": []
    },
    {
      "id": "lz1hnl7",
      "author": "None",
      "body": "I’ve never considered it my friend, I’ve always been confused about why people say this",
      "created_utc": 1732605139.0,
      "score": 0,
      "context": []
    },
    {
      "id": "lyyxbm1",
      "author": "ProfessionProof5284",
      "body": "Aw thankyou so much ♥️ I really appreciate your kind words 🥰 Sending lots of love to you. May our struggles continue to become our strengths 💜",
      "created_utc": 1732569436.0,
      "score": 3,
      "context": [
        {
          "id": "lyywrcu",
          "author": "bsunflowers28",
          "body": "Incredibly proud of you! Feel to heal is such an important reminder. This was a super touching post, your journey to kindness to yourself, to recovery is one to be proud of. I hope you have the nicest of days and stay just as kind to yourself 💜",
          "created_utc": 1732569265.0
        }
      ]
    },
    {
      "id": "lz05hiw",
      "author": "ProfessionProof5284",
      "body": "I did. We lived together in London for a while many years ago and became really good friends way before she ever went into Big Brother.  She loved the show so much and it was her dream to be on it ♥️\n\nCan you believe she applied 3 times at first . 2 times she disclosed she had had an eating disorder and was rejected . The 3rd time she didn't disclose it and was practically fast tracked onto the show. \n\nWhich always made me think .. discrimination much!!!  They allow recovering /  recovered addicts be on the show where there's alcohol every night. \n\nI miss her dearly. She was the exact same person in real life that everyone saw on TV . She was a sweetheart and should still be here 🥺\n The pandemic messed up her whole routine , making her trapped in her flat and unable to use the gym and meet up with friends to socialise which was imperative to Nikki and her wellbeing. \n\nI take comfort in knowing she achieved her dream and more. Even flying to Canada to appear on it's Big Brother after gainning fame... but it always hurts and always will hurt my heart missing her 💔 RIP my sweet Angel x",
      "created_utc": 1732584373.0,
      "score": 3,
      "context": [
        {
          "id": "lz01qv4",
          "author": "runninginbubbles",
          "body": "You knew Nikki Grahame?!?! 😍😍",
          "created_utc": 1732583042.0
        }
      ]
    },
    {
      "id": "lz2j3t5",
      "author": "ProfessionProof5284",
      "body": "♥️ sending lots of love to you ♥️ Thankyou for your kind words .. I wish nothing but happiness to you ♥️ remember Eating Disorders are not our friends.   I'm always here if you need a friend though ♥️",
      "created_utc": 1732627053.0,
      "score": 2,
      "context": [
        {
          "id": "lz1slnk",
          "author": "Desperate_Air370",
          "body": "Such a touching words, well written thoughts that are 100% true. I am so very proud of you and thankful for your writing - this is a reminder I really needed & words and questions I needed to stop at and think about the answers.\n♥️",
          "created_utc": 1732612261.0
        }
      ]
    },
    {
      "id": "lz8v2vq",
      "author": "ProfessionProof5284",
      "body": "Thankyou so much ♥️ sending all my love right back to you.  * hugs *  xo",
      "created_utc": 1732717595.0,
      "score": 2,
      "context": [
        {
          "id": "lz7l6mi",
          "author": "CycleEquivalent7782",
          "body": "So proud of you!! I know it’s been commented so many times but it’s true!! We are all proud of you!! I hope your journey keeps going up, sending my love ❤️",
          "created_utc": 1732692919.0
        }
      ]
    },
    {
      "id": "lzvtxgk",
      "author": "ProfessionProof5284",
      "body": "Sending love right back to you mlovely ♥️ please know you are not alone. Never. Not whilst i grace this earth.  *big hugs*  xoxo",
      "created_utc": 1733068113.0,
      "score": 1,
      "context": [
        {
          "id": "lzvtcrz",
          "author": "Responsible-Bench543",
          "body": "I needed to read this today, I always feel so alone in my struggles with an ED and it isn’t talked about enough. I agree with everything you’ve said here and I send you all of my love and strength. ",
          "created_utc": 1733067917.0
        }
      ]
    },
    {
      "id": "lz3wjvi",
      "author": "61114311536123511",
      "body": "a lot of people take great comfort in their eating disorders, not necessarily because it's *nice* but because it's familiar. And because it's a way to like uhhh, disconnect from your life? Opt out? Can't think of the words rn. So it can feel like an old friend or like ol reliable to some.",
      "created_utc": 1732643427.0,
      "score": 3,
      "context": [
        {
          "id": "lz1hnl7",
          "author": "None",
          "body": "I’ve never considered it my friend, I’ve always been confused about why people say this",
          "created_utc": 1732605139.0
        }
      ]
    },
    {
      "id": "lz2jbyc",
      "author": "ProfessionProof5284",
      "body": "No 2 eating disorders are the same. Your confusion should not invalidate others feelings. This is part of the problem.",
      "created_utc": 1732627147.0,
      "score": 0,
      "context": [
        {
          "id": "lz1hnl7",
          "author": "None",
          "body": "I’ve never considered it my friend, I’ve always been confused about why people say this",
          "created_utc": 1732605139.0
        }
      ]
    },
    {
      "id": "lz3d0up",
      "author": "Desperate_Air370",
      "body": "♥️🫶🏻",
      "created_utc": 1732637472.0,
      "score": 2,
      "context": [
        {
          "id": "lz1slnk",
          "author": "Desperate_Air370",
          "body": "Such a touching words, well written thoughts that are 100% true. I am so very proud of you and thankful for your writing - this is a reminder I really needed & words and questions I needed to stop at and think about the answers.\n♥️",
          "created_utc": 1732612261.0
        },
        {
          "id": "lz2j3t5",
          "author": "ProfessionProof5284",
          "body": "♥️ sending lots of love to you ♥️ Thankyou for your kind words .. I wish nothing but happiness to you ♥️ remember Eating Disorders are not our friends.   I'm always here if you need a friend though ♥️",
          "created_utc": 1732627053.0
        }
      ]
    },
    {
      "id": "m9cc1bc",
      "author": "Bulky-Slip430",
      "body": "Thank you so much. I'm finally recovering after being sick for 30y.\nIt is very hard, but I WILL overcome this.",
      "created_utc": 1737928781.0,
      "score": 2,
      "context": [
        {
          "id": "lz1slnk",
          "author": "Desperate_Air370",
          "body": "Such a touching words, well written thoughts that are 100% true. I am so very proud of you and thankful for your writing - this is a reminder I really needed & words and questions I needed to stop at and think about the answers.\n♥️",
          "created_utc": 1732612261.0
        },
        {
          "id": "lz2j3t5",
          "author": "ProfessionProof5284",
          "body": "♥️ sending lots of love to you ♥️ Thankyou for your kind words .. I wish nothing but happiness to you ♥️ remember Eating Disorders are not our friends.   I'm always here if you need a friend though ♥️",
          "created_utc": 1732627053.0
        }
      ]
    },
    {
      "id": "lz3tp4n",
      "author": "None",
      "body": "I haven’t invalidated anything just expressed confusion because I do not understand that perspective",
      "created_utc": 1732642570.0,
      "score": 0,
      "context": [
        {
          "id": "lz1hnl7",
          "author": "None",
          "body": "I’ve never considered it my friend, I’ve always been confused about why people say this",
          "created_utc": 1732605139.0
        },
        {
          "id": "lz2jbyc",
          "author": "ProfessionProof5284",
          "body": "No 2 eating disorders are the same. Your confusion should not invalidate others feelings. This is part of the problem.",
          "created_utc": 1732627147.0
        }
      ]
    }
  ]
}