{
  "id": "1h6fiaq",
  "subreddit": "EatingDisorders",
  "author": "StuffWitty2371",
  "created_utc": 1733317516.0,
  "title": "triggering boyfriend",
  "selftext": "hi, my boyfriend knows i have an eating disorder as i have opened up to him about it. i honestly think he was a major trigger to me developing one (im not blaming it completely on him, ive always been unhappy with myself) however he had always said to me that he “likes skinny girls” and would often comment on healthy looking girls and call them “fat”. since being with him i’ve lost quite a lot of weight and have actually developed an eating disorder (starving myself and forcefully vomiting). he knows about this and i have cried and vented to him about it multiple times. however today we were in an argument and he said “i keep you happy, skinny and hot” and when i questioned what he meant by keeping me skinny he goes “well i only like skinny girls”. i told him that what he is saying is triggering for me given he knows what im going through . he kept shutting me down and saying he doesn’t see how it is triggering. am i in the wrong?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1h6fiaq/triggering_boyfriend/",
  "score": 51,
  "num_comments": 23,
  "comments": [
    {
      "id": "m0i5xtj",
      "author": "Kittencab00dles",
      "body": "The only weight you need to lose is him.",
      "created_utc": 1733381980.0,
      "score": 100,
      "context": []
    },
    {
      "id": "m0i2a22",
      "author": "alienprincess111",
      "body": "This is such a horrible horrible thing to say. He is basically admitting he intentionally encouraged your ED!  You deserve better than him. I would not stay in a relationship with someone like this.",
      "created_utc": 1733379889.0,
      "score": 43,
      "context": []
    },
    {
      "id": "m0i6zg9",
      "author": "Suspicious-Treat9374",
      "body": "That’s not a partner. Please realize you deserve better than this.",
      "created_utc": 1733382608.0,
      "score": 30,
      "context": []
    },
    {
      "id": "m0id4co",
      "author": "sage-green-lover",
      "body": "Unfortunately I think it’s best you end the relationship. I bet he’s an obstacle  to recovery by reinforcing your ‘motivations’ to preserve your ED. In my experience, I’d have a phone call to break it off and then go no contact to best help you move on / heal from the relationship. There are better men out there. Maybe consider being single for a bit to center your recovery and support network.",
      "created_utc": 1733386462.0,
      "score": 16,
      "context": []
    },
    {
      "id": "m0ia754",
      "author": "Dealer_Puzzleheaded",
      "body": "This is not a person you want to be in a relationship with. How old are you both?",
      "created_utc": 1733384587.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m0ij067",
      "author": "Cautious_Effort8014",
      "body": "MASSIVE red flag\n\nhe sounds like he needs to be gotten rid of\n\nhope youre ok :(",
      "created_utc": 1733390423.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m0ja20d",
      "author": "roputsarina",
      "body": "Really? With a loaded title like that? You have to be at least half self-aware. If you read that story from a faceless person on the internet, you'd tell them to dump his cartoon villain charicature-sounding arse too. If you're real, you know what to do.",
      "created_utc": 1733405405.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m0jf6fm",
      "author": "chiefmaxson",
      "body": "I have a gf recovering from bulimia and when I saw the title I got scared that I’m probably doing something triggering. But after reading that, it is so out of pocket that it’s hard to believe. Leave him yesterday. Dude is completely evil",
      "created_utc": 1733407383.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m0kby2g",
      "author": "meowmeowru",
      "body": "This man would let you die if it meant you looked the way he desired. Psychotic.",
      "created_utc": 1733418113.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m0itx5f",
      "author": "bluehairbaddie",
      "body": "My whole body consulved when I read his happy skinny and healthy comment. Ew no. As someone one else said the only weight you need to lose is him",
      "created_utc": 1733397570.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0jror9",
      "author": "baehyunchu",
      "body": "Dump him. This type of comment shouldn't be coming from someone you love. He should love you the way you are and also helping with your ED, not making you struggle more. I hope you're ok <3 take care of yourself",
      "created_utc": 1733411777.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0jm59s",
      "author": "TapRevolutionary5022",
      "body": "OP! Are you reading these??? You need to break up with him now. And please please get help for your mental health issues! Start talking to a therapist asap.",
      "created_utc": 1733409899.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0s8ap5",
      "author": "NGGHHHH",
      "body": "Ex*",
      "created_utc": 1733525969.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0j24a4",
      "author": "floralandfading1",
      "body": "i fear i’m in the same boat it genuinely sucks 🌝",
      "created_utc": 1733401953.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0j2vtw",
      "author": "yeriaulait",
      "body": "please leave you deserve better ♡",
      "created_utc": 1733402317.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0jlfr6",
      "author": "RealisticPraline4794",
      "body": "Hey! You aren’t in the wrong at all. You have an Eating disorder and he’s making it worse. No one you love should continue to put your health at risk.",
      "created_utc": 1733409650.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0khacz",
      "author": "ilikebigbuttsz",
      "body": "Get rid of him",
      "created_utc": 1733419755.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0nijdj",
      "author": "Appropriate-Grab-440",
      "body": "I have kind of the same issue but no where close to yours of course, please dumb him if you havent already",
      "created_utc": 1733456170.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0tddew",
      "author": "Negative_Jackfruit44",
      "body": "the fact u kept trying to communicate & u said he shut u down, means he doesn’t value ur emotions. he will never give u the love ur asking for or support bc he doesn’t care. if that makes sense. he’s toxic. and at this point, i feel like u see potential in him but there’s too much toxicity. it hurts but move along. there’s a lot of fish in the sea.",
      "created_utc": 1733542085.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0z06gc",
      "author": "SecretElephant2256",
      "body": "one day you’re going to meet someone who loves you unconditionally and doesn’t manipulate you, this person sounds like they are not a good person, which can be hard to hear, especially if you love them. The best advice I can give to this situation is that person is not good for you, or for anyone. I can bet you that if you had a good 6 months at least without this person in your life, you would realize how happy you are without them, and you will grow tremendously. wishing you much love and the best, don’t forget to remember how you would never do or say things like that to someone you deeply care about, and reflect on how someone could do that to you. that someone is not a person worth the love and care you have to give.",
      "created_utc": 1733625652.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m13jsea",
      "author": "Thodi_is_dumb",
      "body": "Girl put him in a blender",
      "created_utc": 1733695152.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1eldpn",
      "author": "bumblethot1",
      "body": "What an awful person. People like that really will never get better. I know it’s hard to hear but the best thing for you and your recovery and frankly, your health is to get rid of him.",
      "created_utc": 1733858688.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0k052d",
      "author": "tastescrunchy",
      "body": "legendary",
      "created_utc": 1733414470.0,
      "score": 2,
      "context": [
        {
          "id": "m0ja20d",
          "author": "roputsarina",
          "body": "Really? With a loaded title like that? You have to be at least half self-aware. If you read that story from a faceless person on the internet, you'd tell them to dump his cartoon villain charicature-sounding arse too. If you're real, you know what to do.",
          "created_utc": 1733405405.0
        }
      ]
    }
  ]
}