{
  "id": "1h7l1mw",
  "subreddit": "EatingDisorders",
  "author": "Stingwing4oba",
  "created_utc": 1733435804.0,
  "title": "Do you ever feel you are too old to have certain eating disorders?",
  "selftext": "I turned 40 in a few months. Two things I realized:\n\n1) eating disorders can be life long. Like any mental illness, there can be bits and pieces of instability and stability. Relapse can happen, and stuff like that.\n\n2) My main eating disorder is Anorexia. I was 12 when I was diagnosed. I always thought because I gained weight I was over it. Come to find out that wasn't the case because I always had the \"disorderes thinking and habits.\n\nI was thinking about this and felt like I should be too old to have them problem, if anything I feel like I should have an eating disorder on the opposite end. Binge eating. \n\nI was wondering if anyone else felt like they were too old to have theirs as well?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1h7l1mw/do_you_ever_feel_you_are_too_old_to_have_certain/",
  "score": 71,
  "num_comments": 40,
  "comments": [
    {
      "id": "m0odaap",
      "author": "universe93",
      "body": "There is a sub for this! r/eatingdisordersover30",
      "created_utc": 1733471105.0,
      "score": 20,
      "context": []
    },
    {
      "id": "m0o2vcp",
      "author": "alienprincess111",
      "body": "You sound so much like me!  I turned 40 in September and developed anorexia at 13.  I had many years in my 20s and 30s which I'd call quasi recovery- I was normal weight but i was still engaging in ED behaviors. I was controlling and restricting food and compulsively exercising. It prevented me from doing things and building relationships with people. Then there were the relapses,  including the one I'm in now.\n\nI am definitely too old for this. But I also am realistic and realize that this disorder will be with me my whole life, sadly.",
      "created_utc": 1733465042.0,
      "score": 14,
      "context": []
    },
    {
      "id": "m0p2pvn",
      "author": "cynthiamd00",
      "body": "It's actually quite common to still experience symptoms from your ED into adulthood.\n\nI've struggled with bulimia, restricted eating and binge eating since I was 13 years old. \n\nI'm 35 now and sometimes the bad thoughts and the urge to start up again pops up, but I can normally get it under control.\n\nOne thing that I've had a hard time letting go of is weighing myself regularly. It's a really bad trigger for me and I've had so many health issues that have made my weight fluctuate.\n\nIf you don't already have a therapist I suggest you look into getting one ❤️",
      "created_utc": 1733487182.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m0ofsxh",
      "author": "None",
      "body": "I feel too old to have one at all. It is embarrassing to me at this point.",
      "created_utc": 1733472709.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m0t45pm",
      "author": "ProfessionProof5284",
      "body": "Eating Disorders do not discriminate !!!!\n\n Sending love ❤️",
      "created_utc": 1733538251.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m0osg9e",
      "author": "Desperate_Air370",
      "body": "I don’t know if I can be commenting on this since I am not same age as you but I do understand your point of the view. For me it’s the same; feeling ‘too old’ to have this kind of disorder and at the same time feeling like I’m ‘not sick enough’ to actually have disorder // and combination of these both kind of way… “Because I am this old, I can’t have this disorder and I am not even that sick, all my labs are fine and I am capable of working so it’s all good”..> my thinking, NOT CORRECT!!\n\nBut this post was good reminder of how much these disorders affects our lives and HOW LONG & even though when you start to get better/get better - it doesn’t mean that you’re ‘totally healed for the rest of your life and will never have to fight these thoughts again.’ Instead you probably will have ups and downs & these thoughts and ways to manage different kind of situations and emotions are part of you and it’s life long learning and reminding yourself that you’re worthy of loving yourself and taking care of yourself & your body is the most important thing and those negative thoughts (that might try to dress up as a positive thing) are the eating disorder speaking, not you.",
      "created_utc": 1733481160.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0qa7bf",
      "author": "crystaldmb41",
      "body": "I am 45, and going through perimenopause… and sadly, the hormonal changes, and how they are changing me, sends me spiraling between BED and restriction nonstop.",
      "created_utc": 1733503289.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m0roz6g",
      "author": "Marginablyok",
      "body": "I’m in my 30s (f). When I was in residential a few years back there was a lady in her 70s who checked in. Granted she didn’t stay more than 48 hours, but she was definitely struggling.",
      "created_utc": 1733519374.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m0oxdeh",
      "author": "OldCalligrapher3694",
      "body": "Yes! I know it's not true, but the whole \"eating disorders are for spoilt teenage girls\" rhetoric is pretty ingrained. I just feel like it's pathetic. I'm a very capable single parent with a high-responsibility job, I own my house, and on paper am super high functioning. I just can't eat like a normal person, and I feel ridiculous. Even harder - I'm not underweight. It's so hard to accept that there's an issue. I'm 18 months into therapy... still fighting it, but still showing up.\n\nPS You have to know that EDs are sneaky b*****ds and can affect anyone, regardless of age and gender. I promise it's not your fault - but I still relate to feeling it.",
      "created_utc": 1733484240.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m0p95q1",
      "author": "True-Godess",
      "body": "Would you say that about diabetes or cancer or drug addiction or OCD? As crazy as it sounds eating disorders are not about wanting to look attractive for others or yourself. I realized this in my early 20s when I was running a small business n going to school full time all in a city I moved to 20 hours away from my family or friends. I was way to busy with that n def not looking for a partner n worked with all women. But yet I kept up the behavior. It’s a negative coping mechanism n genetic n problem with brain wiring like pica people who eat chalk because their brain tells them it tastes n feels good. This isn’t about vanity n appearance because most anorexics I know look horrible that thin n not attractive to anyone. We do it at all ages because it’s a mental disorder not a choice we can pik up or put down when ever we want. If we could control it we wouldn’t be sick.",
      "created_utc": 1733490224.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0pa18a",
      "author": "TapRevolutionary5022",
      "body": "Nope. I know this will always be here. Right when I think I’m better, it comes back. \n\nIn the middle of a bad episode right now. Getting better…but I know it’s because I’m eating a thousand calories a day. Tracking. Exercising. I’m not underweight but that’s not the point. The point is I don’t want to feel like this ever. I hate the panic and the complete disconnect from my body. I basically dissociate. I can’t take the stress of feeling so disgusting. And I know I’m so wrong for thinking and feeling that way and that it’s just not true. But I can’t help but be panicky and have anxiety about it. I’m starting to change how I see myself. And I’m completely disillusioned by men and romantic relationships. Ew. The thought of a man wanting to have sex with me makes me sick and disturbed. \n\nFuck sorry I went off there. I’m going through it.",
      "created_utc": 1733490602.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0phyfp",
      "author": "Resident-Platform536",
      "body": "I'm not in the same age range as you are (20yo) but I have a bunch of other health issues and I'm the opposite, I feel too young to be dealing with problems which leads to feeling like maybe I'm faking being in pain all the time.  The mind likes to take fears and anxiety and play on them.  I think the Brian is just trying to use a defence mechanism or something but it's actually screwing us over but like you say, mental health is long term. \n My brother had a knee injury quite some time ago now and still hurts sometimes because the brain was so used to it hurting that it thinks it still should, this creating pain.  It's similar to mental health, which is why it can be such a struggle to get better.  But worth it I think, one day you'll realise a way to really help break those habits, and before you know it, you'll notice you think or do certain habits less.\n\nUnfortunately all healing and self improving is a slow process.  I've had enough health professionals tell me that one.  But all good things take time :)",
      "created_utc": 1733493789.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0po1wx",
      "author": "ShadowDemiGoddess",
      "body": "Turned 38 Monday... still struggling 🤷🏾‍♀️",
      "created_utc": 1733496054.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0pyyut",
      "author": "Enhanced_by_science",
      "body": "39 here, diagnosed at 13... I've never experienced true recovery - I could have written your post. You're absolutely not alone.",
      "created_utc": 1733499716.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0q4h3j",
      "author": "booreaves",
      "body": "I started recovery at 38. Yes, I did feel like I was too old. But, I discovered I had to learn how to re-parent myself because my disorder came from childhood trauma and neglect. With that in mind, you’re never to old to pursue recovery because it started at a young age due to your life experiences at that time. Get a dietician, therapist, and a few friends to support you and get into recovery. You won’t regret it.",
      "created_utc": 1733501476.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0qthcj",
      "author": "Lime_South",
      "body": "definitely. i was 13 when i developed an ed (anorexia and bulimia) and it’s stuck with me until now, even if it does get better for a bit the fundamental way i’ve viewed food and body image has never changed. you’re not alone 🫂",
      "created_utc": 1733509296.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0qvpjg",
      "author": "1992wrx",
      "body": "I'm sorry you're feeling this way, I don't know if this is the right thing to say/how it will come across but I mean it in a good way idk I'm bad at wording. My dads like 65? Idrk but point is he is so preoccupied with yk keeping his body a certain way. He often says nasty things about certain body types and it's just blaringly obvious to like everyone in my family (except for my stepmom who just doesn't care lol) that he has issues with food\n\nI hope me saying this doesn't make you feel hopeless or something but moreso that you're not alone and these are not exclusive to certain ages and that you're not an outlier",
      "created_utc": 1733509997.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0r405v",
      "author": "Old-Growth",
      "body": "There is no age limit for eating disorders. Tragically kids as young as 7 and elderly in their 80’s have been diagnosed with AN. You shouldn’t be embarrassed or ashamed because of it. I do recommend you search for a therapist trained in ED to help you work on your behaviors because they can be a real bitch to kick.",
      "created_utc": 1733512615.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0slk4l",
      "author": "imnsae",
      "body": "yea",
      "created_utc": 1733530917.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m0t971q",
      "author": "miniblinds123",
      "body": "Yes, I am 45 and think I am alone in this.  :(",
      "created_utc": 1733540328.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0twr6l",
      "author": "RisingPhoenix603",
      "body": "I’m 50 and anorexia is killing me. Taking my heart and liver. I’ve only had it for just almost 4 years. Trauma related along with severe depression,PTSD and SI. I know I’m going to die and I am not afraid because all of this at 50 is way too much. Eating disorder alone is waaaaay too much. You are never to old for it.",
      "created_utc": 1733551301.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0whoxo",
      "author": "Rainy-Ginger",
      "body": "Guys! LEARN ABOUT CARNIVORE FROM KELLY HOGAN , ITS LIFE\n CHANGING",
      "created_utc": 1733594492.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhujul5",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1742000395.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m0vrjya",
      "author": "sweetfaerieface",
      "body": "Yes, I am too old for this. I will be 70 in 21 days. I belong to the over30 sub. It has been helpful. In a couple days I will be at 11 months in recovery. I don’t want to be 70 and still participating in these activities.",
      "created_utc": 1733586073.0,
      "score": 5,
      "context": [
        {
          "id": "m0odaap",
          "author": "universe93",
          "body": "There is a sub for this! r/eatingdisordersover30",
          "created_utc": 1733471105.0
        }
      ]
    },
    {
      "id": "m0p2vxo",
      "author": "Stingwing4oba",
      "body": "Thank you :) I will check it out :)",
      "created_utc": 1733487266.0,
      "score": 4,
      "context": [
        {
          "id": "m0odaap",
          "author": "universe93",
          "body": "There is a sub for this! r/eatingdisordersover30",
          "created_utc": 1733471105.0
        }
      ]
    },
    {
      "id": "m0trt2z",
      "author": "FriedLipstick",
      "body": "This looks like my story too",
      "created_utc": 1733548759.0,
      "score": 3,
      "context": [
        {
          "id": "m0o2vcp",
          "author": "alienprincess111",
          "body": "You sound so much like me!  I turned 40 in September and developed anorexia at 13.  I had many years in my 20s and 30s which I'd call quasi recovery- I was normal weight but i was still engaging in ED behaviors. I was controlling and restricting food and compulsively exercising. It prevented me from doing things and building relationships with people. Then there were the relapses,  including the one I'm in now.\n\nI am definitely too old for this. But I also am realistic and realize that this disorder will be with me my whole life, sadly.",
          "created_utc": 1733465042.0
        }
      ]
    },
    {
      "id": "m0p5mvp",
      "author": "Stingwing4oba",
      "body": "I have both a therapist and earlier this year I cracked down and saved to hire a dietician specializing in Eating Disorders. I did that next I got assaulted by a neighbor and it triggered the full Anorexia relapse spiral and I didn't want to go back there again. I have too much to lose at this point",
      "created_utc": 1733488620.0,
      "score": 2,
      "context": [
        {
          "id": "m0p2pvn",
          "author": "cynthiamd00",
          "body": "It's actually quite common to still experience symptoms from your ED into adulthood.\n\nI've struggled with bulimia, restricted eating and binge eating since I was 13 years old. \n\nI'm 35 now and sometimes the bad thoughts and the urge to start up again pops up, but I can normally get it under control.\n\nOne thing that I've had a hard time letting go of is weighing myself regularly. It's a really bad trigger for me and I've had so many health issues that have made my weight fluctuate.\n\nIf you don't already have a therapist I suggest you look into getting one ❤️",
          "created_utc": 1733487182.0
        }
      ]
    },
    {
      "id": "m0t9f98",
      "author": "miniblinds123",
      "body": "Same.  I haven’t had a period in six years bc restriction, so now I have no idea why I am heating up like crazy same time each day.  How is it affecting menopause for you?  Did you see a dr?",
      "created_utc": 1733540420.0,
      "score": 2,
      "context": [
        {
          "id": "m0qa7bf",
          "author": "crystaldmb41",
          "body": "I am 45, and going through perimenopause… and sadly, the hormonal changes, and how they are changing me, sends me spiraling between BED and restriction nonstop.",
          "created_utc": 1733503289.0
        }
      ]
    },
    {
      "id": "m0p5wv9",
      "author": "Stingwing4oba",
      "body": "I def. don't like that stereotype. No one believed me I had it when I was 12. The doctor was shocked as well because she was adamant that I had childhood leukemia since the cancer runs strong on my mom's side of the family. I wasn't even aware what an eating disorder was before then",
      "created_utc": 1733488752.0,
      "score": 3,
      "context": [
        {
          "id": "m0oxdeh",
          "author": "OldCalligrapher3694",
          "body": "Yes! I know it's not true, but the whole \"eating disorders are for spoilt teenage girls\" rhetoric is pretty ingrained. I just feel like it's pathetic. I'm a very capable single parent with a high-responsibility job, I own my house, and on paper am super high functioning. I just can't eat like a normal person, and I feel ridiculous. Even harder - I'm not underweight. It's so hard to accept that there's an issue. I'm 18 months into therapy... still fighting it, but still showing up.\n\nPS You have to know that EDs are sneaky b*****ds and can affect anyone, regardless of age and gender. I promise it's not your fault - but I still relate to feeling it.",
          "created_utc": 1733484240.0
        }
      ]
    },
    {
      "id": "m0qof1u",
      "author": "Stingwing4oba",
      "body": "I have the same issues with men. Though, I feel the wrong ones take advantage of my body image, but, I am hoping the right one will come for once. I feel my body image is the reason why they don't want me.",
      "created_utc": 1733507708.0,
      "score": 1,
      "context": [
        {
          "id": "m0pa18a",
          "author": "TapRevolutionary5022",
          "body": "Nope. I know this will always be here. Right when I think I’m better, it comes back. \n\nIn the middle of a bad episode right now. Getting better…but I know it’s because I’m eating a thousand calories a day. Tracking. Exercising. I’m not underweight but that’s not the point. The point is I don’t want to feel like this ever. I hate the panic and the complete disconnect from my body. I basically dissociate. I can’t take the stress of feeling so disgusting. And I know I’m so wrong for thinking and feeling that way and that it’s just not true. But I can’t help but be panicky and have anxiety about it. I’m starting to change how I see myself. And I’m completely disillusioned by men and romantic relationships. Ew. The thought of a man wanting to have sex with me makes me sick and disturbed. \n\nFuck sorry I went off there. I’m going through it.",
          "created_utc": 1733490602.0
        }
      ]
    },
    {
      "id": "m0s126t",
      "author": "Stingwing4oba",
      "body": "It doesn't make me feel hopeless. Actually finally open this topic up with my nutrition therapist. She actually thought that I had a valid point and was actually happy someone asked that. I also shared about the reality that I finally figured out I never was \"Cured\" of an eating disorder, it's just been in a state of remission, and that I think it is a bit depressing knowing I will be in treatment for this, like mental health services for the rest of my life.\n\nI can relate about the insensitive body image comments from a parent. I got a parent who is severely obese and she legit thinks she is thinner and fitter than the rest of the family. Tries to control all the food in her house, and claims the rest of us don't \"need to make pigs of ourselves\"",
      "created_utc": 1733523414.0,
      "score": 1,
      "context": [
        {
          "id": "m0qvpjg",
          "author": "1992wrx",
          "body": "I'm sorry you're feeling this way, I don't know if this is the right thing to say/how it will come across but I mean it in a good way idk I'm bad at wording. My dads like 65? Idrk but point is he is so preoccupied with yk keeping his body a certain way. He often says nasty things about certain body types and it's just blaringly obvious to like everyone in my family (except for my stepmom who just doesn't care lol) that he has issues with food\n\nI hope me saying this doesn't make you feel hopeless or something but moreso that you're not alone and these are not exclusive to certain ages and that you're not an outlier",
          "created_utc": 1733509997.0
        }
      ]
    },
    {
      "id": "m0tdut5",
      "author": "Stingwing4oba",
      "body": "It might feel that way, but you have this subreddit. We are strangers, but we hope you can get hooked up with useful supports",
      "created_utc": 1733542293.0,
      "score": 1,
      "context": [
        {
          "id": "m0t971q",
          "author": "miniblinds123",
          "body": "Yes, I am 45 and think I am alone in this.  :(",
          "created_utc": 1733540328.0
        }
      ]
    },
    {
      "id": "mi07lt5",
      "author": "EatingDisorders-ModTeam",
      "body": "Your submission has been removed for the following reason(s):\n\nRule 2: No Pro Eating Disorder Content\n\nContent that promotes or glorifies eating disorders is strictly prohibited. This includes images, text, or any material that may be triggering. Intentionally posting said content will result in an immediate permanent ban.\n\nPlease review the [rules](https://www.reddit.com/r/EatingDisorders/wiki/index/rules/) before posting, and feel free to [send a modmail](https://www.reddit.com/message/compose?to=/r/EatingDisorders) if you have any questions.",
      "created_utc": 1742082634.0,
      "score": 1,
      "context": [
        {
          "id": "mhujul5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1742000395.0
        }
      ]
    },
    {
      "id": "molf05j",
      "author": "None",
      "body": "glad im not alone. im in my 50’s and don’t foresee my mindset changing. i have to say, a low carb/sugar free food plan helps me.",
      "created_utc": 1745409888.0,
      "score": 2,
      "context": [
        {
          "id": "m0odaap",
          "author": "universe93",
          "body": "There is a sub for this! r/eatingdisordersover30",
          "created_utc": 1733471105.0
        },
        {
          "id": "m0vrjya",
          "author": "sweetfaerieface",
          "body": "Yes, I am too old for this. I will be 70 in 21 days. I belong to the over30 sub. It has been helpful. In a couple days I will be at 11 months in recovery. I don’t want to be 70 and still participating in these activities.",
          "created_utc": 1733586073.0
        }
      ]
    },
    {
      "id": "m0pc5pd",
      "author": "cynthiamd00",
      "body": "Oh goodness I'm sorry you went through that.",
      "created_utc": 1733491492.0,
      "score": 2,
      "context": [
        {
          "id": "m0p2pvn",
          "author": "cynthiamd00",
          "body": "It's actually quite common to still experience symptoms from your ED into adulthood.\n\nI've struggled with bulimia, restricted eating and binge eating since I was 13 years old. \n\nI'm 35 now and sometimes the bad thoughts and the urge to start up again pops up, but I can normally get it under control.\n\nOne thing that I've had a hard time letting go of is weighing myself regularly. It's a really bad trigger for me and I've had so many health issues that have made my weight fluctuate.\n\nIf you don't already have a therapist I suggest you look into getting one ❤️",
          "created_utc": 1733487182.0
        },
        {
          "id": "m0p5mvp",
          "author": "Stingwing4oba",
          "body": "I have both a therapist and earlier this year I cracked down and saved to hire a dietician specializing in Eating Disorders. I did that next I got assaulted by a neighbor and it triggered the full Anorexia relapse spiral and I didn't want to go back there again. I have too much to lose at this point",
          "created_utc": 1733488620.0
        }
      ]
    },
    {
      "id": "m0v3mtb",
      "author": "crystaldmb41",
      "body": "I am not in menopause yet because I still get my period if I don’t take the pill continuously (and restriction doesn’t stop my period). I’m in perimenopause, though,  so the symptoms are adding up quickly. I am CHEK2+ with three maternal family members who have had or died from breast cancer so I can’t take too much in terms of hormonal therapy, so I am trying to manage with my antidepressants and supplements.",
      "created_utc": 1733577036.0,
      "score": 2,
      "context": [
        {
          "id": "m0qa7bf",
          "author": "crystaldmb41",
          "body": "I am 45, and going through perimenopause… and sadly, the hormonal changes, and how they are changing me, sends me spiraling between BED and restriction nonstop.",
          "created_utc": 1733503289.0
        },
        {
          "id": "m0t9f98",
          "author": "miniblinds123",
          "body": "Same.  I haven’t had a period in six years bc restriction, so now I have no idea why I am heating up like crazy same time each day.  How is it affecting menopause for you?  Did you see a dr?",
          "created_utc": 1733540420.0
        }
      ]
    },
    {
      "id": "mbj2xfu",
      "author": "Accent-Ad-8163",
      "body": "Same so wtf do we do to figure it out",
      "created_utc": 1738956277.0,
      "score": 1,
      "context": [
        {
          "id": "m0qa7bf",
          "author": "crystaldmb41",
          "body": "I am 45, and going through perimenopause… and sadly, the hormonal changes, and how they are changing me, sends me spiraling between BED and restriction nonstop.",
          "created_utc": 1733503289.0
        },
        {
          "id": "m0t9f98",
          "author": "miniblinds123",
          "body": "Same.  I haven’t had a period in six years bc restriction, so now I have no idea why I am heating up like crazy same time each day.  How is it affecting menopause for you?  Did you see a dr?",
          "created_utc": 1733540420.0
        }
      ]
    },
    {
      "id": "m0tv92a",
      "author": "miniblinds123",
      "body": "You are so kind.  Thanks, and me too. xo",
      "created_utc": 1733550495.0,
      "score": 1,
      "context": [
        {
          "id": "m0t971q",
          "author": "miniblinds123",
          "body": "Yes, I am 45 and think I am alone in this.  :(",
          "created_utc": 1733540328.0
        },
        {
          "id": "m0tdut5",
          "author": "Stingwing4oba",
          "body": "It might feel that way, but you have this subreddit. We are strangers, but we hope you can get hooked up with useful supports",
          "created_utc": 1733542293.0
        }
      ]
    }
  ]
}