{
  "id": "1h96jdq",
  "subreddit": "EatingDisorders",
  "author": "Stingwing4oba",
  "created_utc": 1733617993.0,
  "title": "What eating disorder stereotypes do you hate?",
  "selftext": "I always thought those of us with eating disorders didn't live long. And there are only three eating disorders. Anorexia, Bulemia and Binge Eating Disorder. I never learned about AFRID and others. And then at the local library I kept walking passed a book called \"Starving For Attention\" and that made me mad. Anorexia is a REAL mental disorder.\n\nStereotyping. I hate those stersotypes the most. What about you?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1h96jdq/what_eating_disorder_stereotypes_do_you_hate/",
  "score": 164,
  "num_comments": 103,
  "comments": [
    {
      "id": "m0zqqu3",
      "author": "No-Event4806",
      "body": "Anorexics don’t eat any food. Like yeah we’ll fast but we do eat *some* food otherwise we’d all be dead",
      "created_utc": 1733637080.0,
      "score": 225,
      "context": []
    },
    {
      "id": "m1038v1",
      "author": "dollyloves",
      "body": "That all people with eating disorders have to be thin 😭",
      "created_utc": 1733644378.0,
      "score": 236,
      "context": []
    },
    {
      "id": "m10548k",
      "author": "sprinklefawn",
      "body": "‘People with anorexia hate food’\n\nWrong! Many of us LOVE it, we’re just scared of eating it.",
      "created_utc": 1733645614.0,
      "score": 119,
      "context": []
    },
    {
      "id": "m0zbadl",
      "author": "alienprincess111",
      "body": "Some of the ones I hate are true for some anorexics I think but not me.\n\nOne is that anorexics think they're fat when they are emaciated. I know very well when I am too thin, and don't think I'm fat, quite the opposite.  The problem is I am addicted to restricting.\n\nThe other is that anorexics should be able to \"just eat\". I wish it were so simple.\n\nLastly it is that anorexics only eat \"diet food\" like fruits and veggies. I am actually afraid of high volume foods so I'd rather eat something small and calories than a lot of a low calorie food.",
      "created_utc": 1733630239.0,
      "score": 115,
      "context": []
    },
    {
      "id": "m10ba1m",
      "author": "None",
      "body": "genuinely hate the stereotype that we're all fatphobic",
      "created_utc": 1733649777.0,
      "score": 112,
      "context": []
    },
    {
      "id": "m10clm7",
      "author": "Desperate_Air370",
      "body": "• People with eating disorder are all underweight and you can see who has it because of this\n             > No. One can be in their ‘ideal’ weight or be ‘overweight’ and still be struggling with eating disorder. BMI and scale don’t matter in these situations as much as the habits and behaviors around eating and food overall. Of course those things do play a part in some cases and some professionals makes those things be the most relevant thing when talking about Ed but the fact is that those aren’t the things to be focused on.\n\n\n• Only teenage girls have eating disorders\n             > yeah and cows are only source for getting milk to drink. (sarcasm obviously). You can be any age and gender & have Ed. \n\n\n• People with ed hates food and doesn’t eat anything anytime.          \n              > We’d all be dead if this were true. There are many thoughts behind everyone’s head, we can’t know for sure what someone is thinking. In my case I love food - especially GOOD food (taste, not as some foods being bad or good). I am just hating myself and feeling guilty when eating, like I don’t deserve to eat if I haven’t done something to eat. Of course people have to eat to stay alive, but some people eat so little they possibly can and restrict themselves to cope - even though this isn’t them, it’s Ed speaking.\n\n\n• Only eating healthy and ‘good’ foods.\n            > Again, we are different. But this is something I often hear when people speak about eating disorders and that’s just not true. For me it’s easier to eat something that has more calories in and is smaller size than eating something with lower calories and sizing up my plate size. If I do eat more of a ‘normal’ sized meal with less calories, it gives me huge amounts of anxiety and guilt because I have eaten more than usually BUT I get hungry more quickly.\n\n\n• Not eating and losing weight just to get attention.\n          > I don’t have enough words in my knowledge to express how wrong this is - again not all are the same. I would have been so much happier if people wouldn’t have started commenting and noticing my weight loss. For me this Ed behavior lifted up its head when I had hard and stressful times in my life & I started to feel that this is the way for me to control my life (oh how wrong can one be). Now when I am seeing psychologist etc and trying to get better from Ed, I am thankful that my psychologist noticed my weight loss and other symptoms because of her I realized how badly I need help & I am not doing what’s best for me and my health. But at first when she had counted 1+1… I felt irritated, anxious, mad and like a failure. Was scared that now they are going to take away this one thing from me that I am good at. Gladly my psychologist has been able to open my eyes and make me understand so many things that I wouldn’t have been able to see without help.\n\n\n• When looking at the mirror, always seeing themselves as overweighted and nothing else.\n         > this one is hard for me, because it’s kind of 50-50 situation. I am able to see and understand that I have lost weight - a lot and in a short period of time. But I am not and haven’t been underweight at any point - and I didn’t get to ‘go to my goal weight’- before psychologist noticed my situation so I have the feeling of being a failure because of this. At the same time I do see that I am ‘normal’ looking, but because I have been gaining a weight back a little now (it’s a good thing for sure!) I feel like I don’t look as good as I did before. Mirrors are huge enemy of mine, now that I don’t jump in the scale all the time - but then I don’t want to put mirrors away because I’d like to think that it’s important for me to learn to love myself and the way I am.\n\n\n• Anyone with eating disorder should just eat normally and not make such a big deal of it.\n         > if I could, I would. If it would be that simple, there probably wouldn’t be eating disorders.\n\n\n• Once you get better, you’re fixed and that’s the end of that story.\n         > IF OBLY THIS WERE TRUE!! But no. I believe this is and will be life long journey, the thoughts and habits might try to lift their head up later in life if there is some harder situations going on etc. We can try and will learn to see the difference between our thoughts and Ed’s thoughts & work on listening ourselves and loving our bodies and so on. But I don’t believe in the theory that I could get rid of Ed for good. I believe it can be in some kind of box in my head and sometimes yells louder and other times I don’t even remember that box exists.\n\n\n• Being able to work/see friends/attend parties or smth like these means that you can’t be that sick or you don’t need help. \n           > just no. For me, being active and seeing people was my way of trying to prove even myself that I am doing okay, even though I was able only to lay in bed or sleep after getting home because I was too exhausted.\n\n\n• Eating around people means that you’re just faking to be sick.\n           > I hate people sometimes. No. I can’t stand eating around people, it is overwhelming and exhausting & the anxiety levels are so high up, but at least around the right people/situation; it’s somehow easier to eat, even though it is stressing tf out of me. But because others are eating, it’s more natural for me to eat - being at home alone is maybe less stressful when eating but the guilt is bigger & harder to start eating when at home alone.",
      "created_utc": 1733650664.0,
      "score": 24,
      "context": []
    },
    {
      "id": "m10h7jy",
      "author": "ed_mayo_onlyfans",
      "body": "That it’s to look thin because of skinny supermodels and the like",
      "created_utc": 1733653786.0,
      "score": 23,
      "context": []
    },
    {
      "id": "m10qwms",
      "author": "Rosenblattca",
      "body": "I hate how body dysphoria is portrayed, that you see a fat person in the mirror when you’re really skinny. That’s not what it’s like for me. I have a distorted image in my mind of what I look like, and it’s not actually true at all and it’s always a shock when I look at myself.",
      "created_utc": 1733660024.0,
      "score": 19,
      "context": []
    },
    {
      "id": "m10nuyj",
      "author": "Ill_Direction4658",
      "body": "That The only ed is ana",
      "created_utc": 1733658165.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m10oso3",
      "author": "VeterinarianAway3112",
      "body": "that it's only bad or unhealthy if I'm underweight again. No, mom, you can't excuse me fasting because \"oh well, it's not like you are dying again\" because if you leave me alone i WILL get there. \n\nSame when it's my friends. Girly, if you hate yourself deeply and try to go as long as you can without eating for a sense of euphoria, you aren't more healthy than me, idc about your weight.",
      "created_utc": 1733658749.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m0zi4tc",
      "author": "itscullenyo",
      "body": "Eating disorders are only for teen girls. It's pretty invalidating as a transmasc adult",
      "created_utc": 1733633155.0,
      "score": 56,
      "context": []
    },
    {
      "id": "m10aeu7",
      "author": "ZhiYoNa",
      "body": "We all want to be thin. I honestly want to gain weight and build muscle. My problem is that I’m addicted to restriction and food is expensive / a pain to cook / not particularly attractive / easy to ignore.",
      "created_utc": 1733649198.0,
      "score": 24,
      "context": []
    },
    {
      "id": "m0zyl39",
      "author": "None",
      "body": "that ARFID is just picky eating.\n ppl should  realize  it’s more then that.  also some just think everyone with an eating disorder is skinny which is not true cuz you can have an ed with different body types.\nAND ALSO ANOREXIA ISNT JUST ABOUT NOT WANTING TO EAT!",
      "created_utc": 1733641433.0,
      "score": 22,
      "context": []
    },
    {
      "id": "m11dgvj",
      "author": "Ok-Bug-3449",
      "body": "That you either *have* to have anorexia or bulimia. There’s no in between. Also I reaaaallly hated that movie “To The Bone.” I had a lot of similar experiences to her but like fuck. I hate the way it’s portrayed there.",
      "created_utc": 1733670169.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m11j1ad",
      "author": "CaliforniaPotato",
      "body": "that you have to look a certain way to \"actually be struggling.\" I was a perfectly healthy/normal weight but mentally I had 0 thoughts other than about food. It was literally all day 24/7 thinking about food and it was horrible.",
      "created_utc": 1733672146.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m12pbm1",
      "author": "softerthansilence",
      "body": "I don’t know if it counts as a stereotype, but I hate how in eating disorder media, they make every moment so dramatic. I understand why they do it, visual mediums like that don’t allow for a lot of downtime, but I’ve went for weeks and even a few months at some point where I was simultaneously restricting heavily and living my normal life. \n\nIt was with a lot more sugar free energy drinks, but there’s a weird amount of time when you’re waiting for the other shoe to drop and someone to find out while hoping the other shoe doesn’t drop and no one finds out.",
      "created_utc": 1733685502.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m1155st",
      "author": "Vulkhard_Muller",
      "body": "The one my family got me with when I opened up about my Binge Eating Disorder, \"What are you a girl??\". \n\nThanks, not like I was already insecure about my body and my lack of masculine traits. \n\n😭😭😭",
      "created_utc": 1733666910.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m10qg7y",
      "author": "zippiDOTjpg",
      "body": "Anorexics only ever starve, they’ll never have episodes of binging and then restrict as punishment (which is literally Type 2 anorexia), and they HAVE to be underweight to be anorexic. Do you think all anorexics just become malnourished overnight as soon as they start developing the disorder? It’s a mental disorder with physical symptoms, not the other way around. I tried getting help for my eating disorder at 14 and was told there’s no point sending me to a specialist because I didn’t meet the weight requirement to be anorexic, and I never asked for help again. I’ll be 24 next month, and I still don’t have a healthy relationship with food. Fuck stereotypes.",
      "created_utc": 1733659753.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m11sox9",
      "author": "poisonkissed3",
      "body": "People who treat eating disorders like a cute little diet you can stop at will. “Just lose weight in a healthy way instead” as if that wasn’t how this started for me and many others.",
      "created_utc": 1733675326.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m11zzq3",
      "author": "huuugggttfdf",
      "body": "\"just eat for me please 🥺\" but that's my PROBLem I eat 2 much",
      "created_utc": 1733677661.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m12dtrw",
      "author": "yourremedy94",
      "body": "That only thin people can be anorexic.",
      "created_utc": 1733682003.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m12gv5f",
      "author": "Dependent-Calendar-7",
      "body": "That this is only about control when in reality it’s about my people pleasing and makes me feel more small and lovable",
      "created_utc": 1733682921.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m0znxnx",
      "author": "NervousToucan",
      "body": "People are anorexic because they are vein. I’ve seen a post a few days ago (completely different website) where a women asked why she gains weight while on her period and that she feels fat. She had a low weight and a man specifically replied with\n\n>!go to the doctor, you seem to be really sick. A psychiatrist would be the right one for your disorder.!<\n\n>!Are women not ticking properly nowadays. Make if such waves for a bit more weight. There are worse problems in life.!<",
      "created_utc": 1733635728.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m13l69m",
      "author": "H34RTZX",
      "body": "That everyone purges",
      "created_utc": 1733695613.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m140bhy",
      "author": "VirtualApricot",
      "body": "That people with AN-R are super smart, talented, organized, and over achievers. \n\nI have ASD, ADHD, and a learning disorder. I do not life up to my stereotype and it’s embarrassing. I don’t even life up to the expectations of a disease/mental illnesses",
      "created_utc": 1733700864.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m19e077",
      "author": "-abby-normal",
      "body": "That people with restrictive eating disorders have “discipline” and “self control.” I am a slave to this disorder, there is no self control involved here.",
      "created_utc": 1733780566.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m11febz",
      "author": "None",
      "body": "Hate the stereotype that ARFID is picky eating. It's more than that.",
      "created_utc": 1733670861.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m111prl",
      "author": "misseviscerator",
      "body": "Right now it’s that people think I’m attention seeking/crying for help, that I’m choosing this, and that I just want to be thin/it’s all about aesthetics or trying to fit in with an image of beauty.\n\nWhen I was younger the aesthetic drive was true, and I was trying everything possible not to eat/not to want to eat. But the relapse I’m having now is not like that at all. I don’t want this, i don’t want to be thin, I hate how my body looks like this. And until recently I didn’t fear weight gain, but I just couldn’t bring myself to eat. It felt alien, like asking me to eat sand or drink petrol, nothing about it felt natural.\n\nSo I wish people realised there are so many different reasons for anorexia and other eating disorders, not to assume that it’s just one set of beliefs all the time.\n\nI literally cannot convince most people, incl healthcare professionals, that I don’t want to be thin. They just can’t comprehend it.",
      "created_utc": 1733665431.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m12dsx8",
      "author": "yourremedy94",
      "body": "That inly thin people can be anorexic.",
      "created_utc": 1733681997.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m12i6dg",
      "author": "A1B1S1",
      "body": "Uh yes yes yes it’s a TERRIBLE stereotype that ppl with eating disorders look a certain way….its a brain-based disorder, just like depression or bipolar, and you can’t “see” it. One of the reasons why suicide rates are high with ED is because of the chronic invalidation people receive if they don’t “look like they have an ED.” It’s infuriating",
      "created_utc": 1733683317.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m10hkyn",
      "author": "NorthLight2103",
      "body": "That everyone who’s anorexic is skinny. No, not true, I’m large but I have been even larger, I’ve lost weight that a lot of people don’t know about. And it’s extremely hard to restrict when you live with other people who know what you eat.",
      "created_utc": 1733654039.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m11it7f",
      "author": "Metastazie",
      "body": "I have ARFID, so often misdiagnosed as anorexia and I hear all the time “she’s just scared of calories, look at her” (hearing that is so funny because most of my diet is bread with cheese, pasta, sweets and coffee with milk)",
      "created_utc": 1733672068.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m140tfj",
      "author": "Foreign_Matter_4638",
      "body": "That \"you have to be skinny to have an eating disorder\". Was overweight despite having a restrictive eating disorder and was told by doctors to watch my weight and consider dieting",
      "created_utc": 1733701044.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m147dv8",
      "author": "Stingwing4oba",
      "body": "Eating Disorders are strictly diet addictions. I kinda don't feel that way. To me purging and starving aren't diet based TBH.",
      "created_utc": 1733703401.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m147wja",
      "author": "Stingwing4oba",
      "body": "Another stereotype is when people on shows claim they can't brush their teeth because they will be over their calorie limit. For once, toothpaste isn't edible and there are no calories. Two.... That one doesn't make any sense",
      "created_utc": 1733703582.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m14iu7d",
      "author": "Fairy_Sweet_22",
      "body": "Bulimics are usually normal or over weight… ☺️ they forget about the sub types anorexia b/p and those that were just slim to begin with. A lot of people asked why my face wasn’t fat and why I was thin and I was constantly like ???? lol",
      "created_utc": 1733707591.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m14r6g7",
      "author": "thxrpy",
      "body": "That because people have seen me eating I must be recovered, like no some months I can eat semi normal then the next 3 I’m living on water and cup soup again \n\nOr I’m ’fishing for compliments’ when I talk about my issues around food like no I just don’t want people to think it’s cool and fun to stop eating cos id hate anyone to end up in the same position as me",
      "created_utc": 1733710748.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1nnnzl",
      "author": "ShiftyGooseGoblin",
      "body": "The only way to purge is by vomiting. I used to get praised for being so \"healthy\" and \"passionate about fitness\" when in reality I was staying at the gym until I physically couldn't move because it was the only way I felt I earned the calories.",
      "created_utc": 1733985480.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m11ftsc",
      "author": "PsychologicalTea5387",
      "body": "Hearing \"grow up\" and being casted as immature for having ARFID",
      "created_utc": 1733671014.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m10napn",
      "author": "DebateObjective2787",
      "body": "IDK why the book made you mad; that sounds like more of a *you* problem. Considering that Starving For Attention is a book about the author's own struggle with anorexia and how it nearly killed her.",
      "created_utc": 1733657803.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m112c2z",
      "author": "FFroggged",
      "body": "That the only disorder is anorexia",
      "created_utc": 1733665701.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1554jz",
      "author": "ExtremelyOnlineTM",
      "body": "Oh hey wait I do have that DAMMIT",
      "created_utc": 1733716165.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m167c3k",
      "author": "unendinghorrors",
      "body": "The ABC family sort of \"I wanna look like the girls in the magazines\" fragile ballerina who just got called fat for the very first time and immediately spirals over beauty standards and just beauty standards archetype \nLike I do this to feel a sense of control. Body image/beauty standards are part of it and were probably a bigger part of it in the beginning, but there are a lot of other things that inspire ED behavior. \n\nI've been struggling with what I guess is ARFID type beat stuff recently because I'm dealing with health stuff and eating is kind of scary because of how sick I am. I'm technically the weight I wanted to be when I was willfully doing this to myself, and I hate it because it feels out of my control. Like sure I meet my own unrealistic beauty standard now but I hate it because it wasn't my choice. This has always been about feeling in control of something in my life when everything else is out of control, and now that the weight loss isn't on purpose I may simply become the joker.",
      "created_utc": 1733737727.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m16qopx",
      "author": "True-Godesss",
      "body": "That we are this way for vanity reasons. There's been many studies that show differences in brain activity among people with ED's showing a biological cause for the behavior. One study the MRI images showed that women with bulimia had decreased blood flow in a part of the brain called the precuneus while viewing food images after completing the stressful math problems, whereas blood flow significantly increased in that part of the brain among women without bulimia. The [precuneus is ](http://www.sciencedirect.com/topics/neuroscience/precuneus)associated with self-perception and memory. There's also a huge genetic component, eating disorders run in families. Now researchers have found two genes that help determine the risk of acquiring the disease. The results suggest that variations in genes involved in mood and appetite can put women at risk for anorexia. \n\nI was even under the impression the first ten years I had ED that it was just because I wanted to be thin for appearances. BUt then I realized I was engaging in behavior to relieve a bad mood or fight I got in, also was doing it when I wasn't looking for a partner at all was way too busy with work and school, so why did I care if I gained a 5pounds (as I never gained a lot of weight when I stopped doing it). \n\nAfter inpatient treatment I saw that it was a negative coping mechanism, a way to deal with trauma even plus the vulnerability of my genes and brain. Plus, PROZAC worked! If it wasn't a mental issue, then why would taking 40 mg of Prozac a day stop me from binge/purge episodes?",
      "created_utc": 1733749166.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m16u2ri",
      "author": "Loveapplication",
      "body": "That people with body dysmorphia are attention seeking. Recently saw this person venting saying they were obese, that they felt that way, and so many people were calling them an attention seeker. Just because they were emaciated. It’s really hurtful because when I was at my lowest bmi I genuinely thought I was fat, I couldn’t see any thin-ness on me. I understood what it felt like for them so people calling them an attention seeker really hit me the wrong way. \n\nPeople with body dysmorphia cannot see they are their actual weight despite what their scale says. They are struggling and venting about their thoughts, NOT attention seeking.\n\nAnother one is that bulimia is just about >! Self-induced vomiting !< , people ignore it’s all types of purging, diagnostic criteria says purging not >!self-induced vomiting!< strictly. >!Exercise and laxatives!< would be included. As well as >!fasting!<. Anything that is used to compensate for binging.",
      "created_utc": 1733750657.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m16wmqp",
      "author": "Ok_Shallot6017",
      "body": "1.) Skinny People can't have Binge Eating Disorder  \n2.) People with eating disorders are either really fat or really thin  \n2.) People with Binge Eating Disorder just need to \"Eat Less\" <- (NO, they need to convince the primal part of their brains that there is always food around by eating consistently and removing the diet mentality)",
      "created_utc": 1733751714.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1788b1",
      "author": "Inner_Literature_936",
      "body": "assuming that everyone with a restrictive ED is Calorie counting or binging",
      "created_utc": 1733756139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m18454z",
      "author": "xxvanityy",
      "body": "that bulimia is associated with only purging",
      "created_utc": 1733766400.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m19svfk",
      "author": "zom666ie_",
      "body": "that we all want to be stick thin/really boney all over. I want my upper half to be flat and thin but I like having what butt I do have I'm sorry 😭",
      "created_utc": 1733785487.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m1w2xot",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1734112082.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5l73q4",
      "author": "Ivanq0l",
      "body": "Anorexics only eat fruits and veggies while people with BED only binge junk food",
      "created_utc": 1736112218.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6n2hvv",
      "author": "BlancaNicolina",
      "body": "My former mother-in-law's comment about eating disorders. \n\"I can't imagine being afraid of food. My sister's and I have always loved food\" \nAt family dinners, she would shame you for not having desert. \n\"Have a piece of cake. Just to be polite.\"  Echoes in my head 20 years later. ",
      "created_utc": 1736631272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbcwjzq",
      "author": "everything-on-red",
      "body": "That bulimia just means throwing up whatever you eat after you eat it.\n\nAs someone who's struggled with both types of behaviors, bulimia is *binging* and purging.\n\nPurging after eating normally is *purging disorder.*",
      "created_utc": 1738874581.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m13t8g4",
      "author": "Chaerin_Sistas",
      "body": "THIS EXACTLY and its one of the main reasons why I hate eating in front of people who know i struggle with eating because they’re like “oh you’re eating i thought you said you were anorexic”\nOr sometimes i eat all of my day’s worth of calories in an OMAD and my mom or my sisters are like “wow you’re eating so much” 🫤",
      "created_utc": 1733698340.0,
      "score": 36,
      "context": [
        {
          "id": "m0zqqu3",
          "author": "No-Event4806",
          "body": "Anorexics don’t eat any food. Like yeah we’ll fast but we do eat *some* food otherwise we’d all be dead",
          "created_utc": 1733637080.0
        }
      ]
    },
    {
      "id": "m18etb3",
      "author": "nervous_veggie",
      "body": "That anorexics fast. Many people eat multiple times per day, just restricted amounts.",
      "created_utc": 1733769675.0,
      "score": 12,
      "context": [
        {
          "id": "m0zqqu3",
          "author": "No-Event4806",
          "body": "Anorexics don’t eat any food. Like yeah we’ll fast but we do eat *some* food otherwise we’d all be dead",
          "created_utc": 1733637080.0
        }
      ]
    },
    {
      "id": "m10fc6b",
      "author": "julesisnotsober",
      "body": "Like girl I developed this for a reason??",
      "created_utc": 1733652515.0,
      "score": 118,
      "context": [
        {
          "id": "m1038v1",
          "author": "dollyloves",
          "body": "That all people with eating disorders have to be thin 😭",
          "created_utc": 1733644378.0
        }
      ]
    },
    {
      "id": "m10sg4q",
      "author": "DigitalGarden",
      "body": "This is what I came here to say.  \n\nYeah, I'm fat and.have an eating disorder.  It isn't a dichotomy.",
      "created_utc": 1733660921.0,
      "score": 45,
      "context": [
        {
          "id": "m1038v1",
          "author": "dollyloves",
          "body": "That all people with eating disorders have to be thin 😭",
          "created_utc": 1733644378.0
        }
      ]
    },
    {
      "id": "m10r9eb",
      "author": "Any-Sir-5541",
      "body": "frl 😭 if we were always thin trust me we wouldn’t have it",
      "created_utc": 1733660231.0,
      "score": 29,
      "context": [
        {
          "id": "m1038v1",
          "author": "dollyloves",
          "body": "That all people with eating disorders have to be thin 😭",
          "created_utc": 1733644378.0
        }
      ]
    },
    {
      "id": "m11rzot",
      "author": "Delia_Deetz",
      "body": "Came to say this. Seems like my toxic food relationship of 30+ years obliterated my metabolism",
      "created_utc": 1733675097.0,
      "score": 18,
      "context": [
        {
          "id": "m1038v1",
          "author": "dollyloves",
          "body": "That all people with eating disorders have to be thin 😭",
          "created_utc": 1733644378.0
        }
      ]
    },
    {
      "id": "m1fi464",
      "author": "ConferenceTimely4474",
      "body": "\"You don't look like an anorexic person, you're not that thin\" \n\nFucking shit 😭😭",
      "created_utc": 1733868837.0,
      "score": 6,
      "context": [
        {
          "id": "m1038v1",
          "author": "dollyloves",
          "body": "That all people with eating disorders have to be thin 😭",
          "created_utc": 1733644378.0
        }
      ]
    },
    {
      "id": "m13tdkg",
      "author": "Chaerin_Sistas",
      "body": "We have to be at a heavier weight first in order to lose weight 🙄",
      "created_utc": 1733698389.0,
      "score": -1,
      "context": [
        {
          "id": "m1038v1",
          "author": "dollyloves",
          "body": "That all people with eating disorders have to be thin 😭",
          "created_utc": 1733644378.0
        }
      ]
    },
    {
      "id": "m11jjy5",
      "author": "CaliforniaPotato",
      "body": "REAL I literally didn't eat a burger for like 2 years straight like for some reason that was my biggest fear food?? I still haven't gotten over that... I'll only eat a burger now if my dad makes it at home which is once very very rarely so I avoid them even still unfortunately even though I'm a lot mentally better for the most part. Some ED habits/avoidances stick with you and I'm not sure if I'll ever be \"normal\" again. And by normal i mean how I used to be mentally about food.",
      "created_utc": 1733672324.0,
      "score": 9,
      "context": [
        {
          "id": "m10548k",
          "author": "sprinklefawn",
          "body": "‘People with anorexia hate food’\n\nWrong! Many of us LOVE it, we’re just scared of eating it.",
          "created_utc": 1733645614.0
        }
      ]
    },
    {
      "id": "m13be1q",
      "author": "None",
      "body": "I loved food so much more when I “couldn’t” have it. The restriction made the blandest salads seem gourmet. Now that I’m recovered I barely care",
      "created_utc": 1733692428.0,
      "score": 6,
      "context": [
        {
          "id": "m10548k",
          "author": "sprinklefawn",
          "body": "‘People with anorexia hate food’\n\nWrong! Many of us LOVE it, we’re just scared of eating it.",
          "created_utc": 1733645614.0
        }
      ]
    },
    {
      "id": "m11jyjb",
      "author": "tiny_beast29",
      "body": "If I didn't love food, I'd not need to restrict my eating so much! I eat salads, lean meat and tofu ESPECIALLY because I love bacon, burgers and fries! I don't eat sweets because I'd eat the whole box in one sitting. I don't bake anymore, because I can eat a whole loaf of bread with a ton of butter by myself.",
      "created_utc": 1733672464.0,
      "score": 5,
      "context": [
        {
          "id": "m10548k",
          "author": "sprinklefawn",
          "body": "‘People with anorexia hate food’\n\nWrong! Many of us LOVE it, we’re just scared of eating it.",
          "created_utc": 1733645614.0
        }
      ]
    },
    {
      "id": "m10r6e8",
      "author": "Any-Sir-5541",
      "body": "I genuinely love the feeling of not eating. I feel so powerful to control my body",
      "created_utc": 1733660182.0,
      "score": 49,
      "context": [
        {
          "id": "m0zbadl",
          "author": "alienprincess111",
          "body": "Some of the ones I hate are true for some anorexics I think but not me.\n\nOne is that anorexics think they're fat when they are emaciated. I know very well when I am too thin, and don't think I'm fat, quite the opposite.  The problem is I am addicted to restricting.\n\nThe other is that anorexics should be able to \"just eat\". I wish it were so simple.\n\nLastly it is that anorexics only eat \"diet food\" like fruits and veggies. I am actually afraid of high volume foods so I'd rather eat something small and calories than a lot of a low calorie food.",
          "created_utc": 1733630239.0
        }
      ]
    },
    {
      "id": "m10v93m",
      "author": "Agitated_Side3897",
      "body": "Yeah I've had a few friends (who I told, and they keep me in check for which I am very grateful, they're the reason I don't hurt myself too much), who were surprised I could eat foods like pizza and pasta and other high calorie/high carb food and meanwhile I'm like I'm not afraid of food? I don't like the act of eating, I don't like people looking at me while I eat, I don't like to make a mess when I eat and I don't like to eat with my hands so no you'll probably never see me eat unless I feel safe around you and you're eating as well, but me having an eating disorder doesn't mean I only eat low calorie foods? I'd rather eat something small that I know will make me have energy for the rest of the day than a lot of things that will make me run out of energy quickly. \n\nAlso I don't like the thing where people go like just eat. And I'm like well first of all my brain won't let me, but if I can make my brain be fine with eating food, then, because I've been restricting for so long, my body literally cannot take in a lot of food. My stomach isn't used to it and I will feel even worse and I'd get worse. Just ask me if I'm fine with eating something, don't forcw me to eat it.",
      "created_utc": 1733662425.0,
      "score": 10,
      "context": [
        {
          "id": "m0zbadl",
          "author": "alienprincess111",
          "body": "Some of the ones I hate are true for some anorexics I think but not me.\n\nOne is that anorexics think they're fat when they are emaciated. I know very well when I am too thin, and don't think I'm fat, quite the opposite.  The problem is I am addicted to restricting.\n\nThe other is that anorexics should be able to \"just eat\". I wish it were so simple.\n\nLastly it is that anorexics only eat \"diet food\" like fruits and veggies. I am actually afraid of high volume foods so I'd rather eat something small and calories than a lot of a low calorie food.",
          "created_utc": 1733630239.0
        }
      ]
    },
    {
      "id": "m10r51u",
      "author": "Any-Sir-5541",
      "body": "Sameeee",
      "created_utc": 1733660160.0,
      "score": 4,
      "context": [
        {
          "id": "m0zbadl",
          "author": "alienprincess111",
          "body": "Some of the ones I hate are true for some anorexics I think but not me.\n\nOne is that anorexics think they're fat when they are emaciated. I know very well when I am too thin, and don't think I'm fat, quite the opposite.  The problem is I am addicted to restricting.\n\nThe other is that anorexics should be able to \"just eat\". I wish it were so simple.\n\nLastly it is that anorexics only eat \"diet food\" like fruits and veggies. I am actually afraid of high volume foods so I'd rather eat something small and calories than a lot of a low calorie food.",
          "created_utc": 1733630239.0
        }
      ]
    },
    {
      "id": "m140n1z",
      "author": "VirtualApricot",
      "body": "Accurate. \n\nIt’s not that I think I am fat, it’s the fact I HAVE fat that is part of my issue. That’s all I can fixate on.",
      "created_utc": 1733700979.0,
      "score": 3,
      "context": [
        {
          "id": "m0zbadl",
          "author": "alienprincess111",
          "body": "Some of the ones I hate are true for some anorexics I think but not me.\n\nOne is that anorexics think they're fat when they are emaciated. I know very well when I am too thin, and don't think I'm fat, quite the opposite.  The problem is I am addicted to restricting.\n\nThe other is that anorexics should be able to \"just eat\". I wish it were so simple.\n\nLastly it is that anorexics only eat \"diet food\" like fruits and veggies. I am actually afraid of high volume foods so I'd rather eat something small and calories than a lot of a low calorie food.",
          "created_utc": 1733630239.0
        }
      ]
    },
    {
      "id": "m13o6z8",
      "author": "Summersault365",
      "body": "I completely relate to everything you posted. Thank you.",
      "created_utc": 1733696623.0,
      "score": 2,
      "context": [
        {
          "id": "m0zbadl",
          "author": "alienprincess111",
          "body": "Some of the ones I hate are true for some anorexics I think but not me.\n\nOne is that anorexics think they're fat when they are emaciated. I know very well when I am too thin, and don't think I'm fat, quite the opposite.  The problem is I am addicted to restricting.\n\nThe other is that anorexics should be able to \"just eat\". I wish it were so simple.\n\nLastly it is that anorexics only eat \"diet food\" like fruits and veggies. I am actually afraid of high volume foods so I'd rather eat something small and calories than a lot of a low calorie food.",
          "created_utc": 1733630239.0
        }
      ]
    },
    {
      "id": "m10gc1o",
      "author": "talo1505",
      "body": "Was going to say this too. People don't know anything about eating disorders, and don't realize that they are a complex network of deep-rooted psychological problems, with the physical behaviours only being the tip of the iceberg. \n\nNot all eating disorder are restrictive, and even for the ones that are they're not all body image based. And even for the restrictive EDs that are body-imaged based, it's not always about not wanting to be fat. It can simply be wanting an observable way to measure how much control you have, can be making yourself thin as an act of self-harm, can be making yourself look as sick as you feel on the inside, can be because of sexual trauma, can be because of gender dysphoria, etc. And even for the ones that are about not wanting to be fat, in the majority of cases the person only holds that belief for themselves and not anyone else. \n\nWe live in a society where needing to \"you lose weight and not be fat or else you're worthless\" is plastered everywhere, it's not your fault if you end up internalizing it. In fact, a lot of people with those kinds of eating disorders were overweight themselves at some point, and that's where it started. It's insane to me that people consider those with body image based eating disorders to be the perpetrators of diet culture, and not some of the most obvious victims to it.",
      "created_utc": 1733653192.0,
      "score": 33,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        }
      ]
    },
    {
      "id": "m10rfol",
      "author": "Any-Sir-5541",
      "body": "Tbh. I’m anorexic and I think I’m naturally more fat phobic then others in the sense that I don’t want to get fat and I kind of feel bad for those who are heavier than I am because I’ve been there. It’s like a trigger to me. But I wouldn’t never bring anyone down for it unless they genuinely asked for my input. I’m not a mean girl.",
      "created_utc": 1733660333.0,
      "score": 24,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        }
      ]
    },
    {
      "id": "m11mm5x",
      "author": "tiny_beast29",
      "body": "Soooo true. For me it's absolutely internalised fat-phobia towards MYSELF, but definitely not for others! \nI'm pansexual, I think people are hot regardless of gender or body-type. I'm attracted to fat people. I LOVE big women especially. But the world taught me a lesson pretty early on, that the majority of people are not like me... \n\nBecause when I was overweight I was bullied. I was always reminded how I'd be more attractive if I lost weight, girls in my class were always bragging about their restrictive diets and how much weight they'd lost, which size clothes they can fit. When I lost weight (not by choice, but by not eating for weeks because of anxiety) people started to notice me. They were nicer, kinder. All the girls wanted to know \"my secret\", all the boys who previously bullied me suddenly wanted to fuck me. It was addictive. I'm here now so you can guess how it turned out...",
      "created_utc": 1733673360.0,
      "score": 9,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        }
      ]
    },
    {
      "id": "m10zimp",
      "author": "Crafty-Giraffe-1303",
      "body": "one guy thought i was genuinely scared of fat people and that anorexia was just me hating on plus size people",
      "created_utc": 1733664435.0,
      "score": 6,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        }
      ]
    },
    {
      "id": "m14rbik",
      "author": "thxrpy",
      "body": "Yes this!!! I absolutely do not judge anyone else for their body type I literally just hate myself lmao",
      "created_utc": 1733710803.0,
      "score": 0,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        }
      ]
    },
    {
      "id": "m13tn0m",
      "author": "Chaerin_Sistas",
      "body": "I hate how everyone assumed you’re somr vain Regina George i mean sure plenty of people do it for aesthetics but its still a mental illness and there is a huge control/self harm factor",
      "created_utc": 1733698481.0,
      "score": 3,
      "context": [
        {
          "id": "m10h7jy",
          "author": "ed_mayo_onlyfans",
          "body": "That it’s to look thin because of skinny supermodels and the like",
          "created_utc": 1733653786.0
        }
      ]
    },
    {
      "id": "m11n68b",
      "author": "tiny_beast29",
      "body": "Yepp. Gender dysphoria is one hell of a reason to lose your boobs!",
      "created_utc": 1733673541.0,
      "score": 8,
      "context": [
        {
          "id": "m0zi4tc",
          "author": "itscullenyo",
          "body": "Eating disorders are only for teen girls. It's pretty invalidating as a transmasc adult",
          "created_utc": 1733633155.0
        }
      ]
    },
    {
      "id": "m101han",
      "author": "Opposite-Albatross38",
      "body": "This!!",
      "created_utc": 1733643231.0,
      "score": 3,
      "context": [
        {
          "id": "m0zi4tc",
          "author": "itscullenyo",
          "body": "Eating disorders are only for teen girls. It's pretty invalidating as a transmasc adult",
          "created_utc": 1733633155.0
        }
      ]
    },
    {
      "id": "m10gylv",
      "author": "NorthLight2103",
      "body": "Same! I’m also a trans man, teenager though.",
      "created_utc": 1733653618.0,
      "score": 2,
      "context": [
        {
          "id": "m0zi4tc",
          "author": "itscullenyo",
          "body": "Eating disorders are only for teen girls. It's pretty invalidating as a transmasc adult",
          "created_utc": 1733633155.0
        }
      ]
    },
    {
      "id": "m11r43q",
      "author": "KennaLikesPizza",
      "body": "Absolutely this. I wish I could gain a little weight and build some more muscle but I just can't get myself to eat more than I already do, which isn't much.",
      "created_utc": 1733674816.0,
      "score": 4,
      "context": [
        {
          "id": "m10aeu7",
          "author": "ZhiYoNa",
          "body": "We all want to be thin. I honestly want to gain weight and build muscle. My problem is that I’m addicted to restriction and food is expensive / a pain to cook / not particularly attractive / easy to ignore.",
          "created_utc": 1733649198.0
        }
      ]
    },
    {
      "id": "m14qlze",
      "author": "CryptidPluto",
      "body": "Mine a lot of the time is \"eat this specific food or else everything tastes like ashes\" so if I can't eat that food, nothing tastes good and it makes me nauseous...",
      "created_utc": 1733710531.0,
      "score": 3,
      "context": [
        {
          "id": "m0zyl39",
          "author": "None",
          "body": "that ARFID is just picky eating.\n ppl should  realize  it’s more then that.  also some just think everyone with an eating disorder is skinny which is not true cuz you can have an ed with different body types.\nAND ALSO ANOREXIA ISNT JUST ABOUT NOT WANTING TO EAT!",
          "created_utc": 1733641433.0
        }
      ]
    },
    {
      "id": "m144mdc",
      "author": "the_grays_of_ink",
      "body": "Yup. And there are periods where is obvious, everyone knows, and no one’s doing anything, even post dx. People can restrict heavily and obviously for months and even if able to access treatment, have long stretches of boring, repetitive restriction with the most bland life imaginable. Not glamorous, not fun, not dramatic. Just tiresome.",
      "created_utc": 1733702404.0,
      "score": 3,
      "context": [
        {
          "id": "m12pbm1",
          "author": "softerthansilence",
          "body": "I don’t know if it counts as a stereotype, but I hate how in eating disorder media, they make every moment so dramatic. I understand why they do it, visual mediums like that don’t allow for a lot of downtime, but I’ve went for weeks and even a few months at some point where I was simultaneously restricting heavily and living my normal life. \n\nIt was with a lot more sugar free energy drinks, but there’s a weird amount of time when you’re waiting for the other shoe to drop and someone to find out while hoping the other shoe doesn’t drop and no one finds out.",
          "created_utc": 1733685502.0
        }
      ]
    },
    {
      "id": "m112i9g",
      "author": "misseviscerator",
      "body": "Yeah this is why the most effective treatment - early intervention - doesn’t end up happening. Because no one takes it seriously until you’re in super deep.\n\nI lost 1/3 of my body weight in 4 months. Only in the last month did I become underweight, and even when I sought help at that point, my BMI was 14 and they said they’ll only refer at 13?? So I starved myself more, and by the time I hit that target I was so far gone that I refused to engage with services anymore. I didn’t want the help anymore, because I’d made myself so unwell I couldn’t think rationally.",
      "created_utc": 1733665776.0,
      "score": 7,
      "context": [
        {
          "id": "m10qg7y",
          "author": "zippiDOTjpg",
          "body": "Anorexics only ever starve, they’ll never have episodes of binging and then restrict as punishment (which is literally Type 2 anorexia), and they HAVE to be underweight to be anorexic. Do you think all anorexics just become malnourished overnight as soon as they start developing the disorder? It’s a mental disorder with physical symptoms, not the other way around. I tried getting help for my eating disorder at 14 and was told there’s no point sending me to a specialist because I didn’t meet the weight requirement to be anorexic, and I never asked for help again. I’ll be 24 next month, and I still don’t have a healthy relationship with food. Fuck stereotypes.",
          "created_utc": 1733659753.0
        }
      ]
    },
    {
      "id": "m141qsw",
      "author": "VirtualApricot",
      "body": "As an aside, I don’t like the assumption in treatment centers that anytime someone doesn’t life a food, it’s because it’s a “fear food”.. \n\nNo, I’m not afraid of the calories of mushrooms, tomatoes, melons, berries, eggs, or milk.. (ARFID) I truly whole-heartedly hate their texture, taste, appearance.. forcing me to eat them or have a supplement creates more anxiety and negative associations with food",
      "created_utc": 1733701372.0,
      "score": 4,
      "context": [
        {
          "id": "m140bhy",
          "author": "VirtualApricot",
          "body": "That people with AN-R are super smart, talented, organized, and over achievers. \n\nI have ASD, ADHD, and a learning disorder. I do not life up to my stereotype and it’s embarrassing. I don’t even life up to the expectations of a disease/mental illnesses",
          "created_utc": 1733700864.0
        }
      ]
    },
    {
      "id": "m1ofmn3",
      "author": "Stingwing4oba",
      "body": "That, and skipping meals is my way of purging. I had to explain that to a close friend who I finally opened up to about my ED.",
      "created_utc": 1734003719.0,
      "score": 1,
      "context": [
        {
          "id": "m1nnnzl",
          "author": "ShiftyGooseGoblin",
          "body": "The only way to purge is by vomiting. I used to get praised for being so \"healthy\" and \"passionate about fitness\" when in reality I was staying at the gym until I physically couldn't move because it was the only way I felt I earned the calories.",
          "created_utc": 1733985480.0
        }
      ]
    },
    {
      "id": "m13n1ma",
      "author": "Stingwing4oba",
      "body": "There are more than one book titles. This one was about how women are legit \"Creating Eating Disorders\". That was what AI was mad about. Yes, it was my fault for forgetting to say that part, but please consider getting all the information before you point out faults. You also basically are accusing all who are looking at this post and commenting that it is all our fault.\n\nI also own a book called Dying For Attention based on a mother's loss of her son due to Anorexia and how it happened because he wanted to build muscles and for in.\n\nAnd no, I am not a specialist of any sort or in college to be one. 100% promise",
      "created_utc": 1733696239.0,
      "score": 2,
      "context": [
        {
          "id": "m10napn",
          "author": "DebateObjective2787",
          "body": "IDK why the book made you mad; that sounds like more of a *you* problem. Considering that Starving For Attention is a book about the author's own struggle with anorexia and how it nearly killed her.",
          "created_utc": 1733657803.0
        }
      ]
    },
    {
      "id": "m19w9ii",
      "author": "Stingwing4oba",
      "body": "I want to be like the female body builders. Muscles and six pack abs. I still do. But, I don't want to starve myself anymore.to get there, I just... Well, I am back at that point where I started too",
      "created_utc": 1733786687.0,
      "score": 2,
      "context": [
        {
          "id": "m19svfk",
          "author": "zom666ie_",
          "body": "that we all want to be stick thin/really boney all over. I want my upper half to be flat and thin but I like having what butt I do have I'm sorry 😭",
          "created_utc": 1733785487.0
        }
      ]
    },
    {
      "id": "m2bf4od",
      "author": "Stingwing4oba",
      "body": "I thought about this one too and it seems that a person who isn't underweight, or underweight yet, is either faking or not needing the same level of care. Especially since the issue is \"minor\" at the time. I am going through a 3rd episode of Anorexia, and the last one was \"minor\" and even though I am still a bit over \"normal\", I still am pushing hard to get and keep treatments to prevent myself from dropping back into the \"underweight\" category.\n\nSadly, if people would take others seriously at this stage too, then treatment can also begin as soon as possible to help with better outcomes.\n\nWhich brings another stereotype, if a person has their eating disorder caught early, then the person will be in recovery faster and not have to deal with the after effects. I have seen this assumption so many times and it's not true.",
      "created_utc": 1734350289.0,
      "score": 1,
      "context": [
        {
          "id": "m1w2xot",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1734112082.0
        }
      ]
    },
    {
      "id": "m14q3e9",
      "author": "CryptidPluto",
      "body": "Yes! Like staahhhp, it makes it harder!",
      "created_utc": 1733710334.0,
      "score": 9,
      "context": [
        {
          "id": "m0zqqu3",
          "author": "No-Event4806",
          "body": "Anorexics don’t eat any food. Like yeah we’ll fast but we do eat *some* food otherwise we’d all be dead",
          "created_utc": 1733637080.0
        },
        {
          "id": "m13t8g4",
          "author": "Chaerin_Sistas",
          "body": "THIS EXACTLY and its one of the main reasons why I hate eating in front of people who know i struggle with eating because they’re like “oh you’re eating i thought you said you were anorexic”\nOr sometimes i eat all of my day’s worth of calories in an OMAD and my mom or my sisters are like “wow you’re eating so much” 🫤",
          "created_utc": 1733698340.0
        }
      ]
    },
    {
      "id": "m1aqlfy",
      "author": "ilovepotatoes93",
      "body": "YES. I never eat breakfast and usually feel gross when I do... but on the days where I'm tempted and cave in, my aunt will show enthusiasm that I'm eating because I \"never eat breakfast.\" I know she means well but it makes me feel like a failure lol",
      "created_utc": 1733797675.0,
      "score": 7,
      "context": [
        {
          "id": "m0zqqu3",
          "author": "No-Event4806",
          "body": "Anorexics don’t eat any food. Like yeah we’ll fast but we do eat *some* food otherwise we’d all be dead",
          "created_utc": 1733637080.0
        },
        {
          "id": "m13t8g4",
          "author": "Chaerin_Sistas",
          "body": "THIS EXACTLY and its one of the main reasons why I hate eating in front of people who know i struggle with eating because they’re like “oh you’re eating i thought you said you were anorexic”\nOr sometimes i eat all of my day’s worth of calories in an OMAD and my mom or my sisters are like “wow you’re eating so much” 🫤",
          "created_utc": 1733698340.0
        }
      ]
    },
    {
      "id": "m18sizr",
      "author": "No-Event4806",
      "body": "Exactly. I’ve never gone more than 10 waking hours without food (and honestly, those times aren’t even ED related lol), but what I do eat is not enough🫠",
      "created_utc": 1733773896.0,
      "score": 7,
      "context": [
        {
          "id": "m0zqqu3",
          "author": "No-Event4806",
          "body": "Anorexics don’t eat any food. Like yeah we’ll fast but we do eat *some* food otherwise we’d all be dead",
          "created_utc": 1733637080.0
        },
        {
          "id": "m18etb3",
          "author": "nervous_veggie",
          "body": "That anorexics fast. Many people eat multiple times per day, just restricted amounts.",
          "created_utc": 1733769675.0
        }
      ]
    },
    {
      "id": "m10slj7",
      "author": "dollyloves",
      "body": "Realest comment ever",
      "created_utc": 1733661006.0,
      "score": 23,
      "context": [
        {
          "id": "m1038v1",
          "author": "dollyloves",
          "body": "That all people with eating disorders have to be thin 😭",
          "created_utc": 1733644378.0
        },
        {
          "id": "m10fc6b",
          "author": "julesisnotsober",
          "body": "Like girl I developed this for a reason??",
          "created_utc": 1733652515.0
        }
      ]
    },
    {
      "id": "m11pmmv",
      "author": "tiny_beast29",
      "body": "I feel this so much! I've spent years without any fast food. When I started recovery eating a burger was one of my goals!",
      "created_utc": 1733674339.0,
      "score": 3,
      "context": [
        {
          "id": "m10548k",
          "author": "sprinklefawn",
          "body": "‘People with anorexia hate food’\n\nWrong! Many of us LOVE it, we’re just scared of eating it.",
          "created_utc": 1733645614.0
        },
        {
          "id": "m11jjy5",
          "author": "CaliforniaPotato",
          "body": "REAL I literally didn't eat a burger for like 2 years straight like for some reason that was my biggest fear food?? I still haven't gotten over that... I'll only eat a burger now if my dad makes it at home which is once very very rarely so I avoid them even still unfortunately even though I'm a lot mentally better for the most part. Some ED habits/avoidances stick with you and I'm not sure if I'll ever be \"normal\" again. And by normal i mean how I used to be mentally about food.",
          "created_utc": 1733672324.0
        }
      ]
    },
    {
      "id": "m10rytq",
      "author": "None",
      "body": "right but my point is that you're not fatphobic BECAUSE you're anorexic",
      "created_utc": 1733660642.0,
      "score": 11,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        },
        {
          "id": "m10rfol",
          "author": "Any-Sir-5541",
          "body": "Tbh. I’m anorexic and I think I’m naturally more fat phobic then others in the sense that I don’t want to get fat and I kind of feel bad for those who are heavier than I am because I’ve been there. It’s like a trigger to me. But I wouldn’t never bring anyone down for it unless they genuinely asked for my input. I’m not a mean girl.",
          "created_utc": 1733660333.0
        }
      ]
    },
    {
      "id": "m11sj44",
      "author": "Worthless-Hyena",
      "body": "Yes, I'm anorexic with a few 'mix in's', and I'm pansexual. I'm only fatphobic to myself. But everyone else is so hot, I would love to find someone on the bigger side one day, because for me A. It's part of my culture B. They generally look really nice! But bullying made it so I can't view myself as beautiful if I'm slightly overweight. In this day and age, people are not all too kind. Hopefully, one day, that will change",
      "created_utc": 1733675274.0,
      "score": 2,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        },
        {
          "id": "m11mm5x",
          "author": "tiny_beast29",
          "body": "Soooo true. For me it's absolutely internalised fat-phobia towards MYSELF, but definitely not for others! \nI'm pansexual, I think people are hot regardless of gender or body-type. I'm attracted to fat people. I LOVE big women especially. But the world taught me a lesson pretty early on, that the majority of people are not like me... \n\nBecause when I was overweight I was bullied. I was always reminded how I'd be more attractive if I lost weight, girls in my class were always bragging about their restrictive diets and how much weight they'd lost, which size clothes they can fit. When I lost weight (not by choice, but by not eating for weeks because of anxiety) people started to notice me. They were nicer, kinder. All the girls wanted to know \"my secret\", all the boys who previously bullied me suddenly wanted to fuck me. It was addictive. I'm here now so you can guess how it turned out...",
          "created_utc": 1733673360.0
        }
      ]
    },
    {
      "id": "m1323yj",
      "author": "vizziniproject",
      "body": "My second relapse is when I started to realize that I actually liked my deflated chest because I looked more like a boy/man. Now, I've been diagnosed with gender dysphoria and am getting top surgery. When I told my social worker (or whatever he is) that I was getting the surgery, he said , \"Are you sure you just don't want the extra fat off your body?\"",
      "created_utc": 1733689519.0,
      "score": 3,
      "context": [
        {
          "id": "m0zi4tc",
          "author": "itscullenyo",
          "body": "Eating disorders are only for teen girls. It's pretty invalidating as a transmasc adult",
          "created_utc": 1733633155.0
        },
        {
          "id": "m11n68b",
          "author": "tiny_beast29",
          "body": "Yepp. Gender dysphoria is one hell of a reason to lose your boobs!",
          "created_utc": 1733673541.0
        }
      ]
    },
    {
      "id": "m19x1g7",
      "author": "zom666ie_",
      "body": "yesss honestly a lot of people I've met have had this goal in mind. wanting to be toned/muscular instead of boney",
      "created_utc": 1733786959.0,
      "score": 1,
      "context": [
        {
          "id": "m19svfk",
          "author": "zom666ie_",
          "body": "that we all want to be stick thin/really boney all over. I want my upper half to be flat and thin but I like having what butt I do have I'm sorry 😭",
          "created_utc": 1733785487.0
        },
        {
          "id": "m19w9ii",
          "author": "Stingwing4oba",
          "body": "I want to be like the female body builders. Muscles and six pack abs. I still do. But, I don't want to starve myself anymore.to get there, I just... Well, I am back at that point where I started too",
          "created_utc": 1733786687.0
        }
      ]
    },
    {
      "id": "m19hlzw",
      "author": "nervous_veggie",
      "body": "that's probably the most common pattern in ppl with AN, at least with people i know/have met in treatment! i always worried about the impact of fasting on my metabolism and my digestion, and it's just never been part of my ED.",
      "created_utc": 1733781707.0,
      "score": 3,
      "context": [
        {
          "id": "m0zqqu3",
          "author": "No-Event4806",
          "body": "Anorexics don’t eat any food. Like yeah we’ll fast but we do eat *some* food otherwise we’d all be dead",
          "created_utc": 1733637080.0
        },
        {
          "id": "m18etb3",
          "author": "nervous_veggie",
          "body": "That anorexics fast. Many people eat multiple times per day, just restricted amounts.",
          "created_utc": 1733769675.0
        },
        {
          "id": "m18sizr",
          "author": "No-Event4806",
          "body": "Exactly. I’ve never gone more than 10 waking hours without food (and honestly, those times aren’t even ED related lol), but what I do eat is not enough🫠",
          "created_utc": 1733773896.0
        }
      ]
    },
    {
      "id": "m11u67l",
      "author": "tiny_beast29",
      "body": "Oh my god, it's soooo good to see someone with the same perspective ♥️♥️♥️ not one person in my life truly understood my feelings of \"fat phobia\" so far. I'm not fat phobic, but I have a great deal of knowledge of human nature and know that most people are. Also as you put it so well, the world is definitely not kind. I have generalised anxiety and I'm a people pleaser with a shit ton of trauma, of course I'm gonna think that people'd hate me if I got overweight again!",
      "created_utc": 1733675806.0,
      "score": 5,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        },
        {
          "id": "m11mm5x",
          "author": "tiny_beast29",
          "body": "Soooo true. For me it's absolutely internalised fat-phobia towards MYSELF, but definitely not for others! \nI'm pansexual, I think people are hot regardless of gender or body-type. I'm attracted to fat people. I LOVE big women especially. But the world taught me a lesson pretty early on, that the majority of people are not like me... \n\nBecause when I was overweight I was bullied. I was always reminded how I'd be more attractive if I lost weight, girls in my class were always bragging about their restrictive diets and how much weight they'd lost, which size clothes they can fit. When I lost weight (not by choice, but by not eating for weeks because of anxiety) people started to notice me. They were nicer, kinder. All the girls wanted to know \"my secret\", all the boys who previously bullied me suddenly wanted to fuck me. It was addictive. I'm here now so you can guess how it turned out...",
          "created_utc": 1733673360.0
        },
        {
          "id": "m11sj44",
          "author": "Worthless-Hyena",
          "body": "Yes, I'm anorexic with a few 'mix in's', and I'm pansexual. I'm only fatphobic to myself. But everyone else is so hot, I would love to find someone on the bigger side one day, because for me A. It's part of my culture B. They generally look really nice! But bullying made it so I can't view myself as beautiful if I'm slightly overweight. In this day and age, people are not all too kind. Hopefully, one day, that will change",
          "created_utc": 1733675274.0
        }
      ]
    },
    {
      "id": "m11xils",
      "author": "Worthless-Hyena",
      "body": "Yess, agreed I've never met someone with the same perspective either im glad there is some hope to the world.🩵🩵 YES, I have really bad social anxiety and anxiety in general, so I think (because it has happened before) that once gaining the weight back, people are going to go back to bullying me. They aren't nice about me being skinny ish but in my mind, that something to be happy ish about! That's how it sort of started. People kept saying, \" You're too fat. You need to be thinner.\" or \" Go diet or restrict it will do you some good\", well I've done it, but they still aren't happy",
      "created_utc": 1733676869.0,
      "score": 4,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        },
        {
          "id": "m11mm5x",
          "author": "tiny_beast29",
          "body": "Soooo true. For me it's absolutely internalised fat-phobia towards MYSELF, but definitely not for others! \nI'm pansexual, I think people are hot regardless of gender or body-type. I'm attracted to fat people. I LOVE big women especially. But the world taught me a lesson pretty early on, that the majority of people are not like me... \n\nBecause when I was overweight I was bullied. I was always reminded how I'd be more attractive if I lost weight, girls in my class were always bragging about their restrictive diets and how much weight they'd lost, which size clothes they can fit. When I lost weight (not by choice, but by not eating for weeks because of anxiety) people started to notice me. They were nicer, kinder. All the girls wanted to know \"my secret\", all the boys who previously bullied me suddenly wanted to fuck me. It was addictive. I'm here now so you can guess how it turned out...",
          "created_utc": 1733673360.0
        },
        {
          "id": "m11sj44",
          "author": "Worthless-Hyena",
          "body": "Yes, I'm anorexic with a few 'mix in's', and I'm pansexual. I'm only fatphobic to myself. But everyone else is so hot, I would love to find someone on the bigger side one day, because for me A. It's part of my culture B. They generally look really nice! But bullying made it so I can't view myself as beautiful if I'm slightly overweight. In this day and age, people are not all too kind. Hopefully, one day, that will change",
          "created_utc": 1733675274.0
        },
        {
          "id": "m11u67l",
          "author": "tiny_beast29",
          "body": "Oh my god, it's soooo good to see someone with the same perspective ♥️♥️♥️ not one person in my life truly understood my feelings of \"fat phobia\" so far. I'm not fat phobic, but I have a great deal of knowledge of human nature and know that most people are. Also as you put it so well, the world is definitely not kind. I have generalised anxiety and I'm a people pleaser with a shit ton of trauma, of course I'm gonna think that people'd hate me if I got overweight again!",
          "created_utc": 1733675806.0
        }
      ]
    },
    {
      "id": "m122nx9",
      "author": "tiny_beast29",
      "body": "They'd never be happy. If you're \"too skinny\" they'll either tell you to put on weight, or envy you. That's why trying to please people with your looks is the worst thing you can do to yourself. Good advice from my therapist: Treat yourself the way YOU treat other people, not like how other people treat you 💚",
      "created_utc": 1733678514.0,
      "score": 3,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        },
        {
          "id": "m11mm5x",
          "author": "tiny_beast29",
          "body": "Soooo true. For me it's absolutely internalised fat-phobia towards MYSELF, but definitely not for others! \nI'm pansexual, I think people are hot regardless of gender or body-type. I'm attracted to fat people. I LOVE big women especially. But the world taught me a lesson pretty early on, that the majority of people are not like me... \n\nBecause when I was overweight I was bullied. I was always reminded how I'd be more attractive if I lost weight, girls in my class were always bragging about their restrictive diets and how much weight they'd lost, which size clothes they can fit. When I lost weight (not by choice, but by not eating for weeks because of anxiety) people started to notice me. They were nicer, kinder. All the girls wanted to know \"my secret\", all the boys who previously bullied me suddenly wanted to fuck me. It was addictive. I'm here now so you can guess how it turned out...",
          "created_utc": 1733673360.0
        },
        {
          "id": "m11sj44",
          "author": "Worthless-Hyena",
          "body": "Yes, I'm anorexic with a few 'mix in's', and I'm pansexual. I'm only fatphobic to myself. But everyone else is so hot, I would love to find someone on the bigger side one day, because for me A. It's part of my culture B. They generally look really nice! But bullying made it so I can't view myself as beautiful if I'm slightly overweight. In this day and age, people are not all too kind. Hopefully, one day, that will change",
          "created_utc": 1733675274.0
        },
        {
          "id": "m11u67l",
          "author": "tiny_beast29",
          "body": "Oh my god, it's soooo good to see someone with the same perspective ♥️♥️♥️ not one person in my life truly understood my feelings of \"fat phobia\" so far. I'm not fat phobic, but I have a great deal of knowledge of human nature and know that most people are. Also as you put it so well, the world is definitely not kind. I have generalised anxiety and I'm a people pleaser with a shit ton of trauma, of course I'm gonna think that people'd hate me if I got overweight again!",
          "created_utc": 1733675806.0
        },
        {
          "id": "m11xils",
          "author": "Worthless-Hyena",
          "body": "Yess, agreed I've never met someone with the same perspective either im glad there is some hope to the world.🩵🩵 YES, I have really bad social anxiety and anxiety in general, so I think (because it has happened before) that once gaining the weight back, people are going to go back to bullying me. They aren't nice about me being skinny ish but in my mind, that something to be happy ish about! That's how it sort of started. People kept saying, \" You're too fat. You need to be thinner.\" or \" Go diet or restrict it will do you some good\", well I've done it, but they still aren't happy",
          "created_utc": 1733676869.0
        }
      ]
    },
    {
      "id": "m123cff",
      "author": "Worthless-Hyena",
      "body": "True they won't, don't mean I won't try. I'll have to think about that 💛 Thank you",
      "created_utc": 1733678731.0,
      "score": 2,
      "context": [
        {
          "id": "m10ba1m",
          "author": "None",
          "body": "genuinely hate the stereotype that we're all fatphobic",
          "created_utc": 1733649777.0
        },
        {
          "id": "m11mm5x",
          "author": "tiny_beast29",
          "body": "Soooo true. For me it's absolutely internalised fat-phobia towards MYSELF, but definitely not for others! \nI'm pansexual, I think people are hot regardless of gender or body-type. I'm attracted to fat people. I LOVE big women especially. But the world taught me a lesson pretty early on, that the majority of people are not like me... \n\nBecause when I was overweight I was bullied. I was always reminded how I'd be more attractive if I lost weight, girls in my class were always bragging about their restrictive diets and how much weight they'd lost, which size clothes they can fit. When I lost weight (not by choice, but by not eating for weeks because of anxiety) people started to notice me. They were nicer, kinder. All the girls wanted to know \"my secret\", all the boys who previously bullied me suddenly wanted to fuck me. It was addictive. I'm here now so you can guess how it turned out...",
          "created_utc": 1733673360.0
        },
        {
          "id": "m11sj44",
          "author": "Worthless-Hyena",
          "body": "Yes, I'm anorexic with a few 'mix in's', and I'm pansexual. I'm only fatphobic to myself. But everyone else is so hot, I would love to find someone on the bigger side one day, because for me A. It's part of my culture B. They generally look really nice! But bullying made it so I can't view myself as beautiful if I'm slightly overweight. In this day and age, people are not all too kind. Hopefully, one day, that will change",
          "created_utc": 1733675274.0
        },
        {
          "id": "m11u67l",
          "author": "tiny_beast29",
          "body": "Oh my god, it's soooo good to see someone with the same perspective ♥️♥️♥️ not one person in my life truly understood my feelings of \"fat phobia\" so far. I'm not fat phobic, but I have a great deal of knowledge of human nature and know that most people are. Also as you put it so well, the world is definitely not kind. I have generalised anxiety and I'm a people pleaser with a shit ton of trauma, of course I'm gonna think that people'd hate me if I got overweight again!",
          "created_utc": 1733675806.0
        },
        {
          "id": "m11xils",
          "author": "Worthless-Hyena",
          "body": "Yess, agreed I've never met someone with the same perspective either im glad there is some hope to the world.🩵🩵 YES, I have really bad social anxiety and anxiety in general, so I think (because it has happened before) that once gaining the weight back, people are going to go back to bullying me. They aren't nice about me being skinny ish but in my mind, that something to be happy ish about! That's how it sort of started. People kept saying, \" You're too fat. You need to be thinner.\" or \" Go diet or restrict it will do you some good\", well I've done it, but they still aren't happy",
          "created_utc": 1733676869.0
        },
        {
          "id": "m122nx9",
          "author": "tiny_beast29",
          "body": "They'd never be happy. If you're \"too skinny\" they'll either tell you to put on weight, or envy you. That's why trying to please people with your looks is the worst thing you can do to yourself. Good advice from my therapist: Treat yourself the way YOU treat other people, not like how other people treat you 💚",
          "created_utc": 1733678514.0
        }
      ]
    }
  ]
}