{
  "id": "1hazrtt",
  "subreddit": "EatingDisorders",
  "author": "Veldin-Citizen",
  "created_utc": 1733830427.0,
  "title": "I can't enjoy life until I'm skinny. I need advice.",
  "selftext": "First time posting here, I don't know where else to go.\n\nFor years I'm trying to lose weight. I'm slightly overweight and my life consists of diets and overeating.\n\nI don't buy myself beautiful clothes because \"I don't deserve them 'til I'm skinny\".\nI don't go swimming (which I used to like) because I don't deserve it. Other sports I used to like included.\nI don't go to nice restaurants, because I'm not skinny enough.\nI don't go on dates with my boyfriend until I'm skinny. He intivtes me to nice places and I decline because I don't deserve having a good time with him. All we do is watching movies at home, because of me.\nI don't dye my hair until I'm skinny.\nI try to avoid the mirror until I lose weight. \nI try to not look at my belly. I feel so disconnected from my body but at the same time I don't.\nI don't even like having a shower or generally I hate to undress myself. My jiggly tummy just makes me sick and I try to avoid looking at myself. \n\nI don't know what else I can do. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hazrtt/i_cant_enjoy_life_until_im_skinny_i_need_advice/",
  "score": 143,
  "num_comments": 39,
  "comments": [
    {
      "id": "m1fuvid",
      "author": "starstarson",
      "body": "Just gonna forward what my psychologist said to me (paraphrased): you have to accept the body you have right now. Before you even think about loosing weight, you have to have build a healthy relationship to food and body image. And once you’ve built that, losing weight is about small changes, like for example removing one of two snacks in a day. A matter of like 300 cls less than what you’d normally eat. \n\nTry to think about what you would say to yourself if you were a friend of yours. Like, if your bff told you “I don’t deserve to be happy because I’m not skinny”. Would you agree with her? I think a lot of people are very hard on themselves. \n\nI wish you a lot of happiness in the future :(",
      "created_utc": 1733873113.0,
      "score": 51,
      "context": []
    },
    {
      "id": "m1gjxrj",
      "author": "Alive-Club2181",
      "body": "This was heartbreaking to read, but I feel you, I really do. I’m struggling to find the right words and I don’t have a solution because I struggle with the same thing but please know that you do deserve to live your life no matter what your body looks like, or what you think it looks like. You deserve beautiful clothes, swimming and going out with your boyfriend — **no matter what your body looks like**.",
      "created_utc": 1733882242.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m1gulwz",
      "author": "alienprincess111",
      "body": "I don't know if this is helpful but I thought like you, then realized that being skinny made it worse. I thought I'd have a great social life and do all these things, but I didn't want to do anything or talk to anyone because it would interfere with my ED. It was so ironic.",
      "created_utc": 1733886328.0,
      "score": 14,
      "context": []
    },
    {
      "id": "m1igdn4",
      "author": "FloridaMomm",
      "body": "The sad secret is that getting skinnier won’t make this mindset better-you just keep moving the goalpost of what is skinny enough. I accidentally scrolled past a picture of my husband yesterday that he took (body checking) before his first day of treatment for anorexia and I **wept** because he was just bones. He was so scary thin and looked so so horrible. And in his own twisted view he still wasn’t skinny enough. So the real problem isn’t your size, it’s the mindset tying your size to your self worth. That’s where you need to put in the work. \n\nI grew up a chubby kid and diet culture has been in my face all my life. It was hard work but I got to a place of body neutrality (not necessarily positivity just accepting that this is the body I’m in) and allowing myself to live my life. I have had to lose weight in a slow sustainable way for my health, but doing it the right way (proper nutrition and no crash diets) takes a looooooong time. I don’t deserve to suffer while that happens. And the goal isn’t to be skinny like it was in my teens-it is to be healthy so I can better achieve the things I want to do. My body has done great things for me at every size and shape \n\nYou deserve to have good experiences",
      "created_utc": 1733918685.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m1hr0uy",
      "author": "None",
      "body": "I have felt this my entire life.",
      "created_utc": 1733902201.0,
      "score": 9,
      "context": []
    },
    {
      "id": "m1i1gaf",
      "author": "None",
      "body": "If it helps, I was my most unhappy at my thinnest",
      "created_utc": 1733909264.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m1iny9s",
      "author": "AdditionalNews4485",
      "body": "Just so you know… that’s your eating disorder talking. Not you. You deserve so much more than what your ED is telling you. I highly recommend the book ‘Life without Ed’ \n\nYour post was so relatable. I’ve been there and I can tell you recovery is possible and the grass IS greener on the other side of it",
      "created_utc": 1733922305.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1irj89",
      "author": "None",
      "body": "I go through the same thing, and I understand how devastating it feels. I also feel like I don’t deserve to do the things I love unless I’m at my \"ideal weight.\" But my therapist said something that really made me think: think about how many things you love and are denying yourself just because of something that only exists in your head. And it’s true. We might be overweight, but no one is stopping us from living, swimming, having fun, or being loved—except ourselves. This pressure comes from within, and while we’re waiting for the change, we’re losing precious moments and experiences. I think the first step is trying to be kinder to ourselves, one day at a time.",
      "created_utc": 1733923818.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m1j3n4i",
      "author": "Separate_Plankton793",
      "body": "I’m so sorry you are going through this and have felt the same so many times in my past. One thing that eventually helped me is finding things that I valued more than being thin and brought me more joy. It was things totally unrelated to how I looked like hiking in a beautiful setting or volunteering with animals. Maybe start with some things where you aren’t around as many people to lessen the pressure to feel thin. \n\nOne more thing as I still struggle with wondering if people think I’m fat and hating my body - most people ate too focused on what is going on in their life to notice anything about my body! \n\nHope it gets better for you! Always rooting for recovery.",
      "created_utc": 1733928438.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m1kbfr1",
      "author": "Liv0005",
      "body": "Lots of excellent supportive comments here. I had one thing to add... Consider a thought experiment and maybe give it a go- \n\nWhat if you let yourself do the things you enjoy? Get a dress you like, go on a fancy dinner date with your guy in said dress and then go dancing? What would happen? I wonder truly, if you start shifting focus on finding pleasures in your life outside of thinness (or food) if you might find your mindset shift?\n\nLastly, wanted to let you know, I'm a therapist myself. I have struggled with multiple EDs since adolescence. I am finally healing. I started seeing an EMDR therapist and a psychiatrist because I was dealing with PTSD and binge eating at the time. Through emdr (and internal family systems therapy), I processed a lot of my food related trauma. I also started taking naltrexone and Wellbutrin (contrave). And I have lost over 70lb in 2 years. Though I'm still technically overweight, I am feeling much better mentally and I'm so much kinder to myself. \n\nI hope you are able to find a way to be content and find moments of joy in your life. ❤️",
      "created_utc": 1733942175.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1ibwmd",
      "author": "universe93",
      "body": "What if you lived life now like you were skinny? Sure it may not feel right but if you do the things you’re putting off and focus on enjoying them mindfully and really throwing yourself into the experience it will feel more and more natural each time. Do it even if you think you’re not skinny enough or even if you think you don’t deserve it",
      "created_utc": 1733916162.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1jbegn",
      "author": "Interesting_Heart_20",
      "body": "  Your subconscious is so filled with these  negative thoughts, it wont let you enjoy life anymore. \nI was in the same spot, I didn’t go to senior prom and so and so bc I just “wasn’t” where I wanted to be in terms of fitness. I had a little belly but had good muscle mass due to football but I wanted to be like shredded and have hollow cheeks and stuff like that so damn bad, It was all I cared about for 1 year straight, to the point where lost all my muscle mass due to starving and restricting, then getting fat by binging. The true killer is what it does to those who are around you. Becoming so stuck up on the thought loop that I am “Disgusting” caused me to neglect everyone around me, making it even worse as I pushed them away, i didnt realize I was making it worse. What we look like as people has little to do with what makes us human and our soul. \n    You are not what you look like.\n       I strongly suggest a psychedelic mushroom trip. It helped me get rid of all of those negative thoughts and connect with myself in a deeper level.\n   I used to be a metrosexual fr, now I don’t live for vanity, I accept who I am.\n     This thought process made it effortlessly easy to get back into the gym since I had no subconscious thought of “u look fat asf” instead I look at myself and realize I love myself too much to let myself go this bad.\n   \n   Pleasee don’t let this continue , It was like hell for me. Hope this helps ❤️",
      "created_utc": 1733931070.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1kmej0",
      "author": "Exciting_Way8534",
      "body": "I can completely relate to what you’re saying. For me, it started in high school, and I remember the exact night it all began. Before then, I didn’t struggle with self-confidence—I was just a normal teenage girl, living my life without overthinking how I looked.\n\nThen, one night, I was at a party, and this beautiful girl with the same name as me walked in. She was so skinny, with long hair and a carefree vibe. She stood out—drinking wine straight from the bottle, laughing loudly, and catching everyone’s attention. Every guy wanted to talk to her.\n\nLater, I learned she had a rare disease that required her stomach to be removed, which caused her extreme weight loss. But for some reason—maybe it was her thinness or her free-spirited attitude—I felt an overwhelming sense of jealousy. I wanted to be just like her.\n\nThat night changed everything for me. I became obsessed with my weight. I started buying “healthy” food at the grocery store and refused to eat what my mom cooked. The obsession consumed me. I kept telling myself\n\tOnce I’m pretty and skinny, I’ll take pictures.\n\tOnce I’m pretty and skinny, I’ll wear cute clothes.\n\tOnce I’m pretty and skinny, I’ll finally feel happy.\n\nBut here’s the truth…that day never came. And now 10 years later I can tell you it never will.\n\nWhat I’ve learned is this and I think everyone needs to know \nYou are already enough. You are beautiful as you are, right now. There will never be a perfect moment when you suddenly feel “skinny enough” or “pretty enough.” Waiting for that day is just letting life pass you by.\n\nThe problem was never my weight, it was my mindset. And that’s something you can change.\n\nStart living your life today. Fake it if you have to, but take small steps:\nLook at yourself in the mirror and call yourself beautiful.\nGo on that date.\nDye your hair.\nWear the cute outfit you’ve been saving.\n\nYou might realize that weight was never the issue. What truly matters is how you feel about yourself.\n\nTry meditation or volunteer for something you care about. Surround yourself with things that make you feel alive and fulfilled. Life isn’t something you wait to start, it’s already happening, and you are worthy of living it fully.\n\nYou are enough. You are deserving of all the things you want, just as you are. Being “skinny” won’t change anything unless you shift your mindset first.\n\nLearn to appreciate the person you are today. You’ve got this.",
      "created_utc": 1733945396.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1lyvb0",
      "author": "None",
      "body": "I started buying clothes that fit me and made me\nLook attractive with the body I have right now. It has helped me ALOT.",
      "created_utc": 1733960485.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1mptpu",
      "author": "Fun_Meaning9053",
      "body": "I’m in my fifties. I have lost and regained 70-110 pounds about 9 times. I would starve myself for a year or two and then gain it back. Believe me when I say I’ve tried it all. And here I am, fat again. And my doc tells me the starvation has so affected my body I have advance bone density loss because of it. Don’t diet. Love yourself. Listen to Glynnis Oyleston, Summer Innennin, real nutritionists and fat phobia educators like Audrey Gordon. And check out Caroline Sumlin-she’s genius. It has really helped me. I’d rather be fat and well than thinner and sick or dead.",
      "created_utc": 1733970253.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m1ld9gz",
      "author": "Brown_Eyed_Girl167",
      "body": "I’m currently 131.8lbs. Thought that being this weight would solve everything. Spoiler alert: it didn’t! I feel better, I look better, but that’s not everything in life. \n\nLearning to love myself and my body is more important I think. Even if we reach our goal weight or get exactly the way we want, we won’t be totally happy solely because of that.",
      "created_utc": 1733953370.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1nj9vv",
      "author": "lurkyturkey81",
      "body": "One thing you can do is read this book:  \n[https://www.amazon.com/Anti-Diet-Reclaim-Well-Being-Happiness-Intuitive/dp/0316420352](https://www.amazon.com/Anti-Diet-Reclaim-Well-Being-Happiness-Intuitive/dp/0316420352)",
      "created_utc": 1733982993.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1o314m",
      "author": "oldpaintunderthenew",
      "body": "My mother is like this. She's 65 now and still pulls crap like 'I'm not going on holiday because I don't like the way stomach looks'. Do you want to be like this in your sixties?",
      "created_utc": 1733995503.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1okwnj",
      "author": "amateurcatnegotiator",
      "body": "I have a practical mindset, so I'm just going to remind you that in order to lose weight and have the life you desire, you will have to make a lot of big and small changes to your current life/lifestyle. Working out is hard, dieting is hard, and maintaining them as habits is even harder because your body will keep pulling you in the opposite direction. In order to make those changes, go through those changes and consistently keeping up with them, you need a positive mental outlook, and I don't think talking down to yourself will help. Having a coach verbally abusing you during weight loss only works on TV, in real life, you need to love yourself and treasure yourself enough to make those changes and stick with them.",
      "created_utc": 1734006480.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mt6qbps",
      "author": "Bright-Light8432",
      "body": "sorry i just found this post but i wanna let u know that you’re definitely not alone in this feeling. eds kinda blind whoever they’re affecting and make them believe that they’re not going to achieve anything good until they’re fully satisfied with the amount of weight they’ve lost. i feel the exact same way tbh it’s rough i know but it will get better. i know it’s difficult to digest but the weight loss will not make your life completely better. if you don’t work on your mind then your body can’t shine as much. you’ll eventually lose the weight but still have the same mindset because it won’t go away unless you work to get rid of it. ik this all seems dumb me saying this but i promise if you start to just accept your body for the time being and recognize that you can change if you’d like then you could definitely be happier. weight loss isn’t the cure to everything even though it feels like it and trust me i thought it was.",
      "created_utc": 1747687816.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m1g13cb",
      "author": "Veldin-Citizen",
      "body": "Thank you, I really really appreciate it",
      "created_utc": 1733875331.0,
      "score": 9,
      "context": [
        {
          "id": "m1fuvid",
          "author": "starstarson",
          "body": "Just gonna forward what my psychologist said to me (paraphrased): you have to accept the body you have right now. Before you even think about loosing weight, you have to have build a healthy relationship to food and body image. And once you’ve built that, losing weight is about small changes, like for example removing one of two snacks in a day. A matter of like 300 cls less than what you’d normally eat. \n\nTry to think about what you would say to yourself if you were a friend of yours. Like, if your bff told you “I don’t deserve to be happy because I’m not skinny”. Would you agree with her? I think a lot of people are very hard on themselves. \n\nI wish you a lot of happiness in the future :(",
          "created_utc": 1733873113.0
        }
      ]
    },
    {
      "id": "m1oe3z9",
      "author": "Limegirl1234",
      "body": "I’d like to respectfully disagree with the direction you took this @starstarson. Building a healthy relationship with food and your body requires full commitment, emphasis on FULL. It’s deep hard spiritual work and I think OP should look at what the anti-diet movement calls for. First off, body acceptance means being practically aware that there are things with your body you can’t change. Like you may want to be 3 in’ different in height, but you don’t stay home every day trying to make it happen, you don’t dedicate time and energy to the pursuit; you know there’s no scientifically proven way. You may not fit the definition of the beauty standard you have in your head but you don’t let it stop you from enjoying your life. Try looking at your body and telling it, “I will never deprive you again”.  \n\nCheck out Christy Harrison’s work and the Maintenance Phase podcast.",
      "created_utc": 1734002828.0,
      "score": 3,
      "context": [
        {
          "id": "m1fuvid",
          "author": "starstarson",
          "body": "Just gonna forward what my psychologist said to me (paraphrased): you have to accept the body you have right now. Before you even think about loosing weight, you have to have build a healthy relationship to food and body image. And once you’ve built that, losing weight is about small changes, like for example removing one of two snacks in a day. A matter of like 300 cls less than what you’d normally eat. \n\nTry to think about what you would say to yourself if you were a friend of yours. Like, if your bff told you “I don’t deserve to be happy because I’m not skinny”. Would you agree with her? I think a lot of people are very hard on themselves. \n\nI wish you a lot of happiness in the future :(",
          "created_utc": 1733873113.0
        }
      ]
    },
    {
      "id": "m1ln49g",
      "author": "Veldin-Citizen",
      "body": "Thank you for your empathy. After your first sentence I immediately felt warmth in my heart, like I was understood and someone took me seriously.\n\nI was btw shocked to find how miserable I felt while typing. I know self-pity isn't exactly the right thing, but it somehow helped me to see my situation. It hits different when you've seen in written out instead of having it in your head for years.\n\nI hope your struggle ends soon aswell...you also deserve to enjoy your life",
      "created_utc": 1733956470.0,
      "score": 3,
      "context": [
        {
          "id": "m1gjxrj",
          "author": "Alive-Club2181",
          "body": "This was heartbreaking to read, but I feel you, I really do. I’m struggling to find the right words and I don’t have a solution because I struggle with the same thing but please know that you do deserve to live your life no matter what your body looks like, or what you think it looks like. You deserve beautiful clothes, swimming and going out with your boyfriend — **no matter what your body looks like**.",
          "created_utc": 1733882242.0
        }
      ]
    },
    {
      "id": "m1nz20x",
      "author": "Lalalynds0523",
      "body": "This! The more I lose weight, the more miserable I am. So much so that I’m apathetic about every thing in my life. The scale going down is not exciting anymore because it’s never enough. It’s a war within my brain.",
      "created_utc": 1733992747.0,
      "score": 3,
      "context": [
        {
          "id": "m1gulwz",
          "author": "alienprincess111",
          "body": "I don't know if this is helpful but I thought like you, then realized that being skinny made it worse. I thought I'd have a great social life and do all these things, but I didn't want to do anything or talk to anyone because it would interfere with my ED. It was so ironic.",
          "created_utc": 1733886328.0
        }
      ]
    },
    {
      "id": "m1lni9t",
      "author": "Veldin-Citizen",
      "body": "Thank you, that's a really helpful thing to know. I feel like it helps me to destroy my delusion. Thanks for sharing your experience",
      "created_utc": 1733956595.0,
      "score": 2,
      "context": [
        {
          "id": "m1gulwz",
          "author": "alienprincess111",
          "body": "I don't know if this is helpful but I thought like you, then realized that being skinny made it worse. I thought I'd have a great social life and do all these things, but I didn't want to do anything or talk to anyone because it would interfere with my ED. It was so ironic.",
          "created_utc": 1733886328.0
        }
      ]
    },
    {
      "id": "m1lo04c",
      "author": "Veldin-Citizen",
      "body": "Thank you for your comment. I take it very seriously - I agree it's about the mindset, not ny body. It's just so difficult. I hope you and your husband are doing well now. The \"I don't deserve ro suffer while it happens' really hit me. Thank you.",
      "created_utc": 1733956756.0,
      "score": 2,
      "context": [
        {
          "id": "m1igdn4",
          "author": "FloridaMomm",
          "body": "The sad secret is that getting skinnier won’t make this mindset better-you just keep moving the goalpost of what is skinny enough. I accidentally scrolled past a picture of my husband yesterday that he took (body checking) before his first day of treatment for anorexia and I **wept** because he was just bones. He was so scary thin and looked so so horrible. And in his own twisted view he still wasn’t skinny enough. So the real problem isn’t your size, it’s the mindset tying your size to your self worth. That’s where you need to put in the work. \n\nI grew up a chubby kid and diet culture has been in my face all my life. It was hard work but I got to a place of body neutrality (not necessarily positivity just accepting that this is the body I’m in) and allowing myself to live my life. I have had to lose weight in a slow sustainable way for my health, but doing it the right way (proper nutrition and no crash diets) takes a looooooong time. I don’t deserve to suffer while that happens. And the goal isn’t to be skinny like it was in my teens-it is to be healthy so I can better achieve the things I want to do. My body has done great things for me at every size and shape \n\nYou deserve to have good experiences",
          "created_utc": 1733918685.0
        }
      ]
    },
    {
      "id": "m1lod1p",
      "author": "Veldin-Citizen",
      "body": "I'm so sorry. I really wish you the very best.",
      "created_utc": 1733956873.0,
      "score": 1,
      "context": [
        {
          "id": "m1hr0uy",
          "author": "None",
          "body": "I have felt this my entire life.",
          "created_utc": 1733902201.0
        }
      ]
    },
    {
      "id": "m1lope6",
      "author": "Veldin-Citizen",
      "body": "Every comment helps in a way. I have never thought about the possibility that I won't be happy If I'm thin. It helps me destroy my delusional mindset, it really does. I hope you are doing better now..",
      "created_utc": 1733956984.0,
      "score": 3,
      "context": [
        {
          "id": "m1i1gaf",
          "author": "None",
          "body": "If it helps, I was my most unhappy at my thinnest",
          "created_utc": 1733909264.0
        }
      ]
    },
    {
      "id": "m1lp41i",
      "author": "Veldin-Citizen",
      "body": "Thank you. I feel understood. I will eventually look into the book. It give me hope to know there might be a way out. I'm so glad you were able to do it. Take care <3",
      "created_utc": 1733957118.0,
      "score": 2,
      "context": [
        {
          "id": "m1iny9s",
          "author": "AdditionalNews4485",
          "body": "Just so you know… that’s your eating disorder talking. Not you. You deserve so much more than what your ED is telling you. I highly recommend the book ‘Life without Ed’ \n\nYour post was so relatable. I’ve been there and I can tell you recovery is possible and the grass IS greener on the other side of it",
          "created_utc": 1733922305.0
        }
      ]
    },
    {
      "id": "m1lpf5z",
      "author": "Veldin-Citizen",
      "body": "Yeah it's true ... it's in my head only. I will try to remind myself of it. I hope you are doing better know. Thank you for your comment",
      "created_utc": 1733957219.0,
      "score": 2,
      "context": [
        {
          "id": "m1irj89",
          "author": "None",
          "body": "I go through the same thing, and I understand how devastating it feels. I also feel like I don’t deserve to do the things I love unless I’m at my \"ideal weight.\" But my therapist said something that really made me think: think about how many things you love and are denying yourself just because of something that only exists in your head. And it’s true. We might be overweight, but no one is stopping us from living, swimming, having fun, or being loved—except ourselves. This pressure comes from within, and while we’re waiting for the change, we’re losing precious moments and experiences. I think the first step is trying to be kinder to ourselves, one day at a time.",
          "created_utc": 1733923818.0
        }
      ]
    },
    {
      "id": "m1nstzr",
      "author": "Veldin-Citizen",
      "body": "Thank you, that is some good advice. I don't have anything that really fulfils me. But volunteering with animals sounds nice",
      "created_utc": 1733988623.0,
      "score": 1,
      "context": [
        {
          "id": "m1j3n4i",
          "author": "Separate_Plankton793",
          "body": "I’m so sorry you are going through this and have felt the same so many times in my past. One thing that eventually helped me is finding things that I valued more than being thin and brought me more joy. It was things totally unrelated to how I looked like hiking in a beautiful setting or volunteering with animals. Maybe start with some things where you aren’t around as many people to lessen the pressure to feel thin. \n\nOne more thing as I still struggle with wondering if people think I’m fat and hating my body - most people ate too focused on what is going on in their life to notice anything about my body! \n\nHope it gets better for you! Always rooting for recovery.",
          "created_utc": 1733928438.0
        }
      ]
    },
    {
      "id": "m1nto40",
      "author": "Veldin-Citizen",
      "body": "Thank you so much for this. And yes, lots of suppotive comments, I was surprised (in a good way). I felt very understood. Right now I can't really imagine to do all these nice things, but many have suggested doing so, so maybe I will give it a try.\n\nAnd also thank you for telling me that you are a therapist and that you struggled yourself. In fact, I study clinical psychology and one day I will be a therapist myself. I felt a huge amout of extra-shame because I felt like \"I'm supposed to be a professional, I can't struggle with this, people won't take me seriously\". That's also why I'm too embarrassed to seek professional help.",
      "created_utc": 1733989166.0,
      "score": 2,
      "context": [
        {
          "id": "m1kbfr1",
          "author": "Liv0005",
          "body": "Lots of excellent supportive comments here. I had one thing to add... Consider a thought experiment and maybe give it a go- \n\nWhat if you let yourself do the things you enjoy? Get a dress you like, go on a fancy dinner date with your guy in said dress and then go dancing? What would happen? I wonder truly, if you start shifting focus on finding pleasures in your life outside of thinness (or food) if you might find your mindset shift?\n\nLastly, wanted to let you know, I'm a therapist myself. I have struggled with multiple EDs since adolescence. I am finally healing. I started seeing an EMDR therapist and a psychiatrist because I was dealing with PTSD and binge eating at the time. Through emdr (and internal family systems therapy), I processed a lot of my food related trauma. I also started taking naltrexone and Wellbutrin (contrave). And I have lost over 70lb in 2 years. Though I'm still technically overweight, I am feeling much better mentally and I'm so much kinder to myself. \n\nI hope you are able to find a way to be content and find moments of joy in your life. ❤️",
          "created_utc": 1733942175.0
        }
      ]
    },
    {
      "id": "m1ntqrp",
      "author": "Veldin-Citizen",
      "body": "Thanks, you've got a point.",
      "created_utc": 1733989213.0,
      "score": 1,
      "context": [
        {
          "id": "m1ibwmd",
          "author": "universe93",
          "body": "What if you lived life now like you were skinny? Sure it may not feel right but if you do the things you’re putting off and focus on enjoying them mindfully and really throwing yourself into the experience it will feel more and more natural each time. Do it even if you think you’re not skinny enough or even if you think you don’t deserve it",
          "created_utc": 1733916162.0
        }
      ]
    },
    {
      "id": "m1lqupl",
      "author": "Veldin-Citizen",
      "body": "Thank you for taking your time writing all this. I appreciate it so very much! I almost shed a tear. I've never felt \"good enough\". Reading that hits home. And I also appreciate your own personal story. That was very relatable. I take your suggestions seriously, I will eventually do some stuff in hopes it will fulfill me. But I already feel that it won't be easy. As soon as I see myself, I immediatly fall back into the old mindest. It's a tough fight. It takes really convincing arguments to why I deserve all this. But as many already said...it's in my head. There is no reason why not do to things. And maybe there will never be the day where I will be thin and it breaks my heart. I don't know how to overvome it. But I will try. So, thank you again. And I hope you moved on and are doing better now <3",
      "created_utc": 1733957688.0,
      "score": 2,
      "context": [
        {
          "id": "m1kmej0",
          "author": "Exciting_Way8534",
          "body": "I can completely relate to what you’re saying. For me, it started in high school, and I remember the exact night it all began. Before then, I didn’t struggle with self-confidence—I was just a normal teenage girl, living my life without overthinking how I looked.\n\nThen, one night, I was at a party, and this beautiful girl with the same name as me walked in. She was so skinny, with long hair and a carefree vibe. She stood out—drinking wine straight from the bottle, laughing loudly, and catching everyone’s attention. Every guy wanted to talk to her.\n\nLater, I learned she had a rare disease that required her stomach to be removed, which caused her extreme weight loss. But for some reason—maybe it was her thinness or her free-spirited attitude—I felt an overwhelming sense of jealousy. I wanted to be just like her.\n\nThat night changed everything for me. I became obsessed with my weight. I started buying “healthy” food at the grocery store and refused to eat what my mom cooked. The obsession consumed me. I kept telling myself\n\tOnce I’m pretty and skinny, I’ll take pictures.\n\tOnce I’m pretty and skinny, I’ll wear cute clothes.\n\tOnce I’m pretty and skinny, I’ll finally feel happy.\n\nBut here’s the truth…that day never came. And now 10 years later I can tell you it never will.\n\nWhat I’ve learned is this and I think everyone needs to know \nYou are already enough. You are beautiful as you are, right now. There will never be a perfect moment when you suddenly feel “skinny enough” or “pretty enough.” Waiting for that day is just letting life pass you by.\n\nThe problem was never my weight, it was my mindset. And that’s something you can change.\n\nStart living your life today. Fake it if you have to, but take small steps:\nLook at yourself in the mirror and call yourself beautiful.\nGo on that date.\nDye your hair.\nWear the cute outfit you’ve been saving.\n\nYou might realize that weight was never the issue. What truly matters is how you feel about yourself.\n\nTry meditation or volunteer for something you care about. Surround yourself with things that make you feel alive and fulfilled. Life isn’t something you wait to start, it’s already happening, and you are worthy of living it fully.\n\nYou are enough. You are deserving of all the things you want, just as you are. Being “skinny” won’t change anything unless you shift your mindset first.\n\nLearn to appreciate the person you are today. You’ve got this.",
          "created_utc": 1733945396.0
        }
      ]
    },
    {
      "id": "m1njaup",
      "author": "Cool-Importance6004",
      "body": "## Amazon Price History:\n\n**Anti-Diet: Reclaim Your Time, Money, Well-Being, and Happiness Through Intuitive Eating**\n* Rating: ★★★★☆ 4.6\n\n* Current price: **$22.38** 👎\n* Lowest price: $12.99\n* Highest price: $29.00\n* Average price: $19.80\n\n| Month  | Low  | High | Chart             |\n|--------|------------|------------|------------------|\n| 12-2024 | $21.42      | $22.48      | ███████████     |\n| 11-2024 | $21.28      | $22.58      | ███████████     |\n| 10-2024 | $22.03      | $22.87      | ███████████     |\n| 09-2024 | $24.49      | $24.49      | ████████████    |\n| 08-2024 | $19.81      | $24.49      | ██████████▒▒    |\n| 06-2024 | $14.72      | $14.72      | ███████         |\n| 01-2024 | $18.73      | $24.49      | █████████▒▒▒    |\n| 12-2023 | $18.70      | $29.00      | █████████▒▒▒▒▒▒ |\n| 11-2023 | $15.99      | $23.28      | ████████▒▒▒▒    |\n| 10-2023 | $15.52      | $15.52      | ████████        |\n| 07-2023 | $15.35      | $15.99      | ███████▒        |\n| 06-2023 | $15.30      | $15.99      | ███████▒        |\n\nSource: [GOSH Price Tracker](https://gosh.app/?utm_source=redditbot&utm_medium=EatingDisorders&utm_campaign=2024-12-12)\n\n\n^(Bleep bleep boop. I am a bot here to serve by providing helpful price history data on products. I am not affiliated with Amazon. Upvote if this was helpful. PM to report issues or to opt-out.)",
      "created_utc": 1733983008.0,
      "score": 1,
      "context": [
        {
          "id": "m1nj9vv",
          "author": "lurkyturkey81",
          "body": "One thing you can do is read this book:  \n[https://www.amazon.com/Anti-Diet-Reclaim-Well-Being-Happiness-Intuitive/dp/0316420352](https://www.amazon.com/Anti-Diet-Reclaim-Well-Being-Happiness-Intuitive/dp/0316420352)",
          "created_utc": 1733982993.0
        }
      ]
    },
    {
      "id": "m1mbi3g",
      "author": "alienprincess111",
      "body": "You're welcome. I hope you are able to get better. I have been struggling for more than 26 years and have missed out of a lot of things in my life.  I hope it does not happen to you.  It's not worth it.",
      "created_utc": 1733965021.0,
      "score": 2,
      "context": [
        {
          "id": "m1gulwz",
          "author": "alienprincess111",
          "body": "I don't know if this is helpful but I thought like you, then realized that being skinny made it worse. I thought I'd have a great social life and do all these things, but I didn't want to do anything or talk to anyone because it would interfere with my ED. It was so ironic.",
          "created_utc": 1733886328.0
        },
        {
          "id": "m1lni9t",
          "author": "Veldin-Citizen",
          "body": "Thank you, that's a really helpful thing to know. I feel like it helps me to destroy my delusion. Thanks for sharing your experience",
          "created_utc": 1733956595.0
        }
      ]
    },
    {
      "id": "m1lp0r0",
      "author": "None",
      "body": "I’m the happiest I’ve ever been! Was stuck in bulimia for a decade. Got more and more miserable as it progressed. Then committed to recovery at the beginning of the year, gained 20kg and am now 6 months behaviour free x",
      "created_utc": 1733957088.0,
      "score": 2,
      "context": [
        {
          "id": "m1i1gaf",
          "author": "None",
          "body": "If it helps, I was my most unhappy at my thinnest",
          "created_utc": 1733909264.0
        },
        {
          "id": "m1lope6",
          "author": "Veldin-Citizen",
          "body": "Every comment helps in a way. I have never thought about the possibility that I won't be happy If I'm thin. It helps me destroy my delusional mindset, it really does. I hope you are doing better now..",
          "created_utc": 1733956984.0
        }
      ]
    },
    {
      "id": "m1oo4uw",
      "author": "Liv0005",
      "body": "Hugs to you. Almost every therapist I’ve known over the 15 years I’ve been in the field has struggled with mental health in some way or another. Personally, I think it helps us empathize and truly understand our clients. ❤️",
      "created_utc": 1734008002.0,
      "score": 2,
      "context": [
        {
          "id": "m1kbfr1",
          "author": "Liv0005",
          "body": "Lots of excellent supportive comments here. I had one thing to add... Consider a thought experiment and maybe give it a go- \n\nWhat if you let yourself do the things you enjoy? Get a dress you like, go on a fancy dinner date with your guy in said dress and then go dancing? What would happen? I wonder truly, if you start shifting focus on finding pleasures in your life outside of thinness (or food) if you might find your mindset shift?\n\nLastly, wanted to let you know, I'm a therapist myself. I have struggled with multiple EDs since adolescence. I am finally healing. I started seeing an EMDR therapist and a psychiatrist because I was dealing with PTSD and binge eating at the time. Through emdr (and internal family systems therapy), I processed a lot of my food related trauma. I also started taking naltrexone and Wellbutrin (contrave). And I have lost over 70lb in 2 years. Though I'm still technically overweight, I am feeling much better mentally and I'm so much kinder to myself. \n\nI hope you are able to find a way to be content and find moments of joy in your life. ❤️",
          "created_utc": 1733942175.0
        },
        {
          "id": "m1nto40",
          "author": "Veldin-Citizen",
          "body": "Thank you so much for this. And yes, lots of suppotive comments, I was surprised (in a good way). I felt very understood. Right now I can't really imagine to do all these nice things, but many have suggested doing so, so maybe I will give it a try.\n\nAnd also thank you for telling me that you are a therapist and that you struggled yourself. In fact, I study clinical psychology and one day I will be a therapist myself. I felt a huge amout of extra-shame because I felt like \"I'm supposed to be a professional, I can't struggle with this, people won't take me seriously\". That's also why I'm too embarrassed to seek professional help.",
          "created_utc": 1733989166.0
        }
      ]
    },
    {
      "id": "m1x34lr",
      "author": "Exciting_Way8534",
      "body": "I'm so glad my words resonated with you—sending you lots of virtual love!\n\nI have a question, and you may have been asked this before: have you considered therapy, specifically with a therapist who specializes in body image and confidence? Or perhaps you already have a therapist—in which case, feel free to disregard this suggestion.\n\nIf your finances or insurance allow, I’d really recommend looking into it. I started therapy during the pandemic through a company called BetterHelp, and I connected with an amazing therapist. We met virtually every week for almost two years, and it made such a difference in my life.\n\nIf you haven’t tried therapy yet, it might be worth exploring. There are incredible professionals out there who dedicate their lives to helping people reach better places. Of course, therapy isn’t a magical fix for everything, but it can be a valuable step in the right direction.\n\nIt’s also worth noting that not every therapist will be the right fit, and finding the right one can take time. It’s a bit like dating—once you find someone who clicks, it can be truly transformative.",
      "created_utc": 1734123689.0,
      "score": 2,
      "context": [
        {
          "id": "m1kmej0",
          "author": "Exciting_Way8534",
          "body": "I can completely relate to what you’re saying. For me, it started in high school, and I remember the exact night it all began. Before then, I didn’t struggle with self-confidence—I was just a normal teenage girl, living my life without overthinking how I looked.\n\nThen, one night, I was at a party, and this beautiful girl with the same name as me walked in. She was so skinny, with long hair and a carefree vibe. She stood out—drinking wine straight from the bottle, laughing loudly, and catching everyone’s attention. Every guy wanted to talk to her.\n\nLater, I learned she had a rare disease that required her stomach to be removed, which caused her extreme weight loss. But for some reason—maybe it was her thinness or her free-spirited attitude—I felt an overwhelming sense of jealousy. I wanted to be just like her.\n\nThat night changed everything for me. I became obsessed with my weight. I started buying “healthy” food at the grocery store and refused to eat what my mom cooked. The obsession consumed me. I kept telling myself\n\tOnce I’m pretty and skinny, I’ll take pictures.\n\tOnce I’m pretty and skinny, I’ll wear cute clothes.\n\tOnce I’m pretty and skinny, I’ll finally feel happy.\n\nBut here’s the truth…that day never came. And now 10 years later I can tell you it never will.\n\nWhat I’ve learned is this and I think everyone needs to know \nYou are already enough. You are beautiful as you are, right now. There will never be a perfect moment when you suddenly feel “skinny enough” or “pretty enough.” Waiting for that day is just letting life pass you by.\n\nThe problem was never my weight, it was my mindset. And that’s something you can change.\n\nStart living your life today. Fake it if you have to, but take small steps:\nLook at yourself in the mirror and call yourself beautiful.\nGo on that date.\nDye your hair.\nWear the cute outfit you’ve been saving.\n\nYou might realize that weight was never the issue. What truly matters is how you feel about yourself.\n\nTry meditation or volunteer for something you care about. Surround yourself with things that make you feel alive and fulfilled. Life isn’t something you wait to start, it’s already happening, and you are worthy of living it fully.\n\nYou are enough. You are deserving of all the things you want, just as you are. Being “skinny” won’t change anything unless you shift your mindset first.\n\nLearn to appreciate the person you are today. You’ve got this.",
          "created_utc": 1733945396.0
        },
        {
          "id": "m1lqupl",
          "author": "Veldin-Citizen",
          "body": "Thank you for taking your time writing all this. I appreciate it so very much! I almost shed a tear. I've never felt \"good enough\". Reading that hits home. And I also appreciate your own personal story. That was very relatable. I take your suggestions seriously, I will eventually do some stuff in hopes it will fulfill me. But I already feel that it won't be easy. As soon as I see myself, I immediatly fall back into the old mindest. It's a tough fight. It takes really convincing arguments to why I deserve all this. But as many already said...it's in my head. There is no reason why not do to things. And maybe there will never be the day where I will be thin and it breaks my heart. I don't know how to overvome it. But I will try. So, thank you again. And I hope you moved on and are doing better now <3",
          "created_utc": 1733957688.0
        }
      ]
    }
  ]
}