{
  "id": "1hfx7co",
  "subreddit": "EatingDisorders",
  "author": "No_Individual3906",
  "created_utc": 1734392776.0,
  "title": "Nobody will help me. They say my case is too complicated. ",
  "selftext": "\n\nI’ve had an ed for about 4 years. It started at the beginning of high school. Starting school would make me so nervous I couldn’t eat. I’m the type to throw up when anxious because my anxiety is straight in the gut. I feel extremely nauseous, and sick. And I was nervous everyday, so I wouldn’t eat. I developed emetophobia which is the severe fear of throwing up. I would be so nervous about getting sick Infront if others that I started getting scared of it. Years later I can’t eat anything now, I’ve lost so much weight, muscle, I’m a walking Skelton. They say I have the body of a 90-100 year old. I’ve been trying to recover, but I’m in so much pain. I’ve tried inpatient but it doesn’t cater to me, and I have a huge fear of eating Infront of others so I lost even more weight. I got extremely sick. I don’t know what to do, and nobody will help me. Everybody says I’m too complicated or they don’t wanna make me worse. I feel so hopeless, I don’t wanna feel like this I’m just scared. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hfx7co/nobody_will_help_me_they_say_my_case_is_too/",
  "score": 45,
  "num_comments": 16,
  "comments": [
    {
      "id": "m2g44al",
      "author": "None",
      "body": "What about BRAT foods which are meant to be easily digested? Eat those a bit to build tolerance and make stomach a bit larger then introduce similar foods little by little. Also  KEEP YOUR MIND On something else. After u eat think about something else and distract urself (not by doing pirouettes though)",
      "created_utc": 1734409848.0,
      "score": 34,
      "context": []
    },
    {
      "id": "m2g73l9",
      "author": "None",
      "body": "Look into Sanford in Fargo, ND. They take all kinds of complicated cases that other facilities won’t touch. When I was there, one of the other people there struggled with emetophobia and they set up an individual plan for her and had her work with a therapist alone at mealtimes at first.",
      "created_utc": 1734411201.0,
      "score": 27,
      "context": []
    },
    {
      "id": "m2h51em",
      "author": "houston_veronica",
      "body": "This is way out of our territory for advice; you need to get professional help, probably through IV/tubing to help you stabilize, then progress into residential treatment. Denver acute is one that takes almost all cases, and they aren't going to make you get sick/throw up.",
      "created_utc": 1734431923.0,
      "score": 20,
      "context": []
    },
    {
      "id": "m2js6nn",
      "author": "Educational-Long-508",
      "body": "Look into Denver ACUTE. Your presentation is very common in ED clients. You likely need inpatient care first then step down to residential treatment. Have family or friends help if needed. Your PCP might also be able to help.",
      "created_utc": 1734467246.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m2ks0g6",
      "author": "Realistic-Zone1473",
      "body": "nobody's case is too complicated. \n\npeople just don't help cuz they don't understand.  also most of us don't truly want actual help.  we conflate help with getting larger-at least I do.  I might be projecting.  \n\nBut, you said something... \"I have a huge fear of eating in front of others\".  That says to me that it is deeper than fear of throwing up.  \n\nI want to ask u to ask urself if you are gaslighting yourself.  Is your case REALLY different from other people?  This is something to figure out if you really want to get to the bottom of this.\n\nHow have you been trying to recover?  \n\nWhat are the steps you are taking?\n\nWhat does recovery look like to you?\n\nWhat is standing in your way?\n\nYou hold the key here.  This is YOUR life-to live, to lose, to flourish, to struggle...lots of scary things to think about.  A lot of times it feels easier to stay exactly where you are.\n\nYou have only had an ED for 4 years.  I have had one now for 27 years.  It has really controlled my life and messed up my direction in so many ways.  I hold it secret still.  I don't know if people choose to ignore it or what, frankly.  \n\nBut, I think u have a few things going for u-only had the ed for 4 years and your family knows about it!  This is great.  Now you need to start doing the work yourself.  And the first step is having a conversation.   \n\nThat is my advice.  I don't know if it is worth anything since I'm really struggling myself.  But I have many years with this beast and I have experience in the fight.  Battles won and yes, lost ...but I hope I win the war.  I hope you do too.  Wish we could fight together.  I wish u all the luck.  \n\n(also...have compassion for urself.  and stop caring what other people think.  if u are scared to eat in front of others, why is that?  pretend they don't exist.  do they even exist?  pretend they are npcs .  act as if u are the only person in the world that matters and u have to eat to survive.  stop caring about what other people think and start wanting to feel good. and look up some healthy inspirational pics.  some stars or athletes or whatever u think is beautiful but is strong.  inspiration.  ok.  much love)",
      "created_utc": 1734479162.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m2jjnyh",
      "author": "CommunicationLeft138",
      "body": "Look for other places for help, look up centers near you or go see a primary care doctor and take it from there, it might be a lengthier process to get you into residential if you take that route but you need to start advocating for yourself now. The longer you wait, the more difficult it gets. Don’t give up! You can also try and schedule an appointment with a nutritionist and start from there. Once some sort of medical doctor confirms that your body is undernourished you should be referred to what will likely be a higher level of care like residential where you can be fed by other means until you’re strong enough to start working on eating orally. Check if your city has an Eating Disorder Specialist website, for example, the city of Houston has https://www.houstoneds.org/treatment-providers/#!directory where you can find care. Hang in there! You’re gonna be alright!",
      "created_utc": 1734464529.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2k30zs",
      "author": "Rainbow-Ashcloudx",
      "body": "Has anyone ever tried you with anti-sickness medication this could possibly help with your fear. I hope you get the help you so deserve xx",
      "created_utc": 1734470706.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2ko4x9",
      "author": "the_cadaver_synod",
      "body": "Denver ACUTE, as others have said, but I can also recommend Linden Oaks at Edwards Hospital in the Chicago area. Assuming you are in the U.S., that is.",
      "created_utc": 1734477741.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2kpry4",
      "author": "Realistic-Zone1473",
      "body": "how old are you?",
      "created_utc": 1734478340.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2krh8f",
      "author": "elhazelenby",
      "body": "My case being too complicated is my worst fear. My best wishes. Please keep trying to find support.",
      "created_utc": 1734478966.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2lbv9e",
      "author": "unremarkable_sapien",
      "body": "It makes me mad that anyone would tell you that your case is too complicated. You’ve only had your ED for 4 years. Average recovery time is 7 years so it makes no sense that you would be written off like that. \n\nYou need to find a better doctor. Nausea is very common in EDs and especially during recovery and it can be treated fairly easily with anti-nausea medication. Almost everyone with an ED fears eating in front of other people, this is actually the norm and definitely not something that would make anyone turn you away.\n\nRecovery is possible, don’t give up hope just because you’ve met some not so helpful doctors.",
      "created_utc": 1734486436.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2n1vu7",
      "author": "sickatspace",
      "body": "im wishing you the best. recovery is very hard and not linear. four years is a long time to have disordered eating. Other comments on this post seem to be minimizing the time you’ve had this disorder. i don’t have much advice, but please know your struggles are valid. look into denver acute. you can also go to the website “eating disorder treatment reviews” and see reviews of facilities and try and see which one would be best. that’s what i did, atleast. much love, stay safe ❤️‍🩹",
      "created_utc": 1734518550.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2n1wku",
      "author": "sickatspace",
      "body": "im wishing you the best. recovery is very hard and not linear. four years is a long time to have disordered eating. Other comments on this post seem to be minimizing the time you’ve had this disorder. i don’t have much advice, but please know your struggles are valid. look into denver acute. you can also go to the website “eating disorder treatment reviews” and see reviews of facilities and try and see which one would be best. that’s what i did, atleast. much love, stay safe ❤️‍🩹",
      "created_utc": 1734518562.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2n28sa",
      "author": "setaside929",
      "body": "Hi there, many people find help through 12 step recovery communities focused on recovering from eating disorders / food related illnesses. I found one after trying everything I could think of to fix my bingeing (and purging) illness. It started in high school for me too, although the fear and nervousness started when I was younger, and then I because obsessed with my body size, and eventually afraid of food but also couldn’t stop eating when I started. It got worse over time, too. Can I ask how old you are?",
      "created_utc": 1734518782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2sb47j",
      "author": "Altruistic-Vehicle84",
      "body": "Have you tried aversion therapy?",
      "created_utc": 1734589190.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m2ji7sb",
      "author": "bassoonwoman",
      "body": "People say not to watch TV when you eat, but those people don't have an eating disorder.",
      "created_utc": 1734464074.0,
      "score": 18,
      "context": [
        {
          "id": "m2g44al",
          "author": "None",
          "body": "What about BRAT foods which are meant to be easily digested? Eat those a bit to build tolerance and make stomach a bit larger then introduce similar foods little by little. Also  KEEP YOUR MIND On something else. After u eat think about something else and distract urself (not by doing pirouettes though)",
          "created_utc": 1734409848.0
        }
      ]
    }
  ]
}