{
  "id": "1hnerdy",
  "subreddit": "EatingDisorders",
  "author": "SaltyCSea-r",
  "created_utc": 1735305760.0,
  "title": "At what age did you start having a bad relationship with your body/food?",
  "selftext": "I was eight or nine years old and in elementary school when I started counting calories and trying to diet. I’ve been very self conscious since I could remember, specifically about my weight. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hnerdy/at_what_age_did_you_start_having_a_bad/",
  "score": 39,
  "num_comments": 68,
  "comments": [
    {
      "id": "m4580f3",
      "author": "sweetfaerieface",
      "body": "I,too, was around 8. I was at church choir practice. I looked at everyone sitting in the pew and wondered why everyone’s belly was flat and mine was poochy. I am not sure if that really was the case but I thought it was. That’s when it all started\n\nEdited to say I turn 70 tomorrow and have been in recovery for 354 days. Longest I have ever gone",
      "created_utc": 1735359000.0,
      "score": 20,
      "context": []
    },
    {
      "id": "m45cxoy",
      "author": "None",
      "body": "i was around 4 or 5 when i became aware of my body. my dad would make inappropriate comments like “you’re gonna have such a fat ass like your mom” and other gross shit. when i hit puberty i started restricting and eventually turned into an ed.",
      "created_utc": 1735361198.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m44nufj",
      "author": "alienprincess111",
      "body": "When I hit puberty so like 11. My anorexia started at 13.",
      "created_utc": 1735350806.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m453za7",
      "author": "MoulinSarah",
      "body": "Age 9! I turn 41 on Monday.",
      "created_utc": 1735357278.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m45fe7f",
      "author": "FloridaMomm",
      "body": "I literally can’t remember I time that I didn’t. I was a chubby kid and my grandpa would point out I needed portion control even when I was 4 or 5. My naturally thin sister would be given a big bowl of ice cream or cereal with a big spoon but I would be given a little bowl with a small spoon to encourage me to practice portion control. Growing up in the 90s/2000s was tough. I went on the South Beach diet and Special K diet before I turned 10\n\nFunnily enough my family pushing diets on me did the opposite of the intended effect because it caused me to binge and gain weight",
      "created_utc": 1735362338.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m44p4pi",
      "author": "elhazelenby",
      "body": "I was also 8, I started comfort eating to cope with bullying, school as an autistic child, ableism and being in a dysfunctional family home including abuse and witnessing domestic abuse. \n\nI first started to skip meals when I was 13 for a stint",
      "created_utc": 1735351309.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m44ty4o",
      "author": "avasefullofnations",
      "body": "Unfortunately my family started with family diets/restricting what I could eat for long before I personally feel I developed my eating disorder in upper elementary school so I don't really know when I started having a bad relationship with food or my body as it's always been there",
      "created_utc": 1735353224.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m466ylt",
      "author": "VampireDetective",
      "body": "I didn't think twice about my body growing up. It was a tool for sports and playing, I'm very lucky in that regard. It changed when I was about 23 years old and I gained a lot of weight from going on birth control, quitting smoking and starting anti-depressants. My boyfriend at the time was wonderful and was very supportive but my Dad was very nasty. I was at that weight for awhile and slowly developed an ED. It got worse when I started losing weight and my Dad was giving me tons of compliments, which he has never done. Daddy issues 🙋‍♀️",
      "created_utc": 1735378523.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m47lls7",
      "author": "iam-melonlord",
      "body": "ive literally always had a problem with food. i was basically a vegan until age 5 not bc of anyone in my family, i just refused to eat most things. i got better but then nothing on my plate could touch each other and if they did i couldn’t eat it. i’d eat one thing at a time before moving on to something else. my true eating disorder happened when i was like 12-13. that’s when i just stopped eating. i’m doing a bit better now but food and me have always had a weird relationship.",
      "created_utc": 1735403325.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m4564tg",
      "author": "Equal-Art6604",
      "body": "I started having nightmares about food when I was five. I’m in my 40s now.",
      "created_utc": 1735358182.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m456odh",
      "author": "SaltyCSea-r",
      "body": "I used to hide food and binge it a bunch of junk when I was a kid too. I was always “chunky” until I really started to starve myself in high school. The sad part is I learned these behaviors from my anorexic/ bulimic mother and now that I am at my lowest weight and struggling she doesn’t even notice. It’s so triggering to be around her and she has let my disabled sister become obese on fast food and no exercise. I do not want my kids to feel the way I do now or then or ever in their lives. Idk how to even get better when I’m living with her.",
      "created_utc": 1735358418.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m458kwq",
      "author": "Moomoo-meowbitch",
      "body": "I was 12 when my ED started and still struggling with it at 20. Hated my body since 10",
      "created_utc": 1735359247.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m45bhha",
      "author": "ever-grown-oak",
      "body": "Unfortunately, for as long as I can remember.\nThough, I was in denial up until I was 15.\nMy family was very poor, my siblings and I grew up on food bank food, cheap microwave meals and junk food. We were constantly reminded how hard it was to get food, and that we needed to eat everything and not waste anything.\nI remember feeling like a waste of space, or felt like I wasted food by eating it, so I tried to not eat as much as possible, to save the food for my siblings or for later. I ate burnt food, I ate the scraps, I ate the parts my siblings wouldn't eat.\nI am not picky because of this, I'll eat anything if it means it won't go to waste, but I won't go out of my way to eat perfectly fine foods.\n\nMy parents always complained about eating junk food, how it's not good for you, and makes you fat.\nI never remember ever liking the way I looked, I always thought I was chubby (I was not, I was always underweight).\n\nI always unconsciously restricted or purposely restricted because I felt like a waste.\nNow, I have severe body image issues, I binge, purge, restrict... It's endless.\nI started consciously doing it the moment I realized I was overweight in my late teens.",
      "created_utc": 1735360534.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m45dy4u",
      "author": "AdviceDry783",
      "body": "3rd grade- 8 years old. when i was in ballet and was the most flexible girl in class. i could do every split and stretch, other than touching my toes, because my stomach was \"too fat\". \n\nFor reference, i've always been somewhat underweight until rightnow where i weight 155(slightly overweight for my height). when i was 13 i weighed 105 and bragged about it constantly.",
      "created_utc": 1735361661.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m45hkke",
      "author": "sorcerers_apprentice",
      "body": "11 - diagnosed with type 1 diabetes, which led to a sudden focus on food, exercise, etc. coupled with weight gain due to starting insulin. Fell into restrict/binge cycle at 13. Full-blown AN-b/p at 15. Hospitalized at 16.",
      "created_utc": 1735363380.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m45m7ek",
      "author": "talo1505",
      "body": "Not letting me eat was an abuse tactic my parents used basically as long as I can remember, and I didn't like my appearance for basically my entire childhood as well. So the underlying issues were practically always there, but it didn't manifest fully into disordered eating until I was about 11.",
      "created_utc": 1735365723.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m46g166",
      "author": "hiiad",
      "body": "Probably had an unhealthy relationship with food for most of my life, and my Ed started at around 8-9",
      "created_utc": 1735384629.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m46h58d",
      "author": "lavenderScentedBalls",
      "body": "8 when I started binging and purging. I don't even think I saw it as wrong until about age 14. I don't binge anymore, just purge when I feel too full.",
      "created_utc": 1735385355.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m46m5l1",
      "author": "RavenBoyyy",
      "body": "About 7-8 it began. My dad introduced it to me.",
      "created_utc": 1735388454.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m47oug1",
      "author": "Crimson-Rose28",
      "body": "I was only 6 and told my mom I felt fat. This was in 1999 so it makes sense 🙃",
      "created_utc": 1735404405.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m47zpo1",
      "author": "Voila_fleur",
      "body": "Around 7. I was in foster care and my foster parents restricted my food intake so drastically. Starving me for days on end and suddenly giving me a ton of food right before a visit with mom .. From that point on, it's been a love hate relationship  with food. Either being 30-40+ pounds overweight or 20 under where I'm supposed to be at. Right now I'm 40lbs overweight due to excessive eating for 2 years. I've seen a dr many times, but nothing ever truly helps. I'm trying. I always am trying to improve my health. I'll get there one day.",
      "created_utc": 1735407973.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m48f6jr",
      "author": "hkh220",
      "body": "9- I have diaries from 4th grade wishing I was skinnier and prettier. I wanted to be as thin as my twin- the reality was I have always been small/underweight and was smaller than her..I was born underweight. I have hated myself for so long and I will never really understand why, it's like I was born this way.",
      "created_utc": 1735412971.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4axukz",
      "author": "justananonguylol",
      "body": "I think it started around a year or two ago? My depression got worse and worse from living with my abusive family and I got a car and job so I was able to skip meals more often, I told myself it was just because being around my family was awful and my mom never took my afrid into consideration both were partially true but it wasn't the full reason. Then I moved out and fell on hard financial times which led me to thinking starving myself was the logical way to save money. Which was also only a partial truth\n\nIt wasn't until my friend outright said they thought I was using starving myself as self harm that I really acknowledged and realized it...I still struggle with it but I'd like to think if I had the money I'd eat regularly no problem...\n\nIt's possible I had issues before then but it's hard to tell, it's never been about my body just about control and punishment and some autism related eating issues.",
      "created_utc": 1735444674.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4becgf",
      "author": "jarofonions",
      "body": "same, same, and same?? gang gang 🤠🥲",
      "created_utc": 1735452152.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m456xz6",
      "author": "SaltyCSea-r",
      "body": "My mother Never disciplined me as a kid and never encouraged healthy eating. I really hate her for what she has done to me now more so than back when I was a kid. Her loser boyfriend also lives here and he hardly eats anything other than fast food and even blamed my mentally disabled sister for it! And she just doesn’t care. Sorry to vent I just have no one to talk too about it. I’m going to seek help here soon..",
      "created_utc": 1735358532.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m45ybbn",
      "author": "Diligent-Soil-2832",
      "body": "By 9 I know I ate too much for children my age, but it was when I was 13 that I started starving myself",
      "created_utc": 1735372759.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m467y3j",
      "author": "happyendavenue",
      "body": "When I was like 13 or 12, I feel like it started when I began to develop bad health anxiety which led to me watching what I eat a lot from a belief that whatever I ate could cause sickness, and it eventually became more restrictive and disordered",
      "created_utc": 1735379193.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m46eqn1",
      "author": "QuantumPlankAbbestia",
      "body": "My grandma started commenting on my \"big belly\" (normal toddler body) when I was 3. I remember comments from others, benevolent but still remarking I was chubby (I wasn't) at age 5/6. I didn't really have my own thoughts about it until age 6 when a classmate was being bullied for being fat. I once defended her from one of the boys and he told me to be careful because I could be next, as I was only slightly smaller than Lucy (classmate) and that if she moved the next year, I would be the target. Joke's on him both me and Lucy moved. But that's when I started being vigilant and worried, even if I remember not understanding why this was a problem.",
      "created_utc": 1735383773.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m46p5zx",
      "author": "Past-Quarter-356",
      "body": "7. Stress ate, called fat, eating was my comfort, cried when looking at myself, so I just continued to eat, 9- started starving myself and over exercising, still b:nged, 12- more starving, more overexerting, more counting kals, less b*nging\n\n(9 was when I hit puberty, E.D professionals won't take me seriously because it's just \"hormones\" and bullying)",
      "created_utc": 1735390157.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m48myzi",
      "author": "poisonkissed3",
      "body": "Around 16 or so when a doctor suggested I start counting calories. It’s all went downhill from there.",
      "created_utc": 1735415519.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m48ssb9",
      "author": "WhyiseveryusernameX2",
      "body": "When I was six, I started running around after eating specifically to make sure I wouldn’t gain weight; when I was seven, I started obsessively checking my body for weight gain, measuring my stomach, wrapping my hand around my wrist, gauging the thickness of my cheeks. I think the first time I tried to put myself on a diet was when I was ten.",
      "created_utc": 1735417447.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m49mkt4",
      "author": "Loveydovey2023",
      "body": "When i was about 6-7 years old a janitor in my building made a comment to my sister when she was looking for me and my friend and she told it to my family laughing about word for word “which one are you looking for the small or the fat one” i feel like it eternally destroyed any confidence cause my sister never liked me in fact she hated me and made sure i knew it and my family all together have made nonstop comments about the way i ate and did anything",
      "created_utc": 1735427481.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m49p5sz",
      "author": "None",
      "body": "Around 3 or 4 years old. I wasn't diagnosed until age 8, though.",
      "created_utc": 1735428387.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4d8yg2",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1735487562.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4dqfyo",
      "author": "Ecstatic-Ball-9213",
      "body": "Literally as long as I can remember, I was entered in beauty pageants before I could even speak and just kinda grew up constantly comparing myself to others",
      "created_utc": 1735493174.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4eem69",
      "author": "Therandomderpdude",
      "body": "Body insecurities started at 8 years old. Was bullied for being chubby. \n\nAt 11 I started to skip meals.",
      "created_utc": 1735500494.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4f2scd",
      "author": "Vulkhard_Muller",
      "body": "Earliest I can recall was 9-10 which seems to be a common refrain here.",
      "created_utc": 1735507906.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4glf95",
      "author": "Emaptheticxz",
      "body": "I was only 10 :( it breaks my heart now. I was always a taller girl too. The older women in my family treated me like a circus animal. Now that I look back I was even that fat. I was just tall for my age. I’m 23 going through a bad episode again with food.",
      "created_utc": 1735526302.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4gm6n4",
      "author": "Unidentified_Cat_",
      "body": "I was 5. I was in dance class and I saw that my body was different from the other little girls and thought there was something wrong with me. Then I began eating compulsively and binging. I started dieting at age 10 and became bulimic by age 16. At 20 I was binging and purging multiple times a day and not able to function and went to treatment for 3 months. After that I relapsed on and off until I was 30. Then I found something that finally made a sustainable impact on my relationship with food and my body. Today I am 41 with 25 years disordered and 11 years recovered.",
      "created_utc": 1735526577.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4juav7",
      "author": "Cavatopme",
      "body": "I believe I was around eight years old. That is when my mother started giving me weight loss advice, and comments surrounding my body began to become more common.",
      "created_utc": 1735579385.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4kd0rl",
      "author": "amb194",
      "body": "I was 8, my parents and my close family always made sure to emphasize that I was heavier that I should. They made fun of me whenever I was eating and used to tell me to stop eating that much. At one point my mum told me that I should drink just water to lose weight. I am still struggling with the way I see my body. About food? I still feel guilty when I eat",
      "created_utc": 1735585091.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4mhwel",
      "author": "GamerGirl10l",
      "body": "14. As a young child I was kind of naive and sheltered and didn't think much about what I was eating. I was 14 the first time I tried to starve myself. It didn't last because I have no stamina for that kind of thing. I still ate dinner I just skipped lunch and breakfast for a couple days. Then I forgot all about that for a while and ate normally (minus my tiny portion sizes and constant no breakfast) I was about 16 when I started to think about it more and I lasted longer. (I skipped breakfast and lunch as well as having small dinner portions (I would have skipped dinner but my parents would have made me eat it regardless of what I said) I'd say that went on for about a week till I couldn't take it anymore and started eating. Now I eat lunch, but still no breakfast. My portion sizes have always been small because I don't have a big appetite. I also don't get enough nutrients cuz I don't like much. I don't think I ever really had an eating disorder cuz it never lasted long and I never saw myself as fat. I guess I just didn't want to be fat. I still don't. Yet I eat a lot of unhealthy things, like today I had a plate full of slices of cheese and I had a hot chocolate. (They both were so good) Unhealthy food is definitely my weakness. \nSometimes I do kinda feel guilty when I eat badly but I never bother to do anything about it (I never purge or work out) I have absolutely no motivation to work out or take care of myself. \nBut idk I'm pretty sure I've never had an eating disorder. Even though my family always says I don't eat enough. \nIdk. \nShould I be eating more? Cause I can feel satisfied with the portion sizes I currently have. ",
      "created_utc": 1735609956.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4mxx4u",
      "author": "neener691",
      "body": "I took my first diet pill at 14, I have struggled my whole life with not feeling in control, I was diagnosed A-typical anorexia years ago, I'm now 57 I've struggled most of my life, \n\nthis last year is probably the worse it's ever been, I spend all day saying, I'm fine, I'm good, saying, yes I've eaten to my husband and kids, \n\nI've gotten to the point that putting food in my mouth physically hurts, anyone else experience that?",
      "created_utc": 1735615701.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4na55c",
      "author": "fullofdatura",
      "body": "really really young. i experienced sa as a kid (6/7/8) and that made me believe i was the problem and that i needed to fix myself somehow.",
      "created_utc": 1735620454.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4o1po1",
      "author": "liv_42346",
      "body": "Probably 9-10",
      "created_utc": 1735635799.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4rvc8j",
      "author": "None",
      "body": "It was more so with my body at 6 but i started  to spiral and things got worse with food at 9.",
      "created_utc": 1735689414.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4si324",
      "author": "MaintenanceCreepy522",
      "body": "8-9 years old",
      "created_utc": 1735698261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4vnom6",
      "author": "PontiusPilate06",
      "body": "i was about 8 as well. I hated my thighs and belly. Everyone of my friends was really thin, while I was not. At age 12 it got worse, pandemic came, I started to grow and becoming a woman in isolation. Now I deal with bulimia and restrictive behaviours.",
      "created_utc": 1735754659.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4wifht",
      "author": "prettyflockania",
      "body": "Around 12 when I moved across country. I didn’t have any friends or activities in between 7th-8th grade. Gained 100 pounds got bullied developed an ED and dropped down to 98 pounds. Now back into my 12 year old self predicament no friends or activities besides work and over weight again",
      "created_utc": 1735764544.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4xg0la",
      "author": "Independent_Ball_640",
      "body": "13 because my best friend at the time kept body shaming me, she is thankfully out of my life",
      "created_utc": 1735775552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4zjul1",
      "author": "The_FionaFox",
      "body": "When my mother started commenting on my weight in middle school 🤙🏻 I’m 30 now and am currently active in my eating disorder.",
      "created_utc": 1735811589.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m46l85q",
      "author": "etwichell",
      "body": "I was a teenager. It all started when someone said something to me.",
      "created_utc": 1735387902.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m46sby0",
      "author": "VisualBus2774",
      "body": "Gym class. Whenever that nonsense started.",
      "created_utc": 1735391774.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m46w0id",
      "author": "None",
      "body": "I was around 8 when my cousins kept pointing out how chubby I was, they always did when I was younger as a toddler but I realized how “bad” it was to be larger as I aged so I resented anyone that told me that and saw food as something I need to consume then began to control as a teen",
      "created_utc": 1735393511.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m46x4xt",
      "author": "Frankie_2154",
      "body": "With my body? At 7 years old was the first time I remember being weighed, and I lost my shit when I found out there was a kid that weighed less than me (ironically enough that kid has grown up to be my best friend and now weighs about 10kg more than I do)\n\nWith food I genuinely cannot tell, I think it was sometime in my teenage years but it only got real bad at 20 years old (I’m 22 now)",
      "created_utc": 1735394019.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m46zkx6",
      "author": "dylan_olin",
      "body": "When I was 9 when I started to feel/ being told I was fat and needed to lose weight. Since then I have a bad relationship with it.",
      "created_utc": 1735395105.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m45d771",
      "author": "SaltyCSea-r",
      "body": "I’m so proud of you and your recovery!!! You are beautiful and very strong! I’m 35 and can not stand my stomach. I’ve been sucking it in since I started dieting and it’s made my ribs look all weird lol. Now my skin is loose because I have lost so much weight and I can not stand when anyone touches me there. It makes me so uncomfortable I could cry.",
      "created_utc": 1735361318.0,
      "score": 6,
      "context": [
        {
          "id": "m4580f3",
          "author": "sweetfaerieface",
          "body": "I,too, was around 8. I was at church choir practice. I looked at everyone sitting in the pew and wondered why everyone’s belly was flat and mine was poochy. I am not sure if that really was the case but I thought it was. That’s when it all started\n\nEdited to say I turn 70 tomorrow and have been in recovery for 354 days. Longest I have ever gone",
          "created_utc": 1735359000.0
        }
      ]
    },
    {
      "id": "m45e6ue",
      "author": "SaltyCSea-r",
      "body": "): I’m so sorry . My whole family made fun of the way I looked growing up. My weight. My teeth. A birthmark I have on my back. My bunions. It took me 21 years before I would wear a tank top in public due to a patch of freckles on my back. Oh I also NEVER grew breast because I NEVER had a regular period. My mother fucked me up.",
      "created_utc": 1735361775.0,
      "score": 3,
      "context": [
        {
          "id": "m45cxoy",
          "author": "None",
          "body": "i was around 4 or 5 when i became aware of my body. my dad would make inappropriate comments like “you’re gonna have such a fat ass like your mom” and other gross shit. when i hit puberty i started restricting and eventually turned into an ed.",
          "created_utc": 1735361198.0
        }
      ]
    },
    {
      "id": "m498tjl",
      "author": "Mat-89",
      "body": "Oh my! A little early but, happy birthday!!",
      "created_utc": 1735422767.0,
      "score": 2,
      "context": [
        {
          "id": "m453za7",
          "author": "MoulinSarah",
          "body": "Age 9! I turn 41 on Monday.",
          "created_utc": 1735357278.0
        }
      ]
    },
    {
      "id": "m46c8ej",
      "author": "SaltyCSea-r",
      "body": "Omg I remember those diets!!! I still remember the calorie count to some foods I would eat when I was younger and I find myself gravitating towards them if I do eat now. My sister was also naturally thin and my mother favored her over me and still does to this day. I never lost weight until I started starving myself and would literally heat up some water mixed with calorie free drink mix I can’t remember what it’s called.. something light idk lol. All my other siblings were way less picky than me bc my mom just never fucking cared):",
      "created_utc": 1735382105.0,
      "score": 2,
      "context": [
        {
          "id": "m45fe7f",
          "author": "FloridaMomm",
          "body": "I literally can’t remember I time that I didn’t. I was a chubby kid and my grandpa would point out I needed portion control even when I was 4 or 5. My naturally thin sister would be given a big bowl of ice cream or cereal with a big spoon but I would be given a little bowl with a small spoon to encourage me to practice portion control. Growing up in the 90s/2000s was tough. I went on the South Beach diet and Special K diet before I turned 10\n\nFunnily enough my family pushing diets on me did the opposite of the intended effect because it caused me to binge and gain weight",
          "created_utc": 1735362338.0
        }
      ]
    },
    {
      "id": "m45bq1z",
      "author": "ever-grown-oak",
      "body": "More context, my immediate family was either overweight or obese, and I am 20 now.",
      "created_utc": 1735360645.0,
      "score": 2,
      "context": [
        {
          "id": "m45bhha",
          "author": "ever-grown-oak",
          "body": "Unfortunately, for as long as I can remember.\nThough, I was in denial up until I was 15.\nMy family was very poor, my siblings and I grew up on food bank food, cheap microwave meals and junk food. We were constantly reminded how hard it was to get food, and that we needed to eat everything and not waste anything.\nI remember feeling like a waste of space, or felt like I wasted food by eating it, so I tried to not eat as much as possible, to save the food for my siblings or for later. I ate burnt food, I ate the scraps, I ate the parts my siblings wouldn't eat.\nI am not picky because of this, I'll eat anything if it means it won't go to waste, but I won't go out of my way to eat perfectly fine foods.\n\nMy parents always complained about eating junk food, how it's not good for you, and makes you fat.\nI never remember ever liking the way I looked, I always thought I was chubby (I was not, I was always underweight).\n\nI always unconsciously restricted or purposely restricted because I felt like a waste.\nNow, I have severe body image issues, I binge, purge, restrict... It's endless.\nI started consciously doing it the moment I realized I was overweight in my late teens.",
          "created_utc": 1735360534.0
        }
      ]
    },
    {
      "id": "m45dz4j",
      "author": "SaltyCSea-r",
      "body": "I have always said that I have “bad body image issues” and only recently came to terms with having an eating disorder. I could be diagnosed with body dismorphia I’m not sure tho. I actually had meant to make an appointment with a nutritionist sometime within the last year and am going too soon. Have you been diagnosed with anything? I wish you the best and just know you are strong and beautiful! I have never been judgmental about the way people look and it saddens me to know there are so many people who feel the way I feel. I was never taught how to eat healthy and my mother always fed us junk food. I was sooooo picky growing up and now that I have realized I have an eating disorder I really want to try foods that I have never tried before like a cherry. It’s wild to me that my mother would just be like ok and would just let me eat junk instead. I’m actually excited to start trying new foods in the future! When I get better of course. But I recently tried sweet potatoes and am in love because they really are so good lol.",
      "created_utc": 1735361674.0,
      "score": 2,
      "context": [
        {
          "id": "m45bhha",
          "author": "ever-grown-oak",
          "body": "Unfortunately, for as long as I can remember.\nThough, I was in denial up until I was 15.\nMy family was very poor, my siblings and I grew up on food bank food, cheap microwave meals and junk food. We were constantly reminded how hard it was to get food, and that we needed to eat everything and not waste anything.\nI remember feeling like a waste of space, or felt like I wasted food by eating it, so I tried to not eat as much as possible, to save the food for my siblings or for later. I ate burnt food, I ate the scraps, I ate the parts my siblings wouldn't eat.\nI am not picky because of this, I'll eat anything if it means it won't go to waste, but I won't go out of my way to eat perfectly fine foods.\n\nMy parents always complained about eating junk food, how it's not good for you, and makes you fat.\nI never remember ever liking the way I looked, I always thought I was chubby (I was not, I was always underweight).\n\nI always unconsciously restricted or purposely restricted because I felt like a waste.\nNow, I have severe body image issues, I binge, purge, restrict... It's endless.\nI started consciously doing it the moment I realized I was overweight in my late teens.",
          "created_utc": 1735360534.0
        }
      ]
    },
    {
      "id": "m4beev9",
      "author": "jarofonions",
      "body": "Same, same, and same??? gang gang 🤠🥲",
      "created_utc": 1735452186.0,
      "score": 1,
      "context": [
        {
          "id": "m47oug1",
          "author": "Crimson-Rose28",
          "body": "I was only 6 and told my mom I felt fat. This was in 1999 so it makes sense 🙃",
          "created_utc": 1735404405.0
        }
      ]
    },
    {
      "id": "m4d934d",
      "author": "SaltyCSea-r",
      "body": "): I hope you’re feeling better these days . Seeing ages younger than the age I started to diet makes me sick to my stomach):",
      "created_utc": 1735487605.0,
      "score": 0,
      "context": [
        {
          "id": "m48ssb9",
          "author": "WhyiseveryusernameX2",
          "body": "When I was six, I started running around after eating specifically to make sure I wouldn’t gain weight; when I was seven, I started obsessively checking my body for weight gain, measuring my stomach, wrapping my hand around my wrist, gauging the thickness of my cheeks. I think the first time I tried to put myself on a diet was when I was ten.",
          "created_utc": 1735417447.0
        }
      ]
    },
    {
      "id": "m4e4ltr",
      "author": "SaltyCSea-r",
      "body": "Weed helps me eat but unfortunately I can no longer smoke due to legal issues that have come into play in my life so I’m struggling with getting an appetite.",
      "created_utc": 1735497501.0,
      "score": 0,
      "context": [
        {
          "id": "m4d8yg2",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735487562.0
        }
      ]
    },
    {
      "id": "m48azd4",
      "author": "sweetfaerieface",
      "body": "I am so sorry but I certainly feel you! This is such an insidious disorder! I know that therapy helped me so much!! For the first time I completely accept my body.",
      "created_utc": 1735411626.0,
      "score": 1,
      "context": [
        {
          "id": "m4580f3",
          "author": "sweetfaerieface",
          "body": "I,too, was around 8. I was at church choir practice. I looked at everyone sitting in the pew and wondered why everyone’s belly was flat and mine was poochy. I am not sure if that really was the case but I thought it was. That’s when it all started\n\nEdited to say I turn 70 tomorrow and have been in recovery for 354 days. Longest I have ever gone",
          "created_utc": 1735359000.0
        },
        {
          "id": "m45d771",
          "author": "SaltyCSea-r",
          "body": "I’m so proud of you and your recovery!!! You are beautiful and very strong! I’m 35 and can not stand my stomach. I’ve been sucking it in since I started dieting and it’s made my ribs look all weird lol. Now my skin is loose because I have lost so much weight and I can not stand when anyone touches me there. It makes me so uncomfortable I could cry.",
          "created_utc": 1735361318.0
        }
      ]
    },
    {
      "id": "m45edny",
      "author": "SaltyCSea-r",
      "body": "Which lead me to getting a boob job at 19 and although I had no complications I was not able to breastfeed any of my kids. I chose to have my implant over the muscle which I was told by the doctor would have an impact on breastfeeding but I didn’t care and was also alone for every appointment. My cousin took me to get the surgery and dropped me off after.",
      "created_utc": 1735361863.0,
      "score": 2,
      "context": [
        {
          "id": "m45cxoy",
          "author": "None",
          "body": "i was around 4 or 5 when i became aware of my body. my dad would make inappropriate comments like “you’re gonna have such a fat ass like your mom” and other gross shit. when i hit puberty i started restricting and eventually turned into an ed.",
          "created_utc": 1735361198.0
        },
        {
          "id": "m45e6ue",
          "author": "SaltyCSea-r",
          "body": "): I’m so sorry . My whole family made fun of the way I looked growing up. My weight. My teeth. A birthmark I have on my back. My bunions. It took me 21 years before I would wear a tank top in public due to a patch of freckles on my back. Oh I also NEVER grew breast because I NEVER had a regular period. My mother fucked me up.",
          "created_utc": 1735361775.0
        }
      ]
    },
    {
      "id": "m47880k",
      "author": "ever-grown-oak",
      "body": "I'm proud of your progress towards your recovery!\n\nI, myself, have not been diagnosed with an ED. The only time I might have gone close to getting a diagnosis is when I was admitted to the hospital for unrelating reasons.\nBut I am almost positive I have one, I just don't know which one. My symptoms seem to be everywhere with no consistency.",
      "created_utc": 1735398609.0,
      "score": 1,
      "context": [
        {
          "id": "m45bhha",
          "author": "ever-grown-oak",
          "body": "Unfortunately, for as long as I can remember.\nThough, I was in denial up until I was 15.\nMy family was very poor, my siblings and I grew up on food bank food, cheap microwave meals and junk food. We were constantly reminded how hard it was to get food, and that we needed to eat everything and not waste anything.\nI remember feeling like a waste of space, or felt like I wasted food by eating it, so I tried to not eat as much as possible, to save the food for my siblings or for later. I ate burnt food, I ate the scraps, I ate the parts my siblings wouldn't eat.\nI am not picky because of this, I'll eat anything if it means it won't go to waste, but I won't go out of my way to eat perfectly fine foods.\n\nMy parents always complained about eating junk food, how it's not good for you, and makes you fat.\nI never remember ever liking the way I looked, I always thought I was chubby (I was not, I was always underweight).\n\nI always unconsciously restricted or purposely restricted because I felt like a waste.\nNow, I have severe body image issues, I binge, purge, restrict... It's endless.\nI started consciously doing it the moment I realized I was overweight in my late teens.",
          "created_utc": 1735360534.0
        },
        {
          "id": "m45dz4j",
          "author": "SaltyCSea-r",
          "body": "I have always said that I have “bad body image issues” and only recently came to terms with having an eating disorder. I could be diagnosed with body dismorphia I’m not sure tho. I actually had meant to make an appointment with a nutritionist sometime within the last year and am going too soon. Have you been diagnosed with anything? I wish you the best and just know you are strong and beautiful! I have never been judgmental about the way people look and it saddens me to know there are so many people who feel the way I feel. I was never taught how to eat healthy and my mother always fed us junk food. I was sooooo picky growing up and now that I have realized I have an eating disorder I really want to try foods that I have never tried before like a cherry. It’s wild to me that my mother would just be like ok and would just let me eat junk instead. I’m actually excited to start trying new foods in the future! When I get better of course. But I recently tried sweet potatoes and am in love because they really are so good lol.",
          "created_utc": 1735361674.0
        }
      ]
    }
  ]
}