{
  "id": "1hnj56l",
  "subreddit": "EatingDisorders",
  "author": "Separate_Context6983",
  "created_utc": 1735318322.0,
  "title": "I have successfully recovered from a restrictive and binge ED - ask me anything 🫒🍎",
  "selftext": "Hello, I hope all lovely people on this sub have a great day :)\n\nI have been struggling with ana since I was 12, and have defeated (haha, funny way to phrase it) it last October. I can eat what I want now without feeling anything unhealthy, and am better than ever - physically, mentally, emotionally. I made this post because when I was deep in my mental illnesses I didn't know who to talk to, I felt so alone and isolated, didn't know who I was anymore and my whole existence seemed to revolve this part of my mental state. Also, I think the anonymity here on the world wide web might just be the thing to help other people open up and ask questions they've been too scared to ask. \n\nI won't give away my highest / lowest weight, as that is triggering. I also reserve the right to not answer questions I don't want to answer, so please don't be offended if your question is unanswered.\n\nHave a wonderful day, stay yourself 🍎🫒",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hnj56l/i_have_successfully_recovered_from_a_restrictive/",
  "score": 42,
  "num_comments": 34,
  "comments": [
    {
      "id": "m458ppe",
      "author": "Upbeat-Doughnut-3035",
      "body": "Hi, so happy for you about your recovery! I am not diagnosed but I believe I have EDNOS and I am extremely sensitive about food (I can’t eat in front of ppl, lost a ton of weight from a vicious restrict/binge cycle) and my family jokes about my “fat phase” quite often. I have been trying to take steps towards eating more each day and everytime this happens I shut down, stop eating, lose all progress, and just want to cry. So any advice to deal with the irritability that comes from not eating enough and lashing out on family or taking every comment about food too personally?",
      "created_utc": 1735359305.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m4919zt",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1735420254.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m4ac921",
      "author": "Lalalynds0523",
      "body": "Did you deal with the war of wanting to recover and not? Also did you have trouble accepting that you had an ED? How did you reconcile things in your head? \n\nI currently am in denial but not. I want recovery but don’t. I don’t have an ed, but I do. I know all the health risks, but I don’t care, etc.",
      "created_utc": 1735436386.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m473wvi",
      "author": "teary-eyed-pal",
      "body": "Did you seek treatment?",
      "created_utc": 1735396927.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m49et2n",
      "author": "yuru2323",
      "body": "Hey now food feels like something strange. I don't feel the way I used to feel about it now sometimes it feels like a squishy object or some object or something strange. Did the way you feel about food also changed? If so, how did you start to see it differently? (Idk if I'm phrasing things the right way tho my mind is so foggy bc of not eating sorry)",
      "created_utc": 1735424791.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m49k5qx",
      "author": "sweetfaerieface",
      "body": "I just want to say congratulations! I am 356 days into my recovery!",
      "created_utc": 1735426626.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m49trt8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1735430003.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4b2h84",
      "author": "waywardnootkatensis",
      "body": "What was the best way the people around you supported your recovery? Did you have relapses, and were you able to talk to your friends and family about relapse? Do you have any advice for friends and family to help their loved ones through recovery? Thank you so much.",
      "created_utc": 1735446595.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4b5yl5",
      "author": "still-rising",
      "body": "Congratulations on your recovery!!! If you don’t mind sharing, how did you deal with weight restoration (if that was part of your journey) and seeing your body change? Does the body hatred ever let up as you get further into recovery? \nAlso, how did you know when you were at the “right” weight for you/when it was okay to stop eating mechanically and start eating more intuitively? I don’t really have hunger/fullness cues, so my team says (and they’re right) that it’s not really feasible for me to eat intuitively right now, but I also have no idea how to figure out where my body “wants” to be if I’m ignoring its signals",
      "created_utc": 1735448140.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4ffv2w",
      "author": "kqtherines",
      "body": "im sorry that this is a bit late i hope youre still answering xx but how were your first recovery attempts? were there many, were they hard? i know people for whom recovery was quite swift, one-take sorta stuff and others where it took multiple, long and hard attempts.. and im struggling with that right now. thank you x",
      "created_utc": 1735512049.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4g8huv",
      "author": "Bkling0612",
      "body": "How did you heal? Did you stop restricting food altogether? Did you gain a lot of weight?",
      "created_utc": 1735521674.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4jivax",
      "author": "None",
      "body": "You're such a powerful girl! Congrats my dear! :)\n\nI am just wondering: is it possible that in a corner of your mind there still is a fear of gaining more weight than you already have? I feel that this fear will never leave me.",
      "created_utc": 1735575839.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4zw61h",
      "author": "Kuu345",
      "body": "Hello! I am so happy that you have recovered! I have several questions, hope you can help me with them :) . I had ana and now I am around 3-4 months into recovery, but I have started to binge a lot which is really affecting my mental health. If I eat one thing more than I had planned, then my whole day is kind of ruined and I feel like recently I have become a bit depressed due to my never ending binge (only binge, I don't purge or anything. I feel like I eat enough but very often still end up binging after meals) cycle. \n\nDid you feel like your mental health worsened during your binge / extreme hunger phases? If yes, then how did you deal with it?\n\n Also I have been experiencing some extreme bloating, like when I wake up I am slim but if I have one glass of water I immediately bloat. \n\nDid you experience a lot of bloating too? If yes, then how did you deal with it?",
      "created_utc": 1735819180.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9b1sad",
      "author": "Bulky-Slip430",
      "body": "How long do the intrusive food thoughts last?",
      "created_utc": 1737916020.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgphsby",
      "author": "teahtheworm",
      "body": "How long did it take for your weight to go back to normal?",
      "created_utc": 1741452719.0,
      "score": 1,
      "context": []
    },
    {
      "id": "my5a07x",
      "author": "WinterSuccotash6629",
      "body": "How do you get back your appetite? I lost my appetite and can only eat small amounts. It’s impossible to eat to my daily demand. I don’t know how to gain weight if I feel sick after half a plate",
      "created_utc": 1750106507.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m46oisl",
      "author": "Separate_Context6983",
      "body": "The thing about restriction I understood much later into my recovery is that, well, when you're hungry you're mean. It's understandable, as you are malnourished and tired all the time, but it still affects your friends and family, and it's really good you understood that so early!! There are two aspects to this, you and the frustration, and you and your environment. About you, I'd suggest to be kind. Once you're forgiving to yourself, you'll grow to be more kind to others as well. You are affected by an illness, and it takes time to fight it! Be proud of every step. About you and your environment, there is only one solution I fear - to overcome this. I'm not familiar with EDNOS, but at least with me the only way I found to become a better person was to recover. I started slow and took my time, but eventually I recovered, and I'm sure you can do it too :)",
      "created_utc": 1735389804.0,
      "score": 6,
      "context": [
        {
          "id": "m458ppe",
          "author": "Upbeat-Doughnut-3035",
          "body": "Hi, so happy for you about your recovery! I am not diagnosed but I believe I have EDNOS and I am extremely sensitive about food (I can’t eat in front of ppl, lost a ton of weight from a vicious restrict/binge cycle) and my family jokes about my “fat phase” quite often. I have been trying to take steps towards eating more each day and everytime this happens I shut down, stop eating, lose all progress, and just want to cry. So any advice to deal with the irritability that comes from not eating enough and lashing out on family or taking every comment about food too personally?",
          "created_utc": 1735359305.0
        }
      ]
    },
    {
      "id": "m4a2bnb",
      "author": "Separate_Context6983",
      "body": "Hey, yes I did :) I did develop a binge purge cycle a bit after I started recovery because of it, not my proudest moment... The best way I dealt with it was just to let it be, work with it. I want to eat a whole chocolate bar? Fine, I guess that's what I'll have. I like thinking of it like holding your breath for a long time, then taking really big breaths to stabilize eventually. You may feel uncomfortable, and confused, and very full, but the only way to relearn hunger cues is to eat. I don't see extreme hunger as negative , but a part of the process of recovery, and am very happy I enjoyed my extreme hunger duration, I felt very free that period ! :)",
      "created_utc": 1735432910.0,
      "score": 4,
      "context": [
        {
          "id": "m4919zt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735420254.0
        }
      ]
    },
    {
      "id": "m4c5z30",
      "author": "Separate_Context6983",
      "body": "I understand your state completely, and it's very natural given your circumstances <:) \n\n>Did you deal with the war of wanting to recover and not?\n\nOf course I did. I was completely alone in my eating disorder for a long time, no one knew about it, and the illness kept telling me I was not enough in everything I tried. It isolates you om purpose to keep you dependant on it. I understood I had to recover when I reached my goal weight and saw... I couldn't let myself eat. Even then, at the 'finish line', it wasn't enough. I understood it was either recovering or wasting away - I chose living.\n\n>Also did you have trouble accepting that you had an ED?\n\nNot really, I knew what I was doing to myself, I more so had trouble admitting to my friends and family - but what saved me was a conversation with a friend. Realizing you aren't capable of holding yourself responsible is.. rough, but it's not something you have to go through alone.\n\n>How did you reconcile things in your head? \n\nA *lot* of rational thinking and repeating mantras. It was a 'fake it until you make it' situation - yeah, I may feel bloated and 'guilty' because I ate a full meal, but that's because I'm *recovering*. It's a process. Next meal I'll feel a little better and so on, until I can eat normally. Repeating to myself I am worthy of food and I dont need to earn it was something I did and still do everyday.\n\nI wish you the best, and I promise you recovery is more than possible - it's freeing.",
      "created_utc": 1735469166.0,
      "score": 1,
      "context": [
        {
          "id": "m4ac921",
          "author": "Lalalynds0523",
          "body": "Did you deal with the war of wanting to recover and not? Also did you have trouble accepting that you had an ED? How did you reconcile things in your head? \n\nI currently am in denial but not. I want recovery but don’t. I don’t have an ed, but I do. I know all the health risks, but I don’t care, etc.",
          "created_utc": 1735436386.0
        }
      ]
    },
    {
      "id": "m479rkd",
      "author": "Separate_Context6983",
      "body": "Personally - no. I managed to recover with my friends and family by my side, and didn't need professional help. That is not the case for everyone, multiple friends of mine had issues with food and needed more professional support, and that's perfectly fine :)",
      "created_utc": 1735399184.0,
      "score": 3,
      "context": [
        {
          "id": "m473wvi",
          "author": "teary-eyed-pal",
          "body": "Did you seek treatment?",
          "created_utc": 1735396927.0
        }
      ]
    },
    {
      "id": "m4a2znp",
      "author": "Separate_Context6983",
      "body": "Omg that's a great question \n\nFood was all numbers. And fears. And everything bad, basically. It was so scary, and now it's legitimately such a fun, creative part of my life. I now enjoy cooking, and making myself food, and sharing experiences with loved ones regarding food. Instead of this distant 'object' you're describing, it's now a part of my life :) as for how I started, I started treating it as something of the everyday - it's not special in a way that deserves criticism, but in a way that incorporates it into my day to day. Just try to say to yourself, everytime you eat  - it's not a number, or a food group, it's just this tatste combination I like. Eventually, you'll start believing it too :)",
      "created_utc": 1735433137.0,
      "score": 3,
      "context": [
        {
          "id": "m49et2n",
          "author": "yuru2323",
          "body": "Hey now food feels like something strange. I don't feel the way I used to feel about it now sometimes it feels like a squishy object or some object or something strange. Did the way you feel about food also changed? If so, how did you start to see it differently? (Idk if I'm phrasing things the right way tho my mind is so foggy bc of not eating sorry)",
          "created_utc": 1735424791.0
        }
      ]
    },
    {
      "id": "m4a32mu",
      "author": "Separate_Context6983",
      "body": "Thank you! It's rough out here sometimes haha\n\n356 is great! Almost a year",
      "created_utc": 1735433165.0,
      "score": 2,
      "context": [
        {
          "id": "m49k5qx",
          "author": "sweetfaerieface",
          "body": "I just want to say congratulations! I am 356 days into my recovery!",
          "created_utc": 1735426626.0
        }
      ]
    },
    {
      "id": "m4a446o",
      "author": "Separate_Context6983",
      "body": "Hello, hope you're well :) That could indicate a binge-restrict cycle, basically you're living off of the energy your body preserved during the night and then eating at night after hours of fighting your instincts, rinse and repeat. I had experienced that, one of the hardest times of my life... It was a very lonely period as I felt weak willed,which was false - listening to what my mind tells me I need was what I needed. I get how scary recovery can be, so I want you to know more than possible, it's amazing. It's the best thing I did for myself. You *can* live in peace with your mind and body and soul. Personally, I just stopped tracking numbers, lifted the band-aid quickly and never looked back. It was a tough process, but it proved I am stronger than my anxieties, and so are you :)",
      "created_utc": 1735433508.0,
      "score": 3,
      "context": [
        {
          "id": "m49trt8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735430003.0
        }
      ]
    },
    {
      "id": "m4c7amx",
      "author": "Separate_Context6983",
      "body": "Hello, I hope you're well :)\n\n>What was the best way the people around you supported your recovery?\n\nMy first step in recovery was talking to a friend. She wasn't angry, or shocked, she actually figured it out a few weeks before, and she told me what I was doing is bad for me. Not letting me stay in a puddle of self pity was so good for me, as she put me in front of reality. I remember she told me \"it's either recovering or dying\", and that really stuck with me... She also suggested making a list - one of all the things the illness took from me (being able to enjoy holidays, a working body, happiness, ect), and one of all it gave me (constant fatigue, a snappy and aggressive personality, ect). I would go so far to say that list saved me, as it put me face to face with my situation. Overall, being supportive but not letting your loved one wallow in their sadness is what really kept me going.\n\n>Did you have relapses, and were you able to talk to your friends and family about relapse?\n\nI'll be honest with you, yes. Last month I purged once, a moment of weakness, but I kept going. I didn't let that one moment define my life again, because that's what happened when I was ill - one meal, one snack, defined the next few days, and that's not realistic. Sometimes, people relapse. That's normal, to an extent. I spoke to my friends and my teacher about relapses, my teacher  specifically was really supportive and helpful. He made sure I felt safe enough to talk to him without judgment, but he still held me accountable to my actions.\n\n>Do you have any advice for friends and family to help their loved ones through recovery?\n\nBe kind, and patient. It's a long process. Most of all, I'd make sure my loved one understands that recovery is the only way to live. Point blank, it's either that or wasting away. It's a tough process with up and downs, and I know I wouldn't be able to do it without my friends and family :) I am guessing you are a loved one, so I'll say you are very important to the person who's close to you. I'm sure they appreciate you.",
      "created_utc": 1735470020.0,
      "score": 1,
      "context": [
        {
          "id": "m4b2h84",
          "author": "waywardnootkatensis",
          "body": "What was the best way the people around you supported your recovery? Did you have relapses, and were you able to talk to your friends and family about relapse? Do you have any advice for friends and family to help their loved ones through recovery? Thank you so much.",
          "created_utc": 1735446595.0
        }
      ]
    },
    {
      "id": "m4cezeu",
      "author": "Separate_Context6983",
      "body": "Hello! I hope you're well :)\n\n>how did you deal with weight restoration (if that was part of your journey) and seeing your body change? Does the body hatred ever let up as you get further into recovery? \n\nOf course I dealt with that! I think every person recovering has. Honestly it was very tough, after such a long time of equating my body and weight to my worth, seeing, feeling, and knowing my body is changing was hard.. I remember a few weeks after I started eating I noticed something on my body and completely freaked out, but eventually calmed down. I remind myself everytime I look in the mirror this body, my healthy body, is what allows me to be happy. To be with my friends. I won't let myself waste away for a few kilograms, I was miserable. It's a fake it till you make it situation, at first you hate everything and want to give up, but slowly you come to understand A. This is worth it. Living is worth it. B. You *are* happier recovered C. You look better. I know some people don't like to talk about looks here, but I like my appearance much more now than when I was ill, because I can actually see my body, and not a morphed, dysphoric version of it. I like myself! Thighs and all.\n\n>how did you know when you were at the “right” weight for you/when it was okay to stop eating mechanically and start eating more intuitively?\n\nPersonally I don't think there is a right weight to eat intuitively. I like to think about it like holding your breath for a really long time, then taking big breaths to stabilize yourself eventually. After starving yourself, your body will want to prepare for the next \"famine\", so it'll require a lot of energy. That's normal! This is a period where you take 'big breaths' and eat a lot. It might feel uncomfortable and bloated at times because you don't have fullness cues yet, but that's exactly what builds those cues - trial and failure. I didn't recover in a facility so I didn't have a team, so I personally just started eating, after a month or so of eating too much everyday my body started to understand when it's hungry and when it's not. Also, after the body realizes there's no famine, it stabilzes in terms of hunger cues and starts requiring less energy.\n\nRecovery is more than possible, it's the best thing you can do for yourself :)",
      "created_utc": 1735474761.0,
      "score": 3,
      "context": [
        {
          "id": "m4b5yl5",
          "author": "still-rising",
          "body": "Congratulations on your recovery!!! If you don’t mind sharing, how did you deal with weight restoration (if that was part of your journey) and seeing your body change? Does the body hatred ever let up as you get further into recovery? \nAlso, how did you know when you were at the “right” weight for you/when it was okay to stop eating mechanically and start eating more intuitively? I don’t really have hunger/fullness cues, so my team says (and they’re right) that it’s not really feasible for me to eat intuitively right now, but I also have no idea how to figure out where my body “wants” to be if I’m ignoring its signals",
          "created_utc": 1735448140.0
        }
      ]
    },
    {
      "id": "m4hwwp6",
      "author": "Separate_Context6983",
      "body": "Hi! I hope you're well :)\n\nI recovered two times, with a gap of two years between them - I relapsed half a year after my first recovery attempt. The first recovery attempt was easier than the second, when I came back to the illness I felt shameful of 'what I did to myself', whatever that means... It took me about half a year to recover the second time. It was long and hard, but I did it - and I would've done it even if it took me my whole life. I cannot imagine being 80 and thinking back to my youth, remembering calories and diets. Take as long as you need! Sometimes it takes time, but as long as you're progressing, you'll get there :)",
      "created_utc": 1735548656.0,
      "score": 1,
      "context": [
        {
          "id": "m4ffv2w",
          "author": "kqtherines",
          "body": "im sorry that this is a bit late i hope youre still answering xx but how were your first recovery attempts? were there many, were they hard? i know people for whom recovery was quite swift, one-take sorta stuff and others where it took multiple, long and hard attempts.. and im struggling with that right now. thank you x",
          "created_utc": 1735512049.0
        }
      ]
    },
    {
      "id": "m4hxdxg",
      "author": "Separate_Context6983",
      "body": "Hi, I hope you're well :)\n\n>Did you stop restricting food altogether?\n\nActually, I just stopped counting calories in one swift move. It took me a long time to open up to foods I didn't know / weren't prepared by me, but I did it eventually. I remember the first time I ordered a hamburger, and only when it came to the table I noticed I didn't even think about calories when I ordered it- I was free\n\nDiscussion of weight ahead - no numbers :)\n\n>!Did you gain a lot of weight?!<\n\n>!Idk, haven't weighed myself since my lowest weight. I have visibly gained weight so I guess, but I wouldn't say its a lot, I just got back to my healthy body I had before. I'll also say I like my body way more than when I was sick - having a ed distorts your view of your body, almost in a dysphoric way. I like my body now, and that's the thing I fought so hard to do :)!<",
      "created_utc": 1735548974.0,
      "score": 1,
      "context": [
        {
          "id": "m4g8huv",
          "author": "Bkling0612",
          "body": "How did you heal? Did you stop restricting food altogether? Did you gain a lot of weight?",
          "created_utc": 1735521674.0
        }
      ]
    },
    {
      "id": "m4jncsd",
      "author": "Separate_Context6983",
      "body": "Hi, I hope you're well :)\n\nI'll be honest and say that yes. The voice is still there. There's this really good horror story about a woman who has a monster in her house, and throughout the story she tries to fight it - eventually, she learns to coexist with it. It's kinda like that, you learn to live with the voices, learn to ignore them :)",
      "created_utc": 1735577238.0,
      "score": 2,
      "context": [
        {
          "id": "m4jivax",
          "author": "None",
          "body": "You're such a powerful girl! Congrats my dear! :)\n\nI am just wondering: is it possible that in a corner of your mind there still is a fear of gaining more weight than you already have? I feel that this fear will never leave me.",
          "created_utc": 1735575839.0
        }
      ]
    },
    {
      "id": "m50ercb",
      "author": "Separate_Context6983",
      "body": "Hello! I am so happy to hear you are recovering, good luck 💝💝\n\nI dealt with extreme hunger too, yeah :) I got into a binge-purge cycle because I was trying to 'fight' the hunger, which wasn't healthy. The only way I found to make the extreme hunger subside was to honor it. It's hard, may leave you bloated and confused, maybe even shameful - but it's the right thing to do. I like to think of it as holding your breath for a really long time, then taking big breaths to stabilize yourself eventually. Currently, your body requires big breaths to stabilize ; it fears the next famine, and wants to put on security weight. One it understands no famine is coming, it'll put off the security weight back to your healthy one, and activate your hunger cues back :) the only way to go through this process I found successfull is to take this time to rebuild your trust with your body. My brain tells me to eat a full bar of chocolate? Well, I guess we're doing that. Don't ignore your hunger + fullness cues. Your wrote \n\n>If I eat one thing more than I had planned\n\nEating is intuitive! It's okay to eat spontaneously, that's how healthy people eat. :)\n\nAbout the bloating, it is very common on the first few months of recovery as your stomach and metabolism have gotten smaller, so now everything you eat takes a bigger toll on your body. Once your stomach and metabolism 'wake up', the bloating will get better. It's also normal to get bloated, I get bloated after dinner most days because it's the end of the day and I'm after 3 meals - that's normal.\n\nThe illness is about control. It controls every aspect of your life. To let go of the illness, you need to let go some of that control, to eat what you feel is right. I believe in you :)",
      "created_utc": 1735827634.0,
      "score": 1,
      "context": [
        {
          "id": "m4zw61h",
          "author": "Kuu345",
          "body": "Hello! I am so happy that you have recovered! I have several questions, hope you can help me with them :) . I had ana and now I am around 3-4 months into recovery, but I have started to binge a lot which is really affecting my mental health. If I eat one thing more than I had planned, then my whole day is kind of ruined and I feel like recently I have become a bit depressed due to my never ending binge (only binge, I don't purge or anything. I feel like I eat enough but very often still end up binging after meals) cycle. \n\nDid you feel like your mental health worsened during your binge / extreme hunger phases? If yes, then how did you deal with it?\n\n Also I have been experiencing some extreme bloating, like when I wake up I am slim but if I have one glass of water I immediately bloat. \n\nDid you experience a lot of bloating too? If yes, then how did you deal with it?",
          "created_utc": 1735819180.0
        }
      ]
    },
    {
      "id": "m9erjdb",
      "author": "Separate_Context6983",
      "body": "Hello! I hope you're well :) define 'intrusive food thoughts '? I'm not sure I have an exact defenition",
      "created_utc": 1737957465.0,
      "score": 1,
      "context": [
        {
          "id": "m9b1sad",
          "author": "Bulky-Slip430",
          "body": "How long do the intrusive food thoughts last?",
          "created_utc": 1737916020.0
        }
      ]
    },
    {
      "id": "mgppbza",
      "author": "Separate_Context6983",
      "body": "About a year, idk what normal is but my body stopped changing drastically at about a year",
      "created_utc": 1741455046.0,
      "score": 2,
      "context": [
        {
          "id": "mgphsby",
          "author": "teahtheworm",
          "body": "How long did it take for your weight to go back to normal?",
          "created_utc": 1741452719.0
        }
      ]
    },
    {
      "id": "m4c3u31",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1735467766.0,
      "score": 2,
      "context": [
        {
          "id": "m4919zt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735420254.0
        },
        {
          "id": "m4a2bnb",
          "author": "Separate_Context6983",
          "body": "Hey, yes I did :) I did develop a binge purge cycle a bit after I started recovery because of it, not my proudest moment... The best way I dealt with it was just to let it be, work with it. I want to eat a whole chocolate bar? Fine, I guess that's what I'll have. I like thinking of it like holding your breath for a long time, then taking really big breaths to stabilize eventually. You may feel uncomfortable, and confused, and very full, but the only way to relearn hunger cues is to eat. I don't see extreme hunger as negative , but a part of the process of recovery, and am very happy I enjoyed my extreme hunger duration, I felt very free that period ! :)",
          "created_utc": 1735432910.0
        }
      ]
    },
    {
      "id": "m4d2pr3",
      "author": "still-rising",
      "body": "This gives me a lot of hope. Thank you so much for your responses 🩵",
      "created_utc": 1735485412.0,
      "score": 3,
      "context": [
        {
          "id": "m4b5yl5",
          "author": "still-rising",
          "body": "Congratulations on your recovery!!! If you don’t mind sharing, how did you deal with weight restoration (if that was part of your journey) and seeing your body change? Does the body hatred ever let up as you get further into recovery? \nAlso, how did you know when you were at the “right” weight for you/when it was okay to stop eating mechanically and start eating more intuitively? I don’t really have hunger/fullness cues, so my team says (and they’re right) that it’s not really feasible for me to eat intuitively right now, but I also have no idea how to figure out where my body “wants” to be if I’m ignoring its signals",
          "created_utc": 1735448140.0
        },
        {
          "id": "m4cezeu",
          "author": "Separate_Context6983",
          "body": "Hello! I hope you're well :)\n\n>how did you deal with weight restoration (if that was part of your journey) and seeing your body change? Does the body hatred ever let up as you get further into recovery? \n\nOf course I dealt with that! I think every person recovering has. Honestly it was very tough, after such a long time of equating my body and weight to my worth, seeing, feeling, and knowing my body is changing was hard.. I remember a few weeks after I started eating I noticed something on my body and completely freaked out, but eventually calmed down. I remind myself everytime I look in the mirror this body, my healthy body, is what allows me to be happy. To be with my friends. I won't let myself waste away for a few kilograms, I was miserable. It's a fake it till you make it situation, at first you hate everything and want to give up, but slowly you come to understand A. This is worth it. Living is worth it. B. You *are* happier recovered C. You look better. I know some people don't like to talk about looks here, but I like my appearance much more now than when I was ill, because I can actually see my body, and not a morphed, dysphoric version of it. I like myself! Thighs and all.\n\n>how did you know when you were at the “right” weight for you/when it was okay to stop eating mechanically and start eating more intuitively?\n\nPersonally I don't think there is a right weight to eat intuitively. I like to think about it like holding your breath for a really long time, then taking big breaths to stabilize yourself eventually. After starving yourself, your body will want to prepare for the next \"famine\", so it'll require a lot of energy. That's normal! This is a period where you take 'big breaths' and eat a lot. It might feel uncomfortable and bloated at times because you don't have fullness cues yet, but that's exactly what builds those cues - trial and failure. I didn't recover in a facility so I didn't have a team, so I personally just started eating, after a month or so of eating too much everyday my body started to understand when it's hungry and when it's not. Also, after the body realizes there's no famine, it stabilzes in terms of hunger cues and starts requiring less energy.\n\nRecovery is more than possible, it's the best thing you can do for yourself :)",
          "created_utc": 1735474761.0
        }
      ]
    },
    {
      "id": "m4ks0e4",
      "author": "None",
      "body": "Yes, good point. If only we were born one or two centuries earlier! The only monster we would've had to coexist with was the fear of hunger.",
      "created_utc": 1735589698.0,
      "score": 1,
      "context": [
        {
          "id": "m4jivax",
          "author": "None",
          "body": "You're such a powerful girl! Congrats my dear! :)\n\nI am just wondering: is it possible that in a corner of your mind there still is a fear of gaining more weight than you already have? I feel that this fear will never leave me.",
          "created_utc": 1735575839.0
        },
        {
          "id": "m4jncsd",
          "author": "Separate_Context6983",
          "body": "Hi, I hope you're well :)\n\nI'll be honest and say that yes. The voice is still there. There's this really good horror story about a woman who has a monster in her house, and throughout the story she tries to fight it - eventually, she learns to coexist with it. It's kinda like that, you learn to live with the voices, learn to ignore them :)",
          "created_utc": 1735577238.0
        }
      ]
    },
    {
      "id": "m4c7fmg",
      "author": "Separate_Context6983",
      "body": "Damn your therapist sounds... Uh, interesting. It's a really normal part of the process, enjoy the fact your body craves these foods and capitalize  off of it by eating the ice cream ‼️‼️",
      "created_utc": 1735470109.0,
      "score": 4,
      "context": [
        {
          "id": "m4919zt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735420254.0
        },
        {
          "id": "m4a2bnb",
          "author": "Separate_Context6983",
          "body": "Hey, yes I did :) I did develop a binge purge cycle a bit after I started recovery because of it, not my proudest moment... The best way I dealt with it was just to let it be, work with it. I want to eat a whole chocolate bar? Fine, I guess that's what I'll have. I like thinking of it like holding your breath for a long time, then taking really big breaths to stabilize eventually. You may feel uncomfortable, and confused, and very full, but the only way to relearn hunger cues is to eat. I don't see extreme hunger as negative , but a part of the process of recovery, and am very happy I enjoyed my extreme hunger duration, I felt very free that period ! :)",
          "created_utc": 1735432910.0
        },
        {
          "id": "m4c3u31",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1735467766.0
        }
      ]
    },
    {
      "id": "m4kxlgo",
      "author": "Separate_Context6983",
      "body": "....and racism and antisemitism and monocracy and illness and terror on a much larger scale and--",
      "created_utc": 1735591403.0,
      "score": 1,
      "context": [
        {
          "id": "m4jivax",
          "author": "None",
          "body": "You're such a powerful girl! Congrats my dear! :)\n\nI am just wondering: is it possible that in a corner of your mind there still is a fear of gaining more weight than you already have? I feel that this fear will never leave me.",
          "created_utc": 1735575839.0
        },
        {
          "id": "m4jncsd",
          "author": "Separate_Context6983",
          "body": "Hi, I hope you're well :)\n\nI'll be honest and say that yes. The voice is still there. There's this really good horror story about a woman who has a monster in her house, and throughout the story she tries to fight it - eventually, she learns to coexist with it. It's kinda like that, you learn to live with the voices, learn to ignore them :)",
          "created_utc": 1735577238.0
        },
        {
          "id": "m4ks0e4",
          "author": "None",
          "body": "Yes, good point. If only we were born one or two centuries earlier! The only monster we would've had to coexist with was the fear of hunger.",
          "created_utc": 1735589698.0
        }
      ]
    },
    {
      "id": "m4kyufy",
      "author": "None",
      "body": "Yeah, definitely, but I only meant the fears in the eating realm. I don't make a case against modernity, I'm just sorry to have become a victim of the modern thinness obsession. :)",
      "created_utc": 1735591784.0,
      "score": 2,
      "context": [
        {
          "id": "m4jivax",
          "author": "None",
          "body": "You're such a powerful girl! Congrats my dear! :)\n\nI am just wondering: is it possible that in a corner of your mind there still is a fear of gaining more weight than you already have? I feel that this fear will never leave me.",
          "created_utc": 1735575839.0
        },
        {
          "id": "m4jncsd",
          "author": "Separate_Context6983",
          "body": "Hi, I hope you're well :)\n\nI'll be honest and say that yes. The voice is still there. There's this really good horror story about a woman who has a monster in her house, and throughout the story she tries to fight it - eventually, she learns to coexist with it. It's kinda like that, you learn to live with the voices, learn to ignore them :)",
          "created_utc": 1735577238.0
        },
        {
          "id": "m4ks0e4",
          "author": "None",
          "body": "Yes, good point. If only we were born one or two centuries earlier! The only monster we would've had to coexist with was the fear of hunger.",
          "created_utc": 1735589698.0
        },
        {
          "id": "m4kxlgo",
          "author": "Separate_Context6983",
          "body": "....and racism and antisemitism and monocracy and illness and terror on a much larger scale and--",
          "created_utc": 1735591403.0
        }
      ]
    }
  ]
}