{
  "id": "1hnofuc",
  "subreddit": "EatingDisorders",
  "author": "saltybartfast",
  "created_utc": 1735332224.0,
  "title": "Help for 9 year old daughter in early stages of anorexia",
  "selftext": "Hello everyone my daughter has lost weight over the last few months and seems really body conscious. She’s limiting what she’s eating and spitting out food when she’s ‘full’. She’s super into anime and manga (age appropriate - mostly magical girl stuff) - I was keen to find out if anyone knows of any YouTubers who might talk about the issues she’s experiencing in a way that she’ll engage with better than me and my wife. We’re also working with our doctor who says we should take it seriously, and have an appointment with a counsellor.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hnofuc/help_for_9_year_old_daughter_in_early_stages_of/",
  "score": 96,
  "num_comments": 38,
  "comments": [
    {
      "id": "m44tna3",
      "author": "avasefullofnations",
      "body": "If you don't already keep tabs on what she's watching online I'd make sure you know because I was around her age when I started with my eating disorder and after I started restricting I did start using my unmonitored internet to find communities of others doing the same thing and ended up finding pro-eating disorder spaces. \n\nI'd also examine your own habits/others around to see if your own relationship with food is influencing how she's feeling. That being said it's also possible it's related to textural sensitivities or something else. \n\nOther than that maybe see if there are any resources within your community for supporting you and her as you help her so that you're able to get the support needed no matter what the reason behind her eating habits are.",
      "created_utc": 1735353102.0,
      "score": 134,
      "context": []
    },
    {
      "id": "m46av0a",
      "author": "onyxjade7",
      "body": "DO NOT go to you tube. Some very sick people are on there. Both those with disorders who refuse to admit they have them and those that prey on young people with them. Please take her to a doctor a trained psychologist and an eating disorder clinic. That’s good your taking her to a cohnsleor and physician. I’m sorry you’re dealing with this.",
      "created_utc": 1735381177.0,
      "score": 56,
      "context": []
    },
    {
      "id": "m4701vn",
      "author": "5foot3",
      "body": "Nurse with experience in Eating Disorders here. The most important thing is to get her in specialized treatment immediately. Do not mess around with generalized therapists as some of them unknowingly do more harm. You need eating disorder specialists. The number one predictor of relapse is how long they have been sick. If you catch it early, you will have the best chance. You will not be able to protect her from triggering content in the world, she needs professional help to develop skills to cope with whatever is driving this behavior and learn how to navigate a triggering world. I’m hopeful for a good outcome. You’re a good parent for noticing and springing into action.",
      "created_utc": 1735395307.0,
      "score": 112,
      "context": []
    },
    {
      "id": "m47r9n5",
      "author": "Odd_Theme_3294",
      "body": "I was 9 when I developed an eating disorder \nAnd I was accessing magazines and weightloss content on Twitter.\n\nBut now tiktok is the worst - if she’s on tiktok please encourage her to delete it",
      "created_utc": 1735405204.0,
      "score": 29,
      "context": []
    },
    {
      "id": "m48bf70",
      "author": "saltybartfast",
      "body": "Thanks very much for the advice everyone. Lots to think about here. We’ve got another gp appointment tomorrow so we’ll push for a referral for specialist eating disorder counselling. Also review what she’s watching more closely. Thanks again.",
      "created_utc": 1735411767.0,
      "score": 21,
      "context": []
    },
    {
      "id": "m46ng8f",
      "author": "Slenso",
      "body": "I honestly don’t think anime and manga is suited for children endless they are explicitly children anime shows (I.e sailor moon, Pokémon, Yu Gi Yo) \nPlease fully and thoroughly watch the shows she’s watching as well.. anime hides a lot of inappropriate themes and ideas while seemingly looking very child friendly and cutesy sometimes… some anime’s made in Japan have themes of insecurities and diet culture very casually because of the high beauty standards there..\nI would watch through every show she’s watching or becomes interested in as well when it comes to anime…. \nI started watching anime very young and even the anime’s that are targeted for younger people and teens can hide a lot of body insecurities, sexual innuendos/ themes, objectifying women, romantic ideal and themes that might be influencing her image or view on the world! \nI know there’s an anime called Magic Madoka that on the surface seems like a sweet cute magic girl anime but the themes are very dark and twisted as it goes on.\nEdit: also not that I believe anime or manga are a cause to the eating disorder or that monitoring will fix the issue but it might give you some insight on where she’s getting certain ideas and thoughts!",
      "created_utc": 1735389205.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m4a9l5p",
      "author": "designcentredhuman",
      "body": "Just to prepare for the future if you might need hospitalization (like my 12 year old did):  \n\\- start monthly blind weight and height measurements with the family doctor (the number one, no brainer thing you should absolutely do)  \n\\- the measurements will show the rate of weight loss, and can be the key resource when you need to convince ER to hospitalize your kid (if needed, and I wish from the bottom of my heart that you don't)  \n\\- you can do therapy, but constantly keep an eye on actual outcomes (increased weight mostly). Therapy can be a huge distraction and sometimes fruitless even with specialists (eg in our case).  \n\\- over indexing on your child's socials can be a distraction too – anorexia is a deeper issue with multiple concurent triggers.  \n\\- look up a children's hospital with an eating disorder program for kids, and get on the outpatient waiting list\n\nMy daughter's undiagnosed ASD was a key components for her crisis. If your daughter has a close to normal BMI, it's worth investing in a pschoeducational assessment, to see if its a factor in your case. Anorexia also has a bit different drivers and ideal treatment for people with ASD.\n\nAnorexia is often, at its very root, about control. It's worth reflecting if there're too many constraints on your child, or if there were any big life events that made her unsettled.\n\nAnd a word of encouragement: we had a really tough year in 2023 because of my daughter's anorexia, but the inpatient program worked, and turned things around. A year ago my daughter was on a hear monitor, now she's happy, healthy, and full of life. The important thing is that you picked up on it, and you are actively looking for solutions. You will find them and make it through.",
      "created_utc": 1735435413.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m49fk7b",
      "author": "sugarfestzea",
      "body": "I don’t have any advice, but please give that sweet baby girl a hug from us all. It kills me to know kids that young develop these kinds of disorders",
      "created_utc": 1735425044.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m4aryg2",
      "author": "kltcxs",
      "body": "this was about the age i became calorie conscious. i would also start scratching out labels around the house so she can’t see. also definitely see what she is watching and possibly ask what her and friends discuss because when i was this little me and my friends would have contests of who could not eat longest or who could be the thinnest. ",
      "created_utc": 1735442327.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m48gvh4",
      "author": "Old-Friendship9613",
      "body": "I'm so sorry you're going through this with your daughter. It's really good that you've noticed these signs early and are already working with medical professionals.  I want to be careful about recommending specific YouTube content around eating disorders for someone so young, but there might be a constructive way to use her interest in magical girl anime. Could you perhaps watch some of her favorite shows with her and use them as conversation starters about what makes the characters strong and special? Are you able to make mealtimes more relaxed and social, perhaps involving her in age-appropriate meal planning or preparation in a fun way? This could help shift the focus from the food itself to the social experience. Best thing to do is keep working with the counselor and doctor!",
      "created_utc": 1735413526.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m4azz2x",
      "author": "teddybear65",
      "body": "She has picked it up somewhere. She should not be on YouTube. Take her to a Dr.",
      "created_utc": 1735445537.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m483vlc",
      "author": "kimchiplug",
      "body": "Honestly at this stage I would highly suggest you do not giver her any YouTubers or books or anything about the subject. It will lead to others who offer how-to content. I was given a memoir by a therapist who claimed to be an eating disorder “specialist” (be careful as this is also a self proclaimed title) and it taught me how to hide my behaviors better, binge cheaper, and purge more effectively all in one. \n\nRefocus her onto things she enjoys. Things in life other than her body or image. Do not comment good or bad on her body (or your own). If she complains about weight, don’t feed into it. Redirect.",
      "created_utc": 1735409328.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m4byugv",
      "author": "shadesofgraceandblue",
      "body": "Hide the weighing scale, restrict her internet use. Use apps that will restrict her online search for related topics. Banning soc med would also be very helpful. Avoid forcing her to eat or commenting on her eating habits. Let the doctors explain the consequences of her eating habits. Tell her how much you love her no matter her shape or size. Validate her feelings and just let her know she’ll get through it and you will be there for her no matter what. \n\nMake her busy with outdoor activities. She needs to get sunlight to boost her mood. If she’s always indoors she could be lacking of Vit D which is one of the causes of depression. \nServe her a high protein and high fiber meal. You must also know how much nutrient content is in every food you serve so you know how to guide her. \n\nIt would help to let her understand that \nshe is in her puberty stage. She is still developing and her body will change in every stage of her development. Also, puberty hormones make children feel overly emotional. This will continue until their transition to adolescence stage. Social media mess up their thinking. They need to be guided and monitored during these stages. \n\n“During puberty your child’s emotions may become stronger and more intense. Their mood might change more frequently, quickly and randomly. Your child may have strong emotions that they’ve never experienced before. It’s common for them to feel confused, scared or angry and not know why.” \nhttps://www.chconline.org/resourcelibrary/mood-swings-and-puberty/#:~:text=During%20puberty%20your%20child’s%20emotions,angry%20and%20not%20know%20why.",
      "created_utc": 1735464482.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m48xmb4",
      "author": "kisstheladder",
      "body": "when my anorexia was at its peak, my Instagram explore page would keep showing me posts focusing on cals which just made things worst but ofc it was me liking posts like that 😭 just another factor to consider",
      "created_utc": 1735419045.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m4g8cmf",
      "author": "binxy_boo15",
      "body": "These links do not substitute professional treatment but may be helpful resources for parents/family \n\nhttps://feast-ed.org \n\nhttps://ginnyjonescoach.com/eating-disorders-blog/",
      "created_utc": 1735521622.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4jk9sl",
      "author": "falsegodfan",
      "body": "this is so sad wtf she’s so young :(( i would suggest not allowing her to be on social media at all - when i was in anorexia recovery, disconnecting myself from the online world and spending more time outdoors helped SO much. especially at such a young age all of the content on social media is so damaging in terms of the way you view yourself and your outward appearance. you could also try getting her some mindfulness stuff like colouring books or getting her into a relaxing hobby, it helps to distract from thoughts of weight",
      "created_utc": 1735576283.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m48zhgm",
      "author": "None",
      "body": "When I was a young girl with an eating disorder, I watched a lot of jaiden animations. And one day she came out with a video about her own struggles with anorexia and it helped me a lot to realize I wasn't alone in my struggles. Now I don't know any more good video options, but you should absolutely stay away from the channel called \"Pysch2go\". They tend to villanize Disorders and usually make us feel worse.",
      "created_utc": 1735419658.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m46is2g",
      "author": "setaside929",
      "body": "Hi there, there is a 12 step fellowship called Overeaters Anonymous that helps with eating disorders of all kinds (anorexia is often rooted in the same underlying illness as overeating - as someone who has binged and restricted I can tell you it’s easy to swing between them). I’m pretty sure OA has resources for children / teens which might help you. I’d be happy to talk with you too about my experience with the illness and recovery - it can really affect the family as much as the person with the ED. Feel free to reach out anytime :)",
      "created_utc": 1735386406.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m49647n",
      "author": "pollyhendricks23",
      "body": "What city are you in?",
      "created_utc": 1735421872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4tt508",
      "author": "ConnectionOwn4658",
      "body": "ED specialized provider here. Definitely seek eating disorder specialized treatment first. Generalists can often unintentionally cause more harm, and early intense intervention  predicts better outcomes for this disorder. The treatment with the best outcomes for youth is called Family-based treatment (FBT). This is different from family therapy! ",
      "created_utc": 1735724051.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4b0jgu",
      "author": "teddybear65",
      "body": "In my 40s I became anorexic. Went from 180 to 107. I'm 71 now .I slip a lot.\nI don't like to eat. Before bed I inventory what I eat. Then I eat junk if I didn't eat enough. Since COVID it's been very difficult. I can't taste anything. Hospital never helped me at all.i was in therapy 20+ years. I only got better when I decided to.",
      "created_utc": 1735445768.0,
      "score": -2,
      "context": []
    },
    {
      "id": "m45f3cc",
      "author": "saltybartfast",
      "body": "Thanks for the reply! Yes we do keep tabs and have quostodio etc but she’s clever and may find ways around it. We need to watch more closely. There are communities here locally (New Zealand) and we’re getting in touch with them.",
      "created_utc": 1735362197.0,
      "score": 31,
      "context": [
        {
          "id": "m44tna3",
          "author": "avasefullofnations",
          "body": "If you don't already keep tabs on what she's watching online I'd make sure you know because I was around her age when I started with my eating disorder and after I started restricting I did start using my unmonitored internet to find communities of others doing the same thing and ended up finding pro-eating disorder spaces. \n\nI'd also examine your own habits/others around to see if your own relationship with food is influencing how she's feeling. That being said it's also possible it's related to textural sensitivities or something else. \n\nOther than that maybe see if there are any resources within your community for supporting you and her as you help her so that you're able to get the support needed no matter what the reason behind her eating habits are.",
          "created_utc": 1735353102.0
        }
      ]
    },
    {
      "id": "m4asibs",
      "author": "Lindsey7618",
      "body": "There are plenty of YouTube videos that are properly educational and would help her, that's why he's asking for recommendations. He's already said that he's getting her help so he definitely seems to be doing his research and I'm sure will get her the proper help.",
      "created_utc": 1735442545.0,
      "score": -1,
      "context": [
        {
          "id": "m46av0a",
          "author": "onyxjade7",
          "body": "DO NOT go to you tube. Some very sick people are on there. Both those with disorders who refuse to admit they have them and those that prey on young people with them. Please take her to a doctor a trained psychologist and an eating disorder clinic. That’s good your taking her to a cohnsleor and physician. I’m sorry you’re dealing with this.",
          "created_utc": 1735381177.0
        }
      ]
    },
    {
      "id": "m495vf7",
      "author": "pollyhendricks23",
      "body": "200%. Call the Specialist NOW. If they have a wait list- call every morning at 8am and check for cancellations. She could lose lots of weight by the time you get her in. If they recommend hospitalization GO right away. The nurse above is correct. The sooner she gets help, the better the chance for a full recovery!!!",
      "created_utc": 1735421790.0,
      "score": 22,
      "context": [
        {
          "id": "m4701vn",
          "author": "5foot3",
          "body": "Nurse with experience in Eating Disorders here. The most important thing is to get her in specialized treatment immediately. Do not mess around with generalized therapists as some of them unknowingly do more harm. You need eating disorder specialists. The number one predictor of relapse is how long they have been sick. If you catch it early, you will have the best chance. You will not be able to protect her from triggering content in the world, she needs professional help to develop skills to cope with whatever is driving this behavior and learn how to navigate a triggering world. I’m hopeful for a good outcome. You’re a good parent for noticing and springing into action.",
          "created_utc": 1735395307.0
        }
      ]
    },
    {
      "id": "m4byifs",
      "author": "always_sleepy1294",
      "body": "CEDRN can confirm.",
      "created_utc": 1735464260.0,
      "score": 1,
      "context": [
        {
          "id": "m4701vn",
          "author": "5foot3",
          "body": "Nurse with experience in Eating Disorders here. The most important thing is to get her in specialized treatment immediately. Do not mess around with generalized therapists as some of them unknowingly do more harm. You need eating disorder specialists. The number one predictor of relapse is how long they have been sick. If you catch it early, you will have the best chance. You will not be able to protect her from triggering content in the world, she needs professional help to develop skills to cope with whatever is driving this behavior and learn how to navigate a triggering world. I’m hopeful for a good outcome. You’re a good parent for noticing and springing into action.",
          "created_utc": 1735395307.0
        }
      ]
    },
    {
      "id": "m48ath8",
      "author": "Slenso",
      "body": "Yes please keep your children off tiktok. The eating disorder encouragement and community is scary and very active there. Tiktok does pretty much 0 moderation to eliminate this content despite claiming they don’t want people encouraging eating disorders.",
      "created_utc": 1735411574.0,
      "score": 16,
      "context": [
        {
          "id": "m47r9n5",
          "author": "Odd_Theme_3294",
          "body": "I was 9 when I developed an eating disorder \nAnd I was accessing magazines and weightloss content on Twitter.\n\nBut now tiktok is the worst - if she’s on tiktok please encourage her to delete it",
          "created_utc": 1735405204.0
        }
      ]
    },
    {
      "id": "m4dui2n",
      "author": "designcentredhuman",
      "body": "If you are at the GP, I'd ask for a monthly blind weight monitoring. Anorexia can go downhill really fast, and having historical data/trend can be a key asset when you need to advocate for resources.",
      "created_utc": 1735494435.0,
      "score": 1,
      "context": [
        {
          "id": "m48bf70",
          "author": "saltybartfast",
          "body": "Thanks very much for the advice everyone. Lots to think about here. We’ve got another gp appointment tomorrow so we’ll push for a referral for specialist eating disorder counselling. Also review what she’s watching more closely. Thanks again.",
          "created_utc": 1735411767.0
        }
      ]
    },
    {
      "id": "m4d48qr",
      "author": "catwomen999",
      "body": "While you hit some good points, if a 9 year old has a diagnosable eating disorder you can’t explain, negotiate, or rationalize in a way that they will understand. They are too unwell especially in combination with only being nine. \n\nTreatment would involve providing energy dense foods (perhaps higher in carbs and fat) with the expectation that what parents serve is finished.",
      "created_utc": 1735485953.0,
      "score": 3,
      "context": [
        {
          "id": "m4byugv",
          "author": "shadesofgraceandblue",
          "body": "Hide the weighing scale, restrict her internet use. Use apps that will restrict her online search for related topics. Banning soc med would also be very helpful. Avoid forcing her to eat or commenting on her eating habits. Let the doctors explain the consequences of her eating habits. Tell her how much you love her no matter her shape or size. Validate her feelings and just let her know she’ll get through it and you will be there for her no matter what. \n\nMake her busy with outdoor activities. She needs to get sunlight to boost her mood. If she’s always indoors she could be lacking of Vit D which is one of the causes of depression. \nServe her a high protein and high fiber meal. You must also know how much nutrient content is in every food you serve so you know how to guide her. \n\nIt would help to let her understand that \nshe is in her puberty stage. She is still developing and her body will change in every stage of her development. Also, puberty hormones make children feel overly emotional. This will continue until their transition to adolescence stage. Social media mess up their thinking. They need to be guided and monitored during these stages. \n\n“During puberty your child’s emotions may become stronger and more intense. Their mood might change more frequently, quickly and randomly. Your child may have strong emotions that they’ve never experienced before. It’s common for them to feel confused, scared or angry and not know why.” \nhttps://www.chconline.org/resourcelibrary/mood-swings-and-puberty/#:~:text=During%20puberty%20your%20child’s%20emotions,angry%20and%20not%20know%20why.",
          "created_utc": 1735464482.0
        }
      ]
    },
    {
      "id": "m48saha",
      "author": "jarofonions",
      "body": "This is probably a terrible idea, no offense. For a 9yo with an ed, it might not matter that the actual content of the groups are helpful, the name itself could be extremely triggering right off the bat. I see what you're saying, 200%, but I think a 9yo would hear the name of the new group they're going to and think \"wow, I *must be* eating to much, and my parents agree\"",
      "created_utc": 1735417283.0,
      "score": 8,
      "context": [
        {
          "id": "m46is2g",
          "author": "setaside929",
          "body": "Hi there, there is a 12 step fellowship called Overeaters Anonymous that helps with eating disorders of all kinds (anorexia is often rooted in the same underlying illness as overeating - as someone who has binged and restricted I can tell you it’s easy to swing between them). I’m pretty sure OA has resources for children / teens which might help you. I’d be happy to talk with you too about my experience with the illness and recovery - it can really affect the family as much as the person with the ED. Feel free to reach out anytime :)",
          "created_utc": 1735386406.0
        }
      ]
    },
    {
      "id": "m4bb4l4",
      "author": "saltybartfast",
      "body": "We’re in Auckland",
      "created_utc": 1735450545.0,
      "score": 1,
      "context": [
        {
          "id": "m49647n",
          "author": "pollyhendricks23",
          "body": "What city are you in?",
          "created_utc": 1735421872.0
        }
      ]
    },
    {
      "id": "m4754jf",
      "author": "RavenBoyyy",
      "body": "Unfortunately it's so easy to get around those apps. My little sister had all those kinds of apps on her phone and we still found out she had found a way to get around it, download tiktok and Snapchat without it flagging on the app and was having some horrible interactions on there.",
      "created_utc": 1735397411.0,
      "score": 24,
      "context": [
        {
          "id": "m44tna3",
          "author": "avasefullofnations",
          "body": "If you don't already keep tabs on what she's watching online I'd make sure you know because I was around her age when I started with my eating disorder and after I started restricting I did start using my unmonitored internet to find communities of others doing the same thing and ended up finding pro-eating disorder spaces. \n\nI'd also examine your own habits/others around to see if your own relationship with food is influencing how she's feeling. That being said it's also possible it's related to textural sensitivities or something else. \n\nOther than that maybe see if there are any resources within your community for supporting you and her as you help her so that you're able to get the support needed no matter what the reason behind her eating habits are.",
          "created_utc": 1735353102.0
        },
        {
          "id": "m45f3cc",
          "author": "saltybartfast",
          "body": "Thanks for the reply! Yes we do keep tabs and have quostodio etc but she’s clever and may find ways around it. We need to watch more closely. There are communities here locally (New Zealand) and we’re getting in touch with them.",
          "created_utc": 1735362197.0
        }
      ]
    },
    {
      "id": "m49dhw8",
      "author": "Ilovebroadway06",
      "body": "Maybe try bark more specifically? It’ll catch phrasing in her texts and in her internet searches and notify you directly",
      "created_utc": 1735424346.0,
      "score": 4,
      "context": [
        {
          "id": "m44tna3",
          "author": "avasefullofnations",
          "body": "If you don't already keep tabs on what she's watching online I'd make sure you know because I was around her age when I started with my eating disorder and after I started restricting I did start using my unmonitored internet to find communities of others doing the same thing and ended up finding pro-eating disorder spaces. \n\nI'd also examine your own habits/others around to see if your own relationship with food is influencing how she's feeling. That being said it's also possible it's related to textural sensitivities or something else. \n\nOther than that maybe see if there are any resources within your community for supporting you and her as you help her so that you're able to get the support needed no matter what the reason behind her eating habits are.",
          "created_utc": 1735353102.0
        },
        {
          "id": "m45f3cc",
          "author": "saltybartfast",
          "body": "Thanks for the reply! Yes we do keep tabs and have quostodio etc but she’s clever and may find ways around it. We need to watch more closely. There are communities here locally (New Zealand) and we’re getting in touch with them.",
          "created_utc": 1735362197.0
        }
      ]
    },
    {
      "id": "m4cmmef",
      "author": "uribyoon",
      "body": "Have you looked into Truple as well? It doesn't track app usage, so you would have to keep Qustodio for that, but Truple takes screenshots instead. If privacy is something you value, there are options for that. The only way your child could get around Truple is if she uninstalled it, which will trigger the system to alert you immediately. You can choose the interval for the screenshots, if you want to censor texts, blur images, rate them as inappropriate (although, it is designed for porn usage/addiction, so that might not work as well for you).",
      "created_utc": 1735478744.0,
      "score": 1,
      "context": [
        {
          "id": "m44tna3",
          "author": "avasefullofnations",
          "body": "If you don't already keep tabs on what she's watching online I'd make sure you know because I was around her age when I started with my eating disorder and after I started restricting I did start using my unmonitored internet to find communities of others doing the same thing and ended up finding pro-eating disorder spaces. \n\nI'd also examine your own habits/others around to see if your own relationship with food is influencing how she's feeling. That being said it's also possible it's related to textural sensitivities or something else. \n\nOther than that maybe see if there are any resources within your community for supporting you and her as you help her so that you're able to get the support needed no matter what the reason behind her eating habits are.",
          "created_utc": 1735353102.0
        },
        {
          "id": "m45f3cc",
          "author": "saltybartfast",
          "body": "Thanks for the reply! Yes we do keep tabs and have quostodio etc but she’s clever and may find ways around it. We need to watch more closely. There are communities here locally (New Zealand) and we’re getting in touch with them.",
          "created_utc": 1735362197.0
        }
      ]
    },
    {
      "id": "m4av35u",
      "author": "onyxjade7",
      "body": "You misunderstood me. \n\nI am saying I wouldn’t turn her onto you tube because there’s way more bad than good. This can be a tool to use for tips for her ED. So, I’m saying I don’t recommend it.",
      "created_utc": 1735443569.0,
      "score": 2,
      "context": [
        {
          "id": "m46av0a",
          "author": "onyxjade7",
          "body": "DO NOT go to you tube. Some very sick people are on there. Both those with disorders who refuse to admit they have them and those that prey on young people with them. Please take her to a doctor a trained psychologist and an eating disorder clinic. That’s good your taking her to a cohnsleor and physician. I’m sorry you’re dealing with this.",
          "created_utc": 1735381177.0
        },
        {
          "id": "m4asibs",
          "author": "Lindsey7618",
          "body": "There are plenty of YouTube videos that are properly educational and would help her, that's why he's asking for recommendations. He's already said that he's getting her help so he definitely seems to be doing his research and I'm sure will get her the proper help.",
          "created_utc": 1735442545.0
        }
      ]
    },
    {
      "id": "m4g75fb",
      "author": "binxy_boo15",
      "body": "Weekly even",
      "created_utc": 1735521196.0,
      "score": 2,
      "context": [
        {
          "id": "m48bf70",
          "author": "saltybartfast",
          "body": "Thanks very much for the advice everyone. Lots to think about here. We’ve got another gp appointment tomorrow so we’ll push for a referral for specialist eating disorder counselling. Also review what she’s watching more closely. Thanks again.",
          "created_utc": 1735411767.0
        },
        {
          "id": "m4dui2n",
          "author": "designcentredhuman",
          "body": "If you are at the GP, I'd ask for a monthly blind weight monitoring. Anorexia can go downhill really fast, and having historical data/trend can be a key asset when you need to advocate for resources.",
          "created_utc": 1735494435.0
        }
      ]
    },
    {
      "id": "m48t4vr",
      "author": "setaside929",
      "body": "You might be right. Thanks for sharing.",
      "created_utc": 1735417565.0,
      "score": 3,
      "context": [
        {
          "id": "m46is2g",
          "author": "setaside929",
          "body": "Hi there, there is a 12 step fellowship called Overeaters Anonymous that helps with eating disorders of all kinds (anorexia is often rooted in the same underlying illness as overeating - as someone who has binged and restricted I can tell you it’s easy to swing between them). I’m pretty sure OA has resources for children / teens which might help you. I’d be happy to talk with you too about my experience with the illness and recovery - it can really affect the family as much as the person with the ED. Feel free to reach out anytime :)",
          "created_utc": 1735386406.0
        },
        {
          "id": "m48saha",
          "author": "jarofonions",
          "body": "This is probably a terrible idea, no offense. For a 9yo with an ed, it might not matter that the actual content of the groups are helpful, the name itself could be extremely triggering right off the bat. I see what you're saying, 200%, but I think a 9yo would hear the name of the new group they're going to and think \"wow, I *must be* eating to much, and my parents agree\"",
          "created_utc": 1735417283.0
        }
      ]
    },
    {
      "id": "m4d3rmi",
      "author": "catwomen999",
      "body": "Hi! \n\nI am an eating disorder dietitian in Canada. The type of treatment you want is called Family Based Treatment- it is gold standard evidence based treatment for children and youth with eating disorders. Looks like the clinic the offers it near you is open on Jan 6th. I’m hoping you have it publicly funded where you live as it involved weekly or biweekly appointments. It is hard but it works.\n\n[https://www.nzeatingdisordersclinic.co.nz/treatments/family-based-treatment-fbt/](https://www.nzeatingdisordersclinic.co.nz/treatments/family-based-treatment-fbt/)",
      "created_utc": 1735485787.0,
      "score": 2,
      "context": [
        {
          "id": "m49647n",
          "author": "pollyhendricks23",
          "body": "What city are you in?",
          "created_utc": 1735421872.0
        },
        {
          "id": "m4bb4l4",
          "author": "saltybartfast",
          "body": "We’re in Auckland",
          "created_utc": 1735450545.0
        }
      ]
    }
  ]
}