{
  "id": "1hq4ink",
  "subreddit": "EatingDisorders",
  "author": "ConnectionFirst9893",
  "created_utc": 1735612184.0,
  "title": "How do you not feel guilty after eating???",
  "selftext": " How does everyone not feel guilty after eating?? Like I will see my friends eat and they won't even stop and think about they just eat like it's nothing but when it's me I stare at my food for awhile, before someone looks at me I start eating a little but my mind keeps on saying \"you getting fatter stop eating\" Then I just drink water after and go weigh myself every day.\n\n  Like today my dad called me down for dinner, we had cheeseburgers and I only had half of one meanwhile everyone was just eating I was staring at my food awhile my mind said \"Don't eat it ur going to get fatter,don't do it\" but i eventually eat a little bit then I throw it away feeling scared that I gained more weight. How do you guys not feel guilty???",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hq4ink/how_do_you_not_feel_guilty_after_eating/",
  "score": 79,
  "num_comments": 24,
  "comments": [
    {
      "id": "m4mvtla",
      "author": "crochetNea44",
      "body": "Such a good question....I have no idea, but I'd love to know as well",
      "created_utc": 1735614933.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m4mxk6z",
      "author": "lady_tsunami",
      "body": "Start small. Redirect your thoughts *relentlessly*. \n\nI am a human, a mammal. I require food, even if my brain says I don’t. After enough time, I don’t battle that “don’t eat” voice at every meal, now, just maybe when I’m supposed to be eating snacks. \n\nIt just took time. And relentless. And of course, the thing I lack, patience",
      "created_utc": 1735615571.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m4my6zx",
      "author": "AbsolutelyNot5555",
      "body": "I feel guilty for every single bite. Every one, every time and I’m so tired of it.",
      "created_utc": 1735615802.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m4mwy91",
      "author": "MoulinSarah",
      "body": "I do feel guilty!",
      "created_utc": 1735615345.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m4n0eah",
      "author": "Top_Conversation_976",
      "body": "Unfortunately that’s why it’s called a disorder in the first place. Something’s wrong.",
      "created_utc": 1735616603.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m4n9ato",
      "author": "fullofdatura",
      "body": "i feel guilty even now (after lots of treatment) but its easier to deal with when i use a lot of the skills i learned in therapy. journaling right after a meal really helps me as well as having reminders for myself that food is fuel and the part of my food help me (like fats help cell function and give us energy). i have a long list of reasons i want to live and i have to eat to ever be able to have the things on my list. maybe some of those strategies can help you out too.",
      "created_utc": 1735620095.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4q0vp3",
      "author": "Alternative-Crow5757",
      "body": "I also feel guilty when I eat “normally”, what I’ve noticed that has helped a lot over these last couple months is I message my best friend and ask her if what I ate throughout the day is too much.. She always reassures me which helps with the guilt.. As someone who also weights themselves every single day I’ve been trying to resist to weighting myself because I’ll have a whole mental breakdown if I gain like 4 pounds!!! It’s hard to avoid the scale for sure but it takes time lol.",
      "created_utc": 1735666904.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4n37rn",
      "author": "Throwaway55557783",
      "body": "Ask yourself if you’ve done something you can genuinely feel good about, and you deep down know you did if you ate to survive. I ask myself if I truly wanna feel like this forever, and the answer is no, so the only way to beat that is just to trust it gets easier I suppose. I’m also dealing with trying to eat and negate guilt so it’s still a work in progress.",
      "created_utc": 1735617655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4n83zt",
      "author": "Desperate_Air370",
      "body": "I do feel guilty but I try to remind myself that it’s the Ed talking - not me and everything Ed says is a lie. \n  > I do not succeed every time but the thought of me needing and deserving to eat starts to appear more naturally little by little.\n\nAlso, I try to remind myself that my psychologist, physiotherapist and nutritionist are so very proud of me when I am able to eat anything and even more proud if I can admit to myself even sometimes that I actually enjoyed the food.\n  > I have sometimes imagined my three musketeers fighting against the evil Ed that has depression and anxiety as its helping hands. It makes me giggle! (and no, I have not admitted this to any of them because I am ashamed lol).\n\n\n\nIf you need to talk sometimes more or just want to vent or something - I am here and you can write to me anytime you want.\n  > Ed is evil and very good manipulator but what it is not is a friend or a good thing. It makes itself look and feel good but it’s like pretty looking banana that’s actually all bad and moldy when you peel it!!\n\n\nYou are worthy 🫶🏻",
      "created_utc": 1735619599.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4na5je",
      "author": "FragileInside",
      "body": "Still waiting to figure this out myself",
      "created_utc": 1735620459.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4nap4k",
      "author": "unbecomingbaby",
      "body": "Are you in therapy? What’s helped me in general is ACT (acceptance commitment therapy) which in very short, you’re not changing you’re thoughts but accepting them and kinda going from there and learning to manage through them if that makes sense. So for example, in those moments accept that you’re having those thoughts then think to yourself what is it that you truly value? What really matters to you? Do you value living a healthy life? If so, by allowing those fears of gaining weight to stop you from eating would be pulling you away from that value. When those thoughts or fears occur and you allow them to dictate your actions such as I just mentioned, how much control are you truly in? None right? So think about what matters to you and try to make value-based decisions and you’ll start to feel more in control and less stress. Also keep in mind, when you’re not in control, you increase your stress, when you increase your stress, more issues arise from that (in this context, health issues..etc). \n\nThis isn’t the easiest to do, it’s taken me a couple years for it to be consistent but now I feel so much freer and more control in my life (less stress).",
      "created_utc": 1735620695.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4oz32t",
      "author": "ForYourEyesOnly28",
      "body": "It takes time..... and even then it sneaks back.",
      "created_utc": 1735654258.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4p110o",
      "author": "Rowing1810",
      "body": "I feel like the guilt never truly leaves, even when you recover. Its about pushing past, finding true meaning in life (I haven't yet) and othet coping mechanisms. Because deep down weight isn't the issue ",
      "created_utc": 1735655020.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4px26m",
      "author": "Footsie_Galore",
      "body": "I don't feel guilty, as my actions aren't hurting anyone, but I DO feel disgust, helplessness and self-hatred.",
      "created_utc": 1735665740.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4qhqik",
      "author": "Unidentified_Cat_",
      "body": "What specifically do you feel guilty about? This is an important question for anyone who feels this way. My recommendation as someone recovered, is to explore this feeling deeper and get very clear on your thoughts that are driving it. In my experience there’s useful insight on the other side of this exploration.",
      "created_utc": 1735672185.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4r4iwi",
      "author": "Joshua13298",
      "body": "I do feel guilty about every god damn bite(sorry for my language) but what I think could help is weigh yourself the day after eating something and you would probably see you lost weight instead of gaining weight. This doesn’t help for me and I’m still looking for a way to not feel guilty after every bite but I hope this helps you. The path to recovery is hard but it will be worth it, it just has to.",
      "created_utc": 1735679682.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4rg21y",
      "author": "TapRevolutionary5022",
      "body": "Ignore it. \n\nIgnore ignore ignore.",
      "created_utc": 1735683705.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4ro7xs",
      "author": "Potential-Pause3968",
      "body": "it’s a double edged sword, if i eat i feel guilty but if i throw food away i feel arguably worse. i’ve been trying to use the waste as a motivation to finish what im eating.",
      "created_utc": 1735686703.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4s9n7p",
      "author": "Worth_Effort_5805",
      "body": "I always feel guilty after but I just have to tell myself I have to eat to stay healthy and not make my hypoglycemia worse",
      "created_utc": 1735694857.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4wmhjk",
      "author": "Giancarlo_RC",
      "body": "Your body does a lot for you, doing its best to heal, keep you at peak performance, your brain nourished and your heart pumping. The minimum it asks for is energy to do its job better. You’re not two separate entities, outcompeting each other, you’re on the same side, all it does is for the sake of protecting you. Once it feels safe it won’t need to keep pumping you with obsessive thoughts about any food or anything. Just trust the process and above all else, cherish it and put it before any disordered, obsessive mentalities society has put on us in these last few years. You can do it :) cheers",
      "created_utc": 1735765862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m56fu1k",
      "author": "Charming-Work-900",
      "body": "Distraction, distraction, distraction  \n[https://www.youtube.com/watch?v=nWXjZUPVUGg](https://www.youtube.com/watch?v=nWXjZUPVUGg)",
      "created_utc": 1735910771.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m5atva6",
      "author": "Far-Barracuda858",
      "body": "I get angry with myself and hate myself more after I eat. All day I’m stuck thinking about food and thinking I’m a greedy fat ass that doesn’t deserve to eat. I get angry at myself because I feel like I have no self control, I can’t eat without feeling guilty and fat.",
      "created_utc": 1735962390.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m4xt1fh",
      "author": "Inner_Section_4335",
      "body": "What kind of ed would it be classified as",
      "created_utc": 1735780172.0,
      "score": 1,
      "context": [
        {
          "id": "m4n0eah",
          "author": "Top_Conversation_976",
          "body": "Unfortunately that’s why it’s called a disorder in the first place. Something’s wrong.",
          "created_utc": 1735616603.0
        }
      ]
    },
    {
      "id": "m4xtcr6",
      "author": "Top_Conversation_976",
      "body": "It’s anorexia nervosa. Constant anxiousness and anxiety surrounding food. I can remember the tome before I had an eating disorder, like when i was a kid, i used to literally put tablespoons of sugar in my cereal. Just a happy, care-free child. Now if I did that I’d probably have to be on suicide watch for a couple of days.",
      "created_utc": 1735780284.0,
      "score": 1,
      "context": [
        {
          "id": "m4n0eah",
          "author": "Top_Conversation_976",
          "body": "Unfortunately that’s why it’s called a disorder in the first place. Something’s wrong.",
          "created_utc": 1735616603.0
        },
        {
          "id": "m4xt1fh",
          "author": "Inner_Section_4335",
          "body": "What kind of ed would it be classified as",
          "created_utc": 1735780172.0
        }
      ]
    }
  ]
}