{
  "id": "1hqefge",
  "subreddit": "EatingDisorders",
  "author": "Sad-Poet7922",
  "created_utc": 1735650789.0,
  "title": "You don’t need to fit the stereotype to have an ED",
  "selftext": "So I guess this is kind of for me, but also anyone else who needs to hear it.\nFor those of you who deep down know you have an ed, but need the confirmation in order to get help, this is it.\n\n“Just because you don’t fit into the stereotype that social media portrays an ed, doesn’t mean you don’t have one.”\n\nFor the longest while I denied having an ed, this was because I didn’t fit the stereotype that came up whenever you searched up or thought of an ed.\n\nI ate fast food. I didn’t count. I didn’t purge. I didn’t starve myself everyday. I didn’t feel guilty for eating. I wasn’t a certain weight. I wasn’t any of those, heck I would sometimes even over eat. Which meant I couldn’t have an ed, right?\n\nI may not have done all those things, but that didn’t necessarily mean that I was eating healthy.\n\n\n- I ate fast food, but only because I worked in fast food so I got it on a discount or free, and I couldn’t afford anything else.\n\n- I didn’t count, but I did fantasize about becoming vegan so I could lose weight. I never could because I couldn’t afford to do so, but if I could have afforded it I would have.\n\n- I didn’t purge, but that’s because I have a fear of throwing up, and deep down inside I knew that purging would be admitting to myself that I had an issue with eating.\n\n- I didn’t starve myself, but I didn’t feed myself either. I would eat, but only after the pain of hunger became so unbearable that I felt I would die if I didn’t eat. When I did eat I would never finish my food because “I wasn’t hungry” and eventually, I actually wasn’t hungry. Not because I was full and my body had all the energy it needed, but because my body was so used to me eating such small portions that it tricked itself into feeling full after a few bites, only for me to be hungry again after only an hour or so because I didn’t eat enough. \n\n- I didn’t feel guilty about eating. I may have not felt guilty about eating, but I did feel guilty about gaining weight. If I noticed I gained weight, I would pick apart myself, I would feel so bad and cry myself to sleep.\n\n- I didn’t weight a certain amount. For the longest while I thought I couldn’t have an ed. In my mind I thought “if I had an ed than with how long I’ve been like this I should be a certain weight by now, right?” You do not need to be a certain weight to have an ed, an ed is not based on weight, but rather your mental health and eating habits. I may not have been a certain weight, but I was always cold. I may not have been certain weight, but I was extremely irritable. I may not have been a certain weight, but food was always on my mind. I may not have been a certain weight, but I wanted to be and that’s what matters.\n\n- I would over eat. Why did I though? I over ate because my body would try to compensate, I would starve so much and eat so little that when my body got the chance to, I would just eat and eat and eat until I physically couldn’t anymore. It was like giving candy to a child who wasn’t allowed to eat candy at home. I never allowed myself to have certain things, so when I finally got access to them I would go crazy and just eat any and everything I could. It wasn’t healthy either.\n\nOverall this post was partly for me, but also for those of you reading this who are like me. Who deep down inside knows that what you’re doing to yourself isn’t healthy, but because you don’t fit the stereotype of an ed you think you don’t have it.\n\nAn ed does not have a size requirement and there is no such thing as “not sick enough”. Don’t wait until you are “sick enough” to get help, because there will never be a “sick enough” It may be harsh, but it’s true. \n\nFor those of you like me, this is the confirmation that you have been searching for, you do have an ed, and you do need help, so get it. I’m getting help, I hope you will join me.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hqefge/you_dont_need_to_fit_the_stereotype_to_have_an_ed/",
  "score": 61,
  "num_comments": 11,
  "comments": [
    {
      "id": "m4ri4vu",
      "author": "Stingwing4oba",
      "body": "I felt the same way when I thought I was \"cured\" of my eating disorder... Now I am trying to explain a lot of others that don't understand why I would have something and I don't \"look like it\"",
      "created_utc": 1735684450.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m4qu6n5",
      "author": "Joshua13298",
      "body": "Thank you so much for this post because I always felt like I didn’t fit the stereotype because I was a guy and (just barely) not underweight. I deep down always felt like I had an eating disorder but because I didn’t fit the official diagnosis for anorexia I figured that I didn’t have it. But for quite some time now I figured that I may not fit the stereotype but I still have an eating disorder and I’m trying to recover but it’s just so damn hard(which you probably know too). Your post really helped me and I hope you get better. I’m sorry for all my brambling and I hope you have a good day.",
      "created_utc": 1735676242.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m4tb1u0",
      "author": "Desperate_Air370",
      "body": "Your words are so damn true and well written - with thought and examples that open the thought and what it means and how it affects one’s life.\n  > Thank you so much for taking the time and writing this & posting it here! This is important subject that affects so many.\n\nI hope you are doing okay these days and have gotten the support and help you need!!",
      "created_utc": 1735712368.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m4smioj",
      "author": "asteriskelipses",
      "body": "thank you for this!",
      "created_utc": 1735700129.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4ss1ln",
      "author": "Youdontknowme443",
      "body": "People think the only Ed’s are Ana and bulimia but those are not the majority of Ed sufferers. So just because you don’t fit into the Ana or bulimia criterion doesn’t mean you don’t have an ed or are not valid. 🫶🏼 I didn’t fit the criteria of anorexia until I suffered for years bc I started at a high weight, but my thoughts were the same throughout. I am no more anorexic now than when I was 180 lbs.",
      "created_utc": 1735702546.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4sueba",
      "author": "kkomcd",
      "body": "I always feel guilty and don’t think I’m sick because I get periods and don’t feel like fainting these days. I still can barely eat out with other people because my safe foods list is so restricted now. I still always hope people don’t notice when I don’t touch my rice (I live in Asia). I still purge if I eat something I’m not “allowed” to eat. But because I’m not the tiniest or dying and I like to eat a bit for breakfast, I feel like I’m not sick and people don’t see me as sick. My friend who is close enough to know my food things just thinks of it as me being quirky and sort of jokes about it. And yeah, when I’m fully in binge purge cycle, it doesn’t make me skinnier necessarily. Not all eds make you lose weight.",
      "created_utc": 1735703583.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4tr465",
      "author": "MigrationInspiration",
      "body": "Thank you for this. I definitely don't fall into a traditional ED category. I don't binge or starve myself or throw up. But I have regular panic attacks and constantly think about my food intake. It sucks, but I never knew the right help to get for it bc I didn't believe it was an ED for the longest time.",
      "created_utc": 1735722676.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m50hln1",
      "author": "Imaginary-Vanilla839",
      "body": "I’ve had Ana for approx 23 years. I don’t just eat salad and fruit; I actually mostly  eat confectionary/salty snacks- but that’s ALL I will eat. Or just nothing. I don’t calorie count anymore. I’m not a 14 year old hanging out on pro Ana sites (anymore…)- I’m a mother and wife with a job and home- I don’t weigh myself, I just keep getting physically smaller and smaller. \n\nI’ve found this the biggest barrier in getting help now that I’m not a child and I present otherwise ‘capable’; even though I’m very underweight (I have been weighed by drs), there isn’t an awful lot of help out there for adults, and because I’m otherwise functioning, the only way I’d qualify for help, at least where I live, is if I was sick enough to be committed. Oh well. \n\nAnd I totally agree with you about being ‘sick enough’; it’s a shame that the medical world is still woefully uneducated about this stuff. They need to catch up considering anorexia is the most deadly mental illness.",
      "created_utc": 1735828699.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m4ryiuz",
      "author": "None",
      "body": "I was in ED in patient and a woman says… pointing to the skinny ones - aren’t you always cold - meanwhile, I (obese) am in three layers and under a blanket. I was appalled. I said, I am always cold. I don’t have an overeating issue either I have the opposite. My weight is years of binging and eating bad food and then I develop restricted eating patterns after I lost a lot of weight. But I digress, when my mom said, you can’t be this if you look like this…",
      "created_utc": 1735690633.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m4qurek",
      "author": "Sad-Poet7922",
      "body": "Don’t ever be sorry, the whole point of my post was for people like me and you, who don’t exactly fit the mold of what an eating disorder is supposed to be. I’m glad my post helped you and i wish you all the best",
      "created_utc": 1735676425.0,
      "score": 3,
      "context": [
        {
          "id": "m4qu6n5",
          "author": "Joshua13298",
          "body": "Thank you so much for this post because I always felt like I didn’t fit the stereotype because I was a guy and (just barely) not underweight. I deep down always felt like I had an eating disorder but because I didn’t fit the official diagnosis for anorexia I figured that I didn’t have it. But for quite some time now I figured that I may not fit the stereotype but I still have an eating disorder and I’m trying to recover but it’s just so damn hard(which you probably know too). Your post really helped me and I hope you get better. I’m sorry for all my brambling and I hope you have a good day.",
          "created_utc": 1735676242.0
        }
      ]
    },
    {
      "id": "m4re9g4",
      "author": "Joshua13298",
      "body": "Really thank you I hope that I can join you in your path to recovery and get more attention to boys with eating disorders(because they do exist and there’s not enough talk about them) and that you don’t have to fit in some specific category to have an eating disorder.",
      "created_utc": 1735683061.0,
      "score": 2,
      "context": [
        {
          "id": "m4qu6n5",
          "author": "Joshua13298",
          "body": "Thank you so much for this post because I always felt like I didn’t fit the stereotype because I was a guy and (just barely) not underweight. I deep down always felt like I had an eating disorder but because I didn’t fit the official diagnosis for anorexia I figured that I didn’t have it. But for quite some time now I figured that I may not fit the stereotype but I still have an eating disorder and I’m trying to recover but it’s just so damn hard(which you probably know too). Your post really helped me and I hope you get better. I’m sorry for all my brambling and I hope you have a good day.",
          "created_utc": 1735676242.0
        },
        {
          "id": "m4qurek",
          "author": "Sad-Poet7922",
          "body": "Don’t ever be sorry, the whole point of my post was for people like me and you, who don’t exactly fit the mold of what an eating disorder is supposed to be. I’m glad my post helped you and i wish you all the best",
          "created_utc": 1735676425.0
        }
      ]
    }
  ]
}