{
  "id": "1hud8lq",
  "subreddit": "EatingDisorders",
  "author": "KlausMikaelsonsWife",
  "created_utc": 1736100935.0,
  "title": "Hate the feeling of being full.",
  "selftext": "I hate hate the feeling of being full, it's almost like I can feel the calories and weight enter my body and I feel like throwing up. I'm so so scared to get help or talk to anyone about this because it will make me face my fears. Does anyone else deal with this?\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hud8lq/hate_the_feeling_of_being_full/",
  "score": 40,
  "num_comments": 9,
  "comments": [
    {
      "id": "m60okb7",
      "author": "LilyFelton",
      "body": "I hate it so much I'm exactly the same",
      "created_utc": 1736323609.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m60pa18",
      "author": "Right_Ice3326",
      "body": "Definitely. I am almost 1 year into recover but the feeling of fullness still triggers me. The fear of eating doesn’t really stem from the fear of weight gain anymore it’s just about feeling full. \nI think for me it is about feeling greedy. I would recommend trying to talk to someone about it. Maybe they won’t totally understand it but if they have a healthy relationship with food they can insure you that fullness isn’t a bad thing. You will always be scared of it if you don’t face the fear. But if you do it now it will become easier. I have learned to deal with fulness most of the time. I am sure you can do it to",
      "created_utc": 1736324066.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m60pcc6",
      "author": "Alive-Club2181",
      "body": "Yes. Absolutely can not stand the feeling of being full, and «fullness» is almost exclusively talked about as a positive thing or a goal for most people. Also most of my family acts as if it’s dangerous to be hungry at all, ever, and most of them also struggle with obesity. A therapist once told me that given my family history it kinda makes sense for me to not want to «end up like them» and try to control what they apparently can’t. I dunno, it fucking sucks anyways.",
      "created_utc": 1736324107.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m61gsrl",
      "author": "Joshua13298",
      "body": "Yes! Some days i eat a bit more than normal just to store up on some energy and prevent people from thinking i have an eating disorder. And when i eat a (for me) big meal and feel so full and i hate it so much.",
      "created_utc": 1736340195.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m61o7ab",
      "author": "setaside929",
      "body": "Hi there, I used to be afraid that admitting I needed help meant that my fears would come true. Most of my major fears never did come to pass once I found recovery - they were kind of like a made-up obstacle from my illness. In fact I had a lot of fears that seemed to be endless. Recovery gave me a way to get them all out with the help of someone who understood and then have them lifted so that I could live life more normally. Hope that’s helpful. :)",
      "created_utc": 1736343269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m665g7b",
      "author": "onyxjade7",
      "body": "SAME!",
      "created_utc": 1736394513.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m67dpr3",
      "author": "Superb_Upstairs8541",
      "body": "I hear you and I understand you. I’ve been in that exact place before. Scarily, the only way out is through. For me, the only thing worked was exposure to food, and I received this exposure through inpatient treatment. It’s so scary but please believe me when I say recovery is the most freeing lifestyle. During Christmas dinner this year, I became aware of how full I was and I noticed that I didn’t mind. I didn’t hate myself. I didn’t have to immediately purge. I didn’t supposedly feel the calories working. Facing your fears is so scary, but it’s the best thing I’ve ever done for myself. It’s so hard. But I believe in you. If you need anything please message me I am here for you",
      "created_utc": 1736418828.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6ace5d",
      "author": "AbsolutelyNot5555",
      "body": "Yes, to me, feeling full is failure",
      "created_utc": 1736455413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m68t6e4",
      "author": "KlausMikaelsonsWife",
      "body": "I don’t have anyone that would understand me, everyone around me (my friends) is skinnier than me and seem to eat whatever they want. Im not so shallow to think that they don’t have they’re own problems but it doesn’t seem like a welcome topic",
      "created_utc": 1736439391.0,
      "score": 1,
      "context": [
        {
          "id": "m60pa18",
          "author": "Right_Ice3326",
          "body": "Definitely. I am almost 1 year into recover but the feeling of fullness still triggers me. The fear of eating doesn’t really stem from the fear of weight gain anymore it’s just about feeling full. \nI think for me it is about feeling greedy. I would recommend trying to talk to someone about it. Maybe they won’t totally understand it but if they have a healthy relationship with food they can insure you that fullness isn’t a bad thing. You will always be scared of it if you don’t face the fear. But if you do it now it will become easier. I have learned to deal with fulness most of the time. I am sure you can do it to",
          "created_utc": 1736324066.0
        }
      ]
    }
  ]
}