{
  "id": "1hye4us",
  "subreddit": "EatingDisorders",
  "author": "No-Fly8865",
  "created_utc": 1736541038.0,
  "title": "Girlfriend with ED found out that she is obese... advice needed!",
  "selftext": "My GF of 5 years has struggled with eating disorder since she was a teenager. It's been a combination of binge eating, making herself throw up and sometimes restricting. She's not 100% recovered , though I'd say it's much better than when we first met and the first years of our relationship.\n\nI'm currently in a situation that I don't know how to handle. Basically, she looked at her doctor notes online after a visit to the doctor. The visit itself wasn't related to her weight, but they weighed her and asked a bunch of health information, which resulted in \"obesity\" being added as a diagnosis in her medical journal. She has avoided weighing herself for a long time and did not know her weight before, though she has hinted many times that she think she has gained weight. Now she knows that she's obese, but not exactly how much she weighs. Even before this happened I struggled with knowing how to respond in the right way when she brought up weight, her body etc.\n\nFinding this out has affected her. Not only because she has an eating disorder but also because her entire family basically is eating disordered and have called her fat, told her to lose weight in cruel ways, tried controlling her food intake etc since she was little. She's now saying she wants to lose weight and become healthier, but considering her history of eating disorders I'm quite worried. I'm afraid that she's not gonna be capable of losing weight on her own without triggering her ED to get worse again.\n\nI have encouraged her to bring this up with a psychologist and I really hope she doesn't break this promise... But sadly, the mental health care system if very flawed and I don't know if she will get access to regular mental health care.\n\nWhat do I even do in a situation like this? Is it even possible to support both her weight loss journey and at the same time help her recover her ED? I feel so lost right now... I don't know how to talk to her, what I should or should not say etc.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hye4us/girlfriend_with_ed_found_out_that_she_is_obese/",
  "score": 96,
  "num_comments": 18,
  "comments": [
    {
      "id": "m6h5n50",
      "author": "Leather-Ebb1080",
      "body": "It’s possible to support both I think. But only if the weight loss is done the right way. She should probably see a nutritionist to help her- that way she doesn’t just cut a ton of calories out and hurt herself more or do something unsustainable. \nAs someone who is going through what she is (I wasn’t diagnosed with obesity tho) the biggest things have been to remember that food is fuel, having fun on weekends won’t kill me or make me gain 5lbs, as a woman we inherently fluctuate more than men every month, there are several things that cause weight to fluctuate, and there are MUCH better ways to feel better in your body than using weight as a tool. \n\nIf she knows weight triggers her, encourage her to not use a scale as a method of keeping track of things. Instead use strength, endurance, maybe a measuring tape, maybe pictures every week to see progress. Learning to feel better about food is going to be a big priority. \nI’ve gotten a lot better and even sometimes it’s a struggle. \n\nYou can eat meals together,check on her/each other- go on the journey with her. \n\nShe can follow some good natured people on instagram if she is wanting to do that. There are some super positive people out there there don’t push greens or cutting things out or being unrealistic. \n\nSean Casey is a good start. He emphasizes living life and what is more important than a number on a scale. You might be able to get encouraging things to say to her from his page. His page has helped me a ton. \n\nIt’s possible to do both, but very hard. I would say yes if she can go to therapy somehow for her ED/confidence/etc that would be perfect as well. \n\nAlso would like to say it’s amazing how helpful and supportive you are.",
      "created_utc": 1736546150.0,
      "score": 22,
      "context": []
    },
    {
      "id": "m6hhph6",
      "author": "little_bug_person",
      "body": "I think a possible “work around” would be to focus predominantly on the joys of movement, healthy good quality foods, cooking, being active, and just setting achievable goals related to wellbeing.\n\nIf the focus is on losing weight/losing fat/changing shape, things can get really triggering and painful. I’ve found that if the motivation is based instead on wellness and energy and feeling good, the disordered thoughts are much quieter. \n\nIt’s different for everyone, but I really think reframing the goals as “celebrating mobility and wonderful food” can reduce the risk of distress.\n\nDepending on her history and vulnerability, I do think she needs support and guidance in this regard. Maybe a dr, therapist, dietician, trainer, etc.",
      "created_utc": 1736549977.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m6hvd97",
      "author": "serenitnowinsanitl8r",
      "body": "There is a medical code for obesity prevention to bill insurance - so perhaps that’s what the note was for.",
      "created_utc": 1736554614.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m6jvr61",
      "author": "CupboardOfPandas",
      "body": "\nEverything in this post is in my own experience and opinion, I'm not a medical professional, just someone who had an ED for way too many years before recovering.\n\n\n\nHonestly, I think you have done the main things to support her already. Mainly encouraging her to talk to a professional (preferably someone with at least some extra ED knowledge since it's so misunderstood even in the medical field. \n\n\n\nI've been in a very similar situation. When I truly went all in into recovery I stopped weighing myself and the few times I've had to for medical reasons I've made sure they're aware that I don't want to know. There's absolutely nothing to gain from me knowing, whatever the number is it's going to make me feel bad and completely mess with my mind.\n\n\nA year or so in i had a doc tell me when discussing medications. I had lost some weight and she kinda it out by telling me my bmi (ofc i know by heart which bmi equals what weight) and it did set me back a little bit.  The only thing that kinda helped was talking about it with my therapist and understanding that in reality nothing had changed except my perception. \n\n\nOn a similar note, there has never been anything anyone (especially my then boyfriend) could say about my body/weight/looks/whatever that would have  helped. The ED part of my brain would twist the words so much that no matter how sweet and positive his intention were it would turn into something really dark. \n\nRealizing that helped our relationship alot, learning that it it wasn't him not being able to say the right thing or me being negative and ungrateful. It was part of the illness and out of both of our control (at that point in time). \n\nI don't really have any real advice or suggestions to offer. Try to get her talking to her psychiatrist before starting any kind of diet/new exercise and just try to be as understanding and patient as possible while she gets her bearings again. \n\nSeeing someone you love struggle with this is really hard, so make sure you take care of yourself as well. Having some sort of support system or group to share and vent is something I've heard is very helpful at least. It's a very frustrating illness and it can be hard to separate the person and the ED sometimes.\n\nIt's possible to lose some weight etc in a healthy way, but it's a very slippery slope and I think that jumping into it as an emotional response could be a mistake. Taking the time to truly think it through and consult with a professional is the bare minimum for having a shot at doing it without relapsing.\n\n\n\nSorry that I don't have any real actual advice, but I wish you both the absolute best and if there's anything I can do my dms are always open",
      "created_utc": 1736586683.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m6h6q67",
      "author": "MadMick01",
      "body": "Oh, friend...this is such a hard situation to be in. Weight loss attempts for people with a history of restrictive EDs need to be managed very carefully. It becomes so easy to backslide into old, disordered habits. \n\nI would say she needs support from a medical professional specializing in EDs...preferably someone who has experience working with a range of EDs. It's possible she has some over compensatory eating habits stemming from her restrictive phase which is super common. I actually developed binge eating disorder from years of over restriction. I'm still working on overcoming it...it feels impossible some days. \n\nDieting can be so triggering to folks with past restrictive EDs, so it's hard to say what the best course forward is. I think it's important to note that \"obesity\" is a spectrum and there's quite a range. Health outcomes for someone who is mildly obese are wildly better than outcomes for someone who is severely obese. If she's *just* slightly obese, I'd say any serious interventions should be avoided. No crash diets or anything like that which could cause her to spiral. Maybe more gentle lifestyle changes like increasing activities that you do together. \n\nThis is such a difficult situation and my heart goes out to you. Please take everything I've written here with a giant grain of salt and consult a professional to get a better idea of how to proceed. Wishing you and your GF the very best!",
      "created_utc": 1736546485.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m6h5yp4",
      "author": "lucidbaby",
      "body": "she needs a doctors help. i wish i had more helpful advice, but all i can speak to is how my ex *didn’t* support me. \n\ndon’t tell her what to do about her weight, and don’t bring it up. tell her she looks good and show her that you appreciate her for reasons other than her body. that’s probably the most important thing. tell her how much you enjoy the ways you have fun together. qualities about her that you like. how cute whatever little quirk she has is. her taste in movies or music, whatever it is for you guys. remind her that she’s more than her weight, without saying that directly and bringing her attention to her body again. \n\ni wouldn’t encourage a weight loss journey. i was medically obese awhile after going into recovery, and i tried to handle it alone/with the help of my then partner. i relapsed hard, and it was possibly the most dangerous relapse i’ve had. she needs help from a psychiatrist and a dietitian, someone with an education needs to guide her.",
      "created_utc": 1736546249.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6qquyg",
      "author": "kimmothycole",
      "body": "For context: The term obesity is based on the BMI which is not meant to be used as a measure for individual health (according to its creator). She is obese in comparison to a man her height. But her body isn’t built like a man’s and extra weight on women’s bodies can be healthier for a lot of people. Many bodies are built bigger. There are plus sized Olympians who would be considered obese according to the BMI. This is a flawed system used by insurance companies to make money. If you want to go down a rabbit hole, search ‘fat liberation movement’.\n\nI’ve been in the position she is in now. \n\nWhen I stopped “dieting” and engaging in restrictive behavior as part of my recovery, I gained a lot of weight. I struggled for a long time with it before I learned to love my body as it is. It’s still hard sometimes. Everything in our culture tells us that our bodies are supposed to look and behave a certain way and if they don’t, they’re wrong and unhealthy and people are right to not want to be in relationship with us. The truth is that bodies are different and that health is not a thing you can determine by measuring someone’s weight or size. We like to say “the only thing you can tell by looking at a fat person is how you feel about fat people.” Your gf’s body might just be built bigger. Lucky you. \n\nIn terms of support:\n\nYou might go into a nutritionist together and learn more about what kinds of food are good for your individual bodies and then make dinners that incorporate those foods. Lean into the idea that what is most important is that she is healthy and she can’t do that through disordered eating. She can get there through intentional eating that matches her body’s unique needs and chemistry. One size does not fit all when we are talking about eating healthy. Getting to know her body and her body’s needs may help to move her towards more confidence no matter where her weight lands. If you can afford a professional and she wants one, look for a person who approaches food from a holistic perspective and who understands that a body can be both healthy and labeled obese by a misunderstood system. \n\nIf you can’t, learn about different bodies and what they need and try things out. And then make meals a connection time so that the food doesn’t become the main reason why you’re together. Eating in community can be hard for people with ED but it can also be helpful if it’s done in a loving and supportive way that encourages connection. \n\nHope this helps.",
      "created_utc": 1736689559.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6tyxzs",
      "author": "Fancy-Giraffe-6391",
      "body": "Hi can you please message me? I am a recovery coach ❤️‍🩹",
      "created_utc": 1736724932.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6wwuh5",
      "author": "DogMad72",
      "body": "Ask your girlfriend to make a doctors appointment because then a referral can be made for her to see a specialist, most doctors don't have the time or knowledge when it comes to eating disorders. I have written about my own experiences and have it on Amazon for about £1.99. I wrote it to hopefully help others, I wish you both all the best. Book is called \"Get a Grip\" and covers Bulimia then Anorexia. The most important thing is don't be fobbed off.",
      "created_utc": 1736773500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6zezb2",
      "author": "SnooDoubts588",
      "body": "Is she a healthy weight or is she obese? As someone who has recovered from an ED, being \"obese\" can still be considered very disordered. Eating Disorder does not = skinny. The only way I have ever found recovery is by eating a healthy but balanced diet with proper exercise. Nourishing & caring for my body. And being happy with how I look. This may be controversial, but if she is obese, she should lose weight. The right way. But she should work with a trainer & go on a diet & get to a SIZE (not weight, just feeling of size) that she is comfortable with. She should lose weight. She will never be happy or satisfied as an obese woman.",
      "created_utc": 1736801624.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m73si26",
      "author": "Tough_Opportunity334",
      "body": "I suggest total honesty. Let her know you are there for her if she wants to talk. Tell her your fears and concerns. You are her partner not her doctor. That said you can continue to suggest she get support from a professional. I hope this helps ",
      "created_utc": 1736866473.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6iod6v",
      "author": "Cfiru97",
      "body": "I can tell you what helped me having lived the same nightmare\n- my boyfriend made me feel loved and beautiful and completely uninterested in weight, but rather in health\n- my boyfriend working out with me, helping me having a healthy eating routine, filling my time not thinking about food, but doing activities together\n\nHe helped me a lot and he’s still helping. Having an ED means anxiety and depression to me. Being obese itself is not what hurts, but what you think this can cause, like abandonment or misjudgement. I think you love her, for what I’m reading, therefore you must be aware you have the power of having a positive impact on her life. \n\nWith your love and support, once she feels she can do it and that she wants to do it, she’ll be able to get back on track. Can I say something? ‘Obese’ means little.. it’s probably based on the BMI and if she has a lot of muscles maybe she easily fluctuates between normal weight and overweight areas",
      "created_utc": 1736564645.0,
      "score": 0,
      "context": []
    },
    {
      "id": "m6jfknt",
      "author": "Nymphormant",
      "body": "I think a big thing is to try to de-center weight and focus on energy, quality on life and how her health fits with her long term goals. It seems relevant to note that eating to the point of obesity is also a disorder that can threaten health, indépendance and quality of life - which is what makes situations like this infinitely more complex. You want to support recovery without it resulting in a different disorder that swings in the other direction. \n\nTelling someone you think they look great in their obese body is as logical as telling someone they look great in their underweight body - hence the value and importance of trying to de-center weight altogether when it come to love, attraction and affection. \n\nMost EDs are only loosely related to weight in the absolute sense - although obviously there certain symptoms/consequences that are primarily weight related. \n\nif she is open to including you in her treatment that could be a good option - family therapy is especially effective in EDs (as opposed to solo). It sounds like you are currently her closest family. Assuming she is comfortable with having you participate it should be possible to navigate a plan that supports both her physical and mental well-being. I would try working from a quality of life and long term goal perspective.   \n\n\nFor me one of my biggest motivator to not overly restrict is I want to retain my ability to carry my dog in an emergency - I couldn’t lift him at my lowest weight, but I can now - however I know if I start aggressively restricting or slacking on my work outs I could loose that. I once had to carry him out of the woods when he got hurt and the fear of what could have happened still haunts me. Other goals for me have been school and work performance, and having the energy to help and support my family and friend. \n\ntry to find the goals that resonate with your partner and work on a plan that supports those goals. While optimizing those goals may involve weight loss, de-centre the weight element in favor of the goal element.",
      "created_utc": 1736576641.0,
      "score": -1,
      "context": []
    },
    {
      "id": "m6jke0r",
      "author": "intergrl",
      "body": "she can definitely lose weight in a healthy way but she needs a psychiatrist to help her with this. calorie counting and make sure to eat 1200-1500 cals a day at least with light exercise (1 hour walking everyday or some hiit) will help tremendously",
      "created_utc": 1736579431.0,
      "score": -4,
      "context": []
    },
    {
      "id": "m6hf2p5",
      "author": "HandleSufficiente",
      "body": ">having fun on the weekends won't kill me or make me gain 2.5kg\n\n❤️‍🩹",
      "created_utc": 1736549122.0,
      "score": 10,
      "context": [
        {
          "id": "m6h5n50",
          "author": "Leather-Ebb1080",
          "body": "It’s possible to support both I think. But only if the weight loss is done the right way. She should probably see a nutritionist to help her- that way she doesn’t just cut a ton of calories out and hurt herself more or do something unsustainable. \nAs someone who is going through what she is (I wasn’t diagnosed with obesity tho) the biggest things have been to remember that food is fuel, having fun on weekends won’t kill me or make me gain 5lbs, as a woman we inherently fluctuate more than men every month, there are several things that cause weight to fluctuate, and there are MUCH better ways to feel better in your body than using weight as a tool. \n\nIf she knows weight triggers her, encourage her to not use a scale as a method of keeping track of things. Instead use strength, endurance, maybe a measuring tape, maybe pictures every week to see progress. Learning to feel better about food is going to be a big priority. \nI’ve gotten a lot better and even sometimes it’s a struggle. \n\nYou can eat meals together,check on her/each other- go on the journey with her. \n\nShe can follow some good natured people on instagram if she is wanting to do that. There are some super positive people out there there don’t push greens or cutting things out or being unrealistic. \n\nSean Casey is a good start. He emphasizes living life and what is more important than a number on a scale. You might be able to get encouraging things to say to her from his page. His page has helped me a ton. \n\nIt’s possible to do both, but very hard. I would say yes if she can go to therapy somehow for her ED/confidence/etc that would be perfect as well. \n\nAlso would like to say it’s amazing how helpful and supportive you are.",
          "created_utc": 1736546150.0
        }
      ]
    },
    {
      "id": "m6jhcvc",
      "author": "Desperate_Air370",
      "body": "This answer is absolutely great & so very correct and full of good information! Thank you for taking the time and writing this to OP♥️\n  > and to OP, it’s absolutely heart warming to read how much you care for your girlfriend & the thought process you have been going through and still are. Nutritionist is absolutely great way to help her & making lifetime long habits together about eating and/or moving rather than trying to lose weight/be on a diet (I didn’t do it the healthy way and now I am trying to learn to eat again & get my body used to handling food etc).",
      "created_utc": 1736577656.0,
      "score": 2,
      "context": [
        {
          "id": "m6h5n50",
          "author": "Leather-Ebb1080",
          "body": "It’s possible to support both I think. But only if the weight loss is done the right way. She should probably see a nutritionist to help her- that way she doesn’t just cut a ton of calories out and hurt herself more or do something unsustainable. \nAs someone who is going through what she is (I wasn’t diagnosed with obesity tho) the biggest things have been to remember that food is fuel, having fun on weekends won’t kill me or make me gain 5lbs, as a woman we inherently fluctuate more than men every month, there are several things that cause weight to fluctuate, and there are MUCH better ways to feel better in your body than using weight as a tool. \n\nIf she knows weight triggers her, encourage her to not use a scale as a method of keeping track of things. Instead use strength, endurance, maybe a measuring tape, maybe pictures every week to see progress. Learning to feel better about food is going to be a big priority. \nI’ve gotten a lot better and even sometimes it’s a struggle. \n\nYou can eat meals together,check on her/each other- go on the journey with her. \n\nShe can follow some good natured people on instagram if she is wanting to do that. There are some super positive people out there there don’t push greens or cutting things out or being unrealistic. \n\nSean Casey is a good start. He emphasizes living life and what is more important than a number on a scale. You might be able to get encouraging things to say to her from his page. His page has helped me a ton. \n\nIt’s possible to do both, but very hard. I would say yes if she can go to therapy somehow for her ED/confidence/etc that would be perfect as well. \n\nAlso would like to say it’s amazing how helpful and supportive you are.",
          "created_utc": 1736546150.0
        }
      ]
    },
    {
      "id": "m6lm1w6",
      "author": "Ok-Scientist-8027",
      "body": "it's automatically added if your BMI is above the threshold, 30 I think?",
      "created_utc": 1736614715.0,
      "score": 1,
      "context": [
        {
          "id": "m6hvd97",
          "author": "serenitnowinsanitl8r",
          "body": "There is a medical code for obesity prevention to bill insurance - so perhaps that’s what the note was for.",
          "created_utc": 1736554614.0
        }
      ]
    },
    {
      "id": "m6hff3a",
      "author": "Leather-Ebb1080",
      "body": "Exactly. It can feel scary, especially at the beginning. \nThe more I’ve surrounded myself with positive messages of enjoying life, the easier it’s gotten (slowly, but still forward overall). It’s not always 100% and it’s not always “ah who cares just live.” There’s a lot that goes into being mindful AND having fun and not going to another extreme.",
      "created_utc": 1736549233.0,
      "score": 0,
      "context": [
        {
          "id": "m6h5n50",
          "author": "Leather-Ebb1080",
          "body": "It’s possible to support both I think. But only if the weight loss is done the right way. She should probably see a nutritionist to help her- that way she doesn’t just cut a ton of calories out and hurt herself more or do something unsustainable. \nAs someone who is going through what she is (I wasn’t diagnosed with obesity tho) the biggest things have been to remember that food is fuel, having fun on weekends won’t kill me or make me gain 5lbs, as a woman we inherently fluctuate more than men every month, there are several things that cause weight to fluctuate, and there are MUCH better ways to feel better in your body than using weight as a tool. \n\nIf she knows weight triggers her, encourage her to not use a scale as a method of keeping track of things. Instead use strength, endurance, maybe a measuring tape, maybe pictures every week to see progress. Learning to feel better about food is going to be a big priority. \nI’ve gotten a lot better and even sometimes it’s a struggle. \n\nYou can eat meals together,check on her/each other- go on the journey with her. \n\nShe can follow some good natured people on instagram if she is wanting to do that. There are some super positive people out there there don’t push greens or cutting things out or being unrealistic. \n\nSean Casey is a good start. He emphasizes living life and what is more important than a number on a scale. You might be able to get encouraging things to say to her from his page. His page has helped me a ton. \n\nIt’s possible to do both, but very hard. I would say yes if she can go to therapy somehow for her ED/confidence/etc that would be perfect as well. \n\nAlso would like to say it’s amazing how helpful and supportive you are.",
          "created_utc": 1736546150.0
        },
        {
          "id": "m6hf2p5",
          "author": "HandleSufficiente",
          "body": ">having fun on the weekends won't kill me or make me gain 2.5kg\n\n❤️‍🩹",
          "created_utc": 1736549122.0
        }
      ]
    }
  ]
}