{
  "id": "1hymhui",
  "subreddit": "EatingDisorders",
  "author": "hhhunnybee",
  "created_utc": 1736564608.0,
  "title": "I see myself getting smaller and it feels addicting.",
  "selftext": "I recently found out that i’m overweight and having a history with ED i was immediately thrown back into this pit. I now find myself turning down baked goods, or treats and drinking more water and eating way less. it makes me sad but i recently had checked my weight out of curiosity since i had made such a big change and i saw that i weighed less. i know that this is unhealthy but for some reason it feels like such a rush and an addictive feeling to see those numbers drop. is that messed up? should i feel bad for wanting more? i dont know what to do or how to feel. i feel crazy.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1hymhui/i_see_myself_getting_smaller_and_it_feels/",
  "score": 96,
  "num_comments": 11,
  "comments": [
    {
      "id": "m6j8m9x",
      "author": "alienprincess111",
      "body": "It was super addicting to me for sure. It's dangerous because then even when you get very uw, you can't stop.",
      "created_utc": 1736572988.0,
      "score": 25,
      "context": []
    },
    {
      "id": "m6j9qc0",
      "author": "MeowMachine09",
      "body": "As someone who's experienced this, it's not messed up. I got addicted to the feeling of waking up to the scale having gone down from my work the day before. I guess the questions become:\n\nDo you feel that high and feel happy you're losing weight because it makes you healthy? Does it make you proud? Do you feel like you won't need or want that feeling when you reach your goal weight? Or is this something you'll want to continue when you reach a healthy weight and you're afraid it'll become something you can't stop?",
      "created_utc": 1736573539.0,
      "score": 13,
      "context": []
    },
    {
      "id": "m6junoc",
      "author": "Connect-Preference-5",
      "body": "Honestly, feeling good is part of the ED. That’s the major reason it’s so dangerous bc there’s all types of ED behaviours that simply make you feel good even though they’re so destructive. You’re not crazy but you do need to nip this in the bud before it gets worse",
      "created_utc": 1736585955.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m6kefvh",
      "author": "Secret_Pepper_8243",
      "body": "This is how my eating disorder started tbh",
      "created_utc": 1736598317.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m6kiyk1",
      "author": "TwistedScience",
      "body": "It might be worthwhile reaching out to an ED-informed therapist. They can help you understand the deeper factors driving and maintaining any disordered behaviors. \n\nFor example (and by no means limited to): traumas, cognitive distortions, emotional regulation, and things like what is your body image purpose? What is your ideal body weight number gatekeeping you from in your life? How can you get those things regardless of your size? \n\nAlso, they can help in building a coping tool box that makes you feel good instead of the restriction and dieting behaviors.\n\nJust sharing some thoughts as I have lived experience and work in this space. I'm sending you much warmth and compassion 🫶.",
      "created_utc": 1736600585.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m6nh8qg",
      "author": "Zealousideal_Key3461",
      "body": "Hey friend, i hope this finds you well. You are rational, not crazy, you only focus on the outcomes, and once they come you naturally get the thrills, anyone who solely focuses on outcomes will fall into unhealthy behaviors to get there fast (gambling, steroids, etc.)\n\nInstead, think: how do i want my future-self in 2 years to look like? Assume that this is how long it takes to be on absolute track with no effort (i.e not forcing it, just being it, and at great level) And What is a solid way to get there and preserve these outcomes for this long. 2 years is not that long, and if you put your mind there and plan, it will give you clarity and confidence that you will make it.\n\"Staying strong\" is bad advice. Give yourself the clarity and confidence you so badly need that you will get out of this situation. One you have this you are much less likely to fall into shortcuts since you have belief in your way. Take care, hope this helps🙏",
      "created_utc": 1736635998.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m6liymx",
      "author": "One-Importance7269",
      "body": "That’s my spiral point",
      "created_utc": 1736613755.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6ovwv3",
      "author": "Connect_Raccoon_9616",
      "body": "It is addicting for sure. I find clothing & smaller sizes addicting, too. While you’re thinking about eating, weight loss….it’s also distracting you from other things, which can be part of the reason it feels good.",
      "created_utc": 1736653449.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6pqcgu",
      "author": "Icy-Dragonfly2746",
      "body": "My Ed is more of a control thing than anything else. One of the only things I have control over is how much I eat so I can’t lose control of that too. For me 84 is the perfect number, I don’t know why I think it’s the two even numbers or something but it’s perfect and it is addictive trying to get the perfect weight. Right now I’m 93 pounds because I’ve been bingeing to much recently but when I get to 84 I will feel perfect. It’s like nothing else matters but those numbers on the scale. I don’t even care if I die or can’t function I just need to be 84 pounds.",
      "created_utc": 1736668700.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6tz1em",
      "author": "Fancy-Giraffe-6391",
      "body": "Please message me love, I am an ED recovery Coach and would love to help",
      "created_utc": 1736724962.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m6k3xw3",
      "author": "hhhunnybee",
      "body": "i have an addictive personality, right now i feel like i could stop but over time im scared i wont be able to.",
      "created_utc": 1736592020.0,
      "score": 7,
      "context": [
        {
          "id": "m6j9qc0",
          "author": "MeowMachine09",
          "body": "As someone who's experienced this, it's not messed up. I got addicted to the feeling of waking up to the scale having gone down from my work the day before. I guess the questions become:\n\nDo you feel that high and feel happy you're losing weight because it makes you healthy? Does it make you proud? Do you feel like you won't need or want that feeling when you reach your goal weight? Or is this something you'll want to continue when you reach a healthy weight and you're afraid it'll become something you can't stop?",
          "created_utc": 1736573539.0
        }
      ]
    }
  ]
}