{
  "id": "1i99vgm",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1737763106.0,
  "title": "My friend has AFRID and has lost one of her safe foods, the alternative she’s doing is somewhat expensive and could use a better way",
  "selftext": "So my friend has AFRID, and recently one of her safe foods, being Grill Cheese is no longer a safe food. Something happened (she says she may have gotten COVID, had an awful sore throat ) and since then it tastes bad, kinda has a nasty fruity taste\n\nSpecially, homemade Grill Cheese. Something she has been doing instead is going to McDonalds and getting a cheeseburger with just cheese and the bun with nothing else. As you can imagine that’s not really the cheapest thing but it’s the only way she can handle it\n\nI suggested buying microwaveable grill cheese if she can find it and she figures that’d taste gross\n\nI asked if there is other cheese she can get at the store she likes, there isn’t\n\nShe tried to eat homemade grilled cheese again but couldn’t\n\nNote she is from Canada\n\nShe says the cheese from anywhere but McDonalds has a gross “fruity” taste\n\nMaybe there’s a way to proper emulate the taste of the Grill Cheese at McDonalds at home she has at home? Or some other solution?\n\nI’m not sure what to do really, advice appreciated!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1i99vgm/my_friend_has_afrid_and_has_lost_one_of_her_safe/",
  "score": 104,
  "num_comments": 32,
  "comments": [
    {
      "id": "m91o1ef",
      "author": "Excellent-World-476",
      "body": "Eating Disorders are expensive unfortunately.  I’m in Canada. Pretty sure they just use American cheese at McDonalds. Could someone make them for her and freeze them uncooked and then she cooked grill in oven.",
      "created_utc": 1737782071.0,
      "score": 141,
      "context": []
    },
    {
      "id": "m924nrh",
      "author": "prairieaquaria",
      "body": "Try every American sliced cheese in the store.",
      "created_utc": 1737791064.0,
      "score": 55,
      "context": []
    },
    {
      "id": "m92n1n1",
      "author": "cinnysprinx",
      "body": "This is probably a stupid question but could it be the bread? Like I'm sure they've just tasted the cheese by itself too, but after a couple times of eating otherwise fine cheese on funky tasting bread may've made them subconsciously attribute the funk to the cheese even when it isn't there.\n\nI only offer that idea as someone who's done like, the exact same thing to themselves before lol. But I don't have ARFID, not sure at all what would cause this.",
      "created_utc": 1737802580.0,
      "score": 49,
      "context": []
    },
    {
      "id": "m92dj7p",
      "author": "Anoncrem",
      "body": "mcdonalds buys that cheese from Fonterra it says. idk where they sell it tho. it says \"Our portfolio of well-known brands includes Fernleaf, Anchor, Anmum, and Anlene.\" on the website maybe look into those cheese brands and see if they r in stores near by.",
      "created_utc": 1737796581.0,
      "score": 38,
      "context": []
    },
    {
      "id": "m93bdp6",
      "author": "speckled113",
      "body": "I know less about AFRID than other EDs, but is it possible that it’s a mental block that impacts all grilled cheese made at home? Is she getting treatment?",
      "created_utc": 1737814327.0,
      "score": 17,
      "context": []
    },
    {
      "id": "m926mxh",
      "author": "begintobreathe",
      "body": "Does she have access to treatment? Replacing or trying to make something else safe isn’t going to last long.",
      "created_utc": 1737792269.0,
      "score": 24,
      "context": []
    },
    {
      "id": "m94d2r3",
      "author": "11brooke11",
      "body": "It's probably more psychological than logical. I don't think any other type of grilled cheese will help.",
      "created_utc": 1737825977.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m96w8r0",
      "author": "Kaitron5000",
      "body": "My little brother AFRID and only eats certain fast food and he has gained 100lbs in the past 2 years alone. \n\nHow often does she brush her teeth, tongue and roof of her mouth? Does she vape or smoke? This can greatly affect your taste buds. It may be something other people than Covid. Just a few thoughts. Eating McDonalds long term is not healthy. Eating grilled cheese alone isn't much better. She needs protein. It's time to start therapy in the meantime.",
      "created_utc": 1737854208.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m95iiwm",
      "author": "clarabear10123",
      "body": "Everyone is saying to try different cheese… has she tried different butter or mayo? Has she tried different bread? I used a honey wheat that gave a weird, processed, burnt fruity taste once!\n\nHas she tried adding seasonings that enhance salty/spicy/umami flavors?",
      "created_utc": 1737838102.0,
      "score": 4,
      "context": []
    },
    {
      "id": "m928uym",
      "author": "laurandisorder",
      "body": "I believe that you can buy the actual McDonald’s ingredients from them. Go into your closest branch and see if they will sell some buns and cheese.",
      "created_utc": 1737793641.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m93ddew",
      "author": "bella-fonte",
      "body": "Can she try making her own just getting some store bought buns and American burger cheese slices?",
      "created_utc": 1737815062.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m95bpza",
      "author": "radicalplacement",
      "body": "Variations of safe foods are really good, in good time. Maybe work up to a cheese toastie (grilled cheese), as it keeps the components of bread & cheese. Try American cheese",
      "created_utc": 1737836026.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m96cwxz",
      "author": "jclom0",
      "body": "I have ARFID but I’m in my forties so not as bad as I used to be, and I’ve learnt different things I can handle. \n\nFor example, if I went off eating cheese toasties (our version of grilled cheese I think) I’d try similar things like Mac cheese or baked potato with cheese. I’m more likely to be able to eat something slightly similar. \n\nAlso it usually takes me trying something about twenty times before I sort of *remember* I actually like it. \n\nIf they don’t like pasta or potato try things similar to other safe foods, and try to build on that.",
      "created_utc": 1737847714.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m96lbok",
      "author": "BlueEyedGirl86",
      "body": "It’s just how she is",
      "created_utc": 1737850548.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m923jd7",
      "author": "CozJeez85",
      "body": "What on earth is grill cheese?",
      "created_utc": 1737790374.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9629ta",
      "author": "deadsableye",
      "body": "Sometimes I eat cheese with saltine crackers. It’s a nice snack on days I don’t feel like cooking and fills me up since I eat the whole package of crackers. Maybe not putting the cheese on bread will help.",
      "created_utc": 1737844213.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m99kjzk",
      "author": "PheonixRising_2071",
      "body": "McDonald’s uses American cheese. Have her start trying those. There’s usually American cheese at the deli counter too that you can have sliced.",
      "created_utc": 1737899864.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m99px6t",
      "author": "mymatingmccall",
      "body": "This is crazy to me that I’m seeing this post- I recently made a grilled cheese sandwich and noticed the cheese had a “fruity” smell to it while cooking it. I couldn’t really determine whether or not it tasted fruity, but it definitely smelled like it; I took one bite and had to throw the sandwich out. I buy “deluxe American cheese”. I’ve had COVID three times and lost my sense of smell and taste all three times. \n\nI also like the McDonald’s cheese. Your friend might like “sharp cheddar American”; I buy a brand called Cooper. It’s hands down my favorite type of American cheese, I just don’t buy it as often because it is a bit more expensive. My heart goes out to your friend! Losing a safe food sucks and it’s always an annoying journey to find another.",
      "created_utc": 1737901831.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9a80rd",
      "author": "karupiin",
      "body": "I’ve had ARFID my entire life, and unfortunately I have to agree with people that think the problem is psychological. I’ve also gotten sick after eating something and was never able to eat it again, even after 10+ years. She needs to find another safe food, and if she doesn’t have another one she needs professional help immediately because this issue can be fatal. Please suggest for her to take multivitamins if she isn’t already, and see if she is able to have any supplement/meal replacement drinks. If it helps, the brand of those I can actually drink is Boost because it’s lighter and doesn’t taste very strong.",
      "created_utc": 1737907535.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9femug",
      "author": "Lindsey7618",
      "body": "I use kraft American cheese. I actually like toasted grilled cheese a lot better. I toast two slices of bread and put 1-2 slices of cheese on and microwave it for 30 ish seconds (it depends on your microwave and I flip it halfway if I use two slices). I like it better than making actual grilled cheese on the stove or grill. Also I'm sorry, it's grilled, not grill 🙂 (I would want to know so that's why I mention it)",
      "created_utc": 1737971135.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9fecfd",
      "author": "Lindsey7618",
      "body": "Sorry but as someone with an ED (not arfid) I laughed because I feel the financial pain.",
      "created_utc": 1737970952.0,
      "score": 2,
      "context": [
        {
          "id": "m91o1ef",
          "author": "Excellent-World-476",
          "body": "Eating Disorders are expensive unfortunately.  I’m in Canada. Pretty sure they just use American cheese at McDonalds. Could someone make them for her and freeze them uncooked and then she cooked grill in oven.",
          "created_utc": 1737782071.0
        }
      ]
    },
    {
      "id": "m97v4ns",
      "author": "Affection-Angel",
      "body": "Slightly outdated bread can also have a 'sickly sweet', or almost 'fruity, fermenting' smell, and gives that je ne sais qouis of ick. Get your friend some new bread. I don't know if suggesting this possiblity of outdated bread will calm her mind, but maybe try some different types of bread.",
      "created_utc": 1737867116.0,
      "score": 18,
      "context": [
        {
          "id": "m92n1n1",
          "author": "cinnysprinx",
          "body": "This is probably a stupid question but could it be the bread? Like I'm sure they've just tasted the cheese by itself too, but after a couple times of eating otherwise fine cheese on funky tasting bread may've made them subconsciously attribute the funk to the cheese even when it isn't there.\n\nI only offer that idea as someone who's done like, the exact same thing to themselves before lol. But I don't have ARFID, not sure at all what would cause this.",
          "created_utc": 1737802580.0
        }
      ]
    },
    {
      "id": "m94atq6",
      "author": "idkkkk44336",
      "body": "if she's doing things like this, there's no way she's in treatment. my nutritionist was BRUTAL (in the nicest way possible) .. don't like dairy cuz it might cause bloating? oh you gotta have that daily.. you think tomato sauce will hurt your stomach? too bad go make some pizza rolls.. scared any fast food will give you food poisoning? got my bf & mom involved on a call & made them take me out. their main goal was to make ALL foods & situations safe. even if you dont like something it shouldnt scare you.. at least thats what im told😅",
      "created_utc": 1737825320.0,
      "score": 35,
      "context": [
        {
          "id": "m93bdp6",
          "author": "speckled113",
          "body": "I know less about AFRID than other EDs, but is it possible that it’s a mental block that impacts all grilled cheese made at home? Is she getting treatment?",
          "created_utc": 1737814327.0
        }
      ]
    },
    {
      "id": "m94c5v7",
      "author": "idkkkk44336",
      "body": "seriously! replacement is just enabling the problem. coming from someone whose had arfid since childhood - please help her get help. i went onto a local facebook group asking for recommendations for a nutritionist/dietitian, i found someone who took my insurance, and did virtual appointments with her (due to my state of health- in person is okay too. personal preference!) i didn't stick to it sadly, but before seeing her i was 75lbs, eating 300cals a day, at the start of organ failure and being threatened with a picc line from my doctor & parents (literally had the appointment made & everything without my consent. despite being 22 years old.) i'm now 92lbs & eat roughly 1500cals a day. its not great, but im not DYING anymore. please, help her find REAL help rather than helping her with safe foods. it'll mean more in the end, even if she gets upset by it now❤️‍🩹",
      "created_utc": 1737825709.0,
      "score": 17,
      "context": [
        {
          "id": "m926mxh",
          "author": "begintobreathe",
          "body": "Does she have access to treatment? Replacing or trying to make something else safe isn’t going to last long.",
          "created_utc": 1737792269.0
        }
      ]
    },
    {
      "id": "m92begm",
      "author": "westcoast_pixie",
      "body": "A grilled* cheese sandwich",
      "created_utc": 1737795241.0,
      "score": 8,
      "context": [
        {
          "id": "m923jd7",
          "author": "CozJeez85",
          "body": "What on earth is grill cheese?",
          "created_utc": 1737790374.0
        }
      ]
    },
    {
      "id": "m9ferlk",
      "author": "Excellent-World-476",
      "body": "It’s either I’m spending on food I purge as I have anorexia purging subtype or expensive food I feel safe with like protein bars, peanut butter, golden kiwi and grapes which are hellishly expensive right now.",
      "created_utc": 1737971217.0,
      "score": 2,
      "context": [
        {
          "id": "m91o1ef",
          "author": "Excellent-World-476",
          "body": "Eating Disorders are expensive unfortunately.  I’m in Canada. Pretty sure they just use American cheese at McDonalds. Could someone make them for her and freeze them uncooked and then she cooked grill in oven.",
          "created_utc": 1737782071.0
        },
        {
          "id": "m9fecfd",
          "author": "Lindsey7618",
          "body": "Sorry but as someone with an ED (not arfid) I laughed because I feel the financial pain.",
          "created_utc": 1737970952.0
        }
      ]
    },
    {
      "id": "m97vji7",
      "author": "cinnysprinx",
      "body": "Definitely had this before! My brother used to stock the house w/ a brand of sourdough and I swore it would start tasting like sweet-tarts if we had it too long 🤢.",
      "created_utc": 1737867296.0,
      "score": 3,
      "context": [
        {
          "id": "m92n1n1",
          "author": "cinnysprinx",
          "body": "This is probably a stupid question but could it be the bread? Like I'm sure they've just tasted the cheese by itself too, but after a couple times of eating otherwise fine cheese on funky tasting bread may've made them subconsciously attribute the funk to the cheese even when it isn't there.\n\nI only offer that idea as someone who's done like, the exact same thing to themselves before lol. But I don't have ARFID, not sure at all what would cause this.",
          "created_utc": 1737802580.0
        },
        {
          "id": "m97v4ns",
          "author": "Affection-Angel",
          "body": "Slightly outdated bread can also have a 'sickly sweet', or almost 'fruity, fermenting' smell, and gives that je ne sais qouis of ick. Get your friend some new bread. I don't know if suggesting this possiblity of outdated bread will calm her mind, but maybe try some different types of bread.",
          "created_utc": 1737867116.0
        }
      ]
    },
    {
      "id": "m94cor3",
      "author": "speckled113",
      "body": "yeah that was my impression and based off my (other ed) treatment. OP, I think the most effective way to help would be to encourage her to get into treatment. I don’t know if finding replacement foods is worthwhile for your time or her treatment. It sounds like you are a great friend though.",
      "created_utc": 1737825863.0,
      "score": 10,
      "context": [
        {
          "id": "m93bdp6",
          "author": "speckled113",
          "body": "I know less about AFRID than other EDs, but is it possible that it’s a mental block that impacts all grilled cheese made at home? Is she getting treatment?",
          "created_utc": 1737814327.0
        },
        {
          "id": "m94atq6",
          "author": "idkkkk44336",
          "body": "if she's doing things like this, there's no way she's in treatment. my nutritionist was BRUTAL (in the nicest way possible) .. don't like dairy cuz it might cause bloating? oh you gotta have that daily.. you think tomato sauce will hurt your stomach? too bad go make some pizza rolls.. scared any fast food will give you food poisoning? got my bf & mom involved on a call & made them take me out. their main goal was to make ALL foods & situations safe. even if you dont like something it shouldnt scare you.. at least thats what im told😅",
          "created_utc": 1737825320.0
        }
      ]
    },
    {
      "id": "m9ff0s4",
      "author": "Lindsey7618",
      "body": "She said it tastes bad. It actually is possible for covid to change the way you smell and taste things. She didn't say she doesn't like grilled cheese anymore because it causes bloating, she said she doesn't like the cheese anymore because it doesn't taste good anymore. She's still eating her version. I actually have a favorite brand of string cheese and it randomly tastes more and more gross every time I buy it. Sometimes it tastes great and sometimes it doesn't taste anything like what it should. Like someone else mentioned, it could also be the bread being expired/old.\n\nBeing scared of a food and not liking the taste are two different things.",
      "created_utc": 1737971377.0,
      "score": 1,
      "context": [
        {
          "id": "m93bdp6",
          "author": "speckled113",
          "body": "I know less about AFRID than other EDs, but is it possible that it’s a mental block that impacts all grilled cheese made at home? Is she getting treatment?",
          "created_utc": 1737814327.0
        },
        {
          "id": "m94atq6",
          "author": "idkkkk44336",
          "body": "if she's doing things like this, there's no way she's in treatment. my nutritionist was BRUTAL (in the nicest way possible) .. don't like dairy cuz it might cause bloating? oh you gotta have that daily.. you think tomato sauce will hurt your stomach? too bad go make some pizza rolls.. scared any fast food will give you food poisoning? got my bf & mom involved on a call & made them take me out. their main goal was to make ALL foods & situations safe. even if you dont like something it shouldnt scare you.. at least thats what im told😅",
          "created_utc": 1737825320.0
        }
      ]
    },
    {
      "id": "m9ffapu",
      "author": "Lindsey7618",
      "body": "Also, trying different variations/similar foods to safe foods is a good way to expand what you eat.",
      "created_utc": 1737971549.0,
      "score": 1,
      "context": [
        {
          "id": "m93bdp6",
          "author": "speckled113",
          "body": "I know less about AFRID than other EDs, but is it possible that it’s a mental block that impacts all grilled cheese made at home? Is she getting treatment?",
          "created_utc": 1737814327.0
        },
        {
          "id": "m94atq6",
          "author": "idkkkk44336",
          "body": "if she's doing things like this, there's no way she's in treatment. my nutritionist was BRUTAL (in the nicest way possible) .. don't like dairy cuz it might cause bloating? oh you gotta have that daily.. you think tomato sauce will hurt your stomach? too bad go make some pizza rolls.. scared any fast food will give you food poisoning? got my bf & mom involved on a call & made them take me out. their main goal was to make ALL foods & situations safe. even if you dont like something it shouldnt scare you.. at least thats what im told😅",
          "created_utc": 1737825320.0
        }
      ]
    },
    {
      "id": "m94cdif",
      "author": "idkkkk44336",
      "body": "adding on - there are nutritionists/dietitians who specialize in arfid. mine did!",
      "created_utc": 1737825772.0,
      "score": 11,
      "context": [
        {
          "id": "m926mxh",
          "author": "begintobreathe",
          "body": "Does she have access to treatment? Replacing or trying to make something else safe isn’t going to last long.",
          "created_utc": 1737792269.0
        },
        {
          "id": "m94c5v7",
          "author": "idkkkk44336",
          "body": "seriously! replacement is just enabling the problem. coming from someone whose had arfid since childhood - please help her get help. i went onto a local facebook group asking for recommendations for a nutritionist/dietitian, i found someone who took my insurance, and did virtual appointments with her (due to my state of health- in person is okay too. personal preference!) i didn't stick to it sadly, but before seeing her i was 75lbs, eating 300cals a day, at the start of organ failure and being threatened with a picc line from my doctor & parents (literally had the appointment made & everything without my consent. despite being 22 years old.) i'm now 92lbs & eat roughly 1500cals a day. its not great, but im not DYING anymore. please, help her find REAL help rather than helping her with safe foods. it'll mean more in the end, even if she gets upset by it now❤️‍🩹",
          "created_utc": 1737825709.0
        }
      ]
    },
    {
      "id": "m9ff59z",
      "author": "Lindsey7618",
      "body": "This is great information, but ultimately, OP csnt force their friend to get help. So if the friend refuses, this advice isn't helpful.",
      "created_utc": 1737971456.0,
      "score": 1,
      "context": [
        {
          "id": "m926mxh",
          "author": "begintobreathe",
          "body": "Does she have access to treatment? Replacing or trying to make something else safe isn’t going to last long.",
          "created_utc": 1737792269.0
        },
        {
          "id": "m94c5v7",
          "author": "idkkkk44336",
          "body": "seriously! replacement is just enabling the problem. coming from someone whose had arfid since childhood - please help her get help. i went onto a local facebook group asking for recommendations for a nutritionist/dietitian, i found someone who took my insurance, and did virtual appointments with her (due to my state of health- in person is okay too. personal preference!) i didn't stick to it sadly, but before seeing her i was 75lbs, eating 300cals a day, at the start of organ failure and being threatened with a picc line from my doctor & parents (literally had the appointment made & everything without my consent. despite being 22 years old.) i'm now 92lbs & eat roughly 1500cals a day. its not great, but im not DYING anymore. please, help her find REAL help rather than helping her with safe foods. it'll mean more in the end, even if she gets upset by it now❤️‍🩹",
          "created_utc": 1737825709.0
        }
      ]
    }
  ]
}