{
  "id": "1i9b48z",
  "subreddit": "EatingDisorders",
  "author": "ultrviolc",
  "created_utc": 1737766669.0,
  "title": "weighing at the doctor",
  "selftext": "so i was recently informed by my dad and mom i need to go to the doctors to get a vision and scoliosis test for school (which i think is bs), and upon hearing that i was absolutely mortified, because in my mind a doctor visit automatically equals being weighed, which terrifies me. i dont want anyone to know how much i am, i dont know how much i am and i just dont want to know, but its a pretty standard part of doctors appointments. i flipped OUT, literally sobbing and hyperventilating like a two year old and begging not to go, but its required to be documented and if i dont i wont be allowed to go to school. im freaking out and crying as i write this, im not even in recovery, but this would make everything so much worse for me. but im a minor so what if they force me? what do i do? can i just refuse? im so scared 😭😭 nobody knows about my eating habits or thoughts, so im sure this looked absolutely childish and crazy to my dad, especially because i wouldn’t outright say why i dont wanna go so badly",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1i9b48z/weighing_at_the_doctor/",
  "score": 45,
  "num_comments": 30,
  "comments": [
    {
      "id": "m91hl8g",
      "author": "alienprincess111",
      "body": "You can just tell the doctor you don't want to be weighed. Or ask to stand backwards so you don't see the number.",
      "created_utc": 1737779214.0,
      "score": 55,
      "context": []
    },
    {
      "id": "m91jh5b",
      "author": "Sapphic-Babe",
      "body": "So, typically when I go to the doctors, they don’t let me see the number. The moment my doctor knew I had an eating disorder, she made sure the scale would be covered. It is always an option to ask that they not tell you the number and cover it up. Otherwise, if that is still scary, ask to not be weighed. While it’s a standard for doctor’s visits, it’s not always necessary that they have that weight and they cannot force you to get a weight if the treatment does not require it",
      "created_utc": 1737780018.0,
      "score": 12,
      "context": []
    },
    {
      "id": "m93u77g",
      "author": "Forever_Alone51023",
      "body": "I'm an adult, but if I don't want to be weighed (I refuse EVERY SINGLE time) I tell them nope. \n\nI weigh at home so I am honest and tell them my weight, tho I am starting to have doubts about my ability to tell the truth much longer (my weight has tanked) so I think it's gonna be weighed backwards now. 😔🫤\n\nThis is a slippery slope for me bc I'm not just dealing with the ED...I have a serious illness that typically causes weight loss when it starts getting bad enough so I really can't be losing weight. My loss is from the ED right now (and less from the illness, tho part of it is that I have lost my appetite and idk if that is the ED or the illness 🤔)...I know this and I'm scared to death bc I don't want to gain weight...I look horrible now, but I will look worse at a higher weight (damn you ED). I do have a mental health team. Time to tell them? Yeah.\n\nI wish you luck. Please be careful. This is not a good life...and I might not have as long as everyone else has...I know I shouldn't waste it...and neither should you!❤️",
      "created_utc": 1737820537.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m930mnw",
      "author": "Coi_Fox",
      "body": "They other commenters have covered it. I'm just here to echo them. It's okay to ask not to be weighed, or stand facing away from the scale. They will understand, and they won't judge you.",
      "created_utc": 1737809960.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m9431by",
      "author": "WideAtmosphere",
      "body": "I look up at the ceiling very obviously when I step onto the scale so I will not see. Every single nurse over the past 30 years has known not to mention my weight. It’s a very obvious signal that I am deliberately not looking at it. One thing you can also do is tell them to conceal your weight from you as well. They don’t need any more information than that.",
      "created_utc": 1737823094.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m94zgw1",
      "author": "updown27",
      "body": "Just stand backwards and ask them not to tell you. Unfortunately that doesn't solve the problem of you not wanting other people to know, but if you have an ED, your parents and doctors need to know. It sounds like you're scared that this appointment is going to force your ED out of the closet. That's going to happen eventually and the sooner the better. I know this is scary but it's time to face it.",
      "created_utc": 1737832390.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m95qm41",
      "author": "i-am-no-more994",
      "body": "My doctors have given up weighing me at this point. I have refused many times, and you can too.",
      "created_utc": 1737840555.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m97c3dq",
      "author": "swaggysalamander",
      "body": "Ask them if you can step on backwards and if they cannot tell you your weight. I ask for it every time and have never had any problems. They never ask why, they just say yes",
      "created_utc": 1737859734.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m94hnqn",
      "author": "lady_tsunami",
      "body": "I get weighed and look at the nurse saying “I have an eating disorder- I am not to know this number”.\n\nOn digital scales I use my hand to cover the number, if it’s a manual scale I look away.",
      "created_utc": 1737827291.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m94zcwr",
      "author": "tracyf600",
      "body": "Turn your back to the  scale so you can't see . It helped me.  I still do it. Sometimes the numbers get to be too much.",
      "created_utc": 1737832357.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m95pndw",
      "author": "stephaniej83096",
      "body": "I feel your post in my soul. I have the biggest anxiety around this part of drs appts, and have not weighed myself since the beginning of my recovery. I start by telling them I don’t want to be weighed, and if they insist, I tell them I need to be weighed facing backwards and that information to not be disclosed to me in any way. I’m sorry 🥺🙁",
      "created_utc": 1737840263.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m96kkdw",
      "author": "royalewithcheese7107",
      "body": "tell them you’re going to turn around when weighing, and tell them you don’t need to know the #. in my experience, they always understand what i mean.",
      "created_utc": 1737850292.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m98awye",
      "author": "unbecomingbaby",
      "body": "I ask if I can step on backwards and please to not say my weight and I’ve had never issues with that.",
      "created_utc": 1737874910.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9bio0w",
      "author": "Smile1228",
      "body": "I asked for my docs to weigh me facing backwards (:",
      "created_utc": 1737920735.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9ii6jm",
      "author": "WeirdLostEntity",
      "body": "I went to a doctor visit for scoliosis and they didn't weight me. I hope everything goes well either way",
      "created_utc": 1738009435.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mshucd1",
      "author": "Alternative_Page_869",
      "body": "For me, not being weighed has nothing to do with not wanting to know the number, it is that I do not wish it to be measured and/or recorded, so I exercise my right as opposed to privilege to refuse.",
      "created_utc": 1747334787.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m933i95",
      "author": "onyxjade7",
      "body": "Why can’t you go to school without these tests? Isn’t school legally required? \n\nI am sorry you have to deal with this. It’s terrifying I know. I hope everything is ok so you’re safe.",
      "created_utc": 1737811212.0,
      "score": -1,
      "context": []
    },
    {
      "id": "m93emi5",
      "author": "RealAhhJit-Greg-",
      "body": "Bro what the hell. What are you 7 years old",
      "created_utc": 1737815512.0,
      "score": -11,
      "context": []
    },
    {
      "id": "m93nq45",
      "author": "sweetfaerieface",
      "body": "👆🏻I haven’t been weighed at my GP for 10 years. When I recently had to be weighed for surgery (anesthesia) I turned around so I couldn’t see the number. It really bugged me for a while because I was curious but that has gone away.",
      "created_utc": 1737818570.0,
      "score": 21,
      "context": [
        {
          "id": "m91hl8g",
          "author": "alienprincess111",
          "body": "You can just tell the doctor you don't want to be weighed. Or ask to stand backwards so you don't see the number.",
          "created_utc": 1737779214.0
        }
      ]
    },
    {
      "id": "m958xgo",
      "author": "personal__hell",
      "body": "also - tell them not to tell you/say it out loud/hand you paperwork with it. all 3 have happened to me (once was the RN saying it as she was documenting it, like “ok, ___, got it!” totally out of habit :/). it’s helpful to have these precautions in place and you deserve to advocate for yourself!\n\nyou can also ask to speak alone to your doctor beforehand, or a nurse/clinician that you trust. does your doctors office have a therapist/mental health staff on site? you can ask them to be in the room for any lab work/blood pressure etc (even weigh ins) and ask to speak privately with them as well so that you have someone to reach out to, who can help with your specific needs in each circumstance, and be a compassionate support for you. it sounds like you could use that right now.",
      "created_utc": 1737835172.0,
      "score": 9,
      "context": [
        {
          "id": "m91hl8g",
          "author": "alienprincess111",
          "body": "You can just tell the doctor you don't want to be weighed. Or ask to stand backwards so you don't see the number.",
          "created_utc": 1737779214.0
        }
      ]
    },
    {
      "id": "m95r1gl",
      "author": "ultrviolc",
      "body": "ill try that, i just worry that maybe because im a minor they can force me or smth. i dont wanna make a huge scene out of it",
      "created_utc": 1737840685.0,
      "score": 3,
      "context": [
        {
          "id": "m95qm41",
          "author": "i-am-no-more994",
          "body": "My doctors have given up weighing me at this point. I have refused many times, and you can too.",
          "created_utc": 1737840555.0
        }
      ]
    },
    {
      "id": "m93cqml",
      "author": "ultrviolc",
      "body": "school is legally required ofc, i meant that id be kicked out of the school im currently enrolled in if i dont get the documents to them saying wether i bave scoliosis or not and my vision test (i dont havw scoliosis whatsoever ans my vision is just fine, idk why they wont take my word for it)",
      "created_utc": 1737814832.0,
      "score": 2,
      "context": [
        {
          "id": "m933i95",
          "author": "onyxjade7",
          "body": "Why can’t you go to school without these tests? Isn’t school legally required? \n\nI am sorry you have to deal with this. It’s terrifying I know. I hope everything is ok so you’re safe.",
          "created_utc": 1737811212.0
        }
      ]
    },
    {
      "id": "m93mrj7",
      "author": "peachnsnails",
      "body": "are you new here?",
      "created_utc": 1737818263.0,
      "score": 3,
      "context": [
        {
          "id": "m93emi5",
          "author": "RealAhhJit-Greg-",
          "body": "Bro what the hell. What are you 7 years old",
          "created_utc": 1737815512.0
        }
      ]
    },
    {
      "id": "m943blv",
      "author": "WideAtmosphere",
      "body": "Eating disorders are mental illnesses. They aren’t logical. This is an eating disorder group. Consider your tone when you reply here, please.",
      "created_utc": 1737823174.0,
      "score": 2,
      "context": [
        {
          "id": "m93emi5",
          "author": "RealAhhJit-Greg-",
          "body": "Bro what the hell. What are you 7 years old",
          "created_utc": 1737815512.0
        }
      ]
    },
    {
      "id": "m93fld1",
      "author": "ultrviolc",
      "body": "? 💀",
      "created_utc": 1737815852.0,
      "score": 2,
      "context": [
        {
          "id": "m93emi5",
          "author": "RealAhhJit-Greg-",
          "body": "Bro what the hell. What are you 7 years old",
          "created_utc": 1737815512.0
        }
      ]
    },
    {
      "id": "m93uou4",
      "author": "Forever_Alone51023",
      "body": "WtAF??????",
      "created_utc": 1737820679.0,
      "score": 1,
      "context": [
        {
          "id": "m93emi5",
          "author": "RealAhhJit-Greg-",
          "body": "Bro what the hell. What are you 7 years old",
          "created_utc": 1737815512.0
        }
      ]
    },
    {
      "id": "m95w9wc",
      "author": "i-am-no-more994",
      "body": "They shouldn't be able too force you hun",
      "created_utc": 1737842297.0,
      "score": 1,
      "context": [
        {
          "id": "m95qm41",
          "author": "i-am-no-more994",
          "body": "My doctors have given up weighing me at this point. I have refused many times, and you can too.",
          "created_utc": 1737840555.0
        },
        {
          "id": "m95r1gl",
          "author": "ultrviolc",
          "body": "ill try that, i just worry that maybe because im a minor they can force me or smth. i dont wanna make a huge scene out of it",
          "created_utc": 1737840685.0
        }
      ]
    },
    {
      "id": "m9azixq",
      "author": "AlmostxAngel",
      "body": "If they do force you then tell them you don't want to know or see the number and then don't look down at the number.",
      "created_utc": 1737915397.0,
      "score": 1,
      "context": [
        {
          "id": "m95qm41",
          "author": "i-am-no-more994",
          "body": "My doctors have given up weighing me at this point. I have refused many times, and you can too.",
          "created_utc": 1737840555.0
        },
        {
          "id": "m95r1gl",
          "author": "ultrviolc",
          "body": "ill try that, i just worry that maybe because im a minor they can force me or smth. i dont wanna make a huge scene out of it",
          "created_utc": 1737840685.0
        }
      ]
    },
    {
      "id": "m94ndge",
      "author": "little_bug_person",
      "body": "It’s mostly a way to ensure kids aren’t being medically neglected, and that they are being screened for potential medical issues. Policies like this are meant to protect children, even if it’s inconvenient/uncomfortable. \n\nIf your doc asks to weigh you, you can ask for the number to be kept private, you can stand backwards on the scale, or you could ask if refusal is an option. \n\nA doctor is a professional, they’re not judging your weight. They just want to make sure you’re healthy/on track to meet milestones and goals. They see people in various states of health, size, disease, disability, illness, etc. \n\nThey will note your weight and then immediately forget about it because it truly doesn’t matter to them, and they’re not going to think about it at all once you leave. A great reminder is that they care about you as a patient, but not personally. I know it can be vulnerable and emotional, but they really don’t care as much as you do, they have hundreds of patients, it’s no biggie for them!",
      "created_utc": 1737828928.0,
      "score": 3,
      "context": [
        {
          "id": "m933i95",
          "author": "onyxjade7",
          "body": "Why can’t you go to school without these tests? Isn’t school legally required? \n\nI am sorry you have to deal with this. It’s terrifying I know. I hope everything is ok so you’re safe.",
          "created_utc": 1737811212.0
        },
        {
          "id": "m93cqml",
          "author": "ultrviolc",
          "body": "school is legally required ofc, i meant that id be kicked out of the school im currently enrolled in if i dont get the documents to them saying wether i bave scoliosis or not and my vision test (i dont havw scoliosis whatsoever ans my vision is just fine, idk why they wont take my word for it)",
          "created_utc": 1737814832.0
        }
      ]
    },
    {
      "id": "m971j2p",
      "author": "onyxjade7",
      "body": "Thank you for explaining. I am sorry you have to deal with this.",
      "created_utc": 1737856039.0,
      "score": 1,
      "context": [
        {
          "id": "m933i95",
          "author": "onyxjade7",
          "body": "Why can’t you go to school without these tests? Isn’t school legally required? \n\nI am sorry you have to deal with this. It’s terrifying I know. I hope everything is ok so you’re safe.",
          "created_utc": 1737811212.0
        },
        {
          "id": "m93cqml",
          "author": "ultrviolc",
          "body": "school is legally required ofc, i meant that id be kicked out of the school im currently enrolled in if i dont get the documents to them saying wether i bave scoliosis or not and my vision test (i dont havw scoliosis whatsoever ans my vision is just fine, idk why they wont take my word for it)",
          "created_utc": 1737814832.0
        }
      ]
    }
  ]
}