{
  "id": "1ib7pez",
  "subreddit": "EatingDisorders",
  "author": "ExtraExpression876",
  "created_utc": 1737980974.0,
  "title": "Is it possible to have a eating disorder and still be happy?",
  "selftext": "I’ve struggled with disordered eating all my life. I feel like it’s the one way I can control my life while having autism. No matter how physically how healthy and good I feel I mentally still crave restriction, it gives me a purpose to be alive. Is it possible to live my life while continuing with my eating disorder?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1ib7pez/is_it_possible_to_have_a_eating_disorder_and/",
  "score": 66,
  "num_comments": 24,
  "comments": [
    {
      "id": "m9l2icp",
      "author": "sage-green-lover",
      "body": "Absolutely. Through my eating disorder, I’ve often had periods of happiness and moments of joy. Life inherently has moments of negative and positive emotions. Our goal is to have more positives than negatives, and unfortunately I think we need to make recovery progress to have sustainable long term happiness. \n\nThat said, The goal of “100% recovery” can feel really daunting and out of reach. I know it is for me at least, and when loved ones tell me I can’t be happy until I’m 100% recovered, I feel frustrated and angry that my current progress isn’t recognized. I personally feel that any recovery progress is good progress, and you can set incremental goals. You can be happy in the depths of your ed and during recovery, but you probably can’t enjoy everything life has to offer while sick. \n\nHave you spoken to a psychiatrist or therapist? Sometimes we need a little boost to really enjoy all life has to offer outside of our ED. \n\nWishing you love ❤️",
      "created_utc": 1738038597.0,
      "score": 28,
      "context": []
    },
    {
      "id": "m9mfflc",
      "author": "East-Praline4329",
      "body": "As a proponent of harm reduction, i think yes it is possible to have happy moments/feel happiness when sick. Just because you have an ED doesn’t mean you can’t be happy and have a good life.",
      "created_utc": 1738065685.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m9objc5",
      "author": "velvetcuts",
      "body": "Yeah, until you reach a certain point where your ED leaves you exhausted, depressed, and bedridden. You can be ‘happy’, but I wouldn’t call it pure happiness. I’ve been recovered for a while, and I still crave being self-destructive sometimes. However, you just have to learn to push through it—because, in the end, living a life where your ED takes control wouldn’t be fun.",
      "created_utc": 1738087641.0,
      "score": 8,
      "context": []
    },
    {
      "id": "m9mcq0b",
      "author": "33aavt",
      "body": "No, everything else in my life was finally looking up when I relapsed into anorexia, without knowing about the ED you’d think my life was perfect but I was so violently depressed from my illness, everyday was pain and hell. I semi recovered/binge cycle since May and while I still get a lot of thoughts I’m already just happier from nourishing my body properly.",
      "created_utc": 1738064324.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m9n4m2y",
      "author": "LoveThatForYouBebe",
      "body": "I see both sides in the comment section, and have been on both sides at points. Now, nearly 2 and a half decades into this, I’m more than ever convinced that while full recovery can be possible, I don’t think there’s a life where I’m ever truly free from all aspects of this disorder, mentally or physically.\n\nBut that’s why I’m a fan of harm reduction done on an individual level. It’s not “giving up,” it’s a team/provider meeting you where you are and working on quality of life improvements and incremental steps forward in that way, that may hopefully lead to pursuing further ED recovery, but not given up on if that doesn’t happen. There’s usually a contingency of ED behavior at least being somewhat reduced or managed/monitored, but I’ve seen a lot of people able to enjoy life again without the pressure of choosing between “you have to recover 100%” (which feels impossible for many at various points) or “you have to be super sick and utterly miserable 100% of the time.”",
      "created_utc": 1738075310.0,
      "score": 6,
      "context": []
    },
    {
      "id": "m9ljsva",
      "author": "Beverchakus",
      "body": "100%! I'm struggling bad right now but ED is only a small part of me. Well, it's a big part, as it's effecting my life but i don't let it get me down. I stopped letting anything get me down a long time ago. I just take things as they come and go with the flow. But, i've been lucky in life so it's hard for me to complain about anything. \n\nThankfully, i don't know what depression feels like. It sounds horrible and almost everyone i know has it. Which makes me sad. But overall, i'm a very happy person and i have arfid... so it's possible.",
      "created_utc": 1738046741.0,
      "score": 5,
      "context": []
    },
    {
      "id": "m9lhfip",
      "author": "Beef_Wagon",
      "body": "Yes! As another poster said, unfortunately it can be a lifelong affliction. Mine has “flares” so to speak. But I’m genuinely quite happy. I learn to live with it, and keep it in check when it threatens to make me very ill.",
      "created_utc": 1738045464.0,
      "score": 10,
      "context": []
    },
    {
      "id": "m9mi8e2",
      "author": "cupcake556",
      "body": "Omg I could’ve written this myself. Also neurodivergent. I’m in recovery but definitely close to relapsing for this exact same reason. I think for me anyway it’s the routine and feeling of achieving something when restricting. \n\nUr not alone OP 💜",
      "created_utc": 1738067002.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9mund6",
      "author": "cellalovesfrankie",
      "body": "My life is pretty good at the moment .. other than the ED ( and my chronic health stuff ) but I am basically happy despite it.",
      "created_utc": 1738071937.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ma7sm92",
      "author": "arabellaboobooo",
      "body": "i do not want to get better",
      "created_utc": 1738340303.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9pqmvu",
      "author": "Merlin509",
      "body": "My wife has been bulimic and on Prozac since she was 16.  She’s 54 now.  She still purges occasionally.  I have a hard time getting frequency out of her, but I think it’s around 3 times a month on average, based on conversations we’ve had.  That said, she lives a happy and normal life.  She’s active and at a healthy weight.  Her kids are 18 and 20 and well adjusted.  At this point she’s been purging for so long that she can easily do it without using her finger, so when she eats too much and/or is feeling “chubby”, as she puts it, she just goes to the bathroom, bends over, and out it comes.  It’s dysfunctional, I know.  Her sister is a psychiatrist specializing in eating disorders and I’ve talked to her about it, but she seems to let it slide.  After all this time, I think she’s resigned herself that her sister is functional and there’s nothing she can do.  I have some of my own issues around food that a specialist would likely consider dysfunctional, and I’m generally happy too.  We understand each other and sometimes tease about it to keep it light.  I ask her now and then how the purging is going and she says “it’s fine”.  I ask her to elaborate and she keeps it very vague.  My issues aren’t physically destructive, whereas hers I fear are.  We’ve talked about it and I’ve brought up my concerns many times, but she is unwilling or unable to change at this point, so I don’t know what else to do.  Stress is certainly a trigger for her (and me), and that affects her happiness far more than the ED, so our focus is on eliminating stress as much as possible.  It’s been this way as long as I’ve known her, so I don’t expect it to change.",
      "created_utc": 1738101677.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9q49yq",
      "author": "Grand_Pomegranate671",
      "body": "I used to think that happiness can exist despite my ED but now that I have healed I can see I was lying to myself. I didn't know true happiness until I experienced the freedom of not worrying about restricting.",
      "created_utc": 1738105700.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9rk5up",
      "author": "Harmonyinheart",
      "body": "I don’t think so if you are really stuck in it. Eventually it will not trigger the brain chemicals that make you feel good about the disordered eating and the ed will be in control by then and it will become the center of your life- over friends family jobs hobbies and definitely your happiness. That’s my opinion and I’ve been struggling for just over twenty five years. \nHowever I do agree with those who say they don’t need to be fully recovered to be happy. The more positive steps to recovery should empower you and give you a sense of confidence and strength ingredients necessary for happiness.",
      "created_utc": 1738122548.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9ta8h9",
      "author": "runninginbubbles",
      "body": "It's a delusional happy in a way but yeah, you can be I think. Who am I to tell someone they can't truly be happy?",
      "created_utc": 1738154709.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9tf03s",
      "author": "falsegodfan",
      "body": "you can have moments of happiness, just as anyone with a mental illness can but i truly don’t believe you can live a happy (and definitely not healthy) life with an ed. it’s such a miserable existence it’s not enjoyable to be so so hyper focused on your weight it makes you so insecure and self conscious. i personally would be very sad if i got to the end of my life and realised i spent all of it only ever caring about my weight and body",
      "created_utc": 1738156595.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9whkey",
      "author": "Ok_Let7248",
      "body": "I feel the same as you. Its possible to live free from some of the restriction you do you can drink boost or ensure if your really bad off, it saved me at my worst.\nTake in some carbs take in some protein even if you don't eat all the really buttery and desert ice cream, you can still enjoy yogurt or oatmeal or a low fat pudding you can have coconut water which I love and makes me feel really good the Body Armours are wut I really like. They setttle my stomach and believe it or not a RedBull in the morning always makes me feel really good too",
      "created_utc": 1738188199.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mak0ldu",
      "author": "Regular-Track-3745",
      "body": "This happens to me too (also on the spectrum). I despise my body so, so much and it gives me a sense of control.\n\nIk that seeing a psychiatrist can be a TON of money, but it was worth it for me in the end. Hopefully you can get the same closure I did.\n\nwishing you love OP ❤️",
      "created_utc": 1738505830.0,
      "score": 2,
      "context": []
    },
    {
      "id": "m9onrgz",
      "author": "nervous_veggie",
      "body": "You can feel Happiness to an extent, yeah, but you can’t properly ‘live’ with a serious eating disorder. They’re actively life shortening and life limiting. Even if you aren’t feeling the acute or immediate effect of malnutrition right now, you can’t run from the consequences forever.",
      "created_utc": 1738090970.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9l1oub",
      "author": "froghorn23",
      "body": "not ruly happy, no.",
      "created_utc": 1738038264.0,
      "score": 3,
      "context": []
    },
    {
      "id": "m9l2m8g",
      "author": "ExtraExpression876",
      "body": "I’m planning to see a psychiatrist once I get more income. Thank you so much",
      "created_utc": 1738038641.0,
      "score": 5,
      "context": [
        {
          "id": "m9l2icp",
          "author": "sage-green-lover",
          "body": "Absolutely. Through my eating disorder, I’ve often had periods of happiness and moments of joy. Life inherently has moments of negative and positive emotions. Our goal is to have more positives than negatives, and unfortunately I think we need to make recovery progress to have sustainable long term happiness. \n\nThat said, The goal of “100% recovery” can feel really daunting and out of reach. I know it is for me at least, and when loved ones tell me I can’t be happy until I’m 100% recovered, I feel frustrated and angry that my current progress isn’t recognized. I personally feel that any recovery progress is good progress, and you can set incremental goals. You can be happy in the depths of your ed and during recovery, but you probably can’t enjoy everything life has to offer while sick. \n\nHave you spoken to a psychiatrist or therapist? Sometimes we need a little boost to really enjoy all life has to offer outside of our ED. \n\nWishing you love ❤️",
          "created_utc": 1738038597.0
        }
      ]
    },
    {
      "id": "m9mia0h",
      "author": "ExtraExpression876",
      "body": "Thank you ❤️",
      "created_utc": 1738067022.0,
      "score": 1,
      "context": [
        {
          "id": "m9mi8e2",
          "author": "cupcake556",
          "body": "Omg I could’ve written this myself. Also neurodivergent. I’m in recovery but definitely close to relapsing for this exact same reason. I think for me anyway it’s the routine and feeling of achieving something when restricting. \n\nUr not alone OP 💜",
          "created_utc": 1738067002.0
        }
      ]
    },
    {
      "id": "mabeusi",
      "author": "ExtraExpression876",
      "body": "I get u girl 😪",
      "created_utc": 1738379784.0,
      "score": 1,
      "context": [
        {
          "id": "ma7sm92",
          "author": "arabellaboobooo",
          "body": "i do not want to get better",
          "created_utc": 1738340303.0
        }
      ]
    },
    {
      "id": "mak0nyp",
      "author": "ExtraExpression876",
      "body": "❤️",
      "created_utc": 1738505855.0,
      "score": 1,
      "context": [
        {
          "id": "mak0ldu",
          "author": "Regular-Track-3745",
          "body": "This happens to me too (also on the spectrum). I despise my body so, so much and it gives me a sense of control.\n\nIk that seeing a psychiatrist can be a TON of money, but it was worth it for me in the end. Hopefully you can get the same closure I did.\n\nwishing you love OP ❤️",
          "created_utc": 1738505830.0
        }
      ]
    }
  ]
}