{
  "id": "1icc3ka",
  "subreddit": "EatingDisorders",
  "author": "cucchiol8",
  "created_utc": 1738097818.0,
  "title": "Dating someone who might have an eating disorder",
  "selftext": "I think the guy I'm dating has an eating disorder - looking for advice\n\nI've been dating this guy and started noticing concerning patterns around food:\n\n- He has never once suggested going out for dinner or coffee dates\n- We only meet for walks in parks or at his place\n- When we rarely eat out, he has very small portions\n- I noticed him checking calories on ice cream\n- He always says he's \"already eaten\"\n- Interestingly, he cooks a lot for others\n- He said his parents are really fat different times \n- He doesn’t drink alcohol, eat anything sweet or coffee / he consider himself really healthy \n\nWhat makes this complicated:\n- We never had a typical dating/honeymoon phase because there were no normal food-related dating experiences\n- He's very sexually dominant and watches himself in mirrors during sex\n- He asks lots of questions about me but shares very little about himself\n- The relationship feels like it's stuck in this weird limbo\n\nI'm not sure what to do. I feel like I see this pattern clearly now and it's affecting how I feel about the relationship. Should I bring it up? Has anyone dealt with a similar situation? Any advice appreciated",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1icc3ka/dating_someone_who_might_have_an_eating_disorder/",
  "score": 56,
  "num_comments": 6,
  "comments": [
    {
      "id": "m9qsht5",
      "author": "Strawberry_fizzle",
      "body": "As someone who has struggled with an eating disorder in the past, this description really hits home for me. You can definitely ask him about it, but when you’re deep in it, you can become really defensive or the disorder can start to internalize voiced concerns as compliments in a weird way. Sometimes, an eating disorder convinces you that your behaviors are fine, or even what you truly want. I’m really sorry you’re going through this. I would suggest starting with small steps to bring it up to him gently, as it can be a sensitive topic.",
      "created_utc": 1738113305.0,
      "score": 58,
      "context": []
    },
    {
      "id": "m9w5xgm",
      "author": "None",
      "body": "It may be an eating disorder, it may not be, but he sounds like a controlling person to me because he doesn't share much about himself early in the relationship. The sexual dominance and watching himself in the mirror is also a bit of a red flag. Be careful and listen to your gut. He may not say much now because he's hiding a potential dark side, not just an eating disorder.",
      "created_utc": 1738185079.0,
      "score": 11,
      "context": []
    },
    {
      "id": "m9ypcfo",
      "author": "sxppholvr",
      "body": "i really think this might be something to confront him about. not directly but the fact that he doesn't share much about himself is enough to make me think you should ask him. not specifically if he has an ED but maybe just why he isnt willing to open up the same way be expects you to.",
      "created_utc": 1738214692.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9scihz",
      "author": "Hungry_Jello7495",
      "body": "Is he a Capricorn by chance",
      "created_utc": 1738135637.0,
      "score": -34,
      "context": []
    },
    {
      "id": "ma32jqx",
      "author": "Zitidoodle",
      "body": "I was thinking about this too!",
      "created_utc": 1738273207.0,
      "score": 3,
      "context": [
        {
          "id": "m9w5xgm",
          "author": "None",
          "body": "It may be an eating disorder, it may not be, but he sounds like a controlling person to me because he doesn't share much about himself early in the relationship. The sexual dominance and watching himself in the mirror is also a bit of a red flag. Be careful and listen to your gut. He may not say much now because he's hiding a potential dark side, not just an eating disorder.",
          "created_utc": 1738185079.0
        }
      ]
    },
    {
      "id": "m9w8okr",
      "author": "nanaiko_",
      "body": "Not the time. But I giggled 😔",
      "created_utc": 1738185814.0,
      "score": 7,
      "context": [
        {
          "id": "m9scihz",
          "author": "Hungry_Jello7495",
          "body": "Is he a Capricorn by chance",
          "created_utc": 1738135637.0
        }
      ]
    }
  ]
}