{
  "id": "1id3rpa",
  "subreddit": "EatingDisorders",
  "author": "Acrobatic_Sleep_2746",
  "created_utc": 1738182623.0,
  "title": "my best friend and I are in some kind of anorexia competition",
  "selftext": "So, for some backstory, my best friend and I are both girls and 15 years old. We became friends in 7th grade and we are now in 9th. She has been struggling with an eating disorder since like 6th grade, but I haven't. I just recently feel sick. I’m not diagnosed so I know I’m not valid, but my best friend knows I've been kind of struggling for a while. The thing is, while she said she 'doesn't want me to fall into that trap' it's like she's always subtly competing with me about who is more sick. She is into forced recovery and I’m not even noticeably sick, no one really knows how I struggle. Most of the things she talks about 24/7, is literally consequences of her ED. She complains allll day about how cold she is, how she has frostbites, how she had bald spots, and talks to anyone that will listen about them. It's like she wants attention so bad, except from her parents that are trying to help her recover. I know for a fact that she eats a fulfilling breakfast every day, but then at school she's acting all dizzy and shit, and when the teachers ask her if she has eaten anything, she'll say no. just for them to be worried. whenever I say I’m cold or anything like that, she always doubles down on me trying to act like she has it worse. she's showing me her frostbites at least 7 times a day and keeps bringing up every single consequence of an ED that apparently she has in a 'you could never struggle like me' manner, and I feel like she knows that I know its a side effect of anorexia. am I just delusional and the competence is one-sided or what? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1id3rpa/my_best_friend_and_i_are_in_some_kind_of_anorexia/",
  "score": 73,
  "num_comments": 28,
  "comments": [
    {
      "id": "ma02l6l",
      "author": "sLut_Red",
      "body": "It sounds as though she is trying to validate her own symptoms because she doesn't want to be in recovery. It may not be that she's competing, but repeating how she is feeling so that her own mind feels satisfied that she is still 'sick enough' \n\nAlternatively, she could be competing with you, that's something that is very common with eating disorders, they force you to compare to others. It can often come across as obnoxious or attention seeking \n\nHer being ill doesn't invalidate or dismiss you. \nYOU DO NOT HAVE TO LOOK SICK OR BE A CERTIAN WEIGHT TO BE ILL. please please remember that! You are sick at any weight, or stage of eating disorder, diagnosed or not. \n\nYou could let her know that the constant 'im this and you're not' 'youll never be like me' is actually just rude.\n Not the best advice but you could say that if she continues to be so flippant about recovery, that you'll take your concerns to her parents, because it's also not fair to them to be putting in the effort to help her and she's lying to them too. I'm only suggesting this because you're young enough that parents can make medical decisions",
      "created_utc": 1738241584.0,
      "score": 27,
      "context": []
    },
    {
      "id": "m9ykebt",
      "author": "Turbulent-Ability271",
      "body": "Just a heads up: Invalidating your friend's long-standing eating disorder is not going to validate your own ED. If you want help, perhaps be more open about it with people who can help. I'm sorry this sounds mean, it does sound like your really struggling right now and want some support. Asking for it is the first step.",
      "created_utc": 1738212563.0,
      "score": 60,
      "context": []
    },
    {
      "id": "ma4ckwh",
      "author": "bher_",
      "body": "wtf is she showing u when she shows u her “frostbites”??",
      "created_utc": 1738287383.0,
      "score": 7,
      "context": []
    },
    {
      "id": "m9zv9sh",
      "author": "None",
      "body": "I torally get the feeling! Omg my ex friend was like that too, she'd brag under the guise of venting. An is very competitive and you guys sound like you're making eachother worse. I dont think you are being fair to her either.\n\nWhat she says abt not falling into the trap sounds to me like genuine concern. As smn who's recovered and is healthy weight, i am not healthy, and i probably will never be. My bones are weak, my brain is slightly damaged. My life is pretty much ruined. I know i know, saying this wont help you recover, but the AN unicorn mindset is real and she might've meant not wanting you to suffer like her, whilst your deadly illness interpreted it like \"i'm sicker than you\".",
      "created_utc": 1738238332.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ma10uf5",
      "author": "nanaiko_",
      "body": "I think the both of you need to be more understanding",
      "created_utc": 1738252843.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ma1svx0",
      "author": "heartshappedglsses",
      "body": "i think y'all need space from each other, i was in a similar situation with my best friend in middle school and we took over a year break of being friends and freshman year we had both gotten better and became closer than ever. i know you must be feeling really lonely, but neither of y'all are in your right minds rn and it's probably best to take some time apart before y'all end up fully resenting one another or triggering each other further into the disorder",
      "created_utc": 1738260622.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ma4nwjx",
      "author": "choiceblue40s",
      "body": "Can you explain what frostbites even means 😭",
      "created_utc": 1738291187.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ma6f6e8",
      "author": "AkitoYaname",
      "body": "Dear, please, not being diagnosed doesn't make your own ED invalid. You have recognized you struggle with it, it IS valid. I'm sorry to say this, but this is not a friendship worth keeping. Her behaviour can drag you even deeper into it. Unless she is recovered/starting to get on the right path, you have to stay away from her, for your own mental and physical health.",
      "created_utc": 1738322527.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ma11jib",
      "author": "FriedLipstick",
      "body": "I don’t know know where you are and if you have access to helping sources but you both need help if you want to stay friends. \n\nAN is like a new identity to your friend, it almost sounds like a trait. And you both do trigger each other. AN is capable of driving you two far from each other. Also OP, you seem to be more introvert and therefore it’s possible you struggle in silence more than your friend. But please realise that AN is very mean and takes over our thoughts. It’s destructive in every way. \n\nI’m somewhat older and back in the days when my ED started, the doctor told me to not talk about it with the other girl who had this ED too. Because, as he said, the symptoms will be stronger when having ED related conversations. \n\nThis is what I mean by the statement you both need help if you want to stay friends. Try to talk to coaches, teachers, therapists, parents, doctors, just someone who can help you with this. You’re both so young and I know from when I had your age, in hindsight I know I couldn’t oversee all those consequences. And help from grown ups was very much needed. \n\nI hope you’ll recover both. I hope and wish that you both will grow into happy and joyful women. Bless you both♥️♥️",
      "created_utc": 1738253043.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ma1vpfi",
      "author": "ever-grown-oak",
      "body": "I think you need to set some boundaries with her! /Gen /na\n\nTell her that you understand her struggles, and that you are there for her, but also remind her that you're struggling too. You can still be her friend, and help her through this, but not want to hear her venting.\nAfter all, you can't help someone when you're hurting! \nExplain to her that her vents are causing your thoughts to distort, tell her how you feel in those moments, and tell her what you think would be best for the both of you.\nEDs are full of secrets, relationships can be ruined, and if you let this go on for longer, your friendship will turn into a competition. \nCommunication is key, she's your best friend, you both need to build your trust. \n\nYou -both- are suffering, not just her, not just you. You both are different people, you'll be different no matter what! But I do understand the distortions your mind is having.\n\nAnother point here,\nYou can eat three full meals a day and still have side effects!\nYou're depleting your body of necessary nutrients, and the main cause of dizziness is an iron deficiency, and you can be born with an iron deficiency and take supplements and STILL get dizzy. She probably isn't lying about that at all, and it will be a constant throughout her recovery.\nThis is a deadly sickness, and a lot of people who suffer from an ED, do not want to recover. As you know, it can be extremely hard to pull yourself out of the \"trap\".\nFollow her advice, don't fall into the trap, please reach out to someone to help yourself! Talk to someone you trust.\n\nShe has help from her parents, you need to focus on yourself before you'd be able to help her, going about it the way you are won't be good in the long run.\n\nI hope you both the best!",
      "created_utc": 1738261399.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ma1a40j",
      "author": "Joshua13298",
      "body": "Maybe she’s trying to show you how bad the side effects of AN are, so you as your friends said wouldn’t fall into that trap. \n\nThis also could just be the competitive side of Ed’s kicking in because like other people already said: it’s in the nature of eating disorders to compare yourself to others\n\nAnd last but not least please reach out for help because the longer you’re going through this the harder it is to recover. Sending much love to you and your friend❤️❤️❤️",
      "created_utc": 1738255459.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ma1sdgs",
      "author": "heartshappedglsses",
      "body": "i've played these games before 😓",
      "created_utc": 1738260479.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ma4g4uo",
      "author": "TallNPierced",
      "body": "I think the healthiest thing for both of you would be some space and time apart as well as a really good ED therapist.",
      "created_utc": 1738288568.0,
      "score": 1,
      "context": []
    },
    {
      "id": "m9yboja",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1738209165.0,
      "score": -2,
      "context": []
    },
    {
      "id": "ma49jmr",
      "author": "bher_",
      "body": "How is she invalidating it?",
      "created_utc": 1738286379.0,
      "score": 0,
      "context": [
        {
          "id": "m9ykebt",
          "author": "Turbulent-Ability271",
          "body": "Just a heads up: Invalidating your friend's long-standing eating disorder is not going to validate your own ED. If you want help, perhaps be more open about it with people who can help. I'm sorry this sounds mean, it does sound like your really struggling right now and want some support. Asking for it is the first step.",
          "created_utc": 1738212563.0
        }
      ]
    },
    {
      "id": "madd8yw",
      "author": "Acrobatic_Sleep_2746",
      "body": "her frostbites? what's difficult to understand lol. google frostbites on hands or something.her hands are constantly red, with blisters, swollen and very dry, due to blood circulation issues. but they're really not that noticeable alone, she just makes it a point to show them to me like 10 times a day for no reason",
      "created_utc": 1738415815.0,
      "score": 1,
      "context": [
        {
          "id": "ma4ckwh",
          "author": "bher_",
          "body": "wtf is she showing u when she shows u her “frostbites”??",
          "created_utc": 1738287383.0
        }
      ]
    },
    {
      "id": "ma433q3",
      "author": "ihateorangejuice",
      "body": "Would you think this is an unhealthy friendship? I might go so far as to say maybe they shouldn’t be friends anymore for each of their own’s sanity. But maybe that’s a harsh take idk.",
      "created_utc": 1738284276.0,
      "score": 3,
      "context": [
        {
          "id": "ma10uf5",
          "author": "nanaiko_",
          "body": "I think the both of you need to be more understanding",
          "created_utc": 1738252843.0
        }
      ]
    },
    {
      "id": "maddilv",
      "author": "Acrobatic_Sleep_2746",
      "body": "its when blood circulation isn't good in your body (could happen by many things, but its mainly because of the cold, and its pretty common in people with low body fat percentage etc.) so your hands and feet are red, dry, swollen, a little purple and have blisters.",
      "created_utc": 1738415927.0,
      "score": 1,
      "context": [
        {
          "id": "ma4nwjx",
          "author": "choiceblue40s",
          "body": "Can you explain what frostbites even means 😭",
          "created_utc": 1738291187.0
        }
      ]
    },
    {
      "id": "maddtm2",
      "author": "Acrobatic_Sleep_2746",
      "body": "she's not really iron deficient anymore, she takes supplements and her blood tests show it to be normal, but I get what you mean and thank you for the advice",
      "created_utc": 1738416057.0,
      "score": 2,
      "context": [
        {
          "id": "ma1vpfi",
          "author": "ever-grown-oak",
          "body": "I think you need to set some boundaries with her! /Gen /na\n\nTell her that you understand her struggles, and that you are there for her, but also remind her that you're struggling too. You can still be her friend, and help her through this, but not want to hear her venting.\nAfter all, you can't help someone when you're hurting! \nExplain to her that her vents are causing your thoughts to distort, tell her how you feel in those moments, and tell her what you think would be best for the both of you.\nEDs are full of secrets, relationships can be ruined, and if you let this go on for longer, your friendship will turn into a competition. \nCommunication is key, she's your best friend, you both need to build your trust. \n\nYou -both- are suffering, not just her, not just you. You both are different people, you'll be different no matter what! But I do understand the distortions your mind is having.\n\nAnother point here,\nYou can eat three full meals a day and still have side effects!\nYou're depleting your body of necessary nutrients, and the main cause of dizziness is an iron deficiency, and you can be born with an iron deficiency and take supplements and STILL get dizzy. She probably isn't lying about that at all, and it will be a constant throughout her recovery.\nThis is a deadly sickness, and a lot of people who suffer from an ED, do not want to recover. As you know, it can be extremely hard to pull yourself out of the \"trap\".\nFollow her advice, don't fall into the trap, please reach out to someone to help yourself! Talk to someone you trust.\n\nShe has help from her parents, you need to focus on yourself before you'd be able to help her, going about it the way you are won't be good in the long run.\n\nI hope you both the best!",
          "created_utc": 1738261399.0
        }
      ]
    },
    {
      "id": "m9yh29k",
      "author": "angelwuppy",
      "body": "wow, you sound like a great friend. do you want an award?",
      "created_utc": 1738211222.0,
      "score": -1,
      "context": [
        {
          "id": "m9yboja",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1738209165.0
        }
      ]
    },
    {
      "id": "ma53ay8",
      "author": "Turbulent-Ability271",
      "body": "Saying her behaviour is for attention. That she's exaggerating her symptoms. That she is lying about restricting. This is invalidating a person's experience of their own disorder. Her friend may be acting strangely and be very frustrating at times but people with mental illness can act in strange ways when they are trying to get their needs met. That doesn't make them attention seeking. They are looking for connection, support and nurturing.",
      "created_utc": 1738296748.0,
      "score": 14,
      "context": [
        {
          "id": "m9ykebt",
          "author": "Turbulent-Ability271",
          "body": "Just a heads up: Invalidating your friend's long-standing eating disorder is not going to validate your own ED. If you want help, perhaps be more open about it with people who can help. I'm sorry this sounds mean, it does sound like your really struggling right now and want some support. Asking for it is the first step.",
          "created_utc": 1738212563.0
        },
        {
          "id": "ma49jmr",
          "author": "bher_",
          "body": "How is she invalidating it?",
          "created_utc": 1738286379.0
        }
      ]
    },
    {
      "id": "maiipxt",
      "author": "bher_",
      "body": "It’s called frostbite not frostbites. And u can’t get it from being cold from under eating u get it from exposure to extreme cold temperatures. I don’t know what she has but it’s not frostbite.",
      "created_utc": 1738477771.0,
      "score": 2,
      "context": [
        {
          "id": "ma4ckwh",
          "author": "bher_",
          "body": "wtf is she showing u when she shows u her “frostbites”??",
          "created_utc": 1738287383.0
        },
        {
          "id": "madd8yw",
          "author": "Acrobatic_Sleep_2746",
          "body": "her frostbites? what's difficult to understand lol. google frostbites on hands or something.her hands are constantly red, with blisters, swollen and very dry, due to blood circulation issues. but they're really not that noticeable alone, she just makes it a point to show them to me like 10 times a day for no reason",
          "created_utc": 1738415815.0
        }
      ]
    },
    {
      "id": "ma44877",
      "author": "nanaiko_",
      "body": "I think their friendship is fixable, but their disorders are causing them to be blinded",
      "created_utc": 1738284635.0,
      "score": 4,
      "context": [
        {
          "id": "ma10uf5",
          "author": "nanaiko_",
          "body": "I think the both of you need to be more understanding",
          "created_utc": 1738252843.0
        },
        {
          "id": "ma433q3",
          "author": "ihateorangejuice",
          "body": "Would you think this is an unhealthy friendship? I might go so far as to say maybe they shouldn’t be friends anymore for each of their own’s sanity. But maybe that’s a harsh take idk.",
          "created_utc": 1738284276.0
        }
      ]
    },
    {
      "id": "madc5jv",
      "author": "Acrobatic_Sleep_2746",
      "body": "normally id agree with you and I know that I sound like I’m invalidating her, but I KNOW her and she openly admits to me things. for example, when I said she will lie about not having eaten for attention, I KNOW its true because 1. she tells me about her meals and all those times she lied, were days that she had told me she had eaten breakfast during a conversation. 2. her mom would 1000% absolutely never let her go to school without her having eaten. So please stop assuming things, I know my best friend, i know when she's struggling and I know when she's seeking attention. Plus, I think id understand it if she felt like she was going to faint. When she's literally acting like a puppy all day full if energy, be for real.",
      "created_utc": 1738415352.0,
      "score": 1,
      "context": [
        {
          "id": "m9ykebt",
          "author": "Turbulent-Ability271",
          "body": "Just a heads up: Invalidating your friend's long-standing eating disorder is not going to validate your own ED. If you want help, perhaps be more open about it with people who can help. I'm sorry this sounds mean, it does sound like your really struggling right now and want some support. Asking for it is the first step.",
          "created_utc": 1738212563.0
        },
        {
          "id": "ma49jmr",
          "author": "bher_",
          "body": "How is she invalidating it?",
          "created_utc": 1738286379.0
        },
        {
          "id": "ma53ay8",
          "author": "Turbulent-Ability271",
          "body": "Saying her behaviour is for attention. That she's exaggerating her symptoms. That she is lying about restricting. This is invalidating a person's experience of their own disorder. Her friend may be acting strangely and be very frustrating at times but people with mental illness can act in strange ways when they are trying to get their needs met. That doesn't make them attention seeking. They are looking for connection, support and nurturing.",
          "created_utc": 1738296748.0
        }
      ]
    },
    {
      "id": "maq0xy9",
      "author": "Acrobatic_Sleep_2746",
      "body": "girl first of all I said frostbites in PLURAL because she has on both hands. 2nd, when blood isn't properly running in parts of your body, they become extremely cold, and thats how a frostbite is created, the weather doesn't need to be extremely cold for this to happen.",
      "created_utc": 1738583579.0,
      "score": 0,
      "context": [
        {
          "id": "ma4ckwh",
          "author": "bher_",
          "body": "wtf is she showing u when she shows u her “frostbites”??",
          "created_utc": 1738287383.0
        },
        {
          "id": "madd8yw",
          "author": "Acrobatic_Sleep_2746",
          "body": "her frostbites? what's difficult to understand lol. google frostbites on hands or something.her hands are constantly red, with blisters, swollen and very dry, due to blood circulation issues. but they're really not that noticeable alone, she just makes it a point to show them to me like 10 times a day for no reason",
          "created_utc": 1738415815.0
        },
        {
          "id": "maiipxt",
          "author": "bher_",
          "body": "It’s called frostbite not frostbites. And u can’t get it from being cold from under eating u get it from exposure to extreme cold temperatures. I don’t know what she has but it’s not frostbite.",
          "created_utc": 1738477771.0
        }
      ]
    },
    {
      "id": "magc2au",
      "author": "Turbulent-Ability271",
      "body": "I hear and understand your perspective and how frustrating this must be for you. Have you talked to her about this? It sounds like it's getting in the way of your friendship. It could simply be a matter of stating what you observe without adding what you concluded. Ie. \"I heard you say that you'd eaten at home and now I'm hearing that you haven't. I am curious as to why I'm hearing two different things and how I can support you as your best friend.\" There's no blame, no accuations of attention seeking, just being curious and opening a door to better communication. I know I would want my best friend to be open with me and avoid harsh judgements about my behaviour.",
      "created_utc": 1738449605.0,
      "score": 3,
      "context": [
        {
          "id": "m9ykebt",
          "author": "Turbulent-Ability271",
          "body": "Just a heads up: Invalidating your friend's long-standing eating disorder is not going to validate your own ED. If you want help, perhaps be more open about it with people who can help. I'm sorry this sounds mean, it does sound like your really struggling right now and want some support. Asking for it is the first step.",
          "created_utc": 1738212563.0
        },
        {
          "id": "ma49jmr",
          "author": "bher_",
          "body": "How is she invalidating it?",
          "created_utc": 1738286379.0
        },
        {
          "id": "ma53ay8",
          "author": "Turbulent-Ability271",
          "body": "Saying her behaviour is for attention. That she's exaggerating her symptoms. That she is lying about restricting. This is invalidating a person's experience of their own disorder. Her friend may be acting strangely and be very frustrating at times but people with mental illness can act in strange ways when they are trying to get their needs met. That doesn't make them attention seeking. They are looking for connection, support and nurturing.",
          "created_utc": 1738296748.0
        },
        {
          "id": "madc5jv",
          "author": "Acrobatic_Sleep_2746",
          "body": "normally id agree with you and I know that I sound like I’m invalidating her, but I KNOW her and she openly admits to me things. for example, when I said she will lie about not having eaten for attention, I KNOW its true because 1. she tells me about her meals and all those times she lied, were days that she had told me she had eaten breakfast during a conversation. 2. her mom would 1000% absolutely never let her go to school without her having eaten. So please stop assuming things, I know my best friend, i know when she's struggling and I know when she's seeking attention. Plus, I think id understand it if she felt like she was going to faint. When she's literally acting like a puppy all day full if energy, be for real.",
          "created_utc": 1738415352.0
        }
      ]
    },
    {
      "id": "mauy95j",
      "author": "bher_",
      "body": "It would still be called frostbite even if on both hands and no u can’t get it from incorrect blood flow u can only get it from freezing temperatures outside the body. Ur friend is making stuff up just google it.",
      "created_utc": 1738638288.0,
      "score": 1,
      "context": [
        {
          "id": "ma4ckwh",
          "author": "bher_",
          "body": "wtf is she showing u when she shows u her “frostbites”??",
          "created_utc": 1738287383.0
        },
        {
          "id": "madd8yw",
          "author": "Acrobatic_Sleep_2746",
          "body": "her frostbites? what's difficult to understand lol. google frostbites on hands or something.her hands are constantly red, with blisters, swollen and very dry, due to blood circulation issues. but they're really not that noticeable alone, she just makes it a point to show them to me like 10 times a day for no reason",
          "created_utc": 1738415815.0
        },
        {
          "id": "maiipxt",
          "author": "bher_",
          "body": "It’s called frostbite not frostbites. And u can’t get it from being cold from under eating u get it from exposure to extreme cold temperatures. I don’t know what she has but it’s not frostbite.",
          "created_utc": 1738477771.0
        },
        {
          "id": "maq0xy9",
          "author": "Acrobatic_Sleep_2746",
          "body": "girl first of all I said frostbites in PLURAL because she has on both hands. 2nd, when blood isn't properly running in parts of your body, they become extremely cold, and thats how a frostbite is created, the weather doesn't need to be extremely cold for this to happen.",
          "created_utc": 1738583579.0
        }
      ]
    },
    {
      "id": "maq1au8",
      "author": "Acrobatic_Sleep_2746",
      "body": "yes that's what I normally would do, but honestly this girl feels attacked when I mention things like these. if I tell her like 'hey, you're telling people you haven't eaten when in fact you have, what's up with that\" she will get really defensive and act like I’m attacking her, when really I’m just trying to understand why she feels the need to do that. but thanks for the advice anyway.",
      "created_utc": 1738583761.0,
      "score": 1,
      "context": [
        {
          "id": "m9ykebt",
          "author": "Turbulent-Ability271",
          "body": "Just a heads up: Invalidating your friend's long-standing eating disorder is not going to validate your own ED. If you want help, perhaps be more open about it with people who can help. I'm sorry this sounds mean, it does sound like your really struggling right now and want some support. Asking for it is the first step.",
          "created_utc": 1738212563.0
        },
        {
          "id": "ma49jmr",
          "author": "bher_",
          "body": "How is she invalidating it?",
          "created_utc": 1738286379.0
        },
        {
          "id": "ma53ay8",
          "author": "Turbulent-Ability271",
          "body": "Saying her behaviour is for attention. That she's exaggerating her symptoms. That she is lying about restricting. This is invalidating a person's experience of their own disorder. Her friend may be acting strangely and be very frustrating at times but people with mental illness can act in strange ways when they are trying to get their needs met. That doesn't make them attention seeking. They are looking for connection, support and nurturing.",
          "created_utc": 1738296748.0
        },
        {
          "id": "madc5jv",
          "author": "Acrobatic_Sleep_2746",
          "body": "normally id agree with you and I know that I sound like I’m invalidating her, but I KNOW her and she openly admits to me things. for example, when I said she will lie about not having eaten for attention, I KNOW its true because 1. she tells me about her meals and all those times she lied, were days that she had told me she had eaten breakfast during a conversation. 2. her mom would 1000% absolutely never let her go to school without her having eaten. So please stop assuming things, I know my best friend, i know when she's struggling and I know when she's seeking attention. Plus, I think id understand it if she felt like she was going to faint. When she's literally acting like a puppy all day full if energy, be for real.",
          "created_utc": 1738415352.0
        },
        {
          "id": "magc2au",
          "author": "Turbulent-Ability271",
          "body": "I hear and understand your perspective and how frustrating this must be for you. Have you talked to her about this? It sounds like it's getting in the way of your friendship. It could simply be a matter of stating what you observe without adding what you concluded. Ie. \"I heard you say that you'd eaten at home and now I'm hearing that you haven't. I am curious as to why I'm hearing two different things and how I can support you as your best friend.\" There's no blame, no accuations of attention seeking, just being curious and opening a door to better communication. I know I would want my best friend to be open with me and avoid harsh judgements about my behaviour.",
          "created_utc": 1738449605.0
        }
      ]
    },
    {
      "id": "masa1t9",
      "author": "Turbulent-Ability271",
      "body": "Oh, that's really tough. And it's so frustrating. It sounds like she isn't ready to face whatever is going on internally. I guess all you can do is take care of you and protect yourself as best you can. I'm sorry I couldn't ve of more help",
      "created_utc": 1738609613.0,
      "score": 2,
      "context": [
        {
          "id": "m9ykebt",
          "author": "Turbulent-Ability271",
          "body": "Just a heads up: Invalidating your friend's long-standing eating disorder is not going to validate your own ED. If you want help, perhaps be more open about it with people who can help. I'm sorry this sounds mean, it does sound like your really struggling right now and want some support. Asking for it is the first step.",
          "created_utc": 1738212563.0
        },
        {
          "id": "ma49jmr",
          "author": "bher_",
          "body": "How is she invalidating it?",
          "created_utc": 1738286379.0
        },
        {
          "id": "ma53ay8",
          "author": "Turbulent-Ability271",
          "body": "Saying her behaviour is for attention. That she's exaggerating her symptoms. That she is lying about restricting. This is invalidating a person's experience of their own disorder. Her friend may be acting strangely and be very frustrating at times but people with mental illness can act in strange ways when they are trying to get their needs met. That doesn't make them attention seeking. They are looking for connection, support and nurturing.",
          "created_utc": 1738296748.0
        },
        {
          "id": "madc5jv",
          "author": "Acrobatic_Sleep_2746",
          "body": "normally id agree with you and I know that I sound like I’m invalidating her, but I KNOW her and she openly admits to me things. for example, when I said she will lie about not having eaten for attention, I KNOW its true because 1. she tells me about her meals and all those times she lied, were days that she had told me she had eaten breakfast during a conversation. 2. her mom would 1000% absolutely never let her go to school without her having eaten. So please stop assuming things, I know my best friend, i know when she's struggling and I know when she's seeking attention. Plus, I think id understand it if she felt like she was going to faint. When she's literally acting like a puppy all day full if energy, be for real.",
          "created_utc": 1738415352.0
        },
        {
          "id": "magc2au",
          "author": "Turbulent-Ability271",
          "body": "I hear and understand your perspective and how frustrating this must be for you. Have you talked to her about this? It sounds like it's getting in the way of your friendship. It could simply be a matter of stating what you observe without adding what you concluded. Ie. \"I heard you say that you'd eaten at home and now I'm hearing that you haven't. I am curious as to why I'm hearing two different things and how I can support you as your best friend.\" There's no blame, no accuations of attention seeking, just being curious and opening a door to better communication. I know I would want my best friend to be open with me and avoid harsh judgements about my behaviour.",
          "created_utc": 1738449605.0
        },
        {
          "id": "maq1au8",
          "author": "Acrobatic_Sleep_2746",
          "body": "yes that's what I normally would do, but honestly this girl feels attacked when I mention things like these. if I tell her like 'hey, you're telling people you haven't eaten when in fact you have, what's up with that\" she will get really defensive and act like I’m attacking her, when really I’m just trying to understand why she feels the need to do that. but thanks for the advice anyway.",
          "created_utc": 1738583761.0
        }
      ]
    }
  ]
}