{
  "id": "1ij8ga2",
  "subreddit": "EatingDisorders",
  "author": "North_Assumption_499",
  "created_utc": 1738863842.0,
  "title": "Does Anyone Else Feel Too Old to Have an ED?",
  "selftext": "I turned 27 a few months ago, and I've been relapsing on and off with my restricting for a little while. When I read posts and watch videos about other people struggling, I feel like they're almost always in high school and maybe early college (so early 20s at the oldest). I feel like I don't see a lot of people closer to my age and older talking about their struggles, and I feel kind of embarrassed in a way. I know it's silly and mental disorders don't discriminate by age, but it feels like I'm too old to be struggling with this, so as a result I don't really like bringing it up to the people that I know in real life when I am having rough moments. Anyone else relate? How do you cope with it? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1ij8ga2/does_anyone_else_feel_too_old_to_have_an_ed/",
  "score": 77,
  "num_comments": 59,
  "comments": [
    {
      "id": "mbf3mn6",
      "author": "alienprincess111",
      "body": "Yes, me.  I am 40 yo and have been struggling for almost 27 years. There are lots of older people like me out there, sadly. There's am r/eatingdisordersover30 sub.\n\nHow to cope with it? One day at a time, I guess.  I have come to terms with the fact that I will never fully recover.",
      "created_utc": 1738899404.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mbg0lko",
      "author": "FloridaMomm",
      "body": "My husband had disordered eating his whole life but it ramped up and got SUPER bad around 29. Diagnosed with anorexia at 29 and entered IOP. He was really anxious for group at first because he had this idea that this was a diagnosis for teenage girls and he didn’t belong. And although it is primarily young women in his IOP, there have been tons of people in their 20s to 30s, older people (40+), and men, and the demographics of the people in group have turned out to not actually stress him out that much\n\nIn one of my family support groups there is a woman who is devastated her sister is relapsing really badly (hospitalized) and both of them are late sixties. I will admit I was shocked at that one, but I shouldn’t be. EDs don’t magically go away with age",
      "created_utc": 1738914406.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mbfi512",
      "author": "MoulinSarah",
      "body": "I’m 41, so no. lol",
      "created_utc": 1738905025.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mbg3rfc",
      "author": "prettysickchick",
      "body": "I’m about to turn 55 lol.  Started at 12.  I think it’s like any addiction.  It’s a lifelong struggle.",
      "created_utc": 1738916284.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mbgimo0",
      "author": "HansKolpinghuis",
      "body": "33 years old man, and just recovered from bulimia/BED after 8 months of therapy. Never too old to have it, but never too old to seek help and recover either!!",
      "created_utc": 1738925420.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mbfoe6i",
      "author": "Silvesa8686",
      "body": "I had really bad anorexia in college. I quasi recovered. I was forced to gain weight in order to do a semester abroad in Spain. I’m 38 now and I still struggle, sometimes. I basically feel like there’s no one I can really talk to about it. My friends are mostly overweight so saying anything seems like I’m putting them down.",
      "created_utc": 1738907816.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mbfhet0",
      "author": "Trick_Device6288",
      "body": "I'm also 27! And have only been in recovery for a year. I still struggle with disordered thinking around food, im sure i will for a long time. I think one of the issues is that having a sense of control over diets is so normalised - I'd bet there are so many people struggling who are not ready to come to terms with the fact that they are struggling - either because they don't know/consider that they need help, or out of the fear that recovery could generate for them.\nI personally have friends who I'm sure are struggling, who obsess over their appearances and calories, but would never consider themselves to have an eating disorder. \nAll you can do is try your best and show up for yourself, I've found seeing a dietician much less isolating, and being open about it with a few friends. Good luck to you!!",
      "created_utc": 1738904711.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbfxyef",
      "author": "bpa23",
      "body": "Hello I'm 29 and I also feel too old for this silliness but here we are",
      "created_utc": 1738912857.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbh02s6",
      "author": "Odd_Theme_3294",
      "body": "I think it may be as we get older we stop posting about it. And that’s why it seems like there are less of us.\n\nBecause when you see pro ana accounts on tiktok or recovery accounts they’re all 13-18 (the occasional 20-24).\n\nBut obviously those of us in our 20s still have EDs I think we just have lives and have to work do jobs so we can’t focus entirely on recovery or post about it online.",
      "created_utc": 1738933717.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbfuowd",
      "author": "Stingwing4oba",
      "body": "I do feel too old to have one, but the reality is I do :(\n\n(I turn 40 next month)",
      "created_utc": 1738911044.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbg6hg3",
      "author": "LunarCookie137",
      "body": "Im 24, and feel old...\n\n\nI still struggle a lot with my eating disorder, but not just the mental side.\n\n\nBecause of how and what I ate for so long, my insides seem to have tightened a lot. I am unable to binge the way I used to, because it just doesn't fit anymore (yes, I relapsed a few times, that's why I know), and now I've learned that if I were to eat enough for the day, I'd be so uncomfortable physically, it'd be hard to move. But if I don't eat enough, it's extremely tiring to move. And my mood is completely messed up.\n\n\nMentally, I'm glad the need to feel good is stronger than the need to be skinny, but once I forget I feel good because I ate enough, I start immediately starving myself again, because I feel good enough to do so...\n\n\nEating disorders are irrational at times, and I feel that's also the case for me.",
      "created_utc": 1738917967.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbgtlgr",
      "author": "Forever_Alone51023",
      "body": "I think I got ya all \"beat\" (I'm not talking about THOSE numbers haha)...well most of you.\n\n\nI'm turning 54 in about 2 weeks. Relapsing hard. The doctor will not be pleased. 🥺",
      "created_utc": 1738931031.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbgwflh",
      "author": "TangerineDecent22",
      "body": "Girl. I'm 40 and only recovered in the last year. Had an ED for 20 years",
      "created_utc": 1738932250.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbh4f8w",
      "author": "RisingPhoenix603",
      "body": "I’m 51 and have Anorexia.",
      "created_utc": 1738935331.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbh61qp",
      "author": "SillyBunny77",
      "body": "The sad truth is that people just get used to living with their ED at some point, there's people in their 60s, 70s, who never got any treatment.\n\nEDs tend to start around teenage years because young people often feel extremely pressured to look good and fit in, but chances of the ED being caught are also higher at that age because of parents, teachers, etc potentially noticing it and pushing the person to get treatment, once you pass that age without treatment it can go unnoticed for decades sadly",
      "created_utc": 1738935915.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbhkrb7",
      "author": "Thischickagain1",
      "body": "Nobody is too old to have an ED. Old people develop them a lot unintentionally. My great grandmother had dementia and forgot to eat a lot afterwards. She used to be a big woman and she got down to 90 something pounds. We helped her the best we could but she succumbed to the dementia after a while. \n\nMy point is its nothing to be ashamed of. Its a disorder that can happen to anyone at any time for any reason. \n\nJust focus on bettering your health because you matter and deserve to live a long prosperous life 🙂",
      "created_utc": 1738940793.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbhnb2d",
      "author": "EmLee-96",
      "body": "Hi! I just sought treatment at 28 for mine (not full blown disorder but dangerously close as I was starting to show symptoms). It probably developed in my late teens/early 20s. I was stuck in a restriction/then eating very little/feeling guilt/restrict again. You aren't alone!",
      "created_utc": 1738941569.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbihuu9",
      "author": "beans1694",
      "body": "I'm also 27 and I've been struggling with my eating disorder since high school. I've been in recovery since I was 19, but I still have days that are difficult. \n\nPersonally, I see it as a condition you live with but learn to manage over time, just like my bipolar disorder and adhd since they all go hand in hand. \n\nWhat helps is remembering that my ED is a symptom of my other mental illnesses. So if I'm properly managing my mental health I feel more in control if that makes any sense. \n\nI promise you're not alone ♥️",
      "created_utc": 1738950287.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbis5ia",
      "author": "Subject-Geologist863",
      "body": "I’m 17 but I dont think you’re too old. I feel like I’ll probably still have one at 27 ://",
      "created_utc": 1738953213.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbls9jc",
      "author": "NerdyGran",
      "body": "It's my birthday, I'm 48 😪. Today will be hard, family around for lunch, being watched, cake = not a good combination for me",
      "created_utc": 1738987437.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbqcue2",
      "author": "pipsqueak_pixie",
      "body": "Honestly, I see this question posted pretty routinely, and I just don't understand it. Why would it have an age limit? It's a mental health issue.\n\nIt reminds me of the outdated understanding of ADHD - EDs are not just for young women as much as ADHD is not just for little boys. I know your post didn't mention gender, but this is the common trope/ stereotype.\n\nI've had an eating disorder for over 20 years, and it's waxed and waned over time, but never completely left and it ever will. I can only speak from my own experience, but for me, it's a way of thinking about things and a toxic coping mechanism (often a little sadistic voice/ influence) that will always be there in some kind of way. All I can do is manage it.\n\nOver time we learn coping mechanisms and how to deal with it better, some of us never participating actively in these ED behaviours again. This can give the appearance of 'growing out of it' I'm sure. However, in my humble opinion, there's always going to be risk because it's never truly gone. This is why we are \"in recovery\" forever afterwards and tend to relapse in times of stress. It's a mental health disorder, and you don't just grow out of those, unfortunately. \n\nThis is just my 2 cents, and I don't mean to offend anyone with different viewpoints. All I'm trying to say is, I see this question posted all the time, and it's always got many of us that are 30+. Please do not feel like you should feel ashamed, childish/immature, or an outsider. Many, many people who are older sadly still suffer with this. Honestly, just think about how many baby boomer generation women have a questionable approach to food. Those grown women in the wellness industry that are clearly restricting unhealthily. Im sure we all know at least one. Be kind to yourself and remember that it's a mental health condition that you will simply need to monitor throughout your life. Just the same as someone with anxiety, depression, or any other mental health condition does.",
      "created_utc": 1739051551.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbxtb84",
      "author": "FunkyBrewstr",
      "body": "Yes. I’ve had mine for over thirty years. It’s exhausting.",
      "created_utc": 1739149501.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mc1byn7",
      "author": "TheWinterComet",
      "body": "43 here and feel so isolated in my struggles.",
      "created_utc": 1739204832.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mcjcy45",
      "author": "Rafa_Fan",
      "body": "Nearly 67 and feel pretty ashamed. Started as a teenager.",
      "created_utc": 1739448761.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbg3ymn",
      "author": "Jazzlike-Walrus1467",
      "body": "Yes. 26 here. I feel embarrassed by it a lot because I feel maybe it’s really immature of me. Plus I hate that people often feel like they have to help me. I don’t want to be a problem and someone that people look the other way when they see. But no matter what I try, I cannot shake that ED voice 😩",
      "created_utc": 1738916403.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbh9c31",
      "author": "universe93",
      "body": "r/eatingdisordersover30",
      "created_utc": 1738937063.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbhdc2f",
      "author": "None",
      "body": "I’m 30. Mine has improved a lot but there’s still that fear of gaining weight. I never received professional help so some habits just don’t die.",
      "created_utc": 1738938411.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbhenxj",
      "author": "Global_Emphasis5786",
      "body": "I've seen patients in the hospital upwards of 50 with an eating disorder. Unfortunately we don't just age out of it. That being said, sometimes I feel like I should have. I'm 22, but I feel like it was something for middle school me and high school me, not adult me. Yet I'm still here, going to treatment that I'm currently resistant to every other week.",
      "created_utc": 1738938848.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbhsnkh",
      "author": "ForYourEyesOnly28",
      "body": "At 39 I feel the same way!!!",
      "created_utc": 1738943138.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbhsrqw",
      "author": "MoominLenka",
      "body": "I'm turning 38 this year, and I too still struggle. I think that most of us from the older generations doesn't have the same shylessness (word???🙈😂) as the younger people have today. We've been there, and done that. And I think that many of us have somehow acknowledged that we properbly have to fight this the rest of our lifes. As young I sought others with similar disorders, to somehow not feel so wrong in my behaviors, but now being older, most of my ed-companions have moved on with their lives, started families and carriers, and let go of their eds. Not all have, as me, we just suffer in silent, in a way. I don't feel the same urge to connect and spare knowledge with other Ed-suffers as I used to, maybe because I've accepted this chronic disorder, and found peace with that🤔.. But I really don't know. Maybe it's just because I really do feel old in the same space with all those young people with eds 🤷🏻‍♀️🤔🙈✌🏻✨🩷🫂",
      "created_utc": 1738943173.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbhvxhv",
      "author": "VelvetAnemome",
      "body": "I do, I was thinking about it yesterday and this morning. I feel like \"I am embarrassed for being a grown up and still behave this way\" even though I know it is a stupid thought but I still want to be better than anyone else so no kindness for me 🤣 (of course I try to not agree with the part of me that thinks that, not always succeed though...)",
      "created_utc": 1738944079.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbj504u",
      "author": "acapr_11",
      "body": "There's an eating disorders over 30 community u might like. I know you aren't 30, but it might make you feel more cmfortable and seen. I'm 17 so I haven't contributed but I have read through it and seen some nice posts",
      "created_utc": 1738956873.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbj84k9",
      "author": "gringaalta",
      "body": "In my in person ED group, there are regulars who are 34, 45, and even 70.",
      "created_utc": 1738957772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbknl9g",
      "author": "No-Investigator-8007",
      "body": "I'm 28 and just graduated treatment a few months ago. I had the same feelings of being too old, but you're never too old to help yourself and work on recovery :)",
      "created_utc": 1738973301.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbl9rms",
      "author": "gogopicomantv",
      "body": "you're never too old for anything. fuck everybody that dont think this way",
      "created_utc": 1738980718.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbli2ub",
      "author": "HoneyBadgerQueen2000",
      "body": "25. Mine started at 18. I thought I was recovering throughout last year but as soon as I turned 25 the thoughts and feelings started coming back. This time it feels weird, different. Like I'm taking a beacting after my body is already recovering from the last one.",
      "created_utc": 1738983642.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mblk18e",
      "author": "Polkadotsdesign",
      "body": "I'm 26 and struggling with it too. It's almost jarring how different it feels to relapsed after so many years. And who i could even talk to reasonably without feeling crazier than back then :/",
      "created_utc": 1738984334.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mblnjt4",
      "author": "Dogplantmom97",
      "body": "Also 27✌🏻\n\nI’m having a hard time rn too",
      "created_utc": 1738985628.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbm9un0",
      "author": "Organic_Werewolf_317",
      "body": "I just turned 27 and feel the same. It’s been more than half my life now. I first went to treatment 4 years ago. I have to continually remind myself that recovery is not linear because I get so defeated sometimes.",
      "created_utc": 1738995294.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbmm57o",
      "author": "AstirdLevenson",
      "body": "Frighteningly accurate timing. Literally had a crying breakdown tonight and told my partner I am too old for this. I'm 34 and have been weight restored for 4 years but am still so fixated on body image. Looking for specialists now and it's so hard to find a therapist on my insurance. Rooting for ya, you're not alone 💜",
      "created_utc": 1739002185.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbni25q",
      "author": "cellalovesfrankie",
      "body": "I’m nearly 40 and still struggle. Looks difffrrnt than it did 10 years ago. But it’s still there",
      "created_utc": 1739019989.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbqla39",
      "author": "Suspicious-Baker9862",
      "body": "Im 51 and I have an ed",
      "created_utc": 1739054188.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbqoujy",
      "author": "oogabooga1967",
      "body": "I was 52 when I finally got intensive outpatient treatment for my ED. In my group, there were all ages, from 18 to 60.",
      "created_utc": 1739055318.0,
      "score": 1,
      "context": []
    },
    {
      "id": "md6hjtz",
      "author": "Accurate-Grocery-639",
      "body": "I suspect because there is less supervision by parents and peers and teachers.. if someone develops agoraphobia, works from home or of disability or even manages to function in a workplace environment  by retaining just enough weight there really is very little reason for any outside interest - as harsh as that sounds - i think many people would ignore a grown up person in the supermarket even if they’re quite thin",
      "created_utc": 1739758026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2mu1ev",
      "author": "Shoddy-Repair8957",
      "body": "I am 58. I've been struggling with restrictive ED for 50 years.",
      "created_utc": 1752273966.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2mujfw",
      "author": "Shoddy-Repair8957",
      "body": "My goal is partial recovery and daily working on maintaining that. The points of the D that align with my value system will not go away.",
      "created_utc": 1752274136.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mbhjt4e",
      "author": "sweetfaerieface",
      "body": "I hope this gives you some hope for recovery. I am 70. I have had some sort of ED since I was 8. Diagnosed different disorders as they morphed through the years. I have now been in recovery for a year and 2 months. I, like you, thought I would never be able to recover but here I am. Please don’t give up on recovery!",
      "created_utc": 1738940498.0,
      "score": 23,
      "context": [
        {
          "id": "mbf3mn6",
          "author": "alienprincess111",
          "body": "Yes, me.  I am 40 yo and have been struggling for almost 27 years. There are lots of older people like me out there, sadly. There's am r/eatingdisordersover30 sub.\n\nHow to cope with it? One day at a time, I guess.  I have come to terms with the fact that I will never fully recover.",
          "created_utc": 1738899404.0
        }
      ]
    },
    {
      "id": "mc1z44d",
      "author": "AFurryThing23",
      "body": "I'll be 58 next month. Way back when I was around 23 they wanted to hospitalize me but I had a 2 year old that no one would take care of for me and I had no insurance so no hospitalization for me.\n\nI've just been struggling through the past few decades.",
      "created_utc": 1739211496.0,
      "score": 2,
      "context": [
        {
          "id": "mbf3mn6",
          "author": "alienprincess111",
          "body": "Yes, me.  I am 40 yo and have been struggling for almost 27 years. There are lots of older people like me out there, sadly. There's am r/eatingdisordersover30 sub.\n\nHow to cope with it? One day at a time, I guess.  I have come to terms with the fact that I will never fully recover.",
          "created_utc": 1738899404.0
        }
      ]
    },
    {
      "id": "mbgto6z",
      "author": "Forever_Alone51023",
      "body": "Whoooo you got my by one year! I'm turning 54 lol.",
      "created_utc": 1738931064.0,
      "score": 2,
      "context": [
        {
          "id": "mbg3rfc",
          "author": "prettysickchick",
          "body": "I’m about to turn 55 lol.  Started at 12.  I think it’s like any addiction.  It’s a lifelong struggle.",
          "created_utc": 1738916284.0
        }
      ]
    },
    {
      "id": "mblns47",
      "author": "Dogplantmom97",
      "body": "Thats awesome! I’m on the road to recovery but have unfortunately fallen off track recently because stress & there was a death in my family",
      "created_utc": 1738985714.0,
      "score": 2,
      "context": [
        {
          "id": "mbgimo0",
          "author": "HansKolpinghuis",
          "body": "33 years old man, and just recovered from bulimia/BED after 8 months of therapy. Never too old to have it, but never too old to seek help and recover either!!",
          "created_utc": 1738925420.0
        }
      ]
    },
    {
      "id": "mbmmo6j",
      "author": "AstirdLevenson",
      "body": "Isn't that such a raw deal, that this heavy thing feels so silly and frivolous? It makes me so mad.",
      "created_utc": 1739002489.0,
      "score": 1,
      "context": [
        {
          "id": "mbfxyef",
          "author": "bpa23",
          "body": "Hello I'm 29 and I also feel too old for this silliness but here we are",
          "created_utc": 1738912857.0
        }
      ]
    },
    {
      "id": "mbzwlsa",
      "author": "None",
      "body": ">I think we just have lives and have to work do jobs so we can’t focus entirely on recovery or post about it online.\n\nNailed it. We just don't have the time to be online talking about it all the time, plus we have to worry about it potentially affecting our jobs/families if people find out about it (sadly). We don't just grow out of it, we get quieter about it.",
      "created_utc": 1739184826.0,
      "score": 1,
      "context": [
        {
          "id": "mbh02s6",
          "author": "Odd_Theme_3294",
          "body": "I think it may be as we get older we stop posting about it. And that’s why it seems like there are less of us.\n\nBecause when you see pro ana accounts on tiktok or recovery accounts they’re all 13-18 (the occasional 20-24).\n\nBut obviously those of us in our 20s still have EDs I think we just have lives and have to work do jobs so we can’t focus entirely on recovery or post about it online.",
          "created_utc": 1738933717.0
        }
      ]
    },
    {
      "id": "mbh6szj",
      "author": "True-Aside3490",
      "body": "I'm almost 40 and have a ED. I struggle so much feeling like I'm too old for it but I know it doesn't discriminate by age.",
      "created_utc": 1738936184.0,
      "score": 2,
      "context": [
        {
          "id": "mbfuowd",
          "author": "Stingwing4oba",
          "body": "I do feel too old to have one, but the reality is I do :(\n\n(I turn 40 next month)",
          "created_utc": 1738911044.0
        }
      ]
    },
    {
      "id": "mbi2qgv",
      "author": "alienprincess111",
      "body": "Thanks for sharing, this is encouraging.  Fwiw, I did have a lot of years of quasi recovery where I was normal weight and not losing but still controlling food/exercise.   I think this sort of quasi recovery is the best I can do.",
      "created_utc": 1738946020.0,
      "score": 3,
      "context": [
        {
          "id": "mbf3mn6",
          "author": "alienprincess111",
          "body": "Yes, me.  I am 40 yo and have been struggling for almost 27 years. There are lots of older people like me out there, sadly. There's am r/eatingdisordersover30 sub.\n\nHow to cope with it? One day at a time, I guess.  I have come to terms with the fact that I will never fully recover.",
          "created_utc": 1738899404.0
        },
        {
          "id": "mbhjt4e",
          "author": "sweetfaerieface",
          "body": "I hope this gives you some hope for recovery. I am 70. I have had some sort of ED since I was 8. Diagnosed different disorders as they morphed through the years. I have now been in recovery for a year and 2 months. I, like you, thought I would never be able to recover but here I am. Please don’t give up on recovery!",
          "created_utc": 1738940498.0
        }
      ]
    },
    {
      "id": "mbpshb7",
      "author": "Stingwing4oba",
      "body": "I feel the same way. It wasn't until late last year that I realized it is a life long thing",
      "created_utc": 1739045495.0,
      "score": 2,
      "context": [
        {
          "id": "mbfuowd",
          "author": "Stingwing4oba",
          "body": "I do feel too old to have one, but the reality is I do :(\n\n(I turn 40 next month)",
          "created_utc": 1738911044.0
        },
        {
          "id": "mbh6szj",
          "author": "True-Aside3490",
          "body": "I'm almost 40 and have a ED. I struggle so much feeling like I'm too old for it but I know it doesn't discriminate by age.",
          "created_utc": 1738936184.0
        }
      ]
    },
    {
      "id": "mbmmfb1",
      "author": "AstirdLevenson",
      "body": "That kind of quasi recovery is a really important step in the right direction 💜 I believe so much that we can all heal at least to a place where this beast is in check the vast majority of the time. Keep going 💜",
      "created_utc": 1739002346.0,
      "score": 6,
      "context": [
        {
          "id": "mbf3mn6",
          "author": "alienprincess111",
          "body": "Yes, me.  I am 40 yo and have been struggling for almost 27 years. There are lots of older people like me out there, sadly. There's am r/eatingdisordersover30 sub.\n\nHow to cope with it? One day at a time, I guess.  I have come to terms with the fact that I will never fully recover.",
          "created_utc": 1738899404.0
        },
        {
          "id": "mbhjt4e",
          "author": "sweetfaerieface",
          "body": "I hope this gives you some hope for recovery. I am 70. I have had some sort of ED since I was 8. Diagnosed different disorders as they morphed through the years. I have now been in recovery for a year and 2 months. I, like you, thought I would never be able to recover but here I am. Please don’t give up on recovery!",
          "created_utc": 1738940498.0
        },
        {
          "id": "mbi2qgv",
          "author": "alienprincess111",
          "body": "Thanks for sharing, this is encouraging.  Fwiw, I did have a lot of years of quasi recovery where I was normal weight and not losing but still controlling food/exercise.   I think this sort of quasi recovery is the best I can do.",
          "created_utc": 1738946020.0
        }
      ]
    },
    {
      "id": "mbi5lsa",
      "author": "sweetfaerieface",
      "body": "And that’s what you should do… your best! I am proud of you for not completely giving up. I know how easy that can be to do.",
      "created_utc": 1738946827.0,
      "score": 3,
      "context": [
        {
          "id": "mbf3mn6",
          "author": "alienprincess111",
          "body": "Yes, me.  I am 40 yo and have been struggling for almost 27 years. There are lots of older people like me out there, sadly. There's am r/eatingdisordersover30 sub.\n\nHow to cope with it? One day at a time, I guess.  I have come to terms with the fact that I will never fully recover.",
          "created_utc": 1738899404.0
        },
        {
          "id": "mbhjt4e",
          "author": "sweetfaerieface",
          "body": "I hope this gives you some hope for recovery. I am 70. I have had some sort of ED since I was 8. Diagnosed different disorders as they morphed through the years. I have now been in recovery for a year and 2 months. I, like you, thought I would never be able to recover but here I am. Please don’t give up on recovery!",
          "created_utc": 1738940498.0
        },
        {
          "id": "mbi2qgv",
          "author": "alienprincess111",
          "body": "Thanks for sharing, this is encouraging.  Fwiw, I did have a lot of years of quasi recovery where I was normal weight and not losing but still controlling food/exercise.   I think this sort of quasi recovery is the best I can do.",
          "created_utc": 1738946020.0
        }
      ]
    },
    {
      "id": "mbql7h2",
      "author": "sweetfaerieface",
      "body": "Yes!",
      "created_utc": 1739054165.0,
      "score": 1,
      "context": [
        {
          "id": "mbf3mn6",
          "author": "alienprincess111",
          "body": "Yes, me.  I am 40 yo and have been struggling for almost 27 years. There are lots of older people like me out there, sadly. There's am r/eatingdisordersover30 sub.\n\nHow to cope with it? One day at a time, I guess.  I have come to terms with the fact that I will never fully recover.",
          "created_utc": 1738899404.0
        },
        {
          "id": "mbhjt4e",
          "author": "sweetfaerieface",
          "body": "I hope this gives you some hope for recovery. I am 70. I have had some sort of ED since I was 8. Diagnosed different disorders as they morphed through the years. I have now been in recovery for a year and 2 months. I, like you, thought I would never be able to recover but here I am. Please don’t give up on recovery!",
          "created_utc": 1738940498.0
        },
        {
          "id": "mbi2qgv",
          "author": "alienprincess111",
          "body": "Thanks for sharing, this is encouraging.  Fwiw, I did have a lot of years of quasi recovery where I was normal weight and not losing but still controlling food/exercise.   I think this sort of quasi recovery is the best I can do.",
          "created_utc": 1738946020.0
        },
        {
          "id": "mbmmfb1",
          "author": "AstirdLevenson",
          "body": "That kind of quasi recovery is a really important step in the right direction 💜 I believe so much that we can all heal at least to a place where this beast is in check the vast majority of the time. Keep going 💜",
          "created_utc": 1739002346.0
        }
      ]
    }
  ]
}