{
  "id": "1ijvgdz",
  "subreddit": "EatingDisorders",
  "author": "gnomeslinger",
  "created_utc": 1738936344.0,
  "title": "Why do people always seem to feel the need to flex their lack of eating/unhealthy eating habits the second they find out you have an eating disorder",
  "selftext": "For context personally (although I mean this as an 'in general' question) my sister has recently moved in with us and man, the only thing she seems to talk about is calories & the fact she eats way less than me despite being almost 3x heavier and man. I've been doing so so so fucking well with my recovery but this constant background noise is making it impossible. And even knowing she's an extreme example of a complete loser, I've had this become a thing so many times. The second someone finds out I have an eating disorder they're suddenly messaging me 3x a day about how they haven't eaten or whatever. Or about how this random actress is 'even lighter than me' and I mean. Girl whatever. Keep deluding yourself idc\n\nBut I've seen this type of response from other people who have been found out/confessed to having eating disorders and man, what the fuck is that about",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1ijvgdz/why_do_people_always_seem_to_feel_the_need_to/",
  "score": 75,
  "num_comments": 14,
  "comments": [
    {
      "id": "mblhwee",
      "author": "cryerin25",
      "body": "eating disorders are competitive",
      "created_utc": 1738983580.0,
      "score": 35,
      "context": []
    },
    {
      "id": "mbmis6n",
      "author": "Add1e_82",
      "body": "you’re so right about this 💕 i hate it when that happens",
      "created_utc": 1739000227.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mboovnr",
      "author": "StaringBlnklyAtMyNVL",
      "body": "If my sister did that to me I'd be so mean in return I'd make her regret her life choices istg.\n\nShe never would cause she's amazing but there's something about the anger you unleash to siblings, right?",
      "created_utc": 1739034092.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbtx7po",
      "author": "anastasia_42",
      "body": "One of my friends, whenever I say something wrong in my life she just has to beat me. I say I have money, she says she has more. I say I'm visiting one country, she's visiting 2. I have a boyfriend, she has a boyfriend buying her a diamond ring. It doesn't stop. These people live off trying to be better and cooler and more traumatised than everybody else. She lies about most of her stuff anyways to the point where I think it's become psychopathic. She said her parents bought her a Mercedes Benz so I asked for her to take a photo of it for proof and she made some lame excuse that it was in another country. Yeah right.",
      "created_utc": 1739106604.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mbunkjl",
      "author": "EuropaofAsguard",
      "body": "I think people make so many off-the-cuff comments not realizing how hurtful they really are. A book I'm reading (Skeletal Marriage by Jim Kohl-- excellent book) he says how initially he was thrilled to talk about his weight loss to anyone who'd listen. \"Could there be anything cooler to talk about?\" People would compliment his weight loss (which only added fuel to his fire to keep going) and he could spend hours taking about it. His anorexia started due to a health scare you learn about in the first page of the book and he needed to get healthy.\n\nEating disorders come as unique, complicated and varied as people. The causes are never the same. The comments people unknowingly make aren't helpful, thin or not. When Jim was diagnosed with high blood pressure, a coworker at his job looks his body up and down and says, \"I can see why.\" His first therapist told him men don't get anorexia, so that becomes a challenge to prove how \"good\" he could get to show them all.",
      "created_utc": 1739115850.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbw42am",
      "author": "Nymphormant",
      "body": "My ED history is not common knowledge, although I think some people have suspected. Even still I’ve noticed that some heavy people feel a need to justify their size/eating to me, despite it being completely unsolicited. It’s like they think that because I am thin I must be judging them for their size. It seems to be more prevalent with people I don’t know well - since people I actually spend time with know that I am not the kind of person that speaks about eating/food/calories/body size with other people. Those thoughts already consume my inner mind, I don’t need to rehash them out loud. In my culture there is already a lot of external pressure to be thin, so I’m sure heavier people are already insecure about it, and there is a significant degree of projection. It doesn’t help that women can be competitive around such things. \n\nIt’s likely your sister is very insecure about being bigger and projects this by assuming you are judging her for her size - thus she feels the need to justify it. You see it all the time in the fat acceptance movement - they justify hating thin people under the guise that thin people are judging them or hate them. They often report similar fallacies - like they don’t eat much or exercise a lot. In reality you can’t bend physics or thermodynamics -  while there are rare genetic conditions that make weight loss difficult the only way to store fat is to consume an excess of calories and vice versa. Likewise body size is a reflection of the thermodynamic lifetime of a person, not what they ate this week - seeing a thin person eat a large portion one time or a large person eat a small portion is a grain of sand on a beach in terms of how meaningful it is overall. However it can still feel pretty unfair to people who are struggling to lose weight. \n\nJust like Ana people will illogically believe that a day or week of overeating if going to make them enormous, heavier people can sometimes think that a week of starvation will make them thin. In reality it’s a much longer term process.",
      "created_utc": 1739130623.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mbprzj3",
      "author": "TapRevolutionary5022",
      "body": "Because they are sick and need help",
      "created_utc": 1739045349.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mdoph86",
      "author": "Complete-Ad4993",
      "body": "As someone with an ed its often the only thing on my mind and I struggle to think or talk about anything else",
      "created_utc": 1739999399.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mbln1jd",
      "author": "Mountain_Cow_7283",
      "body": "Also, we live in a time where trauma is competitive. We all want to be the victim and be given sympathy. We all want to have a story. Some people will do absolutely anything they can to get the last laugh. Just shrug it off.",
      "created_utc": 1738985437.0,
      "score": 24,
      "context": [
        {
          "id": "mblhwee",
          "author": "cryerin25",
          "body": "eating disorders are competitive",
          "created_utc": 1738983580.0
        }
      ]
    },
    {
      "id": "mbp0mgl",
      "author": "ameliasophia",
      "body": "Competitive and full of gatekeeping",
      "created_utc": 1739037494.0,
      "score": 4,
      "context": [
        {
          "id": "mblhwee",
          "author": "cryerin25",
          "body": "eating disorders are competitive",
          "created_utc": 1738983580.0
        }
      ]
    },
    {
      "id": "mc14b5a",
      "author": "gnomeslinger",
      "body": "For real ): we have a good relationship outside of this out of pocket antagonising so it’s hard to say anything about it",
      "created_utc": 1739202569.0,
      "score": 1,
      "context": [
        {
          "id": "mboovnr",
          "author": "StaringBlnklyAtMyNVL",
          "body": "If my sister did that to me I'd be so mean in return I'd make her regret her life choices istg.\n\nShe never would cause she's amazing but there's something about the anger you unleash to siblings, right?",
          "created_utc": 1739034092.0
        }
      ]
    },
    {
      "id": "mcn4b53",
      "author": "EuropaofAsguard",
      "body": "I'd have fun with her so much lol. People like that aren't friends as much as they are trying to have someone in their life they want to be better at. The key is to keep your business private, that way she can't know things about you. Keep things as vague as possible. It's sad she feels she has to do this, to feel good about herself.",
      "created_utc": 1739489958.0,
      "score": 2,
      "context": [
        {
          "id": "mbtx7po",
          "author": "anastasia_42",
          "body": "One of my friends, whenever I say something wrong in my life she just has to beat me. I say I have money, she says she has more. I say I'm visiting one country, she's visiting 2. I have a boyfriend, she has a boyfriend buying her a diamond ring. It doesn't stop. These people live off trying to be better and cooler and more traumatised than everybody else. She lies about most of her stuff anyways to the point where I think it's become psychopathic. She said her parents bought her a Mercedes Benz so I asked for her to take a photo of it for proof and she made some lame excuse that it was in another country. Yeah right.",
          "created_utc": 1739106604.0
        }
      ]
    },
    {
      "id": "mqyoqna",
      "author": "CaprisunAddict666",
      "body": "I had a boyfriend like this",
      "created_utc": 1746568962.0,
      "score": 1,
      "context": [
        {
          "id": "mbtx7po",
          "author": "anastasia_42",
          "body": "One of my friends, whenever I say something wrong in my life she just has to beat me. I say I have money, she says she has more. I say I'm visiting one country, she's visiting 2. I have a boyfriend, she has a boyfriend buying her a diamond ring. It doesn't stop. These people live off trying to be better and cooler and more traumatised than everybody else. She lies about most of her stuff anyways to the point where I think it's become psychopathic. She said her parents bought her a Mercedes Benz so I asked for her to take a photo of it for proof and she made some lame excuse that it was in another country. Yeah right.",
          "created_utc": 1739106604.0
        }
      ]
    },
    {
      "id": "mcnv0rl",
      "author": "anastasia_42",
      "body": "You're totally right",
      "created_utc": 1739498972.0,
      "score": 1,
      "context": [
        {
          "id": "mbtx7po",
          "author": "anastasia_42",
          "body": "One of my friends, whenever I say something wrong in my life she just has to beat me. I say I have money, she says she has more. I say I'm visiting one country, she's visiting 2. I have a boyfriend, she has a boyfriend buying her a diamond ring. It doesn't stop. These people live off trying to be better and cooler and more traumatised than everybody else. She lies about most of her stuff anyways to the point where I think it's become psychopathic. She said her parents bought her a Mercedes Benz so I asked for her to take a photo of it for proof and she made some lame excuse that it was in another country. Yeah right.",
          "created_utc": 1739106604.0
        },
        {
          "id": "mcn4b53",
          "author": "EuropaofAsguard",
          "body": "I'd have fun with her so much lol. People like that aren't friends as much as they are trying to have someone in their life they want to be better at. The key is to keep your business private, that way she can't know things about you. Keep things as vague as possible. It's sad she feels she has to do this, to feel good about herself.",
          "created_utc": 1739489958.0
        }
      ]
    }
  ]
}