{
  "id": "1ip3ibm",
  "subreddit": "EatingDisorders",
  "author": "Positive_Spirit_9966",
  "created_utc": 1739510872.0,
  "title": "My eating disorder is the only thing that gives me motivation in life recently.",
  "selftext": "Last year I had a raging eating disorder that I had to force myself out of.  This year Theres a whole new problem of constant dissociation. I’ve been in a constant state of dissociation for 5 months now, sometimes it’s heavy dissociation and other times it’s manageable.  This dissociation has led to absolute hopelessness in just life.  I don’t have the motivation to do anything that used to be so easy for me.  Today I had thoughts of relapsing in my ed for the first time in ages and it gave me so much happiness and motivation to move around and do things because of how in balance I felt after planning out a relapse?  I don’t know why this is happening, I feel so depressed just explaining it because something that hurt me so badly last year is what’s giving me motivation to live again.  Any idea on why this is happening? 😕",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1ip3ibm/my_eating_disorder_is_the_only_thing_that_gives/",
  "score": 43,
  "num_comments": 7,
  "comments": [
    {
      "id": "mcq0o5e",
      "author": "None",
      "body": "It’s happening because it’s a familiar suffering. I’m right there with you and I’m scared as heck.\nAnorexia is a destroyer of both body and soul and I encourage you to try to remain recovered or find someone to speak with. Life truly is worth living! Don’t give up hope!",
      "created_utc": 1739537325.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mcxnibu",
      "author": "onyxjade7",
      "body": "Same gurrl same.",
      "created_utc": 1739641887.0,
      "score": 1,
      "context": []
    },
    {
      "id": "md14k8w",
      "author": "ConceptThen",
      "body": "Hi! I have realized recently that my dissociative symptoms which I was treating as an OSDD was actually a manifestation of athypical anorexia. My weight loss was quite visible but not enough to raise ED flags and the exercise adiction was overlooked.\nHowever the treatment was effective because the main alter eventually came forward and showed me trough a very clear flow of memories what it was all about.\nWhat many call \"my Anna\" had a different name and what triggered it was not a weight loss diet, but \"forced diets\". First before born - as my mother pregnancy extended 3 weeks and I was borned in starvation. Placenta stops feeding the baby around 3 weeks. \nThan at age 7, after a apendicectomy. That was the first time I tried to keep the sudden weight loss that would, in my mind, allow me to be a ballerina. I had been told by my mom I was too fat to do so. The reality was we had no money for ballet classes.\nEventually i gained back the weight, at age 7 there was not many ways to avoid eating what I was given, but still it took a few months.\nThan again at age 18, when I went to uni/started working all at once. Soon I learned how to skip meals and overburn. \nThen at 22 I became pregnant and the apetite returned as well as the weight.\nOnly a decade later, after divorce and first year hardships I lost a ton of weight and became kind of adicted to exercise. It was the 3rd and longest rebound.\nDuring all this time, from the moment i started walking as a toddler I had very strong foot pain/orthopedic foot issues and only when I lost too much weight and did a lot of legs exercise in the adulthood the pain subsides. So, there are medical reasons for me to feel ok/better underweight, and I only realised it due to treating the disassociative disorder underneath.\nIt's funny now, looking back, I see she used exercice not oly to comunicate (giving me all sorts of flashbacks, memories and even visual intuitions over very specific events that where about to happen. It also gave me a great visual memory which was great) but the exercices had a purpuse - unforseen back than: to lesion my spine in a way that would compensate a small malformation  which was at the root of my foot pain. A sacralization of the 1st vertebrae.\nAfter that lesion i had to stop exercising and could barely walk with back pain. I though I was actually going to remain disabled.\nBut after a while my body started to ask for exercise and she (the alter that is associated with my ED) knew what exercises I should do to recover, and taught me how to move again in a lighter way, how to avoid impact, how to strengten the feet and legs with this \"new anatomy\". It was at this point she disclosed her/our anorexia and I became aware of it.\nShe and I also became aware that the damage caused by not eating could soon end what we fight for the most: to LIVE.\nOnly recently I realized my anorexia wanted to fix my physical pain - which was at first fought trough pure dissassociation, but then evolved to a deeply rooted ED, and finally very insightfull medical comprehention - enough to know which bone to break, with scary precision. \nBut the ED itself is finally subsiding, I really think my Anorectic Alter is healing. At least I recovered the pleasure in eating and can concede to exercise and dance, this time not to injure but to heal It.\nLong story short - healing the anorexia for me was only possible bc I treated the dissociative disorder/symptoms.\nIt is not very well known but there are multiple studies that support that Anorexia is also experienced as a dissociative disorder. The inner voice many call \"my anna\" is one of the possible manifestations. Obsessing over a specific exercise or sport. Getting a suddey different experience of oneself. All these and more are dissociative symptoms and they are ways our inner traumas try to express/cope and just supressing all that and force onself to eat may not offer a long term cure. That might be why your dissassociation worsened.\nThe ED is being supressed, not adressed as a part of you that needs to be heard. \nThat is why I advise - try to find a specialist in dissassociation to follow you and of course keep following the medical protocols regarding eating and weitgh gain.\nI had no clue I had an ED, but now I do, can say 100% sure there needs to be a specific protocol to treat both the physical and the dissassociative aspects of the ED for the recovery to be effective.\nAnd yes we must listen to and not simply supress the anorexia - she is a part of oneself - to allow it to heal for good.",
      "created_utc": 1739684815.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mcq4kxm",
      "author": "Positive_Spirit_9966",
      "body": "Thank you so much, I am about to be put on medication for this since people around me have noticed my depression, so hopefully it’ll be a new source of motivation rather than my eating disorder 😅  I know it’s really hard not to relapse because it feels really good in the moment but please don’t!",
      "created_utc": 1739538953.0,
      "score": 3,
      "context": [
        {
          "id": "mcq0o5e",
          "author": "None",
          "body": "It’s happening because it’s a familiar suffering. I’m right there with you and I’m scared as heck.\nAnorexia is a destroyer of both body and soul and I encourage you to try to remain recovered or find someone to speak with. Life truly is worth living! Don’t give up hope!",
          "created_utc": 1739537325.0
        }
      ]
    },
    {
      "id": "md5hgej",
      "author": "darkprincess3112",
      "body": "Is it? Really? What makes you think so? Or do you just repeat what other people told you?",
      "created_utc": 1739745800.0,
      "score": 1,
      "context": [
        {
          "id": "mcq0o5e",
          "author": "None",
          "body": "It’s happening because it’s a familiar suffering. I’m right there with you and I’m scared as heck.\nAnorexia is a destroyer of both body and soul and I encourage you to try to remain recovered or find someone to speak with. Life truly is worth living! Don’t give up hope!",
          "created_utc": 1739537325.0
        }
      ]
    },
    {
      "id": "mcq4x22",
      "author": "None",
      "body": "Thank you dear! I wish you much health and happiness in the future!",
      "created_utc": 1739539086.0,
      "score": 2,
      "context": [
        {
          "id": "mcq0o5e",
          "author": "None",
          "body": "It’s happening because it’s a familiar suffering. I’m right there with you and I’m scared as heck.\nAnorexia is a destroyer of both body and soul and I encourage you to try to remain recovered or find someone to speak with. Life truly is worth living! Don’t give up hope!",
          "created_utc": 1739537325.0
        },
        {
          "id": "mcq4kxm",
          "author": "Positive_Spirit_9966",
          "body": "Thank you so much, I am about to be put on medication for this since people around me have noticed my depression, so hopefully it’ll be a new source of motivation rather than my eating disorder 😅  I know it’s really hard not to relapse because it feels really good in the moment but please don’t!",
          "created_utc": 1739538953.0
        }
      ]
    },
    {
      "id": "md5zinh",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1739751792.0,
      "score": 1,
      "context": [
        {
          "id": "mcq0o5e",
          "author": "None",
          "body": "It’s happening because it’s a familiar suffering. I’m right there with you and I’m scared as heck.\nAnorexia is a destroyer of both body and soul and I encourage you to try to remain recovered or find someone to speak with. Life truly is worth living! Don’t give up hope!",
          "created_utc": 1739537325.0
        },
        {
          "id": "md5hgej",
          "author": "darkprincess3112",
          "body": "Is it? Really? What makes you think so? Or do you just repeat what other people told you?",
          "created_utc": 1739745800.0
        }
      ]
    },
    {
      "id": "md61n9p",
      "author": "None",
      "body": "I never repeat what other have told me because there are no “others.” Just me and my own experience over a long stretch of time. I’ve had eating disorders for 20 years and I understand every mental trick it can pull.\nIn my own experience when I want my Anorexia back it’s because it’s a familiar comfort. And yet I know that familiar comfort will lead to my death and therefore it is toxic and unhelpful. Even though I want the comfort of starving, I definitely don’t want to revisit nearly dying from it again or risk any further injury to my body. All I can tell others is what I’ve known myself and even though sometimes it might not be true for everyone…I’m sure it is for some people. Take care!",
      "created_utc": 1739752495.0,
      "score": 1,
      "context": [
        {
          "id": "mcq0o5e",
          "author": "None",
          "body": "It’s happening because it’s a familiar suffering. I’m right there with you and I’m scared as heck.\nAnorexia is a destroyer of both body and soul and I encourage you to try to remain recovered or find someone to speak with. Life truly is worth living! Don’t give up hope!",
          "created_utc": 1739537325.0
        },
        {
          "id": "md5hgej",
          "author": "darkprincess3112",
          "body": "Is it? Really? What makes you think so? Or do you just repeat what other people told you?",
          "created_utc": 1739745800.0
        },
        {
          "id": "md5zinh",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1739751792.0
        }
      ]
    }
  ]
}