{
  "id": "1iqir2d",
  "subreddit": "EatingDisorders",
  "author": "blutlm",
  "created_utc": 1739675062.0,
  "title": "Anyone else get addicted to coffee bc of their ED?",
  "selftext": "I always enjoyed coffee but never drank it as much as I do now that I developed my ED. There's multiple reasons why. It helps me poop. It cuts off my appetite. It's a calories free form of energy. I literally wake up most mornings and go \"I NEED to go get a coffee (black ofc) so I can poop, upset my stomach, won't feel hungry, and be productive.\" Obviously not healthy.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1iqir2d/anyone_else_get_addicted_to_coffee_bc_of_their_ed/",
  "score": 75,
  "num_comments": 13,
  "comments": [
    {
      "id": "md5cb8b",
      "author": "elhazelenby",
      "body": "I'm addicted even more to caffeine. I drink coffee much more often and I recently started drinking energy drinks because I have no energy. My diet cola drinking has always been bad.",
      "created_utc": 1739744165.0,
      "score": 9,
      "context": []
    },
    {
      "id": "md7fwum",
      "author": "AbsolutelyNot5555",
      "body": "Yeah, way too much coffee, Diet Coke, and sugar free energy drinks",
      "created_utc": 1739771962.0,
      "score": 7,
      "context": []
    },
    {
      "id": "md5zjns",
      "author": "Fuwa_Fuwa_",
      "body": "Energy drinks more so than coffee, but I'll still pound both back like a fiend",
      "created_utc": 1739751801.0,
      "score": 6,
      "context": []
    },
    {
      "id": "md9ha44",
      "author": "InvestigatorCheap489",
      "body": "You’re not alone. At the peak of my illness, I definitely misused caffeine (including black coffee) as a drug.",
      "created_utc": 1739807203.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mdbb7ay",
      "author": "oppinoinatedarab",
      "body": "It’s the only thing that keeps you energized when you’re not eating enough food :(",
      "created_utc": 1739825735.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mde4p5j",
      "author": "MercurialChickadee",
      "body": "Matcha tea, but yeah, caffeine addicted, totally. And realising AN-R has no financial benefit at all…",
      "created_utc": 1739861996.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdj5haw",
      "author": "alliesawn",
      "body": "Oh I definitely overused caffeine in the peak of my ED. It got to the point that I was drinking black 6 shot americanos from Starbucks on an empty stomach every single day for YEARS, caused myself some really awful GERD and now I can’t drink hot coffee at all without heartburn, so I guess take that as a warning 😩",
      "created_utc": 1739925967.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdk6ya1",
      "author": "AdditionImpossible52",
      "body": "Rn im not allowed to consume caffeine, as it affects my appettite",
      "created_utc": 1739938957.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdk8b7q",
      "author": "greenleanbeanweed",
      "body": "yes! it’s been almost 10 years now, still recovering but coffee has never left my routine, i detached it from my eating disorder long ago because i love it so much",
      "created_utc": 1739939506.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdvmrq6",
      "author": "chefstellato",
      "body": "Same here",
      "created_utc": 1740087834.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mdxwwdu",
      "author": "Ornery-Reporter4206",
      "body": "Yesss! It’s much better now though. In the past I was drinking at least a pot of coffee in like a hour or some days I would choose energy drinks and drink 4-6 of those. I have cut back significantly some months ago when I realized I had a issue with eating. Now I have 2-3 coffee drinks a day, but a bit different then before. Before I drank black coffee, now I drink mocha lattes or um basically a chocolate milkshake with a little coffee thrown in lol. I feel like it’s a good balance. I get my caffeine and I get to gain some weight at the same time.",
      "created_utc": 1740115936.0,
      "score": 1,
      "context": []
    },
    {
      "id": "me44b2u",
      "author": "Notmywill63",
      "body": "Hm I just think of it as getting my morning cup of coffee. Are you over thinking it? I do t know only you know",
      "created_utc": 1740200000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mddi9r9",
      "author": "Puzzlehead_k",
      "body": "Yup. Love the appetite reducing aspect.",
      "created_utc": 1739851428.0,
      "score": 1,
      "context": []
    }
  ]
}