{
  "id": "1ixee2h",
  "subreddit": "EatingDisorders",
  "author": "Cold_Degree9437",
  "created_utc": 1740434574.0,
  "title": "my ed story",
  "selftext": "I’ve always hated my body. Ever since I was a child, I was the chubby one, the baby who ate a lot, the kid who got teased for it. My family never meant harm, but their words stuck with me. As I got older, I became hyper-aware of my body, constantly comparing myself to others. By the time I reached high school, those thoughts had settled in, whispering that I wasn’t good enough.\n\nFor years, I carried that self-hatred, but it wasn’t until five years later that I finally acted on it. I started restricting strictly, with purpose. I had always hated my thighs, my bottom, the way my body carried weight, even though I was at a “normal” weight. I told myself that if I just lost enough, maybe I’d finally feel okay. And I did lose quite a lot of weight. \n\nBut before I could fully sink into it, I was forced into early recovery. My parents made a deal with me: if I wanted to go back to univ, I had to get back on track.\n\nSo, I ate. I regained some weight. But the thoughts never left. I still restricted at times, still found comfort in emptiness. I liked that feeling, of being light, of not needing anything. I exercised at home, but mostly, I walked a lot. Anything to keep the guilt away.\n\nNow, I’ve been all-in for a week. Completely honest with myself. No more pretending. And I’m scared. My digestion is a mess, my stomach feels sluggish, and it’s like I’m reliving the first time I tried to recover. \n\nI made the mistake of looking back at old pictures. Pictures of me before the restriction, before I lost the weight. And I hated what I saw. I felt disgusted. I know I was never overweight, I know logically that my body was “fine”, but I still can’t stand looking at those images. I prefer my body after restriction, even after everything it put me through. Even knowing how much pain it caused me, I still struggle to let it go. And I don’t know how to change that.\n\nBut it’s not just my body that haunts me. It’s my past. The life I had before all of this. The way I used to eat, how I actually enjoyed food, how it used to be something that made me happy. The people I was surrounded by …\n\nAnd now, looking back, it feels like I can’t recognize that person. It’s almost like I’m traumatized by it. But the truth is, I wasn’t totally unaware back then. I did have thoughts about my body and food, but they were quieter …\n\nNow there are things that feel really hard, things that are holding me back, and after just a few days of trying, I already feel like I’m slipping. This weekend has set me back. I really don’t want the body I had before. I don’t want to go back to that version of myself, but I don’t know how to move forward either.\n\nOne of the biggest things I need to work on is how much I compare myself to others. I’m stuck in this endless cycle of measuring my body against everyone else’s. It’s exhausting, but I can’t stop. It’s even affecting my friendships. I feel like I can’t be friends with people who are skinnier than me. By the way i’ve self isolated myself A LOT. \n\nAnyway, thank you for reading my journey. If you’re going through something similar, I hope you find the strength to keep going. I know how hard it is. But I also know we can’t stay stuck here forever :/\n\n\n\n\n\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1ixee2h/my_ed_story/",
  "score": 39,
  "num_comments": 7,
  "comments": [
    {
      "id": "mepqg3d",
      "author": "Shnoon_DaDude",
      "body": "I'm so sorry about what's happening to you, and I can relate a lot to what you said about always being the \"chubby\" kid, and about how eating was something you enjoyed so much and looked forward to before everything. It never really bothered me that much until I reached a certain age, and it didn't help that my parents were never really there for me and were one of the contributors to my ED. Lost a lot of weight till I was underweight and even then I was never happy with myself, and it hit me so hard that it was never about how I \"light\" I felt (just the way you put it), but about how confident I was, and how I perceived myself. I kept chasing an \"ideal\" body and weight, but the reality was I was chasing approval from others because I couldn't deal with my own self-hatred.  \n  \nI was never even overweight or obese, I was \"normal\" too. Please focus more on what makes \\*you\\* feel good physically, and that means eating right and eating when you're hungry. I completely understand the feeling of being guilty for feeling full, or guilty for eating anything you've labelled as \"bad\" during your restriction, but you are worth so much more than your comparisons to other people, or how they view you.  Your value will never, ever be determined by the numbers on the scale, and even \\*that's\\* still a struggle for me to grasp. Even though I was never happy with my body, a part of me still wishes I could feel as lightweight as I did during my restriction. What helped for me was seeing a psychologist every week (still do), and tackling the other issues that caused the ED. When you dig deeper, you'll realize it was never about food.  \n  \nRecovery isn't easy, and I'm still going through the process, but you and I can take it one step a time. You got this!",
      "created_utc": 1740497291.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mf4wqt8",
      "author": "None",
      "body": "You’re not alone.. I hate my body as well. It’ll likely always be something we struggle with. Everyone tells me I look so good now. That I’m “so skinny”, that “my fat days are behind me”. And I had a “glow up”. I still judge myself all the time and have even thought about ending things the last couple of days.. I don’t have any advice to offer you because I don’t even have myself in check but you’re not alone ok?",
      "created_utc": 1740689606.0,
      "score": 3,
      "context": []
    },
    {
      "id": "meyyijx",
      "author": "whimsicalc0nfusion",
      "body": "first i wanted to say you’re not alone, and you probably realise that, but hopefully it helps to be reminded. i have struggled with anorexia for many years, and am now gaining weight. for some long i was the skinniest out of my friends, after being the ‘biggest’, in my eyes atleast, for the first 12 years of my life. now, as im reaching early adulthood, my friends bodies are starting to slim out and grow taller, but because of my situation, i am gaining weight. and i have to, i know, but knowing that im no longer the smallest, and i’m the one gaining whilst the rest ‘loose’ (unintentionally) is so so hard. but i’ve realised that one day my body will sort herself out just like theirs is now, you cannot force it. most people gain quite a bit of weight in recovery, and then it fluctuates. you need to get to where you are happy. and you cannot do that until you have faced every fear, eaten every food, and began to show your body love. \nyou’ve got this!! 💗",
      "created_utc": 1740609709.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mey7fxa",
      "author": "Cold_Degree9437",
      "body": "Tysm for sharing this with me, I relate to so much of what you said. It really isn’t just about food, but about how we see ourselves and the approval we crave. \nYou got this, and you’re not alone 💗",
      "created_utc": 1740602199.0,
      "score": 1,
      "context": [
        {
          "id": "mepqg3d",
          "author": "Shnoon_DaDude",
          "body": "I'm so sorry about what's happening to you, and I can relate a lot to what you said about always being the \"chubby\" kid, and about how eating was something you enjoyed so much and looked forward to before everything. It never really bothered me that much until I reached a certain age, and it didn't help that my parents were never really there for me and were one of the contributors to my ED. Lost a lot of weight till I was underweight and even then I was never happy with myself, and it hit me so hard that it was never about how I \"light\" I felt (just the way you put it), but about how confident I was, and how I perceived myself. I kept chasing an \"ideal\" body and weight, but the reality was I was chasing approval from others because I couldn't deal with my own self-hatred.  \n  \nI was never even overweight or obese, I was \"normal\" too. Please focus more on what makes \\*you\\* feel good physically, and that means eating right and eating when you're hungry. I completely understand the feeling of being guilty for feeling full, or guilty for eating anything you've labelled as \"bad\" during your restriction, but you are worth so much more than your comparisons to other people, or how they view you.  Your value will never, ever be determined by the numbers on the scale, and even \\*that's\\* still a struggle for me to grasp. Even though I was never happy with my body, a part of me still wishes I could feel as lightweight as I did during my restriction. What helped for me was seeing a psychologist every week (still do), and tackling the other issues that caused the ED. When you dig deeper, you'll realize it was never about food.  \n  \nRecovery isn't easy, and I'm still going through the process, but you and I can take it one step a time. You got this!",
          "created_utc": 1740497291.0
        }
      ]
    },
    {
      "id": "mf7v51z",
      "author": "Cold_Degree9437",
      "body": "I can really relate to this. Please don’t give in to those thoughts, your life is worth so much more than an eating disorder. As much as it KILLS me to accept it, being thin is NOT worth losing everything. So many people around the world might love to have your life, and you deserve to live it fully. Push those thoughts away, they don’t define you. Take care 💗",
      "created_utc": 1740728971.0,
      "score": 2,
      "context": [
        {
          "id": "mf4wqt8",
          "author": "None",
          "body": "You’re not alone.. I hate my body as well. It’ll likely always be something we struggle with. Everyone tells me I look so good now. That I’m “so skinny”, that “my fat days are behind me”. And I had a “glow up”. I still judge myself all the time and have even thought about ending things the last couple of days.. I don’t have any advice to offer you because I don’t even have myself in check but you’re not alone ok?",
          "created_utc": 1740689606.0
        }
      ]
    },
    {
      "id": "mf7vgak",
      "author": "Cold_Degree9437",
      "body": "Recovery sounds like a really long journey. I still struggle with dreading A LOT of foods, hating my body, and seeing it change, it’s so hard. \n\nBut thank you for your words, they mean a lot. Wishing you strength too, take care 🤍",
      "created_utc": 1740729158.0,
      "score": 2,
      "context": [
        {
          "id": "meyyijx",
          "author": "whimsicalc0nfusion",
          "body": "first i wanted to say you’re not alone, and you probably realise that, but hopefully it helps to be reminded. i have struggled with anorexia for many years, and am now gaining weight. for some long i was the skinniest out of my friends, after being the ‘biggest’, in my eyes atleast, for the first 12 years of my life. now, as im reaching early adulthood, my friends bodies are starting to slim out and grow taller, but because of my situation, i am gaining weight. and i have to, i know, but knowing that im no longer the smallest, and i’m the one gaining whilst the rest ‘loose’ (unintentionally) is so so hard. but i’ve realised that one day my body will sort herself out just like theirs is now, you cannot force it. most people gain quite a bit of weight in recovery, and then it fluctuates. you need to get to where you are happy. and you cannot do that until you have faced every fear, eaten every food, and began to show your body love. \nyou’ve got this!! 💗",
          "created_utc": 1740609709.0
        }
      ]
    },
    {
      "id": "mfcmofq",
      "author": "None",
      "body": "I enjoy making people happy.. I think it’s because I am unhappy and have been unhappy and at my lowest before and I don’t want anyone to go through it. I love making people laugh and everyone thinks I’m happy when I’m not. My friends are the greatest friends ever and I’d be dead rn if it weren’t for them..",
      "created_utc": 1740788983.0,
      "score": 1,
      "context": [
        {
          "id": "mf4wqt8",
          "author": "None",
          "body": "You’re not alone.. I hate my body as well. It’ll likely always be something we struggle with. Everyone tells me I look so good now. That I’m “so skinny”, that “my fat days are behind me”. And I had a “glow up”. I still judge myself all the time and have even thought about ending things the last couple of days.. I don’t have any advice to offer you because I don’t even have myself in check but you’re not alone ok?",
          "created_utc": 1740689606.0
        },
        {
          "id": "mf7v51z",
          "author": "Cold_Degree9437",
          "body": "I can really relate to this. Please don’t give in to those thoughts, your life is worth so much more than an eating disorder. As much as it KILLS me to accept it, being thin is NOT worth losing everything. So many people around the world might love to have your life, and you deserve to live it fully. Push those thoughts away, they don’t define you. Take care 💗",
          "created_utc": 1740728971.0
        }
      ]
    }
  ]
}