{
  "id": "1j2bz0e",
  "subreddit": "EatingDisorders",
  "author": "blueindigoviolin",
  "created_utc": 1740981425.0,
  "title": "How to stop wanting an ED",
  "selftext": "For a couple months now I've been obsessing over it. I know it's wrong and unhealthy but I can't help but think that how I am right now is unhealthy, and everyone seems to be eating less than me or exercising more. I scroll endlessly on my phone watching skinny people eating skinny foods and cutting calories and before and after photos. They never leave my brain. I have been thinking about it a lot more for the past 2 weeks and i have been eating on/off. If I am eating, I completely binge and then try and throw it all up. I'm worried about what my family will think. I'm worried about what I'm going to do to myself if I don't stop.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1j2bz0e/how_to_stop_wanting_an_ed/",
  "score": 61,
  "num_comments": 27,
  "comments": [
    {
      "id": "mfudm40",
      "author": "Legendary_cat_meow",
      "body": "I was like this too. I starved myself, barely eating at 600 calories a day. I lost ten pounds. I loved it so much. I loved it when people at work asked me if i was okay because I looked sick. I loved it when i saw others eating and I wasn’t. I loved it when I felt so hungry going to bed every night. I told myself i was disciplined and I had self control. I loved it so much. This went on for a month. After, my binge eating started. I couldn’t stop eating. It was like I lose all my hunger and fullness cues. I tried to stop eating when until satiated, but i just ended up eating until my stomach ached so much I couldn’t move. I gained all the weight back, and a bit more. \n\nhonestly, as much as i would like to eat normally again, id be lying if i said I didn’t want to starve myself again like how I did before. I don’t think my body could ever recover. so, ur not alone with this desire for an ed. I know u don’t want to hear it, but please don’t starve urself. I didn’t believe it at first, but it will only do the opposite of what u want. I wish I listened.",
      "created_utc": 1741034797.0,
      "score": 34,
      "context": []
    },
    {
      "id": "mfx3ftc",
      "author": "kimmyburbankvol69",
      "body": "You don’t want this disorder. It’s not something to glamourise. Your hair will fall out, teeth will frail, you’ll be dizzy and nauseated and out of breath doing something unremarkable like standing up from a seated position. I haven’t eaten a single bite of food in the 7 days and I’m on the brink of collapsing constantly. I’m experiencing severe tachycardia, critically low hypo’s, seizures, nonstop tremors, fatigue, I could go on. Nip your obsession with eating disorders in the bud now. It will ruin you. Take it from me. I almost died on a heart attack a year ago and was told I had six months to live, the hospital forced me into inpatient for severe malnourishment under guardianship legalities for life saving treatment. You could die. I don’t think that’s something you should aspire to.",
      "created_utc": 1741068718.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mfx16ei",
      "author": "wagyuBeef_raretard",
      "body": "Don't do it. \n\nThe inflammation, water retention and puffiness that you'll find yourself with after five months will break you.\n\nAnd the hardest part? When you finally realize you wanna start healing, your body will put up a fight. She would've forgotten how to be normal, how to digest even the smallest healthiest thing.\n\nAnd it'll take her time before she trusts you again.\n\n\nDon't get there.",
      "created_utc": 1741067554.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mfx9028",
      "author": "ILiterallyLoveThis",
      "body": "Are you me lol? I feel like I have all of the mindset, thoughts, and self hate as someone w/ an eating disorder but no willpower to actually execute it. I’ve been thinking about it and honestly I’d rather have these thoughts and feelings and be skinny then have them and still be fat. It’s a willpower I envy, but I do understand people’s pain and struggles with their ed. But I’m so sick of being fat to the point where I don’t even like food cause of how much it hurts me. But I think about it all the freaking time. The food noises never leaves me alone.",
      "created_utc": 1741071756.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mfxgvzn",
      "author": "AffectionateGrand756",
      "body": "Omg I almost posted this a few times and then was too ashamed to say that to people with an ED! I’m so glad I’m not alone. I can’t not notice every skinny person around me, or on TV, that’s the first thing popping to my mind. I’m always thinking about how I’m “fat”, and I’m not even fat. I’m a healthy weight, I have muscle, I’m a size S, and yet I feel like a whale and can’t stop looking at how “fat” my arms are and that I wish I had the self control to starve myself or go to the gym 3x a day… my ADHD stopping me, or saving me I guess… \n\nI hate having those thoughts, EDs are awful and people suffer so much, I don’t actually want it, but I have those thoughts I can’t shake off for a good 18years of my life (I’m 31). I feel like a horrible person for having these thoughts.\n\nAnd there’s no one to talk to about it, if I share how I’m feeling I get told off because “I’m not fat and I should shut up and stop seeking attention”, which is awful bc I hate attention, that’s not what I’m doing :(",
      "created_utc": 1741076506.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mfvdtyw",
      "author": "arabellaboobooo",
      "body": "go outside and get off social media",
      "created_utc": 1741045667.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mfuhk6s",
      "author": "-abby-normal",
      "body": "Delete social media",
      "created_utc": 1741035903.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mfxalv1",
      "author": "nutinashell",
      "body": "I mean with all respect to these instagram shredded models, but they are all pretty unrealistic - like, they are not the normal percentage of human.. most of the people go to gym to stay fit, not to shred and become IG models. so first of all, stop comparing yourself with others, this may help a lot.  \nps, i have ED too. i eat, binge and go throw up.. what helped me for a while was ozempic, but shit is expensive.. and i was throwing up anyways.. i lost weight.. would i like to continue doing it? hell no..  what i did notice was.. having meat/chicken... or mainly protein.. did help me feel less hungry..",
      "created_utc": 1741072684.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mg343vh",
      "author": "CottonCandySunset108",
      "body": "I can really understand what your going thru, and how your mind is consumed 24/7 with what to eat or not eat and what diet is going to fix you. I remember bouncing from one thought to the next, and one solution that would help to the next. Nothing worked! I was stuck in an endless cycle of restricting, binge eating and compulsive exercise. I couldn't stop! Sometimes I could last a day or so on a meal plan, only to blow it later on, and end up in the food or body obsession all over again! Then I obsessed about how I looked compared to everyone else, and I just felt so miserable and depressed and isolated. Nobody understood me, and I wanted to stop but didn't know is how to stop and stay stopped. After years of struggling and trying ti solve the problem myself, I was able to accept that I couldn't figure out how to stop, and I was so tired of being sick and tired. I was so desperate to try something new and that promised to make me feel normal around food and in my body again, and I thought it sounded to good to be true, but I'm so grateful to be able to say this solution works. I am free and neutral around my compulsive food behaviors and thoughts. I can go anywhere and be around any food and not be tempted! So, if you have tried everything you can think of, and you can't stop from starting, and can't stop when you start, you may be like me, and perhaps need a new solution. I'm happy to help answer any questions or share my experience anytime. Please reach out if I can help! :) \n\nhttps://www.cceabbsg.org/",
      "created_utc": 1741145078.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfuhkwj",
      "author": "-abby-normal",
      "body": "Delete social media",
      "created_utc": 1741035908.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mfuezuk",
      "author": "BigFigure7271",
      "body": "Try to cut off social media until your ready for it cause right now social media is destryoing you. Try seeking help if you cant pull yourself togheter and stop with this bad thinking. Someone will always exrecies more and someone will always eat less its a race you cant win. Dont throw up thats just gonna ruin you and your body. Just take care of yourself and make sure your feeling happy. Change your bad habits like scrolling on soical media. Find good habits that make you feel good and happy. I think the reason you binge is because the presure your putting on yourself is too big. It gets so much you cant controll it. So as I said seek help if you feel like you need it. Cause right now you need help so it dont get worse. Take care!",
      "created_utc": 1741035180.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mfvdr01",
      "author": "arabellaboobooo",
      "body": "girl….please.  don’t.. you don’t want this.",
      "created_utc": 1741045641.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfy71gv",
      "author": "Forever_Alone51023",
      "body": "Not me suffering immensely with SOME kind of restrictive eating disorder. Lost more weight and I look and feel horrid..\n\n\nThis is not ANYTHING to strive for (you know that already--you seem intelligent!) and tbh that is kind of how this started...I wanted to get down only X lbs but I ended up getting a tummy bug and that made me lose weight....and yep. Tale as old as time there right?\n\nIf you could see me...you would cry. Ppl are shocked to see how skinny I have gotten...\n\nPlease do what I'm doing right now and ask SOMEONE for help. That was the hardest part for me, actually. I had to admit that I'm out of control and I need to stop this before I hurt myself. I have cancer so I can't play with my weight. When I start chemo I'm going to need to be a good weight...I can't do it by myself. I've tried...\n\nGood luck hon. I mean it with my whole heart. Battling cancer and beating an ED is impossible but I'm going for it. I hope you do the same!♥️♥️",
      "created_utc": 1741091269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mg22z0z",
      "author": "superalliefragelistc",
      "body": "Please dont. I'd give anything to have my hair back, my tooth enamel back, and my overall health. Almost blacking out at work because you stood up isn't fun, not being able to actually know what you look like anymore is fucking frustrating. People telling you \"you know your small\" when you don't FEEL/see it is so mentally draining, it really is. Because you keep going until it \"feels right\" and at that point you're sleeping more than living. Your body hurting and heart constantly fluttering is no way to live and its scary. Then when you want to stop and get better you have to go through more discomfort and pain before you see the otherside. Don't do it please, I wouldn't wish this on my enemy",
      "created_utc": 1741132892.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgbb3mh",
      "author": "HollyGirly",
      "body": "Please please please get help. It's not worth it. I've been suffering from anorexia and bulimia since I was 10 (22 now) and it is hell. I have had to spend a combined total of over 3 years in hospital in just 6 years. I almost died multiple times. It is hell on earth. Tubes aren't cute, I couldn't talk for days when I had them. I had so much physical pain all through my body that I couldn't stand up. I fainted and collapsed daily. I have no friends because a life dedicated to starving doesn't leave any time for friends. I failed at school and lost jobs because I was too sick to work or in hospital. My family were mad and terrified and I was too. It is the most horrible thing I've ever dealt with. I've got osteoporosis in my 20s. I probably can't have kids. My hair was falling out and I basically had fur over my body just to keep warm. I was cold even in the heat of summer. I've had my control taken from me multiple times just to keep me alive. It is not glamorous or fun. It's torture. I cried myself to sleep and woke up feeling sick from anxiety every night for years. \n\nI'm finally working towards recovery after a near death experience a few months ago and am once again inpatient. I'm struggling so much and it takes all my energy just to do normal things. Don't let it get to this. You will regret it. Please, I'm begging you to not go down this path",
      "created_utc": 1741261378.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mggbnjm",
      "author": "sarhrgn",
      "body": "To be honest, if you’re having this thought, you already have an ED. Look for support now, don’t wait. This is not going to lead where you think it will, it’s much much worse than you can imagine but you’re already part of the way there so just imagine what you’re experiencing but way worse. Get help now.",
      "created_utc": 1741319212.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgh0l0v",
      "author": "Alternative-Air5923",
      "body": "I understand the mindset you have as I’ve suffered with something similar and still am now. You really don’t want this and it’s best to stop early on. For starters, the health consequences are terrible. The ones that affected me the most were dental problems, infertility, my jaw is always in pain, I’ve lost consciousness many times, and I can’t even digest things properly anymore. Those are only the physical symptoms I’ve experienced and it’s even worse psychologically.\n\nI feel that in your case, social media is a huge contribution to your ED because you’re constantly seeing this unrealistic standard of what is “healthy” and comparing yourself to others. The best thing to do is take a break from social media and focus more on yourself, prioritizing self care. There are many ways to lose weight without having an ED. Just remember that weight is just one aspect of your health and doesn’t always reflect someone’s well being.",
      "created_utc": 1741330408.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mgxsvm7",
      "author": "uoykcufff",
      "body": "you already do 😬",
      "created_utc": 1741564271.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mfvg9e5",
      "author": "noplsnoo",
      "body": "this exact same thing is happening to me right now",
      "created_utc": 1741046467.0,
      "score": 4,
      "context": [
        {
          "id": "mfudm40",
          "author": "Legendary_cat_meow",
          "body": "I was like this too. I starved myself, barely eating at 600 calories a day. I lost ten pounds. I loved it so much. I loved it when people at work asked me if i was okay because I looked sick. I loved it when i saw others eating and I wasn’t. I loved it when I felt so hungry going to bed every night. I told myself i was disciplined and I had self control. I loved it so much. This went on for a month. After, my binge eating started. I couldn’t stop eating. It was like I lose all my hunger and fullness cues. I tried to stop eating when until satiated, but i just ended up eating until my stomach ached so much I couldn’t move. I gained all the weight back, and a bit more. \n\nhonestly, as much as i would like to eat normally again, id be lying if i said I didn’t want to starve myself again like how I did before. I don’t think my body could ever recover. so, ur not alone with this desire for an ed. I know u don’t want to hear it, but please don’t starve urself. I didn’t believe it at first, but it will only do the opposite of what u want. I wish I listened.",
          "created_utc": 1741034797.0
        }
      ]
    },
    {
      "id": "mg29gho",
      "author": "Same_Kitchen_1904",
      "body": "same thing happened to me and I ended up gaining 130 lbs basically overnight. Or so it seemed. Slowly and fairly healthily trying to drop it back down. But both still haunt me sometimes",
      "created_utc": 1741134977.0,
      "score": 3,
      "context": [
        {
          "id": "mfudm40",
          "author": "Legendary_cat_meow",
          "body": "I was like this too. I starved myself, barely eating at 600 calories a day. I lost ten pounds. I loved it so much. I loved it when people at work asked me if i was okay because I looked sick. I loved it when i saw others eating and I wasn’t. I loved it when I felt so hungry going to bed every night. I told myself i was disciplined and I had self control. I loved it so much. This went on for a month. After, my binge eating started. I couldn’t stop eating. It was like I lose all my hunger and fullness cues. I tried to stop eating when until satiated, but i just ended up eating until my stomach ached so much I couldn’t move. I gained all the weight back, and a bit more. \n\nhonestly, as much as i would like to eat normally again, id be lying if i said I didn’t want to starve myself again like how I did before. I don’t think my body could ever recover. so, ur not alone with this desire for an ed. I know u don’t want to hear it, but please don’t starve urself. I didn’t believe it at first, but it will only do the opposite of what u want. I wish I listened.",
          "created_utc": 1741034797.0
        }
      ]
    },
    {
      "id": "mg628oe",
      "author": "Clear-Fix882",
      "body": "EXACT thing happened to me, without the weight gain (yet). My ed was hidden in remission of sorts for years and out of nowhere started up again. Now I can’t stop binging, but crave starvation again - even though I know that’s not healthy or needed. Wishing you the best ❤️‍🩹",
      "created_utc": 1741191625.0,
      "score": 3,
      "context": [
        {
          "id": "mfudm40",
          "author": "Legendary_cat_meow",
          "body": "I was like this too. I starved myself, barely eating at 600 calories a day. I lost ten pounds. I loved it so much. I loved it when people at work asked me if i was okay because I looked sick. I loved it when i saw others eating and I wasn’t. I loved it when I felt so hungry going to bed every night. I told myself i was disciplined and I had self control. I loved it so much. This went on for a month. After, my binge eating started. I couldn’t stop eating. It was like I lose all my hunger and fullness cues. I tried to stop eating when until satiated, but i just ended up eating until my stomach ached so much I couldn’t move. I gained all the weight back, and a bit more. \n\nhonestly, as much as i would like to eat normally again, id be lying if i said I didn’t want to starve myself again like how I did before. I don’t think my body could ever recover. so, ur not alone with this desire for an ed. I know u don’t want to hear it, but please don’t starve urself. I didn’t believe it at first, but it will only do the opposite of what u want. I wish I listened.",
          "created_utc": 1741034797.0
        }
      ]
    },
    {
      "id": "mfymxhk",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1741097250.0,
      "score": 2,
      "context": [
        {
          "id": "mfudm40",
          "author": "Legendary_cat_meow",
          "body": "I was like this too. I starved myself, barely eating at 600 calories a day. I lost ten pounds. I loved it so much. I loved it when people at work asked me if i was okay because I looked sick. I loved it when i saw others eating and I wasn’t. I loved it when I felt so hungry going to bed every night. I told myself i was disciplined and I had self control. I loved it so much. This went on for a month. After, my binge eating started. I couldn’t stop eating. It was like I lose all my hunger and fullness cues. I tried to stop eating when until satiated, but i just ended up eating until my stomach ached so much I couldn’t move. I gained all the weight back, and a bit more. \n\nhonestly, as much as i would like to eat normally again, id be lying if i said I didn’t want to starve myself again like how I did before. I don’t think my body could ever recover. so, ur not alone with this desire for an ed. I know u don’t want to hear it, but please don’t starve urself. I didn’t believe it at first, but it will only do the opposite of what u want. I wish I listened.",
          "created_utc": 1741034797.0
        }
      ]
    },
    {
      "id": "mgbbd0d",
      "author": "HollyGirly",
      "body": "I'm so sorry you're going through this. My health and life are so messed up thanks to AN too. I hope one day you recover 🩵",
      "created_utc": 1741261511.0,
      "score": 2,
      "context": [
        {
          "id": "mfx3ftc",
          "author": "kimmyburbankvol69",
          "body": "You don’t want this disorder. It’s not something to glamourise. Your hair will fall out, teeth will frail, you’ll be dizzy and nauseated and out of breath doing something unremarkable like standing up from a seated position. I haven’t eaten a single bite of food in the 7 days and I’m on the brink of collapsing constantly. I’m experiencing severe tachycardia, critically low hypo’s, seizures, nonstop tremors, fatigue, I could go on. Nip your obsession with eating disorders in the bud now. It will ruin you. Take it from me. I almost died on a heart attack a year ago and was told I had six months to live, the hospital forced me into inpatient for severe malnourishment under guardianship legalities for life saving treatment. You could die. I don’t think that’s something you should aspire to.",
          "created_utc": 1741068718.0
        }
      ]
    },
    {
      "id": "mgi9tdp",
      "author": "astroNearby9259",
      "body": "I'm really sorry you are feeling like that, please stay here, people need you ❤️ I felt your comment in a way that you feel desperate and nobody deserves it... please try to eat at least tuna or something like that(its what im eating today), even if its something with little calories it will make you not faint so much for a few hours. Please ❤️",
      "created_utc": 1741354452.0,
      "score": 1,
      "context": [
        {
          "id": "mfx3ftc",
          "author": "kimmyburbankvol69",
          "body": "You don’t want this disorder. It’s not something to glamourise. Your hair will fall out, teeth will frail, you’ll be dizzy and nauseated and out of breath doing something unremarkable like standing up from a seated position. I haven’t eaten a single bite of food in the 7 days and I’m on the brink of collapsing constantly. I’m experiencing severe tachycardia, critically low hypo’s, seizures, nonstop tremors, fatigue, I could go on. Nip your obsession with eating disorders in the bud now. It will ruin you. Take it from me. I almost died on a heart attack a year ago and was told I had six months to live, the hospital forced me into inpatient for severe malnourishment under guardianship legalities for life saving treatment. You could die. I don’t think that’s something you should aspire to.",
          "created_utc": 1741068718.0
        }
      ]
    },
    {
      "id": "mgiacen",
      "author": "astroNearby9259",
      "body": "I feel you",
      "created_utc": 1741354642.0,
      "score": 1,
      "context": [
        {
          "id": "mfx9028",
          "author": "ILiterallyLoveThis",
          "body": "Are you me lol? I feel like I have all of the mindset, thoughts, and self hate as someone w/ an eating disorder but no willpower to actually execute it. I’ve been thinking about it and honestly I’d rather have these thoughts and feelings and be skinny then have them and still be fat. It’s a willpower I envy, but I do understand people’s pain and struggles with their ed. But I’m so sick of being fat to the point where I don’t even like food cause of how much it hurts me. But I think about it all the freaking time. The food noises never leaves me alone.",
          "created_utc": 1741071756.0
        }
      ]
    },
    {
      "id": "mfvhhva",
      "author": "Legendary_cat_meow",
      "body": "i’m so sorry",
      "created_utc": 1741046876.0,
      "score": 1,
      "context": [
        {
          "id": "mfudm40",
          "author": "Legendary_cat_meow",
          "body": "I was like this too. I starved myself, barely eating at 600 calories a day. I lost ten pounds. I loved it so much. I loved it when people at work asked me if i was okay because I looked sick. I loved it when i saw others eating and I wasn’t. I loved it when I felt so hungry going to bed every night. I told myself i was disciplined and I had self control. I loved it so much. This went on for a month. After, my binge eating started. I couldn’t stop eating. It was like I lose all my hunger and fullness cues. I tried to stop eating when until satiated, but i just ended up eating until my stomach ached so much I couldn’t move. I gained all the weight back, and a bit more. \n\nhonestly, as much as i would like to eat normally again, id be lying if i said I didn’t want to starve myself again like how I did before. I don’t think my body could ever recover. so, ur not alone with this desire for an ed. I know u don’t want to hear it, but please don’t starve urself. I didn’t believe it at first, but it will only do the opposite of what u want. I wish I listened.",
          "created_utc": 1741034797.0
        },
        {
          "id": "mfvg9e5",
          "author": "noplsnoo",
          "body": "this exact same thing is happening to me right now",
          "created_utc": 1741046467.0
        }
      ]
    },
    {
      "id": "mfytis5",
      "author": "Legendary_cat_meow",
      "body": "how did u recover? what’s ur story",
      "created_utc": 1741099424.0,
      "score": 2,
      "context": [
        {
          "id": "mfudm40",
          "author": "Legendary_cat_meow",
          "body": "I was like this too. I starved myself, barely eating at 600 calories a day. I lost ten pounds. I loved it so much. I loved it when people at work asked me if i was okay because I looked sick. I loved it when i saw others eating and I wasn’t. I loved it when I felt so hungry going to bed every night. I told myself i was disciplined and I had self control. I loved it so much. This went on for a month. After, my binge eating started. I couldn’t stop eating. It was like I lose all my hunger and fullness cues. I tried to stop eating when until satiated, but i just ended up eating until my stomach ached so much I couldn’t move. I gained all the weight back, and a bit more. \n\nhonestly, as much as i would like to eat normally again, id be lying if i said I didn’t want to starve myself again like how I did before. I don’t think my body could ever recover. so, ur not alone with this desire for an ed. I know u don’t want to hear it, but please don’t starve urself. I didn’t believe it at first, but it will only do the opposite of what u want. I wish I listened.",
          "created_utc": 1741034797.0
        },
        {
          "id": "mfymxhk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1741097250.0
        }
      ]
    },
    {
      "id": "mfvjonb",
      "author": "noplsnoo",
      "body": "i’m going to get back on track .. and eat normally without starving. i’m going to avoid processed foods because they make me binge. hopefully i get to my goal weight by not starving myself",
      "created_utc": 1741047598.0,
      "score": 1,
      "context": [
        {
          "id": "mfudm40",
          "author": "Legendary_cat_meow",
          "body": "I was like this too. I starved myself, barely eating at 600 calories a day. I lost ten pounds. I loved it so much. I loved it when people at work asked me if i was okay because I looked sick. I loved it when i saw others eating and I wasn’t. I loved it when I felt so hungry going to bed every night. I told myself i was disciplined and I had self control. I loved it so much. This went on for a month. After, my binge eating started. I couldn’t stop eating. It was like I lose all my hunger and fullness cues. I tried to stop eating when until satiated, but i just ended up eating until my stomach ached so much I couldn’t move. I gained all the weight back, and a bit more. \n\nhonestly, as much as i would like to eat normally again, id be lying if i said I didn’t want to starve myself again like how I did before. I don’t think my body could ever recover. so, ur not alone with this desire for an ed. I know u don’t want to hear it, but please don’t starve urself. I didn’t believe it at first, but it will only do the opposite of what u want. I wish I listened.",
          "created_utc": 1741034797.0
        },
        {
          "id": "mfvg9e5",
          "author": "noplsnoo",
          "body": "this exact same thing is happening to me right now",
          "created_utc": 1741046467.0
        },
        {
          "id": "mfvhhva",
          "author": "Legendary_cat_meow",
          "body": "i’m so sorry",
          "created_utc": 1741046876.0
        }
      ]
    }
  ]
}