{
  "id": "1jbh35a",
  "subreddit": "EatingDisorders",
  "author": "BuildingWooden8877",
  "created_utc": 1741993680.0,
  "title": "Am I being ungrateful for being upset at my mum for only feeding me once a day?",
  "selftext": "I'm 14 and I don't know if I'm being entitled or anything, but my mum doesn't give me breakfast or lunch and only feeds me dinner. She doesn't cook properly either and mostly makes frozen food or just pasta which makes my stomach hurt and I'm sick of it. Or if she's too lazy, she buys takeaways, and she does often and blames it on me. \n\nWhen she goes shopping, she gets a lot of junk food, chocolate and crisps. My body is getting fat and I hate it. My mum has type 2 diabetes and is fat, and I'm scared that I'm going to end up like her, because my older sister ended up fat too. \n\nMost of the day my mum ignores me and is in her own world on her phone. When I tell my mum I'm hungry later on in the day, she gets angry at me for it and says I'm being ungrateful and she already fed me, and she complains and texts the whole family that I'm being difficult and ungrateful and that she's sick of me, and most of the time she ends up ordering a takeaway which makes me feel horrible and fat. I hate my body so much. \n\nI also have depression (yes, I have been diagnosed), and whenever I'm upset or crying, my mum doesn't know what to do and just shouts at me for it for \"causing trouble\" and orders a takeaway to try and shut me up, and it does. I keep eating to comfort myself when I'm upset but it's making me feel fat and my face is getting fatter. Every single day I'm crying and there's multiple reasons why, and I don't know what to do. Only food makes me feel better, but it makes me feel disgust at the same time. \n\nI also have autism and sensory issues so I struggle with a lot of foods texture, taste, smell ect so that makes it even more difficult. She complains about it and says she's sick of my autism. I fucking hate when I get hungry because it just causes trouble in the house. \n\nI'm not allowed to cook things myself and my mum is possessive and overprotective so she'd think I'd end up burning or hurting myself by accident. And I have no idea how to cook and planning things and doing all that myself will overwhelm me alot, I have no skills at all. And because of my autism, I can't handle being in supermarkets at all and get overwhelmed, and she said she can't afford my \"luxuries\". \n\nWhat am I supposed to do? \n\n\n\n\n\n\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jbh35a/am_i_being_ungrateful_for_being_upset_at_my_mum/",
  "score": 53,
  "num_comments": 33,
  "comments": [
    {
      "id": "mhu792f",
      "author": "-abby-normal",
      "body": "This seems like an extremely unhealthy & toxic household. As your parent, it is her responsibility to take care of you, FEED YOU PROPERLY, and teach you the skills to be a functional person. Not doing that is neglect. Your mother is holding you back from living a normal life. \n\nUnfortunately, I don’t have any advice for you. It’s a really difficult situation without an easy answer. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry so your mom doesn’t worry about you burning the house down?",
      "created_utc": 1741996083.0,
      "score": 66,
      "context": []
    },
    {
      "id": "mhub0jd",
      "author": "shortieprincesss",
      "body": "this is 10000% neglect",
      "created_utc": 1741997354.0,
      "score": 27,
      "context": []
    },
    {
      "id": "mhu7fb1",
      "author": "neopronoun_dropper",
      "body": "This sounds like neglect to me.",
      "created_utc": 1741996141.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mhujaux",
      "author": "KurapikaKurtaAkaku",
      "body": "At first I thought you could just cook for yourself, but not allowing you to cook or feed you is absolutely neglect. Please tell a trusted adult/teacher",
      "created_utc": 1742000203.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mhvxm61",
      "author": "pawgie_pie",
      "body": "Hey babe. This is neglect. You need to talk to someone else about it like a dr or family member. Depending on where you live there are hotlines you can call to get further advice. \n\nYou don't want diabetes and if that's what your mother is feeding herself too she will be a very sick lady very soon. \n\nYou aren't causing trouble you're trying to get basic needs met and if your mother is manipulating your situation to make you look ungreatful for that... Where I'm from that's legally abuse too. \n\nXx",
      "created_utc": 1742022999.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mhunoqx",
      "author": "Jazzlike-Walrus1467",
      "body": "Wow, she sounds very immature and neglectful and like she has a lot of her own issues that need addressing and is possibly taking it out on you (and your sister?) as a distraction…whether she realises that or not. \nI’m sorry that you’re in this situation hun and that she’s been embarrassing you, very uncool. Seems like you’re the collateral damage to a much bigger situation which is totally unfair on you, especially being so young. \nGood on you for being proactive and having the maturity and awareness to start asking for help, I think it’s really brave and I’m proud of you ❤️\n\nIn terms of getting some help, I would suggest talking to an adult in close proximity. They’d probably have the best chance of helping you as there are different services and pathways depending on where you live. \nDo you go to a school? Could you go to the office even in a lunch break and ask to talk to a school councillor or carea adviser or just any adult that would have some time to talk to you? \nI think you should do that as it’s crucial that you put a stop to this and not let it go on for a long time. \nTry to stay calm when you’re talking if you can so you can speak clearly and communicate how important it is and that you really need to talk to someone as you need help. \nPrepare yourself that everyone might be busy and not have time in that moment to talk to you, but try not to be be disheartened and don’t leave until you’ve arranged a time to talk to someone ok. If it’s not a good time in that moment, then you ask to find a time that works for them asap because it’s urgent. Stand your ground but of course be respectful so they don’t push you away. \n\nWrite down a list of the things you need to address so you don’t forget anything. What you’ve written on this post is really good, I think you should put that into some dot points so you’re prepared.\n\nIf you can’t talk to a teacher, maybe go down to a police station (subtly) or if you can’t do that, even go to a shop or supermarket near you and ask an adult at the front desk if they could help you and that you need to talk to the police or child services etc. they might let you use their phone and/or know some numbers to call. \n\nYou are so important and deserve better and the fact that you recognise the problems is already a great step forward. \n\nI’m a chronic depression sufferer and my parents were emotionally neglectedful as well so I can empathise with you. You can love and care about them but it absolutely does not mean you have to put up with being treated like you don’t matter, because you do. I wish I had’ve been as brave as you when I was 14. \nStay strong hun, know your worth and persist until you’re in a better and safer situation, even if that means not being with your mum (for the time being anyway). \nYou can absolutely turn things around and have a good life and prevent having life long damage to your body because you’re still young and really smart. \nPower through darling, you’re stronger than you know!",
      "created_utc": 1742001763.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mhwk6wk",
      "author": "wariowars",
      "body": "Oh kid :( this breaks my heart to read. Your mum is neglecting you.\n\nI’m an autistic mum with a history of disordered eating. 2 of my daughters are autistic and have diagnoses of ARFID (predominantly sensory related, for them).\n\nIt’s 11am and I’ve just made nugs and fruit as a brunch, I guess? She’s your mum, and she should be ensuring you eat within your safe foods in the best way possible for your health (I know it’s not easy for you at all). You’re a child.\n\nDo you have a trusted adult within school or your medical team that you could reach out to? If your school has a therapist/safeguarding officer, or a place2b (only guessing you may be UK based too, due to use of the words mum/takeaway) that you could access?\n\nThere’s no world in which it’s ok to only feed your kids once a day, whilst also refusing to let them cook for themselves.",
      "created_utc": 1742037361.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mhw0gc6",
      "author": "56KandFalling",
      "body": "What a horrible situation you're in. No wonder you have a depression. You need help. \n\nSounds like you could feed yourself, so it's neglect that you haven't been taught how and you're not allowed to. At 14 you should be able to grab at least breakfast and lunch yourself (parents make sure that fridge and pantry have food). \n\nI suggest that you join the autistic subs here on reddit and maybe contact a local support group in your area. You need support from others to empower you. Maybe authorities should be involved, but as soon as that's put into motion, it can go from bad to worse, so be cautious with that. \n\nAlso, start learning as many skills as possible to become independent, if the situation doesn't change a lot very soon, you have to be able to leave ASAP.",
      "created_utc": 1742024853.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mhwguee",
      "author": "mybrainat3am",
      "body": "Talk to a teacher. Even if money isn't an issue in your household they may still be able to get u free school meals or something. I'm not on them but I have a friend who is and uses the money to get packaged sandwiches as their cheaper than the hit meals, and he can take them home for evening meals or he weekend, then he has healthy nutritious meals with fresh veg for when he wants it, could you do something similar?",
      "created_utc": 1742035423.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mhxc192",
      "author": "vanillablue_",
      "body": "This is abuse, specifically neglect. It sounds like we don’t share the same country, but I would advise you to seek help and resources",
      "created_utc": 1742049140.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mhua3hn",
      "author": "lesbianvampyr",
      "body": "I think it’s fine for her to only cook once a day for you, you’re old enough to make your own breakfast and lunch, but the other things are issues. It’s her responsibility as a parent to make sure there’s healthy and nutritious food in the house for you, and the way she treats you and talks about your mental health is not okay.",
      "created_utc": 1741997044.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mi8wwvo",
      "author": "Complete-Barnacle-13",
      "body": "the only advice i could give you is to confide in a trusted adult and let them call CPS. This is neglectful behavior and some people truly don't deserve kids. its a shame",
      "created_utc": 1742213843.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mhxl5fc",
      "author": "Sad_Pudding8088",
      "body": "Maybe eat at a friend’s house when you can, or at school. It’s hard to recommend anything without feeling like I’m promoting SOME kind of eating disorder but that isn’t healthy. Try to find a subsistence with something else that makes you happy or chug water or something like that when you just want to binge I guess. I’m sorry you have to deal with that, you deserve better.\n\nHonestly I would call CPS for this shit it’s straight up neglect. Aside from the emotional neglect that cps wouldn’t care about as much, she’s not giving you the adequate amount of food that you need. On top of that it sounds like the food she gives you isn’t healthy.",
      "created_utc": 1742052120.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mi39vku",
      "author": "MirandaMarie93",
      "body": "Tbh your mother shouldn’t have kids. That’s just awful 😣 I couldn’t imagine living this way. If you can talk to someone and get out of that situation it’s for the best unfortunately wish you Luck OP 🍀",
      "created_utc": 1742134760.0,
      "score": 1,
      "context": []
    },
    {
      "id": "migghkl",
      "author": "Future-Post-9104",
      "body": "Please try to reach out to someone, preferably an adult who can help you get out of this situation because this sounds like a neglectful and unhealthy environment no child should grow up in",
      "created_utc": 1742313834.0,
      "score": 1,
      "context": []
    },
    {
      "id": "migsiqy",
      "author": "One_Strategy4218",
      "body": "I struggle w a similar household dynamic, I started meal prepping w the frozen as much as possible so like the chicken nuggets/strips, frozen 🥦 , frozen pierogis , Trader Joe’s frozen stuff like that things that are convenient but balanced enough for your sustainable household dynamic minimal perception or time in kitchen in public view",
      "created_utc": 1742317272.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mis3ljc",
      "author": "Overall_Competition4",
      "body": "Hello, yes this is neglect and not even emotional abuse! It's great you live in the UK. I used to be a children and family social worker in the UK. One thing you can do is to call your council and make a social work referral yourself. It will be confidential so your mom won't know who it was that made the referral. That way a social worker can get involved and help keep your mom accountable. You can tell a school counselor too. Don't worry about them removing you from the home, that is only done in extreme circumstances and by a court order. A social worker will come to your house and assess the situation. You can speak with them in private and tell them everything you wrote here. Then they might have your mom take classes or privately work with your family ensuring your mom feeds and properly and treats you better. Also you can have someone to talk to about your food issues with. It's often a long wait for mental health services but see if you click with the counselor at school share this with them too. \n\nYou're not ungrateful, these are real needs of yours. You're growing and developing and deserve all the love and support you can get! Your mom chose to have you so she has certain responsibilities to fulfill. She is there to fulfill your needs, you are not there to fulfill hers. \n\nYou are already great at advocating for yourself because you were able to so well articulate your issues here on Reddit. Don't feel guilty for wanting to be treated how every child should be treated. I'm sending you love from America!",
      "created_utc": 1742471314.0,
      "score": 1,
      "context": []
    },
    {
      "id": "miwywdo",
      "author": "None",
      "body": "Girl, Your mom is abusing you, she doesn't have that right, or she's negligent or has a mental problem Or she's just evil, you need to call the police like right now, and tell them what she's doing to you, but by yesterday it's too late.",
      "created_utc": 1742527344.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mhvv5q4",
      "author": "Practical-Ad9681",
      "body": "While this is a horrible and neglectful situation that you are in (and I really don’t want to undermine this), at 14 you should be capable of preparing your own food. It’s obvious that your mother has a lot of issues so it’s even more important that you learn to look after yourself. Maybe try to prepare some meals that don’t require cooking? Sandwiches, cereal etc. It’s very normal for parents to cook dinner and for teenagers to prepare breakfast and lunch and get their own snacks.\n\nAgain, I don’t want to discount that this is an abusive situation, but I want to empower you to take hold of some of the situation for your own wellbeing instead of relying on her to provide you with something that she clearly has no intention of providing.",
      "created_utc": 1742021434.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mhufxtu",
      "author": "bassoonwoman",
      "body": "Try ordering from a grocery store app and picking it up so you don't have to go into the store for groceries you need",
      "created_utc": 1741999034.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mhvt5ua",
      "author": "FriedLipstick",
      "body": "I agree and I’ll take it a step further: OP’s mom is abusing OP. OP should talk to a trustperson at school or at the doctor’s. To provide healthy meals: breakfast is important for children attending school. Lunch the same. OP is there a way you can get some yoghurts and fruits? That will cover breakfast. And maybe some vegetables by going to the store together? I doubt your mother will get you that so please talk to a trust person. You also need guidance for having autism. I wish you the best.",
      "created_utc": 1742020194.0,
      "score": 20,
      "context": [
        {
          "id": "mhu792f",
          "author": "-abby-normal",
          "body": "This seems like an extremely unhealthy & toxic household. As your parent, it is her responsibility to take care of you, FEED YOU PROPERLY, and teach you the skills to be a functional person. Not doing that is neglect. Your mother is holding you back from living a normal life. \n\nUnfortunately, I don’t have any advice for you. It’s a really difficult situation without an easy answer. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry so your mom doesn’t worry about you burning the house down?",
          "created_utc": 1741996083.0
        }
      ]
    },
    {
      "id": "mhuafnd",
      "author": "BuildingWooden8877",
      "body": "What do you mean by this? \n\n>. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry",
      "created_utc": 1741997157.0,
      "score": 3,
      "context": [
        {
          "id": "mhu792f",
          "author": "-abby-normal",
          "body": "This seems like an extremely unhealthy & toxic household. As your parent, it is her responsibility to take care of you, FEED YOU PROPERLY, and teach you the skills to be a functional person. Not doing that is neglect. Your mother is holding you back from living a normal life. \n\nUnfortunately, I don’t have any advice for you. It’s a really difficult situation without an easy answer. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry so your mom doesn’t worry about you burning the house down?",
          "created_utc": 1741996083.0
        }
      ]
    },
    {
      "id": "mhxncya",
      "author": "Sad_Pudding8088",
      "body": "Well said. I think a lot of people in this comment section are misunderstanding that the mother is solely responsible for the child not being fed right. It’s their responsibility as a parent first of all but secondly even if they’re 14 they weren’t taught those skills (and they’re autistic which makes everything more complicated in this world)\n\nReally hoping they seek some kind of help.",
      "created_utc": 1742052818.0,
      "score": 5,
      "context": [
        {
          "id": "mhwk6wk",
          "author": "wariowars",
          "body": "Oh kid :( this breaks my heart to read. Your mum is neglecting you.\n\nI’m an autistic mum with a history of disordered eating. 2 of my daughters are autistic and have diagnoses of ARFID (predominantly sensory related, for them).\n\nIt’s 11am and I’ve just made nugs and fruit as a brunch, I guess? She’s your mum, and she should be ensuring you eat within your safe foods in the best way possible for your health (I know it’s not easy for you at all). You’re a child.\n\nDo you have a trusted adult within school or your medical team that you could reach out to? If your school has a therapist/safeguarding officer, or a place2b (only guessing you may be UK based too, due to use of the words mum/takeaway) that you could access?\n\nThere’s no world in which it’s ok to only feed your kids once a day, whilst also refusing to let them cook for themselves.",
          "created_utc": 1742037361.0
        }
      ]
    },
    {
      "id": "mhvdesy",
      "author": "BeetrixGaming",
      "body": "Yeah and the mom won't let OP use the kitchen",
      "created_utc": 1742011873.0,
      "score": 10,
      "context": [
        {
          "id": "mhua3hn",
          "author": "lesbianvampyr",
          "body": "I think it’s fine for her to only cook once a day for you, you’re old enough to make your own breakfast and lunch, but the other things are issues. It’s her responsibility as a parent to make sure there’s healthy and nutritious food in the house for you, and the way she treats you and talks about your mental health is not okay.",
          "created_utc": 1741997044.0
        }
      ]
    },
    {
      "id": "mhxlonu",
      "author": "Sad_Pudding8088",
      "body": "I guess but they aren’t allowed to cook or eat anything else. It’s unacceptable and neglect.",
      "created_utc": 1742052290.0,
      "score": 5,
      "context": [
        {
          "id": "mhua3hn",
          "author": "lesbianvampyr",
          "body": "I think it’s fine for her to only cook once a day for you, you’re old enough to make your own breakfast and lunch, but the other things are issues. It’s her responsibility as a parent to make sure there’s healthy and nutritious food in the house for you, and the way she treats you and talks about your mental health is not okay.",
          "created_utc": 1741997044.0
        }
      ]
    },
    {
      "id": "mi3jvxn",
      "author": "BuildingWooden8877",
      "body": "She ruined the lives of my older adult siblings, and now she's doing the same to me.",
      "created_utc": 1742138010.0,
      "score": 1,
      "context": [
        {
          "id": "mi39vku",
          "author": "MirandaMarie93",
          "body": "Tbh your mother shouldn’t have kids. That’s just awful 😣 I couldn’t imagine living this way. If you can talk to someone and get out of that situation it’s for the best unfortunately wish you Luck OP 🍀",
          "created_utc": 1742134760.0
        }
      ]
    },
    {
      "id": "mhxmcrz",
      "author": "Sad_Pudding8088",
      "body": "They have autism, are not allowed to cook and from my understanding they wouldn’t be allowed to buy things they want too? Seems like the only way food can go into the house is through the mother.",
      "created_utc": 1742052502.0,
      "score": 4,
      "context": [
        {
          "id": "mhvv5q4",
          "author": "Practical-Ad9681",
          "body": "While this is a horrible and neglectful situation that you are in (and I really don’t want to undermine this), at 14 you should be capable of preparing your own food. It’s obvious that your mother has a lot of issues so it’s even more important that you learn to look after yourself. Maybe try to prepare some meals that don’t require cooking? Sandwiches, cereal etc. It’s very normal for parents to cook dinner and for teenagers to prepare breakfast and lunch and get their own snacks.\n\nAgain, I don’t want to discount that this is an abusive situation, but I want to empower you to take hold of some of the situation for your own wellbeing instead of relying on her to provide you with something that she clearly has no intention of providing.",
          "created_utc": 1742021434.0
        }
      ]
    },
    {
      "id": "mhyar5o",
      "author": "nervous_veggie",
      "body": "They’re 14. That’s a child. In the UK, their parents still have legal responsibilities regarding them- and OP is autistic so likely needs even more support than a non-autistic child. You’re right that they could be doing things for themselves, but it shouldn’t be that they’re forced to because their parent is being cruel and neglectful",
      "created_utc": 1742060094.0,
      "score": 3,
      "context": [
        {
          "id": "mhvv5q4",
          "author": "Practical-Ad9681",
          "body": "While this is a horrible and neglectful situation that you are in (and I really don’t want to undermine this), at 14 you should be capable of preparing your own food. It’s obvious that your mother has a lot of issues so it’s even more important that you learn to look after yourself. Maybe try to prepare some meals that don’t require cooking? Sandwiches, cereal etc. It’s very normal for parents to cook dinner and for teenagers to prepare breakfast and lunch and get their own snacks.\n\nAgain, I don’t want to discount that this is an abusive situation, but I want to empower you to take hold of some of the situation for your own wellbeing instead of relying on her to provide you with something that she clearly has no intention of providing.",
          "created_utc": 1742021434.0
        }
      ]
    },
    {
      "id": "mhwh362",
      "author": "rusticterror",
      "body": "Yes, this is absolutely abuse and neglect. I was shocked to just see it called “toxic.” This isn’t “toxic,” this is a crime. OP, please tell a teacher or school counselor or the police. Someone needs to get CPS out there. \n\nI am so sorry. I know it’s scary; you deserve to be treated like a human being. This isn’t okay. As another adult, I’m furious at your mother.",
      "created_utc": 1742035569.0,
      "score": 12,
      "context": [
        {
          "id": "mhu792f",
          "author": "-abby-normal",
          "body": "This seems like an extremely unhealthy & toxic household. As your parent, it is her responsibility to take care of you, FEED YOU PROPERLY, and teach you the skills to be a functional person. Not doing that is neglect. Your mother is holding you back from living a normal life. \n\nUnfortunately, I don’t have any advice for you. It’s a really difficult situation without an easy answer. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry so your mom doesn’t worry about you burning the house down?",
          "created_utc": 1741996083.0
        },
        {
          "id": "mhvt5ua",
          "author": "FriedLipstick",
          "body": "I agree and I’ll take it a step further: OP’s mom is abusing OP. OP should talk to a trustperson at school or at the doctor’s. To provide healthy meals: breakfast is important for children attending school. Lunch the same. OP is there a way you can get some yoghurts and fruits? That will cover breakfast. And maybe some vegetables by going to the store together? I doubt your mother will get you that so please talk to a trust person. You also need guidance for having autism. I wish you the best.",
          "created_utc": 1742020194.0
        }
      ]
    },
    {
      "id": "mhudf3u",
      "author": "-abby-normal",
      "body": "There are delivery services for groceries like [instacart](https://www.instacart.com/?utm_medium=sem&utm_source=instacart_google&utm_campaign=ad_demand_search_brand_US-CATCHALL_headterm_exact&phrase_mobile_AUDACT&utm_content=accountid-1732890876_campaignid-10023670317_adgroupid-102598077042_device-m_adid-717347275336_network-g&utm_term=matchtype-e_keyword-instacart_targetid-kwd-297369219725_locationid-9016939&kskwid=1532524&ksadid=&gad_source=1&gbraid=0AAAAADO98hZW6P_oAx37cbjJMyxsW_9pn&gclid=CjwKCAjwp8--BhBREiwAj7og193I-Cj4F8ikDf7bCBeQZrnyKWIxcr-HDcEjiUBEcFBOSbnTUUIQSxoCx60QAvD_BwE) do you don’t have to go to the grocery store. There’s also subscription services like [blue apron](https://www.blueapron.com/pricing?gad_source=1&gbraid=0AAAAADtZEQvVrzRMV4SHakpgNTFmy2ZHM&gclid=CjwKCAjwp8--BhBREiwAj7og1wjPYppxS56n3VFMbrKBiwfO_hY8KT6oycmB4_IV-RBEzuV7jQf4RBoCnEgQAvD_BwE&plan=pnr&qty=4) who deliver personalized meals weekly. \n\nYour mom may say she can’t afford your “luxuries” but this is cheaper and healthier than takeout. Maybe you could convince her? Idk. If you have some money of your own maybe you could use it for this. I’m sorry I don’t have a better solution for you.",
      "created_utc": 1741998170.0,
      "score": 7,
      "context": [
        {
          "id": "mhu792f",
          "author": "-abby-normal",
          "body": "This seems like an extremely unhealthy & toxic household. As your parent, it is her responsibility to take care of you, FEED YOU PROPERLY, and teach you the skills to be a functional person. Not doing that is neglect. Your mother is holding you back from living a normal life. \n\nUnfortunately, I don’t have any advice for you. It’s a really difficult situation without an easy answer. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry so your mom doesn’t worry about you burning the house down?",
          "created_utc": 1741996083.0
        },
        {
          "id": "mhuafnd",
          "author": "BuildingWooden8877",
          "body": "What do you mean by this? \n\n>. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry",
          "created_utc": 1741997157.0
        }
      ]
    },
    {
      "id": "mhueake",
      "author": "BuildingWooden8877",
      "body": "I was thinking of doing something similar to those and I don't know if I'd be able to convince her to or get her to even listen to what I have to say because she doesn't like talking to me. Also I'm from the UK so I don't think those websites are available to me, but I'll try to have a look for alternatives and at least try to convince her.",
      "created_utc": 1741998469.0,
      "score": 4,
      "context": [
        {
          "id": "mhu792f",
          "author": "-abby-normal",
          "body": "This seems like an extremely unhealthy & toxic household. As your parent, it is her responsibility to take care of you, FEED YOU PROPERLY, and teach you the skills to be a functional person. Not doing that is neglect. Your mother is holding you back from living a normal life. \n\nUnfortunately, I don’t have any advice for you. It’s a really difficult situation without an easy answer. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry so your mom doesn’t worry about you burning the house down?",
          "created_utc": 1741996083.0
        },
        {
          "id": "mhuafnd",
          "author": "BuildingWooden8877",
          "body": "What do you mean by this? \n\n>. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry",
          "created_utc": 1741997157.0
        },
        {
          "id": "mhudf3u",
          "author": "-abby-normal",
          "body": "There are delivery services for groceries like [instacart](https://www.instacart.com/?utm_medium=sem&utm_source=instacart_google&utm_campaign=ad_demand_search_brand_US-CATCHALL_headterm_exact&phrase_mobile_AUDACT&utm_content=accountid-1732890876_campaignid-10023670317_adgroupid-102598077042_device-m_adid-717347275336_network-g&utm_term=matchtype-e_keyword-instacart_targetid-kwd-297369219725_locationid-9016939&kskwid=1532524&ksadid=&gad_source=1&gbraid=0AAAAADO98hZW6P_oAx37cbjJMyxsW_9pn&gclid=CjwKCAjwp8--BhBREiwAj7og193I-Cj4F8ikDf7bCBeQZrnyKWIxcr-HDcEjiUBEcFBOSbnTUUIQSxoCx60QAvD_BwE) do you don’t have to go to the grocery store. There’s also subscription services like [blue apron](https://www.blueapron.com/pricing?gad_source=1&gbraid=0AAAAADtZEQvVrzRMV4SHakpgNTFmy2ZHM&gclid=CjwKCAjwp8--BhBREiwAj7og1wjPYppxS56n3VFMbrKBiwfO_hY8KT6oycmB4_IV-RBEzuV7jQf4RBoCnEgQAvD_BwE&plan=pnr&qty=4) who deliver personalized meals weekly. \n\nYour mom may say she can’t afford your “luxuries” but this is cheaper and healthier than takeout. Maybe you could convince her? Idk. If you have some money of your own maybe you could use it for this. I’m sorry I don’t have a better solution for you.",
          "created_utc": 1741998170.0
        }
      ]
    },
    {
      "id": "mhuejn6",
      "author": "-abby-normal",
      "body": "I’m sorry your mother is so awful to you. I hope you can find a solution. Good luck.",
      "created_utc": 1741998556.0,
      "score": 6,
      "context": [
        {
          "id": "mhu792f",
          "author": "-abby-normal",
          "body": "This seems like an extremely unhealthy & toxic household. As your parent, it is her responsibility to take care of you, FEED YOU PROPERLY, and teach you the skills to be a functional person. Not doing that is neglect. Your mother is holding you back from living a normal life. \n\nUnfortunately, I don’t have any advice for you. It’s a really difficult situation without an easy answer. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry so your mom doesn’t worry about you burning the house down?",
          "created_utc": 1741996083.0
        },
        {
          "id": "mhuafnd",
          "author": "BuildingWooden8877",
          "body": "What do you mean by this? \n\n>. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry",
          "created_utc": 1741997157.0
        },
        {
          "id": "mhudf3u",
          "author": "-abby-normal",
          "body": "There are delivery services for groceries like [instacart](https://www.instacart.com/?utm_medium=sem&utm_source=instacart_google&utm_campaign=ad_demand_search_brand_US-CATCHALL_headterm_exact&phrase_mobile_AUDACT&utm_content=accountid-1732890876_campaignid-10023670317_adgroupid-102598077042_device-m_adid-717347275336_network-g&utm_term=matchtype-e_keyword-instacart_targetid-kwd-297369219725_locationid-9016939&kskwid=1532524&ksadid=&gad_source=1&gbraid=0AAAAADO98hZW6P_oAx37cbjJMyxsW_9pn&gclid=CjwKCAjwp8--BhBREiwAj7og193I-Cj4F8ikDf7bCBeQZrnyKWIxcr-HDcEjiUBEcFBOSbnTUUIQSxoCx60QAvD_BwE) do you don’t have to go to the grocery store. There’s also subscription services like [blue apron](https://www.blueapron.com/pricing?gad_source=1&gbraid=0AAAAADtZEQvVrzRMV4SHakpgNTFmy2ZHM&gclid=CjwKCAjwp8--BhBREiwAj7og1wjPYppxS56n3VFMbrKBiwfO_hY8KT6oycmB4_IV-RBEzuV7jQf4RBoCnEgQAvD_BwE&plan=pnr&qty=4) who deliver personalized meals weekly. \n\nYour mom may say she can’t afford your “luxuries” but this is cheaper and healthier than takeout. Maybe you could convince her? Idk. If you have some money of your own maybe you could use it for this. I’m sorry I don’t have a better solution for you.",
          "created_utc": 1741998170.0
        },
        {
          "id": "mhueake",
          "author": "BuildingWooden8877",
          "body": "I was thinking of doing something similar to those and I don't know if I'd be able to convince her to or get her to even listen to what I have to say because she doesn't like talking to me. Also I'm from the UK so I don't think those websites are available to me, but I'll try to have a look for alternatives and at least try to convince her.",
          "created_utc": 1741998469.0
        }
      ]
    },
    {
      "id": "mhxon8c",
      "author": "wariowars",
      "body": "Deliveroo, justeat, and Uber eats in the UK have grocery shops on them as well as takeaways. Tesco also has a “whoosh” option, where they deliver quickly, from a Tesco express if you have one locally. \n\nJusteat and Deliveroo both do money off vouchers for grocery deliveries quite often too, hope that helps",
      "created_utc": 1742053228.0,
      "score": 4,
      "context": [
        {
          "id": "mhu792f",
          "author": "-abby-normal",
          "body": "This seems like an extremely unhealthy & toxic household. As your parent, it is her responsibility to take care of you, FEED YOU PROPERLY, and teach you the skills to be a functional person. Not doing that is neglect. Your mother is holding you back from living a normal life. \n\nUnfortunately, I don’t have any advice for you. It’s a really difficult situation without an easy answer. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry so your mom doesn’t worry about you burning the house down?",
          "created_utc": 1741996083.0
        },
        {
          "id": "mhuafnd",
          "author": "BuildingWooden8877",
          "body": "What do you mean by this? \n\n>. Is there a way you could get frozen meals delivered to heat up in the microwave when you are hungry",
          "created_utc": 1741997157.0
        },
        {
          "id": "mhudf3u",
          "author": "-abby-normal",
          "body": "There are delivery services for groceries like [instacart](https://www.instacart.com/?utm_medium=sem&utm_source=instacart_google&utm_campaign=ad_demand_search_brand_US-CATCHALL_headterm_exact&phrase_mobile_AUDACT&utm_content=accountid-1732890876_campaignid-10023670317_adgroupid-102598077042_device-m_adid-717347275336_network-g&utm_term=matchtype-e_keyword-instacart_targetid-kwd-297369219725_locationid-9016939&kskwid=1532524&ksadid=&gad_source=1&gbraid=0AAAAADO98hZW6P_oAx37cbjJMyxsW_9pn&gclid=CjwKCAjwp8--BhBREiwAj7og193I-Cj4F8ikDf7bCBeQZrnyKWIxcr-HDcEjiUBEcFBOSbnTUUIQSxoCx60QAvD_BwE) do you don’t have to go to the grocery store. There’s also subscription services like [blue apron](https://www.blueapron.com/pricing?gad_source=1&gbraid=0AAAAADtZEQvVrzRMV4SHakpgNTFmy2ZHM&gclid=CjwKCAjwp8--BhBREiwAj7og1wjPYppxS56n3VFMbrKBiwfO_hY8KT6oycmB4_IV-RBEzuV7jQf4RBoCnEgQAvD_BwE&plan=pnr&qty=4) who deliver personalized meals weekly. \n\nYour mom may say she can’t afford your “luxuries” but this is cheaper and healthier than takeout. Maybe you could convince her? Idk. If you have some money of your own maybe you could use it for this. I’m sorry I don’t have a better solution for you.",
          "created_utc": 1741998170.0
        },
        {
          "id": "mhueake",
          "author": "BuildingWooden8877",
          "body": "I was thinking of doing something similar to those and I don't know if I'd be able to convince her to or get her to even listen to what I have to say because she doesn't like talking to me. Also I'm from the UK so I don't think those websites are available to me, but I'll try to have a look for alternatives and at least try to convince her.",
          "created_utc": 1741998469.0
        }
      ]
    }
  ]
}