{
  "id": "1jcwycq",
  "subreddit": "EatingDisorders",
  "author": "likpinklady",
  "created_utc": 1742162435.0,
  "title": "My partner opened up about how my ED is affecting our sex life",
  "selftext": "\nI’ve lost a lost of weight in the last year but I’m still fat. Literally obese category still because I was huge to begin with.\n\nMy partner (of 3 years) took me to the GP last week and told them everything. The GP said she was very concerned and made an instant referral to ED services for me. \n(I then saw my psychiatrist a few weeks later who was very “you don’t have an ED it’s your BPD and only /I/ can approve a referral to ED services” so I don’t actually know what’s happening with that..)\n\nAnyways, whilst having a naked cuddle with my partner in bed last night, I felt that firey tingling in my stomach, just dying for him, because it’s been a while. \nI made a move but he gently moved my hands away and went back to just holding me. \nI brought up to him that I’d noticed we hadn’t been intimate in a while. \nNot since Valentine’s Day. It had been a bit sporadic before this, but we’d never gone a full month without making love before.\nEverything else is still there, cuddles, little kisses ect, just not THAT. I asked if he would tell me what was going on for him. \n\nAt first he tried to say it was nothing, people just have dry spells, but then opened up and said that he didn’t feel like he could “do it to me” right now. I asked what he meant and he went on to explain that he just cannot have sex with me when I’m “so vulnerable” and said that he felt like he’d be taking advantage of me. \nI asked what on earth he was talking about and he said “you’re just so.. sad. You’re so ill. I feel like I have to look after you at the moment, I have to take care of you. It wouldn’t feel right.” \n\nI never realised he felt so strongly about what was going on because he never really voiced it much other than saying a few times that he’s concerned and of course asking if he could take me to the doctor. He’s never said anything to me when I go away to throw up what little dinner I’ve eaten in the evening, even though he knows what I’m doing. So I just never thought it was a big thing for him. \n\nHe went on to say that he feels like he’s in “carer mode” right now and it’s hard to get into “lover mode.” \nI said that I’m not always sad, and he said that I must be, to starve myself and make myself sick and “take all these pills.” \n\nI understand where he’s coming from and respect his feelings, but can’t help feeling so sad and rejected. \nI asked him to try and remember that I’m a multi-dimensional human being who can be many things at once. \n\nAnd there was me thinking I’d be more attractive to him if I lost weight. Instead my disorder makes him feel like my “carer.”\n\nWe had another cuddle and went to sleep.\n\nReflecting on it today, I don’t know what to do because I don’t want to and CAN’T stop this until I’m actually thin. I have so long to go.\n\nI’m so sad that it’s making him feel like this and ruining our intimacy. 😢 \n\nHow do I help him back into “lover” mode? Or am I just repulsive to him now?\n\nTLDR; I have an eating disorder and my partner said sex with me wouldn’t “feel right” because he sees me as so vulnerable right now, he feels like he needs to just “look after me.” ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jcwycq/my_partner_opened_up_about_how_my_ed_is_affecting/",
  "score": 155,
  "num_comments": 17,
  "comments": [
    {
      "id": "mi6f14w",
      "author": "Spinosaur_Flip",
      "body": "Just want to let you know that eating disorders are dangerous and can have deadly consequences, no matter your current size/weight. Malnutrition happens at any size, and the physical effects of purging are very real. I purged daily for a long time and almost died a few times- in fact I’m very very lucky to still be alive. I know that knowing the dangers doesn’t magically make the eating disorder thoughts vanish- I know it’s hard. I just also want you to be aware. Your struggles are real and valid, and you do deserve freedom from it.",
      "created_utc": 1742169686.0,
      "score": 105,
      "context": []
    },
    {
      "id": "mi70lc5",
      "author": "cutiepie538",
      "body": "You 100% CAN stop this before you are “thin”. It is possible, you just need to want to recover and receive treatment. \n\nUnfortunately though, if the ED wins and you continue to starve yourself until you’re thin (if you get to whatever weight, because your body may decide to stop losing weight no matter how little you eat), you may lose your partner as a sacrifice. It’s a very sad reality that happens often in relationships where one party has an eating disorder.",
      "created_utc": 1742177444.0,
      "score": 53,
      "context": []
    },
    {
      "id": "mi7dm2l",
      "author": "CacaoMilfMama",
      "body": "as someone who started out “fat” and is now thin…if you wait until you’re thin to stop it’ll already be too late.",
      "created_utc": 1742182664.0,
      "score": 53,
      "context": []
    },
    {
      "id": "mi61wml",
      "author": "alienprincess111",
      "body": "Thanks for sharing this.  It seems your partner cares about you a lot. It's very sweet.  I have a similar issue in my sex life in terms of a dry spell, but I'm pretty sure it's because my husband doesn't find me attractive anymore, sadly...  I don't really mind because I don't want to so it either generally as I don't like how I look and don't want to be seen/touched.",
      "created_utc": 1742165253.0,
      "score": 82,
      "context": []
    },
    {
      "id": "mi6bz8o",
      "author": "Ardie_BlackWood",
      "body": "This is a very real thing that can happen in relationships where one partner is struggling with a mental/physical illness. I suggest couple's counseling as you partner probably has felt this way for longer than he even realizes and got so used to it. \n\nI will also say that you risk the relationship anytime with a ED no matter the type or severity. You have to sit and discuss with him your thoughts on what will happen if you continue down this path. Will he stay with you as your partner or as your caregiver? \n\nBecause eventually, you or him might make a decision that it's one or the other.",
      "created_utc": 1742168642.0,
      "score": 23,
      "context": []
    },
    {
      "id": "mi8nwwd",
      "author": "mooneyedbaby",
      "body": "To me, the most troubling aspect of this post is where you say \n\n“I don’t want to and CAN’T stop this until I’m actually thin.” \n\nThat is a thought/feeling that you should express to your medical caretaker and possibly your partner as well. Your partner isn’t rejecting you because of your body, they’re only apprehensive because they are aware that you aren’t in a great place mentally/emotionally and they care more about your safety and wellbeing than their own sexual needs, which is something to be appreciated rather than scrutinized. That being said, I do understand why this would bother and/or hurt you. I would feel the same.\n\nYou NEED to work on your ED and coming to love and accept yourself as you are in reality. If you truly are overweight you can work on that with your doctor, but #1 priority needs to be your mental health so that you can lose that weight in a healthy way that will be sustainable. \n\nJust talk to your partner about all your feelings, no matter how embarassing or awkward. If they’re right for you they will do their best to hear you out and be there for you. \n\nI wish you the best, ED is a very lonely and shameful feeling battle in my own experience, but if you share your burden with your loved ones it’s not as hard to carry as on your own. \n\nAlso if couples therapy is an option, maybe explore that together, especially if you can find someone with some experience with ED, so they can help yall navigate the relationship with the ED in mind, and help yall navigate the sexual aspect of things during this journey. \n\nBest of luck!!",
      "created_utc": 1742209632.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mi8p93j",
      "author": "FloridaMomm",
      "body": "We had a dry spell when my husband’s anorexia was at its peak, because looking at him with his shirt off literally made me want to cry. Six months into recovery we stumbled across a body checking picture from that time and I started sobbing uncontrollably. Even he now expresses shock and compared the way he looked to a concentration camp survivor. \n\nI love him no matter how he looks of course. But when he looked so visibly sick that that’s all I could see, it’s impossible to ignore it. It took us a while to find our way back, a dry spell is just a temporary thing",
      "created_utc": 1742210311.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mi7716r",
      "author": "MaizeMiserable3059",
      "body": "Hi, it sounds like your partner is putting down a boundary. He is attempting to communicate that he loves you for you, no matter what size you are. And that you losing weight like this  is actually very concerning to him. \n\nI'm wondering what your big why is. Health? Because having an ED is extremely unhealthy and more dangerous than obesity. Love? Your partner made it clear that it's not for him that you should lose weight. Recognition? You'll certainly get recognition from everyone when losing weight rapidly, so it's good to be aware of that. But that's not the only way to gain recognition. A sense of control? It's exhilarating to have this iron self-control, also good to be aware of that. But you could get that with going to the gym and doing difficult exercises for example. \nSo why does it have to be an ED? What does the ED provide you with that you would risk your health and relationship for it? X",
      "created_utc": 1742179941.0,
      "score": 17,
      "context": []
    },
    {
      "id": "miad9i3",
      "author": "mallad",
      "body": "Disordered eating is not a weight loss method, and your psychiatrist is incorrect, a GP can absolutely refer you to ED services. You can usually go without any referral at all. \n\nYou don't want to use this method to lose weight, because your body will not properly lose weight when it's in starvation mode. It will eat itself to keep going, and that means NOT just fat, but it will eat your muscles and bones as well. Anywhere it can get energy it needs to keep the organs going. You'll lose menstruation and then all sexual drive or function. You'll get fatty liver which could progress to cirrhosis and liver failure. You'll get dry skin and hair, bloating which will make you appear larger than you really are, and the body will shut down. Muscle uses more calories at rest than fat does, but when you starve or purge, you'll lose muscle mass even if you're exercising. That means your body naturally burns less calories, and you'll have to restrict even more. \n\nThe best part? When your body is finally shutting down, you're practically dying and you *need* inpatient help, you'll have to eat so much for so long to recover that you'll gain a strong part of the weight back. And it will hurt, because you'll bloat as you reintroduce food through the day, and the body will be repairing itself so you'll be tired constantly and eating constantly on a schedule. But you'll be eating 5k calories a day or more, because your body has to get out of starvation panic mode before it will then use that energy to repair you. So you'll still have to gain that weight back, then use healthy methods to convert it to muscle or lose weight. \n\nSo save yourself the pain and money and liver damage. Get to an ED service, and start some exercise programs. If you have physical impairments, get to physical therapy. Otherwise, start with something like Couch to 5k and a light muscle building routine, could even be calisthenics. This will allow you to eat, build muscle, lose fat, and your partner won't have to be a caretaker anymore and might find you attractive again. I can tell you from experience the most sexy and attractive non-sexual thing my wife can do is exercise. Yeah I know it'll make her feel better and happier and make her healthy and look good, but honestly just seeing her body doing some work, and moving around in various ways, it's attractive. But losing weight without any muscle tone or anything, you won't look sexy or good. You'll look sickly. And that's obviously what your partner feels. So if you're doing any of this for him, do what I said above and do it the right way, because that's what he will be attracted to.",
      "created_utc": 1742230742.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mibwzvm",
      "author": "batboiben",
      "body": "You're multidimensional, but so is love. Genuine love doesn't boil down to attractiveness. It sounds like he loves you more than sex. I was in a similar situation prior to my semi recovery. It seems really unlikely that he finds you repulsive, that sounds more like self projection to me bc of the insecurity that EDs cause. Also, you need a new psychiatrist ASAP lol. Are you being 100% honest with them?",
      "created_utc": 1742246741.0,
      "score": 3,
      "context": []
    },
    {
      "id": "micih6v",
      "author": "SapphireSky7099",
      "body": "I am clinically “obese” and suffering severe consequences of chronic malnutrition. It can disable you in ways people don’t talk about. The nerve damage you can get from starving yourself can be irreversible. It can affect every system of your body. Being thin is pointless when your body is too dysfunctional to do anything and existing is torture. It’s not worth it. I promise. \n\nI’ve never been thin in my life and yet… here I am. Physically disabled by it. \n\nYour partner loves you so much. Please take care of yourself.",
      "created_utc": 1742253549.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mic71x8",
      "author": "stoutsnoutt",
      "body": "Hi friend. I’m really sorry this is happening. I’ve been in a similar situation, not exactly the same, but similar. I had experienced something extremely traumatic, and was almost a year into my relationship w my man, but I kinda felt it was best to leave him. So I did, and I got to a point where I was so thin that I almost looked skeletal. We got back together, and he expressed similar concerns your partner has. He felt like he had to take care of me and treat me as though I were fragile. What helped us was nurturing our relationship, and the intimacy followed. The happiness from our relationship got us back into healthy intimacy and I got back up to a healthy weight. So that’s kinda what I’d suggest for you and your partner. Focus on nurturing your relationship, opening communication, let him know what’s going on. Do fun things together, even if it’s just watching movies. I didn’t read anywhere that he said he’s no longer attracted to you, so I’m sure he still is, he just cares deeply about you, wants to treat you right, and wants to see you healthy mentally. Open up, let him know what he can do to help you. \nI also really recommend finding a therapist that specializes w EDs. My therapist was formerly and nutritionist, gymnast, and nurse who has also experienced having an ED. I can’t tell you how much having their expertise has healed me, so even if you don’t get referred to ED services, you can still get professional help. Finding a good therapist can be a tough battle, so don’t take any shit. If you feel like you and a therapist aren’t meshing, don’t stick around. Skip them and find another one. There is someone out there who will help you. Good luck friend, you are stronger than you realize. We’re here for you, and thank gods you are not doing this alone. Lean on your partner, it will help tremendously. \nTL;DR: Focus on nurturing your relationship w your partner, open your communication w him and intimacy may follow. Lean on him, let him know how to help you, his support means more than you may realize right now. And even if you don’t get referred to ED services, there are therapists that are available to help you. If you don’t like one, skip em and move on to the next. Don’t take shit from any healthcare provider.",
      "created_utc": 1742249852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mice8op",
      "author": "Angelbby720",
      "body": "Honestly he’s pretty valid for that. I’ve tried loving someone through mental illnesses and sometimes it kills the partner as much as it kills you. I don’t think he’s repulsed by you. I think he’s worried and you should just take it day by day",
      "created_utc": 1742252173.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mipg6gy",
      "author": "None",
      "body": "Mal nutrition has ruined my life . I now have colon cancer !",
      "created_utc": 1742426486.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mi6g7bu",
      "author": "Spinosaur_Flip",
      "body": "One more thing- my husband struggled a lot throughout my eating disorder too. Although the primary reason we lacked intimacy was due to me being insecure and having trauma flashbacks, he struggled too- seeing my body made him sad, because it reminded him of my pain. And that was a hard pill for me to swallow. \n\nIt can be hard to have someone care so much, and to see them hurting due to witnessing our struggles. But now that I’m on the other side, I’m so grateful that he cared the whole time. So glad he was invested in my wellbeing. \n\nEating disorders affect our loved ones and relationships, they do. But it is possible to get through it together.",
      "created_utc": 1742170091.0,
      "score": 27,
      "context": [
        {
          "id": "mi6f14w",
          "author": "Spinosaur_Flip",
          "body": "Just want to let you know that eating disorders are dangerous and can have deadly consequences, no matter your current size/weight. Malnutrition happens at any size, and the physical effects of purging are very real. I purged daily for a long time and almost died a few times- in fact I’m very very lucky to still be alive. I know that knowing the dangers doesn’t magically make the eating disorder thoughts vanish- I know it’s hard. I just also want you to be aware. Your struggles are real and valid, and you do deserve freedom from it.",
          "created_utc": 1742169686.0
        }
      ]
    },
    {
      "id": "mi6fbcs",
      "author": "Spinosaur_Flip",
      "body": "Also if your psychiatrist won’t make a referral for the ED services, you can reach out to the ED services on your own. A lot of places will accept you in without a referral.",
      "created_utc": 1742169784.0,
      "score": 20,
      "context": [
        {
          "id": "mi6f14w",
          "author": "Spinosaur_Flip",
          "body": "Just want to let you know that eating disorders are dangerous and can have deadly consequences, no matter your current size/weight. Malnutrition happens at any size, and the physical effects of purging are very real. I purged daily for a long time and almost died a few times- in fact I’m very very lucky to still be alive. I know that knowing the dangers doesn’t magically make the eating disorder thoughts vanish- I know it’s hard. I just also want you to be aware. Your struggles are real and valid, and you do deserve freedom from it.",
          "created_utc": 1742169686.0
        }
      ]
    },
    {
      "id": "mi7k7d3",
      "author": "RealisticPepper5308",
      "body": "i second this. your body and ESPECIALLY your heart can only take so much",
      "created_utc": 1742185693.0,
      "score": 17,
      "context": [
        {
          "id": "mi7dm2l",
          "author": "CacaoMilfMama",
          "body": "as someone who started out “fat” and is now thin…if you wait until you’re thin to stop it’ll already be too late.",
          "created_utc": 1742182664.0
        }
      ]
    }
  ]
}