{
  "id": "1jdnitq",
  "subreddit": "EatingDisorders",
  "author": "fredbearplushy10",
  "created_utc": 1742244850.0,
  "title": "is this weird",
  "selftext": "i don't know if this is weird/bad/insensitive but sometimes i get kind of jealous (??) when i see people (particularly girls) around my age with eating disorders. (not specifying exact age, but im a teenager) my brain just tells me 'if she can do it why can't you?' 😭😭 i already have really disordered eating habits so it just makes me feel like i have to eat less than i already do :/",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jdnitq/is_this_weird/",
  "score": 44,
  "num_comments": 15,
  "comments": [
    {
      "id": "micswxy",
      "author": "Regular_creative1999",
      "body": "Disordered eating and thoughts are so compulsive and competitive, I get it.",
      "created_utc": 1742257012.0,
      "score": 27,
      "context": []
    },
    {
      "id": "midhntm",
      "author": "erinclairee",
      "body": "Not at all. I completely understand. I also feel like as a girl with bulimia, when i see girls with ana i feel jealous and like i failed at that.",
      "created_utc": 1742265645.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mihama9",
      "author": "Forever_Alone51023",
      "body": "This is not unusual...at least I don't believe it is. I feel the same and I am probably 40 years older than you are! Every time I see a really thin girl...my thoughts are why don't you look like that? The sad part is that I actually DO look just like that...it's pathetic how I look fat when I look at myself. My stomach pooches out way too much and my shoulders are too broad...yuck. I know how you feel hon. I feel the same. ❤️❤️ I'm sending you some love and strength, and maybe we can both beat our EDs right? Yeah. Good luck!❤️❤️",
      "created_utc": 1742322186.0,
      "score": 3,
      "context": []
    },
    {
      "id": "micyzqp",
      "author": "One-Importance7269",
      "body": "I have this same issue.  Competition is just part of it for some people.  I’m naturally competitive with everything so with Ed it’s worse.",
      "created_utc": 1742259052.0,
      "score": 2,
      "context": []
    },
    {
      "id": "miufswg",
      "author": "Most_Distribution444",
      "body": "hey! I'm also a teenage girl (16) , who's grown up with people with EDs, including my mum and sisters alongside of friends, whilst having a very bad relationship with food from a young age myself. Eating/food, even not disordered, is so sensitive for anyone, even those who don't 'think they have an ED' or other things like that. jealously isn't something to be guilty about, rather acknowledged and analysed, like finding the root why do you feel like that and why do you feel that jealousy. we live in a society and are surrounded by industries which feed off of competition and jealousy like social media that, even if not intentional, idolises and both shames every single body, whether slim or larger - and this industry almost standardises and promotes competition within this as well as jealousy, but I'm also not saying its the industries fault people feel jealousy, but it defiantly normalises it and almost thrives off of it. its not so simple to just not analyse peoples bodies and idolise them, especially if they fit the beauty standard, which is obviously being slimmer. i think you really need to focus on whether your jealous of their body, or the fact that they have an eating disorder, then work forwards. don't ever feel bad for these thoughts, i have them and so many do, you cant control how you think but you can control how u moderate it and work from it. stay safe!!!!",
      "created_utc": 1742497683.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mid3ug2",
      "author": "unknowndrillbaby",
      "body": "hi i’m 14f and i don’t think i have an eating disorder but all i know is i can not eat due to my depression and it’s caused me to get so skinny and so frail and so insecure this is nottt what you want. i feel terrible daily and all i do is sleep. love yourself !!",
      "created_utc": 1742260744.0,
      "score": 2,
      "context": []
    },
    {
      "id": "micqmm2",
      "author": "alienprincess111",
      "body": "How do you know they have EDs?  You often can't tell by just looking at a person.",
      "created_utc": 1742256248.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mie3xna",
      "author": "Superb-Patience4530",
      "body": "Ok I didn’t mean to vent but Ive had anorexia nervosa for 2 years and trust me the mental pain and doctor appts are so hard to go through",
      "created_utc": 1742275578.0,
      "score": 1,
      "context": []
    },
    {
      "id": "migry7q",
      "author": "One_Strategy4218",
      "body": "It’s not weird or bad or insensitive; it’s just a feeling that you have awareness of and can be like why do I feel this way and trace it back to a root",
      "created_utc": 1742317112.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mivao7r",
      "author": "Countagula",
      "body": "Not at all! Eating disorders are competitive to a lot of people, not everyone feels the same but you’re definitely not alone when you have these thoughts :)",
      "created_utc": 1742506681.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj9esgq",
      "author": "Open_Priority7402",
      "body": "I’m so sorry you’re going through this. It’s part of the disorder. Anyone thinner than you is a goal you need to beat. It’s awful. Please seek help because this can destroy your life.",
      "created_utc": 1742703500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj9f0kf",
      "author": "Open_Priority7402",
      "body": "Yeah within the ED community there is definitely that vibe as if anorexics are purists or something.",
      "created_utc": 1742703608.0,
      "score": 1,
      "context": [
        {
          "id": "midhntm",
          "author": "erinclairee",
          "body": "Not at all. I completely understand. I also feel like as a girl with bulimia, when i see girls with ana i feel jealous and like i failed at that.",
          "created_utc": 1742265645.0
        }
      ]
    },
    {
      "id": "micyn0c",
      "author": "One-Importance7269",
      "body": "Game usually recognizes game",
      "created_utc": 1742258932.0,
      "score": 20,
      "context": [
        {
          "id": "micqmm2",
          "author": "alienprincess111",
          "body": "How do you know they have EDs?  You often can't tell by just looking at a person.",
          "created_utc": 1742256248.0
        }
      ]
    },
    {
      "id": "mid2ink",
      "author": "alienprincess111",
      "body": "That's not necessarily true. I've had ED for 27 years.  I often think someone has an ED by looking at them, when they actually don't at all. I guess it's a projection of sorts?",
      "created_utc": 1742260276.0,
      "score": -1,
      "context": [
        {
          "id": "micqmm2",
          "author": "alienprincess111",
          "body": "How do you know they have EDs?  You often can't tell by just looking at a person.",
          "created_utc": 1742256248.0
        },
        {
          "id": "micyn0c",
          "author": "One-Importance7269",
          "body": "Game usually recognizes game",
          "created_utc": 1742258932.0
        }
      ]
    },
    {
      "id": "miefvzb",
      "author": "None",
      "body": "I’m the same way. One day I heard something about someone’s mom and how she is really into nutrition and they weigh everything and they eat little but very healthy.\n\nTurns out she was a foods and nutrition professor…",
      "created_utc": 1742282962.0,
      "score": 3,
      "context": [
        {
          "id": "micqmm2",
          "author": "alienprincess111",
          "body": "How do you know they have EDs?  You often can't tell by just looking at a person.",
          "created_utc": 1742256248.0
        },
        {
          "id": "micyn0c",
          "author": "One-Importance7269",
          "body": "Game usually recognizes game",
          "created_utc": 1742258932.0
        },
        {
          "id": "mid2ink",
          "author": "alienprincess111",
          "body": "That's not necessarily true. I've had ED for 27 years.  I often think someone has an ED by looking at them, when they actually don't at all. I guess it's a projection of sorts?",
          "created_utc": 1742260276.0
        }
      ]
    }
  ]
}