{
  "id": "1jdv2b9",
  "subreddit": "EatingDisorders",
  "author": "erinclairee",
  "created_utc": 1742265598.0,
  "title": "is it odd to be open about having an eating disorder with people?",
  "selftext": "I 15f have struggled with bulimia for about 2 years. I know, I know, it's very bad. My question is when I tell people that or it comes up in conversation they always sorta freak out (\"omg are you okay?\" \"i had no idea\" ect.) but then they will immediately go to \"wait your not in active recovery?\" no lol. i understand people concern but I really didn't think its that big of a deal. and idk if its because that's my normal now or what but i will always answer any questions and be open. so, is my take odd? (sorry if this is bad im shivering and it's very late at night) ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jdv2b9/is_it_odd_to_be_open_about_having_an_eating/",
  "score": 47,
  "num_comments": 28,
  "comments": [
    {
      "id": "mie5ruc",
      "author": "universe93",
      "body": "It’s really good to open up about it I think. But just know at your age some people will have pretty big concerns about you and whether your parents/guardians know. I’m 35 and you want to get a handle on this now, before it becomes the rest of your life",
      "created_utc": 1742276622.0,
      "score": 41,
      "context": []
    },
    {
      "id": "mier01t",
      "author": "rusticterror",
      "body": "Overall, talking about eating disorders is a good idea, but if you’re not pursuing recovery, it will make people especially uncomfortable. It’s like hearing about someone’s in progress drug addiction or self harm: it’s stigmatized and taboo and makes everyone concerned and uncomfortable. I wish it were different, but that is the reality of the situation. \n\nI’ve had my ED for…wow, longer than you’ve been alive (damn I’m old; when did that happen😭). Even though I’m in and out of recovery, it never gets less awkward for people outside the recovery community to have those talks with me. \n\nYou’re not doing anything wrong, and that doesn’t mean you **shouldn’t** talk about it; it’s a societal issue. We just have to make informed decisions about how much we want to make public about our illnesses given that there is that stigma.\n\nAlso, talk to adults about it! Doctors, teachers, counselors, etc.. you deserve help. The earlier you start, the less permanent damage the ED will do to your brain and body.",
      "created_utc": 1742290362.0,
      "score": 33,
      "context": []
    },
    {
      "id": "mif3rt1",
      "author": "onyxjade7",
      "body": "It’s about being selective who you share with. The post office person doesn’t need to know, your classmates you’re not friends with don’t need to know. You’re close friends absolutely it’s ok but, we don’t get to choose how people respond. It’s something if you choose to share (learning the hard way - being selective with your vulnerabilities is a good life lesson), except people to get weird around you even those who are close. For those who care they’d be worried and automatically want to help you get treatment. For those that don’t like the person said it’s like a person in the throes of addiction and self harm admitting that but doing nothing about it. They wondering why are you telling me, and if you don’t want help why are you talking about it. The thing people who don’t suffer from it don’t realize acknowledging it is important, that the secrecy is what keeps a person ill.\n\nMay I ask what your motivation for telling people is verses seeking help and talking to a professional? As someone with an ED their is no judgment (I’ve just been down this road with my ED, we’re all different but I get it.) perhaps getting to the bottom of why you need to tell everyone but not seek help is a good start. They have help lines if that’s an easier way to begin. I wish you recovery and hope you get the support you need. Take care.\n\nIf you have a student counsellor or trust your parents they would be the most helpful. But, again they have free lines to connect you with help and services.",
      "created_utc": 1742297361.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mie5vv1",
      "author": "Superb-Patience4530",
      "body": "My experience was hard… I 13f opened up to my lunch group abt being anorexic and the were rlly supportive and even encouraged me to eat even at points where I just wanted to give up… that is until I Opened up to the wrong person and she told everyone I was faking and even started pretending she was anorexic and started copying my behaviors.",
      "created_utc": 1742276686.0,
      "score": 9,
      "context": []
    },
    {
      "id": "miei96i",
      "author": "houston_veronica",
      "body": "\"Secrets keep you sick\".  That old adage is a way of remembering how ED's thrive in secret. When you don't keep them secret, then you at least have a better chance of something/someone making an impact that will push you to recover. When you start hiding and living in secret, you give the ED a LOT of power. \n\nPlease get help, as it will only get worse and we all know where \"worse\" leads....",
      "created_utc": 1742284542.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mifpms2",
      "author": "picturesquepooper",
      "body": "i’m 17f, and have been an ana-bulimic for four years now. people are just weird about eating disorders, period, and bulimia seems worse cause for some reason non disordered people view it as more brutal even though all disorders are equally shitty. regardless, i do think you should talk about it. i get the whole im not in recovery and i dont want to be in recovery thing, but its So Bad For You, and it’ll get worse down the line.",
      "created_utc": 1742305805.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mifpskr",
      "author": "Panzerfaust77",
      "body": "Hello, I’ve been fighting ED for 20+ years. Check out https://www.nationaleatingdisorders.org. They have a lot of resources. My diagnosis was also bulimia nervosa. You need to see a doctor to evaluate your health. It is a big deal. This does not have to be your normal. Please PM me.",
      "created_utc": 1742305857.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mie1609",
      "author": "egt2190",
      "body": "Absolutely not weird to open up about it. Please do. Its so much better to spread awareness and not keep it in",
      "created_utc": 1742274081.0,
      "score": 4,
      "context": []
    },
    {
      "id": "migdehm",
      "author": "DyskoliHyneka",
      "body": "I think that people don’t know how to talk about this or what to say",
      "created_utc": 1742312947.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mii6mu4",
      "author": "Stingwing4oba",
      "body": "It is OK to be open. It took me a long time to be open about my history and my dietician took me seriously about me wanting to fight a relapse.\n\nOne person in my life claims I am always lying to my dietician, but she never goes to appointments and I actually never told her I went, she heard it from the local grapevine.\n\nIn fact being open about it actually helped with the recovery process",
      "created_utc": 1742331293.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mijc97s",
      "author": "eagle_patronus",
      "body": "I (38F) was open a little bit with my psychiatrist, and today she asked if I was purging. Was able to be honest and say no. And earlier they’d weighed me. Won’t say the number, but I was pleased. All this to say, it felt alien talking about it.",
      "created_utc": 1742344196.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mike5gf",
      "author": "ButterflyHarpGirl",
      "body": "I think you are SO BRAVE to be so open!!! There is not enough discussion about EDs in non-ED spaces… I think you for being so brave at such a young age to be so open, helping destigmatize (even if that’s not your intent) EDs, as well as possibly helping others to be able to come forward about their struggles, even though you may not know about it yourself.",
      "created_utc": 1742358420.0,
      "score": 2,
      "context": []
    },
    {
      "id": "minipxv",
      "author": "AkitoYaname",
      "body": "I am mostly recovered, but still struggling sometimes. Opening up about my struggles with my ed has greatly helped me. Yes, it's a shocker for most people, especially if you're not in active recovery or recovered, but it also evens the way towards that point and helps to build yourself a support network. when i first opened up to my mom, she was crushed. But she has looked into how to help me when i struggle again. My colleagues are more careful with food comments around me and encourage me to try new things without pressure, which has helped me regain my relationship with food.",
      "created_utc": 1742405632.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mio4tor",
      "author": "None",
      "body": "i had it as a secret for most of my life, started to open up but now I stopped talking about it, people either don't understand or feel pity and I hate being seen s ill and fragile and it's hell to even eat or not eat around people who know, they think everything I do around food Is disordered and try to force me to eat when I don't want",
      "created_utc": 1742412017.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mip2wqg",
      "author": "Own-Jury-7204",
      "body": "I don’t know. I don’t tell people about my ed because to be honest most people don’t give a shit. or it grosses them out (especially bulimia). also i told a few people and they used it against me so yeah im done. i dont think i will ever tell anyone about it. and it sucks. i really want to talk to someone about it. but people are so judgmental and they think that only on ed exist - anorexia. and when you’re not deadly skinny you’re faking it.",
      "created_utc": 1742422262.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mir2hgy",
      "author": "youthful-garbage",
      "body": "I think if you are willing to speak about it, that is a massive strength and you are making others aware of the struggles of an ED. giving them education on it can make the world a little easier for the rest of us struggling because if more people understand, we can break the stigma and normalize getting help. I appreciate that you are willing to be open about it.",
      "created_utc": 1742449201.0,
      "score": 2,
      "context": []
    },
    {
      "id": "miefcbm",
      "author": "None",
      "body": "To be real, if you are not in active recovery, I wouldn’t tell anyone unless they ask. This might be pretty unhelpful advice but it appears to me that you don’t want to recover just yet and no one can force it on to you. \n\nIt’s good to be open but people might start treating you differently once they know and IMO it’s  frustrating having others treat you like you’re sick (which you are)\n\nI’m not in active recovery as well so I can understand if everybody else disagrees with this",
      "created_utc": 1742282596.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mihnsef",
      "author": "Prudent-Squirrel9698",
      "body": "It’s OK to be open if youre comfortable with it. Have you considered why you are so open about it? It’s less-so odd and moreso uncommon to be open about it. In any case, it is a big deal. Im 34 and wasnt much older than you when I became bulimic after years of struggling with body image. It’s impacted my dental health and I needed a gum graft; it’s impacted by bone health which coupled with other factors,led to YEARS of chronic pain.\n\nYou are destroying yourself from the inside out, literally. This disease takes your physical health as it leeches at your soul. IT ISNT WORTH IT.\n\nMy advice: Attempt to seek therapy and find a healthy, productive way to work through stress and your relationship with food and your body.\n\nI hope you’ll find recovery soon💛",
      "created_utc": 1742325960.0,
      "score": 2,
      "context": []
    },
    {
      "id": "miheqcu",
      "author": "nervous_veggie",
      "body": "Depends, if you want help or support then it’s a great idea. This might sound stupid but I don’t see why you’d want people to know otherwise, as their response (if they’re even remotely a normal person) would be concern, which is only beneficial if you actually want support or understanding.",
      "created_utc": 1742323372.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mivpkc5",
      "author": "Minimum_Stuff9064",
      "body": "I am very open about it. Partially because I wanna give others a safe space to share if they want to but also because I've always been very open about my physical/psychological ailments",
      "created_utc": 1742511363.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj9cfd6",
      "author": "Open_Priority7402",
      "body": "People are right to be concerned about your mental illness. Because that’s what EDs are, a mental illness. Not a lifestyle choice. \n\nThe effects of bulimia can be extremely serious and deadly. Trust me I know. I destroyed my teeth and am about to pay $15,000 to crown my top eight. \nMy ED destroyed my marriage, my career, my relationships with friends. I had to have my gall bladder removed and my bones now break at the drop of a hat. \n\nWatch your potassium levels because they can drop very fast due to excessive water loss in a short period of time. Potassium is an electrolyte that controls your muscles including the heart. My first admission I went into cardiac arrest when they gave me too much too fast. \n\nThe fact that you use ‘lol’ in this story is infuriating. You think EDs are funny or cute or some shit? You think this makes you interesting or special? Go get some therapy before you embarrass yourself anymore.",
      "created_utc": 1742702407.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mif6bwy",
      "author": "erinclairee",
      "body": "so it's not that i tell everyone. i do community theater and those people are like my family. when i started showing signs a couple people asked me what was going on and if i was okay. since im so close with them i told them. it's not telling people for fun, its more telling people for an explanation (not that i owe anyone an explanation) and a couple of my best friends now but that's because again, im very close to them and they knew something was up. a couple of family members know big they don't care. i'm not close with anyone in my family like that.",
      "created_utc": 1742298531.0,
      "score": 6,
      "context": [
        {
          "id": "mif3rt1",
          "author": "onyxjade7",
          "body": "It’s about being selective who you share with. The post office person doesn’t need to know, your classmates you’re not friends with don’t need to know. You’re close friends absolutely it’s ok but, we don’t get to choose how people respond. It’s something if you choose to share (learning the hard way - being selective with your vulnerabilities is a good life lesson), except people to get weird around you even those who are close. For those who care they’d be worried and automatically want to help you get treatment. For those that don’t like the person said it’s like a person in the throes of addiction and self harm admitting that but doing nothing about it. They wondering why are you telling me, and if you don’t want help why are you talking about it. The thing people who don’t suffer from it don’t realize acknowledging it is important, that the secrecy is what keeps a person ill.\n\nMay I ask what your motivation for telling people is verses seeking help and talking to a professional? As someone with an ED their is no judgment (I’ve just been down this road with my ED, we’re all different but I get it.) perhaps getting to the bottom of why you need to tell everyone but not seek help is a good start. They have help lines if that’s an easier way to begin. I wish you recovery and hope you get the support you need. Take care.\n\nIf you have a student counsellor or trust your parents they would be the most helpful. But, again they have free lines to connect you with help and services.",
          "created_utc": 1742297361.0
        }
      ]
    },
    {
      "id": "mih5sv8",
      "author": "aIIthesame",
      "body": "That’s bullying! So sorry for your experience, I hope their behavior had some consequences",
      "created_utc": 1742320927.0,
      "score": 5,
      "context": [
        {
          "id": "mie5vv1",
          "author": "Superb-Patience4530",
          "body": "My experience was hard… I 13f opened up to my lunch group abt being anorexic and the were rlly supportive and even encouraged me to eat even at points where I just wanted to give up… that is until I Opened up to the wrong person and she told everyone I was faking and even started pretending she was anorexic and started copying my behaviors.",
          "created_utc": 1742276686.0
        }
      ]
    },
    {
      "id": "mif24l7",
      "author": "erinclairee",
      "body": "oh my god. that is AWFUL. i'm so sorry.",
      "created_utc": 1742296575.0,
      "score": 5,
      "context": [
        {
          "id": "mie5vv1",
          "author": "Superb-Patience4530",
          "body": "My experience was hard… I 13f opened up to my lunch group abt being anorexic and the were rlly supportive and even encouraged me to eat even at points where I just wanted to give up… that is until I Opened up to the wrong person and she told everyone I was faking and even started pretending she was anorexic and started copying my behaviors.",
          "created_utc": 1742276686.0
        }
      ]
    },
    {
      "id": "mihkgy9",
      "author": "erinclairee",
      "body": "thank you.",
      "created_utc": 1742325014.0,
      "score": 1,
      "context": [
        {
          "id": "mifpskr",
          "author": "Panzerfaust77",
          "body": "Hello, I’ve been fighting ED for 20+ years. Check out https://www.nationaleatingdisorders.org. They have a lot of resources. My diagnosis was also bulimia nervosa. You need to see a doctor to evaluate your health. It is a big deal. This does not have to be your normal. Please PM me.",
          "created_utc": 1742305857.0
        }
      ]
    },
    {
      "id": "mif4z3b",
      "author": "onyxjade7",
      "body": "It’s not good to to the wrong people. Being selective and speaking to a professional, an adult or close friends is fine but telling everyone can actually be harmful especially if not in recovery.",
      "created_utc": 1742297918.0,
      "score": 5,
      "context": [
        {
          "id": "mie1609",
          "author": "egt2190",
          "body": "Absolutely not weird to open up about it. Please do. Its so much better to spread awareness and not keep it in",
          "created_utc": 1742274081.0
        }
      ]
    },
    {
      "id": "mihkl42",
      "author": "erinclairee",
      "body": "it's more some ppl will pressure about certain behaviors. it's just easier to tell them",
      "created_utc": 1742325049.0,
      "score": 0,
      "context": [
        {
          "id": "miheqcu",
          "author": "nervous_veggie",
          "body": "Depends, if you want help or support then it’s a great idea. This might sound stupid but I don’t see why you’d want people to know otherwise, as their response (if they’re even remotely a normal person) would be concern, which is only beneficial if you actually want support or understanding.",
          "created_utc": 1742323372.0
        }
      ]
    },
    {
      "id": "mif93k5",
      "author": "onyxjade7",
      "body": "Anyone you choose to share with my only recommendation is make sure you feel safe with them. Sounds like you have some good people around you and sharing is important. People will act odd because ED are scary and most people fundamentally don’t understand them. These people seem lovely as I am sure you are too if they act weird it’s only out of their own discomfort which is natural. \n\nHopefully with support from your friends you’ll get to a point where you’re open to seeking help. I know you’re not ready and that ok. But, you don’t want to be 15 years from now living in this hell of and ED, because it gets so much worse. You have a beautiful life a head of you and good friends sharing is a great start and I hope you get some professional support soon. Take care and thanks fo the reply, all the best. I only recommend getting help you’re going to do what you’re going to do, that’s up to you as someone who is dealing with years of an eating disorder.",
      "created_utc": 1742299732.0,
      "score": 9,
      "context": [
        {
          "id": "mif3rt1",
          "author": "onyxjade7",
          "body": "It’s about being selective who you share with. The post office person doesn’t need to know, your classmates you’re not friends with don’t need to know. You’re close friends absolutely it’s ok but, we don’t get to choose how people respond. It’s something if you choose to share (learning the hard way - being selective with your vulnerabilities is a good life lesson), except people to get weird around you even those who are close. For those who care they’d be worried and automatically want to help you get treatment. For those that don’t like the person said it’s like a person in the throes of addiction and self harm admitting that but doing nothing about it. They wondering why are you telling me, and if you don’t want help why are you talking about it. The thing people who don’t suffer from it don’t realize acknowledging it is important, that the secrecy is what keeps a person ill.\n\nMay I ask what your motivation for telling people is verses seeking help and talking to a professional? As someone with an ED their is no judgment (I’ve just been down this road with my ED, we’re all different but I get it.) perhaps getting to the bottom of why you need to tell everyone but not seek help is a good start. They have help lines if that’s an easier way to begin. I wish you recovery and hope you get the support you need. Take care.\n\nIf you have a student counsellor or trust your parents they would be the most helpful. But, again they have free lines to connect you with help and services.",
          "created_utc": 1742297361.0
        },
        {
          "id": "mif6bwy",
          "author": "erinclairee",
          "body": "so it's not that i tell everyone. i do community theater and those people are like my family. when i started showing signs a couple people asked me what was going on and if i was okay. since im so close with them i told them. it's not telling people for fun, its more telling people for an explanation (not that i owe anyone an explanation) and a couple of my best friends now but that's because again, im very close to them and they knew something was up. a couple of family members know big they don't care. i'm not close with anyone in my family like that.",
          "created_utc": 1742298531.0
        }
      ]
    }
  ]
}