{
  "id": "1jf5py7",
  "subreddit": "EatingDisorders",
  "author": "Own-Jury-7204",
  "created_utc": 1742413191.0,
  "title": "I restrict myself  but only eat unhealthy food. What does it mean?",
  "selftext": "I restrict myself. A lot. Im losing weight but i all i eat is sweets/ processed food. I eat mcdonald’s. I don’t eat „normal” food. It’s weird. Is this an ed? because people with ed’s tend to obsess over healthy food. I just care about calories. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jf5py7/i_restrict_myself_but_only_eat_unhealthy_food/",
  "score": 53,
  "num_comments": 32,
  "comments": [
    {
      "id": "mitgq38",
      "author": "MelodicConfusion7029",
      "body": "i had the same thing- your body loses weight when you eat less calories than you burn, no matter what calories they are, so obsessing over your calorie intake a lot is disordered, even if you only eat unhealthy stuff.",
      "created_utc": 1742487635.0,
      "score": 25,
      "context": []
    },
    {
      "id": "miv83cp",
      "author": "CompoteGood9267",
      "body": "i'm the same i only care about CICO",
      "created_utc": 1742505894.0,
      "score": 11,
      "context": []
    },
    {
      "id": "miv6zb6",
      "author": "Logical-Ad8243",
      "body": "I have the same thing. I will barely eat any healthy foods and then I'll get so hungry that I'll just binge on chocolates and candies.",
      "created_utc": 1742505560.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mivyr00",
      "author": "RepresentativeOk2955",
      "body": "Restricting is restricting. It isn’t about WHAT it is it’s about the restriction. I’ve gone from eating cheese based diet bc it was allowed to purely veg then to ready meals; it’s restriction to those certain foods that are “okay”",
      "created_utc": 1742514298.0,
      "score": 8,
      "context": []
    },
    {
      "id": "miwk6xv",
      "author": "MajorDickle",
      "body": "omg saammme! For me I'm anemic. So I think my body craves the extra sodium and iron. But after I eat it I end up regretting it because it think of all the calories. But then it makes me feel kinda better because I probably gotten all the calories I need for the day.",
      "created_utc": 1742521955.0,
      "score": 6,
      "context": []
    },
    {
      "id": "miy9xk0",
      "author": "sjjaewoo",
      "body": "this is my exact situation rn ure not alone",
      "created_utc": 1742553553.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mizv8t4",
      "author": "feronp22",
      "body": "It means you'll lose your hair and muscle... your skin will lose its glow and elasticity. Your brain won't function properly and things will be harder than if you ate the same number of calories of nutrient dense foods. Not saying don't restrict (don't restrict, get help now if you can as someone with 22 years in it) but try to get some nutrients in.",
      "created_utc": 1742573716.0,
      "score": 3,
      "context": []
    },
    {
      "id": "miy9j5r",
      "author": "skadisorkvir",
      "body": "As someone who had anorexia and would only eat sugar. I literally beg you not to do this. You will fuck up your whole ass digestive system/ you’ll also like literally get a sugar addiction and have dental problems. Trust me on this. Try and eat some non processed food as well. Please. I actually beg you. I can’t even begin to tell you how bad that is for your digestive system/mental health/ skin.",
      "created_utc": 1742553341.0,
      "score": 4,
      "context": []
    },
    {
      "id": "miy8ra2",
      "author": "Joshua13298",
      "body": "Restricting is restricting and you eating unhealthy food doesn’t make you any less valid",
      "created_utc": 1742552915.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mizuho3",
      "author": "EuropaofAsguard",
      "body": "Health food or not, it all boils down to calories.",
      "created_utc": 1742573496.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mivjs19",
      "author": "UltimateKorekiyo",
      "body": "there’s a term for that, junkorexic",
      "created_utc": 1742509501.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mixpbre",
      "author": "None",
      "body": "junkorexia",
      "created_utc": 1742540828.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mivts0b",
      "author": "Lumyisgoinginsane",
      "body": "I guess it could be called so because you don’t get the proper nutrients your body needs instead you’re ingesting processed junk",
      "created_utc": 1742512718.0,
      "score": 1,
      "context": []
    },
    {
      "id": "miwxsrx",
      "author": "Weeping_willow_trees",
      "body": "Yes. Yes that is disordered eating, and it may be hard to hear but please seek help. If you think it’s not bad enough to get help, it is. Please, reach out to someone, whether it be a family member, doctor, or even in this community on Reddit. You are not alone, but please seek help before it gets worse.",
      "created_utc": 1742526911.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj1t3zo",
      "author": "purples_turtles",
      "body": "It means you (by the sound of it) have an ed because you restrict yourself and it has an impact on you. I’m exactly the same and my psychiatrist says I’ve got anorexia. Your experience is 100% valid",
      "created_utc": 1742594384.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj29nit",
      "author": "dainty-ang",
      "body": "Yes this is technically an ed. Whether or not it’s healthy or unhealthy food, it’s considered an ed. I was previously in your same situation, obsessing over my calorie intake, causing me to develop an ed. I hope this answers your question",
      "created_utc": 1742599893.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjmhss2",
      "author": "Complete_Tea_5000",
      "body": "because after restriction your body’s craving higher calorie foods. when you begin actively recovering it will be like that for a while and then the cravings will balance out",
      "created_utc": 1742892694.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjq7x4i",
      "author": "jammydolphin",
      "body": "I do the exact same like its so confusing I'll eat only chocolate its so confusing",
      "created_utc": 1742938334.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjsl23n",
      "author": "Numerous-Crew2851",
      "body": "Junkorexic/j",
      "created_utc": 1742971046.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mj00in0",
      "author": "No-Difference9226",
      "body": "but like uuughhh how do you get out of it 😭",
      "created_utc": 1742575268.0,
      "score": 3,
      "context": [
        {
          "id": "miy9j5r",
          "author": "skadisorkvir",
          "body": "As someone who had anorexia and would only eat sugar. I literally beg you not to do this. You will fuck up your whole ass digestive system/ you’ll also like literally get a sugar addiction and have dental problems. Trust me on this. Try and eat some non processed food as well. Please. I actually beg you. I can’t even begin to tell you how bad that is for your digestive system/mental health/ skin.",
          "created_utc": 1742553341.0
        }
      ]
    },
    {
      "id": "mivu09l",
      "author": "Own-Jury-7204",
      "body": "i didn’t know something like this exists",
      "created_utc": 1742512790.0,
      "score": 1,
      "context": [
        {
          "id": "mivjs19",
          "author": "UltimateKorekiyo",
          "body": "there’s a term for that, junkorexic",
          "created_utc": 1742509501.0
        }
      ]
    },
    {
      "id": "mj1xajc",
      "author": "Own-Jury-7204",
      "body": "I don’t know i’m not underweight and I don’t think they will take me seriously. I’m scared to discuss it. I’m scared that people will judge me and say „but u eat so what’s the problem” i don’t know",
      "created_utc": 1742595768.0,
      "score": 1,
      "context": [
        {
          "id": "miwxsrx",
          "author": "Weeping_willow_trees",
          "body": "Yes. Yes that is disordered eating, and it may be hard to hear but please seek help. If you think it’s not bad enough to get help, it is. Please, reach out to someone, whether it be a family member, doctor, or even in this community on Reddit. You are not alone, but please seek help before it gets worse.",
          "created_utc": 1742526911.0
        }
      ]
    },
    {
      "id": "mj344hr",
      "author": "skadisorkvir",
      "body": "Try and find non processed foods you DO like? I mean surely there has gotta be some? I mean can you honestly tell me that you don’t find any cuisine of food but processed fast food nice? You don’t like East Asian food? You don’t like Mediterranean food? You don’t like middle eastern food, Indian food etc etc? There is a world of non processed foods which literally taste 100000x better and actually won’t destroy your health. Find substitutes for things. Learn about nutrition- and also learn but the idea that calories in and calories out is the base level of idea for losing weight sure, but guess what? You might not be losing actual fat lmao. Your body can very easily start using its muscle mass too if you’re eating shit ass foods. You can 1000% have an ED and not be focused on healthy food. But I’ll tell you what will happen - you’ll destroy your health, destroy your mental state, you’ll be stuck in a cycle of constant restriction because guess what? You’re loading your body up with nutritionally void junk so you will constantly be fucking starving. And your body will start eating away at some fat, but also muscle. You’ll likely still have visceral fat which is bad fat - because you’re loading your body up with the foods which literally CAUSE visceral fat to develop aka ‘skinny fat’. You’ll get more and more health problems. I’m speaking from actual experience. Calories aren’t your enemy - hyper processed foods is. Now that doesn’t mean you can’t have them occasionally. But our bodies weren’t designed to consume this shit. So the way you get out of it, is by challenging your own thoughts. And to realise that your ED is fucking stupid and wrong. And that eating processed foods but restricting won’t get you skinny. It will get you unhealthy. And restricting under your TDEE long term will make it a guarantee that you destroy your body long term. Your body is a lot smarter than your ED. You won’t gain weight by eating at least one decent meal of non processed foods. But the only person who can break that cycle is you. Your ED isn’t helping you - and any weight you lose is literally just short term and meaningless because two things will happen A) you’ll eventually start binging and gaining weight back OR B) you’ll start losing muscle mass and become skinny fat, weak and unhealthy as fuck. Either way, you won’t be getting out of the cycle. I’m not going to sit here and validate you and say “don’t worry ofc you have an ED, ur so valid.” I’m gonna do something I wish someone said to me years ago. Your ED and its ideas, and its hold on your life ISN’T valid. It isn’t okay, it isn’t acceptable. And if you’re self aware enough to want to break out of the cycle of this shit - then PLEASE START doing it. Your ED is a liar, and it’s going to hurt you long term. And when the day comes when you want to have a better life - it will be so much harder for you to get there because you will be dealing with the health consequences as well as the mental ones. I’ve been hospitalised before. I’ve seen what EDs can do. It’s not a life worth living. I’ve seen women in their 20s, in wheelchairs and struggling to walk. I’m telling you - start challenging it while you can. And if you hate all non processed foods. Then you need to get tough on yourself and start challenging yourself. Whatever your calorie count is - why not start by adding to that, and making sure that a little over half of those cals are from non processed nutrient dense foods? Start slow and start little by little.",
      "created_utc": 1742611091.0,
      "score": 3,
      "context": [
        {
          "id": "miy9j5r",
          "author": "skadisorkvir",
          "body": "As someone who had anorexia and would only eat sugar. I literally beg you not to do this. You will fuck up your whole ass digestive system/ you’ll also like literally get a sugar addiction and have dental problems. Trust me on this. Try and eat some non processed food as well. Please. I actually beg you. I can’t even begin to tell you how bad that is for your digestive system/mental health/ skin.",
          "created_utc": 1742553341.0
        },
        {
          "id": "mj00in0",
          "author": "No-Difference9226",
          "body": "but like uuughhh how do you get out of it 😭",
          "created_utc": 1742575268.0
        }
      ]
    },
    {
      "id": "mj36bpc",
      "author": "skadisorkvir",
      "body": "TLDR; Your ED is stupid and dumb and you need to start challenging your thoughts. Learn about nutrition. Learn that calories in calories out is a basic idea - but the CONTENT of calories matter. X calories of sugar and refined carbs vs x calories of protein, healthy carbs, healthy fats are NOT made equally. Your body needs real food, not fake food. You deserve to nourish your body. Start slow. Whatever your calorie intake is per day, add to it slowly and make sure that half of those calories are made up of nutrient dense foods. You’re way more likely to gain weight by eating processed junk food then eating whole, fruits, veggies and healthy carbs. Your body is literally designed to consume those things. Refined sugar and carbs are useless to your body but spiking your blood sugar which keeps you hungry which keeps you eating them. Whole foods keep you full, because your body actually uses the energy properly for organ function. \n\nIf your ED was so smart, why would it be telling you that it’s okay to eat the very thing which actively keeps you on a cycle of losing and gaining weight? If your ED was so smart, why wouldn’t it want you to eat things which help brain function, muscle maintenance, heart function, digestive function, skin health etc? \n\nLearn about your body. Learn about your brain. Challenge your thoughts. And remind yourself that you deserve better and so does your body. And that restriction only hurts you long term.",
      "created_utc": 1742611967.0,
      "score": 1,
      "context": [
        {
          "id": "miy9j5r",
          "author": "skadisorkvir",
          "body": "As someone who had anorexia and would only eat sugar. I literally beg you not to do this. You will fuck up your whole ass digestive system/ you’ll also like literally get a sugar addiction and have dental problems. Trust me on this. Try and eat some non processed food as well. Please. I actually beg you. I can’t even begin to tell you how bad that is for your digestive system/mental health/ skin.",
          "created_utc": 1742553341.0
        },
        {
          "id": "mj00in0",
          "author": "No-Difference9226",
          "body": "but like uuughhh how do you get out of it 😭",
          "created_utc": 1742575268.0
        }
      ]
    },
    {
      "id": "miw0b7h",
      "author": "kensia1234",
      "body": "It's mostly a >!edtwt!< thing.",
      "created_utc": 1742514801.0,
      "score": 3,
      "context": [
        {
          "id": "mivjs19",
          "author": "UltimateKorekiyo",
          "body": "there’s a term for that, junkorexic",
          "created_utc": 1742509501.0
        },
        {
          "id": "mivu09l",
          "author": "Own-Jury-7204",
          "body": "i didn’t know something like this exists",
          "created_utc": 1742512790.0
        }
      ]
    },
    {
      "id": "mj235gs",
      "author": "Royal-Analysis7380",
      "body": "Please don't let that discourage you. Yes, there is a chance not everyone is going to take you seriously because the health care system lacks serious knowledge about EDs, but they're not a weight disorder. You are valid - even if you're not underweight, or eat daily, or eat 'unhealthy' food. I know that it's hard, but the longer you wait, the worse it will get. You can do it <3",
      "created_utc": 1742597717.0,
      "score": 3,
      "context": [
        {
          "id": "miwxsrx",
          "author": "Weeping_willow_trees",
          "body": "Yes. Yes that is disordered eating, and it may be hard to hear but please seek help. If you think it’s not bad enough to get help, it is. Please, reach out to someone, whether it be a family member, doctor, or even in this community on Reddit. You are not alone, but please seek help before it gets worse.",
          "created_utc": 1742526911.0
        },
        {
          "id": "mj1xajc",
          "author": "Own-Jury-7204",
          "body": "I don’t know i’m not underweight and I don’t think they will take me seriously. I’m scared to discuss it. I’m scared that people will judge me and say „but u eat so what’s the problem” i don’t know",
          "created_utc": 1742595768.0
        }
      ]
    },
    {
      "id": "mj3muk5",
      "author": "Weeping_willow_trees",
      "body": "The biggest regret of my life is not getting help soon enough. If I had spoken to my parents or a friend about it when it was just starting, I could have saved myself years of strain on my brain, body, and relationships. The recovery process took years that I will never get back- all of which I fully believe could have been prevented if I had just spoken to someone at the start.\n\nBut I didn’t, because I feared I wasn’t sick enough, and I would be a burden. The reality is, sick is sick. If you’re going to need help at some point, you might as well get help now, while it’s easier. Even if it’s not from medical professionals, please at least talk to a trusted family member or friend.",
      "created_utc": 1742619375.0,
      "score": 1,
      "context": [
        {
          "id": "miwxsrx",
          "author": "Weeping_willow_trees",
          "body": "Yes. Yes that is disordered eating, and it may be hard to hear but please seek help. If you think it’s not bad enough to get help, it is. Please, reach out to someone, whether it be a family member, doctor, or even in this community on Reddit. You are not alone, but please seek help before it gets worse.",
          "created_utc": 1742526911.0
        },
        {
          "id": "mj1xajc",
          "author": "Own-Jury-7204",
          "body": "I don’t know i’m not underweight and I don’t think they will take me seriously. I’m scared to discuss it. I’m scared that people will judge me and say „but u eat so what’s the problem” i don’t know",
          "created_utc": 1742595768.0
        }
      ]
    },
    {
      "id": "miw0dl1",
      "author": "Own-Jury-7204",
      "body": "so is it real or not",
      "created_utc": 1742514823.0,
      "score": 1,
      "context": [
        {
          "id": "mivjs19",
          "author": "UltimateKorekiyo",
          "body": "there’s a term for that, junkorexic",
          "created_utc": 1742509501.0
        },
        {
          "id": "mivu09l",
          "author": "Own-Jury-7204",
          "body": "i didn’t know something like this exists",
          "created_utc": 1742512790.0
        },
        {
          "id": "miw0b7h",
          "author": "kensia1234",
          "body": "It's mostly a >!edtwt!< thing.",
          "created_utc": 1742514801.0
        }
      ]
    },
    {
      "id": "miw0w8e",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1742514998.0,
      "score": 1,
      "context": [
        {
          "id": "mivjs19",
          "author": "UltimateKorekiyo",
          "body": "there’s a term for that, junkorexic",
          "created_utc": 1742509501.0
        },
        {
          "id": "mivu09l",
          "author": "Own-Jury-7204",
          "body": "i didn’t know something like this exists",
          "created_utc": 1742512790.0
        },
        {
          "id": "miw0b7h",
          "author": "kensia1234",
          "body": "It's mostly a >!edtwt!< thing.",
          "created_utc": 1742514801.0
        },
        {
          "id": "miw0dl1",
          "author": "Own-Jury-7204",
          "body": "so is it real or not",
          "created_utc": 1742514823.0
        }
      ]
    },
    {
      "id": "miy1aku",
      "author": "echo_noname",
      "body": "not really, they use it but it’s obviously not an “official” thing",
      "created_utc": 1742548489.0,
      "score": 1,
      "context": [
        {
          "id": "mivjs19",
          "author": "UltimateKorekiyo",
          "body": "there’s a term for that, junkorexic",
          "created_utc": 1742509501.0
        },
        {
          "id": "mivu09l",
          "author": "Own-Jury-7204",
          "body": "i didn’t know something like this exists",
          "created_utc": 1742512790.0
        },
        {
          "id": "miw0b7h",
          "author": "kensia1234",
          "body": "It's mostly a >!edtwt!< thing.",
          "created_utc": 1742514801.0
        },
        {
          "id": "miw0dl1",
          "author": "Own-Jury-7204",
          "body": "so is it real or not",
          "created_utc": 1742514823.0
        }
      ]
    },
    {
      "id": "miz6f5b",
      "author": "AbundantiaTheWitch",
      "body": "It’s not a medical term but it is common in ed spaces to explain your experience",
      "created_utc": 1742566397.0,
      "score": 1,
      "context": [
        {
          "id": "mivjs19",
          "author": "UltimateKorekiyo",
          "body": "there’s a term for that, junkorexic",
          "created_utc": 1742509501.0
        },
        {
          "id": "mivu09l",
          "author": "Own-Jury-7204",
          "body": "i didn’t know something like this exists",
          "created_utc": 1742512790.0
        },
        {
          "id": "miw0b7h",
          "author": "kensia1234",
          "body": "It's mostly a >!edtwt!< thing.",
          "created_utc": 1742514801.0
        },
        {
          "id": "miw0dl1",
          "author": "Own-Jury-7204",
          "body": "so is it real or not",
          "created_utc": 1742514823.0
        }
      ]
    },
    {
      "id": "miwdum0",
      "author": "EatingDisorders-ModTeam",
      "body": "Your submission has been removed for the following reason(s):\n\nRule 7: No Mention of Numbers\n\nDo not discuss numbers related to weight, calories, BMI, or other measurements (e.g. clothing size). Please refrain from posting overly detailed descriptions of servings, bites and meal frequencies.\n\nIf you would like to repost without numbers, please review the [rules](https://www.reddit.com/r/EatingDisorders/wiki/index/rules/), and feel free to [send a modmail](https://www.reddit.com/message/compose?to=/r/EatingDisorders) if you have any questions.",
      "created_utc": 1742519611.0,
      "score": 1,
      "context": [
        {
          "id": "mivjs19",
          "author": "UltimateKorekiyo",
          "body": "there’s a term for that, junkorexic",
          "created_utc": 1742509501.0
        },
        {
          "id": "mivu09l",
          "author": "Own-Jury-7204",
          "body": "i didn’t know something like this exists",
          "created_utc": 1742512790.0
        },
        {
          "id": "miw0b7h",
          "author": "kensia1234",
          "body": "It's mostly a >!edtwt!< thing.",
          "created_utc": 1742514801.0
        },
        {
          "id": "miw0dl1",
          "author": "Own-Jury-7204",
          "body": "so is it real or not",
          "created_utc": 1742514823.0
        },
        {
          "id": "miw0w8e",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1742514998.0
        }
      ]
    }
  ]
}