{
  "id": "1jguwqj",
  "subreddit": "EatingDisorders",
  "author": "TurbaUrba",
  "created_utc": 1742600209.0,
  "title": "Post-recovery: does anyone long for that “hunger high”?",
  "selftext": "I’ve been “recovered” for five years. Whenever I feel hungry - like really hungry - there’s this jolt of excitement, like, “Ha, stomach! Take that you little bitch. You’re not the boss of me!” And the longer I hold it, the better. It’s like a game and I’m winning. Even when I’m not hungry, I think about that feeling.\n\nI’m normal now, but I’m want to go back to MY normal, pre-ED. I’ve cut out alcohol (1-2 drinks per day for the last 4 years…probably a problem but I’ve never told my psychiatrist). I think that should be enough to restore, but to make things go faster, I’ve started restricting as well. \n\nThat hunger high is back. I feel diabolical and strong. Even when it distracts me or makes me feel light-headed, it’s just confirmation that I’m winning. \n\nI’m confused now. It’s like I don’t just want to be less - I want to be sick. On one hand, being sick would make my goals easier. On the other hand, being sick was exhilarating (and sometimes terrifying). It was something that took up space. \n\nIs this specific to EDs? Or am I just really messed up? It’s not like people get nostalgic over broken bones and cancer. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jguwqj/postrecovery_does_anyone_long_for_that_hunger_high/",
  "score": 40,
  "num_comments": 6,
  "comments": [
    {
      "id": "mj6nuzg",
      "author": "Individual_Echo_2557",
      "body": "For me eating disorders are just like addiction and its so easy to come back. \nWhen i'm healthy and something gets out of controll, i immediatly crave not eating because it feels like i'm gaining controll. ",
      "created_utc": 1742668069.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mj7domt",
      "author": "Boring_Bathroom_1804",
      "body": "I understand the hunger high. It’s exhilarating and makes me feel kinda proud of myself for being able to push through the hunger",
      "created_utc": 1742676373.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mj4ksd4",
      "author": "alienprincess111",
      "body": "Not me personally.  I can't stand feeling hungry.  It's a fear of mine that it will start and not stop.",
      "created_utc": 1742640860.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mj9wj4u",
      "author": "Ok_Flamingo_2120",
      "body": "It’s very common to want to go back to your sick ways, (wanting to) relapse. Please know that the ‘high’ of hunger is temporary and the long-term health damage is for life. 🌱",
      "created_utc": 1742713469.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mjpl08o",
      "author": "Mysterious_Artifact",
      "body": "It's so weird because some days when I let myself get hungry it feels like a good detox kind of hunger (I know it's like 'fake' hunger), and then other days I might get hungry and I feel like I'm dying, and get shakey and I have to do something about it immediately because I'm usually in the middle of something.\n\nThe first one feels AMAZING. I wish I felt it every time I was hungry. Which is crazy. I know. \n\nAnd I'm so scared of the second one. It's bloody awful. The annoying thing is I have no control over which one it will be. 😓",
      "created_utc": 1742931650.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjk0nxc",
      "author": "AffectionateStore396",
      "body": "Same for me. It’s not really intentional, I just subconsciously stop eating when I feel like I’m losing control in other aspects of my life. But it SUCKS feeling like you are falling back into the cycle.",
      "created_utc": 1742854206.0,
      "score": 2,
      "context": [
        {
          "id": "mj6nuzg",
          "author": "Individual_Echo_2557",
          "body": "For me eating disorders are just like addiction and its so easy to come back. \nWhen i'm healthy and something gets out of controll, i immediatly crave not eating because it feels like i'm gaining controll. ",
          "created_utc": 1742668069.0
        }
      ]
    }
  ]
}