{
  "id": "1jirkqr",
  "subreddit": "EatingDisorders",
  "author": "petals33",
  "created_utc": 1742825493.0,
  "title": "Anyone else get triggered by the Ozempic craze?",
  "selftext": "I have two friends who are on it strictly for weight loss, and when we’re hanging out in a group and they mention it my ED gets triggered. \n\nThe way they point out/joke about not being able to finish their meals now or how they’re not able to fit in dessert.\n\nIt’s also comments like “I’m going to be so skinny next year” or “I’ve lost so much weight!!!”\n\nI know they probably don’t mean any harm, but it really kills me to have to fight internally within myself every time a comment is made - having to remind myself it’s fine and healthy to finish food, it’s okay to have dessert, food is fuel.\n\nHas anyone else been affected listening to people talk about ozempic/weight loss drugs?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jirkqr/anyone_else_get_triggered_by_the_ozempic_craze/",
  "score": 272,
  "num_comments": 99,
  "comments": [
    {
      "id": "mjl25if",
      "author": "None",
      "body": "yea. every recovery attempt ive done has been heavily discouraged because both of my parents take some off brand ozempic. they constantly boast about how they get full so quickly and will make petty comments like “wow! thats a big plate you have there. i couldnt eat that much if i tried!” like.. okay? very unwanted comments.",
      "created_utc": 1742866467.0,
      "score": 72,
      "context": []
    },
    {
      "id": "mjl6ouq",
      "author": "j_p96",
      "body": "Tbh, yes but I don’t think I even realized that until seeing this post. As another commenter said, “I could be skinnier in a month without that crap.” That’s pretty much how I feel, and then I’m right back into feeling guilty over eating *anything* and restricting/doing a “liquid diet”… whatever it may be. \n\nI don’t hate on anyone for using it, I don’t share my feelings on it, and I don’t mention that it triggers me. It’s my problem that it triggers me so… idk.",
      "created_utc": 1742868063.0,
      "score": 25,
      "context": []
    },
    {
      "id": "mjly6b2",
      "author": "CoserMujer",
      "body": "I have had to end friendships because of this… it was too much.",
      "created_utc": 1742880026.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mjn3pkj",
      "author": "SweetSweet_Jane",
      "body": "Absolutely. My mom is on it and has been fighting to get me on it even when I’m not sure about it. I feel bad for being hungry because no one in my house gets hungry anymore, I literally get anxiety when I have to ask what’s for dinner. \n\nTo add to that, I just want to stop thinking about food and my body so badly. Now there’s a drug that can help me with that, but because I have ED I can’t take it, but people who need help with their diet can? It’s all a bunch of bullshit",
      "created_utc": 1742904686.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mjkpnhm",
      "author": "Ok-Soup4974",
      "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
      "created_utc": 1742862105.0,
      "score": 52,
      "context": []
    },
    {
      "id": "mjzb5cc",
      "author": "littleT_mon",
      "body": "Zoom out here. Long term this stuff isn’t good. What happens when they stop? I’d rather be healed, happy and unfazed by body trends so I can focus on living my life. Ironically you will be looking and feeling your best when you stop letting weightloss take up your brain space and energy. \nWe’ve given way too much energy to looking a certain way, which never brings happiness and has destroyed our lives. As someone with a 20 year ED, this stuff just motivates me to keep being healthy and advocating for health. Ozempic is not healthy. We weren’t put on this earth to take pills. We shouldn’t need to take medicine to make us ‘look skinny’. \nWe are here to love, live our purpose, experience deep emotions, learn and improve ourselves, help eachother and leave a mark. Taking a shot to ‘disappear and get ‘small’ to fit in with societal trends or the male gaze’ as your only purpose in life, is not on my agenda. Find people who don’t care about this. \nRise above it, it’s not appealing. And it does metabolic damage in the long run. We’ve been there before and we know better",
      "created_utc": 1743065026.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjlgxkw",
      "author": "etwichell",
      "body": "YES",
      "created_utc": 1742871917.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjmbfr7",
      "author": "haileyynicole7",
      "body": "I work in pharmacy and the studies are starting to show that using GLP-1s are causing gastroparesis in patients. No wonder they lose so much weight. \n\nBut I do agree hearing people talk about how they can’t even eat a meal anymore is pretty triggering.",
      "created_utc": 1742888342.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjn12kc",
      "author": "Secure-Basket222",
      "body": "I struggle so much with my relationship with food that sometimes this takes me over the edge. I wanr to recover but man these new fads send me spiraling when I see all the extra content people skinny from some “Miracle” like ozempic ",
      "created_utc": 1742903549.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mjnpn90",
      "author": "melaninspice",
      "body": "Surprisingly, I’m not triggered by the Ozempic craze. I’m worried about those who need the medication for their diabetes and them not being able to get it. Some girl on YouTube was talking about how her sister took it and how she lost so much and looks amazing. Then a few months later she said that her sister gained back all the weight and then some. Hearing that scared me.",
      "created_utc": 1742912515.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjo5375",
      "author": "None",
      "body": "I commented this same thing on another thread but yes - seeing everyone I know get on ozempic is making me feel like everyone will get skinny and I will be the only overweight person in the world \n\nIt’s especially hurtful when I see people who have previously been “body positive” talk about how they can’t wait to be skinny as soon as they managed to get their hands on ozempic ",
      "created_utc": 1742917199.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mjpcl6e",
      "author": "JacketInner2390",
      "body": "As someone who literally has struggled with self control when it comes to buying weight loss drugs it really triggers me. Especially when celebrities that are allegedly using it when they clearly don’t need to. ",
      "created_utc": 1742929150.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjmp7n4",
      "author": "pshermanwallabyway9",
      "body": "I get mad at people who do Ozempic. I know its ana brain talking and that this will sound awful but I feel like they don’t deserve to be skinny on a whim without making half the effort I have been doing for most of my life to stay skinny.",
      "created_utc": 1742897436.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mjmw4pv",
      "author": "Odd_Curve6621",
      "body": "I live in a larger body and struggled with restriction. I’ve been on the medicine for 14 weeks. I just gave in. My ED brain is very activated. But I can’t stop taking the drug out of fear of gaining weight. Living in a body that has a very high bmi but also restrictive tendencies is a hell I don’t wish on anyone else. I used to say I would do anything to be smaller, and refused to take the drug. Now I’m considering a gastric sleeve and the drugs together. I would sell my soul to the devil to live in a body I liked.\nI try hard to not talk about what I have or haven’t eaten in a day because I know it can trigger people",
      "created_utc": 1742901241.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjp5gas",
      "author": "YuleBunny",
      "body": "I’ve been getting several commercials of Ozempic and other GLP-1’s and it is so unbelievably triggering. I am on Lexapro and the Nexplanon so this weight gain has been really hard on me the ads aren’t helping. It’s all beautiful women smiling and dancing while they explain the weight loss. I had finally gotten comfortable with my weight gain and then I saw an ad of a plus size woman on Ozempic talking about how she wants to be healthier. That felt like a knife to the heart.",
      "created_utc": 1742927057.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjnbx9b",
      "author": "PetrichorAndStars",
      "body": "it is extremely triggering. and people suggest others take it bc it's \"safe and easy\". being excited about their progress is great but if i get excited about mine it's suddenly \"sick\", and that's fucked up.",
      "created_utc": 1742907907.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mjpvpan",
      "author": "MarshMello15593",
      "body": "As someone with BED, I feel like ozempic and weightloss drugs themselves aren't the issue. It's the publicity.\n\nI have to take both metformin and welbutrin together for weight loss (and as an antidepressant) because my BMI was at 47, and I was starting to experience extreme joint pain. I couldn't work out because of asthma and couldn't change my diet because of my BED. \n\nI agree that the way they're talking is terrible, but the medication itself shouldn't be the total negative.\n\nEdit: I would like to say that before you downvote, please think about the fact that this is not just an ana sub. It's eating disorders as a whole. I feel like a lot of the time, BED gets pushed to the side and shamed because from an ana prospective, we're doing what you can't. But from a BED perspective, all I want is to be a healthy weight. I'm 300 lbs. I'm only 20, and I have extreme joint pain in my hips because of it. I can do strength training, but all that does is add more weight. I've only just recently been able to eat without feeling guilty about the binge. I no longer fast for days after a binge.\n\nMedication is a tool. You wouldn't forgo a shovel just because you have hands. Yes, medication can be abused, and it can be co-oped by the media and trends, but it can still help people.\n\nMy best friend and I are polar opposites she is recovering from Anorexia, and I have Binge Eating Disorder. We both support each other, though. She doesn't care if I take meds to assist in my weight loss because she's been on the other side of that coin. She supports the fact that I'm using the tools at my disposal for my own recovery, and I will support her in hers.\n\nPlease remember this when you shame people for taking meds. I understand that it feels like you've put in more effort, but the meds only really work properly with diet and exercise. I do what I can using the meds to help me have a healthy diet and to be able to exercise to the best of my ability.\n\nLike I said at the beginning, it's not the medications themselves that are the issue. It's how our society views them and weight that's the issue.\n\nContinue to be kind to yourself and others. You never know who might be on the other side of your coin.",
      "created_utc": 1742934719.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mjlwg19",
      "author": "Silvesa8686",
      "body": "Several of my bar regulars (I bartend + manage) are on the shot and I genuinely wish them the best with weight loss. But it can be triggering for sure.",
      "created_utc": 1742879072.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mjox703",
      "author": "Extra-Blueberry-4320",
      "body": "My stepmom and my sister’s mother in law are on it and I was jealous. But they are both going off it because it makes them so sick. My stepmom says she’d rather be fat and have an appetite. They ask my opinion on it and I tell them that I don’t think it’s a good idea. Kinda to make sure they stop taking it and get fat again, I guess.",
      "created_utc": 1742924664.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjlx7z1",
      "author": "None",
      "body": "The ozempic and the bariatric surgery craze",
      "created_utc": 1742879494.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mjmbwzm",
      "author": "According-Pride-9960",
      "body": "I’ve even thought about getting some off the internet. I find myself incredibly jealous of those who have the shots, because it seems so easy for them to lose weight and get skinny. I’m tired of being ruled by food and feeling guilty for eating.",
      "created_utc": 1742888668.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjpbaa6",
      "author": "EvieeBrook",
      "body": "Personally, I started taking low dose ozempic to keep my weight consistent. I started gaining a bit and I figured I’d go with the approach kinder to my teeth, esophagus, etc (I’m considering it harm reduction) than bingeing and purging.",
      "created_utc": 1742928774.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mjpmwl0",
      "author": "fluteacorn",
      "body": "I personally am not triggered by stuff like that. But even though this can be REALLY hard, please, for your health, set boundaries around it with them.",
      "created_utc": 1742932204.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjpv9tq",
      "author": "prettysickchick",
      "body": "Definitely.  Especially since I’ve been doing well for awhile now, but it’s always a bit shaky, isn’t it?  I try to remind myself that nothing is a magic pill, and I wouldn’t want to be dependent on a drug for the rest of my life.",
      "created_utc": 1742934595.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjun9kk",
      "author": "None",
      "body": "It’s messed with me some in a few ways, more so when the people around me start making it a big deal. When like other family members start gossiping and getting worked up about reasons to be upset. Because I haven’t talked to this family (my boyfriend’s family not my blood family) about my eating disorder and my past with it or present with it or anything. And it makes me think of how people talked about me when I was blatant with my behaviors years back.\n\nI also get a bit pissed because I starved, binged purged and did all the in between and was shamed and sent to hospitals and a bunch of abuse in a relationship about my ED for over a decade but now an injectable type of starvation method (? Correct me if I’m wrong I do t research the shit it’s not in my best interest to but that’s what it appears: you inject medicine and aren’t hungry and eat less.) is here and it’s socially acceptable so it’s ok? It’s fucking bullshit just like weed becoming legal but that’s a whole other subreddit\n\nI also get pissed prob because I’d probably try the things but I have pancreatitis and can’t for that fact. Insulin insufficiency. I’d end up in the hospital: I get sad cause I’ve heard the shots control the greedy ass parts of out of brains and it’s helped binge drinkers - I’d like that\n\nBut I also get satisfaction out of having the discipline so many can’t attain - but it’s not natural to do that/ to deny your body food and nutrition- so it’s not really gaining anything\n\nYeah it fucks w me lol",
      "created_utc": 1743004200.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjxx18x",
      "author": "Sea_Organization_622",
      "body": "Yes, my friend is on it. She’s obsessed with weight loss drugs. It’s almost like she’s bragging of how little she can eat. First it was Monjaro and now it’s Ozempic. It’s her quick fix to loose weight for a party or a trip. She’s very open about it. It’s very triggering.",
      "created_utc": 1743039781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkavwtw",
      "author": "CabinetProfessional5",
      "body": "Yes.",
      "created_utc": 1743218578.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkb6pg8",
      "author": "Realis_Fox3454",
      "body": "Yes. But it only triggers my depression cause I’m too poor to afford it so I’m jealous of them. 😞",
      "created_utc": 1743223459.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmrcw6r",
      "author": "singo4u",
      "body": "“I bought this food and I don’t know why. I’m not hungry at all.”\n\nSHUT UP.",
      "created_utc": 1744477101.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mnzyc4m",
      "author": "Lollypolly468",
      "body": "I have a coworker on it and customers compliment her on her weight loss daily. They ask her how she did it and she just tells them “a bunch of things” because they all know she’s anti-vax and anti-pharmaceuticals and she’s ashamed for anybody to know she’s taking it. I’m one of the very few who know. I’ve been struggling with my own weight and fighting a relapse and it’s pretty hard because it leads me to think “maybe I should find a way to be on that” even though I really don’t want to be on a medication like that.",
      "created_utc": 1745101134.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvicenp",
      "author": "Effective_Seesaw4395",
      "body": "I am confused about how people can lose all the weight they need to or want to on ozempic/ wegovy etc and then get to stay on it even if  their bmi is normal or even underweight? \nIn Australia you need to provide photos to all online providers. Maybe that is not the case in the US and people just get it by lying about their weight.",
      "created_utc": 1748824594.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjn1kb7",
      "author": "HappyCrappy85",
      "body": "Yes but my dietitian recommended the Maintenance Phase podcast’s episode on Ozempic and it helped me a lot, actually. :)",
      "created_utc": 1742903764.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjo7ha0",
      "author": "eagle_patronus",
      "body": "My mom tried Wegovy, but it made her sick so she’s going to stop taking it. One of my sisters is on some form of it. She’s lost IDK how much weight, but enough for my mom to tell her it’s okay to stop now (and she said she was going to start stabilizing). Personally I want to lose my mind when the topic comes up. Gimme just a month or two on that stuff and I could reach my UGW, hands down. But, no joy. My family barely recognizes my eating disorderedness as it is though so maybe I’ll be okay.",
      "created_utc": 1742917889.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjqk63b",
      "author": "Livbehr",
      "body": "I have to be honest, this used to be a trigger for me, but what they don’t realize is how wonderful food truly is and how great of a relationship you can have with it. ED is awful… I live with him every day but fight back with remembering how much more free I feel not worrying about my weight. I used to be addicted and now I can focus on my passions and interests. Ozempic is an addiction! It changes people just like anorexia! My friends know how I feel because it is important for their well-being to let them know! We real OGs out here who took the eating disorder route (lol just joking here) know this shit is unhealthy mentally, physically, and emotionally!",
      "created_utc": 1742942142.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjlclsn",
      "author": "EuropaofAsguard",
      "body": "Not me. I was losing 1lb a day just doing my own thing, without drugs, pills, powders or potions, which beats Ozempic out of the water.",
      "created_utc": 1742870247.0,
      "score": -5,
      "context": []
    },
    {
      "id": "mjlq4o1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1742875901.0,
      "score": -3,
      "context": []
    },
    {
      "id": "mjlrh9m",
      "author": "petals33",
      "body": "I didn’t realise that’s what my issue was with it until the other day! I’m not jealous, it’s just triggering a part of me that I thought I’d healed already.",
      "created_utc": 1742876545.0,
      "score": 10,
      "context": [
        {
          "id": "mjl6ouq",
          "author": "j_p96",
          "body": "Tbh, yes but I don’t think I even realized that until seeing this post. As another commenter said, “I could be skinnier in a month without that crap.” That’s pretty much how I feel, and then I’m right back into feeling guilty over eating *anything* and restricting/doing a “liquid diet”… whatever it may be. \n\nI don’t hate on anyone for using it, I don’t share my feelings on it, and I don’t mention that it triggers me. It’s my problem that it triggers me so… idk.",
          "created_utc": 1742868063.0
        }
      ]
    },
    {
      "id": "mjlyjae",
      "author": "petals33",
      "body": "It’s so exhausting. The lack of self awareness becomes draining to be around after a while",
      "created_utc": 1742880232.0,
      "score": 7,
      "context": [
        {
          "id": "mjly6b2",
          "author": "CoserMujer",
          "body": "I have had to end friendships because of this… it was too much.",
          "created_utc": 1742880026.0
        }
      ]
    },
    {
      "id": "mjmp16y",
      "author": "Upset-Lavishness-522",
      "body": "Seriously ? Is a prescribed medication ! You would fo that to a friend?",
      "created_utc": 1742897329.0,
      "score": -11,
      "context": [
        {
          "id": "mjly6b2",
          "author": "CoserMujer",
          "body": "I have had to end friendships because of this… it was too much.",
          "created_utc": 1742880026.0
        }
      ]
    },
    {
      "id": "n02zka7",
      "author": "PartyFrequent",
      "body": "Why dont you focus on yourself ? Ignore what you're mum says  Maybe prepare your own healthy foods. Are you trying to lose weight or gain weight. Clearing your mind helps and what is causing your anxiety? I've struggled to lose belly fat without ozempic as well it's is confusing ",
      "created_utc": 1751038935.0,
      "score": 0,
      "context": [
        {
          "id": "mjn3pkj",
          "author": "SweetSweet_Jane",
          "body": "Absolutely. My mom is on it and has been fighting to get me on it even when I’m not sure about it. I feel bad for being hungry because no one in my house gets hungry anymore, I literally get anxiety when I have to ask what’s for dinner. \n\nTo add to that, I just want to stop thinking about food and my body so badly. Now there’s a drug that can help me with that, but because I have ED I can’t take it, but people who need help with their diet can? It’s all a bunch of bullshit",
          "created_utc": 1742904686.0
        }
      ]
    },
    {
      "id": "mjm99yo",
      "author": "adumbledorablee",
      "body": "YES! I feel the same. Like I get really mean about it in my head (even more so when I’m heavily restricting) and think “starve and put in effort like the rest of us”. \nHave I researched how to get my grabby little fingers on weight loss injections? Absolutely. I want to”the easy way out”. Have I succeeded? No. I’m glad they’re not as pushed and available in my country but I used to live in the US so a lot of my US friends get either Ozempic or had bariatric surgery whilst I sit there in my jealousy with a growling stomach.",
      "created_utc": 1742886893.0,
      "score": 17,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        }
      ]
    },
    {
      "id": "mjn4rj1",
      "author": "_clur_510",
      "body": "I went to get my birth control shot I get every like three months and the nurse asked me if I gained any weight on it. I was like uhhh maybe? Nothing substantial my weight fluctuates normally. Then she mentioned ozempic and drugs like that and I laughed and was like hahah yeah can’t believe those are a thing. Then she said she takes it and lost 30 lbs. It kind of felt like she was selling it to me? I’m still upset by the interaction.",
      "created_utc": 1742905128.0,
      "score": 11,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        }
      ]
    },
    {
      "id": "mjn7sso",
      "author": "llamakins2014",
      "body": "I'm not sure if this is helpful, but for myself, I take solace in knowing Ozempic is a temporary solution. Are these people going to use Ozempic for the rest of their lives to stay skinny? (I may be wrong, but) my understanding of Ozempic is if you stop it, you just put the weight back on. Like you said, they are cheating, but it's not the right solution to the problem.\n\n For @OP, I think maybe you should let your friends know it makes you uncomfortable. If they are on Ozempc for weight loss, they must have at least SOME understanding of having thoughts of feeling the need to be skinny, it's possible they even have an ED themselves. You don't have to get angry with them about it, or even tell them how much it upsets you, you can just say \"hey that makes me uncomfortable,  could you please not make those sorts of comments around me\". If they wanna abide, cool. If not, ditch em. Or, less drastic but still effective, don't agree to anymore social settings where you'd be eating a lunch or dinner together.",
      "created_utc": 1742906354.0,
      "score": 8,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        }
      ]
    },
    {
      "id": "mjlqz4g",
      "author": "petals33",
      "body": "YES!!! I see it as cheating. honestly I haven’t figured out how to handle it! I’ve been avoiding hanging out with those people because I find it a bit arrogant to be boasting about it. I really try to remind myself that my body is strong and healthy because I fuel it properly. I also think of all the delicious food they’re missing out on anyway",
      "created_utc": 1742876301.0,
      "score": 5,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        }
      ]
    },
    {
      "id": "mqbgcmc",
      "author": "Katermae",
      "body": "Same",
      "created_utc": 1746244462.0,
      "score": 1,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        }
      ]
    },
    {
      "id": "mkaxj47",
      "author": "CabinetProfessional5",
      "body": "Yes!! I’m an old gal 20 year ed survivor. I’m right there with you. Rise above & zoom out.",
      "created_utc": 1743219264.0,
      "score": 3,
      "context": [
        {
          "id": "mjzb5cc",
          "author": "littleT_mon",
          "body": "Zoom out here. Long term this stuff isn’t good. What happens when they stop? I’d rather be healed, happy and unfazed by body trends so I can focus on living my life. Ironically you will be looking and feeling your best when you stop letting weightloss take up your brain space and energy. \nWe’ve given way too much energy to looking a certain way, which never brings happiness and has destroyed our lives. As someone with a 20 year ED, this stuff just motivates me to keep being healthy and advocating for health. Ozempic is not healthy. We weren’t put on this earth to take pills. We shouldn’t need to take medicine to make us ‘look skinny’. \nWe are here to love, live our purpose, experience deep emotions, learn and improve ourselves, help eachother and leave a mark. Taking a shot to ‘disappear and get ‘small’ to fit in with societal trends or the male gaze’ as your only purpose in life, is not on my agenda. Find people who don’t care about this. \nRise above it, it’s not appealing. And it does metabolic damage in the long run. We’ve been there before and we know better",
          "created_utc": 1743065026.0
        }
      ]
    },
    {
      "id": "msfpdye",
      "author": "InternationalLoad724",
      "body": "This comment is incredible. Truly so good. 💯 💯 💯 ",
      "created_utc": 1747311108.0,
      "score": 1,
      "context": [
        {
          "id": "mjzb5cc",
          "author": "littleT_mon",
          "body": "Zoom out here. Long term this stuff isn’t good. What happens when they stop? I’d rather be healed, happy and unfazed by body trends so I can focus on living my life. Ironically you will be looking and feeling your best when you stop letting weightloss take up your brain space and energy. \nWe’ve given way too much energy to looking a certain way, which never brings happiness and has destroyed our lives. As someone with a 20 year ED, this stuff just motivates me to keep being healthy and advocating for health. Ozempic is not healthy. We weren’t put on this earth to take pills. We shouldn’t need to take medicine to make us ‘look skinny’. \nWe are here to love, live our purpose, experience deep emotions, learn and improve ourselves, help eachother and leave a mark. Taking a shot to ‘disappear and get ‘small’ to fit in with societal trends or the male gaze’ as your only purpose in life, is not on my agenda. Find people who don’t care about this. \nRise above it, it’s not appealing. And it does metabolic damage in the long run. We’ve been there before and we know better",
          "created_utc": 1743065026.0
        }
      ]
    },
    {
      "id": "mthmti3",
      "author": "DamageOk5681",
      "body": "Love this response <3",
      "created_utc": 1747841675.0,
      "score": 1,
      "context": [
        {
          "id": "mjzb5cc",
          "author": "littleT_mon",
          "body": "Zoom out here. Long term this stuff isn’t good. What happens when they stop? I’d rather be healed, happy and unfazed by body trends so I can focus on living my life. Ironically you will be looking and feeling your best when you stop letting weightloss take up your brain space and energy. \nWe’ve given way too much energy to looking a certain way, which never brings happiness and has destroyed our lives. As someone with a 20 year ED, this stuff just motivates me to keep being healthy and advocating for health. Ozempic is not healthy. We weren’t put on this earth to take pills. We shouldn’t need to take medicine to make us ‘look skinny’. \nWe are here to love, live our purpose, experience deep emotions, learn and improve ourselves, help eachother and leave a mark. Taking a shot to ‘disappear and get ‘small’ to fit in with societal trends or the male gaze’ as your only purpose in life, is not on my agenda. Find people who don’t care about this. \nRise above it, it’s not appealing. And it does metabolic damage in the long run. We’ve been there before and we know better",
          "created_utc": 1743065026.0
        }
      ]
    },
    {
      "id": "mke0rw0",
      "author": "elsie14",
      "body": "if they can’t eat a meal anymore they are doing it wrong. perhaps this is the reason for the gastroparesis the same way people with EDs can get gastroparesis. they should not be progressing in dose if they are unable to eat but clearly are/continue to. heaven forbid they alert their provider to scale back or discontine.",
      "created_utc": 1743270787.0,
      "score": 2,
      "context": [
        {
          "id": "mjmbfr7",
          "author": "haileyynicole7",
          "body": "I work in pharmacy and the studies are starting to show that using GLP-1s are causing gastroparesis in patients. No wonder they lose so much weight. \n\nBut I do agree hearing people talk about how they can’t even eat a meal anymore is pretty triggering.",
          "created_utc": 1742888342.0
        }
      ]
    },
    {
      "id": "mjmc5cb",
      "author": "According-Pride-9960",
      "body": "What’s that?",
      "created_utc": 1742888823.0,
      "score": 1,
      "context": [
        {
          "id": "mjmbfr7",
          "author": "haileyynicole7",
          "body": "I work in pharmacy and the studies are starting to show that using GLP-1s are causing gastroparesis in patients. No wonder they lose so much weight. \n\nBut I do agree hearing people talk about how they can’t even eat a meal anymore is pretty triggering.",
          "created_utc": 1742888342.0
        }
      ]
    },
    {
      "id": "mjntcsk",
      "author": "petals33",
      "body": "Yes! It’s so frustrating because I was doing so well with recovery until the ozempic craze started to pick up, you can’t escape it and it’s exhausting",
      "created_utc": 1742913674.0,
      "score": 4,
      "context": [
        {
          "id": "mjn12kc",
          "author": "Secure-Basket222",
          "body": "I struggle so much with my relationship with food that sometimes this takes me over the edge. I wanr to recover but man these new fads send me spiraling when I see all the extra content people skinny from some “Miracle” like ozempic ",
          "created_utc": 1742903549.0
        }
      ]
    },
    {
      "id": "mke16ua",
      "author": "elsie14",
      "body": "there’s no more shortage. they’re able to get it. rest your worried heart.",
      "created_utc": 1743270919.0,
      "score": 3,
      "context": [
        {
          "id": "mjnpn90",
          "author": "melaninspice",
          "body": "Surprisingly, I’m not triggered by the Ozempic craze. I’m worried about those who need the medication for their diabetes and them not being able to get it. Some girl on YouTube was talking about how her sister took it and how she lost so much and looks amazing. Then a few months later she said that her sister gained back all the weight and then some. Hearing that scared me.",
          "created_utc": 1742912515.0
        }
      ]
    },
    {
      "id": "mjnsby4",
      "author": "petals33",
      "body": "Yeah that’s the thing about it, you’re not actually learning self control or healthy eating habits, it’s all a facade. As soon as you stop taking it you’re just going to be back at square one.",
      "created_utc": 1742913358.0,
      "score": 5,
      "context": [
        {
          "id": "mjnpn90",
          "author": "melaninspice",
          "body": "Surprisingly, I’m not triggered by the Ozempic craze. I’m worried about those who need the medication for their diabetes and them not being able to get it. Some girl on YouTube was talking about how her sister took it and how she lost so much and looks amazing. Then a few months later she said that her sister gained back all the weight and then some. Hearing that scared me.",
          "created_utc": 1742912515.0
        }
      ]
    },
    {
      "id": "mke24vr",
      "author": "elsie14",
      "body": "depending on how large they begin at could take up to a year for people to reach their maintenance weights, they must take this for life, it is not for everyone, therefore not everyone will be skinny legends",
      "created_utc": 1743271215.0,
      "score": 1,
      "context": [
        {
          "id": "mjo5375",
          "author": "None",
          "body": "I commented this same thing on another thread but yes - seeing everyone I know get on ozempic is making me feel like everyone will get skinny and I will be the only overweight person in the world \n\nIt’s especially hurtful when I see people who have previously been “body positive” talk about how they can’t wait to be skinny as soon as they managed to get their hands on ozempic ",
          "created_utc": 1742917199.0
        }
      ]
    },
    {
      "id": "mjpdp57",
      "author": "petals33",
      "body": "Definitely I feel like we’ve just reversed any progress we made in body positivity",
      "created_utc": 1742929477.0,
      "score": 4,
      "context": [
        {
          "id": "mjpcl6e",
          "author": "JacketInner2390",
          "body": "As someone who literally has struggled with self control when it comes to buying weight loss drugs it really triggers me. Especially when celebrities that are allegedly using it when they clearly don’t need to. ",
          "created_utc": 1742929150.0
        }
      ]
    },
    {
      "id": "mjnt0ww",
      "author": "petals33",
      "body": "100%. I have PCOS and have cut out my sugar because my body can’t process it so it just turns into fat automatically and makes me exhausted. It has been SO HARD and it almost angers me that these people can just take drugs and still eat whatever they want and they get to lose weight.",
      "created_utc": 1742913571.0,
      "score": 2,
      "context": [
        {
          "id": "mjmp7n4",
          "author": "pshermanwallabyway9",
          "body": "I get mad at people who do Ozempic. I know its ana brain talking and that this will sound awful but I feel like they don’t deserve to be skinny on a whim without making half the effort I have been doing for most of my life to stay skinny.",
          "created_utc": 1742897436.0
        }
      ]
    },
    {
      "id": "mjpdh6q",
      "author": "petals33",
      "body": "Wanting to be healthier and taking ozempic are two contradictory statements! If you’re just losing weight without exercise you’re not gaining muscle or learning how to eat healthier. Your fitness will be the exact same once youre skinny 😭",
      "created_utc": 1742929412.0,
      "score": 1,
      "context": [
        {
          "id": "mjp5gas",
          "author": "YuleBunny",
          "body": "I’ve been getting several commercials of Ozempic and other GLP-1’s and it is so unbelievably triggering. I am on Lexapro and the Nexplanon so this weight gain has been really hard on me the ads aren’t helping. It’s all beautiful women smiling and dancing while they explain the weight loss. I had finally gotten comfortable with my weight gain and then I saw an ad of a plus size woman on Ozempic talking about how she wants to be healthier. That felt like a knife to the heart.",
          "created_utc": 1742927057.0
        }
      ]
    },
    {
      "id": "mkrjdru",
      "author": "ursparrow",
      "body": "It 100% the publicity! The amount of already thin celebrities taking it and the amount of pushing that Big Pharma does is the real problem.",
      "created_utc": 1743460559.0,
      "score": 2,
      "context": [
        {
          "id": "mjpvpan",
          "author": "MarshMello15593",
          "body": "As someone with BED, I feel like ozempic and weightloss drugs themselves aren't the issue. It's the publicity.\n\nI have to take both metformin and welbutrin together for weight loss (and as an antidepressant) because my BMI was at 47, and I was starting to experience extreme joint pain. I couldn't work out because of asthma and couldn't change my diet because of my BED. \n\nI agree that the way they're talking is terrible, but the medication itself shouldn't be the total negative.\n\nEdit: I would like to say that before you downvote, please think about the fact that this is not just an ana sub. It's eating disorders as a whole. I feel like a lot of the time, BED gets pushed to the side and shamed because from an ana prospective, we're doing what you can't. But from a BED perspective, all I want is to be a healthy weight. I'm 300 lbs. I'm only 20, and I have extreme joint pain in my hips because of it. I can do strength training, but all that does is add more weight. I've only just recently been able to eat without feeling guilty about the binge. I no longer fast for days after a binge.\n\nMedication is a tool. You wouldn't forgo a shovel just because you have hands. Yes, medication can be abused, and it can be co-oped by the media and trends, but it can still help people.\n\nMy best friend and I are polar opposites she is recovering from Anorexia, and I have Binge Eating Disorder. We both support each other, though. She doesn't care if I take meds to assist in my weight loss because she's been on the other side of that coin. She supports the fact that I'm using the tools at my disposal for my own recovery, and I will support her in hers.\n\nPlease remember this when you shame people for taking meds. I understand that it feels like you've put in more effort, but the meds only really work properly with diet and exercise. I do what I can using the meds to help me have a healthy diet and to be able to exercise to the best of my ability.\n\nLike I said at the beginning, it's not the medications themselves that are the issue. It's how our society views them and weight that's the issue.\n\nContinue to be kind to yourself and others. You never know who might be on the other side of your coin.",
          "created_utc": 1742934719.0
        }
      ]
    },
    {
      "id": "mke2nzl",
      "author": "elsie14",
      "body": "they can drink on this? good lawd.",
      "created_utc": 1743271383.0,
      "score": 2,
      "context": [
        {
          "id": "mjlwg19",
          "author": "Silvesa8686",
          "body": "Several of my bar regulars (I bartend + manage) are on the shot and I genuinely wish them the best with weight loss. But it can be triggering for sure.",
          "created_utc": 1742879072.0
        }
      ]
    },
    {
      "id": "mke5ekj",
      "author": "elsie14",
      "body": "people used to derive a lot of pleasure from food same as alcohol and on the drug they don’t do either and that may not be tolerable to some",
      "created_utc": 1743272274.0,
      "score": 2,
      "context": [
        {
          "id": "mjox703",
          "author": "Extra-Blueberry-4320",
          "body": "My stepmom and my sister’s mother in law are on it and I was jealous. But they are both going off it because it makes them so sick. My stepmom says she’d rather be fat and have an appetite. They ask my opinion on it and I tell them that I don’t think it’s a good idea. Kinda to make sure they stop taking it and get fat again, I guess.",
          "created_utc": 1742924664.0
        }
      ]
    },
    {
      "id": "mknhnuf",
      "author": "No_Put8824",
      "body": "Awful. Glad you're miserable.",
      "created_utc": 1743407867.0,
      "score": 1,
      "context": [
        {
          "id": "mjox703",
          "author": "Extra-Blueberry-4320",
          "body": "My stepmom and my sister’s mother in law are on it and I was jealous. But they are both going off it because it makes them so sick. My stepmom says she’d rather be fat and have an appetite. They ask my opinion on it and I tell them that I don’t think it’s a good idea. Kinda to make sure they stop taking it and get fat again, I guess.",
          "created_utc": 1742924664.0
        }
      ]
    },
    {
      "id": "mke3r4e",
      "author": "elsie14",
      "body": "i raise you intermittent fasting and keto",
      "created_utc": 1743271732.0,
      "score": 1,
      "context": [
        {
          "id": "mjlx7z1",
          "author": "None",
          "body": "The ozempic and the bariatric surgery craze",
          "created_utc": 1742879494.0
        }
      ]
    },
    {
      "id": "mjqdwn6",
      "author": "MarshMello15593",
      "body": "I don't know who downvoted you, and neither do I know you, but I'm proud of you. Your health is what matters first and foremost. If that means using the tools at your disposal, then take them. Please continue to take care of yourself and remember that even if you don't like how you feel today, tomorrow, or even a year from now, know that some random stranger on the internet will care and be proud of you for you.",
      "created_utc": 1742940162.0,
      "score": 3,
      "context": [
        {
          "id": "mjpbaa6",
          "author": "EvieeBrook",
          "body": "Personally, I started taking low dose ozempic to keep my weight consistent. I started gaining a bit and I figured I’d go with the approach kinder to my teeth, esophagus, etc (I’m considering it harm reduction) than bingeing and purging.",
          "created_utc": 1742928774.0
        }
      ]
    },
    {
      "id": "mjxzbz4",
      "author": "petals33",
      "body": "that’s the exact same as one of my friends, it is beginning to be hard to be around her.",
      "created_utc": 1743040588.0,
      "score": 2,
      "context": [
        {
          "id": "mjxx18x",
          "author": "Sea_Organization_622",
          "body": "Yes, my friend is on it. She’s obsessed with weight loss drugs. It’s almost like she’s bragging of how little she can eat. First it was Monjaro and now it’s Ozempic. It’s her quick fix to loose weight for a party or a trip. She’s very open about it. It’s very triggering.",
          "created_utc": 1743039781.0
        }
      ]
    },
    {
      "id": "mke5v0d",
      "author": "elsie14",
      "body": "it is very expensive and it irks me that there are people in videos who are severely sub normal who had diabetes clearly don’t anymore but continue to get it covered by insurance to continue to be sub normal",
      "created_utc": 1743272423.0,
      "score": 1,
      "context": [
        {
          "id": "mkb6pg8",
          "author": "Realis_Fox3454",
          "body": "Yes. But it only triggers my depression cause I’m too poor to afford it so I’m jealous of them. 😞",
          "created_utc": 1743223459.0
        }
      ]
    },
    {
      "id": "mjmc7k6",
      "author": "According-Pride-9960",
      "body": "Bragging about losing 1lb a day using your own special magic potion is going to be triggering in this group.",
      "created_utc": 1742888864.0,
      "score": 8,
      "context": [
        {
          "id": "mjlclsn",
          "author": "EuropaofAsguard",
          "body": "Not me. I was losing 1lb a day just doing my own thing, without drugs, pills, powders or potions, which beats Ozempic out of the water.",
          "created_utc": 1742870247.0
        }
      ]
    },
    {
      "id": "mjlt9vd",
      "author": "finnians",
      "body": "i’m sorry but you *wish* you had an eating disorder??? that’s stupid as fuck. i’m sorry for whatever you’re going through to want to feel like that, but please don’t wish this for yourself. it truly is awful.",
      "created_utc": 1742877430.0,
      "score": 9,
      "context": [
        {
          "id": "mjlq4o1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1742875901.0
        }
      ]
    },
    {
      "id": "mjlyx7x",
      "author": "CoserMujer",
      "body": "I had one friend who I directly asked to stop and afterward she just couldn’t. She would only agree to hang out if we were doing intensive workouts or rigorous activities. I was a few weeks postpartum and my recovery was teetering.",
      "created_utc": 1742880454.0,
      "score": 10,
      "context": [
        {
          "id": "mjly6b2",
          "author": "CoserMujer",
          "body": "I have had to end friendships because of this… it was too much.",
          "created_utc": 1742880026.0
        },
        {
          "id": "mjlyjae",
          "author": "petals33",
          "body": "It’s so exhausting. The lack of self awareness becomes draining to be around after a while",
          "created_utc": 1742880232.0
        }
      ]
    },
    {
      "id": "mjmsgnr",
      "author": "CoserMujer",
      "body": "Not for taking the meds. But for their fixation and language around food and weight after being on the meds. Setting boundaries and not having those respected is a valid reason to walk away.",
      "created_utc": 1742899312.0,
      "score": 15,
      "context": [
        {
          "id": "mjly6b2",
          "author": "CoserMujer",
          "body": "I have had to end friendships because of this… it was too much.",
          "created_utc": 1742880026.0
        },
        {
          "id": "mjmp16y",
          "author": "Upset-Lavishness-522",
          "body": "Seriously ? Is a prescribed medication ! You would fo that to a friend?",
          "created_utc": 1742897329.0
        }
      ]
    },
    {
      "id": "n042mur",
      "author": "SweetSweet_Jane",
      "body": "Take your own advice and focus on yourself.",
      "created_utc": 1751049936.0,
      "score": 1,
      "context": [
        {
          "id": "mjn3pkj",
          "author": "SweetSweet_Jane",
          "body": "Absolutely. My mom is on it and has been fighting to get me on it even when I’m not sure about it. I feel bad for being hungry because no one in my house gets hungry anymore, I literally get anxiety when I have to ask what’s for dinner. \n\nTo add to that, I just want to stop thinking about food and my body so badly. Now there’s a drug that can help me with that, but because I have ED I can’t take it, but people who need help with their diet can? It’s all a bunch of bullshit",
          "created_utc": 1742904686.0
        },
        {
          "id": "n02zka7",
          "author": "PartyFrequent",
          "body": "Why dont you focus on yourself ? Ignore what you're mum says  Maybe prepare your own healthy foods. Are you trying to lose weight or gain weight. Clearing your mind helps and what is causing your anxiety? I've struggled to lose belly fat without ozempic as well it's is confusing ",
          "created_utc": 1751038935.0
        }
      ]
    },
    {
      "id": "mjmgcom",
      "author": "BananaRepublic0",
      "body": "This is so relatable!! I feel the exact same way!! It does feel like they’re cheating, and I get mean about it too!! I think “they’re being rewarded for being fat”. Lol and I’ve also done that research!",
      "created_utc": 1742891704.0,
      "score": 8,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        },
        {
          "id": "mjm99yo",
          "author": "adumbledorablee",
          "body": "YES! I feel the same. Like I get really mean about it in my head (even more so when I’m heavily restricting) and think “starve and put in effort like the rest of us”. \nHave I researched how to get my grabby little fingers on weight loss injections? Absolutely. I want to”the easy way out”. Have I succeeded? No. I’m glad they’re not as pushed and available in my country but I used to live in the US so a lot of my US friends get either Ozempic or had bariatric surgery whilst I sit there in my jealousy with a growling stomach.",
          "created_utc": 1742886893.0
        }
      ]
    },
    {
      "id": "mkdz743",
      "author": "elsie14",
      "body": "my grandma had bariatric surgery with an ED. Twice with her revision. she ultimately died underweight from deep seated complications of this. she died a ‘skinny legend.’ she was for all intents and purposes, a sick woman. moral of this story is, the wrong people in the wrong hands situation will use these tools to their ultimate end.",
      "created_utc": 1743270298.0,
      "score": 1,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        },
        {
          "id": "mjm99yo",
          "author": "adumbledorablee",
          "body": "YES! I feel the same. Like I get really mean about it in my head (even more so when I’m heavily restricting) and think “starve and put in effort like the rest of us”. \nHave I researched how to get my grabby little fingers on weight loss injections? Absolutely. I want to”the easy way out”. Have I succeeded? No. I’m glad they’re not as pushed and available in my country but I used to live in the US so a lot of my US friends get either Ozempic or had bariatric surgery whilst I sit there in my jealousy with a growling stomach.",
          "created_utc": 1742886893.0
        }
      ]
    },
    {
      "id": "mjn5jvf",
      "author": "_clur_510",
      "body": "Like she was saying how great it was and how she doesn’t care about food anymore. She said this after asking me if my birth control made me gain weight (which is normal) to which I replied “maybe? But not a noticeable amount.” \n\nI didn’t go there for ozempic and I don’t think I need it. A medical professional unsolicitedly implying I might felt very not okay.",
      "created_utc": 1742905453.0,
      "score": 8,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        },
        {
          "id": "mjn4rj1",
          "author": "_clur_510",
          "body": "I went to get my birth control shot I get every like three months and the nurse asked me if I gained any weight on it. I was like uhhh maybe? Nothing substantial my weight fluctuates normally. Then she mentioned ozempic and drugs like that and I laughed and was like hahah yeah can’t believe those are a thing. Then she said she takes it and lost 30 lbs. It kind of felt like she was selling it to me? I’m still upset by the interaction.",
          "created_utc": 1742905128.0
        }
      ]
    },
    {
      "id": "mjn90h9",
      "author": "Ok-Soup4974",
      "body": "I love this response. So thoughtful and kind. ❤️❤️❤️",
      "created_utc": 1742906824.0,
      "score": 4,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        },
        {
          "id": "mjn7sso",
          "author": "llamakins2014",
          "body": "I'm not sure if this is helpful, but for myself, I take solace in knowing Ozempic is a temporary solution. Are these people going to use Ozempic for the rest of their lives to stay skinny? (I may be wrong, but) my understanding of Ozempic is if you stop it, you just put the weight back on. Like you said, they are cheating, but it's not the right solution to the problem.\n\n For @OP, I think maybe you should let your friends know it makes you uncomfortable. If they are on Ozempc for weight loss, they must have at least SOME understanding of having thoughts of feeling the need to be skinny, it's possible they even have an ED themselves. You don't have to get angry with them about it, or even tell them how much it upsets you, you can just say \"hey that makes me uncomfortable,  could you please not make those sorts of comments around me\". If they wanna abide, cool. If not, ditch em. Or, less drastic but still effective, don't agree to anymore social settings where you'd be eating a lunch or dinner together.",
          "created_utc": 1742906354.0
        }
      ]
    },
    {
      "id": "mke054f",
      "author": "elsie14",
      "body": "they will stay on it, that is their intention. it does not permanently alter their body the same way that surgery does with regard to these hormones.",
      "created_utc": 1743270591.0,
      "score": 2,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        },
        {
          "id": "mjn7sso",
          "author": "llamakins2014",
          "body": "I'm not sure if this is helpful, but for myself, I take solace in knowing Ozempic is a temporary solution. Are these people going to use Ozempic for the rest of their lives to stay skinny? (I may be wrong, but) my understanding of Ozempic is if you stop it, you just put the weight back on. Like you said, they are cheating, but it's not the right solution to the problem.\n\n For @OP, I think maybe you should let your friends know it makes you uncomfortable. If they are on Ozempc for weight loss, they must have at least SOME understanding of having thoughts of feeling the need to be skinny, it's possible they even have an ED themselves. You don't have to get angry with them about it, or even tell them how much it upsets you, you can just say \"hey that makes me uncomfortable,  could you please not make those sorts of comments around me\". If they wanna abide, cool. If not, ditch em. Or, less drastic but still effective, don't agree to anymore social settings where you'd be eating a lunch or dinner together.",
          "created_utc": 1742906354.0
        }
      ]
    },
    {
      "id": "mke188l",
      "author": "haileyynicole7",
      "body": "That’s definitely a conversation to have with their providers for sure but studies are still showing that continue use of these drugs can cause gastroparesis",
      "created_utc": 1743270931.0,
      "score": 1,
      "context": [
        {
          "id": "mjmbfr7",
          "author": "haileyynicole7",
          "body": "I work in pharmacy and the studies are starting to show that using GLP-1s are causing gastroparesis in patients. No wonder they lose so much weight. \n\nBut I do agree hearing people talk about how they can’t even eat a meal anymore is pretty triggering.",
          "created_utc": 1742888342.0
        },
        {
          "id": "mke0rw0",
          "author": "elsie14",
          "body": "if they can’t eat a meal anymore they are doing it wrong. perhaps this is the reason for the gastroparesis the same way people with EDs can get gastroparesis. they should not be progressing in dose if they are unable to eat but clearly are/continue to. heaven forbid they alert their provider to scale back or discontine.",
          "created_utc": 1743270787.0
        }
      ]
    },
    {
      "id": "mjmefor",
      "author": "haileyynicole7",
      "body": "Gastroparesis? It’s paralysis of the stomach. It can no longer digest food",
      "created_utc": 1742890368.0,
      "score": 6,
      "context": [
        {
          "id": "mjmbfr7",
          "author": "haileyynicole7",
          "body": "I work in pharmacy and the studies are starting to show that using GLP-1s are causing gastroparesis in patients. No wonder they lose so much weight. \n\nBut I do agree hearing people talk about how they can’t even eat a meal anymore is pretty triggering.",
          "created_utc": 1742888342.0
        },
        {
          "id": "mjmc5cb",
          "author": "According-Pride-9960",
          "body": "What’s that?",
          "created_utc": 1742888823.0
        }
      ]
    },
    {
      "id": "mke1kvu",
      "author": "elsie14",
      "body": "they plan to take this for life. it changes nothing permanent so unless they are interested in surgery yes.",
      "created_utc": 1743271040.0,
      "score": 1,
      "context": [
        {
          "id": "mjnpn90",
          "author": "melaninspice",
          "body": "Surprisingly, I’m not triggered by the Ozempic craze. I’m worried about those who need the medication for their diabetes and them not being able to get it. Some girl on YouTube was talking about how her sister took it and how she lost so much and looks amazing. Then a few months later she said that her sister gained back all the weight and then some. Hearing that scared me.",
          "created_utc": 1742912515.0
        },
        {
          "id": "mjnsby4",
          "author": "petals33",
          "body": "Yeah that’s the thing about it, you’re not actually learning self control or healthy eating habits, it’s all a facade. As soon as you stop taking it you’re just going to be back at square one.",
          "created_utc": 1742913358.0
        }
      ]
    },
    {
      "id": "mmy8j7m",
      "author": "missmelodydoesitall",
      "body": "i currently have bulimia after spending four years of my life with anorexia, i just started semaglutide yesterday without my dietian or therapist knowing, my plan when getting off of it was tbh go back to what i have currently (eating disorder) but i js wanted something to speed up my weight loss faster",
      "created_utc": 1744575054.0,
      "score": 1,
      "context": [
        {
          "id": "mjnpn90",
          "author": "melaninspice",
          "body": "Surprisingly, I’m not triggered by the Ozempic craze. I’m worried about those who need the medication for their diabetes and them not being able to get it. Some girl on YouTube was talking about how her sister took it and how she lost so much and looks amazing. Then a few months later she said that her sister gained back all the weight and then some. Hearing that scared me.",
          "created_utc": 1742912515.0
        },
        {
          "id": "mjnsby4",
          "author": "petals33",
          "body": "Yeah that’s the thing about it, you’re not actually learning self control or healthy eating habits, it’s all a facade. As soon as you stop taking it you’re just going to be back at square one.",
          "created_utc": 1742913358.0
        }
      ]
    },
    {
      "id": "mjq22lk",
      "author": "JacketInner2390",
      "body": "Like I know if I had the opportunity I would use ozempic I would and have used weight loss drugs. I’ve seen them in the shops and I’ve taken them to the till only to turn back when I realise I’m too young to buy them. \n\nI hate seeing things online about celebrities that are already so skinny and my idea of a perfect body using weight loss drugs. They where designed for people that need to lose weight not for people that have a healthy weight (or even too skinny) \n\nIf you need to use it great and I hope you get to a weight that is healthy and you feel comfortable with but if you don’t fit into that category of\nWeight that NEEDS to use it then you should not even be thinking about it ",
      "created_utc": 1742936571.0,
      "score": 3,
      "context": [
        {
          "id": "mjpcl6e",
          "author": "JacketInner2390",
          "body": "As someone who literally has struggled with self control when it comes to buying weight loss drugs it really triggers me. Especially when celebrities that are allegedly using it when they clearly don’t need to. ",
          "created_utc": 1742929150.0
        },
        {
          "id": "mjpdp57",
          "author": "petals33",
          "body": "Definitely I feel like we’ve just reversed any progress we made in body positivity",
          "created_utc": 1742929477.0
        }
      ]
    },
    {
      "id": "mjqgzo9",
      "author": "MarshMello15593",
      "body": "No one said anything about not exercising. All of the ads I've seen always mention that they work with a healthy diet and exercise. Being able to be weened of medications is exactly why they emphasize the healthy diet and exercise part in commercials (the things that most influencers and celebrities leave out). You can definitely become healthy for what your body deems healthy with the help of medications. They aren't mutually exclusive. Medication is just a tool, but you can't make use of a tool without putting in some work.",
      "created_utc": 1742941131.0,
      "score": 3,
      "context": [
        {
          "id": "mjp5gas",
          "author": "YuleBunny",
          "body": "I’ve been getting several commercials of Ozempic and other GLP-1’s and it is so unbelievably triggering. I am on Lexapro and the Nexplanon so this weight gain has been really hard on me the ads aren’t helping. It’s all beautiful women smiling and dancing while they explain the weight loss. I had finally gotten comfortable with my weight gain and then I saw an ad of a plus size woman on Ozempic talking about how she wants to be healthier. That felt like a knife to the heart.",
          "created_utc": 1742927057.0
        },
        {
          "id": "mjpdh6q",
          "author": "petals33",
          "body": "Wanting to be healthier and taking ozempic are two contradictory statements! If you’re just losing weight without exercise you’re not gaining muscle or learning how to eat healthier. Your fitness will be the exact same once youre skinny 😭",
          "created_utc": 1742929412.0
        }
      ]
    },
    {
      "id": "mjqelw6",
      "author": "EvieeBrook",
      "body": "Thank you! I’m at a healthy weight that I’m happy about. I love not feeling like a slave to an ED on a daily basis. Yes, I still have issues, but I’m really ok with myself and my appearance. I actually have some ✨self confidence✨for a change! I think we all need to make the best decisions for ourselves. Anyone can judge me for taking Ozempic and that’s fine, but it is in no way as hard on my body as binging and purging. I’m not suggesting anyone else does it I’m just saying what seems to be working for me. Thank you again, though for your kind comment.",
      "created_utc": 1742940380.0,
      "score": 3,
      "context": [
        {
          "id": "mjpbaa6",
          "author": "EvieeBrook",
          "body": "Personally, I started taking low dose ozempic to keep my weight consistent. I started gaining a bit and I figured I’d go with the approach kinder to my teeth, esophagus, etc (I’m considering it harm reduction) than bingeing and purging.",
          "created_utc": 1742928774.0
        },
        {
          "id": "mjqdwn6",
          "author": "MarshMello15593",
          "body": "I don't know who downvoted you, and neither do I know you, but I'm proud of you. Your health is what matters first and foremost. If that means using the tools at your disposal, then take them. Please continue to take care of yourself and remember that even if you don't like how you feel today, tomorrow, or even a year from now, know that some random stranger on the internet will care and be proud of you for you.",
          "created_utc": 1742940162.0
        }
      ]
    },
    {
      "id": "mjpcfvz",
      "author": "EuropaofAsguard",
      "body": "No magic potion at all. I have an issue with restricting.",
      "created_utc": 1742929108.0,
      "score": 0,
      "context": [
        {
          "id": "mjlclsn",
          "author": "EuropaofAsguard",
          "body": "Not me. I was losing 1lb a day just doing my own thing, without drugs, pills, powders or potions, which beats Ozempic out of the water.",
          "created_utc": 1742870247.0
        },
        {
          "id": "mjmc7k6",
          "author": "According-Pride-9960",
          "body": "Bragging about losing 1lb a day using your own special magic potion is going to be triggering in this group.",
          "created_utc": 1742888864.0
        }
      ]
    },
    {
      "id": "mjpcvaj",
      "author": "EuropaofAsguard",
      "body": "Also, the thread is asking who gets triggered by the Rx drug, and considering I restrict so much it beats the results of an expensive drug, it's not me bragging about anything, but just shows how disordered I am. In the future, don't comment on someone's situation you know nothing about.",
      "created_utc": 1742929232.0,
      "score": -1,
      "context": [
        {
          "id": "mjlclsn",
          "author": "EuropaofAsguard",
          "body": "Not me. I was losing 1lb a day just doing my own thing, without drugs, pills, powders or potions, which beats Ozempic out of the water.",
          "created_utc": 1742870247.0
        },
        {
          "id": "mjmc7k6",
          "author": "According-Pride-9960",
          "body": "Bragging about losing 1lb a day using your own special magic potion is going to be triggering in this group.",
          "created_utc": 1742888864.0
        }
      ]
    },
    {
      "id": "mjlu695",
      "author": "SquirrelofLIL",
      "body": "I hate myself with a bone deep passion. I'm sorry I'll take it elsewhere as a pathetic wannabe. ",
      "created_utc": 1742877882.0,
      "score": -3,
      "context": [
        {
          "id": "mjlq4o1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1742875901.0
        },
        {
          "id": "mjlt9vd",
          "author": "finnians",
          "body": "i’m sorry but you *wish* you had an eating disorder??? that’s stupid as fuck. i’m sorry for whatever you’re going through to want to feel like that, but please don’t wish this for yourself. it truly is awful.",
          "created_utc": 1742877430.0
        }
      ]
    },
    {
      "id": "mjn2ohw",
      "author": "Upset-Lavishness-522",
      "body": "That's fair enough if they crossed a boundary. But....its a major reason why people take these and they're nound to be excited for anticipated results",
      "created_utc": 1742904245.0,
      "score": -6,
      "context": [
        {
          "id": "mjly6b2",
          "author": "CoserMujer",
          "body": "I have had to end friendships because of this… it was too much.",
          "created_utc": 1742880026.0
        },
        {
          "id": "mjmp16y",
          "author": "Upset-Lavishness-522",
          "body": "Seriously ? Is a prescribed medication ! You would fo that to a friend?",
          "created_utc": 1742897329.0
        },
        {
          "id": "mjmsgnr",
          "author": "CoserMujer",
          "body": "Not for taking the meds. But for their fixation and language around food and weight after being on the meds. Setting boundaries and not having those respected is a valid reason to walk away.",
          "created_utc": 1742899312.0
        }
      ]
    },
    {
      "id": "mjvdrl6",
      "author": "_clur_510",
      "body": "I don’t want to offend or trigger anyone - but I’m not even close to a BMI where any doctor has ever brought to my attention I need to lose weight to improve my health. This was completely a cosmetic suggestion.",
      "created_utc": 1743011784.0,
      "score": 1,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        },
        {
          "id": "mjn4rj1",
          "author": "_clur_510",
          "body": "I went to get my birth control shot I get every like three months and the nurse asked me if I gained any weight on it. I was like uhhh maybe? Nothing substantial my weight fluctuates normally. Then she mentioned ozempic and drugs like that and I laughed and was like hahah yeah can’t believe those are a thing. Then she said she takes it and lost 30 lbs. It kind of felt like she was selling it to me? I’m still upset by the interaction.",
          "created_utc": 1742905128.0
        },
        {
          "id": "mjn5jvf",
          "author": "_clur_510",
          "body": "Like she was saying how great it was and how she doesn’t care about food anymore. She said this after asking me if my birth control made me gain weight (which is normal) to which I replied “maybe? But not a noticeable amount.” \n\nI didn’t go there for ozempic and I don’t think I need it. A medical professional unsolicitedly implying I might felt very not okay.",
          "created_utc": 1742905453.0
        }
      ]
    },
    {
      "id": "mke6h8x",
      "author": "elsie14",
      "body": "i mean it’s how they work, not surprised it would be more permanent",
      "created_utc": 1743272625.0,
      "score": 2,
      "context": [
        {
          "id": "mjmbfr7",
          "author": "haileyynicole7",
          "body": "I work in pharmacy and the studies are starting to show that using GLP-1s are causing gastroparesis in patients. No wonder they lose so much weight. \n\nBut I do agree hearing people talk about how they can’t even eat a meal anymore is pretty triggering.",
          "created_utc": 1742888342.0
        },
        {
          "id": "mke0rw0",
          "author": "elsie14",
          "body": "if they can’t eat a meal anymore they are doing it wrong. perhaps this is the reason for the gastroparesis the same way people with EDs can get gastroparesis. they should not be progressing in dose if they are unable to eat but clearly are/continue to. heaven forbid they alert their provider to scale back or discontine.",
          "created_utc": 1743270787.0
        },
        {
          "id": "mke188l",
          "author": "haileyynicole7",
          "body": "That’s definitely a conversation to have with their providers for sure but studies are still showing that continue use of these drugs can cause gastroparesis",
          "created_utc": 1743270931.0
        }
      ]
    },
    {
      "id": "mjqg0xc",
      "author": "MarshMello15593",
      "body": "This! This is the comment that I think people need to hear! Using weight loss drugs shouldn't be a bad thing if you are obese or morbidly obese. I'm 300lbs, 5'7\" and morbidly obese. I will use the tools I have at my disposal. It's like using a shovel instead of your hands when digging holes for flowers. You don't need to get an even bigger shovel when the one you have is perfect. But giving one to someone using their hands won't hurt. \n\nHealthy is healthy no matter how you get there. What matters is you're there. Even if you waver and dip down or go up, what matters is that you are treating your body with love and care. And what's healthy for one person could be unhealthy for another. But you're still someone to be proud of, no matter how far you've come.",
      "created_utc": 1742940829.0,
      "score": 1,
      "context": [
        {
          "id": "mjpcl6e",
          "author": "JacketInner2390",
          "body": "As someone who literally has struggled with self control when it comes to buying weight loss drugs it really triggers me. Especially when celebrities that are allegedly using it when they clearly don’t need to. ",
          "created_utc": 1742929150.0
        },
        {
          "id": "mjpdp57",
          "author": "petals33",
          "body": "Definitely I feel like we’ve just reversed any progress we made in body positivity",
          "created_utc": 1742929477.0
        },
        {
          "id": "mjq22lk",
          "author": "JacketInner2390",
          "body": "Like I know if I had the opportunity I would use ozempic I would and have used weight loss drugs. I’ve seen them in the shops and I’ve taken them to the till only to turn back when I realise I’m too young to buy them. \n\nI hate seeing things online about celebrities that are already so skinny and my idea of a perfect body using weight loss drugs. They where designed for people that need to lose weight not for people that have a healthy weight (or even too skinny) \n\nIf you need to use it great and I hope you get to a weight that is healthy and you feel comfortable with but if you don’t fit into that category of\nWeight that NEEDS to use it then you should not even be thinking about it ",
          "created_utc": 1742936571.0
        }
      ]
    },
    {
      "id": "mjqiw6i",
      "author": "petals33",
      "body": "Both of my friends that take it haven’t changed anything about their lifestyles. They’re losing weight form the drug alone because it stops them eating as much",
      "created_utc": 1742941731.0,
      "score": 0,
      "context": [
        {
          "id": "mjp5gas",
          "author": "YuleBunny",
          "body": "I’ve been getting several commercials of Ozempic and other GLP-1’s and it is so unbelievably triggering. I am on Lexapro and the Nexplanon so this weight gain has been really hard on me the ads aren’t helping. It’s all beautiful women smiling and dancing while they explain the weight loss. I had finally gotten comfortable with my weight gain and then I saw an ad of a plus size woman on Ozempic talking about how she wants to be healthier. That felt like a knife to the heart.",
          "created_utc": 1742927057.0
        },
        {
          "id": "mjpdh6q",
          "author": "petals33",
          "body": "Wanting to be healthier and taking ozempic are two contradictory statements! If you’re just losing weight without exercise you’re not gaining muscle or learning how to eat healthier. Your fitness will be the exact same once youre skinny 😭",
          "created_utc": 1742929412.0
        },
        {
          "id": "mjqgzo9",
          "author": "MarshMello15593",
          "body": "No one said anything about not exercising. All of the ads I've seen always mention that they work with a healthy diet and exercise. Being able to be weened of medications is exactly why they emphasize the healthy diet and exercise part in commercials (the things that most influencers and celebrities leave out). You can definitely become healthy for what your body deems healthy with the help of medications. They aren't mutually exclusive. Medication is just a tool, but you can't make use of a tool without putting in some work.",
          "created_utc": 1742941131.0
        }
      ]
    },
    {
      "id": "mke4l7o",
      "author": "elsie14",
      "body": "ozempic is not for ED and is not not toted to fix an ED of any kind. ED is not fixed by food or weight manipulation. when a drug for ED comes to market we will all be ready.",
      "created_utc": 1743272004.0,
      "score": 1,
      "context": [
        {
          "id": "mjpbaa6",
          "author": "EvieeBrook",
          "body": "Personally, I started taking low dose ozempic to keep my weight consistent. I started gaining a bit and I figured I’d go with the approach kinder to my teeth, esophagus, etc (I’m considering it harm reduction) than bingeing and purging.",
          "created_utc": 1742928774.0
        },
        {
          "id": "mjqdwn6",
          "author": "MarshMello15593",
          "body": "I don't know who downvoted you, and neither do I know you, but I'm proud of you. Your health is what matters first and foremost. If that means using the tools at your disposal, then take them. Please continue to take care of yourself and remember that even if you don't like how you feel today, tomorrow, or even a year from now, know that some random stranger on the internet will care and be proud of you for you.",
          "created_utc": 1742940162.0
        },
        {
          "id": "mjqelw6",
          "author": "EvieeBrook",
          "body": "Thank you! I’m at a healthy weight that I’m happy about. I love not feeling like a slave to an ED on a daily basis. Yes, I still have issues, but I’m really ok with myself and my appearance. I actually have some ✨self confidence✨for a change! I think we all need to make the best decisions for ourselves. Anyone can judge me for taking Ozempic and that’s fine, but it is in no way as hard on my body as binging and purging. I’m not suggesting anyone else does it I’m just saying what seems to be working for me. Thank you again, though for your kind comment.",
          "created_utc": 1742940380.0
        }
      ]
    },
    {
      "id": "mjoiicp",
      "author": "ConfusedTeenInHer20s",
      "body": "I’ve been there. Wished to have an ED, developed one, still hated myself and now had given myself a ton of other problems. Wished to have trauma, had some amnesia lift and and started to remember I actually do have trauma, still hated myself and now had awful memories to deal with. Whatever you are craving, this is not the way to get it. Talk to someone. Get therapy. Find out which of your needs aren’t met and find ways to meet them that actually help and don’t cause harm. You deserve to. Wish you all the best!",
      "created_utc": 1742921156.0,
      "score": 5,
      "context": [
        {
          "id": "mjlq4o1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1742875901.0
        },
        {
          "id": "mjlt9vd",
          "author": "finnians",
          "body": "i’m sorry but you *wish* you had an eating disorder??? that’s stupid as fuck. i’m sorry for whatever you’re going through to want to feel like that, but please don’t wish this for yourself. it truly is awful.",
          "created_utc": 1742877430.0
        },
        {
          "id": "mjlu695",
          "author": "SquirrelofLIL",
          "body": "I hate myself with a bone deep passion. I'm sorry I'll take it elsewhere as a pathetic wannabe. ",
          "created_utc": 1742877882.0
        }
      ]
    },
    {
      "id": "mjlwg4k",
      "author": "finnians",
      "body": ":\\ i’m sorry you’re feeling like that. i’ve felt like that many times throughout my life, and still struggle with those feelings and thoughts. i don’t know you personally, but i bet you have so many amazing qualities. i hope you can find the self love you deserve. and remember you aren’t alone, don’t be afraid to reach out when things get too hard",
      "created_utc": 1742879073.0,
      "score": 4,
      "context": [
        {
          "id": "mjlq4o1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1742875901.0
        },
        {
          "id": "mjlt9vd",
          "author": "finnians",
          "body": "i’m sorry but you *wish* you had an eating disorder??? that’s stupid as fuck. i’m sorry for whatever you’re going through to want to feel like that, but please don’t wish this for yourself. it truly is awful.",
          "created_utc": 1742877430.0
        },
        {
          "id": "mjlu695",
          "author": "SquirrelofLIL",
          "body": "I hate myself with a bone deep passion. I'm sorry I'll take it elsewhere as a pathetic wannabe. ",
          "created_utc": 1742877882.0
        }
      ]
    },
    {
      "id": "mkdztom",
      "author": "elsie14",
      "body": "it would never be written purely for ‘weight gain due to birth control.’ at least not today.",
      "created_utc": 1743270492.0,
      "score": 1,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        },
        {
          "id": "mjn4rj1",
          "author": "_clur_510",
          "body": "I went to get my birth control shot I get every like three months and the nurse asked me if I gained any weight on it. I was like uhhh maybe? Nothing substantial my weight fluctuates normally. Then she mentioned ozempic and drugs like that and I laughed and was like hahah yeah can’t believe those are a thing. Then she said she takes it and lost 30 lbs. It kind of felt like she was selling it to me? I’m still upset by the interaction.",
          "created_utc": 1742905128.0
        },
        {
          "id": "mjn5jvf",
          "author": "_clur_510",
          "body": "Like she was saying how great it was and how she doesn’t care about food anymore. She said this after asking me if my birth control made me gain weight (which is normal) to which I replied “maybe? But not a noticeable amount.” \n\nI didn’t go there for ozempic and I don’t think I need it. A medical professional unsolicitedly implying I might felt very not okay.",
          "created_utc": 1742905453.0
        },
        {
          "id": "mjvdrl6",
          "author": "_clur_510",
          "body": "I don’t want to offend or trigger anyone - but I’m not even close to a BMI where any doctor has ever brought to my attention I need to lose weight to improve my health. This was completely a cosmetic suggestion.",
          "created_utc": 1743011784.0
        }
      ]
    },
    {
      "id": "msfp3uf",
      "author": "InternationalLoad724",
      "body": "I’m sorry this happened to you. That’s not right. Really not right. Ugh",
      "created_utc": 1747310996.0,
      "score": 1,
      "context": [
        {
          "id": "mjkpnhm",
          "author": "Ok-Soup4974",
          "body": "Yes. Honestly I can’t help but feel like they’re cheating. I get really jealous and avoid them. Then I feel bad because “I could be skinnier in just a month without that crap”… and then I spiral. I hate it!! What do you do when you’re triggered?",
          "created_utc": 1742862105.0
        },
        {
          "id": "mjn4rj1",
          "author": "_clur_510",
          "body": "I went to get my birth control shot I get every like three months and the nurse asked me if I gained any weight on it. I was like uhhh maybe? Nothing substantial my weight fluctuates normally. Then she mentioned ozempic and drugs like that and I laughed and was like hahah yeah can’t believe those are a thing. Then she said she takes it and lost 30 lbs. It kind of felt like she was selling it to me? I’m still upset by the interaction.",
          "created_utc": 1742905128.0
        },
        {
          "id": "mjn5jvf",
          "author": "_clur_510",
          "body": "Like she was saying how great it was and how she doesn’t care about food anymore. She said this after asking me if my birth control made me gain weight (which is normal) to which I replied “maybe? But not a noticeable amount.” \n\nI didn’t go there for ozempic and I don’t think I need it. A medical professional unsolicitedly implying I might felt very not okay.",
          "created_utc": 1742905453.0
        },
        {
          "id": "mjvdrl6",
          "author": "_clur_510",
          "body": "I don’t want to offend or trigger anyone - but I’m not even close to a BMI where any doctor has ever brought to my attention I need to lose weight to improve my health. This was completely a cosmetic suggestion.",
          "created_utc": 1743011784.0
        }
      ]
    },
    {
      "id": "mjqjjpe",
      "author": "MarshMello15593",
      "body": "Then they're not good friends to have. They'll learn the hard way when they come off it. It's always about putting in effort, but by the sounds of it they aren't trying to help themselves. It's like taking antidepressants and expecting to be magical cured overnight. Everything in the world takes effort, and if they can't see that, they deserve to learn the hard way.",
      "created_utc": 1742941940.0,
      "score": 3,
      "context": [
        {
          "id": "mjp5gas",
          "author": "YuleBunny",
          "body": "I’ve been getting several commercials of Ozempic and other GLP-1’s and it is so unbelievably triggering. I am on Lexapro and the Nexplanon so this weight gain has been really hard on me the ads aren’t helping. It’s all beautiful women smiling and dancing while they explain the weight loss. I had finally gotten comfortable with my weight gain and then I saw an ad of a plus size woman on Ozempic talking about how she wants to be healthier. That felt like a knife to the heart.",
          "created_utc": 1742927057.0
        },
        {
          "id": "mjpdh6q",
          "author": "petals33",
          "body": "Wanting to be healthier and taking ozempic are two contradictory statements! If you’re just losing weight without exercise you’re not gaining muscle or learning how to eat healthier. Your fitness will be the exact same once youre skinny 😭",
          "created_utc": 1742929412.0
        },
        {
          "id": "mjqgzo9",
          "author": "MarshMello15593",
          "body": "No one said anything about not exercising. All of the ads I've seen always mention that they work with a healthy diet and exercise. Being able to be weened of medications is exactly why they emphasize the healthy diet and exercise part in commercials (the things that most influencers and celebrities leave out). You can definitely become healthy for what your body deems healthy with the help of medications. They aren't mutually exclusive. Medication is just a tool, but you can't make use of a tool without putting in some work.",
          "created_utc": 1742941131.0
        },
        {
          "id": "mjqiw6i",
          "author": "petals33",
          "body": "Both of my friends that take it haven’t changed anything about their lifestyles. They’re losing weight form the drug alone because it stops them eating as much",
          "created_utc": 1742941731.0
        }
      ]
    },
    {
      "id": "mkfcilc",
      "author": "EvieeBrook",
      "body": "How many drugs are fda approved for one thing and then prescribed “off label” for something else entirely? I’m not waiting for the perfect ed only drug to hit the market. I’m saving my ass the best I can in the absence of this ed drug you’re imagining is (or may be) on the horizon. You’re not my doctor. I’m pretty happy I’m eating like a normal person and not binging and purging. At 44, my body can’t take much more b/p behaviors.",
      "created_utc": 1743286611.0,
      "score": 1,
      "context": [
        {
          "id": "mjpbaa6",
          "author": "EvieeBrook",
          "body": "Personally, I started taking low dose ozempic to keep my weight consistent. I started gaining a bit and I figured I’d go with the approach kinder to my teeth, esophagus, etc (I’m considering it harm reduction) than bingeing and purging.",
          "created_utc": 1742928774.0
        },
        {
          "id": "mjqdwn6",
          "author": "MarshMello15593",
          "body": "I don't know who downvoted you, and neither do I know you, but I'm proud of you. Your health is what matters first and foremost. If that means using the tools at your disposal, then take them. Please continue to take care of yourself and remember that even if you don't like how you feel today, tomorrow, or even a year from now, know that some random stranger on the internet will care and be proud of you for you.",
          "created_utc": 1742940162.0
        },
        {
          "id": "mjqelw6",
          "author": "EvieeBrook",
          "body": "Thank you! I’m at a healthy weight that I’m happy about. I love not feeling like a slave to an ED on a daily basis. Yes, I still have issues, but I’m really ok with myself and my appearance. I actually have some ✨self confidence✨for a change! I think we all need to make the best decisions for ourselves. Anyone can judge me for taking Ozempic and that’s fine, but it is in no way as hard on my body as binging and purging. I’m not suggesting anyone else does it I’m just saying what seems to be working for me. Thank you again, though for your kind comment.",
          "created_utc": 1742940380.0
        },
        {
          "id": "mke4l7o",
          "author": "elsie14",
          "body": "ozempic is not for ED and is not not toted to fix an ED of any kind. ED is not fixed by food or weight manipulation. when a drug for ED comes to market we will all be ready.",
          "created_utc": 1743272004.0
        }
      ]
    },
    {
      "id": "mke3cq6",
      "author": "elsie14",
      "body": "devils advocate putting in the effort is for lack of a better word, overrated or overran. how many long tiring grueling years have we collectively been putting in the effort and to what end, fighting against all forms of systems. look at the effects of forever chemicals or antidepressants alone on weight. if (women) hear doctors talk about (diet and exercise) one more time when they come in for a rash…",
      "created_utc": 1743271605.0,
      "score": 2,
      "context": [
        {
          "id": "mjp5gas",
          "author": "YuleBunny",
          "body": "I’ve been getting several commercials of Ozempic and other GLP-1’s and it is so unbelievably triggering. I am on Lexapro and the Nexplanon so this weight gain has been really hard on me the ads aren’t helping. It’s all beautiful women smiling and dancing while they explain the weight loss. I had finally gotten comfortable with my weight gain and then I saw an ad of a plus size woman on Ozempic talking about how she wants to be healthier. That felt like a knife to the heart.",
          "created_utc": 1742927057.0
        },
        {
          "id": "mjpdh6q",
          "author": "petals33",
          "body": "Wanting to be healthier and taking ozempic are two contradictory statements! If you’re just losing weight without exercise you’re not gaining muscle or learning how to eat healthier. Your fitness will be the exact same once youre skinny 😭",
          "created_utc": 1742929412.0
        },
        {
          "id": "mjqgzo9",
          "author": "MarshMello15593",
          "body": "No one said anything about not exercising. All of the ads I've seen always mention that they work with a healthy diet and exercise. Being able to be weened of medications is exactly why they emphasize the healthy diet and exercise part in commercials (the things that most influencers and celebrities leave out). You can definitely become healthy for what your body deems healthy with the help of medications. They aren't mutually exclusive. Medication is just a tool, but you can't make use of a tool without putting in some work.",
          "created_utc": 1742941131.0
        },
        {
          "id": "mjqiw6i",
          "author": "petals33",
          "body": "Both of my friends that take it haven’t changed anything about their lifestyles. They’re losing weight form the drug alone because it stops them eating as much",
          "created_utc": 1742941731.0
        },
        {
          "id": "mjqjjpe",
          "author": "MarshMello15593",
          "body": "Then they're not good friends to have. They'll learn the hard way when they come off it. It's always about putting in effort, but by the sounds of it they aren't trying to help themselves. It's like taking antidepressants and expecting to be magical cured overnight. Everything in the world takes effort, and if they can't see that, they deserve to learn the hard way.",
          "created_utc": 1742941940.0
        }
      ]
    }
  ]
}