{
  "id": "1jjx9pr",
  "subreddit": "EatingDisorders",
  "author": "lowkeyloki23",
  "created_utc": 1742944124.0,
  "title": "My dad has developed an eating disorder. It's triggering me, and I'm worried about my child. What do I do?",
  "selftext": "TW for rapid weight loss, dieting, and really everything else\n\nSo I should probably start with some backstory. Growing up, my dad was always morbidly obese to the point of having mobility and health issues. In 2016, he got gastric bypass surgery, and lost 3/4 of his bodyweight. Now, he's hovering around a normal-to-underweight BMI, and has been for the past 4 years or so. Great. But, he's constantly talking about food, calories, exercise, etc. I've also struggled with eating disorders growing up, and I'm recognizing some of the same patterns that I've had. Conversations always come back to how he \"just can't get under [goal weight]\" or how he's going on a new diet (usually a fully liquid diet) because he's afraid of \"his clothes feeling tight\" again. He'll comment on other people's bodies and fatshame them. Me and my brother, especially. We've kind of put up with it for years, because with him having such a rapid weight loss, our childhoods revolved around weight and food talk. \n\nBut it's gotten astronomically worse since I had my son 6 months ago. He'll cry when he's hungry (obviously. He's a baby.) or show excitement when I offer him a bottle, and my dad will say things like \"you better break him of that. Food is fuel he doesn't need to be so excited about it.\" Or he'll tell me not to feed him fruit purees because he'll get addicted to the sugar. Or he'll talk about how we need to make sure he spends most of his time active and outside so he doesn't get fat. He'll even comment on how he's glad I have a \"skinny baby.\" (MASSIVE EYE ROLL.) Every time I visit him or he visits me, mine and my baby's bodies are the topic of conversation, and I'm getting, honestly, pissed off about it. I've tried talking to him about it, and his mindset is just that anything is better than being fat. Even a heavily unhealthy relationship with diet and exercise. I know that my kid doesn't understand what he's saying now, but what happens when he does? I don't want him to develop an unhealthy relationship with food like, before he even has a chance, you know?  I don't know what to do. I know that when I'm relapsing, someone telling me I need help just makes me worse. I love my dad and I don't want to just cut him off, but this has got to stop. For both me and my child. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jjx9pr/my_dad_has_developed_an_eating_disorder_its/",
  "score": 59,
  "num_comments": 11,
  "comments": [
    {
      "id": "mjqvfz1",
      "author": "Sea_Juice_285",
      "body": "I would start with, \"I'm not interested in having conversations about my child's body,\" or, \"We're not talking about his weight,\" and ending the conversation - even if you need to physically leave - right away. \n\nMy kids are still very young, and my parents and in-laws have been slightly better about this recently, so I haven't had to address it yet, but I will also establish boundaries around people talking about their own bodies if I need to in the future. \n\nI don't want to alienate anyone I care about, but I'd rather piss off an adult relative than risk triggering an eating disorder in my child. \n\nOn a loosely related note, I recommend looking into Ellyn Satter's division of responsibility. I've found it helpful in thinking about how to feed my children in a way that will hopefully encourage them to have a healthy relationship with food.",
      "created_utc": 1742945666.0,
      "score": 36,
      "context": []
    },
    {
      "id": "mjrqadz",
      "author": "-abby-normal",
      "body": "This is absolutely UNHINGED behavior. Body shaming a BABY?????",
      "created_utc": 1742956183.0,
      "score": 22,
      "context": []
    },
    {
      "id": "mjs11q7",
      "author": "-justarandomcutie",
      "body": "Your father needs therapy. I'm more direct so if I were you, I'd tell him that he should be careful with his words if he still wants his grandson in his life. And I would definitely cut him off, your baby's mental and physical health is at risk.",
      "created_utc": 1742960402.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mjs54zi",
      "author": "Complete-Barnacle-13",
      "body": "Babies are literally supposed to have 'tummy fat' to grow. Keep feeding your baby all the right foods and nutrients, restricting food from literal birth will only make him want it more. Otherwise your baby could be at risk. also, talk to your dad about how your not comfortable with these type of conversations right now. establish boundaries before its too late",
      "created_utc": 1742962215.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mjt1ohe",
      "author": "LucilleLooseSeal123",
      "body": "Oh my god I have no advice really but I am so sorry.  He is so sick :(",
      "created_utc": 1742981981.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mjyqalx",
      "author": "Dry-Spare-9489",
      "body": "Why is he pouring his insecurities onto you! That’s sick.. as a Dad he needs to be more self aware and maybe go to Therapy. Body shaming a baby is insane. Simply tell  him “I don’t feel comfortable with you analysing my babies’ body” this could have long term affects on your baby in the future once he grows older and if he doesn’t change just limit being around him",
      "created_utc": 1743051919.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mk14hqi",
      "author": "bucket_hat2000",
      "body": "honestly i think you need to cut him off before your kid is old enough to start understanding what he’s saying. he shouldn’t have that kind of influence in his life. and you would be happier too. of course, you could try to get him help if you feel you can. but it also isn’t your job to parent him tbh. try to get him to go to therapy, but you are a parent now with your own responsibilities",
      "created_utc": 1743091106.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mk4jsva",
      "author": "Big-War-5535",
      "body": "Protect you and your child. That’s the most important thing. \n\nThough he definitely needs therapy if you can suggest that - being morbidly obese in this world is traumatizing and dehumanizing, and doing whatever to protect yourself from that hurt is understandable. But he can protect himself in a way that doesn’t harm you or your child and in a way that is sustainable and healthy for himself",
      "created_utc": 1743131858.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mjt5mjz",
      "author": "AbundantiaTheWitch",
      "body": "For me if that didn’t work I would think I just couldn’t bring my child around him until he stops commenting like that and gets therapy",
      "created_utc": 1742984333.0,
      "score": 3,
      "context": [
        {
          "id": "mjqvfz1",
          "author": "Sea_Juice_285",
          "body": "I would start with, \"I'm not interested in having conversations about my child's body,\" or, \"We're not talking about his weight,\" and ending the conversation - even if you need to physically leave - right away. \n\nMy kids are still very young, and my parents and in-laws have been slightly better about this recently, so I haven't had to address it yet, but I will also establish boundaries around people talking about their own bodies if I need to in the future. \n\nI don't want to alienate anyone I care about, but I'd rather piss off an adult relative than risk triggering an eating disorder in my child. \n\nOn a loosely related note, I recommend looking into Ellyn Satter's division of responsibility. I've found it helpful in thinking about how to feed my children in a way that will hopefully encourage them to have a healthy relationship with food.",
          "created_utc": 1742945666.0
        }
      ]
    },
    {
      "id": "mkgi8h0",
      "author": "Stuffie_lover",
      "body": "But obviously that babt fat is dangerous, if the baby is being properly fed its outragous",
      "created_utc": 1743301657.0,
      "score": 0,
      "context": [
        {
          "id": "mjrqadz",
          "author": "-abby-normal",
          "body": "This is absolutely UNHINGED behavior. Body shaming a BABY?????",
          "created_utc": 1742956183.0
        }
      ]
    }
  ]
}