{
  "id": "1jndru0",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1743345366.0,
  "title": "I think I’m developing an ED. what is wrong??",
  "selftext": "I cant eat without either overeating or undereating. ive limited myself to a very low amount of cal per day. every time i look in the mirror i hate what i see. Ive tried forcing myself to throw up but i'm too lazy to. my parents wont let me get on ozempic or a semaglutide. nothing is working. every time someone mentions food i get triggered and anxious and it puts me in a shitty mood. I binge eat to cope with my depression and it makes me feel shitty. I starve myself and force myself to work out. i brainwash myself by lookign and pinterest boards of dangerously skinny girls. (i'm overweight for my age and height) \n\nwhat is wrong with me? no one thinks i have an ED because i eat SO much and i'm plump and curvy. but on the inside i'm berating myself i envy those girls that force themselves to throw up or can go days without eating and feel fine. id rather be on the brink of death and unhealthy than at the size im at. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jndru0/i_think_im_developing_an_ed_what_is_wrong/",
  "score": 34,
  "num_comments": 11,
  "comments": [
    {
      "id": "mkka760",
      "author": "nanaiko_",
      "body": "Girls who go days without eating don't feel fine, and overeating doesn't feel fine either. Not enough and too much are both unhealthy, find out what you need to be healthy and if it's getting in the way of your life- losing a little weight is a good idea to get to a healthier weight. Don't compare yourself to others, just do what makes you feel your best",
      "created_utc": 1743361272.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mkka9f0",
      "author": "laynalol",
      "body": "i would suggest talking to a professional too, but i just wanted to say you do not have to be skinny to have an ed",
      "created_utc": 1743361291.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mkkffjl",
      "author": "None",
      "body": "it's great that you're noticing the problem and reflecting on it, that's the first step. talk to a trusted adult about this. all your problems can be fixed, after all there's a whole branch of science specialising in it. destroy your ED before it destroys you.",
      "created_utc": 1743362885.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mkkln9z",
      "author": "RealisticFlatworm334",
      "body": "Similar situation here, I’ve always told myself my behaviors couldn’t be part of an ED because I’m heavy. I’ve always been overweight regardless of periods of restricting so I thought I was fine. Casually mentioned it to a therapist one day and it opened up a great conversation. I’d suggest starting there - talking to a professional if you can, it could be helpful in figuring things out :)",
      "created_utc": 1743364823.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mkl2qjn",
      "author": "Za__7__ef",
      "body": "I’m truly sorry that you’re struggling. If I can offer any advice, it would be to consider opening up to someone you trust. You mentioned hinting to your therapist—perhaps next, you could try sharing more. I know this isn’t easy, but seeking help early can make a significant difference. And from experience I absolutely don’t recommend going down this path.",
      "created_utc": 1743370191.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mkmd0br",
      "author": "StarstanMitski",
      "body": "if you keep eating so little, your bound to be in a cycle of all or nothing. starvation gives your body a scarcity mindset in which it cant trust you to give it all it needs consitently, so when it is getting food it wont stop eating. almost like an animal. it can also cause bloating which (for me) made everything worse w the body issues. itd likely be better to just find out what your maitnence number is and just have a little deficit to reach maintainable weightloss. however if you think you are developing an ed it could be better to wait on that and try to fix your mindset",
      "created_utc": 1743386929.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mkkt7fa",
      "author": "elhazelenby",
      "body": "Trust me, you don't feel fine when you don't eat enough or throw up your food regularly. Anyone who says otherwise is lying to you. Part of the reason many people with eating disorders binge or start to binge is because they restrict themselves too much.\n\nYour behaviours are not any less disordered just because you overeat instead of undereat at times or because you're not underweight. The amount of people with EDs who are underweight is quite low. Binge eating is absolutely a disordered way of eating and I struggle with it too.",
      "created_utc": 1743367135.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mku89k8",
      "author": "theowlsbrain",
      "body": "If you can get acces to a therapist that would be my first suggestion. There's clearly something that's triggering this in you and being aware of all of these things means you recognize they're bad and you want help. Eds are not clear cut a lot of people struggle with binge eating it's a very normal response to starvation. You don't deserve to feel this way <3",
      "created_utc": 1743507145.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ml98zym",
      "author": "PreferenceConnect487",
      "body": "Check out the old friends speak posts on my ED newsletter. You might be able to resonate with them. \nhttps://open.substack.com/pub/beenanokboy\n\nStay strong love",
      "created_utc": 1743710023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkkklpr",
      "author": "None",
      "body": "ive tried subtly hinting to my therapist abt it and she doesnt do much. my parents dont listen either",
      "created_utc": 1743364500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkl6hmc",
      "author": "psychedelicbarbie",
      "body": "Restricting yourself just makes you lose water weight, the second you eat all the weight you “lost” from restricting will come back. Find a happy balance 🫶🏼",
      "created_utc": 1743371443.0,
      "score": 0,
      "context": []
    }
  ]
}