{
  "id": "1jnnue8",
  "subreddit": "EatingDisorders",
  "author": "cgsf",
  "created_utc": 1743372004.0,
  "title": "My adult sister has an ED but will not get help",
  "selftext": "My younger sister (we are both in our mid 30s) has been on a self-restricted diet for about a year or so. It's plant-based (no meat, no dairy) and nothing that grows underground. Something about eating only the things that grow in the sun. It's not about her weight, but about control. She sometimes binges (still sticking to her diet options, though) which she calls \"overeating\". \n\nShe is no longer underweight, as she is making sure she eats enough calories (nuts do all the heavy lifting). \n\nHowever, her body dysmorphia is insane. She is constantly tweaking her diet to \"fix\" things about her body (nails, hair, skin, teeth). She has been experiencing hair loss, but claims since it only happens \"on days she overeats\" that that is the reason, and she just needs to be better at not gorging herself. \n\nI spent the day over at her house yesterday. If I got paid every time she said \"because of their diet\" and \"because they're dehydrated\" I'd be rich, no exaggeration. I got offended when she even said my son's autism is because he has too much salt. She believes she has cured her ADD and anxiety by going low to zero sodium. \n\nShe claims she stinks if she eats anything outside her self-imposed diet. She claims her hair gets curly when she's sticking close to her diet and gets flat if she overeats, etc. Essentially, everything \"wrong\" is because of bingeing, and she thinks her diet is actually making impossible changes for her (like now she has 3 rows of eyelashes instead of just 2??). \n\nBut she doesn't see her bingeing as an eating disorder. She sees it as a weakness that she still needs to figure out how to control. The way she talks about her body... She literally sounds like an insane person to me. \n\nShe does not have a job. She has money saved up and plans to focus only on this self improvement plan of hers for 2 years. She has no insurance. She lives alone. \n\nShe also claims to be a \"food scientist\" because of all the \"research\" she's done on her diet and food. I will say she is a very intelligent woman (data scientist / math), but she has no formal education in this field, and she only reads up on what confirms her bias.\n\nI tried to take her to the ER last night and failed. I told her I would pay for it. It doesn't matter. Everything she hears, she has a \"response\" for. Everybody else is wrong, she's the only one who is right. \n\nI'm exhausted, and I only spent half a day listening to her. I did not realize how taxing it is to just be talked at. My husband calls it her religion. She does not try to convert anyone, but she firmly believes it does miracles for her even while we all watch her deteriorate. \n\nAm I just to wait until she hits rock bottom? I don't think even then she will get help unless she's made to, which is unlikely to happen. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jnnue8/my_adult_sister_has_an_ed_but_will_not_get_help/",
  "score": 49,
  "num_comments": 5,
  "comments": [
    {
      "id": "mkmauk6",
      "author": "jarofonions",
      "body": "Zero sodium is extremely dangerous, as it's literally necessary for heart function. Can you maybe try sending her articles about electrolytes (sodium, potassium, magnesium) that she \"might find interesting\"? And maybe sprinkled in there, a few about healthy fats and stuff. \n\nI'd recommend starting this approach slowly to build trust and curiosity, starting with things that more closely align with her current \"beliefs\". However, it is dangerous for her to continue and you're right to be worried. It's tough, bc she essentially has to choose to get help, but if you want to try to steer her in the right direction, this might be a place to start. Good luck, I hope smth works out <3",
      "created_utc": 1743386097.0,
      "score": 32,
      "context": []
    },
    {
      "id": "mkm7lxf",
      "author": "alienprincess111",
      "body": "This sounds like orthorexia.  Unfortunately you can't really make someone recover from an ED.  They have to want it themselves for treatment to work.",
      "created_utc": 1743384861.0,
      "score": 56,
      "context": []
    },
    {
      "id": "mklnuvl",
      "author": "Absurdicas",
      "body": "Thank you so much for looking after your sister! I know it can be difficult with family matters. It sounds like she could do with a bit of help! \n\nIn recovery we often talk about what makes a food “bad” and how we can challenge “fear foods”. Usually it is a little step at a time, but it requires patience and want from her to get better. \n\nI would start with soft I statements (“I notice that you spend a lot of time thinking about food”), not putting a label on it and just tell her that you are there for her. Don’t go into any type of next step, just lay the groundwork for her to process.",
      "created_utc": 1743377507.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mlifm7r",
      "author": "Any_Seaweed9898",
      "body": "Do we have the same sister? I am going through something SO similar with my little sister (29) and I don’t know what to do. \n\nMine also lives alone, is also very intelligent (works in medicinal chemistry) and has become obsessed with what she consumes - or rather what she doesn’t. I was with her for 48 hours this week and she didn’t eat a crumb. She is wasting away in front of me and she can’t see that she needs help! \n\nShe has always cared about her appearance - used to spend £££ on her hair, makeup, fake tan 24/7, her teeth - but all of that has stopped and she’s put what little energy she does have into her weight. Now she only fits in children’s clothes. \n\nShe tracks obsessively and says how much she enjoys it. She denies having a problem, saying that I’m just not used to seeing her this weight. 12 months ago she was a healthy size 12, now she’s in size 12 children’s clothes.\n\nThis is awful to say because I love her SO much, but I find myself now dreading to see her because I know how upset I will get. I hate seeing how scarily thin she is, it breaks my heart. \n\nI’m not sure where you are in the world, but something I did was rang her doctors surgery and expressed my concerns. They asked me to fill out a triage form, and then they contacted her directly asking to make an appointment, and that it has been requested. She was VERY reluctant and NOT happy, but I said please just do it for me, for our mum, so we don’t worry. If the doctor tells us you’re fine, then we’ll apologise and move on, but it’s just to be safe. Appt was yesterday and surprise surprise she’s not fine. They’re running blood tests and heart scans this month. Doctor is very concerned but has not communicated this to my sister - or at least that’s what she’s saying (we went into appt together first, I expressed my concerns, and then I was asked to leave so dr could speak to my sister in private. I’m told here she was weighed, had bloods taken and dr had a chat with her about potential stresses she’s facing). If you can do that, or go with her or ask a family member to attend and share their concerns, that will be a big help for her AND for you - she sounds like she needs help from the professionals, so anything you can do to put it in their hands. \n\nThat frees up all of the responsibility falling on your shoulders, and means your role is now to offer a comfortable place for her to land - when that eventually happens. To check in regularly, try to visit when you can (taking your own mental health into consideration too!) and give her some light amidst the darkness she’s in. I’m trying to do things that aren’t food related eg. decorating her new house, visiting a garden centre, going for a coffee (herbal tea in her case).\n\nIt’s such a heartbreaking journey and I’m so so sorry you’re going through this, I can really empathise with you, but as a short term solution I do think ANYTHING you can do to pass her situation over to the professionals will be a huge huge help. It’s a disorder that takes control of the body AND the mind, and she will need professional help to understand this before anything can change.\n\nSending you love xxx",
      "created_utc": 1743841455.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mkqd5xj",
      "author": "taxicab_",
      "body": "Absolutely sounds like orthorexia. One of the tricky things about it is a lot of mental health professionals have never heard of it (unless they specialize in eating disorders), so it can easily be undiagnosed. Although in the sister’s case, it sounds like she’s pretty explicit about her thoughts on food, which would be helpful for a diagnosis (if that’s what it ends up being).",
      "created_utc": 1743447483.0,
      "score": 10,
      "context": [
        {
          "id": "mkm7lxf",
          "author": "alienprincess111",
          "body": "This sounds like orthorexia.  Unfortunately you can't really make someone recover from an ED.  They have to want it themselves for treatment to work.",
          "created_utc": 1743384861.0
        }
      ]
    }
  ]
}