{
  "id": "1jqx8bx",
  "subreddit": "EatingDisorders",
  "author": "Aderi07",
  "created_utc": 1743721882.0,
  "title": "What caused your disordered eating?",
  "selftext": "I would like to know what disordered eating you have/had, what triggered its beginning, and how you are moving through/past it. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1jqx8bx/what_caused_your_disordered_eating/",
  "score": 66,
  "num_comments": 164,
  "comments": [
    {
      "id": "mlbgfpc",
      "author": "MollilyPan",
      "body": "Well here we go…\n* The era I grew up in (eighties/nineties) \n* My mother’s weight obsession \n* How young and fast I went through puberty. (I’m still the same height I was at eleven.)\n* Childhood SA\n* Inherited tendencies towards mental illness\n* I danced for over three decades and the pressure to stay thin bc my body was always on display certainly didn’t help either.",
      "created_utc": 1743737944.0,
      "score": 76,
      "context": []
    },
    {
      "id": "mlbmi9p",
      "author": "etwichell",
      "body": "Someone said something to me",
      "created_utc": 1743740723.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mlbid4u",
      "author": "j_p96",
      "body": "I struggle with (what has morphed into) anorexia. It all started from getting comments growing up anytime I’d eat more than “normal”, like asking for another helping of food. Anytime I ate junk food, there were comments. \n\nThen I saw a photo of myself. I was not overweight, but I genuinely saw myself that way. I despised how I looked. I began dieting, hiding it, plus I was really young. I lost most of the weight I had, and have pretty much been struggling since. But I became extremely restrictive a few years ago, and is now full blown anorexia. \n\nThere used to be times where I was “better”, meaning simply maintaining a weight but not necessarily a healthy one. As long as I wasn’t actively losing — I took it as a win. Those times have now completely gone away. I lose some amount every month, and my doctor has stated that if this continues, they will have to implement hospitalization. Currently struggling badly but receiving outpatient treatment/therapy. \n\nIt’s very exhausting, frustrating and downright scary. Sorry for the long comment. Just being honest…",
      "created_utc": 1743738799.0,
      "score": 17,
      "context": []
    },
    {
      "id": "mlbkine",
      "author": "JerkOffTaco",
      "body": "Losing a lot of weight after a life-saving transplant surgery.  I am receiving compliments on my new body I have never received before.  Now I am stuck in a guilt cycle of never wanting to look how I used to look again.  I’m sober now too so I care much more about my appearance.\n\nETA: My mother was a huge blow to my confidence during my childhood.  Millennial girls had it hard.",
      "created_utc": 1743739785.0,
      "score": 14,
      "context": []
    },
    {
      "id": "mlbkmup",
      "author": "No_Worldliness_4446",
      "body": "Started tracking food on a certain blue app with the intent of gaining weight in the form of muscle. Got addicted to the dopamine hits I received from seeing the calorie deficit get bigger and bigger while still getting close to my delusionally high protein goals. Then the protein part subsided and now it’s all about the size of the negative number. I somehow deluded myself into believing that I could subsist off of triple digit calories and that this was my “normal” just because I was able to function at a bare minimum level while eating like this. Then I started failing lifts and instead of seeing the real issue, I decided to abandon my goal of gaining muscle. The strange part is that it wasn’t really about how my body looked. Like yeah weight loss became part of the goal because I bought a scale and started weighing myself multiple times a day a few weeks after I started tracking, but I’m literally addicted to seeing that deficit get bigger and bigger on a fucking app. Tried deleting it, felt distress and just started writing it out in my notes app instead. I taught myself to use Microsoft excel to do the projected weight loss equation using the bmr/calories from exercise data from my Apple Watch and that was… probably one of the lowest points I’ve reached. I’m not even addicted to losing weight, apparently I’m addicted to doing fucking math. It’s ridiculous. I already have a preexisting autoimmune condition that caused chronic mono to damage my liver, so having a sufficient appetite was already difficult for me. And then my stupid ass just had to go and give myself a psychological reason to not eat as well. The worst part is as soon as I logged a single bite of an apple into the blue app that shant be named, my bf, mom, and everyone else warned me and I didn’t listen. Don’t count macros if you’re mentally unstable at all, kids.",
      "created_utc": 1743739840.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mlbhwmk",
      "author": "honalele",
      "body": "trauma from something unrelated to food, of which i will not be disclosing.",
      "created_utc": 1743738594.0,
      "score": 21,
      "context": []
    },
    {
      "id": "mlbjmma",
      "author": "ranpowdereddonuts_",
      "body": "to sum it up, I just wanted to lose weight.",
      "created_utc": 1743739371.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mlbnb8n",
      "author": "RisingPhoenix603",
      "body": "I am 51 in 2021 my husband of 20 years walked out on me for no reason,no explanation went back to his parents basement where I found him 20 years earlier after his 2nd divorce. He was 52 when he left. That’s what started it for me. I stopped eating then only liquids. Now it’s almost 4 years later and nothing has changed. I’ll eat but very little. I also suffer from severe depression and SSI. So trauma did this to me.",
      "created_utc": 1743741108.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mlcc0u5",
      "author": "Putrid-Reaction-257",
      "body": "Health anxiety - thinking that i could have cancer or any tumor.\nStress",
      "created_utc": 1743754966.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mldimxq",
      "author": "hotlizardtango",
      "body": "Childhood trauma, being afab and growing up with undiagnosed autism and the rejection sensitivity and inability to understand social cues/my peers that goes with it, growing up in diet culture and multiple generations of women in my life being entrenched in it, perfectionistic and people pleasing tendencies, and my weight/body size becoming part of my identity and worth at such a young age.",
      "created_utc": 1743775119.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mlbx3r8",
      "author": "DifferenceInitial962",
      "body": "My brother told me I was fat all the time, when I was severely underweight around 14/15 yrs old, already struggling with eating (not in an ed way) but from fears of food. Also non prescribed vyvance addiction really started my restricting behaviors and I got extremely addicted to the feeling of restriction and continued once I stopped taking the vyvance. So I think a combination of being called fat when I was in no way fat at all and the medication. It’s really warped my mind, the fat thing because once I heard it, I saw it and believed it and still don’t know what I look like to this day.",
      "created_utc": 1743746147.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mlc3fka",
      "author": "Sea_Juice_285",
      "body": "What caused it? A lot. What triggered it? Birth control. Unfortunately, it took me a *loooong* time to figure that out.",
      "created_utc": 1743749491.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mlcrfk7",
      "author": "Low-Bit2048",
      "body": "Being the fat, ugly autistic kid nobody liked in school",
      "created_utc": 1743764334.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mldip4o",
      "author": "bellemountain",
      "body": "Mom going on every fad diet growing up and her always getting commented on as so small when she was younger… knowing exactly how much she weighed when she got married. Young puberty and getting “baby fat” through that process. Stopping sports after high school which was quickly followed by my first breakup which was an abusive relationship",
      "created_utc": 1743775139.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mlbypxo",
      "author": "Moltres101",
      "body": "Here is my list: \n\n- I was healthy as a child while all my cousins were skinny like a stick so all my aunts would call me fat & ugly. \n- Three of my girl cousins bullied me, saying that I'm too ugly and no one would date me. \n- I grew up in a culture obsessed with looks, all my life, it was ingrained in my mind that I wasn't fair enough, thin enough etc. \n- I also have ibs since I was kid and it kept getting worse. \n-Jokes on them, I had a glow-up in my 20s and now everyone just keeps complimenting me. \nI am recovering now and I'm proud of how far I've come, I don't obsess over food or exercise as much. However, my ibs still make me feel fat everytime I eat.",
      "created_utc": 1743747065.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mlcal71",
      "author": "llamasfartIveheardit",
      "body": "I am a nurse and had to shield during covid due to health conditions (asthma) I then felt guilty and useless as I watched my fellow nurses deal with the covid pandemic and I was at home. Even though I was technically working from home (doing alot of admin jobs to help sort out wait list) \n\nWorst part was. People with well controlled asthma (me) were allowed back but I still had to shield as my weight had become to low (which apparently put me at a higher risk) which made me feel even more guilty. \n\nTook me a year to get out the cycle and well enough to get back to work. And took three years to deem myself fully recovered. Still have blips but alot better then before.",
      "created_utc": 1743754022.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mlcsdlo",
      "author": "LowKaleidoscope9134",
      "body": "was chubby growing up and when i hit puberty i started experiencing gender dysphoria i thought losing weight would make me like my body more. i also thought by eating less i was saving my family money and it made me more convenient to have. then i got addicted to the dopamine from seeing the numbers on the scale go down.",
      "created_utc": 1743764807.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mlbahy5",
      "author": "alienprincess111",
      "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
      "created_utc": 1743735442.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mlc9oh4",
      "author": "drainuape",
      "body": "(Adding a TW for the vent at the bottom) \n\nSeeing my parents wrap their bodies in that stupid foil and constantly talk about dieting/ wanting to lose weight and talk negatively about their own bodies are some of my earliest memories. \nI started feeling insecure about my body in preschool because of the comments of my bullies.\n\nHowever the actual habits and ed behavior like starting to restrict and secretly work out in my room had only started when i was 14. when quarantine hit, it was my goal to go back to schools slimmer. I was still at a healthy bmi and weight though but the behaviour definitely got worse. \nThe girl i had been talking to at that time actually ended up being my gf and towards the end of our relationship my ed got worse, she was the first person to know and my first romantic relationship too. \nThen we broke up, i felt even more unlovable and couldnt get myself to eat properly, then i started to workout and go on walks to distract myself and ever since then, i can't get out. \n\n(Starting to vent)\n\nit's such a deep part of me now that i honestly can't imagine myself being recovering mentally. These thoughts are all i know since ive been 7. \nthe only times i'm aware that i'm doing better is when i feel loved by someone that isnt me, suddenly its easier to eat and everything. It seems impossible for me to lose the mindset alone.",
      "created_utc": 1743753429.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlcrfvk",
      "author": "Crazy_Corgi559",
      "body": "- being a skinny child and being told boys will like me if im skinny\n\n- My grandma's (who raised me) disordered eating\n\n- mental illnesses and abandonment issues\n\n- My grandma was in a wl competition with several family members and included some of her teenage nieces. Seeing her be happy/ sad with the outcome.\n\n- childhood SA\n\n- adult SA",
      "created_utc": 1743764338.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlcvoyz",
      "author": "Glum_Measurement1746",
      "body": "in middle school someone sent me an anonymous message telling me i’d look better if i lost weight😭",
      "created_utc": 1743766367.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlcvs7x",
      "author": "Glum_Measurement1746",
      "body": "and all of my friends were like insanely skinny and i hated how i looked next to them in pictures",
      "created_utc": 1743766409.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlelfqe",
      "author": "Remote-Wear-2325",
      "body": "Used to have a close friend with an ED, she became obsessed with calories and then I did too.",
      "created_utc": 1743786852.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlenffz",
      "author": "amyt2710",
      "body": "OCD and unrealistic beauty standards. Limiting my food intake became a false point of control for me to avoid the fear of being ugly/unlovable if I wasn't skinny.",
      "created_utc": 1743787446.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlepoae",
      "author": "throwawaybtwway",
      "body": "My mom was actively bulimic when I was a child and taught me how to be too. She didn’t see anything wrong with throwing up a meal, skipping two, and then throwing up again. She would call me fat. By the time I was in 7th grade I had an awful eating disorder. My dad was able to convince my mom that I needed help. ",
      "created_utc": 1743788102.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mleuaqf",
      "author": "Rarely_Ruminates",
      "body": "- neglected autism and other disabilities \n- untreated ADHD\n- COCSA and verbal abuse that included body shaming\n- OCD\n- parents",
      "created_utc": 1743789468.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlf7ky3",
      "author": "Chaerin_Sistas",
      "body": "I struggled with restrictive anorexia for a long part of my middle school years, I recovered but relapsed to binge restrict. It was mainly learned from Korean/90s-2000s Beauty Standards of thinness encouraged by my mom from early childhood. I always see food as a bad thing, especially in front of my mom. I have talked to my mom about it and she makes an effort to help me feel normal around food, never ever talks about food in a bad way or body types/weight. I used to be willing to recover for God, because it’s a sin to idolize a certain body type over God or food for that matter, but I find it extremely hard to give up being thin. I place so much of my worth in how often I restrict and my body size. ",
      "created_utc": 1743793513.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlf7tso",
      "author": "OtherwiseSetting7172",
      "body": "I saw how other girls were treated and the pressure to stay skinny so I did what I could to stay skinny skinnier than everyone and the adhd meds helped so much with not eating that it made it worse",
      "created_utc": 1743793590.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mlbxxu4",
      "author": "xxComicClownxx",
      "body": "I started counting my calories and tracking my macros which lead to me to supposedly 10% body fat when I got tested, but I was restricting so many of the foods I love which led to my first binge with fast and the cycle just keeps on going",
      "created_utc": 1743746620.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlbzlqg",
      "author": "Cassio_Taylor",
      "body": "Choked when I was 5\nChoked when I was 6\nOh well, food must be overrated",
      "created_utc": 1743747510.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlch6ir",
      "author": "ThinAbbreviations573",
      "body": "my parents split when I was two (2) and my dad took the house, even though my mum became the main care giver, so my mum became poor. because my mum was poor she wouldn't eat so me and my sister could eat. \n\nI became overweight and got bullied for it by my \"friends\" that have given me trauma.\n\nmy dad has made fun of my double chin, made fun of the way I look while I eat and has called me a whale which I told him to apologise for.\n\nmy friends have always been skinnier than me, but what made it worse for me is that they were either same height or shorter than me.",
      "created_utc": 1743758344.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlcm9em",
      "author": "autisticlittlefrog",
      "body": "Childhood sa and grooming. Finding Eugenia Cooney way too young",
      "created_utc": 1743761496.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlcole4",
      "author": "tobeasloth",
      "body": "Having ASD contributed to having ARFID which I’ve always experienced, then I during my teenage years I had disordered eating and body dysmorphia due to comments from family and the media, then at sixteen I got ill with a condition that caused neuroinflammation that amplified everything 😅",
      "created_utc": 1743762838.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlcqb8y",
      "author": "K90H",
      "body": "abandonment, being called fat by kids and adults and being a victim of SA as a child",
      "created_utc": 1743763761.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlcv5lr",
      "author": "MegMegMeggieMeg",
      "body": "I had the biggest arm out of all the bridesmaids in my friend’s wedding.",
      "created_utc": 1743766120.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mld1hu8",
      "author": "gnomeslinger",
      "body": "Got molested lol. Wanted to escape what my body looked & felt like during that time, and discovered I just have a very addictive personality",
      "created_utc": 1743768869.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mldlnku",
      "author": "sunflowerforlife100",
      "body": "Bullying. Wanting a feeling of control. But it started as a form of self*arm, not eating for days. But it's better know, but it feels like it's going downhill again 😓",
      "created_utc": 1743776084.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mleduzp",
      "author": "Maleficent_Pea_4844",
      "body": "my mom (both parents actually). she was always tall and naturally thin ~or so I thought~. I grew up watching her pick apart her body, call herself fat when she wasn’t, point out love handles that don’t exist. \n\nthen I watched her pick on my older sister, comment when she looked “bloated” as a teenager. she made her take water pills. my sister developed an ed and I copied it bc I watched both of them engage in this shit.\n\nmy parents were abusive fucks in different ways. The only comments I ever got were condemning or praising my looks. Carb intake was a big one. It still triggers me. “Are you really gonna eat that”. But no teaching of how to actually eat or normal practices. The few times she sent me $$ for groceries in college she begged me to not buy carbs. \n\nComing home from college was a nightmare, it was always upon waking into the door “you look thinner” or not. Or please don’t eat that. I gained 30 lbs from starting antidepressants in college, they were relentless. When I would visit my sister, my dad asked if she was still fat. Insane environment.\n\nI don’t have a relationship with my mom anymore. This is part of it. Covid was my lowest weight. The only way I got my mom to leave me alone was sending her a body checking pic where you could see all my bones.",
      "created_utc": 1743784575.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlemf6j",
      "author": "ningyizhuo",
      "body": "For me it was a series of events. I’ve always been very skinny. But my grandma said some triggering stuff to me and my sister as children (like “don’t eat too much Nutella or you’ll end up fat”) as well as generally being a fatphobic person. I remember being proud of being skinny in elementary school and later vowing to be only a certain weight until I would turn 16 (funny to think I’m still that weight 10 years later).\n\nWhen I started middle school I started getting bullied for my looks. I started purging then and when I started high school I ended up reading some pro ana stuff and while being disturbed at first, I ended up believing in it and thinking that I couldn’t change how my nose looks like or if people like me but that I could be the skinniest. And that’s how it started for real.\n\nI saw 2 therapists at some point and had monthly check ups at an ED clinic for 2/3 years. Eventually they let me go because my condition was very stable and I guess not bad enough to make me an inpatient. I was very happy because I thought I would be able to be sick in peace lol. \n\n5/6 years happened since I stopped getting professional help and I am okay now. I do relapse occasionally, sometimes worse than others but generally I’m doing fine as long as my weight is stable. I know my triggers (lack of control, feeling insecure about my looks etc..) so I guess it helps controlling the relapses. I also got plastic surgery and it helped me tremendously to get more self confident and to not need the rush that starving gave me to feel good.",
      "created_utc": 1743787147.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlen7px",
      "author": "veganonthespectrum",
      "body": "narcissistic mother, not believing im worthy of love, therefore trying to be worthy of love by being as small, as young, as wanted as possible",
      "created_utc": 1743787384.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlexdh5",
      "author": "Crunchy-Basil",
      "body": "Mom was encouraged to put me on several types of diets by doctors as a kid, she always disparaged her weight and body even though I always thought she was beautiful, both kids and adults would always make fcked up comments about my body. That along with CSA made me develop a cycle of comparing my body to guys whose approval i craved, knowing full well it didn’t matter if i was thin, most of them didn’t even like dudes. Once one of my friends saw me in underwear and laughed at me outright at the same time that he was openly questioning his own same sex attraction it kinda broke me and i developed restrictive eating habits somewhere between anorexia and EDNOS i guess. Maybe more like bulimia since i did the whole restrict all day and binge at night, still lost an unhealthy amount of weight. Im still recovering almost 10 years later since both the binging and restriction never really left. There’s better and worse periods. Self love and compassion have done a lot and so has eating in an actual healthy way. Therapy too but realistically i need a lot more of that",
      "created_utc": 1743790390.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlez312",
      "author": "Zeione29047",
      "body": "Overwhelming stress, lack of funds to feed myself, lack of energy to actually prepare food, food prepared by myself has started becoming bland and tasteless, gastric issues that cause pain whether I eat or not, anxiety about eating healthier foods (grease, ouls, and processed foods literally makes my stomach kill itself), anxiety about all of these makes it hard to eat in social settings…\n\nBut this all really started when I noticed that eating too much food costed my mom too much money. So I cut back on eating, and asking for wants, all at the ripe age of 10.\n\nIt took me a long time to even notice I had an issue. Smoking usually gives you the munchies, but it got to a point where I smoked to fall asleep before I got too hungry. I had an endoscopy done, nothing. I’m too traumatized to allow anyone in my rear, so no colonoscopy. Nothing was found with multiple ER and GI specialist visits. \n\nI’m at a loss. Even buying more food/snacks/fruit to just have laying around in the house doesnt incentivise me either. Every few moons I may eat to full capacity, but this is usually because my mom knows good restaurants I’ve never tried.\n\nI’ve lost so much weight and have become so much more fragile mentally and physically. But I’m at a fucking loss.",
      "created_utc": 1743790914.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlf064j",
      "author": "d3vilsfav",
      "body": "My mother was trying to control my weight from a very early age which made me rebel by binge eating in secret. I gained a lot of weight and as a result, not only my mother but my classmates were bullying me too. So a random day 12 years ago it somehow turned into AN",
      "created_utc": 1743791246.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlf3ur2",
      "author": "nanaiko_",
      "body": "I wanted my mother's attention",
      "created_utc": 1743792372.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlfc7rp",
      "author": "blacklabcoat",
      "body": "Severe restriction and rapid weight loss caused my binging.\nA whole childhood/adolescence of being the chubby kid and having a disturbed relationship with food, plus a tad of obsessive personality traits, caused my restriction.",
      "created_utc": 1743794971.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlfdee1",
      "author": "CreativeHippo9706",
      "body": "Dysfunctional home life and emotionally abusive step mum and emotional absent parents. I just wanted to be cared for 🥲 10 years on and we still fighting this beast",
      "created_utc": 1743795347.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlfi5rg",
      "author": "Inevitable-Cell-1307",
      "body": "I have struggled to accept my body for a very long time, and when it started my situation at home was terrible which was my breaking point. I just wanted to like my body and have control over my life",
      "created_utc": 1743796818.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlfqfi7",
      "author": "BaeGod_",
      "body": "My mother",
      "created_utc": 1743799355.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlfuoyz",
      "author": "AngelsLips",
      "body": "Bullying. They never called me fat or ugly\n\nBut i hoped that it will stop when i got skinnier/prettier. It didnt :D",
      "created_utc": 1743800696.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlfvjhv",
      "author": "Impressive_Hour5281",
      "body": "I'm not blaming my sister but she would constantly come into my room and body check in the mirror to me when we were talking and call herself fat. I just kinda internalised it and now we're here.",
      "created_utc": 1743800971.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlfz3lw",
      "author": "Stenuhhh_",
      "body": "•years of trauma\n•had a horrible injury and was bed bound for a few months and I didn’t wanna get fat because i couldn’t workout so I started to only eat healthy and then really just spiraled from there. \n•grew up with heavily overweight parents and got to a very heavy weight around the time of injury in above comment, so also wanted to get low and wasn’t gonna let myself go down the same path \n•also originally a form of control until I realized it was beginning to control me and yeah",
      "created_utc": 1743802145.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlg0zgc",
      "author": "fireantsinmyhead",
      "body": "being fat shamed by my ex, my own friends, their friends, my ex’s friends, etc. it was like this massive group of people just dogging on me nonstop and i took it until i couldn’t anymore, i ended up losing the weight but like at what cost? yeah and now most of them feel guilty but it’s too late",
      "created_utc": 1743802772.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlg48d3",
      "author": "Atomic-Axolotl",
      "body": "I wrote a pretty big response, but I was probably doxxing myself if my parents were here, so had to delete it. OP can probably still see it in notifications though.",
      "created_utc": 1743803865.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlg74hn",
      "author": "Dear-Door-2601",
      "body": "I have no idea, I just sat down at the kitchen table with my mom one day and asked “how do I lose weight?” I was nine and an athletic kid. And thus it began",
      "created_utc": 1743804874.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlg8y5c",
      "author": "shakethedisease666",
      "body": "G e n d e r   O f   B i r t h",
      "created_utc": 1743805527.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlge0es",
      "author": "grlflungoutofsp",
      "body": "- CSA (Childhood Sexual Abuse)\n- Bullying in secondary school.\n- Diet culture.\n- Domestic violence (children are victims too).\n\nI started developing my ED after the abuse which happened when I was 11.\n\nI believe, as many specialists say, that ED's don't have a single cause but multiple factors that contribute to their development. My case is an example of that.\n\nI've had a relapse after ten years of being free from ed thoughts and behaviours. I'm trying to figure out what I need to move past it.",
      "created_utc": 1743807365.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlgpohw",
      "author": "rcarman87",
      "body": "My mother was a severe narcissist who has her own disordered eating issues and then as a young child I developed something called colonic inertia and gastroparesis so food began to cause me both emotional and physical pain. Once I began losing weight I got lots of positive reinforcement even when I was deathly thin. It was a perfect storm of things for me. I was never overweight but my self image was.",
      "created_utc": 1743811653.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlgvd59",
      "author": "495girl",
      "body": "Not feeling good enough or pretty enough .... started in elementary school rather it was at home or school. I got shit at both places and there was escape for me.",
      "created_utc": 1743813835.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlh0bjg",
      "author": "TallNPierced",
      "body": "Ooh good question!\n- Stimulants from age 4\n- Forced perfectionism\n- a traumatic childhood",
      "created_utc": 1743815770.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlh137z",
      "author": "Any_Dragonfruit_9905",
      "body": "My mom",
      "created_utc": 1743816066.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlh3lv7",
      "author": "AdmirableCut9873",
      "body": "My mother was OBSESSED with her weight and was always trying to lose. Living in the same house ment dieting for all of us too. I’ll be honest, my siblings did carry around extra but nothing the would prompt excessive dieting. My step mom also called me fat when I was at a very fragile age in middle school because I developed faster than anyone in my class and it stuck. That’s all I saw myself as. Even now. \n\nI’ve done intensive outpatient therapy before and left because someone there just bullied the crap out of me and called me a “fake anorexic” because I wasn’t underweight and the therapist said nothing. \n\nIt immediately reminded me of my childhood and I left the next day. It’s been a life long struggle for me, tittering the knife’s edge, but I’m trying to be better and re-parent myself because my family is trash and still obsessed with weight and aligning it with value and worth.",
      "created_utc": 1743817060.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlh8tvs",
      "author": "Pipes110780",
      "body": "My mom mostly. I was always an incredibly skinny kid. Couldn't gain weight for anything. Then i got in cheer and started getting a shit ton of muscle, which adds to your weight. Trying to get her approval, i started trying to lose said weight bc she said i wasnt pretty enough, wasnt normal enough, and dont i wanna look more like (insert that days comparison, usually another girl on fhe team). Then as i got older and she got harder and harder to please it just got worse. Then i got on the internet and found thousands of people just like me who knew better ways that were easier to hide. And at fifteen years old, impressionable and striving for perfection in a way that wouldnt get me in trouble, that sounded like a sweet deal. Que ED",
      "created_utc": 1743819148.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlhbt2e",
      "author": "Heavy-Step8628",
      "body": "Going up in the 90s with my mother who was obsessed not only with her body and weight but mine also",
      "created_utc": 1743820380.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlhe09u",
      "author": "ConferenceTimely4474",
      "body": "One word: mother",
      "created_utc": 1743821303.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mlcsg8b",
      "author": "buruburungga",
      "body": "Constant comments of my body even when I was at my healthy weight. I slowly became obsessed with the compliments but freaked out when someone said I lost a lot. It also became a quick fix for me whenever I felt overwhelmed by things I can't control.",
      "created_utc": 1743764841.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mldg2gi",
      "author": "acidinbath",
      "body": "i couldn’t change my face or control my acne to stop the bullying but i could control my weight",
      "created_utc": 1743774274.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mldk5gt",
      "author": "YuukiShao",
      "body": "Tumblr and my family bullying me...",
      "created_utc": 1743775609.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mldmfok",
      "author": "MoulinSarah",
      "body": "About 17 different things starting in 1983 lol",
      "created_utc": 1743776326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mldxdow",
      "author": "Secret_Pepper_8243",
      "body": "I've had a habit of hyperfixating on a food and when I get the chance to eat it I'll eat it in a larger portion. During school break, I hated when my parents wake me up to eat breakfast so I stayed up until morning to eat rice noodles if not bread. I guess it's just so good that I ate lots of it everyday even my mom pointed out I don't have to eat that much. However, my real turning point was when I discovered what fasting was and installed a fasting tracker app, it was going fine at first then I realized I could have just stopped eating entirely. Now whenever I eat all I can see are numbers. Maybe yes I finally learned how to eat vegetables and dropped sodas and junk foods. I know my health conscious mother is proud but this is not the kind of healthy living I'm looking for.",
      "created_utc": 1743779622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mle0h6z",
      "author": "intoner1",
      "body": "Trauma, not wanting to be fat (yet I am), and extremely low self esteem.",
      "created_utc": 1743780548.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mle6ynx",
      "author": "sad-bb",
      "body": "Growing up on Adderall, body comparison comments, and a competitive mindset",
      "created_utc": 1743782471.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mle8t48",
      "author": "playgroundprincess",
      "body": "i had an anorexic friend who would send me diet plans and body checks all the time😕 it got to my head and eventually i developed GERD (runs in the family), which finally left me with ARFID that i have to deal with",
      "created_utc": 1743783036.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mledacx",
      "author": "InvestigatorCheap489",
      "body": "- childhood emotional neglect\n- being raised by two alcoholics (see above reason)\n- my mom complaining about how much she hated her own body, going through puberty and then everyone telling me I looked just like my mom\n- family and society overemphasizing someone’s worth based on their physical body \n- unprocessed grief",
      "created_utc": 1743784400.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlfitbd",
      "author": "GrandIntelligent9951",
      "body": "Mine started by learning what c4ls were at eleven. I had no idea what it was until then, and i looked on the back of my lunch and thought, hey, I’ve only had _ today! it became a game, and then it became a body thing over i learned that it affects your weight. ",
      "created_utc": 1743797017.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlfus1s",
      "author": "None",
      "body": "Insecurity and emetophobia!<3",
      "created_utc": 1743800723.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlhhg6f",
      "author": "danidaisys",
      "body": "i already had a history of an ed but recovered the first couple of times. the third time i had gained a lot due to bad eating habits. i saw my we!ght at urgent care and it went all downhill from there…",
      "created_utc": 1743822801.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlhqq7o",
      "author": "Salt-Palpitation-141",
      "body": "In short, my mom. She would constantly make comments about my eating habits as a kid, and would punish me when I got upset, saying I was overreacting and that she was just giving me advice and being nicer about it than her parents were. There was a ton of moments and reasons for it, but the thing that really set me on my ed was when in 8th grade I didn't fit into a dress I used to, and my mom said \"this is what happens when you don't listen to my advice\" from there on I stopped eating lunch at school and had a sense of guilt whenever I did. In high school, I considering purging instead of just restricting and that's what it turned into. I was diagnosed with Bulimia later that year and have been steadily recovering since and am a few months sober.",
      "created_utc": 1743827161.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mli772x",
      "author": "writersan",
      "body": "Trauma and parental negligence",
      "created_utc": 1743836148.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mli79k7",
      "author": "Easy-Net8818",
      "body": "Control/loss of control. When my life was at its lowest point, restricting calories felt like the only thing I had real control over. I went from anorexic   with bulimic tendencies to binge eating disorder when I got put on a specific mental health med. basically turned my stomach into a bottomless pit and the shame that followed the binges was making me so depressed. I would under-eat all day in anticipation of binging at night. I changed my medication regiment a few weeks ago and now feel afraid I’m inching back towards severe restriction. I don’t think I’ve ever had a health relationship with food in my adult life and it seems to stem from wanting control over at least one aspect of my life.",
      "created_utc": 1743836189.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlif5cr",
      "author": "angry_sarcastic_poet",
      "body": "- witnessed someone getting easily contastipated and got scared\n\n- didn't want to get periods so I googled what would start my playlist. I saw that eating a certain amount would make your body not get periods and decided to do that.",
      "created_utc": 1743841145.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mliir3o",
      "author": "carrotcakexpress",
      "body": "Child of the 80's and 90's here. I was 7 years old in jazz class and I can remember looking at my body in a leotard in the dance class mirror and realizing I looked much bigger than the other girls. The next year my dad had me doing sit-ups with him every night, plus I was put on one of my mom's crazy diets weight watchers, Jenny Craig or something else. I was 8 years old and I can remember talking to classmates and realizing that nightly sit ups and diets were not normal for them. From there on there were comments from family members, class mates, etc that fed my body insecurities, not to mention that I was always on some diet that my mom forced on me and my dad, but my sister never had to be on the diets because she was naturally skinny. I learned the negative body image talk from my mom as she was always unhappy with her body and size and sadly my dad was no better with his body.  I was also a show horse girl and it was frequently mentioned that the skinny girls look best on a horse. Looking back, I don't think I stood a chance in ever developing a healthy relationship with food.",
      "created_utc": 1743843559.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mliv98g",
      "author": "Tonic_spac3y",
      "body": "Seeing all these people with wild childhood trauma is certainly eye opening, I don’t really have anything special. I just know that I was overweight as a kid, so I developed anorexia cause I wanted to be better. No one said anything to me to trigger what I did. I was never like bullied, but I’m still struggling with it 6 years later, regardless of all the people that tell me I’m skin and bones.",
      "created_utc": 1743851622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlj23q2",
      "author": "cellalovesfrankie",
      "body": "Being malnutritioned as a 3 year old\nBeing adopted \nProb mums subtle comments \n90s/2000 diet culture \nDad controlled my diet until I was 14 \n Everything just popped off at 16. \nI also don’t know why I started at 16.",
      "created_utc": 1743855187.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mljl4fa",
      "author": "theowlsbrain",
      "body": "I'm not sure, from the start it's slowly creeped in and took over. I have arfid which is likely caused by autism but also other disordered eating patterns. I grew up very insecure and othered and many of my self destructive tendencies are triggered by loss of control. My worst periods are the times I've downloaded food tracking apps I get very easily obsessed with numbers. I don't constantly struggle with this I mostly have periods of it being bad. I generally stay away from all numbers both calories and weight, I've tried many times it just makes me spiral immediately. I grew up bullied, neglected by medical systems and undiagnosed untill I was an adult it makes sense to me that a general lack of control triggered it.",
      "created_utc": 1743862887.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlk0bau",
      "author": "LupitaLovely",
      "body": "I have ARFID due to a choking incident last year. Went through all of the steps, inpatient, residential, PHP and IOP. I'm live life  now, some set backs due to stress but doing way better then before.",
      "created_utc": 1743868044.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlkik8h",
      "author": "basically_dead_now",
      "body": "My grandmother. She would constantly body shame me and shame me for being ugly, saying that I needed to stop eating to lose weight and look pretty. She also refused to feed me whenever I was under her care, and she started doing that from when I was in kindergarten",
      "created_utc": 1743874117.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlkpj55",
      "author": "thisislikemytenthalt",
      "body": "Probably comments I’ve heard from my mom growing up, TikTok, and the fact I was obese",
      "created_utc": 1743876377.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlle7lw",
      "author": "Aerisia",
      "body": "The final trigger was an episode of depression that caused me to lose my appetite for a couple of days, which then spiralled into a full-on ED.\n\nArguably my disordered eating started a couple of years earlier when I started university and was living independently for the first time. I had a tendency to binge eat when I was stressed or anxious, which happened a lot given I had depression, anxiety and ASD. My medication didn’t exactly help with the side effects of weight gain and increased appetite.\n\nI think my disordered attitude towards food developed over my childhood as my mother was always trying to lose weight, so certain foods were often labelled as ‘good’ or ‘bad’ and dropping weight was always seen as a success and gaining was a cause for disappointment.",
      "created_utc": 1743884748.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlli0nz",
      "author": "None",
      "body": "•emotional abuse from someone in my family\n•not being able to make friends (I’m autistic) \n•being a dancer and noticing how my skinny fellow dancers get criticised less and praised more \n•inherited predisposition towards eating disorders",
      "created_utc": 1743886017.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlljdbz",
      "author": "Certain_Teaching_331",
      "body": "Wanting to be the skinniest person in the room, hated when people were skinner than me made me feel terrible about myself",
      "created_utc": 1743886471.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlm754x",
      "author": "Snapepotion",
      "body": "I have restrictive anorexia and binge purge subtype. I have had it for nearly 20 years now, since childhood. It started it primary school when I became fearful of eating in front of others. Something happened in the dining room at primary school whilst I was eating. It then became worse and worse as I aged. I have tried EVERYTHING to move past it. But it IS me at this point. Really sad.",
      "created_utc": 1743895088.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlnbbz6",
      "author": "Strong_Ad_3332",
      "body": "Whenever I felt sad, my dad bought me chocolate. So food became emotional regulator for me and so that made me gain weight. Then everyone around me talking about my weight, made me literally dream of having this perfect body. That’s when my vicious cycle of eating and restricting began. During university, I lost a bunch of weight and when I saw everyone started talking about how I have suddenly become pretty, it was all the validation I needed to just overworking myself in the gym, eating little to no food and counting literally every little thing I ate. I would get so anxious if I ate more than 1000 calories in a day that the next day I would fast. I knew what I was doing was detrimental to my health but I loved the way it made me feel and so I kept at it. I am still work in progress but I don’t count calories anymore.",
      "created_utc": 1743911324.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlnt7dn",
      "author": "Ambitious_Fold6537",
      "body": "Probably when…my brother called me thunder thighs and my mother said my stomach was big when I was 15. I still hear it in my head every day and when I have to see either one of them I have extreme panic attacks.",
      "created_utc": 1743920380.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlo47pu",
      "author": "SnooSuggestions6330",
      "body": "AN. Experienced grief from a terrible break up. Got thin, wanted to stay thin because of social pressure + felt control over something in my life for the very first time + helped block emotions from the break up when I participated in ED behaviors. Went to treatment facility back in 2024 for 3 months and now just in outpatient care under a dietician's supervision.",
      "created_utc": 1743926935.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlpxg7n",
      "author": "limeimeiil",
      "body": "↬ ballet at a young age; you can alr tell\n↬ matured quickly because of family\n↬ got into social media at age 6\n↬ constant comparison with friends\n↬ mom often told me to work out",
      "created_utc": 1743956563.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlqzqzk",
      "author": "Possible-Frosting-77",
      "body": "It started around summer 2021 where, after the pandemic, i (at the time 14f) developed anxiety.\n\nFor background, i have always had emetophobia (fear of (being) sick) for as long as i can remember.  I have also been a dancer since the age of 2 so have the body dysmorphia that often follows.\n\nWith the development of my anxiety my emetophobia got worse to the point where i couldn’t eat for days and crying over a yoghurt because i thought it would make me sick. \n\nMy mum had noticed one day, while trying on a top, that i had lost a significant amount of weight. I was a fairly chubby kid so it was easier to recognise. I immediately told her how i was feeling and we agreed to see a doctor. The wait was excruciating and things only got worse from there. \n\nAt this point i didn’t know what was wrong w me. Every time i tried to eat i got an overwhelming wave of nausea which obviously panicked me having the phobia that i do. I never linked it to the anxiousness that i was experiencing at the time. I thought i could be something wrong with my stomach. So the doctor, thinking it could be physical, ran a load of tests and nothing. He referred me to a therapist which is where i got my diagnosis. Disordered eating caused by anxiety.\n\nAfter having counselling for about a year, my anxiety, and alongside it, my eating got better. For 2022 i felt amazing.\n\nYou know how when you’re recovered you can often miss your sick body? I started developing these thoughts in 2023 as my mh/body dysmorphia started to get worse. And like that i started developing characteristics often associated with anorexia.\n\nI never told my parents as i couldn’t bear to put them through what i did with my anxiety. In no means do i have the often stereotyped ‘sick body’ associated with anorexia but the thoughts and my behaviour patterns are very similar. For example, i can’t eat on monday, wednesday or thursday as i have dance those days and i am happy when i have to work saturday, sundays as it means i can eat less. I got insanely deep into calorie counting and running.\n\nThis has been going on for two years now and no one (that i know of) knows. Obviously my friends know about my past struggles with anxiety and eating but they all think im fine now.\n\nI am now 18 and have just been offered a place at my dream musical theatre uni. However, i am worried on how it will affect my eating. In a place that is so competitive, where i will have a lack of control of me and my future, i am worried that i will turn to my disorder to gain that comfort that it provides me with.\n\nI hope that there is someone else out there who has experienced the same thing to me and could help me to better understand why and how to cope :)",
      "created_utc": 1743968804.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlry03z",
      "author": "itsgivingraya",
      "body": "A look in the mirror.",
      "created_utc": 1743980315.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlsgx3a",
      "author": "lover_and_hater",
      "body": "I’m short. Everyone has always felt the need to comment on my body and my weight. Somehow that translated to me feeling the need to keep it that way. At 16 years old, the time when bodies are supposed to be changing and growing, I was doing everything I could to stay small. \n\nOf course, when some things with my family became out of my control food was what I held onto. The one thing I had power over. \n\nHere I am at 23 years old. I’ve been working on recovery for about four years. I am so much happier. It’s still hard. But I’m not afraid of gaining weight anymore. I just want to be healthy.",
      "created_utc": 1743987362.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlwpauu",
      "author": "rorythebookworm",
      "body": "Family..friends and society over all..People's standards are suffocating..But im not blaming anyone..my mind is just twisted..",
      "created_utc": 1744051891.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlztp1e",
      "author": "None",
      "body": "For me more so it was comparing a lot? Everything started at a young age to lose weight.ever since i was young i’ve always had a really thin friend whether it be different people i’d always be the bigger one despite my body and weight being considered average or healthy. (120lb and 5,0ft) This along with a lot of mental health issues made my ed. My anxiety about life just became an anxiety about my body,i hated photos because photos capture the self hatred i’ve made of myself. \n\nwanting to lose weight seemed so important to me? i would do so many things to lose weight and when nothing worked i resorted to purging and starving which was the only thing that seemed to work for me.\n\nThen when i was first diagnosed as a chronically i’ll person i lost a lot of weight,when people started to comment on how skinny and sick i looked i liked the feeling? i liked the feeling of looking sick and i guess it stuck with me to feel it again. I’m currently in attempts to recover because my weight is starting to play a issue with my chronically ill body though in all honesty it’s hard to eat again.",
      "created_utc": 1744094299.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mm81fpx",
      "author": "SquirrlyHex",
      "body": "I starve myself. Have for 14 years and only recently realized how fearful I’ve become of food. Recently I’ve discovered I withhold food when I’m experiencing emotional turmoil like as a punishment for being “bad” to my parents (there’s a lot of emotional neglect/abandonment there).\n\nThe reason I started was because even though I was an athlete and had a smaller appetite I was gaining weight like crazy. Obese sizes in late grade school and junior high. My doctor didn’t believe what I was eating, said “no kid of your age gains weight like this with what you’re eating”. For three years he was mean about my weight gain, calling me a liar, getting my parents to believe I was lying, and had my parents work hard on weight loss for me. None of it worked so I thought, screw it, no one believes me and I don’t like my body so I just won’t eat. I quit cold turkey and was good rather quickly at hiding and disposing of food.\n\nFound out in my early 20s I have severe insulin resistance and my levels of insulin were so high that my body was just storing fat. I’ve been losing weight ever since being on medicine to correct my insulin issue. Still have issues with food because of the insulin issues among other chronic illnesses but it’s something I’m trying really hard to work through.",
      "created_utc": 1744211160.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmb7gec",
      "author": "Medium_Conflict1633",
      "body": "Growing up in a Latin household and being called fat or “Gorda” my mom forcing me to eat all of my food , there are starving kids she would take away my beverage to ensure I ate all my food currently twenty four years old and have restricted eating disorder because of this. I have good days and bad days I see a dietitian every week I’m on a meal plan now but it’s very difficult",
      "created_utc": 1744246254.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmbejuv",
      "author": "annaprejsner",
      "body": "Stopped smoking. That made me less hungry combined with unmedicated anxiety from college classes and feeling bad about myself and my life. I could only control my life by working out excessively while obsessively watching what I ate which was not much.",
      "created_utc": 1744248762.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmbv4d8",
      "author": "Syn3sthesi4",
      "body": "My mom I suppose",
      "created_utc": 1744254811.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mmbv8wr",
      "author": "SympathySecret799",
      "body": "I went to the same college as my ex girlfriend who i had a very strange relationship with. we were still broken up at the time and had been for a while but we were friends with benefits for months over the summer and I felt like she was leading me on. I had (undiagnosed and untreated) BPD and it was a very toxic codependent type of favorite person relationship. I found out she was with someone else and I lost my mind. I didn't have any friends at this college and I didn't really know anyone other than her.\n\nNot only did I refuse to go to the dining hall because of social anxiety, but i refused to leave my dorm unless I absolutely had to. For the first week, all I ate was a gross bag of buggels chips my mom gave me. One day I lost all control and ate the rest of the bag in one sitting, not knowing this would spiral and last for years (the bag was bigger than a family sized bag lol). Anyway, so yeah. It's been about 2 years since then. I'm living at home and I'm in a very healthy and loving relationship but now I'm suffering the consequences of that bag of chips.\n\nRight before I started transitioning last Summer (I'm a trans man, but I presented very overly feminine before), I assumed that taking testosterone would make my curves even out and my chest would get smaller. I thought that I had been mistaking all of this for my gender dysphoria and that transitioning would help with my disordered eating. I began to eat normally again and put on about 15lbs in the span of 2-3 months. Then, I realized this was a completely separate issue. I lost that weight and then some. Now, my body has started fighting back for the severe restriction and I've fallen into binging and purging.\n\nThe b/p cycle still has me in a chokehold and I'm still not diagnosed with any kind of ED after losing about 40lbs. My doctors couldn't care less I guess.\n\nSorry that was a lot.. I hope this helps someone :)",
      "created_utc": 1744254862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n47386w",
      "author": "Ery_Meg2128",
      "body": "I am 23 years old and I am the mother of 3 year old Megan. I was abandoned by my dad when he left my mom (and my little sister). \nRaised with the support of social workers, after some tests my diagnosis was Borderline Personality Disorder. \nAfter abusing drugs (15/16 years old) and having experiences with boys who hurt me, I met a boy with whom I dated for 2 years, he was very thin due to a chest malformation, (I'll start by saying that I never liked myself physically so I never paid attention to the beauty of my boyfriends)... he had the bad habit of looking at other girls, coincidentally all of them very thin... I started training and eating healthier first, then less and less to train more and more. \nSometimes I ate and vomited but they weren't binges. \nI had just turned 18 and I reached 38kg, I asked for help from a hospital that treated DCA. In the meantime I'm leaving my boyfriend. \nHe One day, in the midst of my anorexia (30kg), my father called me telling me that he had married and was expecting a child. That evening I began to binge eat and entered Binge Eating. I left the hospital. I reached 60kg and got pregnant with a boy with whom I just wanted to have fun. At the beginning of the pregnancy I ate healthy and moved around a lot, in the last few months I had started to binge again and then vomit. \nI've been fasting during the day for 4 years and then in the evening I binge twice and then vomit everything.\nI can't eat anything anymore without throwing up. I'm afraid that my daughter might develop the same thing when she sees me...she's getting older now and is starting to understand...when I see other girls eating calmly it makes me feel bad because although I love my daughter infinitely, I can't use this love to finally love myself and get out of this terrible war with myself and food.",
      "created_utc": 1753031954.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlc8i9h",
      "author": "seems_legit56",
      "body": "Mom for pointing at my belly and calling me a pig. \n\nMy grandparents dying in their sleep because they had heart attacks. \n\nKids from elementary school-high school who would bully me for being big\n\nSocial media for basicly bullying bigger people and glorifying slim people. \n\nOld Disney/cartoons. The bad guys where almost always ugly and big while the protagonist were slim and fit. \n\nBody and gender dysmorphia. \n\nMirror's (rhat one was a joke) (sorta)",
      "created_utc": 1743752674.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mlc2ohw",
      "author": "hydraides",
      "body": "I love chocolate and ice cream",
      "created_utc": 1743749077.0,
      "score": -1,
      "context": []
    },
    {
      "id": "mlexn2z",
      "author": "GoldHorse8612",
      "body": "Similar. Child of the 80s with a mother who had disordered eating and withheld food from me because she didn't want me to be a \"fat kid.\"  There is a picture of me from 1st grade wearing a beautiful dress, but because of my minor scoliosis and arched back, my stomach is rounded and sticks out. I can still remember my mom yelling at me for how fat I looked. She was embarrassed of how I looked. I remember eating in secret as young as 5 because my mom restricted what I ate. No SA but negligent parenting and lots of mental health issues.",
      "created_utc": 1743790470.0,
      "score": 11,
      "context": [
        {
          "id": "mlbgfpc",
          "author": "MollilyPan",
          "body": "Well here we go…\n* The era I grew up in (eighties/nineties) \n* My mother’s weight obsession \n* How young and fast I went through puberty. (I’m still the same height I was at eleven.)\n* Childhood SA\n* Inherited tendencies towards mental illness\n* I danced for over three decades and the pressure to stay thin bc my body was always on display certainly didn’t help either.",
          "created_utc": 1743737944.0
        }
      ]
    },
    {
      "id": "mle3ud8",
      "author": "Aderi07",
      "body": "Thank you for sharing! \n\nHow do you navigate all of that now as an adult?",
      "created_utc": 1743781548.0,
      "score": 3,
      "context": [
        {
          "id": "mlbgfpc",
          "author": "MollilyPan",
          "body": "Well here we go…\n* The era I grew up in (eighties/nineties) \n* My mother’s weight obsession \n* How young and fast I went through puberty. (I’m still the same height I was at eleven.)\n* Childhood SA\n* Inherited tendencies towards mental illness\n* I danced for over three decades and the pressure to stay thin bc my body was always on display certainly didn’t help either.",
          "created_utc": 1743737944.0
        }
      ]
    },
    {
      "id": "mleiz53",
      "author": "batsignal050609",
      "body": "lmao it was actually instigated by my bsf",
      "created_utc": 1743786109.0,
      "score": 3,
      "context": [
        {
          "id": "mlbmi9p",
          "author": "etwichell",
          "body": "Someone said something to me",
          "created_utc": 1743740723.0
        }
      ]
    },
    {
      "id": "mle4ett",
      "author": "Aderi07",
      "body": "No, I appreciate the honesty! This could really help someone and maybe help you.",
      "created_utc": 1743781717.0,
      "score": 1,
      "context": [
        {
          "id": "mlbid4u",
          "author": "j_p96",
          "body": "I struggle with (what has morphed into) anorexia. It all started from getting comments growing up anytime I’d eat more than “normal”, like asking for another helping of food. Anytime I ate junk food, there were comments. \n\nThen I saw a photo of myself. I was not overweight, but I genuinely saw myself that way. I despised how I looked. I began dieting, hiding it, plus I was really young. I lost most of the weight I had, and have pretty much been struggling since. But I became extremely restrictive a few years ago, and is now full blown anorexia. \n\nThere used to be times where I was “better”, meaning simply maintaining a weight but not necessarily a healthy one. As long as I wasn’t actively losing — I took it as a win. Those times have now completely gone away. I lose some amount every month, and my doctor has stated that if this continues, they will have to implement hospitalization. Currently struggling badly but receiving outpatient treatment/therapy. \n\nIt’s very exhausting, frustrating and downright scary. Sorry for the long comment. Just being honest…",
          "created_utc": 1743738799.0
        }
      ]
    },
    {
      "id": "mle5c2e",
      "author": "Aderi07",
      "body": "The way others feel so comfortable commenting on another’s body is insane. Even though they think it’s a compliment. Thanks for sharing.",
      "created_utc": 1743781987.0,
      "score": 1,
      "context": [
        {
          "id": "mlbkine",
          "author": "JerkOffTaco",
          "body": "Losing a lot of weight after a life-saving transplant surgery.  I am receiving compliments on my new body I have never received before.  Now I am stuck in a guilt cycle of never wanting to look how I used to look again.  I’m sober now too so I care much more about my appearance.\n\nETA: My mother was a huge blow to my confidence during my childhood.  Millennial girls had it hard.",
          "created_utc": 1743739785.0
        }
      ]
    },
    {
      "id": "mle524s",
      "author": "Aderi07",
      "body": "Thanks for sharing. This is interesting because I usually hear the opposite, people unable to track everything.",
      "created_utc": 1743781905.0,
      "score": 1,
      "context": [
        {
          "id": "mlbkmup",
          "author": "No_Worldliness_4446",
          "body": "Started tracking food on a certain blue app with the intent of gaining weight in the form of muscle. Got addicted to the dopamine hits I received from seeing the calorie deficit get bigger and bigger while still getting close to my delusionally high protein goals. Then the protein part subsided and now it’s all about the size of the negative number. I somehow deluded myself into believing that I could subsist off of triple digit calories and that this was my “normal” just because I was able to function at a bare minimum level while eating like this. Then I started failing lifts and instead of seeing the real issue, I decided to abandon my goal of gaining muscle. The strange part is that it wasn’t really about how my body looked. Like yeah weight loss became part of the goal because I bought a scale and started weighing myself multiple times a day a few weeks after I started tracking, but I’m literally addicted to seeing that deficit get bigger and bigger on a fucking app. Tried deleting it, felt distress and just started writing it out in my notes app instead. I taught myself to use Microsoft excel to do the projected weight loss equation using the bmr/calories from exercise data from my Apple Watch and that was… probably one of the lowest points I’ve reached. I’m not even addicted to losing weight, apparently I’m addicted to doing fucking math. It’s ridiculous. I already have a preexisting autoimmune condition that caused chronic mono to damage my liver, so having a sufficient appetite was already difficult for me. And then my stupid ass just had to go and give myself a psychological reason to not eat as well. The worst part is as soon as I logged a single bite of an apple into the blue app that shant be named, my bf, mom, and everyone else warned me and I didn’t listen. Don’t count macros if you’re mentally unstable at all, kids.",
          "created_utc": 1743739840.0
        }
      ]
    },
    {
      "id": "mligs4s",
      "author": "Any_Seaweed9898",
      "body": "Your story sounds so so similar to what my sister (29) is currently going through. Obsessed with tracking, says she really enjoys the tracking part. I’ve not seen her numbers but she is dangerously underweight (drs are concerned and running tests).\n\nMy question is, what did / do you want from your loved ones when you’re going through this? How I can help and support, without enabling her behaviour? I’m trying to find the balance between expressing my concerns and not pushing her away. Any and all advice welcomed!!",
      "created_utc": 1743842235.0,
      "score": 1,
      "context": [
        {
          "id": "mlbkmup",
          "author": "No_Worldliness_4446",
          "body": "Started tracking food on a certain blue app with the intent of gaining weight in the form of muscle. Got addicted to the dopamine hits I received from seeing the calorie deficit get bigger and bigger while still getting close to my delusionally high protein goals. Then the protein part subsided and now it’s all about the size of the negative number. I somehow deluded myself into believing that I could subsist off of triple digit calories and that this was my “normal” just because I was able to function at a bare minimum level while eating like this. Then I started failing lifts and instead of seeing the real issue, I decided to abandon my goal of gaining muscle. The strange part is that it wasn’t really about how my body looked. Like yeah weight loss became part of the goal because I bought a scale and started weighing myself multiple times a day a few weeks after I started tracking, but I’m literally addicted to seeing that deficit get bigger and bigger on a fucking app. Tried deleting it, felt distress and just started writing it out in my notes app instead. I taught myself to use Microsoft excel to do the projected weight loss equation using the bmr/calories from exercise data from my Apple Watch and that was… probably one of the lowest points I’ve reached. I’m not even addicted to losing weight, apparently I’m addicted to doing fucking math. It’s ridiculous. I already have a preexisting autoimmune condition that caused chronic mono to damage my liver, so having a sufficient appetite was already difficult for me. And then my stupid ass just had to go and give myself a psychological reason to not eat as well. The worst part is as soon as I logged a single bite of an apple into the blue app that shant be named, my bf, mom, and everyone else warned me and I didn’t listen. Don’t count macros if you’re mentally unstable at all, kids.",
          "created_utc": 1743739840.0
        }
      ]
    },
    {
      "id": "mlcn7qo",
      "author": "Footsie_Galore",
      "body": "Me too.",
      "created_utc": 1743762058.0,
      "score": 3,
      "context": [
        {
          "id": "mlbhwmk",
          "author": "honalele",
          "body": "trauma from something unrelated to food, of which i will not be disclosing.",
          "created_utc": 1743738594.0
        }
      ]
    },
    {
      "id": "mlkphup",
      "author": "Best-Confidence-8352",
      "body": "Same here :(",
      "created_utc": 1743876366.0,
      "score": 2,
      "context": [
        {
          "id": "mlbhwmk",
          "author": "honalele",
          "body": "trauma from something unrelated to food, of which i will not be disclosing.",
          "created_utc": 1743738594.0
        }
      ]
    },
    {
      "id": "mle3xtz",
      "author": "Aderi07",
      "body": "If you don’t mind me asking, why food?",
      "created_utc": 1743781577.0,
      "score": 1,
      "context": [
        {
          "id": "mlbhwmk",
          "author": "honalele",
          "body": "trauma from something unrelated to food, of which i will not be disclosing.",
          "created_utc": 1743738594.0
        }
      ]
    },
    {
      "id": "mlkppr8",
      "author": "thisislikemytenthalt",
      "body": "Thank you for normalizing that it can be as simple as this that goes down a slippery slope",
      "created_utc": 1743876438.0,
      "score": 2,
      "context": [
        {
          "id": "mlbjmma",
          "author": "ranpowdereddonuts_",
          "body": "to sum it up, I just wanted to lose weight.",
          "created_utc": 1743739371.0
        }
      ]
    },
    {
      "id": "mle5jh9",
      "author": "Aderi07",
      "body": "So you know why you went to only liquids?",
      "created_utc": 1743782048.0,
      "score": 1,
      "context": [
        {
          "id": "mlbnb8n",
          "author": "RisingPhoenix603",
          "body": "I am 51 in 2021 my husband of 20 years walked out on me for no reason,no explanation went back to his parents basement where I found him 20 years earlier after his 2nd divorce. He was 52 when he left. That’s what started it for me. I stopped eating then only liquids. Now it’s almost 4 years later and nothing has changed. I’ll eat but very little. I also suffer from severe depression and SSI. So trauma did this to me.",
          "created_utc": 1743741108.0
        }
      ]
    },
    {
      "id": "mlkpqh8",
      "author": "Best-Confidence-8352",
      "body": "I've actually never heard of someone else say that before too but my health anxiety contributed to my ed also",
      "created_utc": 1743876445.0,
      "score": 2,
      "context": [
        {
          "id": "mlcc0u5",
          "author": "Putrid-Reaction-257",
          "body": "Health anxiety - thinking that i could have cancer or any tumor.\nStress",
          "created_utc": 1743754966.0
        }
      ]
    },
    {
      "id": "mle5tth",
      "author": "Aderi07",
      "body": "What do you think would help you,see you?",
      "created_utc": 1743782132.0,
      "score": 1,
      "context": [
        {
          "id": "mlbx3r8",
          "author": "DifferenceInitial962",
          "body": "My brother told me I was fat all the time, when I was severely underweight around 14/15 yrs old, already struggling with eating (not in an ed way) but from fears of food. Also non prescribed vyvance addiction really started my restricting behaviors and I got extremely addicted to the feeling of restriction and continued once I stopped taking the vyvance. So I think a combination of being called fat when I was in no way fat at all and the medication. It’s really warped my mind, the fat thing because once I heard it, I saw it and believed it and still don’t know what I look like to this day.",
          "created_utc": 1743746147.0
        }
      ]
    },
    {
      "id": "mldrubo",
      "author": "toynbee_tile",
      "body": "same here",
      "created_utc": 1743777978.0,
      "score": 2,
      "context": [
        {
          "id": "mlcrfk7",
          "author": "Low-Bit2048",
          "body": "Being the fat, ugly autistic kid nobody liked in school",
          "created_utc": 1743764334.0
        }
      ]
    },
    {
      "id": "mle6ago",
      "author": "Aderi07",
      "body": "Wow, thanks for answering. Do you know what triggered the swing from ow to uw?",
      "created_utc": 1743782269.0,
      "score": 2,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        }
      ]
    },
    {
      "id": "mlbriri",
      "author": "anastasia_42",
      "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
      "created_utc": 1743743149.0,
      "score": -6,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        }
      ]
    },
    {
      "id": "mlfph7c",
      "author": "Aderi07",
      "body": "I appreciate you sharing! Isn’t it crazy how “normal” it is to be told not to look for exterior validation. Don’t care what other people say or think, but it feels like it’s what is needed to get better. On the other hand if someone can make you better they can make you worse.",
      "created_utc": 1743799063.0,
      "score": 1,
      "context": [
        {
          "id": "mlc9oh4",
          "author": "drainuape",
          "body": "(Adding a TW for the vent at the bottom) \n\nSeeing my parents wrap their bodies in that stupid foil and constantly talk about dieting/ wanting to lose weight and talk negatively about their own bodies are some of my earliest memories. \nI started feeling insecure about my body in preschool because of the comments of my bullies.\n\nHowever the actual habits and ed behavior like starting to restrict and secretly work out in my room had only started when i was 14. when quarantine hit, it was my goal to go back to schools slimmer. I was still at a healthy bmi and weight though but the behaviour definitely got worse. \nThe girl i had been talking to at that time actually ended up being my gf and towards the end of our relationship my ed got worse, she was the first person to know and my first romantic relationship too. \nThen we broke up, i felt even more unlovable and couldnt get myself to eat properly, then i started to workout and go on walks to distract myself and ever since then, i can't get out. \n\n(Starting to vent)\n\nit's such a deep part of me now that i honestly can't imagine myself being recovering mentally. These thoughts are all i know since ive been 7. \nthe only times i'm aware that i'm doing better is when i feel loved by someone that isnt me, suddenly its easier to eat and everything. It seems impossible for me to lose the mindset alone.",
          "created_utc": 1743753429.0
        }
      ]
    },
    {
      "id": "mlih8fu",
      "author": "Any_Seaweed9898",
      "body": "I’m so sorry to read this, that must so difficult for you to experience from such a young age. \n\nI will say that you seem to be so aware that your mindset and eating habits are abnormal, and that for is many is the biggest step to recovery. I would really recommend, if you’re able to, to book yourself a doctors appt and express all of this to them. They will weigh you, take some bloods, maybe a scan if needed - but they will focus on the numbers and your mental health. I would really encourage you to do this. Wishing you the best of luck!",
      "created_utc": 1743842536.0,
      "score": 1,
      "context": [
        {
          "id": "mlc9oh4",
          "author": "drainuape",
          "body": "(Adding a TW for the vent at the bottom) \n\nSeeing my parents wrap their bodies in that stupid foil and constantly talk about dieting/ wanting to lose weight and talk negatively about their own bodies are some of my earliest memories. \nI started feeling insecure about my body in preschool because of the comments of my bullies.\n\nHowever the actual habits and ed behavior like starting to restrict and secretly work out in my room had only started when i was 14. when quarantine hit, it was my goal to go back to schools slimmer. I was still at a healthy bmi and weight though but the behaviour definitely got worse. \nThe girl i had been talking to at that time actually ended up being my gf and towards the end of our relationship my ed got worse, she was the first person to know and my first romantic relationship too. \nThen we broke up, i felt even more unlovable and couldnt get myself to eat properly, then i started to workout and go on walks to distract myself and ever since then, i can't get out. \n\n(Starting to vent)\n\nit's such a deep part of me now that i honestly can't imagine myself being recovering mentally. These thoughts are all i know since ive been 7. \nthe only times i'm aware that i'm doing better is when i feel loved by someone that isnt me, suddenly its easier to eat and everything. It seems impossible for me to lose the mindset alone.",
          "created_utc": 1743753429.0
        }
      ]
    },
    {
      "id": "mlfplxz",
      "author": "Aderi07",
      "body": "That’s f**cked up, sorry",
      "created_utc": 1743799104.0,
      "score": 2,
      "context": [
        {
          "id": "mlcvoyz",
          "author": "Glum_Measurement1746",
          "body": "in middle school someone sent me an anonymous message telling me i’d look better if i lost weight😭",
          "created_utc": 1743766367.0
        }
      ]
    },
    {
      "id": "mlij4rw",
      "author": "carrotcakexpress",
      "body": "I 100% relate to this",
      "created_utc": 1743843816.0,
      "score": 1,
      "context": [
        {
          "id": "mlcvs7x",
          "author": "Glum_Measurement1746",
          "body": "and all of my friends were like insanely skinny and i hated how i looked next to them in pictures",
          "created_utc": 1743766409.0
        }
      ]
    },
    {
      "id": "mlxjf9b",
      "author": "ARainbowHorse",
      "body": "Me too. It’s weird that it’s the only “contagious” mental illness.",
      "created_utc": 1744061309.0,
      "score": 1,
      "context": [
        {
          "id": "mlelfqe",
          "author": "Remote-Wear-2325",
          "body": "Used to have a close friend with an ED, she became obsessed with calories and then I did too.",
          "created_utc": 1743786852.0
        }
      ]
    },
    {
      "id": "mliew2a",
      "author": "angry_sarcastic_poet",
      "body": "Did she ever get help?",
      "created_utc": 1743840974.0,
      "score": 1,
      "context": [
        {
          "id": "mlepoae",
          "author": "throwawaybtwway",
          "body": "My mom was actively bulimic when I was a child and taught me how to be too. She didn’t see anything wrong with throwing up a meal, skipping two, and then throwing up again. She would call me fat. By the time I was in 7th grade I had an awful eating disorder. My dad was able to convince my mom that I needed help. ",
          "created_utc": 1743788102.0
        }
      ]
    },
    {
      "id": "mlexp8s",
      "author": "Crunchy-Basil",
      "body": "Oh and to clarify, since i was little i had dysmorphia but i have always been overweight. Based on bmi i have even been told i was obese by doctors and that doesnt exactly feel great",
      "created_utc": 1743790488.0,
      "score": 1,
      "context": [
        {
          "id": "mlexdh5",
          "author": "Crunchy-Basil",
          "body": "Mom was encouraged to put me on several types of diets by doctors as a kid, she always disparaged her weight and body even though I always thought she was beautiful, both kids and adults would always make fcked up comments about my body. That along with CSA made me develop a cycle of comparing my body to guys whose approval i craved, knowing full well it didn’t matter if i was thin, most of them didn’t even like dudes. Once one of my friends saw me in underwear and laughed at me outright at the same time that he was openly questioning his own same sex attraction it kinda broke me and i developed restrictive eating habits somewhere between anorexia and EDNOS i guess. Maybe more like bulimia since i did the whole restrict all day and binge at night, still lost an unhealthy amount of weight. Im still recovering almost 10 years later since both the binging and restriction never really left. There’s better and worse periods. Self love and compassion have done a lot and so has eating in an actual healthy way. Therapy too but realistically i need a lot more of that",
          "created_utc": 1743790390.0
        }
      ]
    },
    {
      "id": "mleyp23",
      "author": "Crunchy-Basil",
      "body": "I also have gender dysphoria but i think it’s related to my dysmorphia. It all kind of lumps together",
      "created_utc": 1743790795.0,
      "score": 1,
      "context": [
        {
          "id": "mlexdh5",
          "author": "Crunchy-Basil",
          "body": "Mom was encouraged to put me on several types of diets by doctors as a kid, she always disparaged her weight and body even though I always thought she was beautiful, both kids and adults would always make fcked up comments about my body. That along with CSA made me develop a cycle of comparing my body to guys whose approval i craved, knowing full well it didn’t matter if i was thin, most of them didn’t even like dudes. Once one of my friends saw me in underwear and laughed at me outright at the same time that he was openly questioning his own same sex attraction it kinda broke me and i developed restrictive eating habits somewhere between anorexia and EDNOS i guess. Maybe more like bulimia since i did the whole restrict all day and binge at night, still lost an unhealthy amount of weight. Im still recovering almost 10 years later since both the binging and restriction never really left. There’s better and worse periods. Self love and compassion have done a lot and so has eating in an actual healthy way. Therapy too but realistically i need a lot more of that",
          "created_utc": 1743790390.0
        }
      ]
    },
    {
      "id": "mlgcrxv",
      "author": "Rude_Interest97",
      "body": "🩷🩷",
      "created_utc": 1743806918.0,
      "score": 1,
      "context": [
        {
          "id": "mlf3ur2",
          "author": "nanaiko_",
          "body": "I wanted my mother's attention",
          "created_utc": 1743792372.0
        }
      ]
    },
    {
      "id": "mlg18xk",
      "author": "fireantsinmyhead",
      "body": "this was online too lmao so i feel fucking stupid for it but i was 14 and just wanted to be loved",
      "created_utc": 1743802859.0,
      "score": 2,
      "context": [
        {
          "id": "mlg0zgc",
          "author": "fireantsinmyhead",
          "body": "being fat shamed by my ex, my own friends, their friends, my ex’s friends, etc. it was like this massive group of people just dogging on me nonstop and i took it until i couldn’t anymore, i ended up losing the weight but like at what cost? yeah and now most of them feel guilty but it’s too late",
          "created_utc": 1743802772.0
        }
      ]
    },
    {
      "id": "mlkllqy",
      "author": "Aderi07",
      "body": "I’d like to read it, if it is there.",
      "created_utc": 1743875108.0,
      "score": 1,
      "context": [
        {
          "id": "mlg48d3",
          "author": "Atomic-Axolotl",
          "body": "I wrote a pretty big response, but I was probably doxxing myself if my parents were here, so had to delete it. OP can probably still see it in notifications though.",
          "created_utc": 1743803865.0
        }
      ]
    },
    {
      "id": "mlfnzcs",
      "author": "Aderi07",
      "body": "Thanks for sharing. It’s wild how such an innocent game can have life long effects.",
      "created_utc": 1743798601.0,
      "score": 1,
      "context": [
        {
          "id": "mlfitbd",
          "author": "GrandIntelligent9951",
          "body": "Mine started by learning what c4ls were at eleven. I had no idea what it was until then, and i looked on the back of my lunch and thought, hey, I’ve only had _ today! it became a game, and then it became a body thing over i learned that it affects your weight. ",
          "created_utc": 1743797017.0
        }
      ]
    },
    {
      "id": "mlf7a24",
      "author": "OtherwiseSetting7172",
      "body": "The way you tell that made me cry this poor little girl with scoliosis who just wants to feel beautiful in her dress",
      "created_utc": 1743793419.0,
      "score": 4,
      "context": [
        {
          "id": "mlbgfpc",
          "author": "MollilyPan",
          "body": "Well here we go…\n* The era I grew up in (eighties/nineties) \n* My mother’s weight obsession \n* How young and fast I went through puberty. (I’m still the same height I was at eleven.)\n* Childhood SA\n* Inherited tendencies towards mental illness\n* I danced for over three decades and the pressure to stay thin bc my body was always on display certainly didn’t help either.",
          "created_utc": 1743737944.0
        },
        {
          "id": "mlexn2z",
          "author": "GoldHorse8612",
          "body": "Similar. Child of the 80s with a mother who had disordered eating and withheld food from me because she didn't want me to be a \"fat kid.\"  There is a picture of me from 1st grade wearing a beautiful dress, but because of my minor scoliosis and arched back, my stomach is rounded and sticks out. I can still remember my mom yelling at me for how fat I looked. She was embarrassed of how I looked. I remember eating in secret as young as 5 because my mom restricted what I ate. No SA but negligent parenting and lots of mental health issues.",
          "created_utc": 1743790470.0
        }
      ]
    },
    {
      "id": "mlfgx5o",
      "author": "MollilyPan",
      "body": "Ugh. Breaks my heart for you!! \n\nMy mom was also worried I’d be fat. She had me dieting very young.  She also was very very strict with what we were allowed to eat. Vegetarian, only home baked goods for sugar, no good between meals except apples and water.  Had to eat what she made for dinner or nothing else for the rest of the day. \n\nI still struggle with meat. I eat very little of it.",
      "created_utc": 1743796444.0,
      "score": 3,
      "context": [
        {
          "id": "mlbgfpc",
          "author": "MollilyPan",
          "body": "Well here we go…\n* The era I grew up in (eighties/nineties) \n* My mother’s weight obsession \n* How young and fast I went through puberty. (I’m still the same height I was at eleven.)\n* Childhood SA\n* Inherited tendencies towards mental illness\n* I danced for over three decades and the pressure to stay thin bc my body was always on display certainly didn’t help either.",
          "created_utc": 1743737944.0
        },
        {
          "id": "mlexn2z",
          "author": "GoldHorse8612",
          "body": "Similar. Child of the 80s with a mother who had disordered eating and withheld food from me because she didn't want me to be a \"fat kid.\"  There is a picture of me from 1st grade wearing a beautiful dress, but because of my minor scoliosis and arched back, my stomach is rounded and sticks out. I can still remember my mom yelling at me for how fat I looked. She was embarrassed of how I looked. I remember eating in secret as young as 5 because my mom restricted what I ate. No SA but negligent parenting and lots of mental health issues.",
          "created_utc": 1743790470.0
        }
      ]
    },
    {
      "id": "mmbxo38",
      "author": "SympathySecret799",
      "body": "This absolutely breaks my heart. I'm so sorry. You just wanted to feel pretty :(. I can't imagine how a parent could be embarrassed of their child with something as small as scoliosis. Not that scoliosis is insignificant, but I mean being embarrassed if your child has some uncontrollable behavioral issue or something I could maybe understand that. But scoliosis is absolutely NO reason for her to feel that way, much less to restrict your food intake. You were just a little kid, you needed food to grow :( And having that is completely out of your control!!",
      "created_utc": 1744255879.0,
      "score": 1,
      "context": [
        {
          "id": "mlbgfpc",
          "author": "MollilyPan",
          "body": "Well here we go…\n* The era I grew up in (eighties/nineties) \n* My mother’s weight obsession \n* How young and fast I went through puberty. (I’m still the same height I was at eleven.)\n* Childhood SA\n* Inherited tendencies towards mental illness\n* I danced for over three decades and the pressure to stay thin bc my body was always on display certainly didn’t help either.",
          "created_utc": 1743737944.0
        },
        {
          "id": "mlexn2z",
          "author": "GoldHorse8612",
          "body": "Similar. Child of the 80s with a mother who had disordered eating and withheld food from me because she didn't want me to be a \"fat kid.\"  There is a picture of me from 1st grade wearing a beautiful dress, but because of my minor scoliosis and arched back, my stomach is rounded and sticks out. I can still remember my mom yelling at me for how fat I looked. She was embarrassed of how I looked. I remember eating in secret as young as 5 because my mom restricted what I ate. No SA but negligent parenting and lots of mental health issues.",
          "created_utc": 1743790470.0
        }
      ]
    },
    {
      "id": "mlfiqrx",
      "author": "MollilyPan",
      "body": "I guess I navigate it better than I used to.  When I’m in “remission” I do pretty well.  I’m never great about eating healthy. So remission for me is generally me eating mostly crap.  Not great either.  Keeps my weight out of the gutter, tho. \n\nI have a lot of intolerances that make me really sick.  Those restrictions are all I can handle when I’m doing well.  I try to just block out other good noise.  I’ve gotten pretty good at it. \n\nI don’t dance anymore so that helps somewhat.  My weight without me restricting is not bad for my age so I just try to tell myself that. lol",
      "created_utc": 1743796996.0,
      "score": 2,
      "context": [
        {
          "id": "mlbgfpc",
          "author": "MollilyPan",
          "body": "Well here we go…\n* The era I grew up in (eighties/nineties) \n* My mother’s weight obsession \n* How young and fast I went through puberty. (I’m still the same height I was at eleven.)\n* Childhood SA\n* Inherited tendencies towards mental illness\n* I danced for over three decades and the pressure to stay thin bc my body was always on display certainly didn’t help either.",
          "created_utc": 1743737944.0
        },
        {
          "id": "mle3ud8",
          "author": "Aderi07",
          "body": "Thank you for sharing! \n\nHow do you navigate all of that now as an adult?",
          "created_utc": 1743781548.0
        }
      ]
    },
    {
      "id": "mlhi6dr",
      "author": "j_p96",
      "body": "I sincerely hope so :)",
      "created_utc": 1743823126.0,
      "score": 1,
      "context": [
        {
          "id": "mlbid4u",
          "author": "j_p96",
          "body": "I struggle with (what has morphed into) anorexia. It all started from getting comments growing up anytime I’d eat more than “normal”, like asking for another helping of food. Anytime I ate junk food, there were comments. \n\nThen I saw a photo of myself. I was not overweight, but I genuinely saw myself that way. I despised how I looked. I began dieting, hiding it, plus I was really young. I lost most of the weight I had, and have pretty much been struggling since. But I became extremely restrictive a few years ago, and is now full blown anorexia. \n\nThere used to be times where I was “better”, meaning simply maintaining a weight but not necessarily a healthy one. As long as I wasn’t actively losing — I took it as a win. Those times have now completely gone away. I lose some amount every month, and my doctor has stated that if this continues, they will have to implement hospitalization. Currently struggling badly but receiving outpatient treatment/therapy. \n\nIt’s very exhausting, frustrating and downright scary. Sorry for the long comment. Just being honest…",
          "created_utc": 1743738799.0
        },
        {
          "id": "mle4ett",
          "author": "Aderi07",
          "body": "No, I appreciate the honesty! This could really help someone and maybe help you.",
          "created_utc": 1743781717.0
        }
      ]
    },
    {
      "id": "mleuije",
      "author": "No_Worldliness_4446",
      "body": "I have a deadly combo of autism and ocd and I think I developed a special interest in fitness which devolved rapidly into competing with myself, in terms of seeing how low I can go with my calories. Then the OCD noise started challenging me and as soon as I realized that days in which I ate more than triple digit calories, despite still being in a significant deficit, felt “wasted,” I knew that I had an issue",
      "created_utc": 1743789531.0,
      "score": 3,
      "context": [
        {
          "id": "mlbkmup",
          "author": "No_Worldliness_4446",
          "body": "Started tracking food on a certain blue app with the intent of gaining weight in the form of muscle. Got addicted to the dopamine hits I received from seeing the calorie deficit get bigger and bigger while still getting close to my delusionally high protein goals. Then the protein part subsided and now it’s all about the size of the negative number. I somehow deluded myself into believing that I could subsist off of triple digit calories and that this was my “normal” just because I was able to function at a bare minimum level while eating like this. Then I started failing lifts and instead of seeing the real issue, I decided to abandon my goal of gaining muscle. The strange part is that it wasn’t really about how my body looked. Like yeah weight loss became part of the goal because I bought a scale and started weighing myself multiple times a day a few weeks after I started tracking, but I’m literally addicted to seeing that deficit get bigger and bigger on a fucking app. Tried deleting it, felt distress and just started writing it out in my notes app instead. I taught myself to use Microsoft excel to do the projected weight loss equation using the bmr/calories from exercise data from my Apple Watch and that was… probably one of the lowest points I’ve reached. I’m not even addicted to losing weight, apparently I’m addicted to doing fucking math. It’s ridiculous. I already have a preexisting autoimmune condition that caused chronic mono to damage my liver, so having a sufficient appetite was already difficult for me. And then my stupid ass just had to go and give myself a psychological reason to not eat as well. The worst part is as soon as I logged a single bite of an apple into the blue app that shant be named, my bf, mom, and everyone else warned me and I didn’t listen. Don’t count macros if you’re mentally unstable at all, kids.",
          "created_utc": 1743739840.0
        },
        {
          "id": "mle524s",
          "author": "Aderi07",
          "body": "Thanks for sharing. This is interesting because I usually hear the opposite, people unable to track everything.",
          "created_utc": 1743781905.0
        }
      ]
    },
    {
      "id": "mlizfyj",
      "author": "No_Worldliness_4446",
      "body": "The tough part is, I don’t really know what I want from people. So my problem has been that despite losing a dangerous amount of weight in a really short amount of time, I’m still not technically underweight because I was pretty decently muscled beforehand. My parents subscribed to the toxic diet culture of the 90s and every time I show up skinnier they tell me how good I look and ask me how I’m losing so much weight. Your sister doesn’t rlly have to worry about you doing that, since you’re here trying to do research for it. I’d say the way my boyfriend handles it is much better. I don’t do this on purpose but admittedly sometimes I’ll tell him “I’ve lost x amount of weight since x date” because sometimes I do feel proud of it, and sometimes I’ll ask him if he can tell that I’ve lost weight. I think that’s what people mean when they say that EDs “feed themselves.” His response is usually like “ok. That’s not a healthy amount to lose. Anyways-“ and we don’t dwell on it, since he knows that there’s not much he can say to stop it and he knows when to intervene in a medical sense. But also, since he knows I’m obsessed with tracking, he doesn’t ask me to stop but instead to send screenshots of my calorie count to him every day. Sometimes the fact that I know he’s going to see it is enough to get me to eat a little more than usual, and since I’m obsessed with measuring and tracking, I don’t ever lie about what I’ve eaten today on the app. He’s taken a “body neutral” stance to the whole thing, and he’ll still tell me I’m pretty, but has avoided any weight-based comments since this started. This approach may be a little invasive depending on how close you are to your sister, but the way he’s handling it has been the most helpful to me thus far.",
      "created_utc": 1743853871.0,
      "score": 2,
      "context": [
        {
          "id": "mlbkmup",
          "author": "No_Worldliness_4446",
          "body": "Started tracking food on a certain blue app with the intent of gaining weight in the form of muscle. Got addicted to the dopamine hits I received from seeing the calorie deficit get bigger and bigger while still getting close to my delusionally high protein goals. Then the protein part subsided and now it’s all about the size of the negative number. I somehow deluded myself into believing that I could subsist off of triple digit calories and that this was my “normal” just because I was able to function at a bare minimum level while eating like this. Then I started failing lifts and instead of seeing the real issue, I decided to abandon my goal of gaining muscle. The strange part is that it wasn’t really about how my body looked. Like yeah weight loss became part of the goal because I bought a scale and started weighing myself multiple times a day a few weeks after I started tracking, but I’m literally addicted to seeing that deficit get bigger and bigger on a fucking app. Tried deleting it, felt distress and just started writing it out in my notes app instead. I taught myself to use Microsoft excel to do the projected weight loss equation using the bmr/calories from exercise data from my Apple Watch and that was… probably one of the lowest points I’ve reached. I’m not even addicted to losing weight, apparently I’m addicted to doing fucking math. It’s ridiculous. I already have a preexisting autoimmune condition that caused chronic mono to damage my liver, so having a sufficient appetite was already difficult for me. And then my stupid ass just had to go and give myself a psychological reason to not eat as well. The worst part is as soon as I logged a single bite of an apple into the blue app that shant be named, my bf, mom, and everyone else warned me and I didn’t listen. Don’t count macros if you’re mentally unstable at all, kids.",
          "created_utc": 1743739840.0
        },
        {
          "id": "mligs4s",
          "author": "Any_Seaweed9898",
          "body": "Your story sounds so so similar to what my sister (29) is currently going through. Obsessed with tracking, says she really enjoys the tracking part. I’ve not seen her numbers but she is dangerously underweight (drs are concerned and running tests).\n\nMy question is, what did / do you want from your loved ones when you’re going through this? How I can help and support, without enabling her behaviour? I’m trying to find the balance between expressing my concerns and not pushing her away. Any and all advice welcomed!!",
          "created_utc": 1743842235.0
        }
      ]
    },
    {
      "id": "mlek3oy",
      "author": "honalele",
      "body": "eating became an intimate and secret thing that i could control i guess.",
      "created_utc": 1743786448.0,
      "score": 12,
      "context": [
        {
          "id": "mlbhwmk",
          "author": "honalele",
          "body": "trauma from something unrelated to food, of which i will not be disclosing.",
          "created_utc": 1743738594.0
        },
        {
          "id": "mle3xtz",
          "author": "Aderi07",
          "body": "If you don’t mind me asking, why food?",
          "created_utc": 1743781577.0
        }
      ]
    },
    {
      "id": "mlusvgw",
      "author": "ranpowdereddonuts_",
      "body": "♡",
      "created_utc": 1744030234.0,
      "score": 1,
      "context": [
        {
          "id": "mlbjmma",
          "author": "ranpowdereddonuts_",
          "body": "to sum it up, I just wanted to lose weight.",
          "created_utc": 1743739371.0
        },
        {
          "id": "mlkppr8",
          "author": "thisislikemytenthalt",
          "body": "Thank you for normalizing that it can be as simple as this that goes down a slippery slope",
          "created_utc": 1743876438.0
        }
      ]
    },
    {
      "id": "mlectwc",
      "author": "RisingPhoenix603",
      "body": "I guess I don’t understand what you mean.",
      "created_utc": 1743784258.0,
      "score": 1,
      "context": [
        {
          "id": "mlbnb8n",
          "author": "RisingPhoenix603",
          "body": "I am 51 in 2021 my husband of 20 years walked out on me for no reason,no explanation went back to his parents basement where I found him 20 years earlier after his 2nd divorce. He was 52 when he left. That’s what started it for me. I stopped eating then only liquids. Now it’s almost 4 years later and nothing has changed. I’ll eat but very little. I also suffer from severe depression and SSI. So trauma did this to me.",
          "created_utc": 1743741108.0
        },
        {
          "id": "mle5jh9",
          "author": "Aderi07",
          "body": "So you know why you went to only liquids?",
          "created_utc": 1743782048.0
        }
      ]
    },
    {
      "id": "mlkucip",
      "author": "Putrid-Reaction-257",
      "body": "I got jojo effect gain a lot of weight",
      "created_utc": 1743877981.0,
      "score": 1,
      "context": [
        {
          "id": "mlcc0u5",
          "author": "Putrid-Reaction-257",
          "body": "Health anxiety - thinking that i could have cancer or any tumor.\nStress",
          "created_utc": 1743754966.0
        },
        {
          "id": "mlkpqh8",
          "author": "Best-Confidence-8352",
          "body": "I've actually never heard of someone else say that before too but my health anxiety contributed to my ed also",
          "created_utc": 1743876445.0
        }
      ]
    },
    {
      "id": "mle6re0",
      "author": "DifferenceInitial962",
      "body": "I’m not really sure. I’ve read for some people that your brain only remembers seeing the “healthiest version of yourself” so the sickness is basically invisible to your eye",
      "created_utc": 1743782410.0,
      "score": 1,
      "context": [
        {
          "id": "mlbx3r8",
          "author": "DifferenceInitial962",
          "body": "My brother told me I was fat all the time, when I was severely underweight around 14/15 yrs old, already struggling with eating (not in an ed way) but from fears of food. Also non prescribed vyvance addiction really started my restricting behaviors and I got extremely addicted to the feeling of restriction and continued once I stopped taking the vyvance. So I think a combination of being called fat when I was in no way fat at all and the medication. It’s really warped my mind, the fat thing because once I heard it, I saw it and believed it and still don’t know what I look like to this day.",
          "created_utc": 1743746147.0
        },
        {
          "id": "mle5tth",
          "author": "Aderi07",
          "body": "What do you think would help you,see you?",
          "created_utc": 1743782132.0
        }
      ]
    },
    {
      "id": "mlg7obo",
      "author": "alienprincess111",
      "body": "I was ow and needed to lose weight.  I started normally enough by learning about nutrition and calories. But then when I started restricting I could not stop. I became addicted to it.",
      "created_utc": 1743805071.0,
      "score": 1,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mle6ago",
          "author": "Aderi07",
          "body": "Wow, thanks for answering. Do you know what triggered the swing from ow to uw?",
          "created_utc": 1743782269.0
        }
      ]
    },
    {
      "id": "mlbsny7",
      "author": "alienprincess111",
      "body": "Have you heard of arfid?  It's an ED that looks like picky eating but is more than that.",
      "created_utc": 1743743744.0,
      "score": 6,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mlbriri",
          "author": "anastasia_42",
          "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
          "created_utc": 1743743149.0
        }
      ]
    },
    {
      "id": "mlixe8b",
      "author": "throwawaybtwway",
      "body": "No, it got better when she went on an anxiety med. But, even in her 50’s she is still diet obsessed.,",
      "created_utc": 1743852803.0,
      "score": 1,
      "context": [
        {
          "id": "mlepoae",
          "author": "throwawaybtwway",
          "body": "My mom was actively bulimic when I was a child and taught me how to be too. She didn’t see anything wrong with throwing up a meal, skipping two, and then throwing up again. She would call me fat. By the time I was in 7th grade I had an awful eating disorder. My dad was able to convince my mom that I needed help. ",
          "created_utc": 1743788102.0
        },
        {
          "id": "mliew2a",
          "author": "angry_sarcastic_poet",
          "body": "Did she ever get help?",
          "created_utc": 1743840974.0
        }
      ]
    },
    {
      "id": "mlj3vjf",
      "author": "Any_Seaweed9898",
      "body": "This is really helpful, thank you! I’m trying not to raise it / show my upset because I know that won’t help anything and will push her away, so compliments on her hair / outfit / makeup etc will be the way forward, and only commenting on her weight when she asks. \n\nI really like the idea of seeing daily screenshots of the tracking, but I don’t think she would be open to it, and selfishly I know I’d find it so upsetting to see how little she consumes. \n\nIt sounds like you have a lovely relationship with your partner",
      "created_utc": 1743856021.0,
      "score": 1,
      "context": [
        {
          "id": "mlbkmup",
          "author": "No_Worldliness_4446",
          "body": "Started tracking food on a certain blue app with the intent of gaining weight in the form of muscle. Got addicted to the dopamine hits I received from seeing the calorie deficit get bigger and bigger while still getting close to my delusionally high protein goals. Then the protein part subsided and now it’s all about the size of the negative number. I somehow deluded myself into believing that I could subsist off of triple digit calories and that this was my “normal” just because I was able to function at a bare minimum level while eating like this. Then I started failing lifts and instead of seeing the real issue, I decided to abandon my goal of gaining muscle. The strange part is that it wasn’t really about how my body looked. Like yeah weight loss became part of the goal because I bought a scale and started weighing myself multiple times a day a few weeks after I started tracking, but I’m literally addicted to seeing that deficit get bigger and bigger on a fucking app. Tried deleting it, felt distress and just started writing it out in my notes app instead. I taught myself to use Microsoft excel to do the projected weight loss equation using the bmr/calories from exercise data from my Apple Watch and that was… probably one of the lowest points I’ve reached. I’m not even addicted to losing weight, apparently I’m addicted to doing fucking math. It’s ridiculous. I already have a preexisting autoimmune condition that caused chronic mono to damage my liver, so having a sufficient appetite was already difficult for me. And then my stupid ass just had to go and give myself a psychological reason to not eat as well. The worst part is as soon as I logged a single bite of an apple into the blue app that shant be named, my bf, mom, and everyone else warned me and I didn’t listen. Don’t count macros if you’re mentally unstable at all, kids.",
          "created_utc": 1743739840.0
        },
        {
          "id": "mligs4s",
          "author": "Any_Seaweed9898",
          "body": "Your story sounds so so similar to what my sister (29) is currently going through. Obsessed with tracking, says she really enjoys the tracking part. I’ve not seen her numbers but she is dangerously underweight (drs are concerned and running tests).\n\nMy question is, what did / do you want from your loved ones when you’re going through this? How I can help and support, without enabling her behaviour? I’m trying to find the balance between expressing my concerns and not pushing her away. Any and all advice welcomed!!",
          "created_utc": 1743842235.0
        },
        {
          "id": "mlizfyj",
          "author": "No_Worldliness_4446",
          "body": "The tough part is, I don’t really know what I want from people. So my problem has been that despite losing a dangerous amount of weight in a really short amount of time, I’m still not technically underweight because I was pretty decently muscled beforehand. My parents subscribed to the toxic diet culture of the 90s and every time I show up skinnier they tell me how good I look and ask me how I’m losing so much weight. Your sister doesn’t rlly have to worry about you doing that, since you’re here trying to do research for it. I’d say the way my boyfriend handles it is much better. I don’t do this on purpose but admittedly sometimes I’ll tell him “I’ve lost x amount of weight since x date” because sometimes I do feel proud of it, and sometimes I’ll ask him if he can tell that I’ve lost weight. I think that’s what people mean when they say that EDs “feed themselves.” His response is usually like “ok. That’s not a healthy amount to lose. Anyways-“ and we don’t dwell on it, since he knows that there’s not much he can say to stop it and he knows when to intervene in a medical sense. But also, since he knows I’m obsessed with tracking, he doesn’t ask me to stop but instead to send screenshots of my calorie count to him every day. Sometimes the fact that I know he’s going to see it is enough to get me to eat a little more than usual, and since I’m obsessed with measuring and tracking, I don’t ever lie about what I’ve eaten today on the app. He’s taken a “body neutral” stance to the whole thing, and he’ll still tell me I’m pretty, but has avoided any weight-based comments since this started. This approach may be a little invasive depending on how close you are to your sister, but the way he’s handling it has been the most helpful to me thus far.",
          "created_utc": 1743853871.0
        }
      ]
    },
    {
      "id": "mled361",
      "author": "Aderi07",
      "body": "You stopped eating and went to only liquids. Do you know why liquids only?",
      "created_utc": 1743784338.0,
      "score": 1,
      "context": [
        {
          "id": "mlbnb8n",
          "author": "RisingPhoenix603",
          "body": "I am 51 in 2021 my husband of 20 years walked out on me for no reason,no explanation went back to his parents basement where I found him 20 years earlier after his 2nd divorce. He was 52 when he left. That’s what started it for me. I stopped eating then only liquids. Now it’s almost 4 years later and nothing has changed. I’ll eat but very little. I also suffer from severe depression and SSI. So trauma did this to me.",
          "created_utc": 1743741108.0
        },
        {
          "id": "mle5jh9",
          "author": "Aderi07",
          "body": "So you know why you went to only liquids?",
          "created_utc": 1743782048.0
        },
        {
          "id": "mlectwc",
          "author": "RisingPhoenix603",
          "body": "I guess I don’t understand what you mean.",
          "created_utc": 1743784258.0
        }
      ]
    },
    {
      "id": "mlc1ldd",
      "author": "anastasia_42",
      "body": "I haven't actually, could you tell me about it to me please?",
      "created_utc": 1743748485.0,
      "score": -1,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mlbriri",
          "author": "anastasia_42",
          "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
          "created_utc": 1743743149.0
        },
        {
          "id": "mlbsny7",
          "author": "alienprincess111",
          "body": "Have you heard of arfid?  It's an ED that looks like picky eating but is more than that.",
          "created_utc": 1743743744.0
        }
      ]
    },
    {
      "id": "mlc1ljc",
      "author": "anastasia_42",
      "body": "I haven't actually, could you tell me about it to me please?",
      "created_utc": 1743748487.0,
      "score": -1,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mlbriri",
          "author": "anastasia_42",
          "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
          "created_utc": 1743743149.0
        },
        {
          "id": "mlbsny7",
          "author": "alienprincess111",
          "body": "Have you heard of arfid?  It's an ED that looks like picky eating but is more than that.",
          "created_utc": 1743743744.0
        }
      ]
    },
    {
      "id": "mlee95s",
      "author": "RisingPhoenix603",
      "body": "Because. I was kinda forced to do it. I lost so much weight when I stopped eating that I never ever want to go back and liquids and what very little vegetables I eat is a way to control something in my life. Today I had my 18th ECT treatment. For the depression and the eating disorder. It helps for the depression but nothing will ever fix the eating disorder. It’s who I am now. So the liquids because the doctors are forcing me either I comply or they are going to commit me.",
      "created_utc": 1743784694.0,
      "score": 0,
      "context": [
        {
          "id": "mlbnb8n",
          "author": "RisingPhoenix603",
          "body": "I am 51 in 2021 my husband of 20 years walked out on me for no reason,no explanation went back to his parents basement where I found him 20 years earlier after his 2nd divorce. He was 52 when he left. That’s what started it for me. I stopped eating then only liquids. Now it’s almost 4 years later and nothing has changed. I’ll eat but very little. I also suffer from severe depression and SSI. So trauma did this to me.",
          "created_utc": 1743741108.0
        },
        {
          "id": "mle5jh9",
          "author": "Aderi07",
          "body": "So you know why you went to only liquids?",
          "created_utc": 1743782048.0
        },
        {
          "id": "mlectwc",
          "author": "RisingPhoenix603",
          "body": "I guess I don’t understand what you mean.",
          "created_utc": 1743784258.0
        },
        {
          "id": "mled361",
          "author": "Aderi07",
          "body": "You stopped eating and went to only liquids. Do you know why liquids only?",
          "created_utc": 1743784338.0
        }
      ]
    },
    {
      "id": "mlcol25",
      "author": "rusticterror",
      "body": "I’d advise you use the myriad resources available to you and look it up.",
      "created_utc": 1743762833.0,
      "score": 4,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mlbriri",
          "author": "anastasia_42",
          "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
          "created_utc": 1743743149.0
        },
        {
          "id": "mlbsny7",
          "author": "alienprincess111",
          "body": "Have you heard of arfid?  It's an ED that looks like picky eating but is more than that.",
          "created_utc": 1743743744.0
        },
        {
          "id": "mlc1ldd",
          "author": "anastasia_42",
          "body": "I haven't actually, could you tell me about it to me please?",
          "created_utc": 1743748485.0
        }
      ]
    },
    {
      "id": "mlkpv8v",
      "author": "thisislikemytenthalt",
      "body": "Google is free",
      "created_utc": 1743876488.0,
      "score": 1,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mlbriri",
          "author": "anastasia_42",
          "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
          "created_utc": 1743743149.0
        },
        {
          "id": "mlbsny7",
          "author": "alienprincess111",
          "body": "Have you heard of arfid?  It's an ED that looks like picky eating but is more than that.",
          "created_utc": 1743743744.0
        },
        {
          "id": "mlc1ldd",
          "author": "anastasia_42",
          "body": "I haven't actually, could you tell me about it to me please?",
          "created_utc": 1743748485.0
        }
      ]
    },
    {
      "id": "mld6e17",
      "author": "anastasia_42",
      "body": "I would actually like to learn about it from this person who has (implied) had it, thank you",
      "created_utc": 1743770817.0,
      "score": -4,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mlbriri",
          "author": "anastasia_42",
          "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
          "created_utc": 1743743149.0
        },
        {
          "id": "mlbsny7",
          "author": "alienprincess111",
          "body": "Have you heard of arfid?  It's an ED that looks like picky eating but is more than that.",
          "created_utc": 1743743744.0
        },
        {
          "id": "mlc1ldd",
          "author": "anastasia_42",
          "body": "I haven't actually, could you tell me about it to me please?",
          "created_utc": 1743748485.0
        },
        {
          "id": "mlcol25",
          "author": "rusticterror",
          "body": "I’d advise you use the myriad resources available to you and look it up.",
          "created_utc": 1743762833.0
        }
      ]
    },
    {
      "id": "mpzg7vh",
      "author": "anastasia_42",
      "body": "Yeah but so is an answer from you lol",
      "created_utc": 1746086268.0,
      "score": 1,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mlbriri",
          "author": "anastasia_42",
          "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
          "created_utc": 1743743149.0
        },
        {
          "id": "mlbsny7",
          "author": "alienprincess111",
          "body": "Have you heard of arfid?  It's an ED that looks like picky eating but is more than that.",
          "created_utc": 1743743744.0
        },
        {
          "id": "mlc1ldd",
          "author": "anastasia_42",
          "body": "I haven't actually, could you tell me about it to me please?",
          "created_utc": 1743748485.0
        },
        {
          "id": "mlkpv8v",
          "author": "thisislikemytenthalt",
          "body": "Google is free",
          "created_utc": 1743876488.0
        }
      ]
    },
    {
      "id": "mlhinee",
      "author": "rusticterror",
      "body": "As someone who also has ARFID, it isn’t our responsibility to educate you. 🤷🏻 Cool it with the passive aggression.",
      "created_utc": 1743823341.0,
      "score": 1,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mlbriri",
          "author": "anastasia_42",
          "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
          "created_utc": 1743743149.0
        },
        {
          "id": "mlbsny7",
          "author": "alienprincess111",
          "body": "Have you heard of arfid?  It's an ED that looks like picky eating but is more than that.",
          "created_utc": 1743743744.0
        },
        {
          "id": "mlc1ldd",
          "author": "anastasia_42",
          "body": "I haven't actually, could you tell me about it to me please?",
          "created_utc": 1743748485.0
        },
        {
          "id": "mlcol25",
          "author": "rusticterror",
          "body": "I’d advise you use the myriad resources available to you and look it up.",
          "created_utc": 1743762833.0
        },
        {
          "id": "mld6e17",
          "author": "anastasia_42",
          "body": "I would actually like to learn about it from this person who has (implied) had it, thank you",
          "created_utc": 1743770817.0
        }
      ]
    },
    {
      "id": "mpzg9o2",
      "author": "anastasia_42",
      "body": "I'm matching your tone",
      "created_utc": 1746086300.0,
      "score": 1,
      "context": [
        {
          "id": "mlbahy5",
          "author": "alienprincess111",
          "body": "I'm 40f and have had disordered eating my whole life.  I believe I had/have arfid since I was a toddler. As a kid I would only eat a fixed set of \"neutral\" foods prepared by my mom, and would refuse to try new things.  When I was going through puberty at age 13, I gained a lot of weight and became ow. I started learning about calories and nutrition, and took it too far basically, as I became addicted to restricting.  So I developed anorexia.  I never got treatment for it because my mother didn't believe in it but I was forced to \"recover\" which led to going from severely uw to obese in about 1.5 years.  I had about 4 normal years in high school/college but relapsed with anorexia eventually.  I have controlled food and exercise for my whole adult life. I was normal weight for most of it, but have had some relapses where I became uw, like now.",
          "created_utc": 1743735442.0
        },
        {
          "id": "mlbriri",
          "author": "anastasia_42",
          "body": "That first part does not sound like disordered eating it just sounds like being picky eating",
          "created_utc": 1743743149.0
        },
        {
          "id": "mlbsny7",
          "author": "alienprincess111",
          "body": "Have you heard of arfid?  It's an ED that looks like picky eating but is more than that.",
          "created_utc": 1743743744.0
        },
        {
          "id": "mlc1ldd",
          "author": "anastasia_42",
          "body": "I haven't actually, could you tell me about it to me please?",
          "created_utc": 1743748485.0
        },
        {
          "id": "mlcol25",
          "author": "rusticterror",
          "body": "I’d advise you use the myriad resources available to you and look it up.",
          "created_utc": 1743762833.0
        },
        {
          "id": "mld6e17",
          "author": "anastasia_42",
          "body": "I would actually like to learn about it from this person who has (implied) had it, thank you",
          "created_utc": 1743770817.0
        },
        {
          "id": "mlhinee",
          "author": "rusticterror",
          "body": "As someone who also has ARFID, it isn’t our responsibility to educate you. 🤷🏻 Cool it with the passive aggression.",
          "created_utc": 1743823341.0
        }
      ]
    }
  ]
}