{
  "id": "1k04k6e",
  "subreddit": "EatingDisorders",
  "author": "gstoabn",
  "created_utc": 1744754988.0,
  "title": "Concerned for a stranger",
  "selftext": "In my Gym there is this woman, who is at the gym 24/7, no matter when i go there, she’s always there. Both my Roommate and I have noticed her getting thinner and thinner, her hair thinning and just her looking unwell in general. There are several signs for an ED (specifically anorexia). For example she always wears multiple pullovers and sweaters layered even if it’s warm outside (inside the gym it’s always warm but she still wears 2 or more pullovers) And she always does cardio only or rather, just stands on the treadmill looking exhausted and only drinks diet soda and coffee. We are really concerned about her wellbeing and aren’t quite sure of what to do. A bit advice would be really appreciated \nthank u ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1k04k6e/concerned_for_a_stranger/",
  "score": 54,
  "num_comments": 21,
  "comments": [
    {
      "id": "mnbvqca",
      "author": "MoulinSarah",
      "body": "I would just befriend her in a genuine way. She’s probably so lonely.",
      "created_utc": 1744763821.0,
      "score": 77,
      "context": []
    },
    {
      "id": "mnbug4e",
      "author": "Odd_Curve6621",
      "body": "Yeah, she’s likely pretty isolated, if she has an ED. The ED wants you to be isolated. I would say the approach would be to just try to be friendly, and maybe strike up a friendship. Even just a gym friendship. It might help her get pulled out of the disorder some. \n\nWhen I was really sick, I was working a temp summer stock theatre job, and my roommate there never confronted my disorder, but she was just there and made me feel a semblance of normalcy. Invited me to dinner, made sure I was included in group things when I just wanted to be alone with Ana. She got me to see life was a bit more than just how much I was eating and exercising. To this day she is still my best friend. She never made me feel like a burden, like all of my other friends did (that was just my perception, because they didn’t want me to be doing the things I was doing)\n\nJust approaching her and accusing her of having an ED will likely not lead to anything fruitful. Just an awkward conversation and maybe contention while at the gym. It might even shame her or cause a spiral. \n\nAll just my ramblings, so take as much or as little as you want",
      "created_utc": 1744763369.0,
      "score": 36,
      "context": []
    },
    {
      "id": "mncgha6",
      "author": "Fun-Chicken-2634",
      "body": "Might be nice to just reach out, extend an invitation for coffee at the gym\n“I see you here all the time, I was going to get a cup of coffee, you want to come?”",
      "created_utc": 1744771355.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mnccgld",
      "author": "Puzzleheaded_Ad_5435",
      "body": "I would do a small talk, befriend her, asks if she’s okay, and show support. Sometimes eating disorder can be so isolating and supports from strangers can make such a huge impact.",
      "created_utc": 1744769856.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mndox91",
      "author": "Jellpops98",
      "body": "Just leave her alone? No one wants an unsolicited advice? You never know what’s going on in someone’s life.",
      "created_utc": 1744794945.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mnbssjn",
      "author": "Cloudiewacom",
      "body": "From someone he struggles with this myself, I would just say are you okay? Do you fancy a coffee sometime and just know her before you start saying things?",
      "created_utc": 1744762789.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mnbs8yu",
      "author": "Shoddy-Estate-674",
      "body": "tbh if shes an adult there isnt a ton you can do, depending on the gym you can alert the staff/management about your concerns and they MIGHT ban her, but in the case of anorexia that wouldn't rlly do anything... im currently a college student and in that setting i would say reaching out and just letting her know there are resources could be helpful, but if your 'adults in the wild' then that might not be as helpful.",
      "created_utc": 1744762600.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mnd4esr",
      "author": "Analyst_Cold",
      "body": "Mind your own business. She’s an adult.",
      "created_utc": 1744782145.0,
      "score": -18,
      "context": []
    },
    {
      "id": "mnbskve",
      "author": "Excellent-World-476",
      "body": "Perhaps talk to the gym manager.",
      "created_utc": 1744762715.0,
      "score": -18,
      "context": []
    },
    {
      "id": "mncg21x",
      "author": "Aromatic_Note8944",
      "body": "That would honestly be so sweet",
      "created_utc": 1744771200.0,
      "score": 14,
      "context": [
        {
          "id": "mnbvqca",
          "author": "MoulinSarah",
          "body": "I would just befriend her in a genuine way. She’s probably so lonely.",
          "created_utc": 1744763821.0
        }
      ]
    },
    {
      "id": "mnh0nas",
      "author": "gstoabn",
      "body": "i really love the idea, unfortunately i am really socially awkward and have a hard time approaching people, plus she always seems so snappy and on edge, i really dont want to do or say anything wrong to make things even worse :(",
      "created_utc": 1744835920.0,
      "score": 12,
      "context": [
        {
          "id": "mnbvqca",
          "author": "MoulinSarah",
          "body": "I would just befriend her in a genuine way. She’s probably so lonely.",
          "created_utc": 1744763821.0
        }
      ]
    },
    {
      "id": "mnlsw3v",
      "author": "RisingPhoenix603",
      "body": "This! Because they could be describing me and I’m lonely as hell. Alone in this world. Honestly, no friends or family because of my anorexia.",
      "created_utc": 1744905713.0,
      "score": 7,
      "context": [
        {
          "id": "mnbvqca",
          "author": "MoulinSarah",
          "body": "I would just befriend her in a genuine way. She’s probably so lonely.",
          "created_utc": 1744763821.0
        }
      ]
    },
    {
      "id": "mo73usz",
      "author": "Salty-Willingness-91",
      "body": "What makes you think that she’s lonely ?",
      "created_utc": 1745204100.0,
      "score": 1,
      "context": [
        {
          "id": "mnbvqca",
          "author": "MoulinSarah",
          "body": "I would just befriend her in a genuine way. She’s probably so lonely.",
          "created_utc": 1744763821.0
        }
      ]
    },
    {
      "id": "mnh07s7",
      "author": "gstoabn",
      "body": "i hear you, but it just really doesn’t feel right to see somebody obviously struggling and unwell and i just sit there and watch",
      "created_utc": 1744835788.0,
      "score": 5,
      "context": [
        {
          "id": "mnd4esr",
          "author": "Analyst_Cold",
          "body": "Mind your own business. She’s an adult.",
          "created_utc": 1744782145.0
        }
      ]
    },
    {
      "id": "mnni7ha",
      "author": "bungmunchio",
      "body": "me too, but I've made wonderful friends by just handing them my number on a piece of paper and saying something like \"you seem really cool, I'd love to talk or maybe hang out sometime!\" it can be hard at first but it's a very chill/low-pressure way to go about it and I've never gotten a bad reaction. it's so sweet that you care about this girl, I hope you're able to make a connection with her💜",
      "created_utc": 1744923697.0,
      "score": 6,
      "context": [
        {
          "id": "mnbvqca",
          "author": "MoulinSarah",
          "body": "I would just befriend her in a genuine way. She’s probably so lonely.",
          "created_utc": 1744763821.0
        },
        {
          "id": "mnh0nas",
          "author": "gstoabn",
          "body": "i really love the idea, unfortunately i am really socially awkward and have a hard time approaching people, plus she always seems so snappy and on edge, i really dont want to do or say anything wrong to make things even worse :(",
          "created_utc": 1744835920.0
        }
      ]
    },
    {
      "id": "mo75l5p",
      "author": "MoulinSarah",
      "body": "When you’re that deep in eating disorder behaviors, you are very isolated.",
      "created_utc": 1745204779.0,
      "score": 1,
      "context": [
        {
          "id": "mnbvqca",
          "author": "MoulinSarah",
          "body": "I would just befriend her in a genuine way. She’s probably so lonely.",
          "created_utc": 1744763821.0
        },
        {
          "id": "mo73usz",
          "author": "Salty-Willingness-91",
          "body": "What makes you think that she’s lonely ?",
          "created_utc": 1745204100.0
        }
      ]
    },
    {
      "id": "mnjwzue",
      "author": "Analyst_Cold",
      "body": "That’s unfortunately part of life. As you get older you’ll understand that not everything benefits from your inserting yourself.",
      "created_utc": 1744879218.0,
      "score": -1,
      "context": [
        {
          "id": "mnd4esr",
          "author": "Analyst_Cold",
          "body": "Mind your own business. She’s an adult.",
          "created_utc": 1744782145.0
        },
        {
          "id": "mnh07s7",
          "author": "gstoabn",
          "body": "i hear you, but it just really doesn’t feel right to see somebody obviously struggling and unwell and i just sit there and watch",
          "created_utc": 1744835788.0
        }
      ]
    },
    {
      "id": "mo75u9w",
      "author": "Salty-Willingness-91",
      "body": "I need some support and advice. I’ve been struggling with anorexia for 13 years. I have always struggled and have been in and out of quasi recovery. I was doing okay for a long time, but I recently relapsed this past year, and it really affected my relationship with my boyfriend (we’ve been dating for 2.5 years, he’s 29 and I’m 26). He definitely seems to have different goals than me (he’s not that ambitious & fears change, he complains about his financial situation but does nothing to help myself, has depression/anxiety, & was struggling to pay his bills). Unfortunately,\nI have a not so great relationship with my own family, so my boyfriend’s family naturally became my chosen family & have been an amazing support system for me. When we were all together, it almost seemed like I had some respite from my ED for once because I just felt such a sense of belonging and loved. I was irritable from restriction, and my boyfriend and I started to both feel increasingly resentful towards each other. He said that I have a tendency to “play the victim” a lot of the time. I often get frustrated because he gets so anxious in social settings & tends to ruin them for everyone involved. He just gets miserable & brings down the mood. He is so out of control if he drinks beer & acts irrationally and can be mean. He thinks that I’m not emotionally supportive, but it’s so frustrating when I’m actively trying to help myself & he isn’t doing his part. He keeps telling me he’s going to go back to school, get healthy & lose weight, stop smoking weed, etc, but it never seems to happen. He was miserable the night of his birthday when we went out to dinner, and I had just had it. I went home as soon as we were done with dinner & that really upset him. I just couldn’t stay there if he was going to continue being miserable for the rest of the night because I need to protect my own energy & it brings me\ndown. After that, he told me we needed to take a “break” and I haven’t heard from him since (this was in late February). He said we both aren’t In a place to be in a relationship and we both need to work on ourselves. This was over a month ago. Apparently he’s in school right now and doing well. He knows I’m at residential and that I’m on another medical leave from work. I miss him and his family. I used to go there every holiday and celebrate with all of them, and it just makes me sad that I won’t be there with them for Easter tomorrow. I guess im just asking for peoples’ input and advice? Thank you in advance",
      "created_utc": 1745204883.0,
      "score": 1,
      "context": [
        {
          "id": "mnbvqca",
          "author": "MoulinSarah",
          "body": "I would just befriend her in a genuine way. She’s probably so lonely.",
          "created_utc": 1744763821.0
        },
        {
          "id": "mo73usz",
          "author": "Salty-Willingness-91",
          "body": "What makes you think that she’s lonely ?",
          "created_utc": 1745204100.0
        },
        {
          "id": "mo75l5p",
          "author": "MoulinSarah",
          "body": "When you’re that deep in eating disorder behaviors, you are very isolated.",
          "created_utc": 1745204779.0
        }
      ]
    },
    {
      "id": "mnkcvhz",
      "author": "gstoabn",
      "body": "i know there is nothing one can do about anything, but if everyone radically minded their own business without ever looking out for the people surrounding them the world would be an even nastier place than it already is. Im sorry that you are incapable of feeling empathy through your pretentious rationalism. Empathy is not something you lose by growing older :)",
      "created_utc": 1744888241.0,
      "score": 6,
      "context": [
        {
          "id": "mnd4esr",
          "author": "Analyst_Cold",
          "body": "Mind your own business. She’s an adult.",
          "created_utc": 1744782145.0
        },
        {
          "id": "mnh07s7",
          "author": "gstoabn",
          "body": "i hear you, but it just really doesn’t feel right to see somebody obviously struggling and unwell and i just sit there and watch",
          "created_utc": 1744835788.0
        },
        {
          "id": "mnjwzue",
          "author": "Analyst_Cold",
          "body": "That’s unfortunately part of life. As you get older you’ll understand that not everything benefits from your inserting yourself.",
          "created_utc": 1744879218.0
        }
      ]
    },
    {
      "id": "mnkphwu",
      "author": "nys_noz",
      "body": "Screw this guy. OP you still see the good in people, you still care and allow the feeling of humanity to drive you. I think a lot of other people have the right idea, try to befriend her, but you might have to do it slowly since she seems closed off. Try asking her for a \"favor\" to get her \"advise\" on doing cardio or if she has any tips about another exercise. After you get that simple rapport going for a few days, you could try asking if she'd like to get coffee, or maybe better, go see something in your town -- like a park or an event going on. Or just keep a gym friendship for a while. If she is subjected to an ED, asking her to a food establishment might not be the best idea at first. Best case scenario, she accepts and you start a friendship. Worst case, she gets creeped out and stops going to that gym or reports u to management (gotta be realistic and prepared for that). \n\nI get you wanting to help people and honestly that's refreshing. You have to also keep in mind that some people don't want help or might not be ready for it. If you try to befriend her or help her, be ready to accept if she doesn't want it. don't get angry, don't get hung up on what you could have done differently. Just keep being a good person. \n\nAnd don't allow this insufferable world to engulf you in callousness or apathy. Humanity is failing because of it.",
      "created_utc": 1744893452.0,
      "score": 6,
      "context": [
        {
          "id": "mnd4esr",
          "author": "Analyst_Cold",
          "body": "Mind your own business. She’s an adult.",
          "created_utc": 1744782145.0
        },
        {
          "id": "mnh07s7",
          "author": "gstoabn",
          "body": "i hear you, but it just really doesn’t feel right to see somebody obviously struggling and unwell and i just sit there and watch",
          "created_utc": 1744835788.0
        },
        {
          "id": "mnjwzue",
          "author": "Analyst_Cold",
          "body": "That’s unfortunately part of life. As you get older you’ll understand that not everything benefits from your inserting yourself.",
          "created_utc": 1744879218.0
        },
        {
          "id": "mnkcvhz",
          "author": "gstoabn",
          "body": "i know there is nothing one can do about anything, but if everyone radically minded their own business without ever looking out for the people surrounding them the world would be an even nastier place than it already is. Im sorry that you are incapable of feeling empathy through your pretentious rationalism. Empathy is not something you lose by growing older :)",
          "created_utc": 1744888241.0
        }
      ]
    },
    {
      "id": "mnke3uw",
      "author": "Analyst_Cold",
      "body": "I just don’t have the gauling presumption that I am everyone’s savior.",
      "created_utc": 1744888807.0,
      "score": -1,
      "context": [
        {
          "id": "mnd4esr",
          "author": "Analyst_Cold",
          "body": "Mind your own business. She’s an adult.",
          "created_utc": 1744782145.0
        },
        {
          "id": "mnh07s7",
          "author": "gstoabn",
          "body": "i hear you, but it just really doesn’t feel right to see somebody obviously struggling and unwell and i just sit there and watch",
          "created_utc": 1744835788.0
        },
        {
          "id": "mnjwzue",
          "author": "Analyst_Cold",
          "body": "That’s unfortunately part of life. As you get older you’ll understand that not everything benefits from your inserting yourself.",
          "created_utc": 1744879218.0
        },
        {
          "id": "mnkcvhz",
          "author": "gstoabn",
          "body": "i know there is nothing one can do about anything, but if everyone radically minded their own business without ever looking out for the people surrounding them the world would be an even nastier place than it already is. Im sorry that you are incapable of feeling empathy through your pretentious rationalism. Empathy is not something you lose by growing older :)",
          "created_utc": 1744888241.0
        }
      ]
    }
  ]
}