{
  "id": "1k5lmhs",
  "subreddit": "EatingDisorders",
  "author": "spiderqueen2000",
  "created_utc": 1745366842.0,
  "title": "Friend has SEED anorexia nervosa and is going to d*e",
  "selftext": "As stated in the title, my friend is currently on palliative and hospice care due to anorexia nervosa. I hate seeing this disease slowly but surely take her from us. That being said, she is still heavily convinced she is not thin enough and continues the routines and rituals and asks for reassurance of looking emaciated. Is it appropriate to answer her question? Is it actually helpful to tell her she looks emaciated? Or am I just adding fuel to an already roaring fire? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1k5lmhs/friend_has_seed_anorexia_nervosa_and_is_going_to/",
  "score": 212,
  "num_comments": 28,
  "comments": [
    {
      "id": "moj3kdo",
      "author": "swoopingturtle",
      "body": "If she’s on hospice, it may be best to consult the hospice nurse on the best thing to do here. Personally I can’t imagine reassurances are going to hurt anything just the same way morphine wouldn’t hurt a drug addict who is dying",
      "created_utc": 1745369419.0,
      "score": 306,
      "context": []
    },
    {
      "id": "mojlj0b",
      "author": "rusticterror",
      "body": "Even if you are adding fuel to the fire, at this point, the fire is a smoldering ruin. It literally cannot get worse. She’s never going to see that. I personally wouldn’t capitulate to the disease in that way (offering reassurance) because yes, it is only reinforcing the ED and it’s not helpful, but  what damage is left to do?\n\nRegardless, I’ve seen this happen too. It’s one of the hardest things I’ve ever witnessed, watching people decay on purpose. The pain and sickness these people undergo are unbelievable. I’m so sorry that you’re suffering this slow loss.",
      "created_utc": 1745375806.0,
      "score": 154,
      "context": []
    },
    {
      "id": "mojltpf",
      "author": "runninginbubbles",
      "body": "God I am so sorry you're going through this. Her poor family. That's terrible. \n\nIf I was in your shoes - yeah I'd tell her actually. I feel like, if she really is at the point of no return, give her the reassurances she so desperately needs and take away some of the mental agony for a short while. Yeah she'll ask again and again, but if she really is dying - the only thing really doing more harm is her own distress.",
      "created_utc": 1745375915.0,
      "score": 73,
      "context": []
    },
    {
      "id": "mojs33x",
      "author": "JumpingGrace",
      "body": "One of my very good friends is on palliative care with anorexia,. So I can relate and I am sorry you are going through this too.\n\nTo answer your question, I would refer to her hospice nurse first as to how they're going about her treatment, but as a \"general\" answer :\"yes\" it would be appropriate to answer her question.",
      "created_utc": 1745378277.0,
      "score": 58,
      "context": []
    },
    {
      "id": "mokph8m",
      "author": "NYCstateofmind",
      "body": "I had a friend pass a couple of years ago from her AN. The best advice I can give is spend time telling your friend you love her and all the things you have enjoyed together.",
      "created_utc": 1745395915.0,
      "score": 36,
      "context": []
    },
    {
      "id": "monrr3t",
      "author": "alexisseffy",
      "body": "I am in training to become a hospice volunteer. I would not advise trying to reason with her or “talk sense into her” but try to keep her calm and minimize her distress, even if that does entail reassuring her AN. It’s not ideal but nothing about this situation is",
      "created_utc": 1745435878.0,
      "score": 21,
      "context": []
    },
    {
      "id": "moo5ucw",
      "author": "awakening-of-flora",
      "body": "I have a friend in the exact same situation. I even wonder if we are talking about the same person because my friend literally just posted a body-checking photo asking if she “looks fat” even though she has recently posted that her BMI is like, 7 point something. It’s so heartbreaking. I wish she would accept treatment.",
      "created_utc": 1745439967.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mojc5hw",
      "author": "TallNPierced",
      "body": "I would just say “there’s no right answer to your question, let’s discuss something else.” \nOr make it a boundary that you will not discuss her appearance with her.",
      "created_utc": 1745372463.0,
      "score": 54,
      "context": []
    },
    {
      "id": "mono28f",
      "author": "ermagawd",
      "body": "What is SEED?",
      "created_utc": 1745434790.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mok6224",
      "author": "Open_Priority7402",
      "body": "I would stay clear of image based comments. “You look unwell/emaciated/like a drug addict” can be translated in their minds as compliments and reinforce her behaviours.",
      "created_utc": 1745384461.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mplknih",
      "author": "snowymarch2",
      "body": "I really don't think that it could hurt or help to tell her this. Honestly, if she's already on hospice, you might as well. If she's dying, and will die, then at least she'll die a little bit happy. That is my personal opinion. As the other comments have said, morphine wouldn't hurt a dying drug addict, patients with terminal lung cancer are allowed to smoke, etc. \n\nOn a more personal note, I am deeply sorry you are dealing with this (as well as her). I am diagnosed with anorexia and it is by far the worst thing someone can go through. One of the main reasons I was able to start recovery is because I saw how it was affecting my loved ones - I was well on my way to dying, but I'm so glad I didn't. I hope you have people you can talk to and resources for yourself.",
      "created_utc": 1745896513.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mopa545",
      "author": "None",
      "body": "I’m battling Anorexia too, rn … it’s being very hard…\nAnd lost my dad just about more two weeks ago, so I don’t feel much hungry…what make things worse because I’m constantly depressed 😔",
      "created_utc": 1745452796.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpecrf0",
      "author": "skye301",
      "body": "I am wondering if you might be able to divert this question with a question. If you weren’t thinking about your body and were strong and well right now, how might we spend the day together?  And if that is too much for her, maybe something like “you know, I never knew what your favorite ‘x’ is. What’s your favorite ‘x’? Oh, I didnt know that, why is it your favorite?” Could be an animal, a place to vacation, a flower. If you could have any home right now would it be the city or the country? See if you might be able to help re-ground her in hope outside the eating disorder and spend some time showing her she is valued for her, not for the way her body does or does not look. (I recovered from and ED 20 years ago. Life without obsession is possible still to the last breath with even a spec of hope.) I hope this is helpful. I realize it might not be, but I hope that it is.",
      "created_utc": 1745797158.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mokrt7h",
      "author": "houston_veronica",
      "body": "Agree 100%. I see this almost like when people are struggling with dementia, or have a severe loss of reality. We might soothe them if they say things that make no sense, and this is similar. I can't imagine saying 'oh yes, you are so very skinny', but just reminding her that she deserves to eat and is the thinnest she can possibly be.  When I received treatment, there is truth to the feeling of being told \"you MUST eat, you are desperately in need of food, there is simply no further you can go\".  The mind sees it as 'permission' to eat. If you leave any wiggle room, such as \"you did good today\" (if they eat a cracker, for example), then their brain will read that as \"you ate enough, in fact you ate too much. Scale back.\"\n\nYou have to overemphasize the need to eat, but also not seem shaming or as i they are causing you/others to be displeased. It's so tricky.",
      "created_utc": 1745397455.0,
      "score": 105,
      "context": [
        {
          "id": "moj3kdo",
          "author": "swoopingturtle",
          "body": "If she’s on hospice, it may be best to consult the hospice nurse on the best thing to do here. Personally I can’t imagine reassurances are going to hurt anything just the same way morphine wouldn’t hurt a drug addict who is dying",
          "created_utc": 1745369419.0
        }
      ]
    },
    {
      "id": "moljfgi",
      "author": "FloridaMomm",
      "body": "When people are on hospice for lung cancer they are allowed to smoke. Cigarettes are objectively harmful, but depriving them the cigarettes won’t make the cancer stop, so they just let them have that comfort\n\nSame here. There’s no fixing the problem at this point so (maladaptive, normally not ok) behaviors may bring comfort at this stage",
      "created_utc": 1745411653.0,
      "score": 65,
      "context": [
        {
          "id": "mojlj0b",
          "author": "rusticterror",
          "body": "Even if you are adding fuel to the fire, at this point, the fire is a smoldering ruin. It literally cannot get worse. She’s never going to see that. I personally wouldn’t capitulate to the disease in that way (offering reassurance) because yes, it is only reinforcing the ED and it’s not helpful, but  what damage is left to do?\n\nRegardless, I’ve seen this happen too. It’s one of the hardest things I’ve ever witnessed, watching people decay on purpose. The pain and sickness these people undergo are unbelievable. I’m so sorry that you’re suffering this slow loss.",
          "created_utc": 1745375806.0
        }
      ]
    },
    {
      "id": "mox54b1",
      "author": "Melodramatic-anon876",
      "body": "I immediately thought of the same friend; she is really wary about being posted about on anonymous sites for insensitive posts so for that reason I want to remind everyone to be aware that she’s in a very vulnerable place and to be kind. I can’t imagine the pain of existing in such an ill state and only wish her comfort and respite from her mind.",
      "created_utc": 1745557020.0,
      "score": 3,
      "context": [
        {
          "id": "moo5ucw",
          "author": "awakening-of-flora",
          "body": "I have a friend in the exact same situation. I even wonder if we are talking about the same person because my friend literally just posted a body-checking photo asking if she “looks fat” even though she has recently posted that her BMI is like, 7 point something. It’s so heartbreaking. I wish she would accept treatment.",
          "created_utc": 1745439967.0
        }
      ]
    },
    {
      "id": "mol55mr",
      "author": "Forever_Alone51023",
      "body": "The friend is dying. Literally. Idk bc I can't gauge the other person's thoughts and feelings but this may just make the friend feel abandoned and like they need to express themselves (THEY ARE DYING) and the friend (OP)...isn't there.\n\n\nThis COULD work if the friend weren't already distressed..OP said the friend STILL doesn't think they're -THIN ENOUGH-...(Sorry for the caps, but I'm not good at the Reddit italics and stuff lol) so avoiding it is just going to distress them more? Idk if encouraging it/being complicit with it would be more helpful or harmful though. This is a slippery slope indeed and OP would be best to judge this one out ...l do hope the guidance here helps tho!\n\nThoughts?",
      "created_utc": 1745405463.0,
      "score": 32,
      "context": [
        {
          "id": "mojc5hw",
          "author": "TallNPierced",
          "body": "I would just say “there’s no right answer to your question, let’s discuss something else.” \nOr make it a boundary that you will not discuss her appearance with her.",
          "created_utc": 1745372463.0
        }
      ]
    },
    {
      "id": "montgdr",
      "author": "messyenby",
      "body": "severe and enduring eating disorder",
      "created_utc": 1745436379.0,
      "score": 12,
      "context": [
        {
          "id": "mono28f",
          "author": "ermagawd",
          "body": "What is SEED?",
          "created_utc": 1745434790.0
        }
      ]
    },
    {
      "id": "monu8va",
      "author": "ferrett0ast",
      "body": "severe and enduring eating disorder",
      "created_utc": 1745436607.0,
      "score": 6,
      "context": [
        {
          "id": "mono28f",
          "author": "ermagawd",
          "body": "What is SEED?",
          "created_utc": 1745434790.0
        }
      ]
    },
    {
      "id": "mokkfy6",
      "author": "Lindsey7618",
      "body": "OP said she's in hospice care though....if she's genuinely dying, it's better to reassure her imo.",
      "created_utc": 1745392685.0,
      "score": 34,
      "context": [
        {
          "id": "mok6224",
          "author": "Open_Priority7402",
          "body": "I would stay clear of image based comments. “You look unwell/emaciated/like a drug addict” can be translated in their minds as compliments and reinforce her behaviours.",
          "created_utc": 1745384461.0
        }
      ]
    },
    {
      "id": "mt384lm",
      "author": "sunshineroar",
      "body": "I'm sorry to hear about your dad. Are you around family and friends? If so, try to spend meals with them. And when you can't finish a meal on your own, can you get ahold of meal replacement/protein shakes? Otherwise, your body won't receive the nutrition it needs to recover, function, etc.",
      "created_utc": 1747642696.0,
      "score": 1,
      "context": [
        {
          "id": "mopa545",
          "author": "None",
          "body": "I’m battling Anorexia too, rn … it’s being very hard…\nAnd lost my dad just about more two weeks ago, so I don’t feel much hungry…what make things worse because I’m constantly depressed 😔",
          "created_utc": 1745452796.0
        }
      ]
    },
    {
      "id": "momvtbl",
      "author": "HoloCatss",
      "body": "My aunt was in hospice because of lung cancer. It happened fast, they discovered it in September, she died in January. (We suspect she knew for a year because she mentioned to my mom they saw something on a scan a year earlier but she didn’t do anything about it.) She had a rough life, she was sick with stress for a few years, she was a sober alcoholic. She used to smoke but stopped years ago. She started smoking the last few months at the hospice. No one was stopping her, if she found comfort in it, she deserved that. It couldn’t make anything worse at that point. \n\nShe wanted to stay alive until she saw our national team win EU or world championship in handball. They won, she saw it, she died a week or two later. It was during peak covid, she was barely allowed visitors. I had to say my goodbyes over text. I barely made it to the funeral, they only had seats for thirty people, because of restrictions.",
      "created_utc": 1745426708.0,
      "score": 22,
      "context": [
        {
          "id": "mojlj0b",
          "author": "rusticterror",
          "body": "Even if you are adding fuel to the fire, at this point, the fire is a smoldering ruin. It literally cannot get worse. She’s never going to see that. I personally wouldn’t capitulate to the disease in that way (offering reassurance) because yes, it is only reinforcing the ED and it’s not helpful, but  what damage is left to do?\n\nRegardless, I’ve seen this happen too. It’s one of the hardest things I’ve ever witnessed, watching people decay on purpose. The pain and sickness these people undergo are unbelievable. I’m so sorry that you’re suffering this slow loss.",
          "created_utc": 1745375806.0
        },
        {
          "id": "moljfgi",
          "author": "FloridaMomm",
          "body": "When people are on hospice for lung cancer they are allowed to smoke. Cigarettes are objectively harmful, but depriving them the cigarettes won’t make the cancer stop, so they just let them have that comfort\n\nSame here. There’s no fixing the problem at this point so (maladaptive, normally not ok) behaviors may bring comfort at this stage",
          "created_utc": 1745411653.0
        }
      ]
    },
    {
      "id": "monx8nc",
      "author": "ermagawd",
      "body": "Thank you! I haven't heard the term before. That's incredibly sad :(",
      "created_utc": 1745437476.0,
      "score": 8,
      "context": [
        {
          "id": "mono28f",
          "author": "ermagawd",
          "body": "What is SEED?",
          "created_utc": 1745434790.0
        },
        {
          "id": "montgdr",
          "author": "messyenby",
          "body": "severe and enduring eating disorder",
          "created_utc": 1745436379.0
        }
      ]
    },
    {
      "id": "mokumkr",
      "author": "Open_Priority7402",
      "body": "I guess it comes down to the definition of “helpful” in this scenario. \nI’m not sure where OP is from but I’ve never heard of hospice care for EDs. Like do they just let the person continue with their ED in a medical setting?\nHere they will section you and insert a NG or use whatever manipulation they can to force feed patients.",
      "created_utc": 1745399290.0,
      "score": -21,
      "context": [
        {
          "id": "mok6224",
          "author": "Open_Priority7402",
          "body": "I would stay clear of image based comments. “You look unwell/emaciated/like a drug addict” can be translated in their minds as compliments and reinforce her behaviours.",
          "created_utc": 1745384461.0
        },
        {
          "id": "mokkfy6",
          "author": "Lindsey7618",
          "body": "OP said she's in hospice care though....if she's genuinely dying, it's better to reassure her imo.",
          "created_utc": 1745392685.0
        }
      ]
    },
    {
      "id": "mokwmd6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1745400571.0,
      "score": 41,
      "context": [
        {
          "id": "mok6224",
          "author": "Open_Priority7402",
          "body": "I would stay clear of image based comments. “You look unwell/emaciated/like a drug addict” can be translated in their minds as compliments and reinforce her behaviours.",
          "created_utc": 1745384461.0
        },
        {
          "id": "mokkfy6",
          "author": "Lindsey7618",
          "body": "OP said she's in hospice care though....if she's genuinely dying, it's better to reassure her imo.",
          "created_utc": 1745392685.0
        },
        {
          "id": "mokumkr",
          "author": "Open_Priority7402",
          "body": "I guess it comes down to the definition of “helpful” in this scenario. \nI’m not sure where OP is from but I’ve never heard of hospice care for EDs. Like do they just let the person continue with their ED in a medical setting?\nHere they will section you and insert a NG or use whatever manipulation they can to force feed patients.",
          "created_utc": 1745399290.0
        }
      ]
    },
    {
      "id": "mol728p",
      "author": "Open_Priority7402",
      "body": "As someone who lived through forced feeding and hospitalisations and organ failure, yes I am aware that eating disorders kill. \n\nOPs question was asking what would be helpful and if reinforcing her body dysmorphia would add fuel to the fire which it would. \n\nI’ve heard of voluntary assisted dying for ED patients in Europe but had no idea palliative care was an option. I would have loved nothing more than for everyone to just step back and let the beast that plagued me for over 20 years take me.",
      "created_utc": 1745406395.0,
      "score": -19,
      "context": [
        {
          "id": "mok6224",
          "author": "Open_Priority7402",
          "body": "I would stay clear of image based comments. “You look unwell/emaciated/like a drug addict” can be translated in their minds as compliments and reinforce her behaviours.",
          "created_utc": 1745384461.0
        },
        {
          "id": "mokkfy6",
          "author": "Lindsey7618",
          "body": "OP said she's in hospice care though....if she's genuinely dying, it's better to reassure her imo.",
          "created_utc": 1745392685.0
        },
        {
          "id": "mokumkr",
          "author": "Open_Priority7402",
          "body": "I guess it comes down to the definition of “helpful” in this scenario. \nI’m not sure where OP is from but I’ve never heard of hospice care for EDs. Like do they just let the person continue with their ED in a medical setting?\nHere they will section you and insert a NG or use whatever manipulation they can to force feed patients.",
          "created_utc": 1745399290.0
        },
        {
          "id": "mokwmd6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745400571.0
        }
      ]
    },
    {
      "id": "mormotw",
      "author": "missmelodydoesitall",
      "body": "she’s not in palliative care, she’s in hospice. there’s a fine line.",
      "created_utc": 1745492011.0,
      "score": 3,
      "context": [
        {
          "id": "mok6224",
          "author": "Open_Priority7402",
          "body": "I would stay clear of image based comments. “You look unwell/emaciated/like a drug addict” can be translated in their minds as compliments and reinforce her behaviours.",
          "created_utc": 1745384461.0
        },
        {
          "id": "mokkfy6",
          "author": "Lindsey7618",
          "body": "OP said she's in hospice care though....if she's genuinely dying, it's better to reassure her imo.",
          "created_utc": 1745392685.0
        },
        {
          "id": "mokumkr",
          "author": "Open_Priority7402",
          "body": "I guess it comes down to the definition of “helpful” in this scenario. \nI’m not sure where OP is from but I’ve never heard of hospice care for EDs. Like do they just let the person continue with their ED in a medical setting?\nHere they will section you and insert a NG or use whatever manipulation they can to force feed patients.",
          "created_utc": 1745399290.0
        },
        {
          "id": "mokwmd6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745400571.0
        },
        {
          "id": "mol728p",
          "author": "Open_Priority7402",
          "body": "As someone who lived through forced feeding and hospitalisations and organ failure, yes I am aware that eating disorders kill. \n\nOPs question was asking what would be helpful and if reinforcing her body dysmorphia would add fuel to the fire which it would. \n\nI’ve heard of voluntary assisted dying for ED patients in Europe but had no idea palliative care was an option. I would have loved nothing more than for everyone to just step back and let the beast that plagued me for over 20 years take me.",
          "created_utc": 1745406395.0
        }
      ]
    },
    {
      "id": "mpv6w1e",
      "author": "Lindsey7618",
      "body": "Okay, but as someone else pointed out, there's a big difference. She's not in palliative care, so I'm not sure why you said that when the post directly says she's in hospice care. Hospice means you are dying and are not going to live. They don't put you in hospice care unless they decide you are not going to get better. Nobody is stepping back and letting someone die. This is what happens when there's no way to help the person get better. If she's in hospice care, she likely isn't going to make it no matter what.",
      "created_utc": 1746031048.0,
      "score": 1,
      "context": [
        {
          "id": "mok6224",
          "author": "Open_Priority7402",
          "body": "I would stay clear of image based comments. “You look unwell/emaciated/like a drug addict” can be translated in their minds as compliments and reinforce her behaviours.",
          "created_utc": 1745384461.0
        },
        {
          "id": "mokkfy6",
          "author": "Lindsey7618",
          "body": "OP said she's in hospice care though....if she's genuinely dying, it's better to reassure her imo.",
          "created_utc": 1745392685.0
        },
        {
          "id": "mokumkr",
          "author": "Open_Priority7402",
          "body": "I guess it comes down to the definition of “helpful” in this scenario. \nI’m not sure where OP is from but I’ve never heard of hospice care for EDs. Like do they just let the person continue with their ED in a medical setting?\nHere they will section you and insert a NG or use whatever manipulation they can to force feed patients.",
          "created_utc": 1745399290.0
        },
        {
          "id": "mokwmd6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745400571.0
        },
        {
          "id": "mol728p",
          "author": "Open_Priority7402",
          "body": "As someone who lived through forced feeding and hospitalisations and organ failure, yes I am aware that eating disorders kill. \n\nOPs question was asking what would be helpful and if reinforcing her body dysmorphia would add fuel to the fire which it would. \n\nI’ve heard of voluntary assisted dying for ED patients in Europe but had no idea palliative care was an option. I would have loved nothing more than for everyone to just step back and let the beast that plagued me for over 20 years take me.",
          "created_utc": 1745406395.0
        }
      ]
    },
    {
      "id": "mpv72ed",
      "author": "Lindsey7618",
      "body": "It doesn't matter if it adds fuel to the fire when she's literally dying and is being prepared for death, which is what hospice care does. I think you're confused.",
      "created_utc": 1746031100.0,
      "score": 1,
      "context": [
        {
          "id": "mok6224",
          "author": "Open_Priority7402",
          "body": "I would stay clear of image based comments. “You look unwell/emaciated/like a drug addict” can be translated in their minds as compliments and reinforce her behaviours.",
          "created_utc": 1745384461.0
        },
        {
          "id": "mokkfy6",
          "author": "Lindsey7618",
          "body": "OP said she's in hospice care though....if she's genuinely dying, it's better to reassure her imo.",
          "created_utc": 1745392685.0
        },
        {
          "id": "mokumkr",
          "author": "Open_Priority7402",
          "body": "I guess it comes down to the definition of “helpful” in this scenario. \nI’m not sure where OP is from but I’ve never heard of hospice care for EDs. Like do they just let the person continue with their ED in a medical setting?\nHere they will section you and insert a NG or use whatever manipulation they can to force feed patients.",
          "created_utc": 1745399290.0
        },
        {
          "id": "mokwmd6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1745400571.0
        },
        {
          "id": "mol728p",
          "author": "Open_Priority7402",
          "body": "As someone who lived through forced feeding and hospitalisations and organ failure, yes I am aware that eating disorders kill. \n\nOPs question was asking what would be helpful and if reinforcing her body dysmorphia would add fuel to the fire which it would. \n\nI’ve heard of voluntary assisted dying for ED patients in Europe but had no idea palliative care was an option. I would have loved nothing more than for everyone to just step back and let the beast that plagued me for over 20 years take me.",
          "created_utc": 1745406395.0
        }
      ]
    }
  ]
}