{
  "id": "1k7f65f",
  "subreddit": "EatingDisorders",
  "author": "AsleepCheesecake584",
  "created_utc": 1745566494.0,
  "title": "I used to love fashion until I gained weight from recovery (need advice?)",
  "selftext": "So i have never officially been diagnosed with anything but ive had disordered/restrictive eating all my life due to a desire to be thin and beautiful. I would just simply not eat. \n\nWhen i was at my lowest weight, i loved wearing things that made me look \"sexy\" For reference, I dressed in a very y2k/mcbling style. (Micro skirts, cheetah prints, metallics, low waist/crop tops, just revealing clothes in general) \n\nIf im being honest, i was actually quite happy during my \"eating disorder\" but the physical and mental exhaustion (along with a whole list of symptoms im sure you're all aware of) from the malnutrition was really affecting my studies and so my parents ( im a uni student who commutes) have started to \"force\" me to eat three regular meals a day. I say \"force\" on quotations because I wasn't really that opposed to the idea since I could barely function back then. \n\nSo far my \"recovery\" has been okay-ish, like I'm feeling a lot better which is a natural consequence of nourishing your body, so like I'm not constantly freezing, I have a lot of energy (I'm able to take the stairs now if I want to) and most importantly, I'm able to focus on my studies. \n\nHowever,,, my biggest passion/hobby was fashion. And since I've gained weight, barely any of my clothes fit me anymore. For now, since I don't know what my \"full recovery\" weight will be, I've put off buying any new clothes, I've just been wearing anything oversized/baggy or borrowing from my mom's wardrobe. If I'm going to be honest, this is making me really really depressed. I thought recovery was supposed to make me feel better, like technically I'm physically better but I don't even bother with clothes anymore, I just wake up and slap on some random sweatpants/sweatshirts. All my friends and family keep asking why I'm not dressing up anymore but it just makes me so depressed because it's not like I can just walk into an old navy and get the same clothes in a bigger size. A lot of my clothes were one-of-a-kind/vintage or discontinued. \n\n\nMy friends keep encouraging me to continue collecting, but to just restart my wardrobe with my \"recovery size\" but it's like that feeling when you've been playing a video game for so long and you collected all these event-exclusive items, but suddenly your account got deleted. So you make a new account for the game and start fresh, but your passion for it just dies and you just don't play the game anymore. \n\nI keep scrolling on Pinterest boards in sadness and I just don't know how to stop feeling so depressed about this. I guess tldr is that I miss feeling sexy lolll. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1k7f65f/i_used_to_love_fashion_until_i_gained_weight_from/",
  "score": 37,
  "num_comments": 13,
  "comments": [
    {
      "id": "mp2aovs",
      "author": "Fantastic_Still_3699",
      "body": "I feel you. It’s especially tough when you’ve got so many beautiful items. I’m sure it was a lot of work to have collected those. That said, in time, you would’ve wanted to change your style anyway. No? Would you consider starting to go back into some vintage places and looking for new items in new sizes? One item at a time. It takes time to rebuild.\n\nListen, we are all (likely all of us in this sub-Reddit) inappropriately raised, trained or groomed to believe that only a certain body type is allowed to look a certain way. That is utter bullshit, incorrect, and quite frankly a lot of the problem that starts many - of the more vulnerable of us - on the path towards disordered eating, which leads to eating disorders. \n\nMy favourite quote from the last decade was from a little girl who was in a change room while out shopping with her mama. Her mama posted to Socials what she heard from the dressing room about the pants that her daughter was trying on…. The little girl said, “Mama, my thighs are too powerful for these pants.”\n\nIt warmed my heart. It made me realize that maybe, just maybe, there’s a way to educate more children to understand (like her) that it’s not your thighs that are the problem, it’s the pants. Fuck the old pants. Find better ones.\n\nWarm hug.",
      "created_utc": 1745626171.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mp2jfr8",
      "author": "SympathySecret799",
      "body": "I  hear you. 100%. I'm a little less than a month into recovery and I have gained soooo much. I really enjoyed wearing vintage style outfits like old sweaters and carpenter pants and layering and that kind of thing.. nope not anymore. Now I can only wear the largest things I own. I feel like Regina George. (pls get my reference)",
      "created_utc": 1745629285.0,
      "score": 5,
      "context": []
    },
    {
      "id": "moyj0ya",
      "author": "theredsongstress",
      "body": "Oh my God I relate so hard. I honestly went to the thrift store pretty early on and got some nice pieces second-hand. Stretchy stuff with lots of give in it (no jeans lol), things that weren't tight around the waist (empire waist dresses, loose crop tops), and things that still showed off the places I liked to show off (for me I liked things showing off my shoulders and hugging the bum). My old style, with a few modifications to accommodate my changing body. I still did have to purchase more clothes when my weight evened out, and I didn't do a full shop until my weight had redistributed, but just having some items to go with my leggings and baggy t shirts made me feel better. Buying second-hand is honestly great. It's better for the environment and your wallet, and it's fun (to me) to browse through all the items and find the stuff you love.\n\nAlso, I hope this isn't TMI, but once my weight did even out, I bought myself some nice lingerie and did my own boudoir shoot with the self timer on my phone. Nobody ever has to see these pics, they're just for you to look at and appreciate your new body and feel sexy. Even before my weight redistributed, this was fun. Don't focus on the places where you're bigger than before, find the things that you like. Not even weight-related things, maybe your hair is shinier or your skin is better or you just look overall more glowing. Stuff like that.\n\nI honestly felt a lot better once I could style myself and feel like \"me\" again. I hope the same goes for you!",
      "created_utc": 1745584043.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mp2p910",
      "author": "back-on-my--shit",
      "body": "Firstly I'm really sorry you're going through this. I'm in a really similar boat at the moment and it's not fun.\n\nIf you can find the time selling your old clothes on depop/vinted can be a good outlet. If you're into fashion you probably already have lots of pieces that would go for a good price.It would also be like a digital catalog of your collection without holding onto them Aand you can use that to fund your new wardrobe.\n\nIt would also mean you can invest in clothes that fit you now and sell them again when they're no longer suitable. Although I know all too well how triggering it can be to grow out of clothes you love so just be careful.\n\nAs some other people have said getting stretchy/flowy clothes for the time being could be a shout. Things that'll accommodate your body changing.\n\nGood luck on your recovery <3",
      "created_utc": 1745631393.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mp328z6",
      "author": "demonslayed92",
      "body": "Girl, I feel that",
      "created_utc": 1745636120.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mp3ymga",
      "author": "vodkawaterbox",
      "body": "I 100% feel this. I most literally bought new clothes for summer, hated how I looked in them now, and then ended up selling and giving away all my old clothes I used to love wearing out. I don't want to be seen in anything other than sweatpants and hoodies, and even in these I feel insecure. Nowadays if I go out I end up wearing a cute top, maybe a skirt, but also paired with a leather jacket and knee high boots, so a minimum amount of my body is actually showing. If you look around of inspiration, there's always something you can throw together to make you look and feel cute but at the same time not stepping out of your comfort zone in regards to how you feel in your body. You're not alone, but we're all in this together! :(",
      "created_utc": 1745651744.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mozqlk3",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1745597656.0,
      "score": -5,
      "context": []
    },
    {
      "id": "mp5mqjc",
      "author": "AsleepCheesecake584",
      "body": "I know exactly what you mean (I looove mean girls) I used to get so excited planning my outfits but now I dread it every day, I jsut wear whatever covers me the most bc I don't even want people to look at me. \n\nIt's okay though we're in this together. recovery shouldn't stop us from being stylish 😤❤️",
      "created_utc": 1745679839.0,
      "score": 2,
      "context": [
        {
          "id": "mp2jfr8",
          "author": "SympathySecret799",
          "body": "I  hear you. 100%. I'm a little less than a month into recovery and I have gained soooo much. I really enjoyed wearing vintage style outfits like old sweaters and carpenter pants and layering and that kind of thing.. nope not anymore. Now I can only wear the largest things I own. I feel like Regina George. (pls get my reference)",
          "created_utc": 1745629285.0
        }
      ]
    },
    {
      "id": "mp0cblr",
      "author": "AsleepCheesecake584",
      "body": "The private lingerie photos sound like a pretty good idea, I never even considered that, especially bc posting outfit pics online is definitely not an option for me anymore (I crave the likes and comments about my body too much I think it would cause a relapse) but having private photos of myself makes it so I can still partake in my hobby without the toxic aspects. Thank you for that advice! \n\nThe fashion industry is a lot more nowadays so it's nice to know people who also had issues with ed still continue to dress in their style with some modifications. I see many healthy and plus sized women rocking crop tops and mini skirts and they look super pretty and happy. I guess it's confidence that I'll build over time.",
      "created_utc": 1745603883.0,
      "score": 4,
      "context": [
        {
          "id": "moyj0ya",
          "author": "theredsongstress",
          "body": "Oh my God I relate so hard. I honestly went to the thrift store pretty early on and got some nice pieces second-hand. Stretchy stuff with lots of give in it (no jeans lol), things that weren't tight around the waist (empire waist dresses, loose crop tops), and things that still showed off the places I liked to show off (for me I liked things showing off my shoulders and hugging the bum). My old style, with a few modifications to accommodate my changing body. I still did have to purchase more clothes when my weight evened out, and I didn't do a full shop until my weight had redistributed, but just having some items to go with my leggings and baggy t shirts made me feel better. Buying second-hand is honestly great. It's better for the environment and your wallet, and it's fun (to me) to browse through all the items and find the stuff you love.\n\nAlso, I hope this isn't TMI, but once my weight did even out, I bought myself some nice lingerie and did my own boudoir shoot with the self timer on my phone. Nobody ever has to see these pics, they're just for you to look at and appreciate your new body and feel sexy. Even before my weight redistributed, this was fun. Don't focus on the places where you're bigger than before, find the things that you like. Not even weight-related things, maybe your hair is shinier or your skin is better or you just look overall more glowing. Stuff like that.\n\nI honestly felt a lot better once I could style myself and feel like \"me\" again. I hope the same goes for you!",
          "created_utc": 1745584043.0
        }
      ]
    },
    {
      "id": "mp5m4ae",
      "author": "AsleepCheesecake584",
      "body": "I never even considered using Depop as a fashion archive that sounds like a really good idea bc I really do need to get these clothes out of my closet, they keep upsetting me everyday when I get ready and noticing I'm too big for most of the clothes in my closet, but I also found it hard to get rid of it since I spent a lot of time and effort collecting a lot of these vintage pieces and I have a lot of memories associated with them so having a little catalogue of them on Depop would be nice. I think I'm gonna watch some videos on how to sell on Depop because that will also help me find my new wardrobe like you said bc some of these clothes can go for alott. \n\n& yes I'll definitely get some stretchy and loose clothes for the moment before committing to anything with a non stretchy fabric like jeans. \n\nThanks so much for the advice! I wish you the best as well. Crossing my fingers let's hope we get a bunch of awesome clothes in the future 🤞",
      "created_utc": 1745679644.0,
      "score": 2,
      "context": [
        {
          "id": "mp2p910",
          "author": "back-on-my--shit",
          "body": "Firstly I'm really sorry you're going through this. I'm in a really similar boat at the moment and it's not fun.\n\nIf you can find the time selling your old clothes on depop/vinted can be a good outlet. If you're into fashion you probably already have lots of pieces that would go for a good price.It would also be like a digital catalog of your collection without holding onto them Aand you can use that to fund your new wardrobe.\n\nIt would also mean you can invest in clothes that fit you now and sell them again when they're no longer suitable. Although I know all too well how triggering it can be to grow out of clothes you love so just be careful.\n\nAs some other people have said getting stretchy/flowy clothes for the time being could be a shout. Things that'll accommodate your body changing.\n\nGood luck on your recovery <3",
          "created_utc": 1745631393.0
        }
      ]
    },
    {
      "id": "mp5k94d",
      "author": "AsleepCheesecake584",
      "body": "Thanks so much for sharing, idk why but just knowing that other people understand what it's like feels comforting bc it's like we're not alone in this struggle. I had a similar experience, it was a friend's birthday party and the theme was just \"your best outfit\" and I had such a hard time because I practically gave up making myself look pretty after the weight gain from recovery. I tried wearing some of my bigger/loose clothes but even at that point, it didn't even fit the theme. I remember a couple of my friends being a little disappointed because I didn't dress up but I just didn't have the confidence to wear my usual style of crop tops and mini skirts. \n\nI definitely think it's easier to look for people on Pinterest or TikTok with a more realistic body type (a body type similar to yourself), and see how certain clothes look on them before buying the clothes yourself so you can save yourself the frustration of trying it on, hating it, and reselling it 😪 \n\nI've been following curvier fashion influencers to see how certain outfits look and I think it kind of helps as unconscipis exposure therapy almost? Like I'm getting a little more used to my thicker body after seeing beautiful fashionable who are just as thick as I am whereas before I would look at super skinny models in runway shows & I think that's where I got this idea in my head that I needed to be as skinny as them to \"pull off\" wearing certain things. But you DONT.",
      "created_utc": 1745679056.0,
      "score": 2,
      "context": [
        {
          "id": "mp3ymga",
          "author": "vodkawaterbox",
          "body": "I 100% feel this. I most literally bought new clothes for summer, hated how I looked in them now, and then ended up selling and giving away all my old clothes I used to love wearing out. I don't want to be seen in anything other than sweatpants and hoodies, and even in these I feel insecure. Nowadays if I go out I end up wearing a cute top, maybe a skirt, but also paired with a leather jacket and knee high boots, so a minimum amount of my body is actually showing. If you look around of inspiration, there's always something you can throw together to make you look and feel cute but at the same time not stepping out of your comfort zone in regards to how you feel in your body. You're not alone, but we're all in this together! :(",
          "created_utc": 1745651744.0
        }
      ]
    },
    {
      "id": "mp0d5gb",
      "author": "AsleepCheesecake584",
      "body": "thank you but i think you may have misunderstood me, i was underweight due to a lack of eating, now i am at a healthy weight, even if i went to the gym and got really lean, i dont think ill be able to fit into my old clothes. \n\nBut regardless, thanks for the kind words",
      "created_utc": 1745604118.0,
      "score": 4,
      "context": [
        {
          "id": "mozqlk3",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1745597656.0
        }
      ]
    },
    {
      "id": "mp1biwx",
      "author": "theredsongstress",
      "body": "I think in modeling I've heard the excuse you're supposed to be rail thin because you're the \"hanger.\" But honestly I think all bodies are the \"hanger\" if you dress well. Like, I don't see someone in cool clothing walking around and go \"oh wow they're so skinny/fat,\" I just go \"oh wow awesome outfit.\" I generally don't clock someone's size unless they're on extreme ends of the spectrum, and then it's not a judgement thing, it's just a fact I noticed. I'm sure some people's confidence comes from just not caring, but part of mine definitely comes from realizing that nobody else is noticing my body as much as I am, they're more likely to notice what I do to style it.",
      "created_utc": 1745614479.0,
      "score": 2,
      "context": [
        {
          "id": "moyj0ya",
          "author": "theredsongstress",
          "body": "Oh my God I relate so hard. I honestly went to the thrift store pretty early on and got some nice pieces second-hand. Stretchy stuff with lots of give in it (no jeans lol), things that weren't tight around the waist (empire waist dresses, loose crop tops), and things that still showed off the places I liked to show off (for me I liked things showing off my shoulders and hugging the bum). My old style, with a few modifications to accommodate my changing body. I still did have to purchase more clothes when my weight evened out, and I didn't do a full shop until my weight had redistributed, but just having some items to go with my leggings and baggy t shirts made me feel better. Buying second-hand is honestly great. It's better for the environment and your wallet, and it's fun (to me) to browse through all the items and find the stuff you love.\n\nAlso, I hope this isn't TMI, but once my weight did even out, I bought myself some nice lingerie and did my own boudoir shoot with the self timer on my phone. Nobody ever has to see these pics, they're just for you to look at and appreciate your new body and feel sexy. Even before my weight redistributed, this was fun. Don't focus on the places where you're bigger than before, find the things that you like. Not even weight-related things, maybe your hair is shinier or your skin is better or you just look overall more glowing. Stuff like that.\n\nI honestly felt a lot better once I could style myself and feel like \"me\" again. I hope the same goes for you!",
          "created_utc": 1745584043.0
        },
        {
          "id": "mp0cblr",
          "author": "AsleepCheesecake584",
          "body": "The private lingerie photos sound like a pretty good idea, I never even considered that, especially bc posting outfit pics online is definitely not an option for me anymore (I crave the likes and comments about my body too much I think it would cause a relapse) but having private photos of myself makes it so I can still partake in my hobby without the toxic aspects. Thank you for that advice! \n\nThe fashion industry is a lot more nowadays so it's nice to know people who also had issues with ed still continue to dress in their style with some modifications. I see many healthy and plus sized women rocking crop tops and mini skirts and they look super pretty and happy. I guess it's confidence that I'll build over time.",
          "created_utc": 1745603883.0
        }
      ]
    }
  ]
}