{
  "id": "1k80g1c",
  "subreddit": "EatingDisorders",
  "author": "SympathySecret799",
  "created_utc": 1745627979.0,
  "title": "I refuse to let my boyfriend touch me.",
  "selftext": "I've gained a lot of weight recently due to \"recovering\" as I'll call it. To be completely honest, I don't forsee this lasting very long. I only started this because I got so freaking sick of him complaining and saying that I couldn't hold conversations very well and only ever wanted to talk about food. Maybe I did it out of a \"this will show him\" kind of thing, because theres no way he wants to date someone overweight (or average weight, whatever, same thing). He has this friend who is really physically ill. Her doctors don't know what she has but she can barely eat anything at all and it shows... he recently sent me a whole bunch of photos from him in high school and once I saw her in one my heart sank to my stomach. I'm not sure why my brain tells me that he wants to be with her BECAUSE she's so deathly thin and now.. well, I'm just average. I don't want to do this to myself anymore. My ED brain wants me to look \"worse\" than she does.\n\npls give me advice. i just need a freaking hug.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1k80g1c/i_refuse_to_let_my_boyfriend_touch_me/",
  "score": 43,
  "num_comments": 8,
  "comments": [
    {
      "id": "mp38l8m",
      "author": "Justneedtowhoosh",
      "body": "Sending the most heartfelt hug your way ♥️ I can imagine it would be really hard trying to pursue recovery when your partner is critical of people who weigh more, whether he’s outright saying it or that is what you are perceiving from him. Have you tried talking to him about your concerns about how being able to pursue health and happiness feels really hard when you feel like he views any weight gain as negative? If you can’t have that conversation (combined with his hypercritical-ness), then I’d really recommend asking yourself if this is the right relationship for you and your wellbeing. There are sooo many other people out there who would genuinely care about your wellbeing and want you to pursue recovery to heal (and literally save your life), despite what weight changes as a result of doing that hard work. Choosing to not address it and staying in the relationship is absolutely throwing gas on a fire when it comes to recovery. You deserve someone who will like you because of who you are, not just because your weight is super low.",
      "created_utc": 1745638626.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mp4qoed",
      "author": "None",
      "body": "Its hard but you need to talk each of these issues out with him. I believe you may be projecting your feelings.",
      "created_utc": 1745668003.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mp3ekim",
      "author": "neopronoun_dropper",
      "body": "So you didn’t genuinely want to recover because of the damage you’re doing to your body by depriving it of nutrition? Of course that won’t last. You need to recognize that you can’t sustain the way your living long-term, and just because you say that he won’t want to be with you anymore if you’re at a higher weight, but that isn’t really true. Men are typically attracted to bodies that are fertile and underweight bodies are often too busy sustaining themselves to even consider sustaining another life. And your body needs nutrition and energy. Your brain needs it. Your hearts not in it, and you probably need someone to talk to about how you feel and how you can learn to take care of your body, and not focus on the way it looks or numbers it measures. ",
      "created_utc": 1745641169.0,
      "score": 18,
      "context": []
    },
    {
      "id": "mp4q764",
      "author": "urfavbandkid2009",
      "body": "I’m not sure what to say but I just hope everything gets better for you 🩷 stay strong",
      "created_utc": 1745667779.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mp60rik",
      "author": "praisejunno",
      "body": "I would recommend not being in a relationship until your committed to recovery, your still very sick. your mindset is not for recovery at all.",
      "created_utc": 1745684251.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mp5h9kr",
      "author": "chantclle",
      "body": "i’m in the same exact boat rn :(",
      "created_utc": 1745678093.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mp6664b",
      "author": "SympathySecret799",
      "body": "Yeah youre right i honestly dont want this for good reasons. i think a part of me does want to recover but i didnt even do this for me. thank you☺️",
      "created_utc": 1745685962.0,
      "score": 2,
      "context": [
        {
          "id": "mp3ekim",
          "author": "neopronoun_dropper",
          "body": "So you didn’t genuinely want to recover because of the damage you’re doing to your body by depriving it of nutrition? Of course that won’t last. You need to recognize that you can’t sustain the way your living long-term, and just because you say that he won’t want to be with you anymore if you’re at a higher weight, but that isn’t really true. Men are typically attracted to bodies that are fertile and underweight bodies are often too busy sustaining themselves to even consider sustaining another life. And your body needs nutrition and energy. Your brain needs it. Your hearts not in it, and you probably need someone to talk to about how you feel and how you can learn to take care of your body, and not focus on the way it looks or numbers it measures. ",
          "created_utc": 1745641169.0
        }
      ]
    },
    {
      "id": "mp668s7",
      "author": "SympathySecret799",
      "body": "im so sorry. we’re in this together. sending hugs ☺️☺️",
      "created_utc": 1745685985.0,
      "score": 1,
      "context": [
        {
          "id": "mp5h9kr",
          "author": "chantclle",
          "body": "i’m in the same exact boat rn :(",
          "created_utc": 1745678093.0
        }
      ]
    }
  ]
}