{
  "id": "1k8gaiv",
  "subreddit": "EatingDisorders",
  "author": "Ok_Application8440",
  "created_utc": 1745683275.0,
  "title": "Daughter (13, anorexic) wants out of new residential program",
  "selftext": "My 13-yr-old is in the grip of a really bad eating disorder (anorexia). Two hospital stays, two PHPs (briefly), three-month stint at a residential program. She's now in another residential program and is absolutely miserable and wants out. And in fact it does sound horrible -- fellow client spit food into napkin at lunch and no one noticed; cook or chef plays Spotify with ads and yesterday they loudly heard an ad for some diet pill. The comment from staff was \"we've talked to him but he does whatever he wants\".\n\nThe worst thing about it is it is not a recovery-positive environment at all it sounds like. One client drank all their supplement at a meal, prompting another to say \"Wow you drank that entire thing?\" . That sort of thing. \n\nShe has been there less than a week but I promised her to find a solution by Wednesday. She keeps claiming she can be at home and I haven't given her enough of a chance. Would i be insane to let her come home for a third time?? I'm a single mom and have another kid as well so just the meal prep involved is so hard for me, and the last two times she was here she did not do well. OTOH my other daughter, who's younger, really wants her sister home and keeps saying she can't go on without her sister (younger daughter has an anxiety disorder)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1k8gaiv/daughter_13_anorexic_wants_out_of_new_residential/",
  "score": 133,
  "num_comments": 61,
  "comments": [
    {
      "id": "mp67mnd",
      "author": "burnthatbridgewhen",
      "body": "Unless she’s at risk of self harm, I would suggest not allowing her to leave the program until you find another one. She has a serious eating disorder and is a child, you need to make the decisions that are best for her well being. Unless you can continue the refeeding program they have her on confidently, she should be residential. Have you tried to reach out to the program she’s in to advocate for your daughter?",
      "created_utc": 1745686411.0,
      "score": 211,
      "context": []
    },
    {
      "id": "mp67wdi",
      "author": "ThatpersonRobert",
      "body": "Although your daughter is young, and under the spell of her ED as well, it also sounds to me like she has had enough experiences with treatment to know what's going to feel hopeful to her and what's not.\n\nOf course perhaps she's just saying these things to avoid \"getting fat\" in treatment, but if she truly is discouraged by the program itself, then that is worth paying attention to.\n\nAs much as we may want to believe otherwise, some programs are better than others, so there's that.\n\nI know her sister wants to have her home, but given what seems to be the severity of her ED, perhaps the better question is if she should be in another program; one that she can feel more hopeful about ?",
      "created_utc": 1745686495.0,
      "score": 95,
      "context": []
    },
    {
      "id": "mp6niuo",
      "author": "beautifulday24",
      "body": "I wouldn’t suggest taking her out of treatment until you have a guaranteed plan in mind where she would go from there. You could check into other places, make some calls,  but if you just plan on taking her home what would be different this time? Some people do treatment for their kids at home but that’s takes full dedication and time and a good therapist, dietitian and doctor to work with through it all. It’s not an option for most people. You wouldn’t be just her parent you’d be part of her treatment team, her caregiver. It could affect your relationship too. And your relationship with other kids this could impact them. You’d need help, time off of work.",
      "created_utc": 1745691243.0,
      "score": 43,
      "context": []
    },
    {
      "id": "mp6nx5r",
      "author": "xuiy",
      "body": "I was looking for everything wrong at the facilities I was at, only with time after making some friends did I feel a lot better, but honestly most programs will have small problems like these. It’s easy to amplify a diet ad for example (I experienced the same thing!) and spiral because that’s all you’re thinking about. Also the other people there are sick too so disordered behavior from them is expected. The program should be correcting that type of resident behavior/monitoring the ads but part of recovery is also not being blinded from things that are upsetting - it’s learning to effectively process and move past those emotions.",
      "created_utc": 1745691366.0,
      "score": 30,
      "context": []
    },
    {
      "id": "mp6kjw7",
      "author": "AstronautFickle4118",
      "body": "There are no perfect programs out there and she won’t be in treatment with perfect people. Bring your concerns to her treatment team and give them a chance to address them. Especially since she’s been there less than a week. If you can address this eating disorder while she’s still young she has a much much much higher chance of reaching lasting recovery.",
      "created_utc": 1745690328.0,
      "score": 55,
      "context": []
    },
    {
      "id": "mp7933k",
      "author": "okaysweaty167",
      "body": "My parents pulled me out of five different treatment centers because I have attachment issues and was homesick, and I deeply regret this. I feel very confident I would’ve recovered faster had I actually finished the treatment course. Honestly, basically every center is like this. There’s almost always gonna be staff that are uneducated and patients who are stuck and want to trigger everyone. I think the question you should ask yourself is if there is anything left you think she could learn at a residential that she couldn’t learn in outpatient.",
      "created_utc": 1745698212.0,
      "score": 28,
      "context": []
    },
    {
      "id": "mp7fbhp",
      "author": "dewaldlouw",
      "body": "There will also be triggers at other residential inpatient settings. Committing to treatment (and learning to deal with these triggers) are most important.",
      "created_utc": 1745700219.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mp6olic",
      "author": "Wtfisthis66",
      "body": "There is no perfect place for your daughter to recover. I have been in her place and have said the same things your daughter is telling you. She is looking for an escape route, don’t provide her with one.",
      "created_utc": 1745691575.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mp6h9z3",
      "author": "Ashamed_Ad8162",
      "body": "If it’s not the right fit, then it’s not the right fit. Do not let her free fall into outpatient care though, line up a new program for a transfer.",
      "created_utc": 1745689336.0,
      "score": 44,
      "context": []
    },
    {
      "id": "mp7zal0",
      "author": "Thinkngrl-70",
      "body": "As others have said, suffering from anorexia without the proper level of supervision could mean life or death. She is in the throes of an ED, so I’m not sure I’d expect her to be happy or to have good insight right now.\n\nI would try speaking with clinical staff first and letting them know exactly what your reservations are with the program. They are charging insurance a large sum and should be very concerned about keeping parents happy. \n\nMeanwhile, look around, and if the clinician isn’t helpful, ask to speak with the supervisor and on up if needed.\n\nSpeaking as a mom with experience (teen son), the ED will try all kinds of ways to manipulate your feelings, especially guilt.",
      "created_utc": 1745706941.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mp6nwbs",
      "author": "xxflutterinax",
      "body": "potentially look up the program in the r/troubledteens directory of residential programs. i believe they have some guidelines for evaluating programs in general but you might also post there since the entire subreddit is dedicated to this kind of thing. \nit’s hard when someone you love is struggling with safety, i hope your daughter feels better soon.",
      "created_utc": 1745691359.0,
      "score": 16,
      "context": []
    },
    {
      "id": "mp67rjf",
      "author": "slut4hobi",
      "body": "i don’t have any real advice, but i’m sorry this is so stressful. i know what it’s like to be stuck somewhere like her, but i also know what it’s like to wonder if it’s the right decision for a loved one to be keep being somewhere like that. much love 💜",
      "created_utc": 1745686453.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mp70kvt",
      "author": "Creepy_Ad_3132",
      "body": "This happened to my sister. She kept begging my mum to let her leave (single mum like you) and so mum did. Now they regret it 15 years on, still fighting with an ED.\nThey will fight you. Of course she'll hate it, as the eating disorder hates it. Stay strong. You have so much to deal with, and it isn't fair you have to shoulder this alone, but you can do it. Xx",
      "created_utc": 1745695388.0,
      "score": 15,
      "context": []
    },
    {
      "id": "mp9s6fh",
      "author": "None",
      "body": "Dad of a formerly anorexic daughter. Terrifying disease. We tried inpatient but ultimately went with family counseling. Thank God she recovered. Mostly by time and maturing. Don't know if I can give you any better advice than take care of yourself.",
      "created_utc": 1745733576.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mp84m03",
      "author": "fernbbyfern",
      "body": "Therapist at an ED RTC here: have you corroborated these instances with staff? Does the treatment team have anything to say about these? Or is all of this just from your daughter?\n\nNot every RTC is supportive, that’s for sure. But I’m sure you now know that the ED is going to say whatever it can to have you pull your daughter out of treatment.",
      "created_utc": 1745708748.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mp84nnx",
      "author": "shybooty",
      "body": "From my personal experience in both residential and PHP programs as a minor and also as an adult- treatment is hard and not everyone is ready to accept help ESPECIALLY younger kids (I myself was extremely difficult to work with). I would not allow them out even if they are begging. These places are good for monitering in terms of safety. I agree with other posters that its best to have another program lined up. \n\n\nAlso, I’m not sure where you live and how your insurance works- but in my experience, if you were to leave treatment or take a child out of treatment AMA (against medical advice) it can affect future treatment options as your insurance may see that you did not “need” the treatment as its a waste of their money and may make it harder to get coverage for other treatment.\n\n\nI would complain to the director and other higher ups about the behavior of staff and the poor quality of care. That’s really all I can suggest, unfortunately. Some hospitals are pure shit and some are fantastic. Listen to your childs complaints and take them seriously, but don’t take them out.\nSorry for long message- just want to give my advice best as possible",
      "created_utc": 1745708765.0,
      "score": 11,
      "context": []
    },
    {
      "id": "mp7b7ie",
      "author": "spanielgurl11",
      "body": "She can stay until she’s healthy unless you find an alternative. Anorexia is deadly.",
      "created_utc": 1745698904.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mp9th0s",
      "author": "averym88",
      "body": "At the beginning of my treatment journey, I said this about every single inpatient facility I went to. I was in four different ones before someone finally told my mom that it's completely normal for patients to exaggerate or make claims of mistreatment. Not saying that’s what's happening here, but it’s something to keep in mind.",
      "created_utc": 1745734329.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mpagpl6",
      "author": "houston_veronica",
      "body": "So many good thoughts and replies on both sides, but here is my own POV. I had untreated AN for the entirety of 13 years before my family intervened formally and I took the help. When I got to the residential setting, there were so many crazy dramatic things happening; people were so far beyond my understanding of 'normal life', and I felt sure that my sheltered mother would hate that I was there...being exposed to 'rough' life. (I was 44 BTW). I would tell my H. that \"if people knew what I'm seeing, what I'm hearing, and how they treat us, they would want me out ASAP.' - Truthfully, that was the ED finding the proverbial 'hair in the soup'. \n\nNo, there is no treatment program that will ever be perfect. Quite a few tech staff at my program were awful to us. I wasn't allowed to rest even when we had 2 hours of sleep only; I wasn't allowed to be happy if staff were upset, as they would just glare and be rude. They would be snippy, rub my face in the fact that I needed to take the supplement (which was in addition to huge meal plan), be sarcastic, pick favorites, and more. \n\n  \nIt still was the best option available, however. No other place would take me, and this place - for all its flaws - still made a major impact for the better.  It's the lesser of the greatest evil - no help at all, and eventual death.\n\nWhy are the attending staff at Res treatment centers so awful? they are burnt out, sick of ED lying/manipulating, and they themselves may not fully understand how EDs are. In addition, the requisite measures to break down the power of an ED are often necessarily draconian. The tiniest bit of wiggle room will turn into a highway of enabling. Those who are starving cannot make logical decisions that threaten their propensity to starve. Once a person is refed and restored to a livable weight, only then can they start to be trusted to make decisions for themselves.",
      "created_utc": 1745748722.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mpbbghm",
      "author": "No-Rich1739",
      "body": "Mama, you’re doing the right thing! I am 33 and have an awful eating disorder that started around the age of 15. I wish desperately that somebody would’ve encouraged me to go to treatment. Treatment may not work for her, and I’m not gonna lie. Treatment can be complete bullshit sometimes, but it does force you to gain weight.You’re in for the long-haul, this disease tends to re-emerge, regardless of treatment. Just love her, be there for her and no that this is similar to something along the lines of a drug addiction. It’s so so hard to break it.",
      "created_utc": 1745762634.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mp7n5qc",
      "author": "TheCatsMeowNYC",
      "body": "Single mom here. My daughter battled anorexia a few years ago. Is she in a state where her health is in critical condition that if she did out-patient she could be in a critical, life-threatening condition? Mine was at a stage where the potential of her body shutting down was real but she absolutely did not want to go to a residence.\n\nWe enrolled in a program where she attended 5 days a week during the day, there were twice weekly family dinners and a 3x/week therapy sessions. While she was home, I had to feed her 3 big meals a day plus snacks every 2 hours. All the meal prep and trips back and forth put a huge amount of stress on me, especially as I work a full time job. If this is an option for you, and again she is not in critical condition, maybe try again? Talk to her doctors. Have faith. We finally dug ourselves out of this but it was a 24/7 job we both had to commit to for a better part of a year. Sending you (((hugs))",
      "created_utc": 1745702799.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mp8379e",
      "author": "Anonim_x9",
      "body": "Just don’t bringe her home. I was a kid with ed once. If you snark into some subreddits, it’s super clear. We will lie and do everything to not gain weight, to not recover. She could be totally making EVERYTHING up she claims happens. And if she’s home it’s just going to be easier for her to trow out food, hide it, purge it somewhere, do exercises at night to get rid of calories ect",
      "created_utc": 1745708262.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mp7zfjw",
      "author": "sadclipart",
      "body": "I was in many abusive programs for many years and when I finally got out I got better. There are bad ones and good ones. In the bad ones you just learn how to be worse. When you’re 13 the older girls teach you things you would have never learned, things that a parent couldn’t even imagine. Please save her.",
      "created_utc": 1745706991.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mp756ft",
      "author": "Freely_Unwilling",
      "body": "Definitely finding another solution is best. Probably another program. Home is not a good idea, I’ve been through this with my mom. I’d always say I’d be better. I meant it but once you’re out, once you’re away from the prison that treatment seems to be your ED is the loudest thing in you’re head",
      "created_utc": 1745696921.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mp8djwj",
      "author": "OctopuBanana",
      "body": "Let her go, listen to her and try to understand why she does this to herself. In patient does not work unless people explicitly need it and asked for it. Eating disorders are about control and by forcing people in patient, their control is taken away",
      "created_utc": 1745711905.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mp9zgc9",
      "author": "PotentialBed4441",
      "body": "Definitely get her out of there and maybe into a treatment centre suitable for kids/teenagers \n\nObviously, I don't know if that's something available to you. I wouldn't move her, however, until you have a new treatment set up unless you are worried for her immediate safety.",
      "created_utc": 1745737881.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpa91ag",
      "author": "J_Strange05",
      "body": "As bad as this is, there are programs out there known for much worse.  Unfortunately most of this sounds pretty typical of the residential programs people I know have gone to.",
      "created_utc": 1745743809.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mplllgt",
      "author": "snowymarch2",
      "body": "I was a girl who was inpatient at a place like this when i was either 13 or 14 (ive been to a few places and can't always remember which one was when). Take her out of this residential treatment. It will make it worse. A lot worse. It did for me. HOWEVER - get her into somewhere else immediately. Anorexia is so, so serious and if she hasn't done well at home before she shouldn't come home again until she's proven that she's ready. And this is coming from a place of understanding and love. I know how hard it is for her and for you. Making decisions - her, about eating and recovering; you - trying to figure out how to care for your baby. This is just my personal opinion.",
      "created_utc": 1745896860.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mpu6w8f",
      "author": "doggosarecoolsoyeah",
      "body": "Take her out, simple as that. And find something new, or have something lined up. You’re a good mom, but also being home won’t be beneficial! She’s not the culprit here. There can be lying, but your daughter sounds smart. I’ve been through it too, with parents who were abusive and dismissive. My diagnosis of PTSD isn’t fun and I don’t want it for your daughter. She an adolescent which makes it harder but please please please look into other programs because adolescent programs aren’t as researched as adult ones (I’m 23 now) Check out Newport Healthcare, avoid hospital and Stanford programs.",
      "created_utc": 1746020345.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mp8gpyp",
      "author": "Julietjane01",
      "body": "As a person with an ED we always say we want another chance. We are convinced that that will change everything but it doesnt. I would speak to her team there and give what they say some weight also. No residential is going to be fun. You have to go to the bathroom with door open for awhile for example. It sucks but when you gain enough weight things get clearer sometimes.",
      "created_utc": 1745713103.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mp7a82s",
      "author": "lynk_n_logs",
      "body": "Yikes, that sounds like a terrible program if that is happening. I've had similar experiences at some clinics. If you can find another program to take her, I'd suggest moving her there. However, considering that her disorder could have life threatening consequences, she is much safer in a facility with medical staff than she is at home. I used to beg my parents to take me home but I know I would've just started using my behaviors again.",
      "created_utc": 1745698586.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mug25c1",
      "author": "Lazy-Length-1970",
      "body": "Was this ERC?",
      "created_utc": 1748311099.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mpbd3zt",
      "author": "pennybeagle",
      "body": "Pull her now. Those residential programs may save her life in the short term but unfortunately she needs to figure things out for herself to thrive long-term with a good support system in place. Keep in mind that helicopter parenting and these programs only make it worse and grouping girls together that all have EDs will make them better at concealing their weight loss techniques and contributing to the problem.\n\nIt would be extremely helpful to see a family psychologist to examine your family dynamic and see if something at home is triggering her. In my experience (and this isn’t being said to blame or accuse you), mentally unwell, controlling, and/or cruel mothers (even if not intentionally) will set off EDs.\n\nI’d also think it’s worth seeing a psychiatrist to see if something like Zoloft would help whatever is affecting her mentally since it has the added side effect of weight gain",
      "created_utc": 1745763202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mp7knm6",
      "author": "drdaffodil",
      "body": "Is your family in a position to do family based treatment (FBT)? I’m a psychologist and often find FBT to be a really good option at that age if the family can do it",
      "created_utc": 1745701949.0,
      "score": -1,
      "context": []
    },
    {
      "id": "mpeiic4",
      "author": "SenseIntelligent4154",
      "body": "I feel the hospitals and programs were more harmful to my daughter and regret having her in them. She is very traumatized from them and still working hard at recovery.",
      "created_utc": 1745799217.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mp8lw2a",
      "author": "lovelifetofullest",
      "body": "What you just explained as bad experiences (over hearing an add on the chefs radio, another girl who is sick had a moment of weakness and spit into her napkin” is not bad at all. That’s crazy you would even agree with your daughter that those issues are a big deal. Rehabs are not easy, and unless you can afford to be in your own, then you will have to deal with other people that are sick too. Sounds like a lot of excuses, but if you think she’s fine to come home, then yeah I guess pack up so she doesn’t have to hear another add again. Life is triggering, if you can’t handle it, then forget rehab and trying to get better, just go home. Rehab isn’t a walk in the park.",
      "created_utc": 1745715053.0,
      "score": -1,
      "context": []
    },
    {
      "id": "mp7m5su",
      "author": "ShiaLabeoufsNipples",
      "body": "Also, I hate to bring this up but I’m speaking from experience. Kids with EDs will often lie about what goes on in these programs to try and get home early.\n\nNot necessarily saying that’s what OPs daughter is doing, but it’s unwise to blindly trust someone in the throes of an eating disorder. Anorexia drives us to do *anything and everything* to avoid getting better, lying is not exempt from that.\n\nJust something to think about and be aware of while making next steps.",
      "created_utc": 1745702459.0,
      "score": 142,
      "context": [
        {
          "id": "mp67mnd",
          "author": "burnthatbridgewhen",
          "body": "Unless she’s at risk of self harm, I would suggest not allowing her to leave the program until you find another one. She has a serious eating disorder and is a child, you need to make the decisions that are best for her well being. Unless you can continue the refeeding program they have her on confidently, she should be residential. Have you tried to reach out to the program she’s in to advocate for your daughter?",
          "created_utc": 1745686411.0
        }
      ]
    },
    {
      "id": "mpe8nyn",
      "author": "Lindsey7618",
      "body": "Since she mentioned what the staff said about the chef, it sounds like she has already reached out to them.",
      "created_utc": 1745795722.0,
      "score": 3,
      "context": [
        {
          "id": "mp67mnd",
          "author": "burnthatbridgewhen",
          "body": "Unless she’s at risk of self harm, I would suggest not allowing her to leave the program until you find another one. She has a serious eating disorder and is a child, you need to make the decisions that are best for her well being. Unless you can continue the refeeding program they have her on confidently, she should be residential. Have you tried to reach out to the program she’s in to advocate for your daughter?",
          "created_utc": 1745686411.0
        }
      ]
    },
    {
      "id": "mp6fbr6",
      "author": "Vivid-Society-7117",
      "body": "Yeah the best scenario would be get her in a better program but as you probably know that’s easier said than done ",
      "created_utc": 1745688754.0,
      "score": 38,
      "context": [
        {
          "id": "mp67wdi",
          "author": "ThatpersonRobert",
          "body": "Although your daughter is young, and under the spell of her ED as well, it also sounds to me like she has had enough experiences with treatment to know what's going to feel hopeful to her and what's not.\n\nOf course perhaps she's just saying these things to avoid \"getting fat\" in treatment, but if she truly is discouraged by the program itself, then that is worth paying attention to.\n\nAs much as we may want to believe otherwise, some programs are better than others, so there's that.\n\nI know her sister wants to have her home, but given what seems to be the severity of her ED, perhaps the better question is if she should be in another program; one that she can feel more hopeful about ?",
          "created_utc": 1745686495.0
        }
      ]
    },
    {
      "id": "mp6oye0",
      "author": "beautifulday24",
      "body": "Also if she was at home and refused to eat and she needed a feeding tube? You’d need to have a lot of knowledge and help and could be something that most people aren’t able to do. What if you catch her purging or using other behaviors or has serious health issues? I mean treatment has issues. There’s no perfect help or scenario. If she’s in treatment though and it’s not outpatient then there’s a chance being at home wouldn’t be best.",
      "created_utc": 1745691684.0,
      "score": 16,
      "context": [
        {
          "id": "mp6niuo",
          "author": "beautifulday24",
          "body": "I wouldn’t suggest taking her out of treatment until you have a guaranteed plan in mind where she would go from there. You could check into other places, make some calls,  but if you just plan on taking her home what would be different this time? Some people do treatment for their kids at home but that’s takes full dedication and time and a good therapist, dietitian and doctor to work with through it all. It’s not an option for most people. You wouldn’t be just her parent you’d be part of her treatment team, her caregiver. It could affect your relationship too. And your relationship with other kids this could impact them. You’d need help, time off of work.",
          "created_utc": 1745691243.0
        }
      ]
    },
    {
      "id": "mpa4wox",
      "author": "Justneedtowhoosh",
      "body": "I would say that someone voicing judgment over another client completing a supplement is going to be far more triggering than even being in the “real world” and hearing someone without an eating disorder casting judgement about food onto another person without an eating disorder. Everything within a 24/7 level of care should be supportive of following a meal plan. But other things like the diet ads? Those happen IRL in the same or similar manner-that’s not anything worth taking action over. And someone hiding food at least is limited to themselves. I’d hope that the program is addressing toxicity within the milieu, which isn’t something the daughter may even be aware of. I think it would be good to talk to the program about concerns like that and if change isn’t happening, then pursue another residential program where she may have a better shot at a more positive milieu.",
      "created_utc": 1745741211.0,
      "score": 7,
      "context": [
        {
          "id": "mp6nx5r",
          "author": "xuiy",
          "body": "I was looking for everything wrong at the facilities I was at, only with time after making some friends did I feel a lot better, but honestly most programs will have small problems like these. It’s easy to amplify a diet ad for example (I experienced the same thing!) and spiral because that’s all you’re thinking about. Also the other people there are sick too so disordered behavior from them is expected. The program should be correcting that type of resident behavior/monitoring the ads but part of recovery is also not being blinded from things that are upsetting - it’s learning to effectively process and move past those emotions.",
          "created_utc": 1745691366.0
        }
      ]
    },
    {
      "id": "mpe9zol",
      "author": "Lindsey7618",
      "body": "I really don't think the answer is to leave them in a program if it's actually harmful and \"pure shit\" as you described. Addressing issues is always a good first step, but there are a lot of treayment centers/programs that are harmful. I actually strongly disagree with the way many programs are run and the \"one treatment fits all\" mentality they have (one of the reasons I'm getting my degree to be a therapist. This is a topic I've discussed in my social work classes so I'm not just talking out of my ass. The peofessors I've discussed this with in classes are actual therapists and social workers.)",
      "created_utc": 1745796184.0,
      "score": 1,
      "context": [
        {
          "id": "mp84nnx",
          "author": "shybooty",
          "body": "From my personal experience in both residential and PHP programs as a minor and also as an adult- treatment is hard and not everyone is ready to accept help ESPECIALLY younger kids (I myself was extremely difficult to work with). I would not allow them out even if they are begging. These places are good for monitering in terms of safety. I agree with other posters that its best to have another program lined up. \n\n\nAlso, I’m not sure where you live and how your insurance works- but in my experience, if you were to leave treatment or take a child out of treatment AMA (against medical advice) it can affect future treatment options as your insurance may see that you did not “need” the treatment as its a waste of their money and may make it harder to get coverage for other treatment.\n\n\nI would complain to the director and other higher ups about the behavior of staff and the poor quality of care. That’s really all I can suggest, unfortunately. Some hospitals are pure shit and some are fantastic. Listen to your childs complaints and take them seriously, but don’t take them out.\nSorry for long message- just want to give my advice best as possible",
          "created_utc": 1745708765.0
        }
      ]
    },
    {
      "id": "mpecfk3",
      "author": "Lindsey7618",
      "body": "Staff that treats patients like that should not be working in the mental health field period. I'm sorry that that happened to you. That's not an excuse for the way they treat people though. I don't understand people who say the program has flaws or isn't perfect or some staff is abusive but let's it go and doesn't do anything. We should be advocating for better programs, better staff, better training.\n\nYou should not be allowed to work at an eating disorder treatment center or program if you don't have at the very least basic training on EDs but frankly, I'd argue extensive training. This is a deadly illness, and it requires extensive training. \n\nBurn out is real in this field, but for example, social workers and therapists have a license. Treating patients this way could get them fired or get their licensed removed. Social workers have a code of ethics they must follow. When you feel yourself getting burnt out, tou have to take extra care to make sure that's not reflecting in the way you treat your patients or affecting them because that is highly unethical and inappropriate. You need to take a step back and figure something out in that situation. \n\nI understand a lot of those staff members aren't licensed and aren't actual therapists or social workers, but it doesn't change how it affects patients so they should be held to the same standards of care.",
      "created_utc": 1745797042.0,
      "score": 3,
      "context": [
        {
          "id": "mpagpl6",
          "author": "houston_veronica",
          "body": "So many good thoughts and replies on both sides, but here is my own POV. I had untreated AN for the entirety of 13 years before my family intervened formally and I took the help. When I got to the residential setting, there were so many crazy dramatic things happening; people were so far beyond my understanding of 'normal life', and I felt sure that my sheltered mother would hate that I was there...being exposed to 'rough' life. (I was 44 BTW). I would tell my H. that \"if people knew what I'm seeing, what I'm hearing, and how they treat us, they would want me out ASAP.' - Truthfully, that was the ED finding the proverbial 'hair in the soup'. \n\nNo, there is no treatment program that will ever be perfect. Quite a few tech staff at my program were awful to us. I wasn't allowed to rest even when we had 2 hours of sleep only; I wasn't allowed to be happy if staff were upset, as they would just glare and be rude. They would be snippy, rub my face in the fact that I needed to take the supplement (which was in addition to huge meal plan), be sarcastic, pick favorites, and more. \n\n  \nIt still was the best option available, however. No other place would take me, and this place - for all its flaws - still made a major impact for the better.  It's the lesser of the greatest evil - no help at all, and eventual death.\n\nWhy are the attending staff at Res treatment centers so awful? they are burnt out, sick of ED lying/manipulating, and they themselves may not fully understand how EDs are. In addition, the requisite measures to break down the power of an ED are often necessarily draconian. The tiniest bit of wiggle room will turn into a highway of enabling. Those who are starving cannot make logical decisions that threaten their propensity to starve. Once a person is refed and restored to a livable weight, only then can they start to be trusted to make decisions for themselves.",
          "created_utc": 1745748722.0
        }
      ]
    },
    {
      "id": "mpuhi6f",
      "author": "Vivid-Society-7117",
      "body": "Thank you and best of luck to you ",
      "created_utc": 1746023648.0,
      "score": 1,
      "context": [
        {
          "id": "mpbbghm",
          "author": "No-Rich1739",
          "body": "Mama, you’re doing the right thing! I am 33 and have an awful eating disorder that started around the age of 15. I wish desperately that somebody would’ve encouraged me to go to treatment. Treatment may not work for her, and I’m not gonna lie. Treatment can be complete bullshit sometimes, but it does force you to gain weight.You’re in for the long-haul, this disease tends to re-emerge, regardless of treatment. Just love her, be there for her and no that this is similar to something along the lines of a drug addiction. It’s so so hard to break it.",
          "created_utc": 1745762634.0
        }
      ]
    },
    {
      "id": "mpea9et",
      "author": "Lindsey7618",
      "body": "This is true, but it's also dangerous advice to tell someone to not take claims of mistreatment, neglect, abuse, etc right. You should still take your child seriously while not just giving in the second they make complaints. Speak to the program staff/director, attempt to address the issues.",
      "created_utc": 1745796279.0,
      "score": 1,
      "context": [
        {
          "id": "mp8379e",
          "author": "Anonim_x9",
          "body": "Just don’t bringe her home. I was a kid with ed once. If you snark into some subreddits, it’s super clear. We will lie and do everything to not gain weight, to not recover. She could be totally making EVERYTHING up she claims happens. And if she’s home it’s just going to be easier for her to trow out food, hide it, purge it somewhere, do exercises at night to get rid of calories ect",
          "created_utc": 1745708262.0
        }
      ]
    },
    {
      "id": "mp7df97",
      "author": "Vivid-Society-7117",
      "body": "I think you’re exactly right and it’s just so sad ",
      "created_utc": 1745699610.0,
      "score": 2,
      "context": [
        {
          "id": "mp756ft",
          "author": "Freely_Unwilling",
          "body": "Definitely finding another solution is best. Probably another program. Home is not a good idea, I’ve been through this with my mom. I’d always say I’d be better. I meant it but once you’re out, once you’re away from the prison that treatment seems to be your ED is the loudest thing in you’re head",
          "created_utc": 1745696921.0
        }
      ]
    },
    {
      "id": "mpllsop",
      "author": "snowymarch2",
      "body": "I do want to make one thing clear - switch her from place to place. I don't think time at home (any time at all) will be beneficial for her, and might be harmful.",
      "created_utc": 1745896936.0,
      "score": 2,
      "context": [
        {
          "id": "mplllgt",
          "author": "snowymarch2",
          "body": "I was a girl who was inpatient at a place like this when i was either 13 or 14 (ive been to a few places and can't always remember which one was when). Take her out of this residential treatment. It will make it worse. A lot worse. It did for me. HOWEVER - get her into somewhere else immediately. Anorexia is so, so serious and if she hasn't done well at home before she shouldn't come home again until she's proven that she's ready. And this is coming from a place of understanding and love. I know how hard it is for her and for you. Making decisions - her, about eating and recovering; you - trying to figure out how to care for your baby. This is just my personal opinion.",
          "created_utc": 1745896860.0
        }
      ]
    },
    {
      "id": "mpug9zy",
      "author": "Vivid-Society-7117",
      "body": "Thank you. I’m extremely frustrated about how hard it is to find good eating disorder programs for adolescents that don’t have two-month waitlists, or don’t mix eating disorder patients with kids with all other kinds of mental illnesses, or don’t have weirdly wide age ranges (8-17? What??) Or group sizes that seem unacceptably large (20 in a cohort??)\n\nI feel like I might have already complained about this in another response so apols if I’m repeating myself but: Why aren’t there more programs??? The demand is clearly there. I don’t get it. ",
      "created_utc": 1746023279.0,
      "score": 2,
      "context": [
        {
          "id": "mpu6w8f",
          "author": "doggosarecoolsoyeah",
          "body": "Take her out, simple as that. And find something new, or have something lined up. You’re a good mom, but also being home won’t be beneficial! She’s not the culprit here. There can be lying, but your daughter sounds smart. I’ve been through it too, with parents who were abusive and dismissive. My diagnosis of PTSD isn’t fun and I don’t want it for your daughter. She an adolescent which makes it harder but please please please look into other programs because adolescent programs aren’t as researched as adult ones (I’m 23 now) Check out Newport Healthcare, avoid hospital and Stanford programs.",
          "created_utc": 1746020345.0
        }
      ]
    },
    {
      "id": "mpcy1tf",
      "author": "lovelifetofullest",
      "body": "Listen I have spent a lot of time in rehab, and it’s never fun, but it helps. What doesn’t help is when my mom tells me “oh I’m so sorry, you should come home. This is too hard for you” then I start pitying myself. I wish my mom had been tougher and said “tough luck” this is the real world and you need to learn how to navigate it. That’s the only thing that would have worked for me, luckily my dad and boyfriend didn’t let me make excuses.",
      "created_utc": 1745780805.0,
      "score": 0,
      "context": [
        {
          "id": "mp8lw2a",
          "author": "lovelifetofullest",
          "body": "What you just explained as bad experiences (over hearing an add on the chefs radio, another girl who is sick had a moment of weakness and spit into her napkin” is not bad at all. That’s crazy you would even agree with your daughter that those issues are a big deal. Rehabs are not easy, and unless you can afford to be in your own, then you will have to deal with other people that are sick too. Sounds like a lot of excuses, but if you think she’s fine to come home, then yeah I guess pack up so she doesn’t have to hear another add again. Life is triggering, if you can’t handle it, then forget rehab and trying to get better, just go home. Rehab isn’t a walk in the park.",
          "created_utc": 1745715053.0
        }
      ]
    },
    {
      "id": "mpa3q8t",
      "author": "Justneedtowhoosh",
      "body": "I think it would be smart to inform the daughter that you can find her another program. Home does not sound like the right fit for her at this time. Then, if she is lying about the program, she wouldn’t be incentivized to do so to get out of being in treatment-because her options are to either stay there, or go to another program. And honestly, it’s hard to know if she is saying things to get home or if they are actually happening. Finding a new facility satisfies both scenarios anyhow. And I wouldn’t be too quick to dismiss her concerns, these things do happen, especially in programs where staff are allowing these things to happen and not holding firm boundaries. If she is really recovery focused, a new program would probably help her a good amount. It’s hard to stay motivated in an environment where other clients are heavily using behaviors (and getting away with it) and voicing judgment about other’s intake.",
      "created_utc": 1745740497.0,
      "score": 27,
      "context": [
        {
          "id": "mp67mnd",
          "author": "burnthatbridgewhen",
          "body": "Unless she’s at risk of self harm, I would suggest not allowing her to leave the program until you find another one. She has a serious eating disorder and is a child, you need to make the decisions that are best for her well being. Unless you can continue the refeeding program they have her on confidently, she should be residential. Have you tried to reach out to the program she’s in to advocate for your daughter?",
          "created_utc": 1745686411.0
        },
        {
          "id": "mp7m5su",
          "author": "ShiaLabeoufsNipples",
          "body": "Also, I hate to bring this up but I’m speaking from experience. Kids with EDs will often lie about what goes on in these programs to try and get home early.\n\nNot necessarily saying that’s what OPs daughter is doing, but it’s unwise to blindly trust someone in the throes of an eating disorder. Anorexia drives us to do *anything and everything* to avoid getting better, lying is not exempt from that.\n\nJust something to think about and be aware of while making next steps.",
          "created_utc": 1745702459.0
        }
      ]
    },
    {
      "id": "mp8tmnw",
      "author": "Bpdanoressiangel",
      "body": "Can I just highlight a probably even bigger percentage of us aren't lying. Lots of clinics and programmes for eds (and any mental illness) are neglectful or outright emotionally and in some cases physically abusive. So many leave these places more more trauma and a more intense fear of further help🤍🤍 - btw this is meant purely as a kind reminder",
      "created_utc": 1745718031.0,
      "score": 60,
      "context": [
        {
          "id": "mp67mnd",
          "author": "burnthatbridgewhen",
          "body": "Unless she’s at risk of self harm, I would suggest not allowing her to leave the program until you find another one. She has a serious eating disorder and is a child, you need to make the decisions that are best for her well being. Unless you can continue the refeeding program they have her on confidently, she should be residential. Have you tried to reach out to the program she’s in to advocate for your daughter?",
          "created_utc": 1745686411.0
        },
        {
          "id": "mp7m5su",
          "author": "ShiaLabeoufsNipples",
          "body": "Also, I hate to bring this up but I’m speaking from experience. Kids with EDs will often lie about what goes on in these programs to try and get home early.\n\nNot necessarily saying that’s what OPs daughter is doing, but it’s unwise to blindly trust someone in the throes of an eating disorder. Anorexia drives us to do *anything and everything* to avoid getting better, lying is not exempt from that.\n\nJust something to think about and be aware of while making next steps.",
          "created_utc": 1745702459.0
        }
      ]
    },
    {
      "id": "mp6j2py",
      "author": "ThatpersonRobert",
      "body": "Yes, one of those \"in a perfect world\" things for sure.",
      "created_utc": 1745689878.0,
      "score": 8,
      "context": [
        {
          "id": "mp67wdi",
          "author": "ThatpersonRobert",
          "body": "Although your daughter is young, and under the spell of her ED as well, it also sounds to me like she has had enough experiences with treatment to know what's going to feel hopeful to her and what's not.\n\nOf course perhaps she's just saying these things to avoid \"getting fat\" in treatment, but if she truly is discouraged by the program itself, then that is worth paying attention to.\n\nAs much as we may want to believe otherwise, some programs are better than others, so there's that.\n\nI know her sister wants to have her home, but given what seems to be the severity of her ED, perhaps the better question is if she should be in another program; one that she can feel more hopeful about ?",
          "created_utc": 1745686495.0
        },
        {
          "id": "mp6fbr6",
          "author": "Vivid-Society-7117",
          "body": "Yeah the best scenario would be get her in a better program but as you probably know that’s easier said than done ",
          "created_utc": 1745688754.0
        }
      ]
    },
    {
      "id": "mpnzvo7",
      "author": "Vivid-Society-7117",
      "body": "I think you’re totally right. It’s really frustrating how hard it is to find these places though, and we live in LA! I’m encountering 2 month waitlists everywhere I call ",
      "created_utc": 1745937434.0,
      "score": 2,
      "context": [
        {
          "id": "mplllgt",
          "author": "snowymarch2",
          "body": "I was a girl who was inpatient at a place like this when i was either 13 or 14 (ive been to a few places and can't always remember which one was when). Take her out of this residential treatment. It will make it worse. A lot worse. It did for me. HOWEVER - get her into somewhere else immediately. Anorexia is so, so serious and if she hasn't done well at home before she shouldn't come home again until she's proven that she's ready. And this is coming from a place of understanding and love. I know how hard it is for her and for you. Making decisions - her, about eating and recovering; you - trying to figure out how to care for your baby. This is just my personal opinion.",
          "created_utc": 1745896860.0
        },
        {
          "id": "mpllsop",
          "author": "snowymarch2",
          "body": "I do want to make one thing clear - switch her from place to place. I don't think time at home (any time at all) will be beneficial for her, and might be harmful.",
          "created_utc": 1745896936.0
        }
      ]
    },
    {
      "id": "mpugu2m",
      "author": "Vivid-Society-7117",
      "body": "That said I’m working on a couple decent options — one of which is in Utah! The idea that we would travel from Los Angeles to Utah to get ED treatment seems just counterintuitive and weird (but I guess worth it if the program is actually good and it’s all I can find)",
      "created_utc": 1746023446.0,
      "score": 1,
      "context": [
        {
          "id": "mpu6w8f",
          "author": "doggosarecoolsoyeah",
          "body": "Take her out, simple as that. And find something new, or have something lined up. You’re a good mom, but also being home won’t be beneficial! She’s not the culprit here. There can be lying, but your daughter sounds smart. I’ve been through it too, with parents who were abusive and dismissive. My diagnosis of PTSD isn’t fun and I don’t want it for your daughter. She an adolescent which makes it harder but please please please look into other programs because adolescent programs aren’t as researched as adult ones (I’m 23 now) Check out Newport Healthcare, avoid hospital and Stanford programs.",
          "created_utc": 1746020345.0
        },
        {
          "id": "mpug9zy",
          "author": "Vivid-Society-7117",
          "body": "Thank you. I’m extremely frustrated about how hard it is to find good eating disorder programs for adolescents that don’t have two-month waitlists, or don’t mix eating disorder patients with kids with all other kinds of mental illnesses, or don’t have weirdly wide age ranges (8-17? What??) Or group sizes that seem unacceptably large (20 in a cohort??)\n\nI feel like I might have already complained about this in another response so apols if I’m repeating myself but: Why aren’t there more programs??? The demand is clearly there. I don’t get it. ",
          "created_utc": 1746023279.0
        }
      ]
    },
    {
      "id": "mpuh120",
      "author": "doggosarecoolsoyeah",
      "body": "I have no clue. I was in the adult program at Newport, and some of the client who were barely 18 were complaining about age differences etc when they were in adolescent programs. If you need any help mama, I’m here. The health system is messed up, if you want resources, I can reach out to my contacts.",
      "created_utc": 1746023505.0,
      "score": 1,
      "context": [
        {
          "id": "mpu6w8f",
          "author": "doggosarecoolsoyeah",
          "body": "Take her out, simple as that. And find something new, or have something lined up. You’re a good mom, but also being home won’t be beneficial! She’s not the culprit here. There can be lying, but your daughter sounds smart. I’ve been through it too, with parents who were abusive and dismissive. My diagnosis of PTSD isn’t fun and I don’t want it for your daughter. She an adolescent which makes it harder but please please please look into other programs because adolescent programs aren’t as researched as adult ones (I’m 23 now) Check out Newport Healthcare, avoid hospital and Stanford programs.",
          "created_utc": 1746020345.0
        },
        {
          "id": "mpug9zy",
          "author": "Vivid-Society-7117",
          "body": "Thank you. I’m extremely frustrated about how hard it is to find good eating disorder programs for adolescents that don’t have two-month waitlists, or don’t mix eating disorder patients with kids with all other kinds of mental illnesses, or don’t have weirdly wide age ranges (8-17? What??) Or group sizes that seem unacceptably large (20 in a cohort??)\n\nI feel like I might have already complained about this in another response so apols if I’m repeating myself but: Why aren’t there more programs??? The demand is clearly there. I don’t get it. ",
          "created_utc": 1746023279.0
        }
      ]
    },
    {
      "id": "mpcy8xz",
      "author": "lovelifetofullest",
      "body": "Still love my mom to death though, love love love her. But it would have been much better if she had been tougher. I would have saved myself probably ten extra years of being sick.",
      "created_utc": 1745780868.0,
      "score": 0,
      "context": [
        {
          "id": "mp8lw2a",
          "author": "lovelifetofullest",
          "body": "What you just explained as bad experiences (over hearing an add on the chefs radio, another girl who is sick had a moment of weakness and spit into her napkin” is not bad at all. That’s crazy you would even agree with your daughter that those issues are a big deal. Rehabs are not easy, and unless you can afford to be in your own, then you will have to deal with other people that are sick too. Sounds like a lot of excuses, but if you think she’s fine to come home, then yeah I guess pack up so she doesn’t have to hear another add again. Life is triggering, if you can’t handle it, then forget rehab and trying to get better, just go home. Rehab isn’t a walk in the park.",
          "created_utc": 1745715053.0
        },
        {
          "id": "mpcy1tf",
          "author": "lovelifetofullest",
          "body": "Listen I have spent a lot of time in rehab, and it’s never fun, but it helps. What doesn’t help is when my mom tells me “oh I’m so sorry, you should come home. This is too hard for you” then I start pitying myself. I wish my mom had been tougher and said “tough luck” this is the real world and you need to learn how to navigate it. That’s the only thing that would have worked for me, luckily my dad and boyfriend didn’t let me make excuses.",
          "created_utc": 1745780805.0
        }
      ]
    },
    {
      "id": "mpnzy9n",
      "author": "Vivid-Society-7117",
      "body": "Thanks so much for your response and thoughts ",
      "created_utc": 1745937455.0,
      "score": 2,
      "context": [
        {
          "id": "mplllgt",
          "author": "snowymarch2",
          "body": "I was a girl who was inpatient at a place like this when i was either 13 or 14 (ive been to a few places and can't always remember which one was when). Take her out of this residential treatment. It will make it worse. A lot worse. It did for me. HOWEVER - get her into somewhere else immediately. Anorexia is so, so serious and if she hasn't done well at home before she shouldn't come home again until she's proven that she's ready. And this is coming from a place of understanding and love. I know how hard it is for her and for you. Making decisions - her, about eating and recovering; you - trying to figure out how to care for your baby. This is just my personal opinion.",
          "created_utc": 1745896860.0
        },
        {
          "id": "mpllsop",
          "author": "snowymarch2",
          "body": "I do want to make one thing clear - switch her from place to place. I don't think time at home (any time at all) will be beneficial for her, and might be harmful.",
          "created_utc": 1745896936.0
        },
        {
          "id": "mpnzvo7",
          "author": "Vivid-Society-7117",
          "body": "I think you’re totally right. It’s really frustrating how hard it is to find these places though, and we live in LA! I’m encountering 2 month waitlists everywhere I call ",
          "created_utc": 1745937434.0
        }
      ]
    },
    {
      "id": "mpui57c",
      "author": "Vivid-Society-7117",
      "body": "❤️I actually did look at Newport and there was some issue I can’t remember, I’ll take another look (I’ve looked at so many places they blur together and I haven’t kept good notes unfortunately)",
      "created_utc": 1746023838.0,
      "score": 2,
      "context": [
        {
          "id": "mpu6w8f",
          "author": "doggosarecoolsoyeah",
          "body": "Take her out, simple as that. And find something new, or have something lined up. You’re a good mom, but also being home won’t be beneficial! She’s not the culprit here. There can be lying, but your daughter sounds smart. I’ve been through it too, with parents who were abusive and dismissive. My diagnosis of PTSD isn’t fun and I don’t want it for your daughter. She an adolescent which makes it harder but please please please look into other programs because adolescent programs aren’t as researched as adult ones (I’m 23 now) Check out Newport Healthcare, avoid hospital and Stanford programs.",
          "created_utc": 1746020345.0
        },
        {
          "id": "mpug9zy",
          "author": "Vivid-Society-7117",
          "body": "Thank you. I’m extremely frustrated about how hard it is to find good eating disorder programs for adolescents that don’t have two-month waitlists, or don’t mix eating disorder patients with kids with all other kinds of mental illnesses, or don’t have weirdly wide age ranges (8-17? What??) Or group sizes that seem unacceptably large (20 in a cohort??)\n\nI feel like I might have already complained about this in another response so apols if I’m repeating myself but: Why aren’t there more programs??? The demand is clearly there. I don’t get it. ",
          "created_utc": 1746023279.0
        },
        {
          "id": "mpuh120",
          "author": "doggosarecoolsoyeah",
          "body": "I have no clue. I was in the adult program at Newport, and some of the client who were barely 18 were complaining about age differences etc when they were in adolescent programs. If you need any help mama, I’m here. The health system is messed up, if you want resources, I can reach out to my contacts.",
          "created_utc": 1746023505.0
        }
      ]
    },
    {
      "id": "mpuhdgd",
      "author": "doggosarecoolsoyeah",
      "body": "If you also need someone to talk to, I’m here! You’re crazy strong for reaching out",
      "created_utc": 1746023609.0,
      "score": 1,
      "context": [
        {
          "id": "mpu6w8f",
          "author": "doggosarecoolsoyeah",
          "body": "Take her out, simple as that. And find something new, or have something lined up. You’re a good mom, but also being home won’t be beneficial! She’s not the culprit here. There can be lying, but your daughter sounds smart. I’ve been through it too, with parents who were abusive and dismissive. My diagnosis of PTSD isn’t fun and I don’t want it for your daughter. She an adolescent which makes it harder but please please please look into other programs because adolescent programs aren’t as researched as adult ones (I’m 23 now) Check out Newport Healthcare, avoid hospital and Stanford programs.",
          "created_utc": 1746020345.0
        },
        {
          "id": "mpug9zy",
          "author": "Vivid-Society-7117",
          "body": "Thank you. I’m extremely frustrated about how hard it is to find good eating disorder programs for adolescents that don’t have two-month waitlists, or don’t mix eating disorder patients with kids with all other kinds of mental illnesses, or don’t have weirdly wide age ranges (8-17? What??) Or group sizes that seem unacceptably large (20 in a cohort??)\n\nI feel like I might have already complained about this in another response so apols if I’m repeating myself but: Why aren’t there more programs??? The demand is clearly there. I don’t get it. ",
          "created_utc": 1746023279.0
        },
        {
          "id": "mpuh120",
          "author": "doggosarecoolsoyeah",
          "body": "I have no clue. I was in the adult program at Newport, and some of the client who were barely 18 were complaining about age differences etc when they were in adolescent programs. If you need any help mama, I’m here. The health system is messed up, if you want resources, I can reach out to my contacts.",
          "created_utc": 1746023505.0
        }
      ]
    },
    {
      "id": "mq4icdr",
      "author": "lovelifetofullest",
      "body": "Op, I can see you dont want to do the right thing since you downvoted me. You don’t want an answer to your question. Your daughter needs a tough parent in her life, or life is going to get hard. If it makes you feel better, people get tough on their own anyway, the real world hits us in the face when we grow older… I’m sure you love her so much, and I understand that. Everything will eventually be ok. Somehow everything ends up falling into place. I know you hate hearing this, but please stay tough on your girl, she deserves it.",
      "created_utc": 1746150241.0,
      "score": 1,
      "context": [
        {
          "id": "mp8lw2a",
          "author": "lovelifetofullest",
          "body": "What you just explained as bad experiences (over hearing an add on the chefs radio, another girl who is sick had a moment of weakness and spit into her napkin” is not bad at all. That’s crazy you would even agree with your daughter that those issues are a big deal. Rehabs are not easy, and unless you can afford to be in your own, then you will have to deal with other people that are sick too. Sounds like a lot of excuses, but if you think she’s fine to come home, then yeah I guess pack up so she doesn’t have to hear another add again. Life is triggering, if you can’t handle it, then forget rehab and trying to get better, just go home. Rehab isn’t a walk in the park.",
          "created_utc": 1745715053.0
        },
        {
          "id": "mpcy1tf",
          "author": "lovelifetofullest",
          "body": "Listen I have spent a lot of time in rehab, and it’s never fun, but it helps. What doesn’t help is when my mom tells me “oh I’m so sorry, you should come home. This is too hard for you” then I start pitying myself. I wish my mom had been tougher and said “tough luck” this is the real world and you need to learn how to navigate it. That’s the only thing that would have worked for me, luckily my dad and boyfriend didn’t let me make excuses.",
          "created_utc": 1745780805.0
        },
        {
          "id": "mpcy8xz",
          "author": "lovelifetofullest",
          "body": "Still love my mom to death though, love love love her. But it would have been much better if she had been tougher. I would have saved myself probably ten extra years of being sick.",
          "created_utc": 1745780868.0
        }
      ]
    },
    {
      "id": "mpo6uec",
      "author": "snowymarch2",
      "body": "This is definitely a tough situation. I really, really hope you find a good solution. The waitlists have gotten sooo crazy over the years. I live in Virginia, and a few years ago the waitlists were one or two weeks if there was even a waitlist at all, and now I'm hearing from my friends that they also have to wait months. I'm so glad people are getting help, but I wish it was more accessible and that there were more highly rated and genuinely helpful places to go! Please keep me updated (if you want to) on your daughter, as I wish her nothing but the best, and if I can help in any other ways or answer any other questions for you from the perspective of a girl in recovery who's been through a lot of these situations, I would be more than happy to help.",
      "created_utc": 1745939478.0,
      "score": 1,
      "context": [
        {
          "id": "mplllgt",
          "author": "snowymarch2",
          "body": "I was a girl who was inpatient at a place like this when i was either 13 or 14 (ive been to a few places and can't always remember which one was when). Take her out of this residential treatment. It will make it worse. A lot worse. It did for me. HOWEVER - get her into somewhere else immediately. Anorexia is so, so serious and if she hasn't done well at home before she shouldn't come home again until she's proven that she's ready. And this is coming from a place of understanding and love. I know how hard it is for her and for you. Making decisions - her, about eating and recovering; you - trying to figure out how to care for your baby. This is just my personal opinion.",
          "created_utc": 1745896860.0
        },
        {
          "id": "mpllsop",
          "author": "snowymarch2",
          "body": "I do want to make one thing clear - switch her from place to place. I don't think time at home (any time at all) will be beneficial for her, and might be harmful.",
          "created_utc": 1745896936.0
        },
        {
          "id": "mpnzvo7",
          "author": "Vivid-Society-7117",
          "body": "I think you’re totally right. It’s really frustrating how hard it is to find these places though, and we live in LA! I’m encountering 2 month waitlists everywhere I call ",
          "created_utc": 1745937434.0
        },
        {
          "id": "mpnzy9n",
          "author": "Vivid-Society-7117",
          "body": "Thanks so much for your response and thoughts ",
          "created_utc": 1745937455.0
        }
      ]
    }
  ]
}