{
  "id": "1kbtrwg",
  "subreddit": "EatingDisorders",
  "author": "Putrid-Seesaw-2457",
  "created_utc": 1746053419.0,
  "title": "my girlfriend (16) is eating less and less and I need advice",
  "selftext": "my girlfriend has struggled with self harm and eating problems before, to the point where she'd eat a slice of bread a day for weeks. I wasn't around during these times so all i know is what she's told me. \n\nher eating was amazing, whole meals + snacks during the day, but recently I've noticed and so has she it's been getting less and less. I know she knows what's going on, and she tries to hide it but she's told me she's scared of her eating less, because the less she eats the worse the gets and its a negative cycle. she scared she's gonna go back into her old habits and im shitting bricks\n\nhow do i help her and support her, because I want to be there and show her im here for her, and I'm willing to do anything to help her get better with her eating and everything else because i care so much.\n\nI've tried telling her the scientific stuff but that's because it's all i know, and i get that's overwhelming and not helpful. a few years ago i had my own struggles with eating but no matter how hard i try it feels like i can't seem to help. ive never done or considered self harm, so i can't even begin to try relate. she's told me she knows none of this is good for her, and the further it goes the more embarrassed and helpless she feels, and it makes me wanna ball my eyes out then wrap her in bubble wrap and never let her leave her room.\n\nhow do i help her without overwhelming her or making it worse. I know most of the work will have to come from her because she needs to want the change in order for it to happen, but i still want to know everything I can do to support and help her\n\nplease help im begging ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1kbtrwg/my_girlfriend_16_is_eating_less_and_less_and_i/",
  "score": 43,
  "num_comments": 6,
  "comments": [
    {
      "id": "mpxg8o6",
      "author": "Necessary_Ad5927",
      "body": "the first thing you should know, is to never ever comment on her body or what she eats whether it’s good or bad. never tell her she is skinny enough, or she doesn’t need to lose weight, because even though those are positive things those can trigger disordered thoughts. complimenting her and telling her she’s beautiful/perfect the way she is can be comforting though. \n \nmy boyfriend is the type to eat out, or share his food with me. this has really helped me because then i kind of have no choice to restrict my eating or not, since we’ll go out together. you can try to invite her out to eat, or if you know she has a favorite food maybe ask if she’d like to go get it, or you can say YOURE craving something, but take her out to get it with you. one thing that may make her uncomfortable is you saying “do you want to go eat ____?” or “are you hungry?” because she might feel embarassed to eat something/have cravings etc. so if you make it seem like you want to get something, it may help her feel more comfortable to go out and eat. my boyfriend eats a lot so when we go out together i feel more comfortable eating, and it kind of forces me to eat since i can’t go out with him and say “im not hungry” and not order anything\n\ni hope this helps, i can’t really think of anything else at the moment, but just know you being curious of how to help her is already the biggest step you could take for her because disordered thoughts are hard to deal with, so the fact that you care enough is great",
      "created_utc": 1746055540.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mpy1rrc",
      "author": "None",
      "body": "If she’s 16, you can’t be much older. I say this because as much as you want to help, you’re also probably still a child or close to. You can be a positive in her life, but you have to accept that you’re not able to heal her from this. \n\nWhat I’m not seeing in your post is any mention of trusted adults, or people in her life who can intervene to get her help. Has she been in treatment before? Do her parents know she has this issue? Does she have any trusted adults in her\n\nFood/weight/frequency of eating are topics will probably always be overwhelming and unwelcome for her. Which doesn’t mean they should never be brought up, but it does mean you’re probably not the best person to do so. I’d recommend finding someone you trust to talk about it with. A guidance counselor at school, a therapist, a parent or older sibling etc. ",
      "created_utc": 1746062946.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mpxgtji",
      "author": "thatscooliosisdude",
      "body": "at the end of the day, it’s going to be her decision to make the changes she needs to make to be better. don’t put too much pressure on yourself to be ‘perfect’ for her and try to heal her (speaking as the girl in this situation lol). For me personally the most helpful thing was when my bf would gently offer me food or snacks but not pressure to eat them. Also when wed be cuddling/hanging out/etc he’d casually get up and grab a snack for himself and then offer me some after a minute. Every girl is going to be different of course but those were some of the things that helped me. Just keep doing your best to support her and show her love, you’re doing awesome",
      "created_utc": 1746055734.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mq1vqpy",
      "author": "snowymarch2",
      "body": "The fact that you care about her enough to post in here begging for advice is amazing. However, I don't think there is much you can do besides not commenting on her body or what she eats. Don't even say \"positive things\" like telling her how skinny she is, she doesn't eat enough, etc because it is so triggering even if it doesn't seem like it. just be there for her. That's all you can do. that's what my boyfriend did for me and it genuinely helped so much just having that positive force in my life, especially since he was one of the only people that wasn't constantly commenting on my body and how much I was eating. Ask her to share food with you, instead of asking if she's hungry say \"i'm hungry do you want to eat\", etc. don't ask her if she's hungry because it's likely she'll just say no. DO call her beautiful and and perfect, like the other comment said, but don't make it constant. it gets overwhelming. Overall, just be normal. otherwise she might feel bad for worrying you which could cause it to get worse (at least it did for me.) \n\nI really really hope this helps at least a little bit! good luck.",
      "created_utc": 1746120332.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqpjfzf",
      "author": "Sufficient-Tomato566",
      "body": "Hello, you seem knowledgeable in this situation and I came here from a similar situation. My girlfriend has struggled with anorexia for years and when I met her she was in recovery and doing really really well but something has happened that is causing her to have a much harder time and she has told me she is struggling. This is not my first experience with disordered eating in someone very close to me but the problem is we live 2 hours apart so we only get to see each other like 1 or 2 times a week when I go visit. She eats so well around me and she has said that she finds it so much easier to eat with company and especially my company and I am so grateful that I can be that for her. But how can I be there for her when I’m not able to be there physically? We FaceTime for breakfast ever morning because I know that starting the day off with a meal makes it much easier for her to eat afterwards (her words, she said she feels hungry during the day when she eats breakfast) is there anything else I can be doing? I really don’t want to be the “oh did you eat lunch?” Person because I know it sucks to have to let someone down and say you didn’t. It’s also her business and not mine so I don’t want to overstep.",
      "created_utc": 1746453997.0,
      "score": 2,
      "context": [
        {
          "id": "mpxg8o6",
          "author": "Necessary_Ad5927",
          "body": "the first thing you should know, is to never ever comment on her body or what she eats whether it’s good or bad. never tell her she is skinny enough, or she doesn’t need to lose weight, because even though those are positive things those can trigger disordered thoughts. complimenting her and telling her she’s beautiful/perfect the way she is can be comforting though. \n \nmy boyfriend is the type to eat out, or share his food with me. this has really helped me because then i kind of have no choice to restrict my eating or not, since we’ll go out together. you can try to invite her out to eat, or if you know she has a favorite food maybe ask if she’d like to go get it, or you can say YOURE craving something, but take her out to get it with you. one thing that may make her uncomfortable is you saying “do you want to go eat ____?” or “are you hungry?” because she might feel embarassed to eat something/have cravings etc. so if you make it seem like you want to get something, it may help her feel more comfortable to go out and eat. my boyfriend eats a lot so when we go out together i feel more comfortable eating, and it kind of forces me to eat since i can’t go out with him and say “im not hungry” and not order anything\n\ni hope this helps, i can’t really think of anything else at the moment, but just know you being curious of how to help her is already the biggest step you could take for her because disordered thoughts are hard to deal with, so the fact that you care enough is great",
          "created_utc": 1746055540.0
        }
      ]
    },
    {
      "id": "mqqx78w",
      "author": "Necessary_Ad5927",
      "body": "from what you’re telling me you’re already doing a great job of being there for her :) especially if she feels comfortable enough to show you that she’s eating, that means she has a lot of trust/love for you so that’s great 😊i’m not sure what her love language is, but i think reassurance and compliments are something that can really help. letting her know you’re always there for her, telling her she always looks pretty/beautiful etc. just general reassurance will always help no matter the person. especially compliments that aren’t about appearance are nice. \n\nsomething else i can think of, idk how old you are but maybe offering to doordash her something or even doing it without telling her. i was thinking you could send her money for a coffee, but honestly if my boyfriend did that for me i’d probably just save the money to avoid eating. if you decide to do this, she may get mad at you bc in her head it will come off as you force feeding her, but you can reassure her you just wanted to do something nice for her and buy her a treat/meal :)\n\nat the end of the day, if you guys call or text maybe you can ask her what she ate that day, or throughout the day you can update her on what you’re eating. you have to be careful with this though because sometimes it can come off as competitive. for example if a girls bf if skinnier than her and is constantly telling her what he’s eating, yet he’s still skinnier than her it could come off as bragging. (insane i know but that’s just anorexia for you) but from what it sounds like she doesn’t see you as competition, so being like “i just grabbed lunch, im eating ____ :) have you had lunch yet?/ what did you have for lunch ??” it won’t come as interrogative but instead you genuinely wondering about her and her day !! \n\nthat’s all i could think of for now but i hope that can help you :)",
      "created_utc": 1746468652.0,
      "score": 1,
      "context": [
        {
          "id": "mpxg8o6",
          "author": "Necessary_Ad5927",
          "body": "the first thing you should know, is to never ever comment on her body or what she eats whether it’s good or bad. never tell her she is skinny enough, or she doesn’t need to lose weight, because even though those are positive things those can trigger disordered thoughts. complimenting her and telling her she’s beautiful/perfect the way she is can be comforting though. \n \nmy boyfriend is the type to eat out, or share his food with me. this has really helped me because then i kind of have no choice to restrict my eating or not, since we’ll go out together. you can try to invite her out to eat, or if you know she has a favorite food maybe ask if she’d like to go get it, or you can say YOURE craving something, but take her out to get it with you. one thing that may make her uncomfortable is you saying “do you want to go eat ____?” or “are you hungry?” because she might feel embarassed to eat something/have cravings etc. so if you make it seem like you want to get something, it may help her feel more comfortable to go out and eat. my boyfriend eats a lot so when we go out together i feel more comfortable eating, and it kind of forces me to eat since i can’t go out with him and say “im not hungry” and not order anything\n\ni hope this helps, i can’t really think of anything else at the moment, but just know you being curious of how to help her is already the biggest step you could take for her because disordered thoughts are hard to deal with, so the fact that you care enough is great",
          "created_utc": 1746055540.0
        },
        {
          "id": "mqpjfzf",
          "author": "Sufficient-Tomato566",
          "body": "Hello, you seem knowledgeable in this situation and I came here from a similar situation. My girlfriend has struggled with anorexia for years and when I met her she was in recovery and doing really really well but something has happened that is causing her to have a much harder time and she has told me she is struggling. This is not my first experience with disordered eating in someone very close to me but the problem is we live 2 hours apart so we only get to see each other like 1 or 2 times a week when I go visit. She eats so well around me and she has said that she finds it so much easier to eat with company and especially my company and I am so grateful that I can be that for her. But how can I be there for her when I’m not able to be there physically? We FaceTime for breakfast ever morning because I know that starting the day off with a meal makes it much easier for her to eat afterwards (her words, she said she feels hungry during the day when she eats breakfast) is there anything else I can be doing? I really don’t want to be the “oh did you eat lunch?” Person because I know it sucks to have to let someone down and say you didn’t. It’s also her business and not mine so I don’t want to overstep.",
          "created_utc": 1746453997.0
        }
      ]
    }
  ]
}