{
  "id": "1kf8lxx",
  "subreddit": "EatingDisorders",
  "author": "cookie-mouse_",
  "created_utc": 1746442213.0,
  "title": "How did ur ed start when it physically started..? lol",
  "selftext": "it’s hard to word my question but I’m not talking about the parts in the beginning but the part when you started to notice you were fighting to eat less or things like this!!\n\nEdit: \n\nI expected it but didn’t think everyone would have such sad stories!! :( i hope you all genuinely, get better soon and i hope there’s a cure/method to fix binge eating/purging one day that works for everyone..💛",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1kf8lxx/how_did_ur_ed_start_when_it_physically_started_lol/",
  "score": 39,
  "num_comments": 45,
  "comments": [
    {
      "id": "mqqn4v1",
      "author": "Icy_Judgment6504",
      "body": "Sorry for the length, but I’ve been fighting relapse and so I’ve been thinking about this a lot.\n\nI was about 14, had been on track and cross country team but was asked to start training for sprints… I had already had some issues but we were doing time trials for our upcoming meet one day, and I was standing next to my coach watching one of the sprinters who’d been training for varsity sprints for awhile already. \n\nAs she ran past us, he commented about how you could barely hear her feet touch the ground she’s so light on her feet. He just meant her form was good, but for me, I already had noticed how super super super thin she was, and I internalized that as needing to lose lots of weight, and that night after practice — I skipped dinner. \n\nAnd then I’d go on 3 or 4 hours jogging every single day, even after practice, even late at night or early morning whenever my parents wouldn’t see. And only eating apples and getting really angry if I was expected to eat dinner with the whole family at the table. Totally fasting, and then right before track practice I would eat just a handful of trail mix so I wouldn’t pass out. Soon after the school blood drives, which I always did, began turning me away because of my weight. And that’s how it started for me.",
      "created_utc": 1746465782.0,
      "score": 26,
      "context": []
    },
    {
      "id": "mqqr2gm",
      "author": "HorrorOne2731",
      "body": "When I was in HS. Tried restricting but my mom found out and threatened therapy so I stopped and then started binging and purging. That lasted 8 years.",
      "created_utc": 1746466896.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mqryoup",
      "author": "prcqs",
      "body": "It started in 5th grade. I hit puberty really early and my body changed before my other classmates. I stood out in a way I didn’t want to, and people around me started to sexualize me. I didn’t even fully understand what was happening. I felt uncomfortable in my body and tried hiding my body by wearing oversized clothes. That’s when I started eating less, thinking maybe if I got smaller, it would all stop. Like maybe I could somehow undo the way my body was developing.\n\nI also had a best friend who was naturally super skinny and had a fast metabolism. She could eat anything and stay small, and I was always comparing myself to her. I started to feel like something was wrong with me for not looking like that.\n\nI wish I never went down that path, because now it’s completely messed me up physically and mentally. And even now, I don’t really know how to fix it.",
      "created_utc": 1746479694.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mqqqao5",
      "author": "Medium-Experience861",
      "body": "heard some where that a X amount fast will make u look less bloated. had a fast and loved it. started fasting then counting calories and weighing myself, etc. two years later decided to recover!",
      "created_utc": 1746466677.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mqryg1r",
      "author": "xyelem",
      "body": "I was in second grade the first time I ever went on a fast. I’d say that I really started dedicating myself to it when I started purging, which was around eleven. I also have OCD, so this is also around the time that started being a problem. I was CONVINCED that somehow just my food had been poisoned or contaminated or something accidentally and if I didn’t throw up I would die. I still get the “oh no I’ve been poisoned, I’m going to die” thing, but not with food quite as often and I don’t purge as a result. I just kind of sit with the massive panic attacks it brings (I also take Ativan, which helps, lol). I just turned thirty, for context.",
      "created_utc": 1746479619.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mqs6yjr",
      "author": "bizzybee-72",
      "body": "honestly, i dont really know. ive had an image problem for a long time. i started restricting when i was twelve and it carried well past my teen years. i remember looking at my pics from when i was ten years old then and just thinking about how big i was and how i never wanted to be like that. i still struggle and have been on the verge of relapsing since im postpartum now.",
      "created_utc": 1746482290.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mqsfuc9",
      "author": "nikonekonak",
      "body": "The earliest I can remember was high school. I started using food as a \"reward\" for achieving things: I finish homework, I get to eat. I finish studying for exams, I get to eat. Didn't finish a project? No food. This became a problem because it started wiring my brain to think I only deserve food when I achieve or attain goals. So when I feel like I'm at my lowest, I struggle with my appetite even when I can physically feel the starvation.\n\nAfter I dropped out of college, I started purging in addition to the depravity. I would eat, sure. But I couldn't settle until I'd let everything out.",
      "created_utc": 1746485262.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mqt67la",
      "author": "AggravatingStudent81",
      "body": "My gym membership stopped being free due to summer, so I subconsciously began not eating and going on more and more walks. During this time period ( I was 21 and in collage, I would begin blacking out almost every time I drank. I also began getting tons of physical validation from people as I was working at a popular bar/ restaurant at the time). I remember eating MnMs and going on an hour long walk after.",
      "created_utc": 1746494226.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqra4sw",
      "author": "Plenty-Warning3976",
      "body": "It’s not really all that complicated for me. It wasn’t that long ago (half a year), and I more or less decided within a week or two to eat less to loose weight. So it was all very conscious on my part, though I didn’t really understand how deep into the ED until a few months later when my hunger cues disappeared. By the time the undereating had ‘results’ it became mentally impossible for me to stop, and that’s how it happened basically.",
      "created_utc": 1746472469.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqs5pqc",
      "author": "Boredangelqueen-_-",
      "body": "When I was really little, idk when, I started not liking the way my legs looked, when I was in second or first grade I started weighing myself. It kinda took of this year with my first big not eating thing. It lasted about one or two weeks, I had vitamins and a few snacks so I was fine. The my stupid fucking mom who knows my struggles but just thinks Its cuz I'm sad FOR SOME FUCKING REASON competed about how I eat to much. So here I fucking am again, skipping fucking lunch again. ",
      "created_utc": 1746481892.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqsr14d",
      "author": "steampxnkpirate",
      "body": "i downloaded twitter for the first time and started getting suggestions for edtwt! at first the bcs that appeared were jarring and scary to be but i became desensitized and fell down the rabbit hole",
      "created_utc": 1746489009.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mqtcdyn",
      "author": "tinytwins1",
      "body": "I was eleven and we lived in the perfect homeschooled Christian family. I idolized my parents and especially my dad, who to this day is still the person I most admire in this world. We found out he had cheated on my mom and it just broke us but we were a good Christian family and we're supposed to put smiles on our face and be happy but I couldn't and I had nowhere for my hurt to go because we were to forgive automatically and whatnot and weren't to speak about it. \nBeing homeschooled, we had no guidance counselors or someone outside of the family to talk to. My eleven year old brain looked at my mom and my family and I noticed a couple of things. My mom was overweight and had been for years and we had no money, it was all food banks, church handouts and whatnot. I realized two things: I needed to be thin and I needed to have money and maybe I would never be cheated on and hurt as bad as I saw my mom struggling. My mom had to stay and couldn't leave because she was a stay at home mom with no resources. She never said this, I overheard a phone conversation. I started restricting then and switched to binge/purge when it became too obvious I wasn't eating. I got praised for eating and I figured, good, I had figured it out \nI put myself through nursing school and made money and was thin, most importantly of course. Unfortunately, I was cheated on and realized it was devastating but it's hard to kick old beliefs that you've lived your life by and built your goals around. I've been with my husband for 15 years now and have had my ED for 24 years. He was the one who cheated on me and while I would never recommend staying in a relationship like that to anyone else, I stayed because I truly didn't know that I deserved better. I still thought there was something wrong with me. Of course I am the way I'm meant to be and no one's actions can determine my worth. I know that now and demand the respect I deserve and give the respect that other people deserve. I realized my dad was a human who made a hurtful mistake, I have also made mistakes and hurt other people. We are all doing our best to learn how to love each other and meet the person across from me where they are at because we all have our secrets and mine made me very sick and vulnerable in an unhealthy relationship in the beginning. Me and my husband have grown up together and he is now my best friend and we can talk about anything while also seeing our separate therapists to talk about trauma and healing. I had significant trauma involving my twin sister that devastated my entire being. We have no kids and want to keep it that way, we spent years fighting to be healthy together and we finally have it and it's the most beautiful thing in the world.",
      "created_utc": 1746496344.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqssvyi",
      "author": "basically_dead_now",
      "body": "I honestly don't remember. I was extremely young when my grandmother started pushing me to starve myself, so my eating disorder started from a very young age. I think she started doing it around when I was in kindergarten, so it had to have been around or after then",
      "created_utc": 1746489638.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqt9q8j",
      "author": "cheeseandcrackers345",
      "body": "When my mom was on Weight Watchers while I was in middle school. It was really the first time I ever thought of weight as an issue, conceptually. So I started doing it too.",
      "created_utc": 1746495438.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqtkzbh",
      "author": "alienprincess111",
      "body": "It started after a couple months tbh.  I was 13 and started watching what I eat / cutting calories due to weight gain from puberty.  Pretty quickly i got addicted to the point that I could not stop.",
      "created_utc": 1746499395.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqtznvg",
      "author": "gemory666",
      "body": "I have a few memories, being 8-10 years old of 'not wanting to eat so I don't get fat' but didn't understand what it actually was at the time. It wasn't until I was 15, had spent some time in a psych unit for other issues but they put me on a new medication. I specifically remember the psychiatrist saying \"This medication is known for making women put on weight, so you might want to start watching what you eat and think about going to the gym.\" It's like I literally felt something in my brain snap and I said no way is that going to happen. That's when I started actively/consciously restricting and exercising with the goal of losing weight and it's been all downhill since then.",
      "created_utc": 1746505576.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqujl3q",
      "author": "coollcoolcool",
      "body": "I realized at 12 that omading helped decrease my weight significantly, then I correlated not eating enough with weight loss, and with feeling better about myself. I’d go out of my way to count every single bite i had and keep it to a minimum, and only much later did I come to understand that this wasn’t actually a healthy approach.",
      "created_utc": 1746516525.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqujy5o",
      "author": "znewton1",
      "body": "I always loved playing sports and I was a pretty decent athlete. Sometime around the 6th grade I hit puberty and my body started developing. Mostly my butt and hips. I started getting called hippo but by the school bully. Around the same time my siblings started making the same jokes.  It started to get to me and I began starving myself. From that day on it didn’t matter how small I got, I was never satisfied. I still played sports all throughout middle school and high school, but it wasn’t really until I stopped eating regularly that I lost the weight. Then came the hair loss, the constant fatigue, the brain fog etc. I was too far gone at this point but it didn’t matter. Anytime someone commented on how “thin” I looked it fuelled my ego. Until the binging started and I gained double the weight back. Ever since then I’ve been in this constant back and forth struggle. Restrict, binge, repeat. All I think about from the moment I wake up until the moment I fall asleep, is food. What to eat, what not to eat. I’m tired. Genuinely tired of it.",
      "created_utc": 1746516760.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqule0a",
      "author": "telepathiccomfort",
      "body": "I have a very vivid memory of it. I was about 13, and struggled a lot with self esteem. I was the ugly friend, and had undiagnosed OCD and anxiety. I hated myself and was suicidal. Tried to SH, but I felt it just ruined me more, made me more broken and unlovable. I was convinced no one would ever love me if I was flawed in any way (more than I fundementally believed I was). Felt I had to overcompensate for being me. I had to fix myself, get perfect. Carved \"NO\" on my left hand with a pair of scissors to stop myself from putting food in my mouth. That's how it started -the project perfect. Got into fitness, diet, mental training, whatever, everything. It worked and everyone applauded me, then it very quickly went south.  Recovered for 9 years now!",
      "created_utc": 1746517699.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mqu29k4",
      "author": "Frequent-Tax718",
      "body": "It was back in September 2023 and I was at a wrestling meet watching some friends and one of the popular girls were going around asking everyone's weight and I said I didn't know even though I did and I realize that I weighted more than them and I decided I wanted to weigh less so ig that's when that happened but I think It started a little bit before that I'm not really sure",
      "created_utc": 1746506728.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mqvc3ra",
      "author": "unearthlly",
      "body": "One day i forgot to eat all day and noticed how flat and unbloated my stomach looked the next day. I felt so empty and somewhat satisfied with my body for the first time ever in my life, ever since then I started browsing through pro-ed platforms and sites and it all went downhill from there.",
      "created_utc": 1746532698.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqvnojf",
      "author": "fruityicecream",
      "body": "When I was 11 years old, my paternal grandmother brought up my weight, a topic that had never occurred to me before. She encouraged me to ride a bicycle up and down her driveway for hours during the summer. By the time I was 12, my maternal grandfather was the first to point out that I was underweight and suggested that I might have an ED.\n\nNow, at 37, I still struggle with these issues.",
      "created_utc": 1746537135.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqvob5k",
      "author": "my_catsbestfriend",
      "body": "I was bedridden for the entirety of 7th grade due to illness, and I was already pretty distorted about my figure, so once I was back on my feet, I felt like I had gained too much weight. So I downloaded myfitnesspal and started tracking my intake. After a while I became absolutely obsessive & it turned into a full blown eating disorder",
      "created_utc": 1746537358.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqwkvlc",
      "author": "Therandomderpdude",
      "body": "I was fifteen at the time. It's such a blurry memory, like I can't remember when it escalated into the worst but it started by my father dying, as well as a undiagnosed autism disorder.(got diagnosed years later after recovery which explains a lot)\n\nMy father was absent and an alcoholic. Prior to him passing I had made a decision to stick to a harmless diet, and it just went downhill from there after his death, getting more and more obsessive and destructive. Dwelling deep into depression and self hatred. I remember thinking I deserved punishment and was using my ED as a form of self harm and discipline. It turned into some sort of philosophy, like a detox or spiritual cleansing. It was insane. \n\nThen one day I just remember deeply hating my reflection when I no longer could recognize the person In the mirror. I started to avoid looking in the mirror. I felt disgusted by myself, like it was not fun anymore. Like the idea I had of being smaller and how perfect my life would be was far from reality.\n\n I thought I would finally get the confidence to wear pretty tight fitting clothes and dresses when I achieved my goal weight and desired physique. But I never gained any body confidence, and would continue to cover myself up in my old oversized boyish clothes. It was very disappointing and probably the reason I continued to thrive for that promise, that one day I'd feel beautiful and good enough. \n\nMy illness had become visible for all to see and judge. I've never felt so empty and shameful in my entire life. Whenever I would meet people they'd give me concerned and saddened looks, it made me want to hide away from the world. \n\nI constantly made people cry and having them distancing themselves. It was incredibly lonely. \n\nI felt like the only thing I had left that made me feel secure and accomplished was my ED even though it made me feel horrible and ugly looking. It was a distraction from all the pain and hurt I was feeling inside. I remember losing my ability to feel emotions which was a weird experience. I remember trying everything in my power just to feel something again. \n\nIt was a complete heartbreak of a life, Feeling myself turn into a disease and not knowing how to get out or how to stop hurting people.\n\n\nLife is wayy better now. I am happy and grateful to be alive. My grief has been processed and my autism is getting the care it needed after years of battling mental illness. Finally letting myself wear pretty clothes and taking care of myself. Eating guilt free and feeling healthy. Been recovered for 7+ years.",
      "created_utc": 1746547193.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqybc4t",
      "author": "Federal-Chapter1487",
      "body": "It started when I was in 3rd class cause I was made the butt of every fat joke",
      "created_utc": 1746565003.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mr0712q",
      "author": "Severe_Wheel8656",
      "body": "When I was a kid, my mom would always threaten to send me to bed without dinner (I get it’s not much), but I was growing up as an undiagnosed autistic. So what were overdramatic tantrums to her, was just me trying to self regulate. And I built up a lot of resentment towards her, from a very early age, for never trying to understand or protect me.\nAnd then she would threaten to take my food away. So I wouldn’t eat. It was a power thing. If she didn’t actually want to feed me, then I’d just starve. \nNow, as soon as I feel anxious or angry, I lose my appetite. And I’ll go DAYS without eating, because I don’t feel like I deserve it. \nFood is the reward for being a good kid, and I am not always the best kid. \nI hate how skinny I am, I think I look like a young boy. (25F) I have no feminine features. I’m jealous of all my friends bodies with their curves and boobs. But it feels so unattainable. Because I don’t want to be skinny, I just don’t deserve to eat.",
      "created_utc": 1746587704.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mr0v7z7",
      "author": "Happy_Link_1400",
      "body": "i would eat ALOT as a child. My stomach was small but i had a huge appetite. I would occasionally kinda throw up a little bit because of how much i ate. I would always get comments on my weight on what i eat. and how i was a “porky girl” as i got older people would comment on my body throughout middle school and high school.",
      "created_utc": 1746599298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mr2h1ox",
      "author": "Thesparkleunicorn",
      "body": "Hello, all this started for me a year or 2 ago. \nBut theoretically it could have gone longer as I had vague memories of checking myself as a kid. I am now a 16 year old teenager. Who ate so much that people started to notice. I began to throw the food I ate up, at first on accident, and then on purpose to stop the pain of my food.\nThis I believed created my unhealthy relationship with food, or at least worsened it.",
      "created_utc": 1746627053.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mr4l3aj",
      "author": "Signal_Intention5786",
      "body": "I was given a dance partner who was a lot slimmer than I and immediately felt the need to get skinnier or I wouldn't deserve to be partners with her. It makes me sad I was only 13-14 :(.",
      "created_utc": 1746649063.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mr7efzu",
      "author": "worthlessbarelyhuman",
      "body": "In hindsight it probably was partially because i was a bit intolerant to some foods -- eating has always made me Feel Bad, and in combination with hating school it landed in me being eternally nauseous. I wpuld eat a light breakfast and school lunch, then sustain myself on biscuits kinda. Passed out once at 11 and got told i needed to eat more by a medical professional. \n\nI did do better for a while, though i still... never really cared for/liked food. It just doesn't make me feel good I'd say. I knew what an eating disorder was but was busy being mentally ill in Other Ways. (Though i did dabble lightly i never made a Thing of it, it was just in the back of my head)\n\nThen at age 16 ish my period stopped for unclear reasons, and my googling led me down an ED rabbit hole, and something about it Clicked. Like damn, i can harm myself easy without ppl noticing too much and on top of it i don't have to deal with like. The consequences of food? Amazing revelation! I wouldn't say i went off the deep end, I've always been quite \"chill\" about it, but i definitely did develop a decently active eating disorder at that point. \n\nIt's kinda come and gone since, but truth be told it's never completely dissapeared. Mostly, again, because i kinda just associate food with feeling bad due to being intolerant to such common ingredients. I'm not even like, thin, just kinda average size. I do think i am not doing very well this very moment, but even now i don't quite regret it even though it has had certain quite clear negatives. I just never did enough to feel like I deserve pity or that it was actually bad. Most of my issues are mental, not physical, yk? And i have always had mental issues, this is not the first, just the only \"actionable\" one. Idk. I know it's bad. Please don't think like i do.",
      "created_utc": 1746687338.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mr918mi",
      "author": "WhoaTornado",
      "body": "I remember having to clean my plate as a little kid. I couldn't go outside and play until I did. I wanted to play outside so bad that I would force down the food even though I wasn't hungry. The portions became more adult sized and I became a fat kid which lead to being bullied. I stopped eating at school. I started skipping meals at home. I started playing a game with myself of how long could I go without eating and would try to break my own records. I had a fear of public vomit as I had seen quite a few in school, and people would comment on the amount. I had a fear of throwing up, and if I did, I wanted to make sure the amount would be small, so I made sure the amount I would consume in one go was really small in case I ever threw up. I never did. This extreme hunger eventually started the binging. Sometimes, at home, especially with a family that likes to eat large amounts, sometimes I was so hungry I couldn't stop eating until I was sick full. I could never purge, I tried, but couldn't. When I became normal sized and not fat, people treated me so different, they were so nice to me. Its sad. After school was over, and the peer pressure of school was over, the binging happened more often and it was harder to restrict. Its been a lifelong adult battle for a few decades now. Its not fun. Its awful. I got more control over binging now, because of passing out cold one time from binging too hard. It put fear in me, so I never go past a certain limit anymore. Its so much harder to restrict now, its harder to binge now too. Everything is harder now. Getting older is hard, but its a priveledge to age, so I take it one day at a time and try to age with grace.",
      "created_utc": 1746714564.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mraof11",
      "author": "Zestyclose-Compote11",
      "body": "Tw!!! (I’m also adding a bit of my recovery as to explain when I actually REALIZED it was bad)\n\nI was always a bigger kid, I’m taller and not exactly skinny I was bullied continuously. it never pushed me far enough but then some traumatic stuff sent me into this weird state of overdrive. It started small, I was eating less and running more it was healthy at first but slowly got worse until I was eating nothing, I started overcompensating and eventually it grew into me eating a little bit and feeling so disgusted with myself that I would throw up everytime I ate or drank anything and continuously got worse.\n\nWhen I realized/start of my recovery \nI saw brye live at a Leanna Firestone concert and everything changed. I realized just how much i was hurting myself but my habits continued and i felt disgusted for not only eating but also not eating. my mom finally figured out what was happening and pushed me to get help. Through that I’ve learned so much and I still struggle all the time but I am so much healthier now, to anyone who is struggling please know you are not alone and it is always better to get help.",
      "created_utc": 1746731824.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrlvf8t",
      "author": "Stunning-Carpenter42",
      "body": "When I noticed I was fighting  to eat less  I would destroy my food somehow. For example if it was chocolate i would melt it down the drain, or chips I would spray cleaning products on it. But also I would have a full list of things I would get my self if I was a certain weight. I have been fighting my ed for 3yrs now and this year mentally has been the worst.",
      "created_utc": 1746893160.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrp4bh6",
      "author": "Altruistic_Garden480",
      "body": "Started when I was 15 , growing up my parents were very Christian people but behind closed doors they were not . I was physically and mentally abused by my father and step mom . I was allowed to have no friends over, or go to there houses , I didn’t have a phone till I moved out , it made me rebellious.i had friends at school who said I was gaining a little weight, i had very bad scoliosis that made me  have body image issues , I started running and working out because it was the only thing I could do to get out the house . Then I started watching the scale , I started not eating then my parents started to notice so I started purging . It felt like the only thing I had control over . But I met my amazing husband who treats me well and he helped me get out of it . Not a day gos by that I don’t think of it .",
      "created_utc": 1746935922.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mrrcgc8",
      "author": "Street_Flatworm6225",
      "body": "I used to workout A SHIT TON.\nI wasnt fat or anything but i just worked out to outcompete my fellow classmates.We were all on the same level but i was shredded to the bones.\n\nI had veins everywhere.My head my abs my arms legs.\nHell i even had veins on my ass.I was definitely single digit bodyfat.\nBut it was a grave mistake i did this during puberty.\nWhat ended up happening was my body and testosterone got really messed up and i looked like i was dying from some sort of sickness.\nDoing all of this work ended up with me starting to get lazier and eating huge amounts of food and then forcing myself to throw it up.\nSometimes to the point where id start bleeding from my eyes and throat.\n\nMy advice is to do your work but also make sure youre having breaks.\nAnd dont fall out of the wagon.",
      "created_utc": 1746976090.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mqs3wfg",
      "author": "prettipain",
      "body": "cross country started mine too :(",
      "created_utc": 1746481319.0,
      "score": 8,
      "context": [
        {
          "id": "mqqn4v1",
          "author": "Icy_Judgment6504",
          "body": "Sorry for the length, but I’ve been fighting relapse and so I’ve been thinking about this a lot.\n\nI was about 14, had been on track and cross country team but was asked to start training for sprints… I had already had some issues but we were doing time trials for our upcoming meet one day, and I was standing next to my coach watching one of the sprinters who’d been training for varsity sprints for awhile already. \n\nAs she ran past us, he commented about how you could barely hear her feet touch the ground she’s so light on her feet. He just meant her form was good, but for me, I already had noticed how super super super thin she was, and I internalized that as needing to lose lots of weight, and that night after practice — I skipped dinner. \n\nAnd then I’d go on 3 or 4 hours jogging every single day, even after practice, even late at night or early morning whenever my parents wouldn’t see. And only eating apples and getting really angry if I was expected to eat dinner with the whole family at the table. Totally fasting, and then right before track practice I would eat just a handful of trail mix so I wouldn’t pass out. Soon after the school blood drives, which I always did, began turning me away because of my weight. And that’s how it started for me.",
          "created_utc": 1746465782.0
        }
      ]
    },
    {
      "id": "mqy6vls",
      "author": "HorrorOne2731",
      "body": "That happened to me too. Started puberty early. And in 5th grade my teacher had us all get weighed and take our heights at the beginning and end of the school year. And one of the boys saw my weight and said I was bigger than him. Thus started my hatred of my body.",
      "created_utc": 1746563746.0,
      "score": 4,
      "context": [
        {
          "id": "mqryoup",
          "author": "prcqs",
          "body": "It started in 5th grade. I hit puberty really early and my body changed before my other classmates. I stood out in a way I didn’t want to, and people around me started to sexualize me. I didn’t even fully understand what was happening. I felt uncomfortable in my body and tried hiding my body by wearing oversized clothes. That’s when I started eating less, thinking maybe if I got smaller, it would all stop. Like maybe I could somehow undo the way my body was developing.\n\nI also had a best friend who was naturally super skinny and had a fast metabolism. She could eat anything and stay small, and I was always comparing myself to her. I started to feel like something was wrong with me for not looking like that.\n\nI wish I never went down that path, because now it’s completely messed me up physically and mentally. And even now, I don’t really know how to fix it.",
          "created_utc": 1746479694.0
        }
      ]
    },
    {
      "id": "mqu3p6e",
      "author": "phoebe_bridgers_4evr",
      "body": "me too. i cant seem to get out of this cycle. i use(d) starvation as a form of sh and punishment for years. its engraved into every bone in my body. it controls my every move. it genuinely feels disconnected from me, as if someone did this to me when in reality i did this to myself.",
      "created_utc": 1746507426.0,
      "score": 3,
      "context": [
        {
          "id": "mqsfuc9",
          "author": "nikonekonak",
          "body": "The earliest I can remember was high school. I started using food as a \"reward\" for achieving things: I finish homework, I get to eat. I finish studying for exams, I get to eat. Didn't finish a project? No food. This became a problem because it started wiring my brain to think I only deserve food when I achieve or attain goals. So when I feel like I'm at my lowest, I struggle with my appetite even when I can physically feel the starvation.\n\nAfter I dropped out of college, I started purging in addition to the depravity. I would eat, sure. But I couldn't settle until I'd let everything out.",
          "created_utc": 1746485262.0
        }
      ]
    },
    {
      "id": "mqt6ejh",
      "author": "AggravatingStudent81",
      "body": "soon enough during this brief summer, my bones began showing and my friends made comments on them. From there I became obsessed w being thin.",
      "created_utc": 1746494294.0,
      "score": 3,
      "context": [
        {
          "id": "mqt67la",
          "author": "AggravatingStudent81",
          "body": "My gym membership stopped being free due to summer, so I subconsciously began not eating and going on more and more walks. During this time period ( I was 21 and in collage, I would begin blacking out almost every time I drank. I also began getting tons of physical validation from people as I was working at a popular bar/ restaurant at the time). I remember eating MnMs and going on an hour long walk after.",
          "created_utc": 1746494226.0
        }
      ]
    },
    {
      "id": "mqy7jfk",
      "author": "HorrorOne2731",
      "body": "My maternal grandfather said comments about my weight too! He even bribed my grandma and cousin with money if they lost weight.\n\nAlso him and my mom’s brother said hateful to my mom about her weight. My uncle even would weigh his wife every morning.\n\nMy family is fucked up when it comes to weight.",
      "created_utc": 1746563935.0,
      "score": 2,
      "context": [
        {
          "id": "mqvnojf",
          "author": "fruityicecream",
          "body": "When I was 11 years old, my paternal grandmother brought up my weight, a topic that had never occurred to me before. She encouraged me to ride a bicycle up and down her driveway for hours during the summer. By the time I was 12, my maternal grandfather was the first to point out that I was underweight and suggested that I might have an ED.\n\nNow, at 37, I still struggle with these issues.",
          "created_utc": 1746537135.0
        }
      ]
    },
    {
      "id": "mqshsm4",
      "author": "Icy_Judgment6504",
      "body": "I wonder how many of us are cross country/track people 🥲",
      "created_utc": 1746485917.0,
      "score": 4,
      "context": [
        {
          "id": "mqqn4v1",
          "author": "Icy_Judgment6504",
          "body": "Sorry for the length, but I’ve been fighting relapse and so I’ve been thinking about this a lot.\n\nI was about 14, had been on track and cross country team but was asked to start training for sprints… I had already had some issues but we were doing time trials for our upcoming meet one day, and I was standing next to my coach watching one of the sprinters who’d been training for varsity sprints for awhile already. \n\nAs she ran past us, he commented about how you could barely hear her feet touch the ground she’s so light on her feet. He just meant her form was good, but for me, I already had noticed how super super super thin she was, and I internalized that as needing to lose lots of weight, and that night after practice — I skipped dinner. \n\nAnd then I’d go on 3 or 4 hours jogging every single day, even after practice, even late at night or early morning whenever my parents wouldn’t see. And only eating apples and getting really angry if I was expected to eat dinner with the whole family at the table. Totally fasting, and then right before track practice I would eat just a handful of trail mix so I wouldn’t pass out. Soon after the school blood drives, which I always did, began turning me away because of my weight. And that’s how it started for me.",
          "created_utc": 1746465782.0
        },
        {
          "id": "mqs3wfg",
          "author": "prettipain",
          "body": "cross country started mine too :(",
          "created_utc": 1746481319.0
        }
      ]
    },
    {
      "id": "mr29wdm",
      "author": "fruityicecream",
      "body": "Same. My dad and one of his sisters suffer from undiagnosed EDs. Just a few weeks ago, my 72 year old dad got upset after he gained some weight after a midnight snack.",
      "created_utc": 1746624765.0,
      "score": 1,
      "context": [
        {
          "id": "mqvnojf",
          "author": "fruityicecream",
          "body": "When I was 11 years old, my paternal grandmother brought up my weight, a topic that had never occurred to me before. She encouraged me to ride a bicycle up and down her driveway for hours during the summer. By the time I was 12, my maternal grandfather was the first to point out that I was underweight and suggested that I might have an ED.\n\nNow, at 37, I still struggle with these issues.",
          "created_utc": 1746537135.0
        },
        {
          "id": "mqy7jfk",
          "author": "HorrorOne2731",
          "body": "My maternal grandfather said comments about my weight too! He even bribed my grandma and cousin with money if they lost weight.\n\nAlso him and my mom’s brother said hateful to my mom about her weight. My uncle even would weigh his wife every morning.\n\nMy family is fucked up when it comes to weight.",
          "created_utc": 1746563935.0
        }
      ]
    },
    {
      "id": "mqvttk8",
      "author": "Zanci19",
      "body": "Me too!",
      "created_utc": 1746539197.0,
      "score": 2,
      "context": [
        {
          "id": "mqqn4v1",
          "author": "Icy_Judgment6504",
          "body": "Sorry for the length, but I’ve been fighting relapse and so I’ve been thinking about this a lot.\n\nI was about 14, had been on track and cross country team but was asked to start training for sprints… I had already had some issues but we were doing time trials for our upcoming meet one day, and I was standing next to my coach watching one of the sprinters who’d been training for varsity sprints for awhile already. \n\nAs she ran past us, he commented about how you could barely hear her feet touch the ground she’s so light on her feet. He just meant her form was good, but for me, I already had noticed how super super super thin she was, and I internalized that as needing to lose lots of weight, and that night after practice — I skipped dinner. \n\nAnd then I’d go on 3 or 4 hours jogging every single day, even after practice, even late at night or early morning whenever my parents wouldn’t see. And only eating apples and getting really angry if I was expected to eat dinner with the whole family at the table. Totally fasting, and then right before track practice I would eat just a handful of trail mix so I wouldn’t pass out. Soon after the school blood drives, which I always did, began turning me away because of my weight. And that’s how it started for me.",
          "created_utc": 1746465782.0
        },
        {
          "id": "mqs3wfg",
          "author": "prettipain",
          "body": "cross country started mine too :(",
          "created_utc": 1746481319.0
        },
        {
          "id": "mqshsm4",
          "author": "Icy_Judgment6504",
          "body": "I wonder how many of us are cross country/track people 🥲",
          "created_utc": 1746485917.0
        }
      ]
    }
  ]
}