{
  "id": "1kmk5w8",
  "subreddit": "EatingDisorders",
  "author": "None",
  "created_utc": 1747241475.0,
  "title": "Am I overreacting or was my therapist being unprofessional",
  "selftext": "I’ve been seeing a therapist for the past month primarily for my depression and anxiety. My ED (binge eating) has been triggered by stress and self-image issues recently. I brought up my history and my recent behaviors with her, and I felt like her response was super inappropriate.\n\nShe started telling me about how she had tried Ozempic last year and had to have her gallbladder removed because of it. Then she told me how she’s on a keto diet because she can’t have bread or carbs…I was so flabbergasted by what she said I kind of zoned out and just sort of nodded along silently. She was basically saying that cutting out bread worked for her but I had to find what worked for me….\n\nI don’t know if I’m overreacting. I feel like I’m valid in thinking that was super inappropriate and not at all a professional response from a therapist. I feel like “breaking up” with her over text. I just feel really sad and upset. It’s so hard finding a good therapist. I feel like I’ve wasted sessions. \n\nEdit for spelling",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1kmk5w8/am_i_overreacting_or_was_my_therapist_being/",
  "score": 65,
  "num_comments": 36,
  "comments": [
    {
      "id": "mscr7oz",
      "author": "bmorelikewater",
      "body": "This was completely inappropriate. I’ve never had a therapist discuss dieting with me, whether I told them about my ED or not, and I’ve been around the block a few times. I feel like it would be therapist 101 to not discuss diet with an ED client…I would view this as a huge red flag and I think you are most definitely valid in thinking it was inappropriate.",
      "created_utc": 1747263022.0,
      "score": 52,
      "context": []
    },
    {
      "id": "mscxmso",
      "author": "HorrorOne2731",
      "body": "Definitely inappropriate. The first time I told my therapist I have suffered from bulimia, she said I was the original mukbanger.",
      "created_utc": 1747265205.0,
      "score": 19,
      "context": []
    },
    {
      "id": "mscxnsf",
      "author": "HarzardousHarlot",
      "body": "Def inappropriate. I'd also argue that your therapist has disordered eating habits if she's cutting out entire food groups for any reason other than an  intolerance or allergy. Whatever her deal is, she should know better, especially if she knows your ED history & knows that you're having a difficult time with said ED.\n\nEdit: grammer",
      "created_utc": 1747265215.0,
      "score": 12,
      "context": []
    },
    {
      "id": "msfri41",
      "author": "Short-Art-2620",
      "body": "That’s not okay for her to say and tou are defs not overreacting!! And the fact they were so blatant and unaware of their own internalisation of diet culture or weight bias is not good. I would find a different therapist! (And if possible tell them why!). Even if you tell them and keep trying, this person obviously has a lot of internal work to do before treating EDs, so best to find someone who can do good by you and give you the support you deserve.",
      "created_utc": 1747311927.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msi5snw",
      "author": "828_temp",
      "body": "If my therapist discussed her diet with me that would be automatic firing lmao.",
      "created_utc": 1747338198.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msj8j2r",
      "author": "Kimmy_Kitty",
      "body": "Please please report her to the board!!! This was super inappropriate, I don’t get how people like your therapist have a license….",
      "created_utc": 1747350283.0,
      "score": 3,
      "context": []
    },
    {
      "id": "msf1z8t",
      "author": "WishingYouHappy",
      "body": "Hey friend, \n\nPart of the therapeutic process is bringing up when something has made you uncomfortable and hashing this out within the therapeutic space. That's the real test of the relationship and not what they say. Although, admittedly, what they say is pretty important. Especially when they miss the mark like in this case! \n\nSo, my questions for you are: Are you ready to have this conversation? Have they made you feel safe enough to do so or do you need to start again with a more ED-safe therapist? \n\nAll the best.",
      "created_utc": 1747299092.0,
      "score": 4,
      "context": []
    },
    {
      "id": "msg47ov",
      "author": "taypaigeg",
      "body": "can someone explain how this is inappropriate of the therapist",
      "created_utc": 1747316411.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msg6n43",
      "author": "eagle_patronus",
      "body": "Super weird! I can *kinda* see mentioning different options or whatever, but it’s like she was throwing sincere options at you. Or, giving you ideas, I mean. Definitely not cool.",
      "created_utc": 1747317199.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msg9v3t",
      "author": "somehowstillalivelol",
      "body": "dump them and find a therapist who has experience with eds. i remember telling a therapist i had finally started eating gelato but still couldn’t eat ice cream (while i was actively trying to get into recovery for my ed) and he said gelato was more fattening. i haven’t had gelato since. my new therapist is an ocd therapist but worked with eds for most of her career. her attitude is SOOOO much better.",
      "created_utc": 1747318231.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msgxv9p",
      "author": "JumpingGrace",
      "body": "**Absolutely inappropriate.** \n\n***Obesity is a medical condition***, ***it's not a moral shortcoming,*** I say this in reference not that morality precludes inappropriateness, but that medical conditions should not in any way be a segue into self disclosure. In  ways which they wouldn't/shouldn't discuss which high blood pressure medications worked best or which anti-depressant or mood stabilizer they are on, there is absolutely **zero** reasons they should discuss ANY medication they take with their patient! That is beyond inappropriate and I am reeling over here, gobsmacked that people like this cary a license. \n\n\n\nOP-- You are more than valid in your feelings, justified doesn't even touch the tip of what I would say you are experiencing. Not only was it dismissive of your own struggles, it is dangerous as your therapist/therapists wield powerful swords that sear wounds while pouring salt in them,  telling clients it's a healing salve.  I am so incredibly (proud doesn't begin to embody it) that you recognized this therapists illness and are standing up for yourself and for your life.\n\n  \nYou do not have to suffer, and you most definitely don't have to suffer at the hands.of someone who is supposed to be helping you.\n\nShame on them.",
      "created_utc": 1747325331.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msj0x4u",
      "author": "Zeffysaxs",
      "body": "OP, change therapists. If she is with an agency, request one that works with EDs as well. \nShe was entirely unprofessional and actually just triggering? \nShe has her own problems and sounds like shes trying to ‘compete’ with you.\n\nGood on you for not backing down on ur opinion",
      "created_utc": 1747347595.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msnltsl",
      "author": "kimchiplug",
      "body": "Unfortunately a lot of therapists claim ED expertise when they mean they talked about it for an hour in one class. My first therapist literally taught me how to purge better, cheaper, and more discreetly… Personally, I’d just ghost her because I wouldn’t want to deal with her potential emotions around raising criticism, but evaluate what is best for you",
      "created_utc": 1747415009.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msp4sht",
      "author": "ednosacct",
      "body": "Yeah she should have never mentioned anything about dieting and should have validated you and helped you with your thoughts and how to overcome them… report her because that’s not okay to say",
      "created_utc": 1747431738.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msp8n3t",
      "author": "Grey-Dog13",
      "body": "hmm… I mean since I was there I don’t know the exact thing said and tone, but GLP-1s can be prescribed for binge eating so maybe it was a warning about that. \nAs for the bread and carbs she may have been suggesting that she found her trigger foods and what helped is cutting them out. \nIf she said it exactly how you are saying, then yes I agree how it was said was inappropriate.",
      "created_utc": 1747433027.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msq2dw7",
      "author": "Jazzlike-Walrus1467",
      "body": "I personally actually really like knowing a bit about my therapist, It feels safer and easier to be open up when I can connect on a human level if that makes sense? \nI’ve had multiple other therapists and always felt like I was just talking to an emotionless robot and I’m am not ok with spending a large amount of money on that. My opinion seems to be unpopular though, as I’m am yet to talk to someone who thinks the same as I do. Everyone is always uninterested in their therapist and only wants to talk about themselves and fair enough, it’s their money so they should get as much out of their sessions as they need so no judgement. \n\nThat said, there is still a line and your therapist crossed it by talking about something that was clearly making you uncomfortable. It’s weird that a therapist didn’t seem to pick up that you didn’t want to continue that conversation and I sorry that happened to you. I’m also really easily triggered with my ED so I feel for you that you went to what was supposed to be in a safe space and felt the opposite.\n\nIt’s possible that her telling you about her experience with trying ozempic and how it resulted in the loss of her gallbladder was well intentioned and she was trying to warn you that the effects can be detrimental and in a way you might learn from her mistake? And maybe that would help someone else, but as a therapist, she should be able to read the room and change the way she’s talking and she failed to do that and instead triggered you and made it feel more like a vent rather than advice. If this isn’t the first time then i definitely think you should look for another therapist that suits you, especially with the fact that’s she doesn’t show up to you sessions on time and cancels them without warning. \n\nSounds like she is not in the headspace to be counselling other people, especially something as complex as ED’s where you have to be so careful and switched on to work with them. I hope she learns better and doesn’t ruin her career by upsetting all her clients.\nAnd I hope you find a therapist that works for you and can recover ❤️‍🩹",
      "created_utc": 1747444646.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msroz8y",
      "author": "None",
      "body": "It's amazing how some people have careers doing the complete golden example of \"what-not-to-do.\" Once had a couples therapist who advertised specialized experience in lgbtq+ issues as well as ED issues tell me \"does that bother you? But it's very cool right now to be bisexual. everyone wants to be.\" and tell my husband that \"You don't need to lose that much weight. what, another 20 pounds? That's doable. A healthier diet goes a long way, so (insert more diet rambling I was mortified to hear).\" She then doubled down by telling me how awful it must be for my poor husband to have to be married to someone with depression and S.I. yikes.",
      "created_utc": 1747474762.0,
      "score": 1,
      "context": []
    },
    {
      "id": "msy494a",
      "author": "Bigest_Smol_Employee",
      "body": "i think your therapist is umprofessional, he had to tell you exactly what you need",
      "created_utc": 1747572978.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mt7p01w",
      "author": "EconomicsAny5921",
      "body": "Stop going to therapists and dietitians.\n\n\n UNLESS THEY HAVE HAD AN ED AND RECOVERED THEMSELVES. \n\n\nThese ppl have no idea how to recover from an ED. If you need help talk to a recovery coach whose recovered and can actually be of help. \nDietitians will put you on meal plans and you will never recover this way either. Someone else telling you how and what to eat won't work. You need to do the difficult work let go of all your control and fear then you will recover. ",
      "created_utc": 1747699427.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mt3v0zp",
      "author": "life_hates_mee",
      "body": "Hey need somekne to talk to? Im always here btw like a therapist kinda. Also im not a creep istg im a teen girl (pls belive me 😭) \nIg if u wana talk: stanmarsh1922",
      "created_utc": 1747655492.0,
      "score": 0,
      "context": []
    },
    {
      "id": "mscrxqm",
      "author": "None",
      "body": "Thanks for the validation. It happened yesterday and it feels like emotional whiplash. I’m in shock about it honestly. I’m grateful I’m not in the worst place with my ED because I know that if I had been in the headspace I was in a few years ago, that would have been very triggering for me. It makes me question her qualifications.",
      "created_utc": 1747263264.0,
      "score": 11,
      "context": [
        {
          "id": "mscr7oz",
          "author": "bmorelikewater",
          "body": "This was completely inappropriate. I’ve never had a therapist discuss dieting with me, whether I told them about my ED or not, and I’ve been around the block a few times. I feel like it would be therapist 101 to not discuss diet with an ED client…I would view this as a huge red flag and I think you are most definitely valid in thinking it was inappropriate.",
          "created_utc": 1747263022.0
        }
      ]
    },
    {
      "id": "msdfa1p",
      "author": "ilikegaystuff-",
      "body": "oh hell no",
      "created_utc": 1747271320.0,
      "score": 7,
      "context": [
        {
          "id": "mscxmso",
          "author": "HorrorOne2731",
          "body": "Definitely inappropriate. The first time I told my therapist I have suffered from bulimia, she said I was the original mukbanger.",
          "created_utc": 1747265205.0
        }
      ]
    },
    {
      "id": "msr258d",
      "author": "vaffaanculo",
      "body": "What an insane thing to say to someone who is struggling, not to mention completely out of pocket as a professional. I'm sorry she said that to you, its so thoughtless.",
      "created_utc": 1747460590.0,
      "score": 5,
      "context": [
        {
          "id": "mscxmso",
          "author": "HorrorOne2731",
          "body": "Definitely inappropriate. The first time I told my therapist I have suffered from bulimia, she said I was the original mukbanger.",
          "created_utc": 1747265205.0
        }
      ]
    },
    {
      "id": "msgup5n",
      "author": "None",
      "body": "That is crazy",
      "created_utc": 1747324399.0,
      "score": 3,
      "context": [
        {
          "id": "mscxmso",
          "author": "HorrorOne2731",
          "body": "Definitely inappropriate. The first time I told my therapist I have suffered from bulimia, she said I was the original mukbanger.",
          "created_utc": 1747265205.0
        }
      ]
    },
    {
      "id": "msgusbi",
      "author": "None",
      "body": "Yeah. I’m going to text her today. I was going to wait to tell her in person at our next session but don’t even want to waste my time",
      "created_utc": 1747324424.0,
      "score": 9,
      "context": [
        {
          "id": "mscxnsf",
          "author": "HarzardousHarlot",
          "body": "Def inappropriate. I'd also argue that your therapist has disordered eating habits if she's cutting out entire food groups for any reason other than an  intolerance or allergy. Whatever her deal is, she should know better, especially if she knows your ED history & knows that you're having a difficult time with said ED.\n\nEdit: grammer",
          "created_utc": 1747265215.0
        }
      ]
    },
    {
      "id": "msgvytk",
      "author": "None",
      "body": "I think I’m done with her at this point. There were some other things that rubbed me the wrong way. She would always show up ten minutes late to appointments. Last week she rescheduled our session without telling me or asking me when I was available. I had to ask her after getting an appointment reminder for the new time. This is the nail on the coffin and I want a therapist that is professional.",
      "created_utc": 1747324767.0,
      "score": 7,
      "context": [
        {
          "id": "msf1z8t",
          "author": "WishingYouHappy",
          "body": "Hey friend, \n\nPart of the therapeutic process is bringing up when something has made you uncomfortable and hashing this out within the therapeutic space. That's the real test of the relationship and not what they say. Although, admittedly, what they say is pretty important. Especially when they miss the mark like in this case! \n\nSo, my questions for you are: Are you ready to have this conversation? Have they made you feel safe enough to do so or do you need to start again with a more ED-safe therapist? \n\nAll the best.",
          "created_utc": 1747299092.0
        }
      ]
    },
    {
      "id": "msoevwa",
      "author": "Hot-Mall-821",
      "body": "I agree… if it’s the right therapist and clearly this one is not. The client should not have to b me educating the therapist on why this is problematic. This tells me the therapist is not competent in treating BED or EDs in general and should seek that should she want to work with OP and folks with EDs.",
      "created_utc": 1747423714.0,
      "score": 2,
      "context": [
        {
          "id": "msf1z8t",
          "author": "WishingYouHappy",
          "body": "Hey friend, \n\nPart of the therapeutic process is bringing up when something has made you uncomfortable and hashing this out within the therapeutic space. That's the real test of the relationship and not what they say. Although, admittedly, what they say is pretty important. Especially when they miss the mark like in this case! \n\nSo, my questions for you are: Are you ready to have this conversation? Have they made you feel safe enough to do so or do you need to start again with a more ED-safe therapist? \n\nAll the best.",
          "created_utc": 1747299092.0
        }
      ]
    },
    {
      "id": "msgaeh5",
      "author": "somehowstillalivelol",
      "body": "engaging in diet culture talk/ozempic talk with someone who has an ed can fuel the ed/body issues. not to mention that the therapist’s experience with dieting doesn’t actually help address the body image issues or the binge-eating behaviors. she didn’t bring up new coping skills or working through the issues, she brought up her own experience of trying to lose weight.",
      "created_utc": 1747318400.0,
      "score": 2,
      "context": [
        {
          "id": "msg47ov",
          "author": "taypaigeg",
          "body": "can someone explain how this is inappropriate of the therapist",
          "created_utc": 1747316411.0
        }
      ]
    },
    {
      "id": "mwmt0nr",
      "author": "Repulsive-Cod-1571",
      "body": "Wondering the same - it seems like she was trying to show empathy and explain that she struggled the year before as well? I could be wrong, need more context",
      "created_utc": 1749377227.0,
      "score": 2,
      "context": [
        {
          "id": "msg47ov",
          "author": "taypaigeg",
          "body": "can someone explain how this is inappropriate of the therapist",
          "created_utc": 1747316411.0
        }
      ]
    },
    {
      "id": "msj4jji",
      "author": "ReplacementLess3940",
      "body": "Report her…",
      "created_utc": 1747348864.0,
      "score": 3,
      "context": [
        {
          "id": "mscr7oz",
          "author": "bmorelikewater",
          "body": "This was completely inappropriate. I’ve never had a therapist discuss dieting with me, whether I told them about my ED or not, and I’ve been around the block a few times. I feel like it would be therapist 101 to not discuss diet with an ED client…I would view this as a huge red flag and I think you are most definitely valid in thinking it was inappropriate.",
          "created_utc": 1747263022.0
        },
        {
          "id": "mscrxqm",
          "author": "None",
          "body": "Thanks for the validation. It happened yesterday and it feels like emotional whiplash. I’m in shock about it honestly. I’m grateful I’m not in the worst place with my ED because I know that if I had been in the headspace I was in a few years ago, that would have been very triggering for me. It makes me question her qualifications.",
          "created_utc": 1747263264.0
        }
      ]
    },
    {
      "id": "msr2s0e",
      "author": "HorrorOne2731",
      "body": "She is not my therapist anymore. Also she would eat during our sessions. Felt uncomfortable to say anything to her.",
      "created_utc": 1747460942.0,
      "score": 3,
      "context": [
        {
          "id": "mscxmso",
          "author": "HorrorOne2731",
          "body": "Definitely inappropriate. The first time I told my therapist I have suffered from bulimia, she said I was the original mukbanger.",
          "created_utc": 1747265205.0
        },
        {
          "id": "msr258d",
          "author": "vaffaanculo",
          "body": "What an insane thing to say to someone who is struggling, not to mention completely out of pocket as a professional. I'm sorry she said that to you, its so thoughtless.",
          "created_utc": 1747460590.0
        }
      ]
    },
    {
      "id": "msi60i0",
      "author": "HarzardousHarlot",
      "body": "Agreed, I hope it goes well!",
      "created_utc": 1747338263.0,
      "score": 2,
      "context": [
        {
          "id": "mscxnsf",
          "author": "HarzardousHarlot",
          "body": "Def inappropriate. I'd also argue that your therapist has disordered eating habits if she's cutting out entire food groups for any reason other than an  intolerance or allergy. Whatever her deal is, she should know better, especially if she knows your ED history & knows that you're having a difficult time with said ED.\n\nEdit: grammer",
          "created_utc": 1747265215.0
        },
        {
          "id": "msgusbi",
          "author": "None",
          "body": "Yeah. I’m going to text her today. I was going to wait to tell her in person at our next session but don’t even want to waste my time",
          "created_utc": 1747324424.0
        }
      ]
    },
    {
      "id": "msj5ps6",
      "author": "WishingYouHappy",
      "body": "Excellent. I can hear that you are aware of how you wish to be treated and that makes all the difference:\n\nRespect for ourselves and our struggles is foundational to our recovery and your therapist, imo, should be showing you how to do this. \n\nIdk about you but the fact that you're not willing to put up with it is a win in my book.",
      "created_utc": 1747349283.0,
      "score": 3,
      "context": [
        {
          "id": "msf1z8t",
          "author": "WishingYouHappy",
          "body": "Hey friend, \n\nPart of the therapeutic process is bringing up when something has made you uncomfortable and hashing this out within the therapeutic space. That's the real test of the relationship and not what they say. Although, admittedly, what they say is pretty important. Especially when they miss the mark like in this case! \n\nSo, my questions for you are: Are you ready to have this conversation? Have they made you feel safe enough to do so or do you need to start again with a more ED-safe therapist? \n\nAll the best.",
          "created_utc": 1747299092.0
        },
        {
          "id": "msgvytk",
          "author": "None",
          "body": "I think I’m done with her at this point. There were some other things that rubbed me the wrong way. She would always show up ten minutes late to appointments. Last week she rescheduled our session without telling me or asking me when I was available. I had to ask her after getting an appointment reminder for the new time. This is the nail on the coffin and I want a therapist that is professional.",
          "created_utc": 1747324767.0
        }
      ]
    },
    {
      "id": "msxdr73",
      "author": "WishingYouHappy",
      "body": "Yep, you've hit the nail on the head and maybe I should clarify:\n\nSometimes therapists work outside of their competency and it's highly unethical (at least, where I'm from). It needs to be drawn to their attention that they've messed up (which a client could do, which could be immensely, immensely therapeutic with the right therapist) but, as you've said, even then it's not on the client to bring up such an unconformable conversation. They need to do better as the therapist.",
      "created_utc": 1747558813.0,
      "score": 2,
      "context": [
        {
          "id": "msf1z8t",
          "author": "WishingYouHappy",
          "body": "Hey friend, \n\nPart of the therapeutic process is bringing up when something has made you uncomfortable and hashing this out within the therapeutic space. That's the real test of the relationship and not what they say. Although, admittedly, what they say is pretty important. Especially when they miss the mark like in this case! \n\nSo, my questions for you are: Are you ready to have this conversation? Have they made you feel safe enough to do so or do you need to start again with a more ED-safe therapist? \n\nAll the best.",
          "created_utc": 1747299092.0
        },
        {
          "id": "msoevwa",
          "author": "Hot-Mall-821",
          "body": "I agree… if it’s the right therapist and clearly this one is not. The client should not have to b me educating the therapist on why this is problematic. This tells me the therapist is not competent in treating BED or EDs in general and should seek that should she want to work with OP and folks with EDs.",
          "created_utc": 1747423714.0
        }
      ]
    },
    {
      "id": "msify5d",
      "author": "taypaigeg",
      "body": "Hmm but the goal of therapy is to address triggers, not avoid them. I would argue it builds rapport, therapy is relational, and it doesn’t strike me as inappropriate given that the therapist doesn’t seem to be seeking validation etc- only attempting build relationship and further a dialogue around one of their clients triggers. But IDK, just my opinion. But if the client doesn’t like it, that’s still valid- it doesn’t always mean something inappropriate is happening though, just that it’s not the right fit",
      "created_utc": 1747341150.0,
      "score": 3,
      "context": [
        {
          "id": "msg47ov",
          "author": "taypaigeg",
          "body": "can someone explain how this is inappropriate of the therapist",
          "created_utc": 1747316411.0
        },
        {
          "id": "msgaeh5",
          "author": "somehowstillalivelol",
          "body": "engaging in diet culture talk/ozempic talk with someone who has an ed can fuel the ed/body issues. not to mention that the therapist’s experience with dieting doesn’t actually help address the body image issues or the binge-eating behaviors. she didn’t bring up new coping skills or working through the issues, she brought up her own experience of trying to lose weight.",
          "created_utc": 1747318400.0
        }
      ]
    },
    {
      "id": "msguzmm",
      "author": "None",
      "body": "Yep. She didn’t ask me to elaborate on anything either. Just jumped right into her diet.",
      "created_utc": 1747324483.0,
      "score": 1,
      "context": [
        {
          "id": "msg47ov",
          "author": "taypaigeg",
          "body": "can someone explain how this is inappropriate of the therapist",
          "created_utc": 1747316411.0
        },
        {
          "id": "msgaeh5",
          "author": "somehowstillalivelol",
          "body": "engaging in diet culture talk/ozempic talk with someone who has an ed can fuel the ed/body issues. not to mention that the therapist’s experience with dieting doesn’t actually help address the body image issues or the binge-eating behaviors. she didn’t bring up new coping skills or working through the issues, she brought up her own experience of trying to lose weight.",
          "created_utc": 1747318400.0
        }
      ]
    }
  ]
}