{
  "id": "1kqepj5",
  "subreddit": "EatingDisorders",
  "author": "somehowstillalivelol",
  "created_utc": 1747668829.0,
  "title": "doctors who praise weight loss",
  "selftext": "went to the allergist today and i had lost weight since i visited last time (healthy way this time) and was immediately praised for it. i totally understand that losing weight can help mitigate other health concerns but the automatic praise feels so uncomfortable now that i’m in recovery. like when i was my lw i was not healthy in any way. then everyone became concerned when i gained weight whilst entering recovery. \n\nlike no wonder this is such a hard thing to beat. it’s completely reinforced in so many different ways. \n\njust needed to vent",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1kqepj5/doctors_who_praise_weight_loss/",
  "score": 78,
  "num_comments": 9,
  "comments": [
    {
      "id": "mt523he",
      "author": "lowkeyalchie",
      "body": "I agree wholeheartedly, and it isn't just doctors. Even as a kid, I was praised by grown women for losing weight. The last time I relapsed, I got more attention than I ever thought possible. I don't mean to glamorize low weights, though, because there is a definite point where your weight loss becomes uncomfortable and you become invisible again. But yeah, I've put on some recovery weight, and I'm still in the recommended range, but my medical paperwork tells me to lose weight again. It's maddening.",
      "created_utc": 1747670075.0,
      "score": 20,
      "context": []
    },
    {
      "id": "mt5kd1x",
      "author": "-abby-normal",
      "body": "This is so real. By the time people stop complimenting you and start acting concerned, you’re already deep in it.",
      "created_utc": 1747675447.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mt593y9",
      "author": "Mysterious-Sell6370",
      "body": "I so relate to this. I had a orthopaedic surgeon tell me I looked good for losing weight and should keep it up. I was relapsing into an ED that he knew about. I’m still pissed about it. When people consistently praise the ED, how are you supposed to recover?",
      "created_utc": 1747672169.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mt604u5",
      "author": "rinatoes",
      "body": "When I was a heavy bulimic (w/o my dr knowing but my step mom suspecting) she was like ‘wow you’ve lost 50 pounds since your last appointment’ but then at the same time went ‘hmm your lymph nodes are really swollen’. Sigh. Can’t expect them to be mind readers but she would always get on my weight and when I was finally bones she wanted me to get tested for MONO and wondered why my iron was low. Lmao.",
      "created_utc": 1747680008.0,
      "score": 10,
      "context": []
    },
    {
      "id": "mt6dw5o",
      "author": "DrKoalii",
      "body": "I was praised by doctors for months before I was finally admitted to a treatment facility. It’s an uphill battle because the results of your behaviors will continue to be praised in this society, even if it’s killing you.",
      "created_utc": 1747684124.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mtcuryq",
      "author": "Current_Pumpkin439",
      "body": "My male friend had _congratulated_ me when I complained to him about my health-issues related weight loss",
      "created_utc": 1747772407.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mt77zz4",
      "author": "peargreentea",
      "body": "My doctor praising my weight loss is exactly how I ended up here 😅",
      "created_utc": 1747693478.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mt605ty",
      "author": "rinatoes",
      "body": "Literally",
      "created_utc": 1747680016.0,
      "score": 2,
      "context": [
        {
          "id": "mt5kd1x",
          "author": "-abby-normal",
          "body": "This is so real. By the time people stop complimenting you and start acting concerned, you’re already deep in it.",
          "created_utc": 1747675447.0
        }
      ]
    },
    {
      "id": "mtd6dox",
      "author": "somehowstillalivelol",
      "body": "ugh i hate that. when i had food poisoning once, a friend was like “at least you lost some weight!” like babe i was on the floor vomiting for a week",
      "created_utc": 1747775859.0,
      "score": 2,
      "context": [
        {
          "id": "mtcuryq",
          "author": "Current_Pumpkin439",
          "body": "My male friend had _congratulated_ me when I complained to him about my health-issues related weight loss",
          "created_utc": 1747772407.0
        }
      ]
    }
  ]
}