{
  "id": "1ksbay4",
  "subreddit": "EatingDisorders",
  "author": "cucumberrule",
  "created_utc": 1747867109.0,
  "title": "How do you guys stop thinking abt food 24/7",
  "selftext": "I love food and I crave it all the time and I’m always thirsty(mostly bc I don’t drink water at all). My cravings lead to impulsive food purchases and then it all ends up to waste bc i get tired after a couple bites/sips. My irregular eating has also become a problem. I would eat breakfast,lunch and dinner and regular times and would have a midday snack but then around 9 at night no matter how much I try to hold myself back I always reach for my chips which then leads to me eating every snack i see in my room. i then get nauseous and so sick later. please help me get rid of this habit. no matter how much i try to implement good habits this cycle continues to persist",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1ksbay4/how_do_you_guys_stop_thinking_abt_food_247/",
  "score": 39,
  "num_comments": 15,
  "comments": [
    {
      "id": "mtl3k7u",
      "author": "Flat-Chance3301",
      "body": "really the biggest thing that has helped me is eating enough. but even so, i still can’t get rid of my food thoughts with just that. i recommend finding a distraction, like reading, finding a new tv show, etc. especially the tv show one imo— that made the least room in my mind for food noise. ",
      "created_utc": 1747879888.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mtlajdf",
      "author": "basically_dead_now",
      "body": "Honestly, I kind of just get so distracted that I forget I need to eat. I know this is very bad, especially since I struggle with anorexia, but I don't always do it intentionally. Just don't do what I do",
      "created_utc": 1747882366.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mtmkrgy",
      "author": "SnurflePuffinz",
      "body": "Some of what you said leads me to say malnourishment... the absence of nutrient density, potentially calories too but then how you \"get tired\" and \"sick\" sounds like insulin resistance.\n\nlook up what the SAD (Sad American Diet) is. Maybe not enough protein in your diet, potassium, magnesium, etc.",
      "created_utc": 1747906372.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mukm7wq",
      "author": "nnq2",
      "body": "Logged back into Reddit after reading this to say that you already said the reason you're feeling this way: you don't drink water. HYDRATE!! Often times we are just thirsty, not hungry. Drinking enough water is not only beneficial for your overall health but it helps you feel more satiated. When I'm dehydrated I'm more likely to crave things with a high carb content because my body needs quick energy due to a lack of energy from water (yes hydration helps with maintaining energy). I also get more irritated, feel more sluggish and just overall groggy. Drinking enough, whether it be water, sparkling water, using water drop pods and some fun ice cubes to add flavor and interest, is SO important. \n\nAlso a late night snack is fine. As long as you give yourself at least an hour before you lay down for bed and it's not too dense of a meal you should be fine. One thing you can do to prevent form binging after a post dinner snack is ensuring that your snack has protien in it or has a lot of volume. For example a cookie with lots of fruit on the side, or a microwave mug cake with peanutbutter or protien powder (id even add fruit w that too tbh). Adding fruit also contributes to the amount of water your consuming. Also there's low calorie options if you just want to snack and don't want a full blown meal like rice cakes and different types of cereal (I was out on drizzlicious this year and they're so good). I'd still pair the snack with some type of fruit or drink that will keep you from eating the whole bag, but you get the gyst. I know that whole thing  of replacing a cookie with an apple can be unrealistic when you're craving the flavor and the texture of a cookie so look for some alternatives that will meet your cravings instead of making them worse!\n\nI know this was a kind of tangent but this is something that I used to struggle with (still do but less often) and prioritizing my hydration along with other lifestyle changes has really helped me, so I hope this can help you too! :) ",
      "created_utc": 1748374984.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mtmpbdj",
      "author": "Substantial_Craft_87",
      "body": "When I finally beat my anorexia and started eating well .\n\nWhile ny anorexia, when i rarely got dopamine from smth other than food i’d be so happy but now this dopamine i get from other things stays and lasts the whole day. It makes you feel like “i have the weight of the world on me, I cant just think about food”.\n\nBonus tip, fatty foods have been proven to improve brain health. I don’t wanna exaggerate but ever since I incorporated a good amount of fats, not only did I feel satisfied and full but my focus increased. I began doing things for longer, finishing tasks for my uni more efficiently.",
      "created_utc": 1747908984.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mtmvd0z",
      "author": "ranavirago",
      "body": "Tbh, I eat what I want when I want it. I don't stick to any sort of set meal times, but I do notice that I need to eat about every three hours I'm awake. \n\nPotato chips are healthier than starving! Try to keep a variety of foods of all kinds of textures and flavors that you enjoy on hand. I start obsessing when I start running out of things that I actually want to eat.\n\nAlso, we have to eat every day. It makes sense to be thinking about it a lot, especially if you've been trying not to. Tbh, it's probably a good sign that you're thinking about it. It was nice when I first started to let myself enjoy things I had sworn off for so long. I ate a whole bunch of it until I inevitably got tired of it and it stopped being a such a rare commodity anymore. Part of the recovery process.",
      "created_utc": 1747912040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mto0v6n",
      "author": "lilaclightblue",
      "body": "The one time I can keep the obsession at bay is when I exercise in the morning - once I’ve burned some calories, I can wave away thoughts about food and justify eating when I’m hungry",
      "created_utc": 1747926461.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mtud0d9",
      "author": "Rainy-Ginger",
      "body": "You need real proteín. Meat fish eggs ....and stop buying junk",
      "created_utc": 1748011285.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mubkyb0",
      "author": "OctopuBanana",
      "body": "You probably need professional help. No one in this forum can properly support you the way you need. Also you need to drink water. Malnutricion is probably at play here and not drinking on top of the other issues your body faces just makes everything worse. Make small changed, don't try to change everything at once. That's won't work",
      "created_utc": 1748256323.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muhvqs4",
      "author": "AcanthocephalaNo2750",
      "body": "I crave food but I’m never hungry and feel crap when I do eat",
      "created_utc": 1748344327.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muoprkz",
      "author": "Cute_Site_8145",
      "body": "Eating regularly without restriction. Paying attention without judgement to what I was craving. Asking “why do I want that food?” (E.g. emotional reason, I’m hungry, am I thirsty, does my body needs something and if so what). \n\nWhy aren’t you drinking water? Do you not like the taste or something? ",
      "created_utc": 1748434327.0,
      "score": 1,
      "context": []
    },
    {
      "id": "muj3mrv",
      "author": "Yummyduckit",
      "body": "How can u got distracted? Sounds impossible ...Like literally not eating made you become not productive and weak and dont make me start with the headaches..",
      "created_utc": 1748359599.0,
      "score": 1,
      "context": [
        {
          "id": "mtlajdf",
          "author": "basically_dead_now",
          "body": "Honestly, I kind of just get so distracted that I forget I need to eat. I know this is very bad, especially since I struggle with anorexia, but I don't always do it intentionally. Just don't do what I do",
          "created_utc": 1747882366.0
        }
      ]
    },
    {
      "id": "mujngmt",
      "author": "basically_dead_now",
      "body": "I just kind of forget",
      "created_utc": 1748365209.0,
      "score": 1,
      "context": [
        {
          "id": "mtlajdf",
          "author": "basically_dead_now",
          "body": "Honestly, I kind of just get so distracted that I forget I need to eat. I know this is very bad, especially since I struggle with anorexia, but I don't always do it intentionally. Just don't do what I do",
          "created_utc": 1747882366.0
        },
        {
          "id": "muj3mrv",
          "author": "Yummyduckit",
          "body": "How can u got distracted? Sounds impossible ...Like literally not eating made you become not productive and weak and dont make me start with the headaches..",
          "created_utc": 1748359599.0
        }
      ]
    },
    {
      "id": "mw8mnzo",
      "author": "sailorneptune89",
      "body": "That’s part of an eating disorder, it’s not normal ..but it manifests itself",
      "created_utc": 1749172530.0,
      "score": 1,
      "context": [
        {
          "id": "mtlajdf",
          "author": "basically_dead_now",
          "body": "Honestly, I kind of just get so distracted that I forget I need to eat. I know this is very bad, especially since I struggle with anorexia, but I don't always do it intentionally. Just don't do what I do",
          "created_utc": 1747882366.0
        },
        {
          "id": "muj3mrv",
          "author": "Yummyduckit",
          "body": "How can u got distracted? Sounds impossible ...Like literally not eating made you become not productive and weak and dont make me start with the headaches..",
          "created_utc": 1748359599.0
        }
      ]
    }
  ]
}