{
  "id": "1l1xxb1",
  "subreddit": "EatingDisorders",
  "author": "seektherapythrowaway",
  "created_utc": 1748909353.0,
  "title": "my (f24) husband (m25) supports my eating disorder and im not sure how to feel about it",
  "selftext": "long story short, my husband has been in my life for nearly a decade now and for most of our time as friends, he's known about my ed. I got the diagnosis or AN BP subtype when I was 19. For some context, ive been disordered since I was 13. Im 24 now. Also my husband is very much into working out and going to the gym. Just to give you an idea of what his background is like in terms of health and stuff.\n\nanyways, he used to worry about me, and im sure he still does maybe, but now he doesn't discourage me the way he used to. In fact, he is quite supportive despite me being significantly underweight (i won't go into specifics in hopes that this post will stay up)\n\nbut above it all, my biggest issue is that he also tries to give me advice about exercise and eating which trigger me immensely. I'll say something sometimes but most of the time ill just ignore him. \n\nIts so twisted because I dont want to recover but having him encourage my habits and say \"I support whatever makes you happy honey\",, it sucks, because im not happy and I know what I do isn't right; that I SHOULD stop. But I cant. I just feel like I spiral further and further away from any possibility of recovery every time we have these sort of interactions. Every time ive tried to explain how he isn't being helpful, its like he just doesn't get it. What should I do?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1l1xxb1/my_f24_husband_m25_supports_my_eating_disorder/",
  "score": 53,
  "num_comments": 8,
  "comments": [
    {
      "id": "mvoyo6y",
      "author": "iamakaylet13",
      "body": "A different situation, but still applicable, so bear with me. I have an autoimmune disease that does very bad things to my lungs. My husband and I have both smoked since we got married a million years ago. Recently, my disease came out of remission and my lungs are in really bad shape where if there is any kind of smoke or even strong cleaners near me I literally cannot breathe. Obviously this made quitting smoking for me very easy, but my husband still does smoke because he doesn't have his body reacting in a horrible way when he does, but when he comes near me after having a cigarette, even the lingering smoke on him makes me start to choke. Because it has been a very obvious \"this is going to possibly end your wife's life\", he has taken a lot of steps to reduce his smoking and he changes clothes for when he does. Your ED is just as serious as my situation, it just isn't as immediately visible. I think it's important to have the people around you not add to the harm of your disorder. My husband was annoyed and upset at first (because addictions do that), but when he realized that he was contributing to my poor health, he of course wanted to change to keep me around as long as possible. Please be open and honest with your husband and how his actions affect you and that you need him to change his approaches to your situation if he wants you to live a long, healthy, and happy life.",
      "created_utc": 1748913415.0,
      "score": 45,
      "context": []
    },
    {
      "id": "mvosuex",
      "author": "ThatpersonRobert",
      "body": "Oh brother, I see what you mean.  \n\nOne possibility is that..perhaps he's just accepted your situation ?  Like he understands that there's nothing he can do about it, so he just ignores it.  And that the \"Whatever makes you happy\" thing means that he doesn't want to engage with you about it ?  \n\nHis comments about exercise and eating may simply be him trying to shunt it all off in the direction of \"health\" ?   Which in a way, is also ignoring the issue. \n\n*\"I dont want to recover but having him encourage my habits and say \"I support whatever makes you happy honey\",, it sucks, because im not happy and I know what I do isn't right; that I SHOULD stop. But I cant.\"*\n\nThis seems to me to be the part that he can't understand ?  I mean....if you know you need to recover...why the heck aren't you doing that ?   \n\nWhich is a conveniently simplistic way to look at things. But that's guys for you. \n\nPlus \"not wanting to recover\" isn't really the same thing as \"knowing you need to recover\".  Which may be part of what he can't understand ?  That those two things can exist simultaneously ?\n\nThis is just me of course, but if you really want to gain his attention...you may need to start stressing the \"I need to recover\" part more strongly to him ?\n\nIf you are willing to start taking that path, I mean  ?",
      "created_utc": 1748911331.0,
      "score": 24,
      "context": []
    },
    {
      "id": "mw07it5",
      "author": "booreaves",
      "body": "He’s probably tired. Living with an addiction or disorder is really tough on the partner too. He cannot make you happy and he cannot make you recover. You have to do the work yourself. Pursuing an ED therapist that can do EMDR and a dietician is the best chance you have at recovering. Your relationship probably needs couples therapy. Just know, EDs are tough on the partner too. It sounds like he cares, but he needs to protect himself from your ED too.",
      "created_utc": 1749064930.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mvx952w",
      "author": "slothsock",
      "body": "have you talked with him about it? it sounds like he's skirting away the issue because it makes him uncomfortable or he doesn't fully understand it by simply going \"whatever makes you happy\". If you haven't had the talk, you really should. Loved ones make a big difference in going for full recovery.",
      "created_utc": 1749030109.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mvtqtmq",
      "author": "Odd_Curve6621",
      "body": "If you seek treatment I’m pretty sure Aslana has resources to help family members with EDs. \n\nKind of like instead of AA there is like the friends and family of alcoholics/addicts group that meet and discuss",
      "created_utc": 1748979764.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mw49tql",
      "author": "cupcakewaffles",
      "body": "It sounds like it might be time for a Serious Conversation with him. He needs to know that his behavior is supporting a relapse. Like, literally tell him exactly that",
      "created_utc": 1749123785.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mxhaawe",
      "author": "Independent-A-9362",
      "body": "Keep reinforcing it- he’ll learn \n\nKeep repeating it- say thank you I know your intentions are good, but I need you to stop \n\nI have a rule- no comments or advice and my food or exercise- ever! \n\nIf I ask, it’s ok. If not, he avoids it: took a year if reinforcement but he learned",
      "created_utc": 1749774728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mvs7hrm",
      "author": "yellowposy2",
      "body": "Excellent comment. Agreed OP, he is likely just following your lead at this point. The trouble with severe EDs is that sometimes being underweight is the only visible symptom, so he may not think it’s affecting you that badly. The best thing you can do is very clearly sit down and have the “I need to recover and this is specifically what I need from you to support me in that” conversation. You can include your fears “I’m worried you like me with an ED” etc, but this man is your husband. If he can’t support you in this then there are deeper issues, and likely at this point he just doesn’t know what you need. \n\n\nI went through something similar with my partner. Recently I gained some weight and despite him treating me the same, I was sure he couldn’t be attracted to me since he acted similarly to your partner pre-weight gain. Ultimately though I’ve realized he just thinks I’m hot either way. \n\nBest of luck.",
      "created_utc": 1748963661.0,
      "score": 13,
      "context": [
        {
          "id": "mvosuex",
          "author": "ThatpersonRobert",
          "body": "Oh brother, I see what you mean.  \n\nOne possibility is that..perhaps he's just accepted your situation ?  Like he understands that there's nothing he can do about it, so he just ignores it.  And that the \"Whatever makes you happy\" thing means that he doesn't want to engage with you about it ?  \n\nHis comments about exercise and eating may simply be him trying to shunt it all off in the direction of \"health\" ?   Which in a way, is also ignoring the issue. \n\n*\"I dont want to recover but having him encourage my habits and say \"I support whatever makes you happy honey\",, it sucks, because im not happy and I know what I do isn't right; that I SHOULD stop. But I cant.\"*\n\nThis seems to me to be the part that he can't understand ?  I mean....if you know you need to recover...why the heck aren't you doing that ?   \n\nWhich is a conveniently simplistic way to look at things. But that's guys for you. \n\nPlus \"not wanting to recover\" isn't really the same thing as \"knowing you need to recover\".  Which may be part of what he can't understand ?  That those two things can exist simultaneously ?\n\nThis is just me of course, but if you really want to gain his attention...you may need to start stressing the \"I need to recover\" part more strongly to him ?\n\nIf you are willing to start taking that path, I mean  ?",
          "created_utc": 1748911331.0
        }
      ]
    }
  ]
}