{
  "id": "1l414g3",
  "subreddit": "EatingDisorders",
  "author": "Worried_Appearance19",
  "created_utc": 1749135001.0,
  "title": "Why is nobody taking binge eating disorder serious?",
  "selftext": "\"nobody\" might be an exaggeration. But ive struggled with disordered eating for half a decade now and almost nobody took me seriously when i was obese. People with overweight get judged more, treated bad even by doctors (if i had a cold, it was the weight according to the doctor.) Everyone knows anorexia and bulimia but so many people say and think being obese is just someone who was no self control (aka lazy) but the second someone is anorexic, they are ill and treated like they have a real problem. When i was obese, people told me to just eat less and stop. Why does nobody get that no eating disorder comes from laziness or no self controll/respect?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1l414g3/why_is_nobody_taking_binge_eating_disorder_serious/",
  "score": 85,
  "num_comments": 23,
  "comments": [
    {
      "id": "mw7yen6",
      "author": "Flat-Chance3301",
      "body": "they’ll never experience the feeling of the impulse to binge and they’ll never understand it’s a real addiction. it really does make me mad that people direct so much sympathy only to the disorders that make you skinnier because they’re more “aesthetic.” ",
      "created_utc": 1749163834.0,
      "score": 32,
      "context": []
    },
    {
      "id": "mw815h0",
      "author": "FartUSA",
      "body": "That’s a good question. It’s totally a disorder. A book that helped me a lot was “When Food Is Love.”",
      "created_utc": 1749164745.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mw897qb",
      "author": "lowkeyalchie",
      "body": "It's the same reason why restrictive disorders aren't taken seriously until you are at death's doorstep: fatphobia.",
      "created_utc": 1749167608.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mw8jgib",
      "author": "Formal_Seat5305",
      "body": "I appreciate you calling this out. Binge eating disorder is real and it’s heartbreaking how often it gets dismissed or misrepresented, especially when someone is in a larger body.\n\nI used to struggle with binge eating too, and I can't tell you how many times I was told to “just stop eating so much” or “just be disciplined.” But bingeing isn’t about laziness or lack of control. For many, it's a response to overwhelming emotions, pain, unmet needs, or even long histories of restriction and body criticism - sometimes coming from professionals themselves.\n\nIt’s hard when you’re hurting and not being believed. I hope it helps that people here really do get it.",
      "created_utc": 1749171367.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mwa69su",
      "author": "secretsnubbull",
      "body": "I’ve been through various “phases” (diagnosed) over the years - anorexia, bulimia, BED. None of them were taken seriously until they were really severe, but even when it was really bad, BED wasn’t taken as seriously and there was a lot of shame (externally as well as internally) around it. There’s a lot of “just have some self control and stop eating so much” which is so so so harmful. BUT there are doctors out there who’ll take you seriously and have compassion. I’m now back into a restrictive time in my life but it was so comforting having a therapist who was compassionate and understanding of my binge eating. They’re out there. And it can be hard to share your ED with people in your life because of the shame, but if there are people you feel you can trust to be supportive, it can really help to let them know what you’re struggling with. But ultimately it’s just fatphobia and ignorance about mental health.",
      "created_utc": 1749197848.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mw8nfse",
      "author": "PlutoTheRaspberry",
      "body": "People fail to understand the difference between BED and overeating. There is a significant difference between an eating disorder and disordered eating. Disordered eating is something that can be fixed with lifestyle changes. Eating disorders take so much more to recover from. And recover is a general term. I know multiple people who's \"recovery\" is an act of significant self restraint every single day (both for restrictive disorders and overeating). Normal people will never understand how hard we have to try. And its not that anyone ever wants to be fat the way people want to be skinny, its that there's hormone imbalance, or mental health disorders, or a lack of supportive environments. Restrictive disorders are \"caused by society and social pressures\". Theres no societal pressure to be fat, therefore its fake.",
      "created_utc": 1749172813.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mwdns87",
      "author": "Enough_Butterfly_781",
      "body": "Because that’s what sells the ‘fitness’ industry unfortunately. Food noise and BED are still just made up ‘woke’ concepts to most of the world. To them these are just some made up conditions ‘non-skinny’ people use to justify their ‘bad habits’.",
      "created_utc": 1749241749.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mxqd390",
      "author": "Key-Food2265",
      "body": "hi i went from semi anorexic and had a near hospitalisation and now am a binge addict and have gained 10 kgs in weeks - my parents are trying to help me get back to a healthy weight as my cholesterol is at an extremely high level- and i need this is an extremely underorthodx way to communicate but i just feel so lost- everything EVERYTHING i had tried - a part of me is still scared to go back to where i was- i just need some help is there anything to make it stop?",
      "created_utc": 1749904787.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mw9ysdc",
      "author": "littleshrewpoo",
      "body": "I mean, I guess some doctors do which is why various medications are prescribed to help these people. Im not saying it’s always the cure for everyone, but there are doctors who understand. But it is often challenging to find a a doctor who isn’t just dismissive at first. Finding a doctor you can really feel comfortable opening up to and express how deeply this disorder affects your life can change everything. Especially if a doctor is knowledgeable about eating disorders and the whole spectrum, they will understand why binge eating is also serious and can often develop into other parts of the spectrum.",
      "created_utc": 1749193388.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwbfzhp",
      "author": "_weedkiller_",
      "body": "Simple answer is because it makes people money. In fact some foods are formulated to be more addictive.  \n\n The diet industry also generates a lot of revenue.",
      "created_utc": 1749218306.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mwl2djx",
      "author": "Used-Recording-8678",
      "body": "100% this! I used to say this all the time. I think a lot of mental health professionals and healthcare professionals don’t know anything about it because they’ve never been there themselves. I recovered from binge eating disorder and haven’t binged in 2.5 years. Please let me know if there’s anything I can do to help. I know the struggle all too well and sending so much love 🫶🏼",
      "created_utc": 1749345882.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myy8hu7",
      "author": "After-Sort3647",
      "body": "Oh I definitely agree, and on a similar note aytipical anorexia is also so overlooked. I had my therapist completely not believe me when I tried talking abt eating problems, so they continued to develop up to now. I honestly think a lot of it just has to do w fatphobia and also the difference in perception of smaller vs bigger people. Another thing with BED is it’s the most common eating disorder so possibly it’s just somewhat normalized in peoples minds and not really clicking that it’s something else? I really don’t know but I’d guess just fatphobia",
      "created_utc": 1750490234.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n13c5ke",
      "author": "Dangerous_Project773",
      "body": "I feel like people associate it as a fat disorder and think you're just fat and lazy. And it can't be romanctized like ana. So people don't care.",
      "created_utc": 1751530795.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mw8xvx5",
      "author": "Mental_Rough",
      "body": "And when you try to stop those impulses and it feels like you’re gonna die 😭 I’ve lost quite a bit of poundage but it’s getting worse again and NOTHING is helping so I’m trying to see a therapist but it’s super hard 😩 like you have to look or be a certain weight but then when you’re at that weight they just say you need to exercise and eat less. Like help meeee!! 🤣 I hate doctors and society sometimes. Like I used to sneak raviolis in my room and eat them out of the can cold and get scared when I heard my parents or siblings walking near my room and go eat McDonald’s or Taco Bell then come home and eat a full ass meal AGAIN and go for seconds for yearsss. Food helps me and I got better for a bit but feel I’m going down the path again but can’t seem to get in with anyone :/\n\nI’m in this weight program thing where I literally go in once every two weeks and go over healthier eating habits and journal but like it’s not consistent/the same as seeing what’s triggering me, how can I manage this, what can we DO",
      "created_utc": 1749176639.0,
      "score": 3,
      "context": [
        {
          "id": "mw7yen6",
          "author": "Flat-Chance3301",
          "body": "they’ll never experience the feeling of the impulse to binge and they’ll never understand it’s a real addiction. it really does make me mad that people direct so much sympathy only to the disorders that make you skinnier because they’re more “aesthetic.” ",
          "created_utc": 1749163834.0
        }
      ]
    },
    {
      "id": "mx2p7iz",
      "author": "Upset_Aerie5295",
      "body": "Very well said",
      "created_utc": 1749584820.0,
      "score": 1,
      "context": [
        {
          "id": "mw7yen6",
          "author": "Flat-Chance3301",
          "body": "they’ll never experience the feeling of the impulse to binge and they’ll never understand it’s a real addiction. it really does make me mad that people direct so much sympathy only to the disorders that make you skinnier because they’re more “aesthetic.” ",
          "created_utc": 1749163834.0
        }
      ]
    },
    {
      "id": "mwf0rir",
      "author": "Accomplished-Mud-173",
      "body": "This, too! I had a restrictive eating disorder for over a decade, and since I was slightly under normal weight, I never was taken seriously. Now I have a binge eating disorder, and I'm overweight and also ignored. I don't think many health care providers actually understand eating disorders at all .",
      "created_utc": 1749258601.0,
      "score": 5,
      "context": [
        {
          "id": "mw897qb",
          "author": "lowkeyalchie",
          "body": "It's the same reason why restrictive disorders aren't taken seriously until you are at death's doorstep: fatphobia.",
          "created_utc": 1749167608.0
        }
      ]
    },
    {
      "id": "mwdofoz",
      "author": "Worried_Appearance19",
      "body": "Yes and its so crazy. Any person with an eating disorder is sick and comparing is just so so stupid",
      "created_utc": 1749241945.0,
      "score": 2,
      "context": [
        {
          "id": "mwdns87",
          "author": "Enough_Butterfly_781",
          "body": "Because that’s what sells the ‘fitness’ industry unfortunately. Food noise and BED are still just made up ‘woke’ concepts to most of the world. To them these are just some made up conditions ‘non-skinny’ people use to justify their ‘bad habits’.",
          "created_utc": 1749241749.0
        }
      ]
    },
    {
      "id": "mxrhplr",
      "author": "Worried_Appearance19",
      "body": "Well there is no advice that could really help you. The only way is finding a doctor/therapist. I know this is not something you want to hear but it's the only way to get better🫶",
      "created_utc": 1749918461.0,
      "score": 1,
      "context": [
        {
          "id": "mxqd390",
          "author": "Key-Food2265",
          "body": "hi i went from semi anorexic and had a near hospitalisation and now am a binge addict and have gained 10 kgs in weeks - my parents are trying to help me get back to a healthy weight as my cholesterol is at an extremely high level- and i need this is an extremely underorthodx way to communicate but i just feel so lost- everything EVERYTHING i had tried - a part of me is still scared to go back to where i was- i just need some help is there anything to make it stop?",
          "created_utc": 1749904787.0
        }
      ]
    },
    {
      "id": "mwldaw7",
      "author": "Worried_Appearance19",
      "body": "That's so sweet of you, I'm still overweight but haven't binged in half a year now and on a healthy weightloss journey. Im 6 pounds away from not being obese anymore so I dont need any help but thanks",
      "created_utc": 1749350179.0,
      "score": 2,
      "context": [
        {
          "id": "mwl2djx",
          "author": "Used-Recording-8678",
          "body": "100% this! I used to say this all the time. I think a lot of mental health professionals and healthcare professionals don’t know anything about it because they’ve never been there themselves. I recovered from binge eating disorder and haven’t binged in 2.5 years. Please let me know if there’s anything I can do to help. I know the struggle all too well and sending so much love 🫶🏼",
          "created_utc": 1749345882.0
        }
      ]
    },
    {
      "id": "mwbq7e6",
      "author": "Formal_Seat5305",
      "body": "I so get this. That feeling like something is pulling you so hard toward food, the hiding. It can be so intense. And eating ravioli cold in your room? Yeah. That hit me. I did things like that too when I was still bingeing. I felt like I had to or I wouldn’t make it through the day.\n\nIt’s so frustrating when you finally try to get help and the support you get is just surface-level. Sometimes I learned helpful tools to eat healthier, but it sometimes it felt like we were skipping over the part about how compelling food is when we're trying to cope with something that feels too big or painful to face straight on.\n\nI remember getting better for a while too, and then feeling scared and ashamed when things started sliding again. But, if it helps, try to remember that sliding back doesn't mean you’re back at square one. You’re noticing it, you’re reaching out, and that counts for a lot - not to mention the things you've probably learned along the way that are more helpful or less helpful for you at a time like this.\n\nSupport that looks at what’s behind the triggers can be really helpful and it does exist. I hope you can get in with someone soon.",
      "created_utc": 1749221356.0,
      "score": 1,
      "context": [
        {
          "id": "mw7yen6",
          "author": "Flat-Chance3301",
          "body": "they’ll never experience the feeling of the impulse to binge and they’ll never understand it’s a real addiction. it really does make me mad that people direct so much sympathy only to the disorders that make you skinnier because they’re more “aesthetic.” ",
          "created_utc": 1749163834.0
        },
        {
          "id": "mw8xvx5",
          "author": "Mental_Rough",
          "body": "And when you try to stop those impulses and it feels like you’re gonna die 😭 I’ve lost quite a bit of poundage but it’s getting worse again and NOTHING is helping so I’m trying to see a therapist but it’s super hard 😩 like you have to look or be a certain weight but then when you’re at that weight they just say you need to exercise and eat less. Like help meeee!! 🤣 I hate doctors and society sometimes. Like I used to sneak raviolis in my room and eat them out of the can cold and get scared when I heard my parents or siblings walking near my room and go eat McDonald’s or Taco Bell then come home and eat a full ass meal AGAIN and go for seconds for yearsss. Food helps me and I got better for a bit but feel I’m going down the path again but can’t seem to get in with anyone :/\n\nI’m in this weight program thing where I literally go in once every two weeks and go over healthier eating habits and journal but like it’s not consistent/the same as seeing what’s triggering me, how can I manage this, what can we DO",
          "created_utc": 1749176639.0
        }
      ]
    },
    {
      "id": "mwdpdnc",
      "author": "Enough_Butterfly_781",
      "body": "Honestly! Crazy world we’re in these days.",
      "created_utc": 1749242233.0,
      "score": 2,
      "context": [
        {
          "id": "mwdns87",
          "author": "Enough_Butterfly_781",
          "body": "Because that’s what sells the ‘fitness’ industry unfortunately. Food noise and BED are still just made up ‘woke’ concepts to most of the world. To them these are just some made up conditions ‘non-skinny’ people use to justify their ‘bad habits’.",
          "created_utc": 1749241749.0
        },
        {
          "id": "mwdofoz",
          "author": "Worried_Appearance19",
          "body": "Yes and its so crazy. Any person with an eating disorder is sick and comparing is just so so stupid",
          "created_utc": 1749241945.0
        }
      ]
    },
    {
      "id": "mwnlbkl",
      "author": "Used-Recording-8678",
      "body": "Yay happy to hear you’re doing well :)",
      "created_utc": 1749390131.0,
      "score": 2,
      "context": [
        {
          "id": "mwl2djx",
          "author": "Used-Recording-8678",
          "body": "100% this! I used to say this all the time. I think a lot of mental health professionals and healthcare professionals don’t know anything about it because they’ve never been there themselves. I recovered from binge eating disorder and haven’t binged in 2.5 years. Please let me know if there’s anything I can do to help. I know the struggle all too well and sending so much love 🫶🏼",
          "created_utc": 1749345882.0
        },
        {
          "id": "mwldaw7",
          "author": "Worried_Appearance19",
          "body": "That's so sweet of you, I'm still overweight but haven't binged in half a year now and on a healthy weightloss journey. Im 6 pounds away from not being obese anymore so I dont need any help but thanks",
          "created_utc": 1749350179.0
        }
      ]
    }
  ]
}