{
  "id": "1l8dsoo",
  "subreddit": "EatingDisorders",
  "author": "AStatedMind",
  "created_utc": 1749598184.0,
  "title": "[ADVICE] My girlfriend is in ED recovery but secretly doing 65+ workout classes a month. I’m scared.",
  "selftext": "Hi everyone. I’m feeling overwhelmed and unsure of what to do right now. My girlfriend began ED recovery in January after we had a serious talk about her sudden weight loss. In February, she was formally diagnosed with Anorexia Nervosa, Restrictive Type.\n\nShe’s been working with a therapist and was cleared by a cardiologist to start light exercise in April. Since then, she’s gone back to the gym, but I quickly noticed she was working out twice a day, before and after work. I brought it up in a session when I realized she’d taken 15 classes in one week. Her therapist was clearly concerned, but my girlfriend dismissed it, saying she was just trying to manage stress and that one of the daily classes was usually just yoga.\n\nLast week, I brought it up again during another session. She got defensive and insisted she was only doing two classes a day, and that one of them was always gentle like yoga or stretching. She reassured both me and her therapist that she wasn’t overdoing it.\n\nOver the weekend, I bought her an iPad and was helping her set it up. A notification popped up for a gym class, but it wasn’t on the shared Google Calendar we use to coordinate our schedules. It was from a separate calendar account I didn’t know about. I wasn’t snooping—this just came up while helping her—but when I saw it, I opened it to see what it was.\n\nThat’s when I found out she’s been logging all her gym classes on this hidden calendar. She hasn’t been honest with either of us.\n\nIn May alone, she went to 65 classes. So far in June, she’s already been to 25. The breakdown looked like this:\n\n\t•\t10 cycling\n\t•\t17 boxing\n\t•\t37 HIIT\n\t•\t8 yoga\n\t•\t18 Pilates\n\nShe has been lying to me and to her therapist about the frequency and intensity of her workouts. This feels like a shift from restrictive eating to compulsive over-exercising, and the fact that she’s hiding it makes it even more dangerous.\n\nI’m not angry, I’m scared. I want to help her, but I don’t know how to bring this up without making her shut down or feel attacked. I love her deeply and I’m terrified that she’s slipping further into another dangerous behavior pattern.\n\nIf anyone has been through something similar, either in your own recovery or supporting someone else, I’d really appreciate any advice on how to approach this.\n\ntl;dr:\nMy girlfriend is in recovery for anorexia and has secretly been attending over 65 workout classes a month. She’s been hiding the true number and intensity from both me and her therapist, using a separate calendar to track them. I’m scared this is turning into compulsive over-exercising and don’t know how to help without making things worse.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1l8dsoo/advice_my_girlfriend_is_in_ed_recovery_but/",
  "score": 154,
  "num_comments": 20,
  "comments": [
    {
      "id": "mx4smh4",
      "author": "VirtualKittenInc",
      "body": "I think first and foremost, it’s a disorder and you have to come to the terms with the fact that eating disorders thrive in shame. Creating an environment where she feels comfortable to talk about what she’s been doing without judgement is key. But, you also have to hold her accountable. I know I struggle with keeping things from my SO bc I feel like sharing might prevent me from losing weight. It becomes a situation where I feel like if I just do it a couple more times, or if I just lose x more weight. I think as much as she might hate it, a system in place to hold her more accountable to prevent working out that much or talking with her therapist to come up with a plan to help her might be the answer. I would reiterate to her you love her and care about her. Also what she is doing is not light exercise and is very dangerous.\n\nKeep in mind too her defensiveness is likely the eating disorders effort to stay, as it’s serving some purpose in her life. I wish I could be more help but I don’t want to give the wrong advice since everyone’s so different.",
      "created_utc": 1749609099.0,
      "score": 112,
      "context": []
    },
    {
      "id": "mx50fnt",
      "author": "yellowposy2",
      "body": "I’m so sorry you’re going through this. It’s so hard when the people we love are being dishonest. As it stands, I believe you should tell her what you’ve found, and come with ideas about how to support her going forward like the other commenter suggested (possibly booking the classes with her/attending with her when possible, cutting down to one class/day of her choice, etc). Try and use “I feel” statements (“I feel scared that you’re taking this many classes, I feel worried that you lied to me about it”), give her space to share without interruptions, then focus on the steps you need her to take to move forward (telling her therapist, class schedule restrictions etc). Best of luck!!",
      "created_utc": 1749612118.0,
      "score": 28,
      "context": []
    },
    {
      "id": "mx8nhho",
      "author": "ShiaLabeoufsNipples",
      "body": "I feel like she needs better, more clear advice from her cardiologist. “Light exercise” is so vague, and EDs literally warp reality for the sufferer. He’s not making it easier\n\nHe needs to tell her “120 minutes of cardio a week, no more than 30 minutes a day.” “3 strength training sessions of no more than an hour each week” or something along those lines.\n\nShe needs clear guidelines from her doctor or her ED will take advantage of the ambiguity.",
      "created_utc": 1749664809.0,
      "score": 23,
      "context": []
    },
    {
      "id": "mx6cnfr",
      "author": "Billidays",
      "body": "sounds like she’s still struggling, even if she doesn’t see it, maybe it’s time for her care team to step in more directly",
      "created_utc": 1749637738.0,
      "score": 13,
      "context": []
    },
    {
      "id": "mx7soxh",
      "author": "Alert_Department_622",
      "body": "I’m so sorry you’re going through this. It’s very difficult and although she seems defensive and mad deep down she knows that this impacts you as well. \n\nHere’s a few things my fiance did for me while going through this \n- game nights (a date night not revolved around food) at home where I was comfortable and a place I could be in pajamas or sweats so I could be warm. \n\n- your brain gets WARPED. During this. Don’t necessarily love bomb her it’ll scare her but making sure she feels loved, small gifts, making her tea in the mornings (I loved this because it was warm and zero ya knows, also promotes something hydrating) \n\n- don’t be afraid to touch her (like with consent obviously) my fiance hated the feeling so he would see me and not want to give me any hugs or cuddle or anything, understandably. For me that made things worse. \n\n(Idea here is ways to open up more to you and can also take away from workout time)\n\nI would also try to see a therapist separate from hers/yours and get your own, this impacts you a lot and you’re not a professional, don’t try to be. Get help on how to help her! I did this for my fiance with anxiety, even if you don’t see immediate results you can at least get a place where your words are safe and you can get your feelings off your chest. \n\nGood luck and so sorry you and her have to go through this.",
      "created_utc": 1749656141.0,
      "score": 12,
      "context": []
    },
    {
      "id": "mx7qk7u",
      "author": "freshnvrfrozen",
      "body": "65!?!? Holy…. I’m so sorry",
      "created_utc": 1749655526.0,
      "score": 9,
      "context": []
    },
    {
      "id": "mxadjki",
      "author": "Itscatpicstime",
      "body": "Also, light exercise is usually defined as raising your heart rate but easily and clearly being able to talk without struggle. You shouldn’t even be sweating. \n\nBoxing, cycling, and HIIT are objectively not that. Yoga and Pilates are. \n\nMaybe google the definition of light exercise and show her what some reputable sources say.",
      "created_utc": 1749683501.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mxabt9n",
      "author": "Itscatpicstime",
      "body": "Talk to her cardiologist so he can be the one to tell her it’s too much for her heart. I assume he knows about the ED, but if he doesn’t, he needs to be told.",
      "created_utc": 1749682921.0,
      "score": 5,
      "context": []
    },
    {
      "id": "myqyr03",
      "author": "DannieDeviHo",
      "body": "There’s a lot of great advice shared already  but I want you to just to know that you’re care and support while it may carry some resentment for your s.o. because we love the secretive control of our affliction with us so much that your cares and concerns do make a difference. That was my personal experience at least. I still struggle a lot but knowing I have a support network and people who care about me help so much. I’ve relapsed (multiple times, have just had one again after 4 years)  and indulged in behaviors I used to I can look back and notice how scary it is to watch. It was addicting like a frenzy for me and fueled me but that’s how it was for me; except it didn’t fuel them it debilitated them! You’re doing the right thing and have the right intentions but you may get lots of pushback. That pushback is never anything personal really, it’s someone doing what they think they need to do to survive even when it’s killing them. It’s such a hard battle and I’m so sorry she’s dealing with it. I just want you to know that going with her to therapy and admitting things that will knowingly upset her but In the end anyone I ever shared with made me realize that I have to get better. She may hate you sometimes but it’s because you’re taking some sort of control away and that feels so insurmountable when you’re actively in your ed. It’s entirely incomprehensible to understand adddictions fully, especially as a caring and good spouse  if you haven’t been through one I think unfortunately. We still love you at the end of the day but we are so burdened with this relationship with our body that it can take up so much space and we cant let you invade that.  You have every right to your feelings and your nerves but know that showing up gracefully and patiently will make the difference when she is able to make it happen!! Best of luck to your relationship and her recovery!",
      "created_utc": 1750389074.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mxoay7b",
      "author": "Vicariouslylivin",
      "body": "This early in recovery exercise is a trigger. Even though it can be healthy for some, she can’t do it in a healthy way. \nI couldn’t exercise for a LOOONG TIME after seemingly being recovered for a few years because it triggered me.\n\nI would recommend her not exercising. Taking this away from me (coz it was taken away from me thankfully) brought up a lot of shit for me.\n\nI can go to gym now but it’s been 10 years",
      "created_utc": 1749867659.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mx5pkrt",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1749624234.0,
      "score": -60,
      "context": []
    },
    {
      "id": "mx4vovz",
      "author": "AStatedMind",
      "body": "Thank you for your insight — I appreciate you taking the time to type this up and share your thoughts.",
      "created_utc": 1749610249.0,
      "score": 19,
      "context": [
        {
          "id": "mx4smh4",
          "author": "VirtualKittenInc",
          "body": "I think first and foremost, it’s a disorder and you have to come to the terms with the fact that eating disorders thrive in shame. Creating an environment where she feels comfortable to talk about what she’s been doing without judgement is key. But, you also have to hold her accountable. I know I struggle with keeping things from my SO bc I feel like sharing might prevent me from losing weight. It becomes a situation where I feel like if I just do it a couple more times, or if I just lose x more weight. I think as much as she might hate it, a system in place to hold her more accountable to prevent working out that much or talking with her therapist to come up with a plan to help her might be the answer. I would reiterate to her you love her and care about her. Also what she is doing is not light exercise and is very dangerous.\n\nKeep in mind too her defensiveness is likely the eating disorders effort to stay, as it’s serving some purpose in her life. I wish I could be more help but I don’t want to give the wrong advice since everyone’s so different.",
          "created_utc": 1749609099.0
        }
      ]
    },
    {
      "id": "mx9gnun",
      "author": "elerina1",
      "body": "This is very good advice. Any eating disorder is an addiction. When I get carried away with overdoing something it really helps me when I have clear and concise scientific criteria to go by. I have a tendency to overdo everything but following a medical plan is one way that I avoid being able to fudge things. The doctor needs to give her a clear schedule that will tell her what is too much. It takes the guilt and the shame out of it and eliminates the possibility of her believing her addictive voice that's telling her that what she is doing is perfectly fine. Be prepared for her to be very defensive. That is her disease talking. You are a good boyfriend.",
      "created_utc": 1749673263.0,
      "score": 8,
      "context": [
        {
          "id": "mx8nhho",
          "author": "ShiaLabeoufsNipples",
          "body": "I feel like she needs better, more clear advice from her cardiologist. “Light exercise” is so vague, and EDs literally warp reality for the sufferer. He’s not making it easier\n\nHe needs to tell her “120 minutes of cardio a week, no more than 30 minutes a day.” “3 strength training sessions of no more than an hour each week” or something along those lines.\n\nShe needs clear guidelines from her doctor or her ED will take advantage of the ambiguity.",
          "created_utc": 1749664809.0
        }
      ]
    },
    {
      "id": "mxol3ib",
      "author": "AStatedMind",
      "body": "How did they go about taking it away from you?",
      "created_utc": 1749871519.0,
      "score": 1,
      "context": [
        {
          "id": "mxoay7b",
          "author": "Vicariouslylivin",
          "body": "This early in recovery exercise is a trigger. Even though it can be healthy for some, she can’t do it in a healthy way. \nI couldn’t exercise for a LOOONG TIME after seemingly being recovered for a few years because it triggered me.\n\nI would recommend her not exercising. Taking this away from me (coz it was taken away from me thankfully) brought up a lot of shit for me.\n\nI can go to gym now but it’s been 10 years",
          "created_utc": 1749867659.0
        }
      ]
    },
    {
      "id": "mx9gvfo",
      "author": "TealMonkey1",
      "body": "In this scenario it is",
      "created_utc": 1749673323.0,
      "score": 6,
      "context": [
        {
          "id": "mx5pkrt",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1749624234.0
        }
      ]
    },
    {
      "id": "mx4wgvd",
      "author": "VirtualKittenInc",
      "body": "Being concerned and reaching out like this is so meaningful. Thank you for supporting her!",
      "created_utc": 1749610550.0,
      "score": 16,
      "context": [
        {
          "id": "mx4smh4",
          "author": "VirtualKittenInc",
          "body": "I think first and foremost, it’s a disorder and you have to come to the terms with the fact that eating disorders thrive in shame. Creating an environment where she feels comfortable to talk about what she’s been doing without judgement is key. But, you also have to hold her accountable. I know I struggle with keeping things from my SO bc I feel like sharing might prevent me from losing weight. It becomes a situation where I feel like if I just do it a couple more times, or if I just lose x more weight. I think as much as she might hate it, a system in place to hold her more accountable to prevent working out that much or talking with her therapist to come up with a plan to help her might be the answer. I would reiterate to her you love her and care about her. Also what she is doing is not light exercise and is very dangerous.\n\nKeep in mind too her defensiveness is likely the eating disorders effort to stay, as it’s serving some purpose in her life. I wish I could be more help but I don’t want to give the wrong advice since everyone’s so different.",
          "created_utc": 1749609099.0
        },
        {
          "id": "mx4vovz",
          "author": "AStatedMind",
          "body": "Thank you for your insight — I appreciate you taking the time to type this up and share your thoughts.",
          "created_utc": 1749610249.0
        }
      ]
    },
    {
      "id": "n2vjb94",
      "author": "Vicariouslylivin",
      "body": "I was in treatment at the time after hitting my rock bottom. I hadn’t kept any food down, not one meal in about 4 months. So I went into an inpatient facility. \nSo I couldn’t exercise without being dobbed on",
      "created_utc": 1752402094.0,
      "score": 1,
      "context": [
        {
          "id": "mxoay7b",
          "author": "Vicariouslylivin",
          "body": "This early in recovery exercise is a trigger. Even though it can be healthy for some, she can’t do it in a healthy way. \nI couldn’t exercise for a LOOONG TIME after seemingly being recovered for a few years because it triggered me.\n\nI would recommend her not exercising. Taking this away from me (coz it was taken away from me thankfully) brought up a lot of shit for me.\n\nI can go to gym now but it’s been 10 years",
          "created_utc": 1749867659.0
        },
        {
          "id": "mxol3ib",
          "author": "AStatedMind",
          "body": "How did they go about taking it away from you?",
          "created_utc": 1749871519.0
        }
      ]
    },
    {
      "id": "n2vjcbi",
      "author": "Vicariouslylivin",
      "body": "Sorry I didn’t get the notification",
      "created_utc": 1752402111.0,
      "score": 1,
      "context": [
        {
          "id": "mxoay7b",
          "author": "Vicariouslylivin",
          "body": "This early in recovery exercise is a trigger. Even though it can be healthy for some, she can’t do it in a healthy way. \nI couldn’t exercise for a LOOONG TIME after seemingly being recovered for a few years because it triggered me.\n\nI would recommend her not exercising. Taking this away from me (coz it was taken away from me thankfully) brought up a lot of shit for me.\n\nI can go to gym now but it’s been 10 years",
          "created_utc": 1749867659.0
        },
        {
          "id": "mxol3ib",
          "author": "AStatedMind",
          "body": "How did they go about taking it away from you?",
          "created_utc": 1749871519.0
        }
      ]
    }
  ]
}