{
  "id": "1l9ac7f",
  "subreddit": "EatingDisorders",
  "author": "Acrobatic-Health7160",
  "created_utc": 1749692687.0,
  "title": "After telling people about my ED, I can no longer eat in front of them.",
  "selftext": "Hi\nI struggle with restricted eating. I am not formally diagnosed as anorexic, but my symptoms are consistent with that disorder. Recently, I told my boyfriend about my struggles. Somehow, this has made my disorder worse when I thought it would make it better. I never usually ate anything around him before telling him about my ed, but when I did it was okay. Obviously I still had guilt, but I did not have guilt and anxiety to the point I have now. Now, whenever the opportunity presents itself to eat around him, I can’t without crazy guilt. I am scared that he is judging me or that he is secretly thinking that I am making my eating disorder up. As he watches me eat, all I can think about are the things I’m sure he’s thinking, like “oh she’s actually eating, she must be getting better, or maybe she was just lying about it in the first place.”. I don’t feel like my disorder is valid because I do still eat occasionally. I do not want my boyfriend to think I am recovering when I am still struggling just the same. I also don’t want him to think I am lying. But I don’t want to make a big deal out of it.\n\nHave any of you guys experienced this? What should I do? It’s really making life difficult for me and is making my food anxiety so much worse. Please help!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1l9ac7f/after_telling_people_about_my_ed_i_can_no_longer/",
  "score": 48,
  "num_comments": 8,
  "comments": [
    {
      "id": "mxbo82j",
      "author": "rando_throw_8741",
      "body": "Similar situation here, not diagnosed but experience a lot of anxiety about food and eating around other people. With your boyfriend, it would probably relieve a lot of your thoughts and anxiety if you had an honest conversation about this. You took the step to tell him about your struggles, but maybe discussing it further and letting him know could help to make him a support through those thoughts.",
      "created_utc": 1749700519.0,
      "score": 8,
      "context": []
    },
    {
      "id": "mxcjd57",
      "author": "OoHpSies-twntyone",
      "body": "When I’ve told someone, I also feel like now if I eat in front of them not looking uneasy, they think I’m exaggerating or on my way to recovery. I myself am figuring it out, but I too feel like telling them about this would help.\nThis disorder can make you feel like you’re overdramatic or sometimes you ask yourself if you’re lying or are you just looking for attention. But this is real. Would a healthy person have so much anxiety around food or starve themselves, even for attention? It is valid to think others won’t take you seriously if they don’t see it, because not everyone understands right away. But the right people will listen, believe and be understanding, even if they don’t understand. That’s my experience anyway.",
      "created_utc": 1749717263.0,
      "score": 6,
      "context": []
    },
    {
      "id": "mxfax7c",
      "author": "VirtualKittenInc",
      "body": "I know where you’re coming from. I am in a very open and honest relationship and I tell my SO when I purge and I always feel like they think I’m making it up even though they give me no indication they think that. Talking through the shame I think is the best course of action since eating disorders tend to feed on shame but man is it so hard.",
      "created_utc": 1749752548.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mydovv6",
      "author": "Subject-Truth-6683",
      "body": "I totally get this! While I have been diagnosed with an ED, I faced similar feelings after talking to my friends about my ED. for me, I faced a lot of anxiety and uncomfort eating in front of them after telling them. Something that helped me the most was just confronting it head on. It was verrrrreyyyyyyyyy hard to do but after telling my friends about how much anxiety I felt eating around them (or just being around them) in general, it lifted a weight off my shoulders. \n\nAlso, I think it’s totally normal to not feel validated in your ED. feeling like you don’t have one but still having all these feelings is incredibly difficult, and I think almost everyone who has an ED feels like that at some point (I did for 5 months before I realized). Just hope you know that it probably is an ED you’re dealing with, and when you feel ready recovery is always the best answer! Hope everything goes well for you!!!!!",
      "created_utc": 1750213804.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mydzso9",
      "author": "TightAd2361",
      "body": "Not exactly the same but I am currently somewhere similar. I struggled after having my first child and my husband helped me through it so I finally told him I thought I’d slipped back into it recently after the second. For some reason, voicing it and making it more “real” made it much worse rather than helped. He’s trying to help though which is nice to have that support even though he doesn’t understand it.",
      "created_utc": 1750217832.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n27lvux",
      "author": "julesistheshit",
      "body": "YES!!! finally, someone that understands. and to be honest, i don’t have any advice because im struggling with the same exact thing. i have a diagnosed eating disorder, and i food restrict as well. i refuse treatment and that is why i am where i am right now, in and out of hospitals with tubes and IVs. i dont know what people think when im eating one day and then the next day im going weeks without eating. i feel like they are thinking the same thing you think they are saying. i wish i had advice but i dont because i cant even have advice for myself. but, things will get better. i’ve seen people get better. i know that will happen one day, even if it’s not right now. but stay strong. you’re doing amazing ❤️ keep trying my love 💗💗",
      "created_utc": 1752081815.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mxbu5rb",
      "author": "Acrobatic-Health7160",
      "body": "Thank you for your response :) I have definitely been considering having another conversation with him about it, it’s just very difficult for me to open up. I hate feeling like I’m attention seeking!! I know he would want to support me through it, so I probably will let him know sooner rather than later",
      "created_utc": 1749703222.0,
      "score": 4,
      "context": [
        {
          "id": "mxbo82j",
          "author": "rando_throw_8741",
          "body": "Similar situation here, not diagnosed but experience a lot of anxiety about food and eating around other people. With your boyfriend, it would probably relieve a lot of your thoughts and anxiety if you had an honest conversation about this. You took the step to tell him about your struggles, but maybe discussing it further and letting him know could help to make him a support through those thoughts.",
          "created_utc": 1749700519.0
        }
      ]
    },
    {
      "id": "mxbvc07",
      "author": "rando_throw_8741",
      "body": "I definitely see where you’re coming from, your struggles are valid! It’s not attention-seeking to look for support through difficult times, I really hope you’re able to find that support with your boyfriend.",
      "created_utc": 1749703782.0,
      "score": 2,
      "context": [
        {
          "id": "mxbo82j",
          "author": "rando_throw_8741",
          "body": "Similar situation here, not diagnosed but experience a lot of anxiety about food and eating around other people. With your boyfriend, it would probably relieve a lot of your thoughts and anxiety if you had an honest conversation about this. You took the step to tell him about your struggles, but maybe discussing it further and letting him know could help to make him a support through those thoughts.",
          "created_utc": 1749700519.0
        },
        {
          "id": "mxbu5rb",
          "author": "Acrobatic-Health7160",
          "body": "Thank you for your response :) I have definitely been considering having another conversation with him about it, it’s just very difficult for me to open up. I hate feeling like I’m attention seeking!! I know he would want to support me through it, so I probably will let him know sooner rather than later",
          "created_utc": 1749703222.0
        }
      ]
    }
  ]
}