{
  "id": "1le1i76",
  "subreddit": "EatingDisorders",
  "author": "Shoddy_Painting_1484",
  "created_utc": 1750200974.0,
  "title": "My ED lead me to an addiction",
  "selftext": "I always want to not eat during the day but I end up eating anyway. But in the time I started to drink beers a lot to not eat solid food. Now I want to drink alcohol everyday. I dont want to be an alcoholic at a young age cuz its a hard thing to get rid of. Did you ever experienced something like this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1le1i76/my_ed_lead_me_to_an_addiction/",
  "score": 39,
  "num_comments": 20,
  "comments": [
    {
      "id": "mycogle",
      "author": "Eastern_Yam_5975",
      "body": "Yap. Don’t try hard drugs because it’s even more fun.\n\nAlcohol makes it easier to supress the anxiety you feel about food and the need to control everything. All of this seems like an issue to talk through in therapy.",
      "created_utc": 1750201400.0,
      "score": 13,
      "context": []
    },
    {
      "id": "myd3m04",
      "author": "Practical_Spell_1286",
      "body": "I think this is actually pretty common. I had a similar thing and it helped me feel out of my body that I hated for even just a few hours. I would also get drunk enough to throw up which felt like a “win.”\n\nRemember that the eating disorder affects every part of our life. The more I worked on loving myself and my body, the less I wanted to drink. I got to the point where I can still enjoy alcohol in moderation, but I’m not obsessed with the feeling of being free. I also used to be so hyper fixated on the nutrition facts for beer or whatever I was drinking, but that has also mellowed out. \n\nKeep doing the work to love and nourish yourself, and the drinking will also return to a healthy place. I love the comments above. Force yourself to eat something if you’re going to drink. It’s a good place to start.",
      "created_utc": 1750206510.0,
      "score": 5,
      "context": []
    },
    {
      "id": "myfst3j",
      "author": "BrieMode0203",
      "body": "Absolutely my ED led me here. I’m now in deep with the hardest and worst substances you can imagine. But at my lowest weight. I know if I get clean I’ll gain. That always happens.. so that said I need to let it all go and get healthy. Good luck to you all. We got it ❤️",
      "created_utc": 1750250291.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mycpdl8",
      "author": "SeaRepresentative42",
      "body": "Alcohol and an empty stomach is not good. Maybe it would be a good idea to stop the alcohol or switch to near beer, or only with a meal.",
      "created_utc": 1750201695.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mydy5h3",
      "author": "ExtremelyOnlineTM",
      "body": "There was a sub r/drunkarexia that got nuked a few months ago for being dangerous.\n\nCombining substance use addiction and ED is bad, bad news. I hope you can get the help you need.",
      "created_utc": 1750217170.0,
      "score": 3,
      "context": []
    },
    {
      "id": "myf1nkq",
      "author": "Specific_Explorer513",
      "body": "Wait I have a question. I am recovered but when I was very underweight and deep in my ED, when I got drunk I would eat ravenously because I would just let go😭does that not happen to you?",
      "created_utc": 1750237672.0,
      "score": 3,
      "context": []
    },
    {
      "id": "myf2s0g",
      "author": "SaltyCSea-r",
      "body": "I went through a period where I literally would drink two 4lokos at night to avoid eating and to stay thin. I don’t remember many nights because of this. I actually left my dog outside all night because I went to sleep after my drinks. I much would have rather been gaining weight while being able to recall my memories but I decided alcohol was more important than food because it was keeping me from eating as well as dehydrating me every night. So please do not turn to alcohol to help curb your hunger because it is only going to cause you more problems. Yoga and running have helped me but I am currently under a lot of stress but that being said exercise will help keep you healthy and fit as long as you are eating correctly. That is what I have heard and what I have experienced.",
      "created_utc": 1750238338.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mygu2cs",
      "author": "BallSufficient5671",
      "body": "I can say that if alcohol didn't have calories I would definitely drink to cope with my anxiety about food. But because it does I want allow myself to have any. And I would also smoke if I could but, I can't because I have such severe Osteoporosis.So for me it's really hard because I don't have any other vice except for restricting and I can't even exercise anymore because i'm now disabled due to the pain conditions I got after having anorexia so many yrs and breaking my foot. But at least it stopped my compulsive exercising...",
      "created_utc": 1750261642.0,
      "score": 3,
      "context": []
    },
    {
      "id": "mycwoxl",
      "author": "Zitidoodle",
      "body": "I would do this but instead of beer it was a looooot of sports drinks.",
      "created_utc": 1750204099.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myj8ng8",
      "author": "everyones_slave",
      "body": "It’s been very difficult for me to manage being an alcoholic and having a severe eating disorder. I’m currently two years sober 🙌 but it’s become at the expense of my eating disorder, which has greatly worsened. \n\nIt would be much much easier for you to manage if you can contain the addictions to the ED. I know that’s not easy. But having one major focus for yourself will be enough. You can do it.",
      "created_utc": 1750286753.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mz037wj",
      "author": "WendyRDN-RINT",
      "body": "Have you tried NAC? N-acetyl cysteine for addiction? Do you have a pcp or psych to talk to about medications that can help with addiction? You may not be able to battle this on your own. Your brain is wired toward addiction and it’s not your fault. Genetics are powerful. Talk to your doctor as soon as you can. You don’t have to do this alone. There are meds and if you don’t want to take meds, even supplements can help.",
      "created_utc": 1750520772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzcyidy",
      "author": "Downtown_Algae8556",
      "body": "This is why I vape.. \n\nNicotine suppresses appetite but lately it hasn’t been helping me and I keep eating. I freaking hate it. And I wanna quit but last week when I tried to just take a break I spiralled. I told my mom and she’s likes “just go get another vape”",
      "created_utc": 1750698216.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzg11g1",
      "author": "New_Penalty_722",
      "body": "This makes sense on 2 levels. Alcohol is calorie dense and high in carbs/sugars. The problem with using alcohol as a source of calories is that your mind and your body can become dependent upon upon it. There is nothing wrong with drinking beer. I definately do not recommend changing anything before you speak with your medical team. I wish you the very best! ",
      "created_utc": 1750732445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3yilxa",
      "author": "None",
      "body": "I think it's pretty common aswell. Other addictions (e.g. drugs, alcohol, gambling, sex, workaholism, compulsive spending/shopping- a \"smiled upon\"/socially acceptable addiction- you might even develop a pattern of unstable/emotionally violent r-ships) offsets the overwhelming distress of the ED (mental/physical, emotional etc). Ive had other addictions as well. It grows legs. It's about drowning out noise from underlying traumas (there could be multiple issues)",
      "created_utc": 1752910213.0,
      "score": 1,
      "context": [
        {
          "id": "myd3m04",
          "author": "Practical_Spell_1286",
          "body": "I think this is actually pretty common. I had a similar thing and it helped me feel out of my body that I hated for even just a few hours. I would also get drunk enough to throw up which felt like a “win.”\n\nRemember that the eating disorder affects every part of our life. The more I worked on loving myself and my body, the less I wanted to drink. I got to the point where I can still enjoy alcohol in moderation, but I’m not obsessed with the feeling of being free. I also used to be so hyper fixated on the nutrition facts for beer or whatever I was drinking, but that has also mellowed out. \n\nKeep doing the work to love and nourish yourself, and the drinking will also return to a healthy place. I love the comments above. Force yourself to eat something if you’re going to drink. It’s a good place to start.",
          "created_utc": 1750206510.0
        }
      ]
    },
    {
      "id": "myg0kdx",
      "author": "gonzo_attorney",
      "body": "Yes, this is the way you get gastritis and GERD. Ask me how I know...",
      "created_utc": 1750252952.0,
      "score": 2,
      "context": [
        {
          "id": "mycpdl8",
          "author": "SeaRepresentative42",
          "body": "Alcohol and an empty stomach is not good. Maybe it would be a good idea to stop the alcohol or switch to near beer, or only with a meal.",
          "created_utc": 1750201695.0
        }
      ]
    },
    {
      "id": "myeeupi",
      "author": "Shoddy_Painting_1484",
      "body": "ohh I wish I knew about that sub before",
      "created_utc": 1750224668.0,
      "score": 2,
      "context": [
        {
          "id": "mydy5h3",
          "author": "ExtremelyOnlineTM",
          "body": "There was a sub r/drunkarexia that got nuked a few months ago for being dangerous.\n\nCombining substance use addiction and ED is bad, bad news. I hope you can get the help you need.",
          "created_utc": 1750217170.0
        }
      ]
    },
    {
      "id": "mygaehu",
      "author": "drinkliquidclocks-",
      "body": "Oh shit..... Why didn't I notice it being gone? I loved it there:'/",
      "created_utc": 1750256045.0,
      "score": 1,
      "context": [
        {
          "id": "mydy5h3",
          "author": "ExtremelyOnlineTM",
          "body": "There was a sub r/drunkarexia that got nuked a few months ago for being dangerous.\n\nCombining substance use addiction and ED is bad, bad news. I hope you can get the help you need.",
          "created_utc": 1750217170.0
        }
      ]
    },
    {
      "id": "myf6s8h",
      "author": "Shoddy_Painting_1484",
      "body": "I got drunk sometimes too but no my ED thoughts never goes away.",
      "created_utc": 1750240627.0,
      "score": 1,
      "context": [
        {
          "id": "myf1nkq",
          "author": "Specific_Explorer513",
          "body": "Wait I have a question. I am recovered but when I was very underweight and deep in my ED, when I got drunk I would eat ravenously because I would just let go😭does that not happen to you?",
          "created_utc": 1750237672.0
        }
      ]
    },
    {
      "id": "mzg3xbs",
      "author": "New_Penalty_722",
      "body": "Yes. Very much. Almost every time I drink. Drinking lowers inhibitions. My non-professional opinion is that alcohol can sometimes be referred liquid courage. In my case, I'm less afraid of eating and the consequences I associate with eating. As a caveat... I was very upfront with my medical team about reintroducing alcohol I also asked my husband to keep an eye on it for me. ",
      "created_utc": 1750733495.0,
      "score": 1,
      "context": [
        {
          "id": "myf1nkq",
          "author": "Specific_Explorer513",
          "body": "Wait I have a question. I am recovered but when I was very underweight and deep in my ED, when I got drunk I would eat ravenously because I would just let go😭does that not happen to you?",
          "created_utc": 1750237672.0
        }
      ]
    },
    {
      "id": "mygs5jm",
      "author": "D1s4pp10nt3D",
      "body": "so crazy to me how subs like r/ DPH (that has literally had users documentedly DIE while posting) stay up but safe spaces for people struggling with stuff like what we do gets nuked :/",
      "created_utc": 1750261108.0,
      "score": 2,
      "context": [
        {
          "id": "mydy5h3",
          "author": "ExtremelyOnlineTM",
          "body": "There was a sub r/drunkarexia that got nuked a few months ago for being dangerous.\n\nCombining substance use addiction and ED is bad, bad news. I hope you can get the help you need.",
          "created_utc": 1750217170.0
        },
        {
          "id": "mygaehu",
          "author": "drinkliquidclocks-",
          "body": "Oh shit..... Why didn't I notice it being gone? I loved it there:'/",
          "created_utc": 1750256045.0
        }
      ]
    }
  ]
}