{
  "id": "1leghsd",
  "subreddit": "EatingDisorders",
  "author": "Firm-Bite-280",
  "created_utc": 1750251647.0,
  "title": "My daughter (11) is in residential treatment and is miserable.",
  "selftext": "My daughter quickly developed an ED and was hospitalized for a refeeding within weeks. She was home afterward for maybe 5 weeks with little to no progress, and became increasingly restrictive. We had little time to seek any meaningful therapy, which ended up being once a week for those few weeks she was home. Her therapist recommended residential treatment with school being out. She is at a very small residential facility and has been for 2 weeks. She’s not made any progress medically. She is so miserable and won’t even talk to us other than to say she wants to come home. She is also a 5 hour drive away. I’m not looking for medical advice, rather, is this doing more harm mentally for her than good? She’s so young and it is devastating to all of us. Anyone else started so young that had a positive outcome? I feel ready to pull her out and try more therapy locally. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1leghsd/my_daughter_11_is_in_residential_treatment_and_is/",
  "score": 72,
  "num_comments": 65,
  "comments": [
    {
      "id": "myhgze7",
      "author": "BewilderedNotLost",
      "body": "I would try to find out why she's miserable. Ask questions.\n\nIf she's miserable because they are making her eat, then that's to be expected. Offer her support, but keep her in treatment.\n\nHowever, if she's miserable because there's abuse going on, then that's completely valid and she should be moved to a different clinic. Unfortunately, some clinics do perpetuate abuse that can cause PTSD and make things worse in the long run. Note that being made to eat food (as long as she's not allergic) does not count as abuse. I'm talking physical abuse or SA.",
      "created_utc": 1750268032.0,
      "score": 71,
      "context": []
    },
    {
      "id": "myj91b0",
      "author": "runninginbubbles",
      "body": "My mum didn't let them put me in a treatment facility when I was 15 because I begged her not to. \n\nIm 30 now, I'm still really unwell. The best thing that could have happened would have been I was put in hospital and weight restored within the first year or 2 of becoming unwell. \n\nI am so sorry. She is so young. But this is her best shot at getting her life back xx",
      "created_utc": 1750286880.0,
      "score": 14,
      "context": []
    },
    {
      "id": "myh9bpq",
      "author": "Halfsourpicklluvr",
      "body": "Please keep her in. Residential is always miserable at first. I was around the same age as your daughter when I was first hospitalized. I was very resistant at first but eventually came around. She needs help, especially with her being so young she needs to nip it in the bud. And if you’re saying it’s a medical risk, it will get worse if she comes home and doesn’t progress. At least the treatment center can monitor and hopefully improve progress with strict regimen and schedule and more intensive therapy. I was also very far from my family. It’s lonely and devastating and I can’t imagine what it’s like for a parent. But please give it a few more weeks. If she comes home and just does therapy, I truly think that is not enough. You could look into family based treatment but anyone I know who has done that has not had it work out well. I did that and ended up in a residential for an entire year as a teen and have been back to treatment about 6 or 7 times. Don’t give up. I am so sorry you’re going through this.",
      "created_utc": 1750265948.0,
      "score": 30,
      "context": []
    },
    {
      "id": "myivag8",
      "author": "youareinmybubble",
      "body": "Honestly she is miserable because her control over food is taken away.  I was the same, until I started to gain weight and get proper nutrition then I was able to think clearer.",
      "created_utc": 1750282486.0,
      "score": 11,
      "context": []
    },
    {
      "id": "myhz9yn",
      "author": "Wtfisthis66",
      "body": "I was in my late teens when I first was hospitalized. There was a no visitor rule for the first six weeks. It was horrible and I hated it, but it was needed. If you cave in to her behavior, you are caving in yo her disease. She is where she needs to be. Lovie, give yourself some grace. EDs are soul sucking for the person who has one and for those who love them.",
      "created_utc": 1750273150.0,
      "score": 16,
      "context": []
    },
    {
      "id": "myie588",
      "author": "medieval-thot",
      "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
      "created_utc": 1750277461.0,
      "score": 9,
      "context": []
    },
    {
      "id": "myhbegj",
      "author": "Affectionate-Rise996",
      "body": "I’m so sorry. My first time going to residential I was much older, but I acted pretty much the same way. You’re doing the right thing even though it’s so hard. It won’t always be this hard though.",
      "created_utc": 1750266515.0,
      "score": 10,
      "context": []
    },
    {
      "id": "myjiv6f",
      "author": "New_Reach_3263",
      "body": "i was in residential treatment when i was thirteen. My doctors informed my family that it will get worse before it gets better. I am so thankful that I got help even when i didn’t want it. Know that you are doing the right thing. I am praying for your daughter and your family.",
      "created_utc": 1750290112.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mypuqzy",
      "author": "okaysweaty167",
      "body": "My ED started when I was 8, and it took me until age 21 to fully have complete food freedom. I’ve been to treatment like your daughter six times, and from my personal experience, I do not give any credit to those centers in helping me recover. I did all the work at home with outpatient providers in the real world. In my opinion, residential/inpatient should only be for very severe cases of medical instability. Treatment centers are so far from reality, for example you’re literally not aloud to talk about food or even say something tastes good because it’s “triggering”. That’s not how real life works. I respect you for asking others for advice. The best thing you can do is be there for her. Just because she won’t talk to you, don’t stop talking to her. I’m praying for you and your family❤️",
      "created_utc": 1750374937.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mz2ehw1",
      "author": "CRacrofaerie82",
      "body": "I can only speak for myself personally but I had treatment that young as well and it majorly traumatized me.  It absolutely did more harm than good. I would have been better off with just long term outpatient support or some kind if home wrap around program. I would not recommend institutions like that. Medical stability in a hospital is one thing but in my opinion the residential treatment centers are toxic. I am an older adult they havent changed much since the nineties and they churn out a lot of traumatized youth and young adults. Even the \"success stories\" tend to be harmed long term by the infantilization and institutional abuse. They basically taught me I couldn't do anything and caused me to hate myself. I am Autistic and have Arfid and anorexia for reference.",
      "created_utc": 1750548326.0,
      "score": 4,
      "context": []
    },
    {
      "id": "mykeqg6",
      "author": "catwomen999",
      "body": "Is your therapist an expert in eating disorders at this age? Did they recommend FBT or family based treatment? The book by Eva Musby is fantastic and you may find it very helpful. Feel free to DM if you have questions. \n\nMeaningful therapy with a child who is malnourished won’t exist until she is able to gain weight and become medically stable. Right now rapid weight gain is essential to get growth back on track and get her brain online.",
      "created_utc": 1750301485.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myl4uai",
      "author": "TheMagHatter",
      "body": "Be VERY careful about residential facilities and the Troubled Teen Industry. They are commonly abusive. I was at one for a year and a half a little under a decade ago and it was awful. Make sure she isn’t being treated badly by staff",
      "created_utc": 1750313161.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mynn7mi",
      "author": "SophiOfSpades",
      "body": "I was very unwell in my late teens and was told I was going to be looking around the hospital for impatient treatment. Then, for some reason, they decided not to send me.\n\nNow, coming to the end of my twenties, and even though I am a healthy weight, I wish to this day I would have gone because I still struggle every single day.\n\nPlease keep her in. She will likely slip right back once she gets home if not and in being so young is more vulnerable.",
      "created_utc": 1750350541.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myjg9zj",
      "author": "polka-dotcoach",
      "body": "If she's allowed, I'm sure every facility is different, but give/ send her pictures of family and friends and pets so she can hang on her wall or just look at  \n\nAlso, could you write her letters and maybe other family members as long as you feel like they will help her recovery, not harm it.",
      "created_utc": 1750289254.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myjh39y",
      "author": "lostandthin",
      "body": "i would keep her in. it’s hard but in the long run you will help her so much. she needs the help now.",
      "created_utc": 1750289521.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myofsbt",
      "author": "Cassio_Taylor",
      "body": "I am broadly pro treatment firstly but the one thing I will say is it depends on what ed and how it affects her. I have ARFID and struggle with unfamiliarity and just skipping meals without much effect. I’ve also never responded well to strict rules (I tend to fall into malicious compliance as a defence mechanism). After periods of restricted eating, it’s possible your daughter is not suited to inpatient care and the lack of familiarity is causing her so much misery and struggles that it is making it more difficult for her. Having said that familiarity comes from time and I do agree with many people here that usually inpatient care is the best option (putting aside inherently bad facilities as you said you don’t suspect that is what is happening here although keep aware of it) however some people respond poorly to it and may be able to meet her goals to get out but immediately fall back into the same habits. Like I said before though I think treatment is almost always the best option and inpatient when recommended is most of the time the best option",
      "created_utc": 1750359236.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myrq1vn",
      "author": "Open_Priority7402",
      "body": "So sorry you’re going through this. Unfortunately I can’t offer advice, my country doesn’t have residential treatment like yours. I remember when I was 15 and my mum hugging me and crying saying she didn’t know what to do and that she could feel every bone in my body. I couldn’t stand what I was doing to her and tried to get better myself however I didn’t have the skills so my ED then turned into a 20 year struggle with bulimia. Does she want to get better? I feel for you. My ED was so ingrained my desire to have a baby was what saved me. I lost my job, my friends, my marriage, my home to my ED. I didn’t care as long as I was fucking thin. I’m now 39 and just had to spend $15,000 on my teeth and have osteopenia. The thing I most regret about my ED is what it did to my parents. Wishing you all the best and hope your daughter embraces recovery. I hope she realises there’s more to life than being thin. 💗",
      "created_utc": 1750401760.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mysukux",
      "author": "tangsoodoblackbelt",
      "body": "I had an eating order that started at age 16.  It took me 10 years of therapy and two residential treatments to find recovery.  I am now fully recovered.\n\nA couple thoughts about your daughter.  1.  She is probably very homesick.\n2.  Being in a residential program is scary and hard.\n3.  She may not be ready for recovery.  It could take her years to get there.\n\nIf I were you, I ask her to give the program a chance.   She has her whole life ahead of her and the sooner she gets past the ED, the better her life will be.",
      "created_utc": 1750422654.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myvy30j",
      "author": "SavingsPotential7353",
      "body": "Can't really add anything to the advice other people already gave. But keep going momma, you are doing amazing!",
      "created_utc": 1750456255.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mz71ov1",
      "author": "BallSufficient5671",
      "body": "I wish I would've stayed longer in inpatient and residential. Leave her there as long as possible. It's the best thing for her and her ED.",
      "created_utc": 1750617305.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mz7yu9u",
      "author": "Weird-Barracuda-5260",
      "body": "Hi. As a parent of two in recovery, please know that her calls about wanting to come home are extremely normal. I found the phone calls to be so difficult. My youngest did inpatient-IOP followed by FBT at age 16. My oldest became sick last year at 21. She did PHP&IOP. Feel free to message me with any questions or if you need some support.",
      "created_utc": 1750627599.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzt4sd3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1750902610.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n198bai",
      "author": "EmptySpirits26",
      "body": "You’re an amazing parent for caring so much ! <3",
      "created_utc": 1751605453.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1q3zbm",
      "author": "Embracedandbelong",
      "body": "How much longer is residential treatment supposed to be for? Poor baby and you 💝 Since you said she hasn’t made any medical progress, maybe consider pulling her out or changing the location- maybe there is an outpatient she can attend every day instead? I wish I was more educated on what the best resources are",
      "created_utc": 1751847256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n1rsspa",
      "author": "Nugget0839",
      "body": "I worked at one of these and quit as soon as I could. It was just so awful and toxic. Help her at home if you can",
      "created_utc": 1751874404.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2am41l",
      "author": "sociallyawkward_teen",
      "body": "I have no advice, but I do agree with what most people are saying here. Keeping her monitored by medical professionals will help stabilize her in a way that you might not be able to at home. Plus, forcing weight gain when the ed is really just a method of coping will only make her feel like she needs to lose the weight again. There is a deeper issue that is causing her to seek out this level of control.   \n\n\nFor now, I would try to get to the root of what caused the ed. For me, I crave connection and felt like I had to fit a certain mold to ”belong enough” with people for them to like being around me. My therapist made me create a timeline of my thoughts about food and my body. When I was three I told my grandma I couldn’t eat donut holes because they would make me fat- this was a reflection of my Mom’s rejection of her body, so I took that on myself to avoid the perceived punishment of “fat” so that my mom would accept me. Since that discovery I’ve been able to see how the ed isolated me and how I used it to cope with loneliness and insecurity. Thinking back to when I had disordered patterns when I was twelve, it was all about fitting in. Rejection can cause as much stress to your body as a broken bone can, so maybe try to identify if there are areas she feels rejected or needs more love. If anything, remember that while weight can play a large role in an ed, its not just a weight disorder.",
      "created_utc": 1752114743.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myiq656",
      "author": "rooseboose",
      "body": "I’m sorry you’re dealing with this. You say she “quickly” developed an ED…did she have any OCD symptoms that popped up out of nowhere at the same time? And had she been sick at all around that time? If so, you may want to do a quick read up on PANS/PANDAS. Symptoms generally appear out of nowhere, and eating restriction is a major symptom. I don’t mean to suggest that your daughter has this at all, but mine does, and it’s worth ruling out just by reading up on the symptoms and seeing if it matches up with what your daughter is experiencing. Best of luck to your family.",
      "created_utc": 1750280960.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myjk2hw",
      "author": "teddybear65",
      "body": "A residential treatment isn't always the best. I found it abusive to make people sit for hrs with their tray in front of them till they ate. Also didn't like being weighed in the nude.",
      "created_utc": 1750290512.0,
      "score": 0,
      "context": []
    },
    {
      "id": "myfwq9o",
      "author": "AutoModerator",
      "body": "The above submission by /u/Firm-Bite-280 was removed because user has less than minimum karma or is too new. Please investigate and ensure that this action was correct.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1750251648.0,
      "score": -1,
      "context": []
    },
    {
      "id": "myho075",
      "author": "Firm-Bite-280",
      "body": "She wants to come home, and I think that's the underlying issue. She is willingly meeting her intake goals, so I think it's just being lonely and homesick. I do not suspect any sort of abuse, just anger that she is missing her summer :(",
      "created_utc": 1750269944.0,
      "score": 34,
      "context": [
        {
          "id": "myhgze7",
          "author": "BewilderedNotLost",
          "body": "I would try to find out why she's miserable. Ask questions.\n\nIf she's miserable because they are making her eat, then that's to be expected. Offer her support, but keep her in treatment.\n\nHowever, if she's miserable because there's abuse going on, then that's completely valid and she should be moved to a different clinic. Unfortunately, some clinics do perpetuate abuse that can cause PTSD and make things worse in the long run. Note that being made to eat food (as long as she's not allergic) does not count as abuse. I'm talking physical abuse or SA.",
          "created_utc": 1750268032.0
        }
      ]
    },
    {
      "id": "mzfxjcd",
      "author": "New_Penalty_722",
      "body": "I'm in the same boat. I'm 37. I've been to treatment multiple times to no avail. At this point I've had an eating disorder for 2/3 of my life. I'm so so tired... mentally, physically, and emotionally. I am stubborn though. One thing I've done to kind of 'make food fun again' is focus on different international cusines. I love to cook. I trick myself sometimes... I know I can't cook if I don't taste my food... I will cook dinner and make sure it tastes perfect to me. By the time I'm done I've gotten a semi decent dose of food in my system. Another thing that helps sometimes is eating frequent small meals i.e. (fruit and cheese, 1/2 sandwich, a piece of pie, a scoop of frozen yogurt etc...) \nOn another note, I have been vegetarian for 30 years. I still am. I stopped eating meat for religious and ethical reasons. With that being said, I made myself eat meat for the first month. I didn't eat it everyday but I made sure I at least gave it a fair shot. I simply don't like it. I bring this up only to say it's OK for there to be food preferences.",
      "created_utc": 1750731204.0,
      "score": 3,
      "context": [
        {
          "id": "myj91b0",
          "author": "runninginbubbles",
          "body": "My mum didn't let them put me in a treatment facility when I was 15 because I begged her not to. \n\nIm 30 now, I'm still really unwell. The best thing that could have happened would have been I was put in hospital and weight restored within the first year or 2 of becoming unwell. \n\nI am so sorry. She is so young. But this is her best shot at getting her life back xx",
          "created_utc": 1750286880.0
        }
      ]
    },
    {
      "id": "myhcedc",
      "author": "Firm-Bite-280",
      "body": "Thank you for this feedback and perspective. It's often hard to feel good about any of our decisions. But I suppose deep down, I know what you say is true and that this is the best thing we can do for her right now. The older girls there have told her this doesn't work, but I have to remain positive and believe she will benefit in the long term. I read horrible things about FBT on here and do not think that's the right approach at this time. I truly appreciate your sharing your experiences and for thinking of our girl :)",
      "created_utc": 1750266787.0,
      "score": 10,
      "context": [
        {
          "id": "myh9bpq",
          "author": "Halfsourpicklluvr",
          "body": "Please keep her in. Residential is always miserable at first. I was around the same age as your daughter when I was first hospitalized. I was very resistant at first but eventually came around. She needs help, especially with her being so young she needs to nip it in the bud. And if you’re saying it’s a medical risk, it will get worse if she comes home and doesn’t progress. At least the treatment center can monitor and hopefully improve progress with strict regimen and schedule and more intensive therapy. I was also very far from my family. It’s lonely and devastating and I can’t imagine what it’s like for a parent. But please give it a few more weeks. If she comes home and just does therapy, I truly think that is not enough. You could look into family based treatment but anyone I know who has done that has not had it work out well. I did that and ended up in a residential for an entire year as a teen and have been back to treatment about 6 or 7 times. Don’t give up. I am so sorry you’re going through this.",
          "created_utc": 1750265948.0
        }
      ]
    },
    {
      "id": "myj48ll",
      "author": "Firm-Bite-280",
      "body": "I have heard that a lot and hope that is the case. She doesn’t even realize there is a problem yet. 😔",
      "created_utc": 1750285284.0,
      "score": 3,
      "context": [
        {
          "id": "myivag8",
          "author": "youareinmybubble",
          "body": "Honestly she is miserable because her control over food is taken away.  I was the same, until I started to gain weight and get proper nutrition then I was able to think clearer.",
          "created_utc": 1750282486.0
        }
      ]
    },
    {
      "id": "myi4omw",
      "author": "Firm-Bite-280",
      "body": "Thank you so much for your sentiments. Soul sucking is spot on! I can’t even imagine what she must be feeling. I’m learning so much from this community and really appreciate the support. I feel so much for all of you dealing with your ED challenges. I needed this feedback and see I need to trust the process. 🤍",
      "created_utc": 1750274714.0,
      "score": 4,
      "context": [
        {
          "id": "myhz9yn",
          "author": "Wtfisthis66",
          "body": "I was in my late teens when I first was hospitalized. There was a no visitor rule for the first six weeks. It was horrible and I hated it, but it was needed. If you cave in to her behavior, you are caving in yo her disease. She is where she needs to be. Lovie, give yourself some grace. EDs are soul sucking for the person who has one and for those who love them.",
          "created_utc": 1750273150.0
        }
      ]
    },
    {
      "id": "myirppe",
      "author": "Firm-Bite-280",
      "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
      "created_utc": 1750281420.0,
      "score": 6,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        }
      ]
    },
    {
      "id": "myhdxut",
      "author": "Firm-Bite-280",
      "body": "Thank you for your encouragement. I have to believe she will come around. I ran out of tools to help her, so I know it's the best I can do for her. Today already feels a little better.",
      "created_utc": 1750267207.0,
      "score": 5,
      "context": [
        {
          "id": "myhbegj",
          "author": "Affectionate-Rise996",
          "body": "I’m so sorry. My first time going to residential I was much older, but I acted pretty much the same way. You’re doing the right thing even though it’s so hard. It won’t always be this hard though.",
          "created_utc": 1750266515.0
        }
      ]
    },
    {
      "id": "mz72vsk",
      "author": "BallSufficient5671",
      "body": "I've been inpatient 6x too and it never helped me either. What finally helped you recover? I'm anorexic(have been for 30 yrs now)and currently underweight but I'm terrified of gaining too much wt if I eat what I want. I akso can't afford a nutritionist and they are usually more triggering to my anorexia than helpful. ",
      "created_utc": 1750617673.0,
      "score": 2,
      "context": [
        {
          "id": "mypuqzy",
          "author": "okaysweaty167",
          "body": "My ED started when I was 8, and it took me until age 21 to fully have complete food freedom. I’ve been to treatment like your daughter six times, and from my personal experience, I do not give any credit to those centers in helping me recover. I did all the work at home with outpatient providers in the real world. In my opinion, residential/inpatient should only be for very severe cases of medical instability. Treatment centers are so far from reality, for example you’re literally not aloud to talk about food or even say something tastes good because it’s “triggering”. That’s not how real life works. I respect you for asking others for advice. The best thing you can do is be there for her. Just because she won’t talk to you, don’t stop talking to her. I’m praying for you and your family❤️",
          "created_utc": 1750374937.0
        }
      ]
    },
    {
      "id": "mzt5hta",
      "author": "islagracekerr",
      "body": "same",
      "created_utc": 1750902848.0,
      "score": 1,
      "context": [
        {
          "id": "mz2ehw1",
          "author": "CRacrofaerie82",
          "body": "I can only speak for myself personally but I had treatment that young as well and it majorly traumatized me.  It absolutely did more harm than good. I would have been better off with just long term outpatient support or some kind if home wrap around program. I would not recommend institutions like that. Medical stability in a hospital is one thing but in my opinion the residential treatment centers are toxic. I am an older adult they havent changed much since the nineties and they churn out a lot of traumatized youth and young adults. Even the \"success stories\" tend to be harmed long term by the infantilization and institutional abuse. They basically taught me I couldn't do anything and caused me to hate myself. I am Autistic and have Arfid and anorexia for reference.",
          "created_utc": 1750548326.0
        }
      ]
    },
    {
      "id": "myisauh",
      "author": "Firm-Bite-280",
      "body": "I am sorry to hear you have a child struggling as well. This is interesting, as I’ve never had anyone suggest that. I will look into it further for sure. She definitely exhibits OCD tendencies at the core. I really appreciate your time and thoughts and wish you the best also. I",
      "created_utc": 1750281592.0,
      "score": 4,
      "context": [
        {
          "id": "myiq656",
          "author": "rooseboose",
          "body": "I’m sorry you’re dealing with this. You say she “quickly” developed an ED…did she have any OCD symptoms that popped up out of nowhere at the same time? And had she been sick at all around that time? If so, you may want to do a quick read up on PANS/PANDAS. Symptoms generally appear out of nowhere, and eating restriction is a major symptom. I don’t mean to suggest that your daughter has this at all, but mine does, and it’s worth ruling out just by reading up on the symptoms and seeing if it matches up with what your daughter is experiencing. Best of luck to your family.",
          "created_utc": 1750280960.0
        }
      ]
    },
    {
      "id": "myke8cx",
      "author": "catwomen999",
      "body": "Hi, at the age of 11 eating disorders do come on very quickly and a little out of no where. This is not abnormal at this age.",
      "created_utc": 1750301295.0,
      "score": 3,
      "context": [
        {
          "id": "myiq656",
          "author": "rooseboose",
          "body": "I’m sorry you’re dealing with this. You say she “quickly” developed an ED…did she have any OCD symptoms that popped up out of nowhere at the same time? And had she been sick at all around that time? If so, you may want to do a quick read up on PANS/PANDAS. Symptoms generally appear out of nowhere, and eating restriction is a major symptom. I don’t mean to suggest that your daughter has this at all, but mine does, and it’s worth ruling out just by reading up on the symptoms and seeing if it matches up with what your daughter is experiencing. Best of luck to your family.",
          "created_utc": 1750280960.0
        }
      ]
    },
    {
      "id": "myht4oc",
      "author": "BewilderedNotLost",
      "body": "Then that's typical and to be expected. She hates it now, but hopefully she'll start to make friends and learn some useful coping skills and techniques. I definitely still use coping skills I learned while in treatment. \n\nPerhaps when she gets released, offer her the choice of something fun to do before going back to school (within your budget of course). Let her know now, so she can think of what she might want to do and has something to look forward to.",
      "created_utc": 1750271393.0,
      "score": 35,
      "context": [
        {
          "id": "myhgze7",
          "author": "BewilderedNotLost",
          "body": "I would try to find out why she's miserable. Ask questions.\n\nIf she's miserable because they are making her eat, then that's to be expected. Offer her support, but keep her in treatment.\n\nHowever, if she's miserable because there's abuse going on, then that's completely valid and she should be moved to a different clinic. Unfortunately, some clinics do perpetuate abuse that can cause PTSD and make things worse in the long run. Note that being made to eat food (as long as she's not allergic) does not count as abuse. I'm talking physical abuse or SA.",
          "created_utc": 1750268032.0
        },
        {
          "id": "myho075",
          "author": "Firm-Bite-280",
          "body": "She wants to come home, and I think that's the underlying issue. She is willingly meeting her intake goals, so I think it's just being lonely and homesick. I do not suspect any sort of abuse, just anger that she is missing her summer :(",
          "created_utc": 1750269944.0
        }
      ]
    },
    {
      "id": "myhd6ma",
      "author": "Halfsourpicklluvr",
      "body": "Yes, as a child it’s difficult with the other patients. They really have no choice to be there and accept recovery. As an adult in treatment, the general attitude is much better because most of the time you choose to be there. as a tween, I eventually got over the other attitudes of the patients, learned to stick by myself most of the times while still socializing on the surface level, and did quite well for a few years. I would recommend doing php and iop once residential is done. It helped me a lot and I did not relapse with my ED for several years.",
      "created_utc": 1750267001.0,
      "score": 8,
      "context": [
        {
          "id": "myh9bpq",
          "author": "Halfsourpicklluvr",
          "body": "Please keep her in. Residential is always miserable at first. I was around the same age as your daughter when I was first hospitalized. I was very resistant at first but eventually came around. She needs help, especially with her being so young she needs to nip it in the bud. And if you’re saying it’s a medical risk, it will get worse if she comes home and doesn’t progress. At least the treatment center can monitor and hopefully improve progress with strict regimen and schedule and more intensive therapy. I was also very far from my family. It’s lonely and devastating and I can’t imagine what it’s like for a parent. But please give it a few more weeks. If she comes home and just does therapy, I truly think that is not enough. You could look into family based treatment but anyone I know who has done that has not had it work out well. I did that and ended up in a residential for an entire year as a teen and have been back to treatment about 6 or 7 times. Don’t give up. I am so sorry you’re going through this.",
          "created_utc": 1750265948.0
        },
        {
          "id": "myhcedc",
          "author": "Firm-Bite-280",
          "body": "Thank you for this feedback and perspective. It's often hard to feel good about any of our decisions. But I suppose deep down, I know what you say is true and that this is the best thing we can do for her right now. The older girls there have told her this doesn't work, but I have to remain positive and believe she will benefit in the long term. I read horrible things about FBT on here and do not think that's the right approach at this time. I truly appreciate your sharing your experiences and for thinking of our girl :)",
          "created_utc": 1750266787.0
        }
      ]
    },
    {
      "id": "myiyjrf",
      "author": "witty_kitty23",
      "body": "I said the exact same thing to my parents when they made me go to res. I was rly mad at my parents for a while but I’ve come to terms with it now and realized if they didn’t do that my ED might’ve killed me. My relationship w my parents is good now!",
      "created_utc": 1750283478.0,
      "score": 4,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        }
      ]
    },
    {
      "id": "myj1jtc",
      "author": "medieval-thot",
      "body": "I absolutely despised my parents, but it will get better. If you can afford to have her in a comfortable residential: meaning they do not treat her like cattle and give the specialized attention she needs especially at eleven then please continue. Please keep in mind sometimes these places have horrible staff that do make things worse, so reading reviews about the treatment center helps. After being in for a few months one becomes rather grateful to see their parents and get time out. Even if she claims to hate you (which is normal at this age), please remain supportive. Bring her her old favorite snacks (if allowed) AND toys or books, games, makeup things, plushies, hoodies things that interest her etc. just let her know you’re always there for her 🩷",
      "created_utc": 1750284415.0,
      "score": 2,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        }
      ]
    },
    {
      "id": "myixsxe",
      "author": "Megan3356",
      "body": "She is an early teen. I think as teens we all do that to our parents. Or almost all. Do not take it very personal. \n\nHowever I am very worried about her age. She is Very young to be in residential care… \n\nI was in one in Munich (Germany) at seventeen, I absolutely hated it very much. Tbh for me there was no help, I left there broken and just more troubled I guess. \n\nI am in my kid thirties now.",
      "created_utc": 1750283252.0,
      "score": 1,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        }
      ]
    },
    {
      "id": "myjhe4z",
      "author": "polka-dotcoach",
      "body": "I'm sorry!! That's really hard, but you're doing that right thing for her! She may not realize it now or in the next year but years later, she will be thankful you cared so much and wanted her to get better. Please keep showing up every chance you get",
      "created_utc": 1750289622.0,
      "score": 1,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        }
      ]
    },
    {
      "id": "mzfv1ak",
      "author": "okaysweaty167",
      "body": "Honestly I couldn’t have food freedom till I accepted the fact I could never hold on to just “a little” of my ED. It is a disease, very similar to addiction. The 1st step in AA/N.A. is accepting that fact that we are completely powerless over drugs/alcohol. I could not recover from my eating disorder even with a maintenance meal plan, it was too close to controlling my intake. I had to fully understand I could never say no to certain foods if it was based on an ED belief. \n\nWhen I was deep in my ED I craved sweets constantly since I wouldn’t let myself have them. Now that I eat intuitively I’ve found I actually prefer salty to sweet. If there’s two bites left on my plate, but I’m full, I don’t eat it. Lots of people would call this a waste of food. We have refrigerators, people! And if I wake up hungry at 2am, I will eat something because I know if I don’t, I won’t sleep and will most likely go back to the binge/purge/restrict cycle. Even mental health doctors shame night eating, but if your hungry, why not eat? \n\nMy bf is absolutely baffled by the fact I allow myself fast food whenever I’m craving it and have the budget for it. But I don’t crave it all the time like when I was restricting. Fuck, I even crave shit like broccoli now. \n\nThe body image is still hard, but I constantly remind myself almost everyone is too worried about themselves to notice the flaws I don’t like about me. Sorry that was all over the place lol",
      "created_utc": 1750730335.0,
      "score": 3,
      "context": [
        {
          "id": "mypuqzy",
          "author": "okaysweaty167",
          "body": "My ED started when I was 8, and it took me until age 21 to fully have complete food freedom. I’ve been to treatment like your daughter six times, and from my personal experience, I do not give any credit to those centers in helping me recover. I did all the work at home with outpatient providers in the real world. In my opinion, residential/inpatient should only be for very severe cases of medical instability. Treatment centers are so far from reality, for example you’re literally not aloud to talk about food or even say something tastes good because it’s “triggering”. That’s not how real life works. I respect you for asking others for advice. The best thing you can do is be there for her. Just because she won’t talk to you, don’t stop talking to her. I’m praying for you and your family❤️",
          "created_utc": 1750374937.0
        },
        {
          "id": "mz72vsk",
          "author": "BallSufficient5671",
          "body": "I've been inpatient 6x too and it never helped me either. What finally helped you recover? I'm anorexic(have been for 30 yrs now)and currently underweight but I'm terrified of gaining too much wt if I eat what I want. I akso can't afford a nutritionist and they are usually more triggering to my anorexia than helpful. ",
          "created_utc": 1750617673.0
        }
      ]
    },
    {
      "id": "myjcuzm",
      "author": "unremarkable_sapien",
      "body": "If it’s not PANS/PANDAS, another explanation could simply be that it was brewing for a lot longer than you realised. No one develops an ED within weeks, there had to have been something going on for quite a while. EDs are extremely secretive so I don’t blame you at all. The good thing is that she’s so young that if she can get recover now, this will all be a very distant memory in a few years.\n\nYou have the opportunity to get her early help - please do everything in your power to get her better before the ED becomes too entrenched. Keep her in residential, and when she’s ready to come home, make sure she has a therapist to support her. It’s going to be tough but I can’t understate the importance of giving it your all at this early stage.",
      "created_utc": 1750288136.0,
      "score": 2,
      "context": [
        {
          "id": "myiq656",
          "author": "rooseboose",
          "body": "I’m sorry you’re dealing with this. You say she “quickly” developed an ED…did she have any OCD symptoms that popped up out of nowhere at the same time? And had she been sick at all around that time? If so, you may want to do a quick read up on PANS/PANDAS. Symptoms generally appear out of nowhere, and eating restriction is a major symptom. I don’t mean to suggest that your daughter has this at all, but mine does, and it’s worth ruling out just by reading up on the symptoms and seeing if it matches up with what your daughter is experiencing. Best of luck to your family.",
          "created_utc": 1750280960.0
        },
        {
          "id": "myisauh",
          "author": "Firm-Bite-280",
          "body": "I am sorry to hear you have a child struggling as well. This is interesting, as I’ve never had anyone suggest that. I will look into it further for sure. She definitely exhibits OCD tendencies at the core. I really appreciate your time and thoughts and wish you the best also. I",
          "created_utc": 1750281592.0
        }
      ]
    },
    {
      "id": "myi4dem",
      "author": "Halfsourpicklluvr",
      "body": "Yes! My parents took me to the beach once I had finished (we lived very very close to one) and got me some art supplies like watercolors and a sketchbook and new clothes to fit my new body (which was hard but also kind of fun). I also got a nice haircut which was very much needed after being away for so many months, but a nice blowout has always made me feel a little better. Whatever is in your budget to do some small but nice things, usually self care related! Fuzzy socks, nice candle, new blanket etc. My dad also promised me a pig as a joke, still waiting over a decade later.",
      "created_utc": 1750274625.0,
      "score": 26,
      "context": [
        {
          "id": "myhgze7",
          "author": "BewilderedNotLost",
          "body": "I would try to find out why she's miserable. Ask questions.\n\nIf she's miserable because they are making her eat, then that's to be expected. Offer her support, but keep her in treatment.\n\nHowever, if she's miserable because there's abuse going on, then that's completely valid and she should be moved to a different clinic. Unfortunately, some clinics do perpetuate abuse that can cause PTSD and make things worse in the long run. Note that being made to eat food (as long as she's not allergic) does not count as abuse. I'm talking physical abuse or SA.",
          "created_utc": 1750268032.0
        },
        {
          "id": "myho075",
          "author": "Firm-Bite-280",
          "body": "She wants to come home, and I think that's the underlying issue. She is willingly meeting her intake goals, so I think it's just being lonely and homesick. I do not suspect any sort of abuse, just anger that she is missing her summer :(",
          "created_utc": 1750269944.0
        },
        {
          "id": "myht4oc",
          "author": "BewilderedNotLost",
          "body": "Then that's typical and to be expected. She hates it now, but hopefully she'll start to make friends and learn some useful coping skills and techniques. I definitely still use coping skills I learned while in treatment. \n\nPerhaps when she gets released, offer her the choice of something fun to do before going back to school (within your budget of course). Let her know now, so she can think of what she might want to do and has something to look forward to.",
          "created_utc": 1750271393.0
        }
      ]
    },
    {
      "id": "myhztl7",
      "author": "Firm-Bite-280",
      "body": "That’s a great suggestion and I definitely want to do that for her. She is missing out on her whole summer and I hate that for her. I want her to feel she has something to look forward to!",
      "created_utc": 1750273306.0,
      "score": 16,
      "context": [
        {
          "id": "myhgze7",
          "author": "BewilderedNotLost",
          "body": "I would try to find out why she's miserable. Ask questions.\n\nIf she's miserable because they are making her eat, then that's to be expected. Offer her support, but keep her in treatment.\n\nHowever, if she's miserable because there's abuse going on, then that's completely valid and she should be moved to a different clinic. Unfortunately, some clinics do perpetuate abuse that can cause PTSD and make things worse in the long run. Note that being made to eat food (as long as she's not allergic) does not count as abuse. I'm talking physical abuse or SA.",
          "created_utc": 1750268032.0
        },
        {
          "id": "myho075",
          "author": "Firm-Bite-280",
          "body": "She wants to come home, and I think that's the underlying issue. She is willingly meeting her intake goals, so I think it's just being lonely and homesick. I do not suspect any sort of abuse, just anger that she is missing her summer :(",
          "created_utc": 1750269944.0
        },
        {
          "id": "myht4oc",
          "author": "BewilderedNotLost",
          "body": "Then that's typical and to be expected. She hates it now, but hopefully she'll start to make friends and learn some useful coping skills and techniques. I definitely still use coping skills I learned while in treatment. \n\nPerhaps when she gets released, offer her the choice of something fun to do before going back to school (within your budget of course). Let her know now, so she can think of what she might want to do and has something to look forward to.",
          "created_utc": 1750271393.0
        }
      ]
    },
    {
      "id": "n05ty8a",
      "author": "Due-Lavishness2339",
      "body": "Mind blowing 11 year old🤯 a kid",
      "created_utc": 1751070324.0,
      "score": 1,
      "context": [
        {
          "id": "myhgze7",
          "author": "BewilderedNotLost",
          "body": "I would try to find out why she's miserable. Ask questions.\n\nIf she's miserable because they are making her eat, then that's to be expected. Offer her support, but keep her in treatment.\n\nHowever, if she's miserable because there's abuse going on, then that's completely valid and she should be moved to a different clinic. Unfortunately, some clinics do perpetuate abuse that can cause PTSD and make things worse in the long run. Note that being made to eat food (as long as she's not allergic) does not count as abuse. I'm talking physical abuse or SA.",
          "created_utc": 1750268032.0
        },
        {
          "id": "myho075",
          "author": "Firm-Bite-280",
          "body": "She wants to come home, and I think that's the underlying issue. She is willingly meeting her intake goals, so I think it's just being lonely and homesick. I do not suspect any sort of abuse, just anger that she is missing her summer :(",
          "created_utc": 1750269944.0
        },
        {
          "id": "myht4oc",
          "author": "BewilderedNotLost",
          "body": "Then that's typical and to be expected. She hates it now, but hopefully she'll start to make friends and learn some useful coping skills and techniques. I definitely still use coping skills I learned while in treatment. \n\nPerhaps when she gets released, offer her the choice of something fun to do before going back to school (within your budget of course). Let her know now, so she can think of what she might want to do and has something to look forward to.",
          "created_utc": 1750271393.0
        }
      ]
    },
    {
      "id": "myhf3kz",
      "author": "Firm-Bite-280",
      "body": "Her age has made this extremely challenging in general, just because her options are so limited because of it. There are very few options for under 12 or even 14. I definitely want to make sure she has the right step down care afterward, though it will be hard to find locally. I appreciate you sharing the options that have most helped you find success.",
      "created_utc": 1750267521.0,
      "score": 11,
      "context": [
        {
          "id": "myh9bpq",
          "author": "Halfsourpicklluvr",
          "body": "Please keep her in. Residential is always miserable at first. I was around the same age as your daughter when I was first hospitalized. I was very resistant at first but eventually came around. She needs help, especially with her being so young she needs to nip it in the bud. And if you’re saying it’s a medical risk, it will get worse if she comes home and doesn’t progress. At least the treatment center can monitor and hopefully improve progress with strict regimen and schedule and more intensive therapy. I was also very far from my family. It’s lonely and devastating and I can’t imagine what it’s like for a parent. But please give it a few more weeks. If she comes home and just does therapy, I truly think that is not enough. You could look into family based treatment but anyone I know who has done that has not had it work out well. I did that and ended up in a residential for an entire year as a teen and have been back to treatment about 6 or 7 times. Don’t give up. I am so sorry you’re going through this.",
          "created_utc": 1750265948.0
        },
        {
          "id": "myhcedc",
          "author": "Firm-Bite-280",
          "body": "Thank you for this feedback and perspective. It's often hard to feel good about any of our decisions. But I suppose deep down, I know what you say is true and that this is the best thing we can do for her right now. The older girls there have told her this doesn't work, but I have to remain positive and believe she will benefit in the long term. I read horrible things about FBT on here and do not think that's the right approach at this time. I truly appreciate your sharing your experiences and for thinking of our girl :)",
          "created_utc": 1750266787.0
        },
        {
          "id": "myhd6ma",
          "author": "Halfsourpicklluvr",
          "body": "Yes, as a child it’s difficult with the other patients. They really have no choice to be there and accept recovery. As an adult in treatment, the general attitude is much better because most of the time you choose to be there. as a tween, I eventually got over the other attitudes of the patients, learned to stick by myself most of the times while still socializing on the surface level, and did quite well for a few years. I would recommend doing php and iop once residential is done. It helped me a lot and I did not relapse with my ED for several years.",
          "created_utc": 1750267001.0
        }
      ]
    },
    {
      "id": "myj2lfc",
      "author": "Firm-Bite-280",
      "body": "I’m glad you have found success and peace with the situation! I have to keep putting in the time and showing up, regardless. And hopefully someday she’ll understand. I tend to think that’ll happen with age.",
      "created_utc": 1750284747.0,
      "score": 2,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        },
        {
          "id": "myiyjrf",
          "author": "witty_kitty23",
          "body": "I said the exact same thing to my parents when they made me go to res. I was rly mad at my parents for a while but I’ve come to terms with it now and realized if they didn’t do that my ED might’ve killed me. My relationship w my parents is good now!",
          "created_utc": 1750283478.0
        }
      ]
    },
    {
      "id": "myj6jei",
      "author": "Firm-Bite-280",
      "body": "She is at a great place and I will continue to show up for her, even if she doesn’t want me to. This is what love for your children is all about 🤍",
      "created_utc": 1750286042.0,
      "score": 3,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        },
        {
          "id": "myj1jtc",
          "author": "medieval-thot",
          "body": "I absolutely despised my parents, but it will get better. If you can afford to have her in a comfortable residential: meaning they do not treat her like cattle and give the specialized attention she needs especially at eleven then please continue. Please keep in mind sometimes these places have horrible staff that do make things worse, so reading reviews about the treatment center helps. After being in for a few months one becomes rather grateful to see their parents and get time out. Even if she claims to hate you (which is normal at this age), please remain supportive. Bring her her old favorite snacks (if allowed) AND toys or books, games, makeup things, plushies, hoodies things that interest her etc. just let her know you’re always there for her 🩷",
          "created_utc": 1750284415.0
        }
      ]
    },
    {
      "id": "myj29iw",
      "author": "Firm-Bite-280",
      "body": "She had a hospitalization then we tried the conventional therapy/nutritionist for a few weeks and she was closing off. Her pediatrician and therapist both recommended this because she was about to be readmitted. There’s not much in between for her age. There’s only a few other girls so I am hopeful the intimate environment will be positive. Thanks for your thoughts :)",
      "created_utc": 1750284641.0,
      "score": 4,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        },
        {
          "id": "myixsxe",
          "author": "Megan3356",
          "body": "She is an early teen. I think as teens we all do that to our parents. Or almost all. Do not take it very personal. \n\nHowever I am very worried about her age. She is Very young to be in residential care… \n\nI was in one in Munich (Germany) at seventeen, I absolutely hated it very much. Tbh for me there was no help, I left there broken and just more troubled I guess. \n\nI am in my kid thirties now.",
          "created_utc": 1750283252.0
        }
      ]
    },
    {
      "id": "mzjoa23",
      "author": "BallSufficient5671",
      "body": "Well thanks, that was understandable. I just don't think I'm that brave to do this. The extreme hunger is what bothered me the most trying to recover last yr when I cried again. I can't stand that feeling. ..",
      "created_utc": 1750785504.0,
      "score": 3,
      "context": [
        {
          "id": "mypuqzy",
          "author": "okaysweaty167",
          "body": "My ED started when I was 8, and it took me until age 21 to fully have complete food freedom. I’ve been to treatment like your daughter six times, and from my personal experience, I do not give any credit to those centers in helping me recover. I did all the work at home with outpatient providers in the real world. In my opinion, residential/inpatient should only be for very severe cases of medical instability. Treatment centers are so far from reality, for example you’re literally not aloud to talk about food or even say something tastes good because it’s “triggering”. That’s not how real life works. I respect you for asking others for advice. The best thing you can do is be there for her. Just because she won’t talk to you, don’t stop talking to her. I’m praying for you and your family❤️",
          "created_utc": 1750374937.0
        },
        {
          "id": "mz72vsk",
          "author": "BallSufficient5671",
          "body": "I've been inpatient 6x too and it never helped me either. What finally helped you recover? I'm anorexic(have been for 30 yrs now)and currently underweight but I'm terrified of gaining too much wt if I eat what I want. I akso can't afford a nutritionist and they are usually more triggering to my anorexia than helpful. ",
          "created_utc": 1750617673.0
        },
        {
          "id": "mzfv1ak",
          "author": "okaysweaty167",
          "body": "Honestly I couldn’t have food freedom till I accepted the fact I could never hold on to just “a little” of my ED. It is a disease, very similar to addiction. The 1st step in AA/N.A. is accepting that fact that we are completely powerless over drugs/alcohol. I could not recover from my eating disorder even with a maintenance meal plan, it was too close to controlling my intake. I had to fully understand I could never say no to certain foods if it was based on an ED belief. \n\nWhen I was deep in my ED I craved sweets constantly since I wouldn’t let myself have them. Now that I eat intuitively I’ve found I actually prefer salty to sweet. If there’s two bites left on my plate, but I’m full, I don’t eat it. Lots of people would call this a waste of food. We have refrigerators, people! And if I wake up hungry at 2am, I will eat something because I know if I don’t, I won’t sleep and will most likely go back to the binge/purge/restrict cycle. Even mental health doctors shame night eating, but if your hungry, why not eat? \n\nMy bf is absolutely baffled by the fact I allow myself fast food whenever I’m craving it and have the budget for it. But I don’t crave it all the time like when I was restricting. Fuck, I even crave shit like broccoli now. \n\nThe body image is still hard, but I constantly remind myself almost everyone is too worried about themselves to notice the flaws I don’t like about me. Sorry that was all over the place lol",
          "created_utc": 1750730335.0
        }
      ]
    },
    {
      "id": "myi8gg0",
      "author": "Firm-Bite-280",
      "body": "lol the pig! You should treat yourself to one! It is the little things and we’re definitely trying to make sure she knows she is loved and supported. These are great ideas :)",
      "created_utc": 1750275804.0,
      "score": 13,
      "context": [
        {
          "id": "myhgze7",
          "author": "BewilderedNotLost",
          "body": "I would try to find out why she's miserable. Ask questions.\n\nIf she's miserable because they are making her eat, then that's to be expected. Offer her support, but keep her in treatment.\n\nHowever, if she's miserable because there's abuse going on, then that's completely valid and she should be moved to a different clinic. Unfortunately, some clinics do perpetuate abuse that can cause PTSD and make things worse in the long run. Note that being made to eat food (as long as she's not allergic) does not count as abuse. I'm talking physical abuse or SA.",
          "created_utc": 1750268032.0
        },
        {
          "id": "myho075",
          "author": "Firm-Bite-280",
          "body": "She wants to come home, and I think that's the underlying issue. She is willingly meeting her intake goals, so I think it's just being lonely and homesick. I do not suspect any sort of abuse, just anger that she is missing her summer :(",
          "created_utc": 1750269944.0
        },
        {
          "id": "myht4oc",
          "author": "BewilderedNotLost",
          "body": "Then that's typical and to be expected. She hates it now, but hopefully she'll start to make friends and learn some useful coping skills and techniques. I definitely still use coping skills I learned while in treatment. \n\nPerhaps when she gets released, offer her the choice of something fun to do before going back to school (within your budget of course). Let her know now, so she can think of what she might want to do and has something to look forward to.",
          "created_utc": 1750271393.0
        },
        {
          "id": "myi4dem",
          "author": "Halfsourpicklluvr",
          "body": "Yes! My parents took me to the beach once I had finished (we lived very very close to one) and got me some art supplies like watercolors and a sketchbook and new clothes to fit my new body (which was hard but also kind of fun). I also got a nice haircut which was very much needed after being away for so many months, but a nice blowout has always made me feel a little better. Whatever is in your budget to do some small but nice things, usually self care related! Fuzzy socks, nice candle, new blanket etc. My dad also promised me a pig as a joke, still waiting over a decade later.",
          "created_utc": 1750274625.0
        }
      ]
    },
    {
      "id": "myiyoe9",
      "author": "BewilderedNotLost",
      "body": "I love that! Also my dad would have said that, but then it would be a small fake pig lol\n\nFor example, my Dad once gave me a small plastic parakeet and said, and I quote: \"here. This one will never die\" 🤣💀🤣\n\nA very practical man, my father. Haha",
      "created_utc": 1750283518.0,
      "score": 6,
      "context": [
        {
          "id": "myhgze7",
          "author": "BewilderedNotLost",
          "body": "I would try to find out why she's miserable. Ask questions.\n\nIf she's miserable because they are making her eat, then that's to be expected. Offer her support, but keep her in treatment.\n\nHowever, if she's miserable because there's abuse going on, then that's completely valid and she should be moved to a different clinic. Unfortunately, some clinics do perpetuate abuse that can cause PTSD and make things worse in the long run. Note that being made to eat food (as long as she's not allergic) does not count as abuse. I'm talking physical abuse or SA.",
          "created_utc": 1750268032.0
        },
        {
          "id": "myho075",
          "author": "Firm-Bite-280",
          "body": "She wants to come home, and I think that's the underlying issue. She is willingly meeting her intake goals, so I think it's just being lonely and homesick. I do not suspect any sort of abuse, just anger that she is missing her summer :(",
          "created_utc": 1750269944.0
        },
        {
          "id": "myht4oc",
          "author": "BewilderedNotLost",
          "body": "Then that's typical and to be expected. She hates it now, but hopefully she'll start to make friends and learn some useful coping skills and techniques. I definitely still use coping skills I learned while in treatment. \n\nPerhaps when she gets released, offer her the choice of something fun to do before going back to school (within your budget of course). Let her know now, so she can think of what she might want to do and has something to look forward to.",
          "created_utc": 1750271393.0
        },
        {
          "id": "myi4dem",
          "author": "Halfsourpicklluvr",
          "body": "Yes! My parents took me to the beach once I had finished (we lived very very close to one) and got me some art supplies like watercolors and a sketchbook and new clothes to fit my new body (which was hard but also kind of fun). I also got a nice haircut which was very much needed after being away for so many months, but a nice blowout has always made me feel a little better. Whatever is in your budget to do some small but nice things, usually self care related! Fuzzy socks, nice candle, new blanket etc. My dad also promised me a pig as a joke, still waiting over a decade later.",
          "created_utc": 1750274625.0
        }
      ]
    },
    {
      "id": "myhf9lp",
      "author": "Halfsourpicklluvr",
      "body": "Have you looked into clementine?",
      "created_utc": 1750267567.0,
      "score": 4,
      "context": [
        {
          "id": "myh9bpq",
          "author": "Halfsourpicklluvr",
          "body": "Please keep her in. Residential is always miserable at first. I was around the same age as your daughter when I was first hospitalized. I was very resistant at first but eventually came around. She needs help, especially with her being so young she needs to nip it in the bud. And if you’re saying it’s a medical risk, it will get worse if she comes home and doesn’t progress. At least the treatment center can monitor and hopefully improve progress with strict regimen and schedule and more intensive therapy. I was also very far from my family. It’s lonely and devastating and I can’t imagine what it’s like for a parent. But please give it a few more weeks. If she comes home and just does therapy, I truly think that is not enough. You could look into family based treatment but anyone I know who has done that has not had it work out well. I did that and ended up in a residential for an entire year as a teen and have been back to treatment about 6 or 7 times. Don’t give up. I am so sorry you’re going through this.",
          "created_utc": 1750265948.0
        },
        {
          "id": "myhcedc",
          "author": "Firm-Bite-280",
          "body": "Thank you for this feedback and perspective. It's often hard to feel good about any of our decisions. But I suppose deep down, I know what you say is true and that this is the best thing we can do for her right now. The older girls there have told her this doesn't work, but I have to remain positive and believe she will benefit in the long term. I read horrible things about FBT on here and do not think that's the right approach at this time. I truly appreciate your sharing your experiences and for thinking of our girl :)",
          "created_utc": 1750266787.0
        },
        {
          "id": "myhd6ma",
          "author": "Halfsourpicklluvr",
          "body": "Yes, as a child it’s difficult with the other patients. They really have no choice to be there and accept recovery. As an adult in treatment, the general attitude is much better because most of the time you choose to be there. as a tween, I eventually got over the other attitudes of the patients, learned to stick by myself most of the times while still socializing on the surface level, and did quite well for a few years. I would recommend doing php and iop once residential is done. It helped me a lot and I did not relapse with my ED for several years.",
          "created_utc": 1750267001.0
        },
        {
          "id": "myhf3kz",
          "author": "Firm-Bite-280",
          "body": "Her age has made this extremely challenging in general, just because her options are so limited because of it. There are very few options for under 12 or even 14. I definitely want to make sure she has the right step down care afterward, though it will be hard to find locally. I appreciate you sharing the options that have most helped you find success.",
          "created_utc": 1750267521.0
        }
      ]
    },
    {
      "id": "myj7qcr",
      "author": "witty_kitty23",
      "body": "Exactly!!",
      "created_utc": 1750286443.0,
      "score": 1,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        },
        {
          "id": "myiyjrf",
          "author": "witty_kitty23",
          "body": "I said the exact same thing to my parents when they made me go to res. I was rly mad at my parents for a while but I’ve come to terms with it now and realized if they didn’t do that my ED might’ve killed me. My relationship w my parents is good now!",
          "created_utc": 1750283478.0
        },
        {
          "id": "myj2lfc",
          "author": "Firm-Bite-280",
          "body": "I’m glad you have found success and peace with the situation! I have to keep putting in the time and showing up, regardless. And hopefully someday she’ll understand. I tend to think that’ll happen with age.",
          "created_utc": 1750284747.0
        }
      ]
    },
    {
      "id": "myj3cjj",
      "author": "Megan3356",
      "body": "I think you are a good mom. Mine never talked to me about this stuff. She is still horrible, on so many levels. Mine put me on a diet when I was six years old because she thought I am chubby. I was but WTF who puts kids that young on a diet? And to make it worse it was a low salt diet so I started feeling sick and such. \nSo no worries you are doing fine. Good luck dear 🫶🏼",
      "created_utc": 1750284992.0,
      "score": 3,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        },
        {
          "id": "myixsxe",
          "author": "Megan3356",
          "body": "She is an early teen. I think as teens we all do that to our parents. Or almost all. Do not take it very personal. \n\nHowever I am very worried about her age. She is Very young to be in residential care… \n\nI was in one in Munich (Germany) at seventeen, I absolutely hated it very much. Tbh for me there was no help, I left there broken and just more troubled I guess. \n\nI am in my kid thirties now.",
          "created_utc": 1750283252.0
        },
        {
          "id": "myj29iw",
          "author": "Firm-Bite-280",
          "body": "She had a hospitalization then we tried the conventional therapy/nutritionist for a few weeks and she was closing off. Her pediatrician and therapist both recommended this because she was about to be readmitted. There’s not much in between for her age. There’s only a few other girls so I am hopeful the intimate environment will be positive. Thanks for your thoughts :)",
          "created_utc": 1750284641.0
        }
      ]
    },
    {
      "id": "mzke228",
      "author": "okaysweaty167",
      "body": "That’s completely understandable. Hunger can still be a scary feeling for me sometimes.",
      "created_utc": 1750792687.0,
      "score": 3,
      "context": [
        {
          "id": "mypuqzy",
          "author": "okaysweaty167",
          "body": "My ED started when I was 8, and it took me until age 21 to fully have complete food freedom. I’ve been to treatment like your daughter six times, and from my personal experience, I do not give any credit to those centers in helping me recover. I did all the work at home with outpatient providers in the real world. In my opinion, residential/inpatient should only be for very severe cases of medical instability. Treatment centers are so far from reality, for example you’re literally not aloud to talk about food or even say something tastes good because it’s “triggering”. That’s not how real life works. I respect you for asking others for advice. The best thing you can do is be there for her. Just because she won’t talk to you, don’t stop talking to her. I’m praying for you and your family❤️",
          "created_utc": 1750374937.0
        },
        {
          "id": "mz72vsk",
          "author": "BallSufficient5671",
          "body": "I've been inpatient 6x too and it never helped me either. What finally helped you recover? I'm anorexic(have been for 30 yrs now)and currently underweight but I'm terrified of gaining too much wt if I eat what I want. I akso can't afford a nutritionist and they are usually more triggering to my anorexia than helpful. ",
          "created_utc": 1750617673.0
        },
        {
          "id": "mzfv1ak",
          "author": "okaysweaty167",
          "body": "Honestly I couldn’t have food freedom till I accepted the fact I could never hold on to just “a little” of my ED. It is a disease, very similar to addiction. The 1st step in AA/N.A. is accepting that fact that we are completely powerless over drugs/alcohol. I could not recover from my eating disorder even with a maintenance meal plan, it was too close to controlling my intake. I had to fully understand I could never say no to certain foods if it was based on an ED belief. \n\nWhen I was deep in my ED I craved sweets constantly since I wouldn’t let myself have them. Now that I eat intuitively I’ve found I actually prefer salty to sweet. If there’s two bites left on my plate, but I’m full, I don’t eat it. Lots of people would call this a waste of food. We have refrigerators, people! And if I wake up hungry at 2am, I will eat something because I know if I don’t, I won’t sleep and will most likely go back to the binge/purge/restrict cycle. Even mental health doctors shame night eating, but if your hungry, why not eat? \n\nMy bf is absolutely baffled by the fact I allow myself fast food whenever I’m craving it and have the budget for it. But I don’t crave it all the time like when I was restricting. Fuck, I even crave shit like broccoli now. \n\nThe body image is still hard, but I constantly remind myself almost everyone is too worried about themselves to notice the flaws I don’t like about me. Sorry that was all over the place lol",
          "created_utc": 1750730335.0
        },
        {
          "id": "mzjoa23",
          "author": "BallSufficient5671",
          "body": "Well thanks, that was understandable. I just don't think I'm that brave to do this. The extreme hunger is what bothered me the most trying to recover last yr when I cried again. I can't stand that feeling. ..",
          "created_utc": 1750785504.0
        }
      ]
    },
    {
      "id": "myj2qde",
      "author": "Firm-Bite-280",
      "body": "🤣🤍🐷",
      "created_utc": 1750284792.0,
      "score": 1,
      "context": [
        {
          "id": "myhgze7",
          "author": "BewilderedNotLost",
          "body": "I would try to find out why she's miserable. Ask questions.\n\nIf she's miserable because they are making her eat, then that's to be expected. Offer her support, but keep her in treatment.\n\nHowever, if she's miserable because there's abuse going on, then that's completely valid and she should be moved to a different clinic. Unfortunately, some clinics do perpetuate abuse that can cause PTSD and make things worse in the long run. Note that being made to eat food (as long as she's not allergic) does not count as abuse. I'm talking physical abuse or SA.",
          "created_utc": 1750268032.0
        },
        {
          "id": "myho075",
          "author": "Firm-Bite-280",
          "body": "She wants to come home, and I think that's the underlying issue. She is willingly meeting her intake goals, so I think it's just being lonely and homesick. I do not suspect any sort of abuse, just anger that she is missing her summer :(",
          "created_utc": 1750269944.0
        },
        {
          "id": "myht4oc",
          "author": "BewilderedNotLost",
          "body": "Then that's typical and to be expected. She hates it now, but hopefully she'll start to make friends and learn some useful coping skills and techniques. I definitely still use coping skills I learned while in treatment. \n\nPerhaps when she gets released, offer her the choice of something fun to do before going back to school (within your budget of course). Let her know now, so she can think of what she might want to do and has something to look forward to.",
          "created_utc": 1750271393.0
        },
        {
          "id": "myi4dem",
          "author": "Halfsourpicklluvr",
          "body": "Yes! My parents took me to the beach once I had finished (we lived very very close to one) and got me some art supplies like watercolors and a sketchbook and new clothes to fit my new body (which was hard but also kind of fun). I also got a nice haircut which was very much needed after being away for so many months, but a nice blowout has always made me feel a little better. Whatever is in your budget to do some small but nice things, usually self care related! Fuzzy socks, nice candle, new blanket etc. My dad also promised me a pig as a joke, still waiting over a decade later.",
          "created_utc": 1750274625.0
        },
        {
          "id": "myiyoe9",
          "author": "BewilderedNotLost",
          "body": "I love that! Also my dad would have said that, but then it would be a small fake pig lol\n\nFor example, my Dad once gave me a small plastic parakeet and said, and I quote: \"here. This one will never die\" 🤣💀🤣\n\nA very practical man, my father. Haha",
          "created_utc": 1750283518.0
        }
      ]
    },
    {
      "id": "myhgi4x",
      "author": "Firm-Bite-280",
      "body": "I had initially, yes. But there are no treatment locations nearby, although virtual may be an option. Thank you for the suggestion.",
      "created_utc": 1750267901.0,
      "score": 6,
      "context": [
        {
          "id": "myh9bpq",
          "author": "Halfsourpicklluvr",
          "body": "Please keep her in. Residential is always miserable at first. I was around the same age as your daughter when I was first hospitalized. I was very resistant at first but eventually came around. She needs help, especially with her being so young she needs to nip it in the bud. And if you’re saying it’s a medical risk, it will get worse if she comes home and doesn’t progress. At least the treatment center can monitor and hopefully improve progress with strict regimen and schedule and more intensive therapy. I was also very far from my family. It’s lonely and devastating and I can’t imagine what it’s like for a parent. But please give it a few more weeks. If she comes home and just does therapy, I truly think that is not enough. You could look into family based treatment but anyone I know who has done that has not had it work out well. I did that and ended up in a residential for an entire year as a teen and have been back to treatment about 6 or 7 times. Don’t give up. I am so sorry you’re going through this.",
          "created_utc": 1750265948.0
        },
        {
          "id": "myhcedc",
          "author": "Firm-Bite-280",
          "body": "Thank you for this feedback and perspective. It's often hard to feel good about any of our decisions. But I suppose deep down, I know what you say is true and that this is the best thing we can do for her right now. The older girls there have told her this doesn't work, but I have to remain positive and believe she will benefit in the long term. I read horrible things about FBT on here and do not think that's the right approach at this time. I truly appreciate your sharing your experiences and for thinking of our girl :)",
          "created_utc": 1750266787.0
        },
        {
          "id": "myhd6ma",
          "author": "Halfsourpicklluvr",
          "body": "Yes, as a child it’s difficult with the other patients. They really have no choice to be there and accept recovery. As an adult in treatment, the general attitude is much better because most of the time you choose to be there. as a tween, I eventually got over the other attitudes of the patients, learned to stick by myself most of the times while still socializing on the surface level, and did quite well for a few years. I would recommend doing php and iop once residential is done. It helped me a lot and I did not relapse with my ED for several years.",
          "created_utc": 1750267001.0
        },
        {
          "id": "myhf3kz",
          "author": "Firm-Bite-280",
          "body": "Her age has made this extremely challenging in general, just because her options are so limited because of it. There are very few options for under 12 or even 14. I definitely want to make sure she has the right step down care afterward, though it will be hard to find locally. I appreciate you sharing the options that have most helped you find success.",
          "created_utc": 1750267521.0
        },
        {
          "id": "myhf9lp",
          "author": "Halfsourpicklluvr",
          "body": "Have you looked into clementine?",
          "created_utc": 1750267567.0
        }
      ]
    },
    {
      "id": "myj5ydx",
      "author": "Firm-Bite-280",
      "body": "Thank you. I am so sorry that you experienced that. I hope you have found peace.",
      "created_utc": 1750285849.0,
      "score": 4,
      "context": [
        {
          "id": "myie588",
          "author": "medieval-thot",
          "body": "Hi, please keep her in. My biggest mistake was cheating my way through treatment and it cost me greatly years later, even now. She will be depressed for a bit, but it’ll all come around. Eating disorders stem multiple diagnosis. Be her rock, and try to talk about different things not so centered around food all the time. The biggest mistake in a kids residential treatment is making their entire stay their identity.",
          "created_utc": 1750277461.0
        },
        {
          "id": "myirppe",
          "author": "Firm-Bite-280",
          "body": "Thank you for sharing your experience. Unfortunately, she blames me and says I’m ruining her life, therefore not speaking to me much. It’s devastating…even though I know I’m doing what I need to do. I’m at a loss 😢",
          "created_utc": 1750281420.0
        },
        {
          "id": "myixsxe",
          "author": "Megan3356",
          "body": "She is an early teen. I think as teens we all do that to our parents. Or almost all. Do not take it very personal. \n\nHowever I am very worried about her age. She is Very young to be in residential care… \n\nI was in one in Munich (Germany) at seventeen, I absolutely hated it very much. Tbh for me there was no help, I left there broken and just more troubled I guess. \n\nI am in my kid thirties now.",
          "created_utc": 1750283252.0
        },
        {
          "id": "myj29iw",
          "author": "Firm-Bite-280",
          "body": "She had a hospitalization then we tried the conventional therapy/nutritionist for a few weeks and she was closing off. Her pediatrician and therapist both recommended this because she was about to be readmitted. There’s not much in between for her age. There’s only a few other girls so I am hopeful the intimate environment will be positive. Thanks for your thoughts :)",
          "created_utc": 1750284641.0
        },
        {
          "id": "myj3cjj",
          "author": "Megan3356",
          "body": "I think you are a good mom. Mine never talked to me about this stuff. She is still horrible, on so many levels. Mine put me on a diet when I was six years old because she thought I am chubby. I was but WTF who puts kids that young on a diet? And to make it worse it was a low salt diet so I started feeling sick and such. \nSo no worries you are doing fine. Good luck dear 🫶🏼",
          "created_utc": 1750284992.0
        }
      ]
    }
  ]
}