{
  "id": "1lfpp87",
  "subreddit": "EatingDisorders",
  "author": "Final-Swordfish-2863",
  "created_utc": 1750376951.0,
  "title": "Concerned about my elite athlete husband's food fixation",
  "selftext": "I (38f) am married to a marathoner (45m). He is very, very, very fast. In recent years, he has become increasingly fixated on nutrition as it pertains to his running. During the lead up to a race, he has strict dietary requirements and can become quite irritable if they are not immediately met, such as if we don't have suitable ingredients for a specific meal. To be clear, we do a ton of meal planning, and I am well versed in his nutritional needs, but things happen, plans change, we're all just human, etc.  \n  \nFor a long time I just thought, well, this is what he has to do to be fast. But right now is his \"off\" season, his diet is less strict, and somehow he is becoming even more irritable surrounding food. It's like a compulsion. If I say anything to him in the morning, it's \"okay but first can we talk about lunch.\" If it's the afternoon, \"okay but what are we having for dinner.\" It's to the point where it's more or less all we talk about. I'm pretty sure it's all he thinks about. It's gotten to the point where we're bickering about things I don't care about (for example having chicken two meals in a row, that's fine with me, but he brings it up like he's anticipating me having a problem with it).  \n  \nA friend suggested this is starting to verge on disordered thinking about food. It's definitely impacting our relationship. So I am here to ask for resources. I would love to read some things, join a facebook group or subreddit, about disordered thinking about food in high level athletes. Everything I have read is for people with an ED before they got into running, or are running their first marathon, or encourage the non-runner partner to be more supportive.\n\nI want to add that his actual diet is pretty healthy. It's the fixation on it that is worrying me. It's as though what he eats is more important than our relationship.\n\n  \nAny help is appreciated, and sending best wishes to anyone out there struggling.\n\n\\*Apologies for the throwaway account, I promise I have a real account with post history but trying to keep our privacy. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1lfpp87/concerned_about_my_elite_athlete_husbands_food/",
  "score": 36,
  "num_comments": 26,
  "comments": [
    {
      "id": "myr8meg",
      "author": "FalseRow5812",
      "body": "Sounds like ARFID or orthorexia potentially. He should see a therapist",
      "created_utc": 1750393154.0,
      "score": 30,
      "context": []
    },
    {
      "id": "myr8bj0",
      "author": "ThatpersonRobert",
      "body": "\" I want to add that his actual diet is pretty healthy. It's the fixation on it that is worrying me. \"\n\n  Yes, I get what you mean.   The fixation part, that is.  \n\nIn my case, I was dating this woman, things developed pretty quickly, but once they had...she let me know that she was the top-ranked female bike racer in our state.  I know a few things  about EDs, so rather than thinking \"Gosh that's wonderful\", I was more like \"Uh oh \" instead. \n\nYour situation sounds more complicated though. Not only is he fixated on food, he's fixated on sport and exercise too.  Which can make certain otherwise good people fall into obsession and craziness. \n\nWith the person I knew, it took the form of her lying to me about all sorts of big and small things. She was not a bad person, but...there were symptoms.  I only saw her cry twice : Once when she said \"I just want to be perfect\", and the second time when she confessed that she trained so much because it \"helped her not think about things.\"\n\nSo I think you are right in thinking that there's an emotional component to this, even if he is being really successful with his running.   \n\n(Not sure why the AutoMod bot is here : Your post sounds fine to me, plus other people seem to be getting this too, today.  So some kind of glitch it seems ?)",
      "created_utc": 1750393021.0,
      "score": 13,
      "context": []
    },
    {
      "id": "myrtcue",
      "author": "Turbulent-Ability271",
      "body": "He is likely malnourished. Malnutrition causes people to think and act this way. I encourage you to read the Minnesota Starvation experiment. His strict dieting and high level of exercise may have led to malnutrition, which increases food obsession. It's a vicious cycle, and how many eating disorders start. Seeing a doctor and/or an eating disorder specialised dietician may be of benefit.",
      "created_utc": 1750403595.0,
      "score": 24,
      "context": []
    },
    {
      "id": "myruokd",
      "author": "telepathiccomfort",
      "body": "Yeah, this sounds like it's bordering disordered, possibly orthorexia. Very common in high level althletes and not so much spoken about. \"like a compulsion\" \"it's the fixation\" \"it's all he thinks about\" and \"it's as though what he eats is more important than our relationship\" are key points here, this is exactly what an ED does. \n\nI would talk to him about it and express your concern. Has he noticed these things too? Is he also worried? Or does he see no issue with it? He should speak to a therapist so it doesn't ruin his life as a marathoner. It's a slippery slope for many athletes until you're unable to do the thing you love anymore without it breaking you, and you have to retire \n\nI don't have any recourses really, as I'm in a non-english country so all the recourses I know are probably in a foreign language to you. But I did hear about this podcast, maybe it can be helpful: [https://open.spotify.com/show/4HWsD90zK6fEyuEcfVxlwF](https://open.spotify.com/show/4HWsD90zK6fEyuEcfVxlwF)",
      "created_utc": 1750404352.0,
      "score": 7,
      "context": []
    },
    {
      "id": "myt2igc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1750425465.0,
      "score": 7,
      "context": []
    },
    {
      "id": "mysjvlp",
      "author": "Imaginary-Vanilla839",
      "body": "Sounds like orthorexia. (Obligated to say I’m not a doctor but if you look it up you will probably resonate with the symptoms).",
      "created_utc": 1750418275.0,
      "score": 5,
      "context": []
    },
    {
      "id": "mytubeb",
      "author": "BestWesterChester",
      "body": "It's generally considered a disorder when it's affecting other parts of your life, and it is. I am a former triathlete and I can tell you that disordered eating is very common among endurance athletes.\n\nEdit: I should add that I'm also male. Eating disorders are often seen as a female problem so this adds to the challenge",
      "created_utc": 1750433882.0,
      "score": 4,
      "context": []
    },
    {
      "id": "myu9tn9",
      "author": "TheyCalledTheWind",
      "body": "Here to agree this is probably orthorexia, speaking from experience. If it is starting to impact the relationship and he is unwilling to start therapy for an ED, you might ask for couples counseling so you can share your feelings and experiences in a neutral space with someone who can tell him his behavior is unhealthy and who may be able to act as a bridge for him to individual treatment.",
      "created_utc": 1750438389.0,
      "score": 3,
      "context": []
    },
    {
      "id": "myz72hw",
      "author": "Accomplished-Mud-173",
      "body": "As a recovering orthorexic, this fixation on sports nutrition sounds all too familiar. I was very much like this for over ten years, but I was obsessed with weightlifting. It started off fairly healthy and I ate very well but then I slowly got more obsessed with little details and I got very irritated with any little changes and was really awful to my loved ones if anything deviatied from my 'plans'. Eventually, I got really ill and was forced to look at my unhealthy obsession if I wanted to live and recover. You are very right to be concerned, and I hope you can continue to support your husband and try to convince him to seek ED help before a health crisis happens.",
      "created_utc": 1750509472.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mzgugd3",
      "author": "CompetitiveServe1385",
      "body": "Athlete here. It’s hard to tell exactly, but this looks like disordered eating (which is unfortunately too common among runners). He definitely needs specialist help before he slips into some bigger problems.",
      "created_utc": 1750745430.0,
      "score": 2,
      "context": []
    },
    {
      "id": "mzhl3fi",
      "author": "humbledbyit",
      "body": "Yes. What qualifies someone as having an ED is the obsession around food & consequences of getting or not getting what we want. The person with ED has to realize their is a problem & suffer consequences of their behavior. If it were me id pray about how to bring up my concern to my partner esp bc you say it feels like he cares more about it than the relationship. Just know if he denies it or gets defensive or angry then he's not ready to face it.",
      "created_utc": 1750760844.0,
      "score": 2,
      "context": []
    },
    {
      "id": "myx7xsz",
      "author": "chironreversed",
      "body": "He needs therapy",
      "created_utc": 1750472701.0,
      "score": 1,
      "context": []
    },
    {
      "id": "mzw5pf4",
      "author": "Acrobatic_Software86",
      "body": "Unpopular opinion, he's probably fine marathon runners and any elite is very aware of there body and it's needs. People are aloud to want to be healthy I don't understand how people are acting like professional doctors in the comments diagnosing him it's ridiculous. These comments are an echo chamber or diagnosing a person you read a couple of sentences about. Just talk to him he's ur husband u should be able to sit down and have difficult conversation. People jump to conclusions when it comes to food b/c they are projecting their problems. he's def not malnourished he's a marathon runner ppl generally cant be an elite athlete while malnourished. This is not an ED, but a clash of life styles IMO. BUT I could be wrong I'm not going to make statements about someone I don't know and act like they are facts. Talk to him if yall both agree there's an issue get help from professionals, not a bunch of people projecting their problem on reddit. I don't want to sound rude, but good god ppl are actually trying to diagnose him of this little info and that's ridiculous. YOUR CONCERNS ARE VERY VALID THOUGH, I just think the comments are fear mongering an insane amount, he could very well have an ED, but nothing you said should have random ppl diagnosing IMO. if the issue persists get him a simple therapy session or visit with a nutritionist simple as that. No need to try and figure out the exact issue we have professionals for that",
      "created_utc": 1750949730.0,
      "score": 1,
      "context": []
    },
    {
      "id": "myq0qiy",
      "author": "AutoModerator",
      "body": "The above submission by /u/Final-Swordfish-2863 was removed due to the account not meeting the minimum karma or account age. It has been sent to moderators for manual review.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1750376951.0,
      "score": -2,
      "context": []
    },
    {
      "id": "myzvjpb",
      "author": "booreaves",
      "body": "I agree with orthorexia. I recommend reading Sick Enough by Jennifer Guadiani. Your husband likely isn’t getting enough food daily. Additionally if he eats “super healthy” he’s likely missing out on essential nutrients that normal foods provide.",
      "created_utc": 1750518337.0,
      "score": 3,
      "context": [
        {
          "id": "myr8meg",
          "author": "FalseRow5812",
          "body": "Sounds like ARFID or orthorexia potentially. He should see a therapist",
          "created_utc": 1750393154.0
        }
      ]
    },
    {
      "id": "myt5yhy",
      "author": "Final-Swordfish-2863",
      "body": "Eh I'm fine with the bot, this IS a throwaway account after all. :) Thank you for posting, I am glad to hear from someone who has any kind of proximity to this kind of thing. My friends try but don't really relate (which is part of why I posted).",
      "created_utc": 1750426625.0,
      "score": 2,
      "context": [
        {
          "id": "myr8bj0",
          "author": "ThatpersonRobert",
          "body": "\" I want to add that his actual diet is pretty healthy. It's the fixation on it that is worrying me. \"\n\n  Yes, I get what you mean.   The fixation part, that is.  \n\nIn my case, I was dating this woman, things developed pretty quickly, but once they had...she let me know that she was the top-ranked female bike racer in our state.  I know a few things  about EDs, so rather than thinking \"Gosh that's wonderful\", I was more like \"Uh oh \" instead. \n\nYour situation sounds more complicated though. Not only is he fixated on food, he's fixated on sport and exercise too.  Which can make certain otherwise good people fall into obsession and craziness. \n\nWith the person I knew, it took the form of her lying to me about all sorts of big and small things. She was not a bad person, but...there were symptoms.  I only saw her cry twice : Once when she said \"I just want to be perfect\", and the second time when she confessed that she trained so much because it \"helped her not think about things.\"\n\nSo I think you are right in thinking that there's an emotional component to this, even if he is being really successful with his running.   \n\n(Not sure why the AutoMod bot is here : Your post sounds fine to me, plus other people seem to be getting this too, today.  So some kind of glitch it seems ?)",
          "created_utc": 1750393021.0
        }
      ]
    },
    {
      "id": "mys1l2c",
      "author": "houston_veronica",
      "body": "Excellent advice.",
      "created_utc": 1750408402.0,
      "score": 3,
      "context": [
        {
          "id": "myrtcue",
          "author": "Turbulent-Ability271",
          "body": "He is likely malnourished. Malnutrition causes people to think and act this way. I encourage you to read the Minnesota Starvation experiment. His strict dieting and high level of exercise may have led to malnutrition, which increases food obsession. It's a vicious cycle, and how many eating disorders start. Seeing a doctor and/or an eating disorder specialised dietician may be of benefit.",
          "created_utc": 1750403595.0
        }
      ]
    },
    {
      "id": "myuhy81",
      "author": "ThatpersonRobert",
      "body": "Yep, the Keys study.  Those guys didn't even want to get thin, but they still got many of the same psychological and obsessional symptoms that people with eating disorders do.",
      "created_utc": 1750440660.0,
      "score": 4,
      "context": [
        {
          "id": "myrtcue",
          "author": "Turbulent-Ability271",
          "body": "He is likely malnourished. Malnutrition causes people to think and act this way. I encourage you to read the Minnesota Starvation experiment. His strict dieting and high level of exercise may have led to malnutrition, which increases food obsession. It's a vicious cycle, and how many eating disorders start. Seeing a doctor and/or an eating disorder specialised dietician may be of benefit.",
          "created_utc": 1750403595.0
        }
      ]
    },
    {
      "id": "myt644m",
      "author": "Final-Swordfish-2863",
      "body": "Thank you for the podcast recommendation! I can read Spanish Dutch and German if that's at all helpful. :)",
      "created_utc": 1750426675.0,
      "score": 2,
      "context": [
        {
          "id": "myruokd",
          "author": "telepathiccomfort",
          "body": "Yeah, this sounds like it's bordering disordered, possibly orthorexia. Very common in high level althletes and not so much spoken about. \"like a compulsion\" \"it's the fixation\" \"it's all he thinks about\" and \"it's as though what he eats is more important than our relationship\" are key points here, this is exactly what an ED does. \n\nI would talk to him about it and express your concern. Has he noticed these things too? Is he also worried? Or does he see no issue with it? He should speak to a therapist so it doesn't ruin his life as a marathoner. It's a slippery slope for many athletes until you're unable to do the thing you love anymore without it breaking you, and you have to retire \n\nI don't have any recourses really, as I'm in a non-english country so all the recourses I know are probably in a foreign language to you. But I did hear about this podcast, maybe it can be helpful: [https://open.spotify.com/show/4HWsD90zK6fEyuEcfVxlwF](https://open.spotify.com/show/4HWsD90zK6fEyuEcfVxlwF)",
          "created_utc": 1750404352.0
        }
      ]
    },
    {
      "id": "myt79i9",
      "author": "Final-Swordfish-2863",
      "body": "Thank you for this. I've said most of what I posted here to him. In calm moments, he admits he is weird about food. I do think, though, that he is the first person \"brushing it off\" because he's male. I'm not sure how seriously he takes it. Sharing this post is a good idea, I will do that. Sending you good wishes for your own situation!",
      "created_utc": 1750427054.0,
      "score": 5,
      "context": [
        {
          "id": "myt2igc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750425465.0
        }
      ]
    },
    {
      "id": "myv0ycv",
      "author": "Final-Swordfish-2863",
      "body": "Thank you for weighing in. I hope that you're doing well these days.",
      "created_utc": 1750446173.0,
      "score": 2,
      "context": [
        {
          "id": "mytubeb",
          "author": "BestWesterChester",
          "body": "It's generally considered a disorder when it's affecting other parts of your life, and it is. I am a former triathlete and I can tell you that disordered eating is very common among endurance athletes.\n\nEdit: I should add that I'm also male. Eating disorders are often seen as a female problem so this adds to the challenge",
          "created_utc": 1750433882.0
        }
      ]
    },
    {
      "id": "myuinru",
      "author": "ThatpersonRobert",
      "body": "I agree.  Anyone who hasn't done family or couples counseling...it can be some pretty powerful stuff.",
      "created_utc": 1750440859.0,
      "score": 3,
      "context": [
        {
          "id": "myu9tn9",
          "author": "TheyCalledTheWind",
          "body": "Here to agree this is probably orthorexia, speaking from experience. If it is starting to impact the relationship and he is unwilling to start therapy for an ED, you might ask for couples counseling so you can share your feelings and experiences in a neutral space with someone who can tell him his behavior is unhealthy and who may be able to act as a bridge for him to individual treatment.",
          "created_utc": 1750438389.0
        }
      ]
    },
    {
      "id": "mz3fvj3",
      "author": "Final-Swordfish-2863",
      "body": "Thank you for this. I hope you are continuing to recover. He has agreed to look into therapy options. I think hearing from others who have been in his position helped. I will encourage him to post here but if there are other places online you've found support I will pass them on. (edit dumb typo)",
      "created_utc": 1750562604.0,
      "score": 1,
      "context": [
        {
          "id": "myz72hw",
          "author": "Accomplished-Mud-173",
          "body": "As a recovering orthorexic, this fixation on sports nutrition sounds all too familiar. I was very much like this for over ten years, but I was obsessed with weightlifting. It started off fairly healthy and I ate very well but then I slowly got more obsessed with little details and I got very irritated with any little changes and was really awful to my loved ones if anything deviatied from my 'plans'. Eventually, I got really ill and was forced to look at my unhealthy obsession if I wanted to live and recover. You are very right to be concerned, and I hope you can continue to support your husband and try to convince him to seek ED help before a health crisis happens.",
          "created_utc": 1750509472.0
        }
      ]
    },
    {
      "id": "mytyayj",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1750435024.0,
      "score": 2,
      "context": [
        {
          "id": "myt2igc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750425465.0
        },
        {
          "id": "myt79i9",
          "author": "Final-Swordfish-2863",
          "body": "Thank you for this. I've said most of what I posted here to him. In calm moments, he admits he is weird about food. I do think, though, that he is the first person \"brushing it off\" because he's male. I'm not sure how seriously he takes it. Sharing this post is a good idea, I will do that. Sending you good wishes for your own situation!",
          "created_utc": 1750427054.0
        }
      ]
    },
    {
      "id": "myvusws",
      "author": "BestWesterChester",
      "body": "Thank you. I hope your husband can find some peace with his food. I'm doing well now but I had to give up long endurance sports. But I'm also 54 so I'm happy",
      "created_utc": 1750455198.0,
      "score": 4,
      "context": [
        {
          "id": "mytubeb",
          "author": "BestWesterChester",
          "body": "It's generally considered a disorder when it's affecting other parts of your life, and it is. I am a former triathlete and I can tell you that disordered eating is very common among endurance athletes.\n\nEdit: I should add that I'm also male. Eating disorders are often seen as a female problem so this adds to the challenge",
          "created_utc": 1750433882.0
        },
        {
          "id": "myv0ycv",
          "author": "Final-Swordfish-2863",
          "body": "Thank you for weighing in. I hope that you're doing well these days.",
          "created_utc": 1750446173.0
        }
      ]
    },
    {
      "id": "mz3gqyi",
      "author": "Final-Swordfish-2863",
      "body": "Thank you both! He has agreed to look into therapy thank goodness, he's between jobs so it might take a couple weeks but I think even looking at the issue squarely has helped a bit already. Couples counseling may also help and it is on our list of options now.",
      "created_utc": 1750562976.0,
      "score": 1,
      "context": [
        {
          "id": "myu9tn9",
          "author": "TheyCalledTheWind",
          "body": "Here to agree this is probably orthorexia, speaking from experience. If it is starting to impact the relationship and he is unwilling to start therapy for an ED, you might ask for couples counseling so you can share your feelings and experiences in a neutral space with someone who can tell him his behavior is unhealthy and who may be able to act as a bridge for him to individual treatment.",
          "created_utc": 1750438389.0
        },
        {
          "id": "myuinru",
          "author": "ThatpersonRobert",
          "body": "I agree.  Anyone who hasn't done family or couples counseling...it can be some pretty powerful stuff.",
          "created_utc": 1750440859.0
        }
      ]
    },
    {
      "id": "myv0tez",
      "author": "Final-Swordfish-2863",
      "body": "Thank you again. I really appreciate it.",
      "created_utc": 1750446131.0,
      "score": 1,
      "context": [
        {
          "id": "myt2igc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750425465.0
        },
        {
          "id": "myt79i9",
          "author": "Final-Swordfish-2863",
          "body": "Thank you for this. I've said most of what I posted here to him. In calm moments, he admits he is weird about food. I do think, though, that he is the first person \"brushing it off\" because he's male. I'm not sure how seriously he takes it. Sharing this post is a good idea, I will do that. Sending you good wishes for your own situation!",
          "created_utc": 1750427054.0
        },
        {
          "id": "mytyayj",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1750435024.0
        }
      ]
    },
    {
      "id": "mz3iq4j",
      "author": "ThatpersonRobert",
      "body": "It's encouraging to hear that he's willing to be open-minded about this.  And a good sign for your relationship too !",
      "created_utc": 1750563837.0,
      "score": 2,
      "context": [
        {
          "id": "myu9tn9",
          "author": "TheyCalledTheWind",
          "body": "Here to agree this is probably orthorexia, speaking from experience. If it is starting to impact the relationship and he is unwilling to start therapy for an ED, you might ask for couples counseling so you can share your feelings and experiences in a neutral space with someone who can tell him his behavior is unhealthy and who may be able to act as a bridge for him to individual treatment.",
          "created_utc": 1750438389.0
        },
        {
          "id": "myuinru",
          "author": "ThatpersonRobert",
          "body": "I agree.  Anyone who hasn't done family or couples counseling...it can be some pretty powerful stuff.",
          "created_utc": 1750440859.0
        },
        {
          "id": "mz3gqyi",
          "author": "Final-Swordfish-2863",
          "body": "Thank you both! He has agreed to look into therapy thank goodness, he's between jobs so it might take a couple weeks but I think even looking at the issue squarely has helped a bit already. Couples counseling may also help and it is on our list of options now.",
          "created_utc": 1750562976.0
        }
      ]
    }
  ]
}