{
  "id": "1lqx1yy",
  "subreddit": "EatingDisorders",
  "author": "Ill-Possession146",
  "created_utc": 1751567349.0,
  "title": "Don’t try food addicts anonymous",
  "selftext": "I was so happy when I found out there was a local community I could go to for my ED. I don’t have insurance at the moment, and am having some major health issues, so it was my only option. I gave it a try. It was terrible. Not only do they encourage cutting out 3 separate entire ingredients/food groups, they also make you weigh your food and the portions are very challenging. They didn’t listen to me when I said that it would be much physically safer for me to work my way up. I ended up involuntary throwing up my food. I can’t believe a group like that is perpetuating ED behavior. I’ve gone to NA and AA and they both had such a better, medically sound program. I could possibly see the benefit if you’ve never suffered with restriction or purging, but even then, it’s a risk. I bet it’s different regionally though. Just wanted to share my experience. ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1lqx1yy/dont_try_food_addicts_anonymous/",
  "score": 50,
  "num_comments": 6,
  "comments": [
    {
      "id": "n16b2im",
      "author": "fightmydemonswithme",
      "body": "I went to OA (overeaters anonymous) and had a very different experience. Im located in MD though. They focused on nutrient based eating, intuitive eating, and building self esteem. It was a very cathartic reaction. Sadly, any of the anonymous programs have the same risk. It depends on the group to do things properly. I've been to AA meetings run extremely well, and others where I was offered oxy right after the meeting by a long time member. It sounds like the group you went to was replacing disordered eating with a different form of disordered eating. \n\n\nIm so sorry you had such a bad experience. You deserved better, and I hope the people there find peace they clearly dont have yet.",
      "created_utc": 1751568514.0,
      "score": 33,
      "context": []
    },
    {
      "id": "n17qtlu",
      "author": "SetAdditional883",
      "body": "I like the approach at 4eda.org",
      "created_utc": 1751584570.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n1q6axy",
      "author": "Embracedandbelong",
      "body": "I agree with you. Anyone who thinks FAA or OA is helpful should read all 12 steps. They blame you and tell you to make amends with people who have abused you. It’s so messed up. People who run OA and other groups like that don’t have ANY medical or ED training and are not qualified",
      "created_utc": 1751848119.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n1sbt05",
      "author": "DandelionBouquet12",
      "body": "I had a similar experience with OA and while I was excited to connect with people similar experiences and not feel so alone, my ED specialized therapist was worried about the restriction component. I told her I could ignore that bit and she cautioned that I may not feel I hit the milestones because of that piece. She was absolutely right.\n\nI’ve been in recovery for 8 years now and I found great community in Eating Disorders Anonymous (EDA). There’s no attachment to restriction or food related cutting. They focus on a healthy working of the steps, taking it one day at a time, being balanced people, and acknowledging that our recovery isn’t as simple as abstaining from substances because we have to eat to survive. I strongly recommend checking them out! I found community that I had been missing since residential treatment and it was nothing like OA. Actually, quite a few of my friends in the program had been in OA for years, switched to EDA, and found it to be significantly better.",
      "created_utc": 1751885444.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n16klni",
      "author": "Lisa10071965",
      "body": "It is impossible to be addicted to something you need to live. Usually people say they are addicted because they are restricting too much. I found more recovery in AA.",
      "created_utc": 1751571324.0,
      "score": -36,
      "context": []
    },
    {
      "id": "n18w4bs",
      "author": "DueConsequence8605",
      "body": "You can get addicted to anything that provides you dopamine",
      "created_utc": 1751600069.0,
      "score": 15,
      "context": [
        {
          "id": "n16klni",
          "author": "Lisa10071965",
          "body": "It is impossible to be addicted to something you need to live. Usually people say they are addicted because they are restricting too much. I found more recovery in AA.",
          "created_utc": 1751571324.0
        }
      ]
    }
  ]
}