{
  "id": "1lyeok6",
  "subreddit": "EatingDisorders",
  "author": "chococrepedreams",
  "created_utc": 1752364258.0,
  "title": "Hard Facts for Recovery",
  "selftext": "(in case you needed to get slapped with it today.)\n\n- No, it will *not* go away by itself. That’s like just waking up to find your garden suddenly void of all weeds and parasites. Nope. You have to get out there and *weed.* I don’t care if it’s tiny steps or huge bounds. In fact tiny steps are underrated. IDC if it’s pulling one root or dropping a chemical bomb on the bugs, you have to do *something.*\n\n- No, you probably won’t get praise and applause for every victory, and maybe that sucks. But also consider that this is a journey. The prize of love and respect comes at the end when you prove that, yes, you *can* do it.\n\n- No, your suffering is not cool and holy and deserved. You are impressing no one by making it harder on yourself to recover. You are making no one proud by your intentional suffering from something you really shouldn’t be suffering from. And/Or have been suffering from a long time. If anything you impress people more by doing recovery, because that takes mad resilience and strength.\n\n- Stop procrastinating. Tomorrow is already here and you are running out of time. The longer this goes on the worse your body gets, the harder it becomes to recover. Do it while it’s easier before it’s too hard to handle.\n\n- Shaming and self-hating yourself into recovering doesn’t work in the long run. You have to learn *some* self-care along the way. Call it what you want, self-care, self-love, etc, but it is *not* sappy and selfish to do the bare minimum. Literally who are you impressing by hating yourself? Who?? Be a little nicer, even just a *little* (I mean like use your favorite emojis. Wink at yourself in the mirror. Dance), and things get a little better. \n\n- Little steps, scared steps, quiet steps are still steps. Take them before they take you.\n\n- Change is scary yeah but it’ll happen anyway. Might as well make it a good change.\n\n\nAn add on for those that feel ashamed:\n\nYes. There will be shame. There will be regret, and there will be sadness and anger that you just can’t *be better.* It is OK to feel this. It is normal, even. Allow yourself to feel it. But do not let it saturate you. Let the shame have its stay, and then see it out. It may hurt. It may not feel right. But shame is an occupant that too often overstays its welcome.\n\nFeelings are weird and hard and they hurt sometimes. One of the most challenging parts of recovery is facing yourself and choosing to be better. So yes, you may feel ashamed right now, and I say again that is normal. Just be careful not to let it overwhelm you. Take the shame gently with your hands and mold it into determination to improve, into an all-the-more reason to recover so you never have to feel it again.\n\nIt’s ok if this is hard for you right now. It was never supposed to be easy. But when you do overcome that shame, that hurt—it will be all the more glorious. And I am already so happy for you.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1lyeok6/hard_facts_for_recovery/",
  "score": 46,
  "num_comments": 4,
  "comments": [
    {
      "id": "n2v64t0",
      "author": "None",
      "body": "\"No, la tua sofferenza non è figa.\" Ecco appunto. La romanticizzazione degli ED è un cancro della società. Non solo moderna, la donna pallida e smagrita malata di tubercolosi era influente nel mondo della moda. La malattia non è e non può essere uno status fashion.",
      "created_utc": 1752394315.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n2we4f8",
      "author": "SuperSeaStarSavior",
      "body": "Glad this works for you. Came to this sub in the middle of a recovery emergency and this doubled my shame spiral.",
      "created_utc": 1752415439.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n38q4oq",
      "author": "jane_annelise",
      "body": "This mindset works for people that are angry and are ready to recover. Also, this way of thinking doesnt work for anybody. Or it works but the way you phrased the sentences are too harsh and may create shame",
      "created_utc": 1752578442.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n38pw6a",
      "author": "jane_annelise",
      "body": "Real",
      "created_utc": 1752578339.0,
      "score": 1,
      "context": [
        {
          "id": "n2we4f8",
          "author": "SuperSeaStarSavior",
          "body": "Glad this works for you. Came to this sub in the middle of a recovery emergency and this doubled my shame spiral.",
          "created_utc": 1752415439.0
        }
      ]
    }
  ]
}