{
  "id": "1lyw9yo",
  "subreddit": "EatingDisorders",
  "author": "Striking-Year-4077",
  "created_utc": 1752422244.0,
  "title": "My mom wants me to be underweight, and it's messing with my head.",
  "selftext": "I'm 16, and I’m in a healthy weight range. I know that. But my mom keeps telling me my \"ideal\" weight is way lower—like, technically underweight. I didn’t believe her at first, but now it’s starting to get in my head, and I’m honestly questioning myself.\n\nAnddd it gets worse, sometimes my parents weigh me when I wake up, or before and after meals. It’s not every day, but when it happens, it makes me spiral really bad and then all my progress to heal gets thrown out the window. I don't get why they’re doing this or what they expect from me.\n\nI just feel stuck and confused. Am I overreacting, or is this actually messed up?\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1lyw9yo/my_mom_wants_me_to_be_underweight_and_its_messing/",
  "score": 55,
  "num_comments": 22,
  "comments": [
    {
      "id": "n2x12f4",
      "author": "-survivalist-",
      "body": "You are not overreacting. What you’re describing is extremely messed up, and it’s not okay. You know you’re in a healthy weight range—trust that voice. The fact that your mom is pushing you toward an underweight goal and weighing you around meals is controlling, harmful, and emotionally abusive.\n\nThat kind of behavior can seriously mess with your head, especially if you’re trying to heal from disordered eating. You deserve safety and respect, not constant monitoring and manipulation around food and your body.\n\nPlease know that your body is not the problem—their behavior is. You’re not alone in this, and you’re not crazy. You’re just trying to recover in a toxic environment. I’m so sorry you’re going through this, and I hope you’re able to connect with people who can support you in healing. You’re worthy of love and care exactly as you are.",
      "created_utc": 1752422489.0,
      "score": 44,
      "context": []
    },
    {
      "id": "n2x4erm",
      "author": "siris7111",
      "body": "Talking to a doctor, guidance counselor, close family member (especially if it’s one of your moms relatives) and having an adult talk to your parents about their unhealthy behavior might help them understand what they’re doing is very harmful. \n\nI’m sorry you’re being put through this. It would be absolutely maddening having to deal with this on a semi regular basis. The world is big and beautiful and there is so much to savor and enjoy in life, your weight is the last thing you need to be concerned about. Especially given that you’re a healthy individual with no reason to be concerned with your weight. \n\nYour parent’s behavior is coming from their own unhappiness with themselves. Probably your mother but your father isn’t doing anything to step in and correct your mother’s behavior. It’s not okay. I know you’re young, and setting boundaries with your parents can be difficult especially if they don’t respect them, however, if you’d like you can establish a boundary with them by saying something like \n\n“I won’t participate in conversations where I'm being criticized about my body.”\n\n“It hurts when you talk about my body that way. I’m choosing not to talk about my weight anymore unless it’s with a doctor or a professional.”\n\nOr \n\n\"I want to talk to another adult about this if it continues.\"\n\"If this keeps happening, I want to talk to my school counselor or another trusted adult about how I’m feeling.\"",
      "created_utc": 1752423501.0,
      "score": 13,
      "context": []
    },
    {
      "id": "n2xcjwb",
      "author": "AuthorityFiguring",
      "body": "I'm so sorry. This is terribly wrong. Your parents should not be weighing you, nor should they be trying to control your weight unless you were drastically underweight or grossly overweight - in the opinion of a medical expert. As you are not an unhealthy weight, their obsession and efforts to control your weight is abusive. You definitely need outside help from a social worker and perhaps to find out if it is possible for you to become emancipated from them.",
      "created_utc": 1752425964.0,
      "score": 7,
      "context": []
    },
    {
      "id": "n2xs8sc",
      "author": "TheGreatFluffMaster",
      "body": "This is seriously messed up. It's a frightening idea you're home schooled, because it makes it harder to talk to other people about this and hear from them it's not normal. This level of control is abusive. You might want to look online for a counselor. Are there any adults in your life that you can trust? Never doubt that little voice in your head that tells you this is wrong, never doubt your gut feeling and instinct.",
      "created_utc": 1752430517.0,
      "score": 7,
      "context": []
    },
    {
      "id": "n30h5f2",
      "author": "Whole-Yogurt-2757",
      "body": "This sort of reminds me of Jennette McCurdy’s story on her eating disorder…Her mother pretty much taught her anorexia. I’m so sorry your parents are doing this to you. It sounds like they are projecting their fears of being “overweight” on to you. I would talk to an adult you trust at school about this. This is a form of abuse",
      "created_utc": 1752462399.0,
      "score": 6,
      "context": []
    },
    {
      "id": "n2y0vdl",
      "author": "korinna81",
      "body": "Are you living alone with your mother and you are homeschooled??? Call a helpline! This is not the future you want!\nThink about what you would tell your best friend to do and do that! Stay strong ❤️",
      "created_utc": 1752433095.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n2xr3y5",
      "author": "angrylilmanfrog",
      "body": "Would you be able to arrange a doctor's appointment? Are they hard to convince to take you to the doctor if you can't leave the home without their help? I could help you think of some cover stories (in this situation lying to them is perfectly fine. You need to talk to a professional that can help you)\nIf you can make the appointment, ask for a doctor you're more comfortable with seeing if you have one you remember, or asking to see a doctor of a specific gender if that helps.\nIn this appointment you need to highlight that you're homeschooled, isolated, and how much control your family has over you. Along with the weight monitoring and trying to make you underweight it should paint a bigger picture of abusive control.\nI'm so so sorry you're going through this, and getting your doctor involved and making an official paper trail of these events can help your side.\n\nYour doctor can speak to your parents and tell them to stop this. If they don't, you can go back and tell them how it's still going and they should take more actions to help you. If they brush off your issues, be stubborn and ask to speak to another doctor. Threaten to make a complaint for not taking child safety seriously. This can lead to malnutrition and health issues which I'm sure you know, your parents have no good reason to be doing this to you when there is clearly no problems with giving you enough food.\n\nAre there any local youth clubs you could join? This could be a safe space for you to find friends and also have access to a counsellor to report these safety concerns. It would fly under the radar more to look for help and your parents won't be suspicious if you're trying to keep reporting a secret. But something will have to be done, someone will have to talk to your parents. The important thing is that you have connections to support especially after getting intervention in case your parents are unhappy with your choice to report (which they can deal with because who the fuck thinks it's ok to weight check and starve their kid)",
      "created_utc": 1752430180.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n30fp9m",
      "author": "DisagreeableCompote",
      "body": ">“My parents weigh me when I wake up” \n\nwhat? do they physically put you on a scale? I don’t understand. \n\nYou don’t have to listen to everything your parents say, you know.",
      "created_utc": 1752461828.0,
      "score": 5,
      "context": []
    },
    {
      "id": "n31rsj7",
      "author": "universe93",
      "body": "You need to see a doctor and tell them what your mom is doing. It’s not right.",
      "created_utc": 1752486561.0,
      "score": 4,
      "context": []
    },
    {
      "id": "n2x1mp4",
      "author": "RunningPirate",
      "body": "Oh fuck.  Is there a guidance counselor at school you can talk to?",
      "created_utc": 1752422661.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n31ao4j",
      "author": "East-Tadpole-1918",
      "body": "Does your mum have a history of eating disorders?",
      "created_utc": 1752476562.0,
      "score": 3,
      "context": []
    },
    {
      "id": "n2z1byb",
      "author": "berry_jewels",
      "body": "That's fucked up. I'm so so sorry. I'm currently struggling with anorexia, and though I'm a healthy weight now, I used to be severely underweight. At that time, I used to have quite bad dizzy spells and I fainted three times. However, since I've been healthy, I haven't felt as dizzy. If your mom wants you to be really thin, you don't deserve it. You deserve more food than you're probably having. If it continues, you will be really poorly. Again, I'm so sorry. I'm sorry you have parents like that. Make the situation more known if you can. 🤍",
      "created_utc": 1752444099.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n31o822",
      "author": "Zealousideal_Novel68",
      "body": "Honey youre not the problem here. What she is doing id NOT okay. This is not healthy. She may have good intentions, but this could damage you in the king run if you dont out your foot down. I think you should talk to your primary doctor or a trusted adult at school. A healthy weight is not the same for everybody. Especially if youre happy with how you look as well.",
      "created_utc": 1752484495.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n32qm5b",
      "author": "Ok-Form902",
      "body": "This is abuse. It sounds like your parents, especially mom is suffering from some form of mental illness.",
      "created_utc": 1752501013.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n457o14",
      "author": "ZealousidealEssay385",
      "body": "You must go to state institutions that carry out mediation and establish measures against your mother. Mine and your comments have been killing me for almost 20 years. Please get out of there and save yourself!! 😭",
      "created_utc": 1753007564.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n2x25or",
      "author": "Striking-Year-4077",
      "body": "Thank you so much for this. It honestly means more than you know. I’ve been feeling like I’m the problem, and hearing someone say this out loud really helps. I’m still figuring things out, but your message made me feel seen and less alone. Truly, thank you.",
      "created_utc": 1752422820.0,
      "score": 9,
      "context": [
        {
          "id": "n2x12f4",
          "author": "-survivalist-",
          "body": "You are not overreacting. What you’re describing is extremely messed up, and it’s not okay. You know you’re in a healthy weight range—trust that voice. The fact that your mom is pushing you toward an underweight goal and weighing you around meals is controlling, harmful, and emotionally abusive.\n\nThat kind of behavior can seriously mess with your head, especially if you’re trying to heal from disordered eating. You deserve safety and respect, not constant monitoring and manipulation around food and your body.\n\nPlease know that your body is not the problem—their behavior is. You’re not alone in this, and you’re not crazy. You’re just trying to recover in a toxic environment. I’m so sorry you’re going through this, and I hope you’re able to connect with people who can support you in healing. You’re worthy of love and care exactly as you are.",
          "created_utc": 1752422489.0
        }
      ]
    },
    {
      "id": "n2ywtf6",
      "author": "Lisa10071965",
      "body": "It is abusive",
      "created_utc": 1752442650.0,
      "score": 5,
      "context": [
        {
          "id": "n2x12f4",
          "author": "-survivalist-",
          "body": "You are not overreacting. What you’re describing is extremely messed up, and it’s not okay. You know you’re in a healthy weight range—trust that voice. The fact that your mom is pushing you toward an underweight goal and weighing you around meals is controlling, harmful, and emotionally abusive.\n\nThat kind of behavior can seriously mess with your head, especially if you’re trying to heal from disordered eating. You deserve safety and respect, not constant monitoring and manipulation around food and your body.\n\nPlease know that your body is not the problem—their behavior is. You’re not alone in this, and you’re not crazy. You’re just trying to recover in a toxic environment. I’m so sorry you’re going through this, and I hope you’re able to connect with people who can support you in healing. You’re worthy of love and care exactly as you are.",
          "created_utc": 1752422489.0
        }
      ]
    },
    {
      "id": "n2x6o7y",
      "author": "Striking-Year-4077",
      "body": "Omgg, thank you for taking the time to write all this. I really appreciate how specific and thoughtful your advice is. It’s comforting to know that there's people out there that sees how messed up this is since I've been thinking I'm just overreacting.\n\nYou’re right—setting boundaries feels nearly impossible right now, especially since my parents don’t really do boundaries. But the lines you gave me actually help, I’ve thought about saying it directly but it's hard to find the courage to do so.\n\nI wish I had access to a counselor or someone neutral to step in. But being homeschooled kind of makes it harder to find some kind of outlet or adult I can trust. I am hoping for one though.\n\nSeriously, thank you again for this. It means a lot that someone cares enough to help me think through it.",
      "created_utc": 1752424192.0,
      "score": 10,
      "context": [
        {
          "id": "n2x4erm",
          "author": "siris7111",
          "body": "Talking to a doctor, guidance counselor, close family member (especially if it’s one of your moms relatives) and having an adult talk to your parents about their unhealthy behavior might help them understand what they’re doing is very harmful. \n\nI’m sorry you’re being put through this. It would be absolutely maddening having to deal with this on a semi regular basis. The world is big and beautiful and there is so much to savor and enjoy in life, your weight is the last thing you need to be concerned about. Especially given that you’re a healthy individual with no reason to be concerned with your weight. \n\nYour parent’s behavior is coming from their own unhappiness with themselves. Probably your mother but your father isn’t doing anything to step in and correct your mother’s behavior. It’s not okay. I know you’re young, and setting boundaries with your parents can be difficult especially if they don’t respect them, however, if you’d like you can establish a boundary with them by saying something like \n\n“I won’t participate in conversations where I'm being criticized about my body.”\n\n“It hurts when you talk about my body that way. I’m choosing not to talk about my weight anymore unless it’s with a doctor or a professional.”\n\nOr \n\n\"I want to talk to another adult about this if it continues.\"\n\"If this keeps happening, I want to talk to my school counselor or another trusted adult about how I’m feeling.\"",
          "created_utc": 1752423501.0
        }
      ]
    },
    {
      "id": "n2x32hs",
      "author": "Striking-Year-4077",
      "body": "Yeah… unfortunately I’m homeschooled 😭 We moved to a new country, and the currency exchange made regular school wayy too expensive. So now I’m stuck doing homeschool based on my home country. It honestly sucks because it means I don’t really have a support system like a school counselor or teacher to talk to.",
      "created_utc": 1752423093.0,
      "score": 5,
      "context": [
        {
          "id": "n2x1mp4",
          "author": "RunningPirate",
          "body": "Oh fuck.  Is there a guidance counselor at school you can talk to?",
          "created_utc": 1752422661.0
        }
      ]
    },
    {
      "id": "n31e2j9",
      "author": "Striking-Year-4077",
      "body": "She's not diagnosed but it's not a reach.. she would like starve herself and do other stuff and tell the whole family about it, she knows it's wrong but pretends as if she's clueless. I feel guilty saying it's infuriating but I have an 8 y/o brother who's getting influenced and now he weighs himself after every meal as well. It's soo stupid and my dad just stands around like an idiot because he can't stand against my mom and with his kids like a coward aeggggfh 😭😭",
      "created_utc": 1752478514.0,
      "score": 5,
      "context": [
        {
          "id": "n31ao4j",
          "author": "East-Tadpole-1918",
          "body": "Does your mum have a history of eating disorders?",
          "created_utc": 1752476562.0
        }
      ]
    },
    {
      "id": "n2x9iua",
      "author": "nervous_veggie",
      "body": "A doctor? Surely you have a doctor (like a GP), and if you’re 16 you definitely can speak to them alone x",
      "created_utc": 1752425066.0,
      "score": 6,
      "context": [
        {
          "id": "n2x4erm",
          "author": "siris7111",
          "body": "Talking to a doctor, guidance counselor, close family member (especially if it’s one of your moms relatives) and having an adult talk to your parents about their unhealthy behavior might help them understand what they’re doing is very harmful. \n\nI’m sorry you’re being put through this. It would be absolutely maddening having to deal with this on a semi regular basis. The world is big and beautiful and there is so much to savor and enjoy in life, your weight is the last thing you need to be concerned about. Especially given that you’re a healthy individual with no reason to be concerned with your weight. \n\nYour parent’s behavior is coming from their own unhappiness with themselves. Probably your mother but your father isn’t doing anything to step in and correct your mother’s behavior. It’s not okay. I know you’re young, and setting boundaries with your parents can be difficult especially if they don’t respect them, however, if you’d like you can establish a boundary with them by saying something like \n\n“I won’t participate in conversations where I'm being criticized about my body.”\n\n“It hurts when you talk about my body that way. I’m choosing not to talk about my weight anymore unless it’s with a doctor or a professional.”\n\nOr \n\n\"I want to talk to another adult about this if it continues.\"\n\"If this keeps happening, I want to talk to my school counselor or another trusted adult about how I’m feeling.\"",
          "created_utc": 1752423501.0
        },
        {
          "id": "n2x6o7y",
          "author": "Striking-Year-4077",
          "body": "Omgg, thank you for taking the time to write all this. I really appreciate how specific and thoughtful your advice is. It’s comforting to know that there's people out there that sees how messed up this is since I've been thinking I'm just overreacting.\n\nYou’re right—setting boundaries feels nearly impossible right now, especially since my parents don’t really do boundaries. But the lines you gave me actually help, I’ve thought about saying it directly but it's hard to find the courage to do so.\n\nI wish I had access to a counselor or someone neutral to step in. But being homeschooled kind of makes it harder to find some kind of outlet or adult I can trust. I am hoping for one though.\n\nSeriously, thank you again for this. It means a lot that someone cares enough to help me think through it.",
          "created_utc": 1752424192.0
        }
      ]
    },
    {
      "id": "n34amik",
      "author": "East-Tadpole-1918",
      "body": "I’m really sorry. I grew up with an ‘undiagnosed but there’s definitely something wrong’ mother and she’s spent my whole life projecting her insecurities onto me. Is there anyone else you can speak to like a family friend?",
      "created_utc": 1752516890.0,
      "score": 2,
      "context": [
        {
          "id": "n31ao4j",
          "author": "East-Tadpole-1918",
          "body": "Does your mum have a history of eating disorders?",
          "created_utc": 1752476562.0
        },
        {
          "id": "n31e2j9",
          "author": "Striking-Year-4077",
          "body": "She's not diagnosed but it's not a reach.. she would like starve herself and do other stuff and tell the whole family about it, she knows it's wrong but pretends as if she's clueless. I feel guilty saying it's infuriating but I have an 8 y/o brother who's getting influenced and now he weighs himself after every meal as well. It's soo stupid and my dad just stands around like an idiot because he can't stand against my mom and with his kids like a coward aeggggfh 😭😭",
          "created_utc": 1752478514.0
        }
      ]
    }
  ]
}