{
  "id": "1m1qupb",
  "subreddit": "EatingDisorders",
  "author": "HighKey-Anonymous",
  "created_utc": 1752705524.0,
  "title": "Anyone else thinks they've fully recovered, then feel happy when you find out you lost weight?",
  "selftext": "Because of underlying health conditions I can no longer exercise and can no longer stay more than 2-3h without eating, with that, I gained a few kg... After lots of effort (because I thought I was over it, but relapsed after gaining weight again) I just accepted I probably couldn't lose those new kilos and that I'd have to set my current weight as my new weight goal to maintain it healthy. I really thought I finally healed again!\n\nI no longer starve or binge again, don't check calories or feel guilty eating treats (though, I occasionally get some intrusive thoughts when repeating a meal, I usually just brush it off and eat)\n\nLately, though, I suddenly started losing weight? Not sure how, not sure why. I don't exercise, diet, I now eat as much as I want. Anyway. \n\nI lost many kgs already and today my family was weighting themselves on my old great grandmas apparently-really-accurate balance.\n\nThey called me to weight myself, I haven't done it in a month or two, only to find out im back to my \"original\" weight!! It's underweight again, it's bad, but dang it, the guilty pleasure on my chest... I barely held back a smile just because I didn't want to make my family worry.\n\nI REALLY thought I no longer cared about it, really thought I was okay with maintaining a minimal healthy weight now.\n\nFeels so guilty but also feel so.. Good? I never healed deep down? Or did I just relapse?\nHow do I even make these weird \"relapse\" stop!? It's not the first time I've felt happy finding out I lost weight, even after \"recovering\". So is it just going to repeat itself all the time? Do you ever FULLY heal from it actually? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/1m1qupb/anyone_else_thinks_theyve_fully_recovered_then/",
  "score": 38,
  "num_comments": 7,
  "comments": [
    {
      "id": "n3leakp",
      "author": "TheGreatFluffMaster",
      "body": "If you unintentionally lost a lot of weight I would recommend seeing a doctor because that could indicate some health issues.\n\nI do believe the old reward system in your brain is reactivated which is why weighing yourself or following any diet at all is tricky. However, feeling euphoria doesn't mean you're doomed to relapse again. It's a sign your brain \"remembers\" and it's up to you to act accordingly or resist the urge. In my opinion, recovery doesn't mean you're not vulnerable to the urges, recovery means choosing not to act on them.",
      "created_utc": 1752739478.0,
      "score": 9,
      "context": []
    },
    {
      "id": "n3khhxu",
      "author": "Satelliteminded",
      "body": "This happens to me too. I wish I had advice for you. My beloved dog died recently, and I couldn’t eat right for a week. Some messed up part of me was still pleased when I weighed myself and saw I had lost weight. It’s so messed up.",
      "created_utc": 1752723319.0,
      "score": 2,
      "context": []
    },
    {
      "id": "n3kcg2z",
      "author": "Desperate_Air370",
      "body": "Commenting so this gets a ‘boost’ and helps maybe someone who can give advice to see this. Sending hugs to you✨",
      "created_utc": 1752721265.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3zdoso",
      "author": "None",
      "body": "It's great if you can switch off and focus on other things/get on w/ your life w/ out too much noise/interference from the ED and some therapy has kicked in. Its normal for weight to fluctuate. I have reprieve in some areas but not others. I don't like guilting myself if Ive lost weight- it gives me a complex. It's just trauma from previous relapses. I felt so bad about myself bc it coincided w/ family deaths. I was scared to be too busy/take on too many responsibilities. Then if/when I gain weight I get angry w/ myself too. I was sick of being hysterical about food/biting off peoples heads if there is any mentioning of diet culture etc (but you don't want to revel in it/use it against yourself). You just want to be at peace w/ your body/mind and life as much as you can and have support systems in place- whatever that looks like for you",
      "created_utc": 1752926597.0,
      "score": 1,
      "context": []
    },
    {
      "id": "n3lnsl0",
      "author": "HighKey-Anonymous",
      "body": "wow that's deep, thank you for your words! I think you're right, recovering probably doesn't mean it goes fully away, you just stop listening to it.\n\n\nAlso, yess I know! I already have an appointment in a month...\nBut honestly? I think I might know why.\n\n\nI've been on multiple supplements lately and they're seriously messing up my appetite!! \nI'm always \"craving\" something (not specific, I just crave something. I wish I knew what) yet nothing really satisfies that craving. \n\n\nI've tried stopping the supplements for a few days a week/month (also 'cause my iron supplements give me horrible constipation ahahah which is painfull and messing up with my \"recovered\" ED) and when I do, I just have no appetite *at all* and barely eat. Happens everytime I stop taking them.\n\n\nSo I think it might be affecting the way I eat or what I eat... And somehow must've caused weight loss as a result!  Not sure, I'll discuss with my doctor about it next month! \n\n\nEdit: it's probably good to mention I have dysautonomia! Still in the process of finding whats causing it... But it seems to be generalised, all over my body. \nWhich... Can also cause weight loss! I've had it for years now, but lately I can feel a flare up approaching... Maybe that could be linked to the sudden weight loss too.",
      "created_utc": 1752744944.0,
      "score": 3,
      "context": [
        {
          "id": "n3leakp",
          "author": "TheGreatFluffMaster",
          "body": "If you unintentionally lost a lot of weight I would recommend seeing a doctor because that could indicate some health issues.\n\nI do believe the old reward system in your brain is reactivated which is why weighing yourself or following any diet at all is tricky. However, feeling euphoria doesn't mean you're doomed to relapse again. It's a sign your brain \"remembers\" and it's up to you to act accordingly or resist the urge. In my opinion, recovery doesn't mean you're not vulnerable to the urges, recovery means choosing not to act on them.",
          "created_utc": 1752739478.0
        }
      ]
    },
    {
      "id": "n3lnym2",
      "author": "HighKey-Anonymous",
      "body": "Aw I feel you :( I'm sorry for your dog though, pet deaths are never easy... ",
      "created_utc": 1752745037.0,
      "score": 2,
      "context": [
        {
          "id": "n3khhxu",
          "author": "Satelliteminded",
          "body": "This happens to me too. I wish I had advice for you. My beloved dog died recently, and I couldn’t eat right for a week. Some messed up part of me was still pleased when I weighed myself and saw I had lost weight. It’s so messed up.",
          "created_utc": 1752723319.0
        }
      ]
    },
    {
      "id": "n3lmfu7",
      "author": "HighKey-Anonymous",
      "body": "Aw thank you ✨ hugging back ",
      "created_utc": 1752744170.0,
      "score": 2,
      "context": [
        {
          "id": "n3kcg2z",
          "author": "Desperate_Air370",
          "body": "Commenting so this gets a ‘boost’ and helps maybe someone who can give advice to see this. Sending hugs to you✨",
          "created_utc": 1752721265.0
        }
      ]
    }
  ]
}