{
  "id": "2dc4rb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1407853294.0,
  "title": "Recovery Sharing: Ziploc Bags, and other things that work for me (BN)",
  "selftext": "\n\nI have struggled with BN for 16 years, having had recovery periods, and relapses. While I realize everyone's recovery is unique, I have found the following things to be extremely helpful. Relapses are AVOIDABLE\n\n1) Portioning out food into ziploc bags. EVERYTHING. Carbs, fruits and veggies, nuts. And ALWAYS carrying \"safe\" foods with me, in these portioned bags.\n\n2) Eating as if food were medication at certain times of day. YOU MUST eat x in order to fuel your body. Eating more than this (at my trigger times) is akin to an overdose. It WILL cause me bodily harm (trigger a behavior)\n\n3) Sharing my finances/bank login with someone supportive (and obviously someone that can be trusted!).\n\n4) Filling up my gas tank at the beginning of the week and then NOT carrying any debit/credit cards with me.\n\n5) If I am going out to eat, reviewing the menu in advance and choosing my meal beforehand.\n\n6) Avoid being alone during traditional trigger times. Make a daily date during that time, with a person or an activity.\n\n7) Sharing a list of currently \"unsafe\" foods with someone supportive. Sharing the information with someone is psychologically helpful to me, even if there is not necessarily an action on their part.\n\n8) Being honest with myself about my \"unsafe\" foods. There are foods that I would LIKE to be safe foods, but are not quite there for me. \nWith these foods, I may need help with moderation, and I should not consume them without a safety net (having a person with me who is aware that this is a potential trigger).\n\n9) Documenting behavior on a calendar that is public to my support. Even if it not verbally discussed on a daily basis, the idea that they are aware of my progress is encouraging. Also, even when I am doing poorly, I don't feel so isolated.\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/2dc4rb/recovery_sharing_ziploc_bags_and_other_things/",
  "score": 45,
  "num_comments": 4,
  "comments": [
    {
      "id": "cjo74ic",
      "author": "None",
      "body": "Treating food as medication seems like helpful advice; It IS essentially medication whether one has a disorder or not, after all......\n\nHow did you figure out what times of day to eat? ",
      "created_utc": 1407862944.0,
      "score": 9,
      "context": []
    },
    {
      "id": "cjpwe29",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1408008866.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ckg2mgq",
      "author": "None",
      "body": "Wow these are great tips!!! I have used almost all of them myself and I can say they really do help. ",
      "created_utc": 1410500922.0,
      "score": 2,
      "context": []
    },
    {
      "id": "cjoahrf",
      "author": "sacca7",
      "body": "Since op may want to stay anonymous, a place to start is to eat within 1 hour of waking up, then schedule a snack every 2-3 hours, and a meal about every 4-5 hours apart until you fit in 3 meals a day and 2-3 snacks. \n\nJust consider your regular waking and hours and plan at least the day before how your eating schedule will work.",
      "created_utc": 1407868857.0,
      "score": 5,
      "context": [
        {
          "id": "cjo74ic",
          "author": "None",
          "body": "Treating food as medication seems like helpful advice; It IS essentially medication whether one has a disorder or not, after all......\n\nHow did you figure out what times of day to eat? ",
          "created_utc": 1407862944.0
        }
      ]
    },
    {
      "id": "cjqxnig",
      "author": "melonkelly",
      "body": "Safe foods are really a personal thing. For me, it's anything that I can eat without being triggered, simply by the food itself. \n\nThe following 2 factors make foods automatically UNSAFE for me:\n\n1) feel the need to purge from eating ANY quantity of the food\n\n2) not able to stop myself from going into a binge with this food\n\nVery generally, if a food does not hit either of these factors, then I consider it to be \"safe\" \n\nIt's all about your personal relationship with that food. My safe list changes occasionally, and it's not unusual for me, for something I know is actually a nutritionally sound food to be on my unsafe list every once in a while. \n\nIdeally, eventually, all foods can be moved to the safe list. You just have to be honest about it when you know your mindset has changed\n\nIf you have no \"safe\" foods right now, you need to rely on other people to regulate you, ideally a professional team. \n\nEdit: Additionally, if your list of \"safe\" foods is not providing you with sufficient nutritional value, (or if you're unsure) you need to reach out for help.  (You need to have a healthy variety covering a nutritionally sound mix of carbs, fat, fiber, protein, etc.)\n",
      "created_utc": 1408105888.0,
      "score": 5,
      "context": [
        {
          "id": "cjpwe29",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1408008866.0
        }
      ]
    }
  ]
}