{
  "id": "2f0p7y",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1409420091.0,
  "title": "Anorexia to Binging? It's not about will power, it's about Hunger Hormones.",
  "selftext": "If you are having problems with cycles of undereating and overeating, or having problems with overeating, or having problems with undereating, this article may help you start to resolve the problem.\n\n Eating disorders are psychological and somewhat physiological in origin. Let's just consider the physiology of undereating (restricting) and overeating (binging).\n\n * Hunger is not an issue of will power, it is regulated by over a dozen hunger hormones. Because there are so many of these hunger hormones, modern science has yet to come up with a simple solution, or a pill, for regulating hunger. We can, however, keep the hunger hormones in balance, as mentioned at the end of this post.\n\n * Regularly under-eating triggers **hunger hormones** that can stay elevated for **weeks or months** after under-eating, even after returning to a regular diet. [**JAMA article**](http://www.nejm.org/doi/full/10.1056/NEJMoa1105816). This is why someone who under-eats has a relatively easy time of it for the first few days, weeks, and/or months. Over time, however, the hunger hormones can become impossible to ignore. It's not will power that's involved, it's hunger hormones. That's when restricting flips over to binging.\n\n * Regularly overeating triggers hunger hormones because the body starts to believe that a high calorie diet is necessary for survival. In particular, it seems to develop a resistance to leptin, the “I'm satisfied” hormone, [note here](http://en.wikipedia.org/wiki/Leptin#Obesity). Leptin resistance can lead a person to feel hungry.\n\n * High glycemic foods when eaten alone can cause blood sugar levels to spike, then, when the blood sugar plummets, hunger ensues. Blood sugar levels are regulated by hormones including insulin and glucagon. Regulating high glycemic foods keeps these hunger hormones in check. [Mayo Clinic article](http://www.mayoclinic.org/healthy-living/nutrition-and-healthy-eating/in-depth/glycemic-index-diet/art-20048478). Some say [sugar addiction](http://www.runnersworld.com/weight-loss/kick-your-sugar-addiction-in-9-steps) is real, [another article here](http://www.theguardian.com/society/2013/mar/20/sugar-deadly-obesity-epidemic).\n\n * Stress and lack of sleep have a significant impact on our hunger hormones. [Stress hormone](http://www.huffingtonpost.co.uk/rebecca-fredericks/tips-on-coping-with-stress_b_5698913.html), and [Sleep hormones](http://guardianlv.com/2014/07/non-rem-sleep-why-even-dreamless-sleep-is-essential/).\n\n * Hunger does not arise with our thoughts. Hunger is driven by hormones, in other words, our hormones regulate our hunger. It is our hormones that send signals of hunger to the brain, and then the *thoughts* of hunger are recognized. This is why there are various kinds of hunger. An “*empty stomach*” hunger, a “*stress*” hunger, a “*weak and dizzy*” hunger, an “*I feel irritable*” hunger, an “*I can't think clearly*” hunger, an “*I'm tired*” hunger, etc.\n\n * Hunger hormones take time to become imbalanced, and take even longer (weeks and months) to be restored to balance. The body is wired to survive and messing with our diet is taken as a serious threat by the body's hormonal system to the survival of the body.\n\n * There is a relatively easy way to keep hunger hormones in check: eat three balanced meals a day, two to three snacks a day, get plenty of sleep, moderate exercise (perhaps 30 minutes of walking 3-4 days a week). This might mean eating by the clock if need be, and lying down by the clock (even if not sleeping, just resting), and moderate exercise on a schedule.\n\n * Eating disorders often arise from psychological issues and many people say they got help for their ED with therapy. Therapists are there to help us learn to deal with difficult emotions including depression, stress, anxiety, grief, etc.  Help your body as much as you can by eating regularly and healthfully, and help your mind, too. Seek professional help if you struggle with an Eating Disorder. \n\n---\n\nSome notes on some (there are many more) of the hunger hormones ghrelin, leptin, insulin,  cortisol, and thyroid hormones.\n\n**Ghrelin**\n\nGhrelin is a hormone released mainly by your stomach and pancreas.  Ghrelin sends out hunger signals when your stomach is empty, and lowers that hunger signal when your stomach is full. When you miss meals, or purge, ghrelin levels increase and make you want to eat more. This is why eating small and frequent meals is a very effective part of a healthy eating plan—food in the  belly helps keep your ghrelin levels steady, and therefore keeps you from getting too hungry.\n\n**Leptin**\n\nLeptin is responsible for reducing the appetite and increasing the metabolic rate. It is a hormone which is produced by the fat cells, circulated in the bloodstream and then sent to the brain. This process tells the brain that the body’s energy thermostat is set right, it says \"I'm satisfied.\" When people undereat, or purge, over the course of hours and days, their leptin levels start decreasing, and when leptin decreases, appetite increases. Also, when people overeat regularly, it seems to decrease lepin's message of \"I'm satisfied.\" By eating regularly (such as 3 meals, 2-3 snacks) and with appropriate portions (not overeating nor undereating) this hormone returns to balance. It takes time.\n\n**Insulin**\n\nInsulin is a hormone which is produced by the pancreas. Insulin is produced when we eat,  and it allows the sugar in our bloodstream to enter into and nourish our cells. It is like a key for energy to enter our muscles, organs, nerves, the brain, etc. However, if we eat high glycemic foods, insulin levels get very high very quickly to deal with all the excess blood sugar. One way it deals with the excess blood sugar is to store the excess sugar as fat. After this sugar high, the insulin levels plummet, thereby sending the message of hunger throughout the body and brain!\n\nThe way to prevent this from happening is to not eat high glycemic foods by themselves, but rather, eat them along with lower glycemic foods in a meal. Articles on high glycemic foods: [High Glycemic foods Wikipedia](http://en.wikipedia.org/wiki/Glycemic_index) and [another article](http://www.huffingtonpost.com/2012/06/27/low-glycemic-foods-diet_n_1630893.html).\n\n**Cortisol**\n\nCortisol is “the stress hormone” and is produced by the adrenal glands. Some of its main functions include increasing blood sugar levels, as well as to aid in fat, protein and carbohydrate metabolism. Cortisol is released due to normal levels of stress, however, excess stress produces excess cortisol, and this results in some physiological changes including increased desire for sweets as well as weakening of the immune system. Sleep helps restore cortisol levels to appropriate lower levels. If you have a lot of stress in your life, try to get lots of rest and sleep, and learn stress management techniques.\n\n**Thyroid Hormones**\n\nIf your thyroid gland is not functioning one possible problem is that you will have lower levels of the thyroid hormones T4/T3. These hormones regulate your metabolic rate and a lack of them means the metabolic rate slows down. This is turn means fewer calories are required and lethargy, weight gain, and undernourishment can result. Thyroid hormones interact with ghrelin and other chemicals that tell us when we are full. So if your thyroid hormones are inadequate, your ghrelin levels will be out of balance and you will want to eat more. In addition, thyroid hormones are important for leptin levels, because when T4/T3 is present in insufficient levels the effectiveness of leptin is reduced, again, increasing your appetite. Your medical professional can run tests to see if your thyroid hormones are functioning properly.\n\nedit: word correction, added some info",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/2f0p7y/anorexia_to_binging_its_not_about_will_power_its/",
  "score": 94,
  "num_comments": 24,
  "comments": [
    {
      "id": "ck5bqib",
      "author": "real-dreamer",
      "body": ">There is a relatively easy way to keep hunger hormones in check: eat three balanced meals a day, two to three snacks a day, get plenty of sleep, moderate exercise (perhaps 30 minutes of walking 3-4 days a week). This might mean eating by the clock if need be, and lying down by the clock (even if not sleeping, just resting), and moderate exercise on a schedule.\n\nI didn't want to read that. I really was hoping for something else. I fast for several days a week. I feel hostile to your information. I don't have a logical reason to be. I just do. ",
      "created_utc": 1409478874.0,
      "score": 38,
      "context": []
    },
    {
      "id": "ckgz2x1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1410586996.0,
      "score": 19,
      "context": []
    },
    {
      "id": "cl2dl19",
      "author": "inmy30s",
      "body": "I've noticed that we who have EDs tend to be very defensive, often when nobody is attacking us. I think it's because we feel angry about our condition, and if the advice doesn't address what we go through exactly how we see it, we feel misunderstood. But just because you disagree with advice, it doesn't mean that the person giving the advice had bad intentions. I try to thank anyone who attempts to help any part of my ED. Don't take advice personally, take what you can from it and make good use of it. ;)",
      "created_utc": 1412641518.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ck4zinb",
      "author": "firstsip",
      "body": "The thyroid hormones and cortisol both do much more than control appetite (when it comes to \"hunger hormones\"). Both can literally cause weight gain or loss outside of standard calorie deficits or surpluses--we still don't even know what all the thyroid hormones do.",
      "created_utc": 1409439884.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ck4v25h",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1409429171.0,
      "score": 2,
      "context": []
    },
    {
      "id": "cky1qbs",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1412215130.0,
      "score": 2,
      "context": []
    },
    {
      "id": "cl00art",
      "author": "None",
      "body": "This applies to me greatly. ",
      "created_utc": 1412398884.0,
      "score": 2,
      "context": []
    },
    {
      "id": "cl2d345",
      "author": "inmy30s",
      "body": "Thank you so much for this! It was extremely helpful.",
      "created_utc": 1412640476.0,
      "score": 2,
      "context": []
    },
    {
      "id": "cnodrks",
      "author": "ShaySilver",
      "body": "Thank you so much for this. I came to this subreddit specifically to ask about this (binging following restricting). I'm several months into recovery from EDNOS. I came from over a year of extreme restriction only to end up continuously binging even though I keep promising myself not to. It's getting harder to fight the urges to purge even though I haven't regularly done so in the past. I really needed to hear there was an actual biological reason for it. Once again, thank you. ",
      "created_utc": 1421209677.0,
      "score": 2,
      "context": []
    },
    {
      "id": "cnzfc3t",
      "author": "monicawesome",
      "body": "I'm coming off of over a year of anorexia and struggling with the transition from not eating to binging/bulimia. I appreciate the information from these recommendations, and I really hope that soon I'll be able rid myself of extreme undereating and overeating. It's getting extremely difficult to deal with, especially when you know how wonderful you looked when you weren't eating, completely isolated and depressed.\n\nThank you. I'll make sure to reference these tips when the urge to binge and restrict happens 3 hours from now. :(",
      "created_utc": 1422118689.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ck5co7q",
      "author": "pajamakitten",
      "body": "There is no evidence to suggest that more smaller meals is better than fewer larger meals if that helps, if something works well for you then stick with it because everyone's body is different.",
      "created_utc": 1409484770.0,
      "score": 15,
      "context": [
        {
          "id": "ck5bqib",
          "author": "real-dreamer",
          "body": ">There is a relatively easy way to keep hunger hormones in check: eat three balanced meals a day, two to three snacks a day, get plenty of sleep, moderate exercise (perhaps 30 minutes of walking 3-4 days a week). This might mean eating by the clock if need be, and lying down by the clock (even if not sleeping, just resting), and moderate exercise on a schedule.\n\nI didn't want to read that. I really was hoping for something else. I fast for several days a week. I feel hostile to your information. I don't have a logical reason to be. I just do. ",
          "created_utc": 1409478874.0
        }
      ]
    },
    {
      "id": "ck5dbv9",
      "author": "None",
      "body": "What *were* you hoping for? ",
      "created_utc": 1409488261.0,
      "score": 6,
      "context": [
        {
          "id": "ck5bqib",
          "author": "real-dreamer",
          "body": ">There is a relatively easy way to keep hunger hormones in check: eat three balanced meals a day, two to three snacks a day, get plenty of sleep, moderate exercise (perhaps 30 minutes of walking 3-4 days a week). This might mean eating by the clock if need be, and lying down by the clock (even if not sleeping, just resting), and moderate exercise on a schedule.\n\nI didn't want to read that. I really was hoping for something else. I fast for several days a week. I feel hostile to your information. I don't have a logical reason to be. I just do. ",
          "created_utc": 1409478874.0
        }
      ]
    },
    {
      "id": "cl29mj3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1412633253.0,
      "score": 5,
      "context": [
        {
          "id": "ck5bqib",
          "author": "real-dreamer",
          "body": ">There is a relatively easy way to keep hunger hormones in check: eat three balanced meals a day, two to three snacks a day, get plenty of sleep, moderate exercise (perhaps 30 minutes of walking 3-4 days a week). This might mean eating by the clock if need be, and lying down by the clock (even if not sleeping, just resting), and moderate exercise on a schedule.\n\nI didn't want to read that. I really was hoping for something else. I fast for several days a week. I feel hostile to your information. I don't have a logical reason to be. I just do. ",
          "created_utc": 1409478874.0
        }
      ]
    },
    {
      "id": "clw0dnr",
      "author": "None",
      "body": "I think that diet is different for everyone. Everyone's body has different needs. I like to eat 4-5 smaller meals a day. I try really, really hard to do this- especially when I exercise a lot. I think what he's getting at here is the usage of a schedule to fight non-eating or over-eating. ",
      "created_utc": 1415390403.0,
      "score": 1,
      "context": [
        {
          "id": "ck5bqib",
          "author": "real-dreamer",
          "body": ">There is a relatively easy way to keep hunger hormones in check: eat three balanced meals a day, two to three snacks a day, get plenty of sleep, moderate exercise (perhaps 30 minutes of walking 3-4 days a week). This might mean eating by the clock if need be, and lying down by the clock (even if not sleeping, just resting), and moderate exercise on a schedule.\n\nI didn't want to read that. I really was hoping for something else. I fast for several days a week. I feel hostile to your information. I don't have a logical reason to be. I just do. ",
          "created_utc": 1409478874.0
        }
      ]
    },
    {
      "id": "ckh3ah9",
      "author": "None",
      "body": "A lot of things are simple in theory but complicated in practice.\n\nHormones can get normal, depends on how long you've been eating in a disordered way.\n\nI managed to get some of my hunger hormones back after a lifetime of malnutrition, so there's always hope.",
      "created_utc": 1410609775.0,
      "score": 3,
      "context": [
        {
          "id": "ckgz2x1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1410586996.0
        }
      ]
    },
    {
      "id": "ckh5jym",
      "author": "EDPostRequests",
      "body": "According to the JAMA article it can take 6 months to a year for the hunger hormones to return to normal. It's probably a logarithmic curve where they are strongest and steepest in the beginning weeks/months, and then they balance out.\n\nAlso, if you have heart issues that are psychological, therapy is a remedy. If the heart issues are physical, see a medical professional.\n\nStay with it. Recovery is for life. Imagine you started a year ago, it'd be done now. \n\nedit: This post might help with the binging, [Binge Eating Recovery](http://www.reddit.com/r/EatingDisorders/comments/2dc4rb/recovery_sharing_ziploc_bags_and_other_things/)",
      "created_utc": 1410618347.0,
      "score": 2,
      "context": [
        {
          "id": "ckgz2x1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1410586996.0
        }
      ]
    },
    {
      "id": "cl2dcgq",
      "author": "inmy30s",
      "body": "I'm sorry. :( I think with the help of a therapist, and seeing one consistently, may go a long way to help you get new habits that eventually fix the hormonal situation, and they can help you deal with the emotional side of everything too. I have yet to find the right therapist for me though. :/",
      "created_utc": 1412641019.0,
      "score": 2,
      "context": [
        {
          "id": "ckgz2x1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1410586996.0
        }
      ]
    },
    {
      "id": "cnmhs53",
      "author": "RudeDolphin",
      "body": "Hey I was EXACTLY like you for about 4 yrs after a year of severe anorexia.  I was involved in high level sport and it wrecked my ability to feel hunger or fullness, and when I was presented with new food could not stop myself.  \n\nBut this morning, after a year of trying to learn how I eat properly I finally realized that I was eating WHEN I WAS HUNGRY!) \n\nThe road to recovery started when I moved in with my boyfriend. I started by eating when he eats to get on a decent schedule.  Then (about 6mo in) I slowly started to eat on my own.  This was tough, sometimes I'd overeat still and sometimes I just wouldn't eat. Now I feel hunger and fullness! It's amazing! I honestly thought there was something biologically wrong with me and I could never deal with food like everyone else.  But you CAN get over it.  It's long term though! You have to trust yourself to feel full later.  When I started, I had a hard time not purging after binging since I didn't trust myself to not continuously binge.  \n\nTrust yourself, and Good Luck! :) ",
      "created_utc": 1421074638.0,
      "score": 1,
      "context": [
        {
          "id": "ckgz2x1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1410586996.0
        }
      ]
    },
    {
      "id": "cldlltq",
      "author": "dronkmalk",
      "body": "You don't have an eating disorder *because* your hunger hormones are out of whack, but because you have an eating disorder, your hunger hormones are out of whack...\n\nSpeaking from experience, I know that 'binging' feels like one of the most terrifying things you can do to yourself, but I am telling you that the only reason you are binging (if it is post- or during restriction) is because your body is screaming at you to eat. The only times in my life that I have ever 'binged' (I put it in apostrophes because I call it reactive eating, not binging) have been after long periods of restricting. When I recovered and had a balanced diet, I *never* binged, because my body didn't need me to. This is of course different if you just have BED, but I would hazard a guess that every single anorexic/restrictive eater has subsequently binged because of their bodies' need to make up for the lack of energy intake.\n\nI felt like I needed to say something because believing that binging after severe restriction is \"replacing one addiction with another\" is a dangerous mindset because it will exacerbate the restrict-binge-hate yourself cycle. Your binging is not an addiction, it will stop when restriction has stopped.\n\nHaving said that, of course you need to couple a healthy diet with proper psychological treatment, because you are right to say that it is often a coping mechanism.\n\nBest of luck.",
      "created_utc": 1413712381.0,
      "score": 7,
      "context": [
        {
          "id": "cky1qbs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1412215130.0
        }
      ]
    },
    {
      "id": "cl2dgvp",
      "author": "inmy30s",
      "body": "Yeah, that is also true. The post was still pretty helpful on a physical level, but I agree that the key to EDs is the psychological stuff behind why we even have it (the ED) to begin with, and that's the main thing that needs to be addressed. I still found the article helpful though, and it gave me hope that I can at least attempt to help my body help me, if that makes sense.",
      "created_utc": 1412641275.0,
      "score": 2,
      "context": [
        {
          "id": "cky1qbs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1412215130.0
        }
      ]
    },
    {
      "id": "cl4plbw",
      "author": "EDPostRequests",
      "body": "> Eating disorders are psychological and somewhat physiological in origin. Let's just consider the physiology of undereating (restricting) and overeating (binging).\n\nTrue. Eating disorders are mental disorders. Professional psychological help is often necessary for recovery. Dieticians are also often a key part of recovery. \n\nWe can't help all the people all the time, but if we can help some of the people some of the time, it's good.",
      "created_utc": 1412863807.0,
      "score": 1,
      "context": [
        {
          "id": "cky1qbs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1412215130.0
        }
      ]
    },
    {
      "id": "ck5fec6",
      "author": "real-dreamer",
      "body": "I don't know. A way to cheat. Eating is hard to do. Right now I'm just trying to eat something every day. It's hard. You know? I was, and I know that it's silly. I know that it's not healthy. I don't like eating. ",
      "created_utc": 1409495756.0,
      "score": 23,
      "context": [
        {
          "id": "ck5bqib",
          "author": "real-dreamer",
          "body": ">There is a relatively easy way to keep hunger hormones in check: eat three balanced meals a day, two to three snacks a day, get plenty of sleep, moderate exercise (perhaps 30 minutes of walking 3-4 days a week). This might mean eating by the clock if need be, and lying down by the clock (even if not sleeping, just resting), and moderate exercise on a schedule.\n\nI didn't want to read that. I really was hoping for something else. I fast for several days a week. I feel hostile to your information. I don't have a logical reason to be. I just do. ",
          "created_utc": 1409478874.0
        },
        {
          "id": "ck5dbv9",
          "author": "None",
          "body": "What *were* you hoping for? ",
          "created_utc": 1409488261.0
        }
      ]
    },
    {
      "id": "cl2d9j0",
      "author": "inmy30s",
      "body": "I've been in the best shape when I ate 3 small meals and 2 snacks in between, all healthy/whole foods. When I ate very little, I couldn't understand why I was still gaining. The explanation is these hormones (now it makes sense), plus your metabolism slows down when it doesn't work, so it's harder to digest when you don't eat much. I know every body is different, but this basically answered those questions for me. Also, I'm an over-eater, so I'm sure this is not easy for an under-eater to accept. Maybe try to slowly add things. The key is to be on a schedule of 2-3hrs in between, or that's what's worked best for me, anyway. *hugs*",
      "created_utc": 1412640854.0,
      "score": 3,
      "context": [
        {
          "id": "ck5bqib",
          "author": "real-dreamer",
          "body": ">There is a relatively easy way to keep hunger hormones in check: eat three balanced meals a day, two to three snacks a day, get plenty of sleep, moderate exercise (perhaps 30 minutes of walking 3-4 days a week). This might mean eating by the clock if need be, and lying down by the clock (even if not sleeping, just resting), and moderate exercise on a schedule.\n\nI didn't want to read that. I really was hoping for something else. I fast for several days a week. I feel hostile to your information. I don't have a logical reason to be. I just do. ",
          "created_utc": 1409478874.0
        },
        {
          "id": "cl29mj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1412633253.0
        }
      ]
    },
    {
      "id": "cknlnzm",
      "author": "supernaculum",
      "body": ">it can take 6 months to a year for the hunger hormones to return to normal.\n\nWhat does this entail? What do you have to do for 6 months to get those hormones to normal?",
      "created_utc": 1411223277.0,
      "score": 2,
      "context": [
        {
          "id": "ckgz2x1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1410586996.0
        },
        {
          "id": "ckh5jym",
          "author": "EDPostRequests",
          "body": "According to the JAMA article it can take 6 months to a year for the hunger hormones to return to normal. It's probably a logarithmic curve where they are strongest and steepest in the beginning weeks/months, and then they balance out.\n\nAlso, if you have heart issues that are psychological, therapy is a remedy. If the heart issues are physical, see a medical professional.\n\nStay with it. Recovery is for life. Imagine you started a year ago, it'd be done now. \n\nedit: This post might help with the binging, [Binge Eating Recovery](http://www.reddit.com/r/EatingDisorders/comments/2dc4rb/recovery_sharing_ziploc_bags_and_other_things/)",
          "created_utc": 1410618347.0
        }
      ]
    },
    {
      "id": "clhc7ma",
      "author": "None",
      "body": "Yes yes yes yes. I know this but it's good to hear it from someone else. ",
      "created_utc": 1414045046.0,
      "score": 2,
      "context": [
        {
          "id": "cky1qbs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1412215130.0
        },
        {
          "id": "cldlltq",
          "author": "dronkmalk",
          "body": "You don't have an eating disorder *because* your hunger hormones are out of whack, but because you have an eating disorder, your hunger hormones are out of whack...\n\nSpeaking from experience, I know that 'binging' feels like one of the most terrifying things you can do to yourself, but I am telling you that the only reason you are binging (if it is post- or during restriction) is because your body is screaming at you to eat. The only times in my life that I have ever 'binged' (I put it in apostrophes because I call it reactive eating, not binging) have been after long periods of restricting. When I recovered and had a balanced diet, I *never* binged, because my body didn't need me to. This is of course different if you just have BED, but I would hazard a guess that every single anorexic/restrictive eater has subsequently binged because of their bodies' need to make up for the lack of energy intake.\n\nI felt like I needed to say something because believing that binging after severe restriction is \"replacing one addiction with another\" is a dangerous mindset because it will exacerbate the restrict-binge-hate yourself cycle. Your binging is not an addiction, it will stop when restriction has stopped.\n\nHaving said that, of course you need to couple a healthy diet with proper psychological treatment, because you are right to say that it is often a coping mechanism.\n\nBest of luck.",
          "created_utc": 1413712381.0
        }
      ]
    },
    {
      "id": "ck5lzpl",
      "author": "None",
      "body": "Keep trying, you're doing well :) it's gonna be okay.",
      "created_utc": 1409511488.0,
      "score": 3,
      "context": [
        {
          "id": "ck5bqib",
          "author": "real-dreamer",
          "body": ">There is a relatively easy way to keep hunger hormones in check: eat three balanced meals a day, two to three snacks a day, get plenty of sleep, moderate exercise (perhaps 30 minutes of walking 3-4 days a week). This might mean eating by the clock if need be, and lying down by the clock (even if not sleeping, just resting), and moderate exercise on a schedule.\n\nI didn't want to read that. I really was hoping for something else. I fast for several days a week. I feel hostile to your information. I don't have a logical reason to be. I just do. ",
          "created_utc": 1409478874.0
        },
        {
          "id": "ck5dbv9",
          "author": "None",
          "body": "What *were* you hoping for? ",
          "created_utc": 1409488261.0
        },
        {
          "id": "ck5fec6",
          "author": "real-dreamer",
          "body": "I don't know. A way to cheat. Eating is hard to do. Right now I'm just trying to eat something every day. It's hard. You know? I was, and I know that it's silly. I know that it's not healthy. I don't like eating. ",
          "created_utc": 1409495756.0
        }
      ]
    },
    {
      "id": "cl4p6kg",
      "author": "EDPostRequests",
      "body": "These hunger hormones are similar to other hormones in our bodies (such as a woman's estrogen cycle) in that they can't be quickly turned on and off. The JAMA article linked is a study that has proven hunger hormones take a long time to return to normal after periods of undereating.\n\nThere are suggestions under each of the hormones mentioned for what to do to help them return to normal. For example, for cortisol, try to rest more by lying down even if not sleeping. For ghrelin, eating every few hours (for example, 3 meals a day, 2 snacks) helps bring that hormone back into balance so that binges have one less biological stimulus.\n\nThere are many hormones that regulate hunger, more than can be listed and many still not understood. However, the ones listed offer a variety of solutions to begin to help calm the body as a part of recovery.",
      "created_utc": 1412862823.0,
      "score": 1,
      "context": [
        {
          "id": "ckgz2x1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1410586996.0
        },
        {
          "id": "ckh5jym",
          "author": "EDPostRequests",
          "body": "According to the JAMA article it can take 6 months to a year for the hunger hormones to return to normal. It's probably a logarithmic curve where they are strongest and steepest in the beginning weeks/months, and then they balance out.\n\nAlso, if you have heart issues that are psychological, therapy is a remedy. If the heart issues are physical, see a medical professional.\n\nStay with it. Recovery is for life. Imagine you started a year ago, it'd be done now. \n\nedit: This post might help with the binging, [Binge Eating Recovery](http://www.reddit.com/r/EatingDisorders/comments/2dc4rb/recovery_sharing_ziploc_bags_and_other_things/)",
          "created_utc": 1410618347.0
        },
        {
          "id": "cknlnzm",
          "author": "supernaculum",
          "body": ">it can take 6 months to a year for the hunger hormones to return to normal.\n\nWhat does this entail? What do you have to do for 6 months to get those hormones to normal?",
          "created_utc": 1411223277.0
        }
      ]
    }
  ]
}