{
  "id": "7gqztb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1512087485.0,
  "title": "Request: My family is constantly pointing out my flaws despite my bulimia.",
  "selftext": "I've had bulimia for 5 years. Recently, I finally got the courage to ask for help and now I'm seeing a specialist for my disorder. My family knows how severe my bulimia is/was. But last week on Thanksgiving, it felt like everyone had a right to say something about my choice of food or my weight. My father kept asking \"Did you stop working out? You're looking a little unfit. You should start a routine again.\" My sister said, \"Oh look at that, you're not thin anymore; you have boobs again!\" My mom said \"Are you sure you want sweet potato casserole? You don't need that much sugar.\" And finally, we were looking at old family photos and in one, it was me from two years ago, when I was very deep into my bulimia and exercise addiction. and my sister-in-law said, \"Wow you were so thin and fit. You hardly look like the same person.\" Comment after comment, I just smiled, but was absolutely distraught on the inside.At the end of the night, I purged all my thanksgiving dinner, cried, got drunk, and cried some more. It wasn't only on thanksgiving though, this happen every other day in my home. I feel like I won't get better with no support from my family. I do not understand why they are so insensitive. or is it just me?\n\nCan anyone offer advice on how to deal with this?\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/7gqztb/request_my_family_is_constantly_pointing_out_my/",
  "score": 49,
  "num_comments": 9,
  "comments": [
    {
      "id": "dql53f5",
      "author": "rose_emoji",
      "body": "first, i hope you’ll be getting out of that house sometime soon. sometimes people just don’t understand and being in environment like that must be so difficult. \n\ni would go to the person(s) you trust to take you seriously and talk privately with them. let them know those kinds of comments are really damaging to you. \n\nif there’s someone who’s notorious for not taking you or your issues seriously, quite honestly don’t bother trying to explain your feelings to them. it could do more damage than good unfortunately, and your health isn’t worth the risk!\n\ngood luck! and super proud of you for reaching out for help. that’s incredible! ",
      "created_utc": 1512090841.0,
      "score": 31,
      "context": []
    },
    {
      "id": "dqmyv9e",
      "author": "74030",
      "body": "I had that exact comment from my dad about sugar just the other day!! We were looking in the cereal aisle and I looked at cereal I loved before my ED and debated getting it or not, he says \"Are you sure you want all that sugar?\". Where in the right mind do you think it's okay to say that to someone in recovery?",
      "created_utc": 1512177056.0,
      "score": 8,
      "context": []
    },
    {
      "id": "dqllxsf",
      "author": "Icemotel",
      "body": "Disgusting. I don’t care how “tough” or other society-enforced BS were told to be, when you suffer from an illness like this comments can and will slow down the recovery process. \n\nI remember when I did 6 weeks for Anorexia recovery in 2013, I came back to school for the last day. My principal told me I “didn’t look anorexic” and jokingly asked if I faked the disorder. I was appalled, and from then on I decided that regardless of what the person means to me, no one is allowed to comment on my physique or eating habits, positive or not (besides therapists or other groups)\n\nI suggest you enlist similar rules with your fam",
      "created_utc": 1512114196.0,
      "score": 6,
      "context": []
    },
    {
      "id": "dqlg7jb",
      "author": "None",
      "body": "I am so, so sorry you have to deal with that kind of bullshit. I really don't understand how people can say that kind of stuff without thinking about what effect it might have. And even the little things add up. But these aren't little things, what you described was an onslaught.\n\nYou need to communicate to them how hurtful it is. I know that might be really difficult. People don't say things for nothing -- maybe they're projecting their own insecurities, or something else, but they have their own (selfish) reasons for saying those kinds of things to you. Or they're completely unaware, potentially. Which is why they might not want to hear that they shouldn't say them. I'm not sure how you can make it clear how much it hurts and wears you down, but you have to try. You could start by writing out your feelings about it, getting them straight and clear. Don't make it about them directly, make it about how you feel as a result. If you sound accusatory they'll shut down.\n\nHey and good luck and I hope it gets better, I really do. You're being so amazingly strong.",
      "created_utc": 1512103910.0,
      "score": 4,
      "context": []
    },
    {
      "id": "dqmv3w0",
      "author": "Captain_Erica",
      "body": "Honestly, if your family is toxic you might be better purging them from your life.\n\nI've done this with three of my four siblings who were absolutely unhealthy in their own lives and let it bleed over into their interactions with me. I have zero regrets either, much healthier and happier with them it of my life.\n\nYou can always find a new family that supports you emotionally. You aren't stuck with the one you were born into.",
      "created_utc": 1512172330.0,
      "score": 3,
      "context": []
    },
    {
      "id": "dqpazoo",
      "author": "hoitytoity99",
      "body": "What I think may really help for your situation is taking part in family therapy for eating disorder recovery. This is what I did. It can be very helpful for your family to learn about the shit your going trough by a qualified professional when they don't listen to or try to understand you very well. ",
      "created_utc": 1512313597.0,
      "score": 3,
      "context": []
    },
    {
      "id": "dqloyk3",
      "author": "StefanodesLocomotivo",
      "body": "I feel like eating disorders just aren't taken as seriously as other disorders. My family has a lot of history of depression, gambling addiction, alcoholism to even as far as heroin addiction. It's part of the reason why I haven't told them about my food addiction. After 2 years of recovery from this I'm still almost always overly obsessed with food. Every bite I take I still worry about the calorycontent. I went from being severely underweight to overweight so quickly I can just feel the judgmental stares from everyone. All I can say is don't let it slow you down. Write down how you feel now as opposed to how you felt back then. Say to yourself that you have made real progress and that you're taking steps in the right direction. Those people just aren't aware how difficult it is to overcome this.",
      "created_utc": 1512121929.0,
      "score": 2,
      "context": []
    },
    {
      "id": "dqyt6hw",
      "author": "showponymichonne",
      "body": "Wow, how insensitive. I don't know how old you are, but if you are old enough and able, you need to remove yourself from them. That's what I had to do with my family. I had struggled with anorexia since puberty and my family \"noticed\" (finally) how thin I was and how I avoided eating around 16 I believe. However, they still continued to comment on whatever they did see me eating. And my brother and uncles would constantly try to poke and pinch at me and say \"Oh I do see some meat there, okay, you are filling in!\" even though I was steadily losing weight (and they KNEW it)! They never took it seriously and I seriously hated them for it. As soon as I could, I left home for college. I have never been back. \nSome people in my family have (finally) openly asked me and/or my mom about what the falling out was about and I think most of the rest just assume it was about the weight and I think the rest honestly don't care. I have reconciled and come to peace with the fact they honestly don't care about me. There are so many times over the years that I have gotten so sick and could have died and they never knew and never cared enough to step in or DO anything. They just watched silently as I dropped down lower and lower. Then they have the nerve to ask me why I don't come home. I am honestly trying to live a normal life and I wouldn't risk being triggered by them again. I think the best revenge in these cases is to just leave and cut them off. Only then will they realize how awful they are. ",
      "created_utc": 1512764232.0,
      "score": 2,
      "context": []
    },
    {
      "id": "dqz03il",
      "author": "SkimbyJ",
      "body": "I’m in a very similar situation - my mother has always been critical of my weight. The concerning thing is when I recently told her I had bulimia she told me she battled it for years as well - so why is she still such a b*tch about my weight/food struggles?\nHow familiar are your family with eating disorders? I mean, any reasonable person should know commenting on the appearance or weight of someone with an ED is not cool, but (playing devils advocate a little) is it possible they’re scared for you and treating you differently would make it more real for them?\nThat is no excuse and I’m angry for you but is that worth confronting them about?",
      "created_utc": 1512771873.0,
      "score": 1,
      "context": []
    }
  ]
}