{
  "id": "8an32g",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1523154290.0,
  "title": "Request: Reddit is enabling my eating disorder",
  "selftext": "I was set off by a specific comment that I read on a specific sub dedicating to a more intense diet regime. There's nothing wrong with dieting this way, but recently there has been scrutiny of the sub because of that fact that it harbors many people with eating disorders. There's on particular comment, very well upvoted, that says that nobody who really has anorexia would eat anywhere near around x (a low number) calories.\n\nThat low number of calories got me to a dangerously low BMI. It led to anemia, syncope, obsession, c/s, and yes, an anorexia diagnosis.\n\nBut no, ~real~ anorexics eat *even fewer*, always. I was just disciplined enough to eat x calories, right?\n\nI was doing so well with my recovery. But if people think that my habits are normal dieting behavior, even when your BMI started out low, what am I recovering from?\n\nI've read similar comments in other subs. It seems like my behavior has never been disordered. How can I recover when society is praising me for my behaviors and trying to emulate them?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/8an32g/request_reddit_is_enabling_my_eating_disorder/",
  "score": 38,
  "num_comments": 5,
  "comments": [
    {
      "id": "dx02db9",
      "author": "Soggy_Biscuit_",
      "body": "Stop consuming toxic content. Unsubscribe from subs like that, unfollow fitspo shit on instagram, get rid of all of it. I can promise you it will not do you any good because people who comment shit like that have no idea what they're talking about. If you want to help yourself on your way to recovery you need to avoid shit like that like the plague.\n\nAnorexia is never a choice. People who try to emulate anorexic behaviours are cherry picking bits of it they think are desirable but, again, have literally no idea what they're talking about and simply reducing caloric intake =/= anorexia. Anorexia is a mental illness, it is not a choice. Their views are not normal, regardless of how ubiquitous they seem; they are distorted and harmful to so many people. \n\nIf you have talked to a doctor and you have been diagnosed with anorexia... Who do you think has more insight in to your situation here, your doctor or some idiots on the internet? (spoiler: your doctor). Unless someone has experience with anorexia or they are a trained professional, their opinion should be worth nothing to you. Seriously, people are so fucking stupid and you should not listen to them. Giving weight to their opinion will only do you harm in regard to your recovery. If I listened to idiots when I was recovering I would have fed thought patterns that contributed to my illness (which are also thought patterns *your illness feeds on*) and died, or I simply would have \"eaten a sandwich\" and instantly gotten better. Um... Hello?\n\nGood for you for choosing recovery. It's fucking hard and incredibly brave. It's an ongoing choice, you have to keep choosing to do the thing that you think is right. I know bullshit comments like that can fuck you up and be triggering, but you need to keep choosing to do the thing that is best for you.",
      "created_utc": 1523160389.0,
      "score": 38,
      "context": []
    },
    {
      "id": "dx06p1e",
      "author": "hellomireaux",
      "body": "I think a critical question here is why it's so important to see yourself as a \"real\" anorexic.  What does that title mean?  Why did you feel the need to justify your diagnosis with a list of symptoms?  These questions are not meant to be accusatory, but to inspire self-reflection.\n\n\nAnorexia can feel like an accomplishment when other parts of your life feel incomplete.  The comments on that sub seem to have threatened that sense of achievement.  You mentioned being \"disciplined\", but I would challenge the notion that obsession and mental illness have any correlation to your self-control and goodness as a person.\n\n\n\nDabbling in diet forums may be a red flag that you're still seeking internal validation by controlling your food/body.  At the heart of it, recovery is about freedom.  Don't just change prisons - break out.     ",
      "created_utc": 1523166376.0,
      "score": 13,
      "context": []
    },
    {
      "id": "dx04pv7",
      "author": "vanityprojects",
      "body": "Why were you on that specific sub in the first place? If you're in recovery you don't need to be browsing a sub dedicated to intense dieting do you. My point is that you can't control the whole world, only yourself. You need to do your best to surround yourself with recovery people and things. Even go as far as stopping some social tools if need be. This is the only way you will succeed, taking care of your environment. You can come back when you're better, but your health now must come first.",
      "created_utc": 1523163490.0,
      "score": 9,
      "context": []
    },
    {
      "id": "dx0jtk4",
      "author": "atrueamateur",
      "body": "> How can I recover when society is praising me for my behaviors and trying to emulate them?\n\nSociety--and you--are taking behaviors out of context.\n\nPeople's food needs are very different from each other, and a particular person's needs change throughout their life.  A perfectly healthy diet for one person can be overeating for another or undereating for another.  When you are just looking at a calorie count, then you aren't getting the full picture of what the person is and what they are doing.\n\nIt would be best if you completely ignored diet subreddits while you're struggling with your recovery.  You *know* they are somewhere between dangerously oversimplifying and downright wrong.  Trust your doctor and your treatment team to know what's healthy, not some random people on the internet.",
      "created_utc": 1523194241.0,
      "score": 4,
      "context": []
    },
    {
      "id": "dx764x6",
      "author": "None",
      "body": "Unsub.... society isn’t going to change. You just have to focus on your health ",
      "created_utc": 1523472374.0,
      "score": 2,
      "context": []
    }
  ]
}