{
  "id": "8jtm4m",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1526463553.0,
  "title": "Request: Recovered anorexic, now objectively overweight, advice on how to lose the weight and not relapse",
  "selftext": "I would consider myself recovered/in recovery from anorexia for the last fifteen years. I’ve been married for nine years to an amazing cook and have gained weight. Enough that my doctor nags me about losing weight - so between that and the scale, I feel like I have objective data.\n\nFor the last month, I’ve been doing a lot of strength training and cardio. I’ve started to run again, I can tell that my endurance is better, and am see actual muscle definition. All of which is awesome.\n\nThe food is more of a challenge - I am trying to make healthy food decisions, work on reasonable portions,etc. I am terrified that I will over restrict and there are days when I hear that voice creeping into my head.\n\nI can’t find any studies or objective data about people in recovery trying to lose weight via healthy choices.\n\nDoes anyone have sage advice on how to stay on track with recovery while simultaneously staying on track with a healthy weight loss plan??\n\nThanks in advance!!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/8jtm4m/request_recovered_anorexic_now_objectively/",
  "score": 49,
  "num_comments": 20,
  "comments": [
    {
      "id": "dz2e96v",
      "author": "yyaaaaaasss",
      "body": "Oh! Me! Me! I’ve been going through this somewhat successfully the past 6 months :) Recovering BN and restrictive eating. I’ve found what is very helpful is to (1) food journal (NOT counting calories or portion sizes, just literally write what you are eating) and (2) work with a nutritionist. I started to log all my food, and she would help me understand why foods I was “scared” of were ok to eat, and why I had to include certain foods instead of omit them for health benefits. My approach to food has turned into thinking of all the things I CAN eat as opposed to focusing my brain energy towards what I CAN’T eat. I ensure everything I eat is very healthy (fruits, vegetables, whole wheat carbs, etc.) so whenever my brain tries to fuck with me, I can turn to my food journal and show it that everything I’m eating is healthy and important for my body to function. It was a slow and hard process to get to this point, and I work with a therapist as well, but I’m currently really happy with where I am and feel very healthy. Best of luck to you! Hope this helps :)\n\nEdit: One more thing. I started focusing on this because I’m getting married in September and also wanted to lose weight but in a healthy way. I’ll say the one thing that’s hard to deal with is that the weight loss isn’t immediate. It’s slow and steady. And that’s GREAT!!! But it’s a mental challenge to accept that, when I have my thoughts creep in that sneakily say “I know how you can lose weight quicker....” - so another tip here is to give yourself time. Don’t expect instant results. And that’s ok!",
      "created_utc": 1526467736.0,
      "score": 29,
      "context": []
    },
    {
      "id": "dz2muan",
      "author": "The_greeen_faerie",
      "body": "I see you say that you are objectively overweight. However, is your physical health at risk due to this? It sounds like you mental health certainly is since being told to loose weight. I can't be sure of the best way around this but I really do think that avoiding counting your intake and avoiding the scale will help avoid slipping back into obsessive patterns and fixations. You can be healthy (and loose weight) and not have to actually know your weight.. Of course you want to know when you are in a healthy weight range but I'm sure that you can also judge this from your body's performance and form other indicators like how your clothes are fitting. I think your goal should be mental and physical health rather than a certain weight but this is maybe me being ignorant if your weight is currently affecting your physical wellbeing.. There are lots of recovery blogs and figures on for example instagram (I mean the body positive ones not the triggering obsessive ones) that are run by great women who may be able to advise you. You could try emmy Brunner (clinician from recover clinic, and woman to woman project) or bodyposipanda (great Internet personality and also a recovered anorexic who is objectively 'overweight' but actually mentally and physically well). ",
      "created_utc": 1526479131.0,
      "score": 8,
      "context": []
    },
    {
      "id": "dz2fs87",
      "author": "None",
      "body": "I’m in a similar position and couldn’t afford a nutritionist/dietician. I’ve been having very similar breakfasts and lunches since Jan. I know the range of foods I can choose from for those meals and I don’t have to think about it eg 1/4 cup oats with cashew milk or a protein bar for breakfast. I’m so used to it now that it’s routine and it keeps me on track. For lunch, my partner makes the same base grains and we rotate the meat/cheese/beans that we top it with. That makes lunch easy and choiceless. It might be a little boring but dinner is varied so it’s like the base of my food habits and doesn’t bother me. At first I checked the calories to be sure how they fit into my day but now I don’t have to stress about these two meals at all.\n\nIn the very beginning, I did have an instance of crying when he picked a higher calorie grain (damn you, spelt!) to make the lunch with but after I pushed myself to eat it anyway, I haven’t had any further intense food fear moments. If I start to feel the fear and resistance, I repeat in my head “I nourish myself” while I push through it. \n\nFor dinner, I have done some food replacements such as oil spray instead of oil and half fat dairy etc. I also try to add in one or two more veggies into every meal to bulk it out. I generally also turn down the extra bread my partner loves to eat with dinner because before I met him I thought it was overkill to eat bread and rice in the same meal. I also eat from a smaller bowl than I used to which helps with portion sizing.\n\nFinally, I took a good look at habits that were adding a lot of calories to my day: lattes, multi-serving bags of snacks and semi-regular takeout. I switched up my coffee order, got single serve bags of snacks and got takeout less regularly (read: not never). \n\nIf you were to count calories, set a hard line ‘floor’ where going below that is incompatible with staying healthy. I was terrified of ever trying to lose weight again after I got out of recovery and I felt miserable that I was slowly becoming unhealthy and there was nothing I could do about it without relapsing. This time around my mindset has been completely different, most notably in the speed that I’m approaching a healthy weight. Slow and steady wins the race.\n\nI hope it works out for you whatever you do and if you begin to relapse, please stop and seek help. It’s better to be overweight and alive than back in that living hell. ",
      "created_utc": 1526470453.0,
      "score": 7,
      "context": []
    },
    {
      "id": "dz2eyvc",
      "author": "None",
      "body": "Try the \"intuitive eating\" strategy. This is the most non triggering eating method I've ever tried. It's all about eating when ur physically hungry and stopping when ur full. This way you can eat whatever you want but you'll still be confident that this is the healthy amount of food. No triggering counting! \n\nTry the book \"it's not about food\" or Google intuitive eating ",
      "created_utc": 1526469071.0,
      "score": 10,
      "context": []
    },
    {
      "id": "dz2gqsc",
      "author": "Catastrophe92",
      "body": "First of all I think it’s really good that you’re aware of the risk of repeating unhealthy behaviours and you know this is a risk, as they say “awareness is the first step” (someone said that to me once)\nI’ve been in anorexia recovery for about 6 years and I’m now on a paleo type meal structure (I hate the D word, I think it has such negative connotations). \nI’ve found it really helpful to plan my meals in advance which helps me make sure I have a balanced plate with healthy fats, protein and carbs. But I don’t plan to the extent that if something catches my eye in the supermarket, I won’t buy it. \n\nI let myself have treats every so often (the paleo lot can wrestle my PMS chocolate from my cold dead hands) and personally I think this is something important to avoid restrictive behaviours, if I like eating it and it tastes good, I’m going to bloody well eat it. \n\nI always try to finish meals feeling full which means sometimes my plate is really full (again, I will balance this out so if I’m extra hungry I’ll have a bit more rice and another portion of veg, for example) and most importantly I cook everything myself. This has two benefits: 1) I know exactly what’s going into my food and 2) I get a really lame sense of pride when I enjoy eating food that I made myself. (It also means I don’t have to make a dreaded decision at lunch time of what to eat, because I bring my own)\n\nI hope this helps somewhat, please feel free to message if you have any questions (or if what I said was total bullshit!) \n",
      "created_utc": 1526471892.0,
      "score": 3,
      "context": []
    },
    {
      "id": "dz2kzw3",
      "author": "Kodiak01",
      "body": "First of all, fantastic work on managing your eating to get yourself to a healthy place.  It sounds like you've raised yourself up to the challenge and should be very proud of yourself.\n\nThe mindfulness you are demonstrating with your food intake, trying not to go too high or low, is your biggest asset here.  You are aware of the what and how, it comes down to managing things in small chunks; one day at a time, one meal at a time, even one bite at a time on occasion.\n\nThe one thing I would not suggest is any drastic changes.  The key to weight management is sustainability; results don't have to come at breakneck speed, more important that the results are maintained.  Personally, I come from the opposite end of the spectrum, from morbidly obese to normal and now rising back up a bit.  Like you, I also strength train regularly.\n\nEven though my weight has gone up (high was 360, low was 192, now ~225 @ 6'0\"), many of my clothes still fit as they did before.  Although I know some of the gain is fat, I have to remind myself that muscle accounts for some of it as well.  I've moved from purely following a number on the scale to working on gauging how I look and feel.\n\nMy eating does go to both extremes at times. There are nights that my BED pops up, then I feel like such crap about it I refuse to eat anything for almost 24 hours afterward.  In the end, my goal is to get back to that happy medium, climb back on the horse and worry about making my NEXT meal better.  What was done is done, I take personal responsibility for it, and concentrate on how the next meal can improve.\n\nAlthough people say reaching their healthy place (on the scale or otherwise) is the hardest part, the reality is that maintaining it in the long term is a much longer and bigger challenge; the challenge will remain for the rest of your life.\n\nWhen things do skew a little to either side, it is important that you do not beat yourself up over it or feel like a failure.  Be it the number on the scale or how you feel on a particular day, it is never going to remain static.  The important thing is to recognize when it is happening and make slight adjustments to your personal rudder to steer back on course.\n\nIf you need specific help with food choices, a dietitian (NOT a nutritionist; anyone can call themselves a nutritionist while a dietitian has formal training and accreditation) can be a big help.  I would just make sure that the one you choose is well versed in helping active people and not just parroting macros designed for a sedentary person (as I have unfortunately encountered all too often.)\n\nWhen I learned about making healthy choices in my weight loss journey, the plan I used did not do any calorie counting.  Instead, it was based on portion sizes and food choices with an emphasis on cooking meals from simple ingredients instead of processed foods or eating out.   Over time, I began to learn just how much was a proper portion was supposed to be as opposed to how many calories a particular food had.  It wasn't easy, and still struggle with it to this day.  I'm glad I learned how to eyeball things instead of just worrying purely about a kcal count.\n\nKeep up the great work!!",
      "created_utc": 1526477239.0,
      "score": 2,
      "context": []
    },
    {
      "id": "dz7t2w3",
      "author": "wycie100",
      "body": "Focus on adding healthier things into your diet, not taking away. Try to add one or two extra servings of veggies and or fruit. When ordering a sandwich or pizza (if there’s an option) ask for whole grain bread. Change is slow but by adding instead of taking away you can start to help yourself adjust to a healthier eating pattern slowly. (Recovering bulimic) ",
      "created_utc": 1526691792.0,
      "score": 2,
      "context": []
    },
    {
      "id": "dzblr1k",
      "author": "None",
      "body": "Sorry I’m late the the party. I’m in the same boat and I think a lot of us are or have been. I’ve been a “recovering” anorexic for the past 5 years. I wouldn’t say recovery because I realized just because I gained weight didn’t mean I was recovered. All the demons and mental shit was still there. \n\nI started gaining weight because I got into a real bad depression. I ate because my relationship with food was still so unhealthy. So I binged. Avoiding the scale because I knew that if I looked it would be over. I hadn’t stepped on a scale in 5 years. Whenever I went to the doctors I always said “I’m a recovering anorexic. I’m going to turn my head. Dont say my weight out loud.”  They were always very understanding. \n\nI finally realized I was getting fat. I still couldn’t step on a scale so I called my doctors office to get my most recent weight. I was about 55lbs heavier than I should be to be at the normal weight for my height. Now 55lbs isn’t much and I where my weight well. So no one called me out on this weight gain. I just felt it. \n\nWhen I first started dieting it was almost instant that I started restricting. I bought a scale and went from loving food to being afraid. I wasn’t losing fast enough. So I gave up. I had lost about 15lbs. Managed to keep it off. \n\nI started doing keto and Intermittent Fasting and OMAD (One Meal A Day) and I feel like it’s been the best thing in terms of dieting and my eating disorder.\n\nI like to control. I like to starve. I like to binge. With keto I can lose weight by staying under 20g of carbs. I can track that. Since I lose weight just by doing that I don’t obsess over calories. I have a rough estimate of what I’m consuming calories wise and I try to stay under 1500 calories a day. I also try to eat either within an 8hr period and never after like 6pm. I also eat one meal a day like 3 times a week. I like this because it feels like I’m starving but I’m not. When I eat my one meal it’s usually always 1500 calories worth of food. Since it’s hard to get such high calories during that one meal I usually drink a high calories meal replacement before my actual meal and one right after. Both are low carb. \n\nI’ve lost an additional 15lbs. So I’ve lost 25lbs and I’m half way to my goal. I’m not seeing the weight fly off but I’m seeing consistent weight loss. I don’t feel like I’m depriving myself and I also feel like I have a sense of control but in a much healthier way. \n\nThis might not work for you but my advice is that if you try to run from who you are it might not work. Instead use what you know to help you be healthy instead of ignoring it and trying to act as if it’s not there.\n\nWe like to control and count and weigh. Some of us can recover completely from that and some of us can’t. I am using my control in healthy weighs. I keep track of only carbs, proteins and fats and not calories. I only weigh myself in the morning. If I feel like I’ve failed somehow I won’t weigh myself at all. I don’t want the scale to be my enemy but my friends. I rather it reward me not punish me. \n\nSo just find a diet that works for you. I have a friend who is a recovering anorexic I met in treatment. She does CICO (Calories In and Calories Out). She stays right at her 1500 calories. She does modest workouts and she maintains her weight which is a healthy weight. She doesn’t obsess but the diet does allow her to track which is what she needs to not feel out of control. It works for her. She only measures herself once a week and doesn’t use a scale at all. \n\nIt’s all about finding that balance. Don’t run. Instead face your demons head on and say “Hey! I now control you. Not the other way around.” ",
      "created_utc": 1526887359.0,
      "score": 1,
      "context": []
    },
    {
      "id": "dze7pup",
      "author": "bigiszi",
      "body": "Make a tiny change like only drinking water or for a limited time not having any chocolate rather than making massive restrictions should stop it from spiralling? Also if you are married to an amazing cook: tell them to please make slightly lower calorie meals - they might enjoy the challenge and it is in their hands not yours",
      "created_utc": 1527007270.0,
      "score": 1,
      "context": []
    },
    {
      "id": "dz2djn0",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1526466307.0,
      "score": -2,
      "context": []
    },
    {
      "id": "dze7euk",
      "author": "bigiszi",
      "body": "if her doctor is telling her to her weight is either putting her at risk or aggravating an existing illness.",
      "created_utc": 1527006999.0,
      "score": 7,
      "context": [
        {
          "id": "dz2muan",
          "author": "The_greeen_faerie",
          "body": "I see you say that you are objectively overweight. However, is your physical health at risk due to this? It sounds like you mental health certainly is since being told to loose weight. I can't be sure of the best way around this but I really do think that avoiding counting your intake and avoiding the scale will help avoid slipping back into obsessive patterns and fixations. You can be healthy (and loose weight) and not have to actually know your weight.. Of course you want to know when you are in a healthy weight range but I'm sure that you can also judge this from your body's performance and form other indicators like how your clothes are fitting. I think your goal should be mental and physical health rather than a certain weight but this is maybe me being ignorant if your weight is currently affecting your physical wellbeing.. There are lots of recovery blogs and figures on for example instagram (I mean the body positive ones not the triggering obsessive ones) that are run by great women who may be able to advise you. You could try emmy Brunner (clinician from recover clinic, and woman to woman project) or bodyposipanda (great Internet personality and also a recovered anorexic who is objectively 'overweight' but actually mentally and physically well). ",
          "created_utc": 1526479131.0
        }
      ]
    },
    {
      "id": "e0o6qq5",
      "author": "november1999",
      "body": "The problem is that when you have anorexia, bulimia, binge eating disorder, intuitive eating isn’t really an option due to the nature of eating disorders. And by that I mean, the relationship with food is distorted and unhealthy, so the first and foremost thing is to address the underlying causes while following some sort of meal plan. And I’m saying this from my experience of being anorexic (hospital 3 times) for all of my adolescence (11 to 17) to having Bulimia/binge eating disorder, which caused me to gain over 50lbs in one year and become borderline overweight. Now, I’m glad to say that both of those problems are behind me for the most part, but when I suffered from the binge eating, “intuitive eating” was the gateway to almost a year of emotional eating. But now that I’m in a much better place mentally, I have lost the weight (but I’m not underweight again of course) and can comfortably eat intuitively as a (mostly) raw vegan.",
      "created_utc": 1528997912.0,
      "score": 2,
      "context": [
        {
          "id": "dz2eyvc",
          "author": "None",
          "body": "Try the \"intuitive eating\" strategy. This is the most non triggering eating method I've ever tried. It's all about eating when ur physically hungry and stopping when ur full. This way you can eat whatever you want but you'll still be confident that this is the healthy amount of food. No triggering counting! \n\nTry the book \"it's not about food\" or Google intuitive eating ",
          "created_utc": 1526469071.0
        }
      ]
    },
    {
      "id": "dz2ef8t",
      "author": "covhr",
      "body": "I would advise AGAINST counting calories when recovering from an eating disorder. \n\nWhat /u/yyaaaaaasss says is true. Consult a dietitian experienced in eating disorders. ",
      "created_utc": 1526468061.0,
      "score": 3,
      "context": [
        {
          "id": "dz2djn0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1526466307.0
        }
      ]
    },
    {
      "id": "e0oeurs",
      "author": "None",
      "body": "I just feel as though the approach for treating eating disorders can in no way be streamlined among different and all individuals. \n\nThere is a lot of evidence (scientific studies, research, personal experience, hearing of others' experiences) that supports that intuitive eating does work for recovering from eating disorders. I am sure there is also a plethora of evidence to support that rigid meal plans also work.\n\nThe \"nature of eating disorders\" is common amongst all people with them, but in many ways is not common. Therefore, you saying that intuitive eating could not possibly work for ANYONE with ANY eating disorder is not true in my opinion. \n\nI am glad you found recovery in \"addressing the underlying causes\" and a meal plan. Truly. But intuitive eating can work for other people. Intuitive eating also seeks to address the underlying causes. Obviously you need to address underlying causes with any eating disorder if you want to recover. It seems you don't know what intuitive eating truly is. True intuitive eating is not a free for all \"oh Im allowed to binge now so let me do so every day\". \n\nSorry, this is the rudest thing I've ever responded to someone online. I just feel protective over intuitive eating, because it in its true form helped me a great deal. ",
      "created_utc": 1529005872.0,
      "score": 1,
      "context": [
        {
          "id": "dz2eyvc",
          "author": "None",
          "body": "Try the \"intuitive eating\" strategy. This is the most non triggering eating method I've ever tried. It's all about eating when ur physically hungry and stopping when ur full. This way you can eat whatever you want but you'll still be confident that this is the healthy amount of food. No triggering counting! \n\nTry the book \"it's not about food\" or Google intuitive eating ",
          "created_utc": 1526469071.0
        },
        {
          "id": "e0o6qq5",
          "author": "november1999",
          "body": "The problem is that when you have anorexia, bulimia, binge eating disorder, intuitive eating isn’t really an option due to the nature of eating disorders. And by that I mean, the relationship with food is distorted and unhealthy, so the first and foremost thing is to address the underlying causes while following some sort of meal plan. And I’m saying this from my experience of being anorexic (hospital 3 times) for all of my adolescence (11 to 17) to having Bulimia/binge eating disorder, which caused me to gain over 50lbs in one year and become borderline overweight. Now, I’m glad to say that both of those problems are behind me for the most part, but when I suffered from the binge eating, “intuitive eating” was the gateway to almost a year of emotional eating. But now that I’m in a much better place mentally, I have lost the weight (but I’m not underweight again of course) and can comfortably eat intuitively as a (mostly) raw vegan.",
          "created_utc": 1528997912.0
        }
      ]
    },
    {
      "id": "dz2f30i",
      "author": "grundlegasm",
      "body": "Same here. Recovering bulimic who’s 30 lbs overweight and whenever I try counting calories it sends me into a spiral of restricting, then bingeing and purging. I did find an app that logs food but not calories, so you can see how much nutrition you’re getting. I would recommend something like that. ",
      "created_utc": 1526469274.0,
      "score": 3,
      "context": [
        {
          "id": "dz2djn0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1526466307.0
        },
        {
          "id": "dz2ef8t",
          "author": "covhr",
          "body": "I would advise AGAINST counting calories when recovering from an eating disorder. \n\nWhat /u/yyaaaaaasss says is true. Consult a dietitian experienced in eating disorders. ",
          "created_utc": 1526468061.0
        }
      ]
    },
    {
      "id": "e0oinov",
      "author": "november1999",
      "body": "I didn't mean to imply that intuitive eating is a recipe for binge-eating, I just meant that, as most/virtually all professionals at ED treatment centers would say, someone with a disorderd relationship with food and most likely their body would have a very hard time \"eating when it feels right\" after becoming accustomed to completely ignoring or even disabling the body's natural signals when it comes to satiety, hunger, etc. And trust me, this is coming from someone who tried intuitive eating multiple times despite professional recommendations, with the first two times involving me seeing no need to increase my caloric intake because I never felt \"hungry\" despite being underweight, and the other time resulting in the beginning of BED/BN. Both cases are extremely common and are part of the reason why at pretty much all treatment centers you're not allowed to eat \"intuitively.\" But of course, there is absolutely nothing remotely wrong with being an intuitive eater to maintain recovery. ",
      "created_utc": 1529009180.0,
      "score": 1,
      "context": [
        {
          "id": "dz2eyvc",
          "author": "None",
          "body": "Try the \"intuitive eating\" strategy. This is the most non triggering eating method I've ever tried. It's all about eating when ur physically hungry and stopping when ur full. This way you can eat whatever you want but you'll still be confident that this is the healthy amount of food. No triggering counting! \n\nTry the book \"it's not about food\" or Google intuitive eating ",
          "created_utc": 1526469071.0
        },
        {
          "id": "e0o6qq5",
          "author": "november1999",
          "body": "The problem is that when you have anorexia, bulimia, binge eating disorder, intuitive eating isn’t really an option due to the nature of eating disorders. And by that I mean, the relationship with food is distorted and unhealthy, so the first and foremost thing is to address the underlying causes while following some sort of meal plan. And I’m saying this from my experience of being anorexic (hospital 3 times) for all of my adolescence (11 to 17) to having Bulimia/binge eating disorder, which caused me to gain over 50lbs in one year and become borderline overweight. Now, I’m glad to say that both of those problems are behind me for the most part, but when I suffered from the binge eating, “intuitive eating” was the gateway to almost a year of emotional eating. But now that I’m in a much better place mentally, I have lost the weight (but I’m not underweight again of course) and can comfortably eat intuitively as a (mostly) raw vegan.",
          "created_utc": 1528997912.0
        },
        {
          "id": "e0oeurs",
          "author": "None",
          "body": "I just feel as though the approach for treating eating disorders can in no way be streamlined among different and all individuals. \n\nThere is a lot of evidence (scientific studies, research, personal experience, hearing of others' experiences) that supports that intuitive eating does work for recovering from eating disorders. I am sure there is also a plethora of evidence to support that rigid meal plans also work.\n\nThe \"nature of eating disorders\" is common amongst all people with them, but in many ways is not common. Therefore, you saying that intuitive eating could not possibly work for ANYONE with ANY eating disorder is not true in my opinion. \n\nI am glad you found recovery in \"addressing the underlying causes\" and a meal plan. Truly. But intuitive eating can work for other people. Intuitive eating also seeks to address the underlying causes. Obviously you need to address underlying causes with any eating disorder if you want to recover. It seems you don't know what intuitive eating truly is. True intuitive eating is not a free for all \"oh Im allowed to binge now so let me do so every day\". \n\nSorry, this is the rudest thing I've ever responded to someone online. I just feel protective over intuitive eating, because it in its true form helped me a great deal. ",
          "created_utc": 1529005872.0
        }
      ]
    },
    {
      "id": "dz2f6rq",
      "author": "yyaaaaaasss",
      "body": "omg what app is this?! i’ve been looking for something like this for ages!",
      "created_utc": 1526469458.0,
      "score": 3,
      "context": [
        {
          "id": "dz2djn0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1526466307.0
        },
        {
          "id": "dz2ef8t",
          "author": "covhr",
          "body": "I would advise AGAINST counting calories when recovering from an eating disorder. \n\nWhat /u/yyaaaaaasss says is true. Consult a dietitian experienced in eating disorders. ",
          "created_utc": 1526468061.0
        },
        {
          "id": "dz2f30i",
          "author": "grundlegasm",
          "body": "Same here. Recovering bulimic who’s 30 lbs overweight and whenever I try counting calories it sends me into a spiral of restricting, then bingeing and purging. I did find an app that logs food but not calories, so you can see how much nutrition you’re getting. I would recommend something like that. ",
          "created_utc": 1526469274.0
        }
      ]
    },
    {
      "id": "e0ok3tw",
      "author": "None",
      "body": "Okay yes. When you put it that way I agree. Many people are physically in danger when they have an eating disorder. And many cannot physically register cues of satiety and hunger. In these cases of course someone should seek out a structured meal plan that ensures they have enough energy, nutrients etc. to live. \n\nBut after this period of physical endangerment/ it being impossible to know when to eat or stop, I think intuitive eating can be a very good strategy for many people when they are ready. \n\nI think basically we agree. ",
      "created_utc": 1529010462.0,
      "score": 2,
      "context": [
        {
          "id": "dz2eyvc",
          "author": "None",
          "body": "Try the \"intuitive eating\" strategy. This is the most non triggering eating method I've ever tried. It's all about eating when ur physically hungry and stopping when ur full. This way you can eat whatever you want but you'll still be confident that this is the healthy amount of food. No triggering counting! \n\nTry the book \"it's not about food\" or Google intuitive eating ",
          "created_utc": 1526469071.0
        },
        {
          "id": "e0o6qq5",
          "author": "november1999",
          "body": "The problem is that when you have anorexia, bulimia, binge eating disorder, intuitive eating isn’t really an option due to the nature of eating disorders. And by that I mean, the relationship with food is distorted and unhealthy, so the first and foremost thing is to address the underlying causes while following some sort of meal plan. And I’m saying this from my experience of being anorexic (hospital 3 times) for all of my adolescence (11 to 17) to having Bulimia/binge eating disorder, which caused me to gain over 50lbs in one year and become borderline overweight. Now, I’m glad to say that both of those problems are behind me for the most part, but when I suffered from the binge eating, “intuitive eating” was the gateway to almost a year of emotional eating. But now that I’m in a much better place mentally, I have lost the weight (but I’m not underweight again of course) and can comfortably eat intuitively as a (mostly) raw vegan.",
          "created_utc": 1528997912.0
        },
        {
          "id": "e0oeurs",
          "author": "None",
          "body": "I just feel as though the approach for treating eating disorders can in no way be streamlined among different and all individuals. \n\nThere is a lot of evidence (scientific studies, research, personal experience, hearing of others' experiences) that supports that intuitive eating does work for recovering from eating disorders. I am sure there is also a plethora of evidence to support that rigid meal plans also work.\n\nThe \"nature of eating disorders\" is common amongst all people with them, but in many ways is not common. Therefore, you saying that intuitive eating could not possibly work for ANYONE with ANY eating disorder is not true in my opinion. \n\nI am glad you found recovery in \"addressing the underlying causes\" and a meal plan. Truly. But intuitive eating can work for other people. Intuitive eating also seeks to address the underlying causes. Obviously you need to address underlying causes with any eating disorder if you want to recover. It seems you don't know what intuitive eating truly is. True intuitive eating is not a free for all \"oh Im allowed to binge now so let me do so every day\". \n\nSorry, this is the rudest thing I've ever responded to someone online. I just feel protective over intuitive eating, because it in its true form helped me a great deal. ",
          "created_utc": 1529005872.0
        },
        {
          "id": "e0oinov",
          "author": "november1999",
          "body": "I didn't mean to imply that intuitive eating is a recipe for binge-eating, I just meant that, as most/virtually all professionals at ED treatment centers would say, someone with a disorderd relationship with food and most likely their body would have a very hard time \"eating when it feels right\" after becoming accustomed to completely ignoring or even disabling the body's natural signals when it comes to satiety, hunger, etc. And trust me, this is coming from someone who tried intuitive eating multiple times despite professional recommendations, with the first two times involving me seeing no need to increase my caloric intake because I never felt \"hungry\" despite being underweight, and the other time resulting in the beginning of BED/BN. Both cases are extremely common and are part of the reason why at pretty much all treatment centers you're not allowed to eat \"intuitively.\" But of course, there is absolutely nothing remotely wrong with being an intuitive eater to maintain recovery. ",
          "created_utc": 1529009180.0
        }
      ]
    },
    {
      "id": "dz2paxs",
      "author": "queenoflights",
      "body": "Hey! I’m not the OP, but I use Recovery Record for logging food (as well as urges, moods, etc.) I’ve also heard good things about Rise Up. Both can be connected to clinicians as well! :)",
      "created_utc": 1526481464.0,
      "score": 4,
      "context": [
        {
          "id": "dz2djn0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1526466307.0
        },
        {
          "id": "dz2ef8t",
          "author": "covhr",
          "body": "I would advise AGAINST counting calories when recovering from an eating disorder. \n\nWhat /u/yyaaaaaasss says is true. Consult a dietitian experienced in eating disorders. ",
          "created_utc": 1526468061.0
        },
        {
          "id": "dz2f30i",
          "author": "grundlegasm",
          "body": "Same here. Recovering bulimic who’s 30 lbs overweight and whenever I try counting calories it sends me into a spiral of restricting, then bingeing and purging. I did find an app that logs food but not calories, so you can see how much nutrition you’re getting. I would recommend something like that. ",
          "created_utc": 1526469274.0
        },
        {
          "id": "dz2f6rq",
          "author": "yyaaaaaasss",
          "body": "omg what app is this?! i’ve been looking for something like this for ages!",
          "created_utc": 1526469458.0
        }
      ]
    },
    {
      "id": "dz2qw7i",
      "author": "yyaaaaaasss",
      "body": "thanks!!",
      "created_utc": 1526482875.0,
      "score": 1,
      "context": [
        {
          "id": "dz2djn0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1526466307.0
        },
        {
          "id": "dz2ef8t",
          "author": "covhr",
          "body": "I would advise AGAINST counting calories when recovering from an eating disorder. \n\nWhat /u/yyaaaaaasss says is true. Consult a dietitian experienced in eating disorders. ",
          "created_utc": 1526468061.0
        },
        {
          "id": "dz2f30i",
          "author": "grundlegasm",
          "body": "Same here. Recovering bulimic who’s 30 lbs overweight and whenever I try counting calories it sends me into a spiral of restricting, then bingeing and purging. I did find an app that logs food but not calories, so you can see how much nutrition you’re getting. I would recommend something like that. ",
          "created_utc": 1526469274.0
        },
        {
          "id": "dz2f6rq",
          "author": "yyaaaaaasss",
          "body": "omg what app is this?! i’ve been looking for something like this for ages!",
          "created_utc": 1526469458.0
        },
        {
          "id": "dz2paxs",
          "author": "queenoflights",
          "body": "Hey! I’m not the OP, but I use Recovery Record for logging food (as well as urges, moods, etc.) I’ve also heard good things about Rise Up. Both can be connected to clinicians as well! :)",
          "created_utc": 1526481464.0
        }
      ]
    }
  ]
}