{
  "id": "8lm7eg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1527103917.0,
  "title": "Request: How do you stop thinking constantly about the calories in food?",
  "selftext": "How do you stop thinking constantly about the calories in food? If i look at an apple I just think 60 calories, if I look at a cup of yogurt I think 120 calories. I'm constantly doing math in my head and constantly worried about my intake. I'm sure this is just a part of having disordered eating (I've never been diagnosed, but I've always been obsessive). Any tips on how to work through this and eventually move on would be amazing. Some things I'm trying and they're sort of working (except I still do the math) are mindful eating, and allowing myself to have treats because I do workout and know that I need to eat more.\n\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/8lm7eg/request_how_do_you_stop_thinking_constantly_about/",
  "score": 45,
  "num_comments": 8,
  "comments": [
    {
      "id": "dzgv9hq",
      "author": "FuzzyPrettyFace",
      "body": "I still think like this sometimes. But I do it less often now than I used to. \nOne of the things that helped for me was making everything an unknown number of calories. Like, instead of getting yogurt cups, get a big container then don’t measure servings. Or buy apples of drastically different sizes. Cook from scratch and don’t measure ingredients. Can’t do the math if you don’t know how much you’re eating! ",
      "created_utc": 1527111998.0,
      "score": 27,
      "context": []
    },
    {
      "id": "dzh002r",
      "author": "Mnemophobic",
      "body": "Learning serving sizes helped for me. Knowing how many servings of each food group I needed in a meal, then learning how to eyeball a serving size using my hand\\(s\\) as reference. Once I've done that, I know I have a proper amount of food on my place, and I can use mindful eating to know when I'm satiated \\(since sometimes I need just a little bit more or less, depending on various factors\\).\n\nNow, being able to do that didn't necessarily stop my brain from tallying calories, but it did help me get to a point where I don't feel that I \\*need\\* to be counting calories, even if my brain is doing it automatically. The other thing that's important is stopping yourself when you start adding calories together. So, just because you look at a food and your ED screams a number, you can train yourself to stop adding all the numbers together in a meal/in a day. That's what helped me get to a point where I still know all the calorie amounts and have a fleeting thought about it when preparing food, but it doesn't effect my consumption/how I feel/what I eat/what I eat later, etc. ",
      "created_utc": 1527116657.0,
      "score": 4,
      "context": []
    },
    {
      "id": "dzgyldz",
      "author": "juniorasparagus13",
      "body": "The treatment center I go to has us do the exchange system instead of target calories. I also go through and slap duct tape on all my nutrition labels. But that doesn’t stop the fact that I already knew exactly how many calories were in the boost they gave me this morning. I just try to process the feelings and reappraise negative thoughts.",
      "created_utc": 1527115221.0,
      "score": 3,
      "context": []
    },
    {
      "id": "dzhm99j",
      "author": "RadioActiveXSmile",
      "body": "The previous comments are all great and you should give ‘em a go. On the CBT and emotional side: pick apart those thoughts and the feelings that stem from them. Here’s how I would think through eating an apple.\nImmediate thought: 60 calories. Picking part: Why does 60 calories matter? Why should I care? Because I need to know and control my intake. I don’t NEED to know this. The numbers don’t matter. My body might not even get 60 calories out of this could be more or less. The numbers aren’t THAT accurate even when measured by weight. Bodies process everything differently. Even if it was 100% accurate I’ll feel satisfied when I’m finished eating it. It’s about how I feel and that number will not control me. I’m too cool to let calories consume me.\n\nAlso when I get thoughts that I’m trying to get out of the habit of having or stopping a thought spiral in its tracks: Take a freeze frame image of that thought. Picture a big eraser and erase that image away. Then distract. It has helped me out of a lot of scary thought situations and OCD stuff.\n\nBest o’ luck!🍀",
      "created_utc": 1527141024.0,
      "score": 4,
      "context": []
    },
    {
      "id": "dznn2fg",
      "author": "to-whatever-end",
      "body": "Something I've found really helpful is trying to consume more fruits and veggies, specifically those purchased without detailed packaging. Basically, when I get groceries I rely a lot on the fresh produce sections of stores or, when available, farmers' markets. While I still struggle sometimes from the fact that I had previously memorized the calories in certain portions of fruits and veggies when I wasn't in recovery, I find it really helpful to lean toward any options that don't come with labels on them that give calorie details. Also, if you have stomach/digestive issues of any kind (I myself struggle from them as a long-term side effect of my eating disorder), fruits and veggies are really helpful in the sense that you can snack on them all throughout the day in smaller portions instead of trying to just make and eat just 3 bigger meals with little to no snacks (especially if bigger meals can be a bit more intimidating at first and also if you don't have time to cook fruits and veggies are easy to find, cheap to buy, and just generally easier to carry around as snacks throughout the day to school and or work, etc). \n\nI hope what I've said makes sense and helps in some way. Recovery can be a long process that involves some trial and error to find out what works best for you. ",
      "created_utc": 1527427821.0,
      "score": 2,
      "context": []
    },
    {
      "id": "dzhzzps",
      "author": "panfuneral",
      "body": "In inpatient treatment, they had us work with USDA (I think) serving sizes rather than calories. They were called exchanges. Depending on our meal plans we needed a certain number of carbs, proteins, fats, fruits, vegetables, and dairy. Some of them were measured out (like yogurts that came in packages) but with most things they encouraged us to approximate, like how a tablespoon of peanut butter (one fat exchange) is about the size of a thumb. There are lots of charts and graphics online that you can use to estimate serving sizes! The point of it is that you should be able to be less rigid about the exactitude of your intake, as long as you’re getting enough for your body.",
      "created_utc": 1527166723.0,
      "score": 1,
      "context": []
    },
    {
      "id": "dzhatht",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1527127340.0,
      "score": 20,
      "context": [
        {
          "id": "dzgv9hq",
          "author": "FuzzyPrettyFace",
          "body": "I still think like this sometimes. But I do it less often now than I used to. \nOne of the things that helped for me was making everything an unknown number of calories. Like, instead of getting yogurt cups, get a big container then don’t measure servings. Or buy apples of drastically different sizes. Cook from scratch and don’t measure ingredients. Can’t do the math if you don’t know how much you’re eating! ",
          "created_utc": 1527111998.0
        }
      ]
    },
    {
      "id": "dzia36e",
      "author": "arl1286",
      "body": "This is super helpful for me. I don't look at it as \"150 calories of rice\", I look at it as \"a serving of rice.\" I stopped counting calories almost 3 years ago and I still struggle with keeping a mental tally, but it's getting much better.\n\nBasically doing anything to distort the caloric content... Eating out is helpful for this because you can estimate but you really have no idea how many calories are in something prepared at a restaurant. I also cook a lot of things in bulk to share with my boyfriend, or to split across a couple of days for lunches. That helps. I basically understand that a tupperware of some sort of rice/veggie bowl (I eat vegan at home) is sufficient for a lunch, and I try not to think more into it.",
      "created_utc": 1527176685.0,
      "score": 1,
      "context": [
        {
          "id": "dzh002r",
          "author": "Mnemophobic",
          "body": "Learning serving sizes helped for me. Knowing how many servings of each food group I needed in a meal, then learning how to eyeball a serving size using my hand\\(s\\) as reference. Once I've done that, I know I have a proper amount of food on my place, and I can use mindful eating to know when I'm satiated \\(since sometimes I need just a little bit more or less, depending on various factors\\).\n\nNow, being able to do that didn't necessarily stop my brain from tallying calories, but it did help me get to a point where I don't feel that I \\*need\\* to be counting calories, even if my brain is doing it automatically. The other thing that's important is stopping yourself when you start adding calories together. So, just because you look at a food and your ED screams a number, you can train yourself to stop adding all the numbers together in a meal/in a day. That's what helped me get to a point where I still know all the calorie amounts and have a fleeting thought about it when preparing food, but it doesn't effect my consumption/how I feel/what I eat/what I eat later, etc. ",
          "created_utc": 1527116657.0
        }
      ]
    },
    {
      "id": "dzhyspu",
      "author": "None",
      "body": "I love the idea of taping over the nutrition facts thats brilliant!",
      "created_utc": 1527165248.0,
      "score": 1,
      "context": [
        {
          "id": "dzgyldz",
          "author": "juniorasparagus13",
          "body": "The treatment center I go to has us do the exchange system instead of target calories. I also go through and slap duct tape on all my nutrition labels. But that doesn’t stop the fact that I already knew exactly how many calories were in the boost they gave me this morning. I just try to process the feelings and reappraise negative thoughts.",
          "created_utc": 1527115221.0
        }
      ]
    }
  ]
}