{
  "id": "8q1y1p",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1528648396.0,
  "title": "Request: Recovery Finally",
  "selftext": "My wife has had an ED since she was 13.\n\nWe’ve had a hard road with it, but she’s resisted a intensive treatment. We tried very hard for years to “do it ourselves”, but at best had moderate success, usually temporary.\n\nShe finally kind of hit rock bottom, and agreed to go into an inpatient program about 3 weeks ago. She’s been taking it incredibly seriously, and is working harder on this than she has on anything else I’ve seen her do. She looks, sounds, and feels alive for the first time in a long time.\n\nIt’s lonely, but we have visiting hours about 4 days a week. The program is lovely, and provides great support.\n\nTangentially, we closed on a house at the same time, and so she’s excited to not have to move, but also, I’m excited she gets a clean break and a new start. The night before being admitted was the last time she will ever be in the old place.\n\nShe’s described her ED as almost its own entity, and kind of like a voice in her head. For years “it was [her] only friend.” I’ve told her this is a demon, it will say anything to kill her. Today she gets her first pass and will see the new place all moved into. We are going to sage the house; we are going to exorcise that motherfucker.\n\nI just wanted to share something happy.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/8q1y1p/request_recovery_finally/",
  "score": 74,
  "num_comments": 7,
  "comments": [
    {
      "id": "e0ftbru",
      "author": "minayylmao",
      "body": "this is so beautiful thankyou so much ",
      "created_utc": 1528649359.0,
      "score": 9,
      "context": []
    },
    {
      "id": "e0g6yph",
      "author": "lime_green_galaxy",
      "body": "I’m so happy for both of you — thanks for sharing.  Would you mind sharing a bit more (in a PM is fine if you’re more comfortable) about how and why she realized inpatient was inevitable?  \n\nI truly can’t help but wonder if a more intensive (if not impatient) program is in my future, seeing how incredibly long I’ve struggled and battled and just had a horrendous time with ED and disordered eating/thinking, and it would help to hear another person’s story about what ultimately led them to seek more help.",
      "created_utc": 1528663195.0,
      "score": 4,
      "context": []
    },
    {
      "id": "e0g870x",
      "author": "billie-the-girl",
      "body": "I am soo happy she is getting better. her ED could have seriously killed her, so thankfully it didn't. I wish her the best and hope she recovers",
      "created_utc": 1528664442.0,
      "score": 4,
      "context": []
    },
    {
      "id": "e0fu43s",
      "author": "Luna_Soleil",
      "body": "Lovely! Very Happy for you two. She’s super lucky to have your support ",
      "created_utc": 1528650169.0,
      "score": 3,
      "context": []
    },
    {
      "id": "e0go3i1",
      "author": "lolikittenv",
      "body": "I was diagnosed with bulimia at a young age from sexual abuse. I’ve had it for nearly 14 years now. It’s definitely like a different entity. I’m doing better, moving for better opportunities and eating much better. Thanks for sharing I’m so glad she is doing better. ",
      "created_utc": 1528681812.0,
      "score": 3,
      "context": []
    },
    {
      "id": "e0fw2pq",
      "author": "WhiteHotWombat",
      "body": "Best of luck to you guys. ",
      "created_utc": 1528652184.0,
      "score": 2,
      "context": []
    },
    {
      "id": "e0h3hba",
      "author": "JessMess86",
      "body": "Very happy indeed! 💕",
      "created_utc": 1528702717.0,
      "score": 1,
      "context": []
    }
  ]
}