{
  "id": "9gepcc",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1537135952.0,
  "title": "Request: feeling the need for every meal to be “perfect”",
  "selftext": "Does anyone else feel the need or desire for all their meals to be “perfect?” Like it has to be the right time to eat, you have to have measured the correct amounts of whatever you’re eating, take a certain amount of time to eat and not be interrupted or disturbed while eating? This makes me sound crazy maybe, and I’m reasonably flexible day to day with most of my meals, but I just prefer if I’ve planned everything “perfectly” and all goes according to plan. Breakfast at 8, lunch at 12, snack at 3, dinner at 7, etc and I get to eat exactly how much I want with out anyone asking for any of what I’ve alreadg measured... I’m recovering from an ED and eating the right amount of calories, but this perfectionism about food and not wanting it to be interrupted or derailed is definitely the hardest thing to shake. Does anyone have advice for me?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/9gepcc/request_feeling_the_need_for_every_meal_to_be/",
  "score": 58,
  "num_comments": 12,
  "comments": [
    {
      "id": "e63muc0",
      "author": "rebeljammer",
      "body": "I wish I did. I feel this way a lot. You’re not alone! The one thought that helps is if you ever have a bad meal, just remember you can always have a better one tomorrow. Because you’re in recovery you WILL HAVE a tomorrow and that’s a beautiful thing. ",
      "created_utc": 1537137609.0,
      "score": 7,
      "context": []
    },
    {
      "id": "e64am1i",
      "author": "houston_veronica",
      "body": "I really agree/echo the sentiment that your body subconsciously sees this as a sacred opportunity; it's so accustomed to not eating often or well, that it sees food as a commodity to be cherished. That, to me, is why you want the situation to be perfect. The best remedy is to keep eating often, and never, ever miss meals or your meal plan if you have one. If you are undereating, your body is still thinking it needs to protect whatever it can get, so your brain reads this as \"do not let anyone/thing get in the way of this!\".  \n\nJust keep eating your nourishing meals per the refeeding plan, and remember: you are going to eat again in a short while. There is going to be a snack or meal just around the corner, and nothing will take this away from  you. ((hugs)) I understand.",
      "created_utc": 1537164061.0,
      "score": 6,
      "context": []
    },
    {
      "id": "e63piq1",
      "author": "AlcatK",
      "body": "Do you have someone that you can talk to about this? Sounds a lot like my Ed, and I have orthorexia, which is a lot of being perfect in everything regarding food. You may benefit from bringing this up to a therapist. Best of luck!",
      "created_utc": 1537140076.0,
      "score": 5,
      "context": []
    },
    {
      "id": "e641ksp",
      "author": "m592w137",
      "body": "I definitely had this at the beginning and first month or so of my recovery! Honestly it just took time and food and some weight gain and  it has mostly gone away. The need to ritualize and make sacred the food is a part of malnourishment and the refeeding is bringing that to the forefront. Also after awhile life will start to get in the way of those rituals rather than them getting in the way of life. I wish you the best of luck! Feel free to pm if you ever need support. ",
      "created_utc": 1537152059.0,
      "score": 3,
      "context": []
    },
    {
      "id": "e64fd40",
      "author": "Pollyhotpocketposts",
      "body": "Cognitive behavioral therapy if you can find it",
      "created_utc": 1537173591.0,
      "score": 2,
      "context": []
    },
    {
      "id": "e64ky4n",
      "author": "giulynia",
      "body": "I can't really advise, I can just tell you that I have gone through similar and I am still in a place where I heavily prefer to cook myself and I get irrationally upset if food I decided to eat is prepared badly. Keep up the good work. The remnants of your ED are going to slowly fade away bit by bit until it takes a post like yours to even remind you that you still have leftovers from past behaviors. Don't lose hope :)",
      "created_utc": 1537184957.0,
      "score": 2,
      "context": []
    },
    {
      "id": "e650mam",
      "author": "mrmikedude100",
      "body": "I don't have anything of value to really say but I wanted to say this. \n\nI'm very grateful to have discovered this subredit and most particularly this post. While I hate seeing anyone go through any of this it makes me feel less like a weirdo knowing that I'm not alone. \n\nI hope things become easier and better for you. Your hard work and dedication is going to payoff. :) ",
      "created_utc": 1537201049.0,
      "score": 2,
      "context": []
    },
    {
      "id": "e656f0d",
      "author": "lolikittenv",
      "body": "I feel this every single time for years. Honestly I just push through it and eating around people that care about me distracts these thoughts a bit too. ",
      "created_utc": 1537205868.0,
      "score": 2,
      "context": []
    },
    {
      "id": "e66esl7",
      "author": "not_cinderella",
      "body": "OP here: update for everyone still reading this and feeling this way - [this little blog post](http://immaeatthat.com/2017/07/03/eating-boring-and-unexciting-food/) is a great, reassuring read :) ",
      "created_utc": 1537246389.0,
      "score": 1,
      "context": []
    },
    {
      "id": "e68uayk",
      "author": "7less",
      "body": "Yes! You are basically protecting yourself from failure and growth at the same time.  I also spent time in this awkward stage in recovery!\n\nAfter a while I decided to put aside the food scales, meal prep containers, and rigid eating times and even my dietician made meal plan. \n\nIt might take you a while but always push yourself. A big thing for me was variety. I ate the same thing at the same time for years! Don’t be me. It’s not as fun as I thought it was. \n\nBesides variety I recommend listening to your body. I spent years telling my body what to eat without actually listening to how hungry it was. \n\nAlso therapy!\n\nIt’s gonna take time and you will mess up. When you are having even your darkest days remember that we only have so much time. Life is too short!",
      "created_utc": 1537347380.0,
      "score": 1,
      "context": []
    },
    {
      "id": "e6opdgc",
      "author": "None",
      "body": "I don't know if this counts or not (I'm a binge eater btw) but I have trouble eating anywhere but my bed. If I pick up food I wait until I get home to begin eating and won't even let myself touch it until I can binge on it all. Also my meals have to include a variety of foods or I won't be satisfied. So I'll have to get multiple different foods with different tastes/textures etc. and always need a drink and a dessert. Sigh. ",
      "created_utc": 1537986613.0,
      "score": 0,
      "context": []
    }
  ]
}