{
  "id": "9uk1x3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1541469292.0,
  "title": "Request: How Do You Deal With People Celebrating Your Weight Loss?",
  "selftext": "I was overweight when I first started restricting, and I'm currently at a healthy weight, if it matters. The problem is, people keep telling me that I look great, they're so proud of me, or what's my secret, they wish they could do what I did, etc. This happens both with people who don't know I was anorexic and people who do know. I just have no idea how to react. I hate the idea of saying thanks when someone compliments me on the weight loss, and it feels uncomfortable to lie and say \"just diet and exercise!\" when someone asks me how I did it. I really don't wanna make a big deal out of it or tell people I don't know that well about my history, so I need help navigating these comments.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/9uk1x3/request_how_do_you_deal_with_people_celebrating/",
  "score": 40,
  "num_comments": 12,
  "comments": [
    {
      "id": "e9516nr",
      "author": "zikaflikaflame",
      "body": "I’ve told people. Flat out. “Actually, I struggle with bulimia. I don’t recommend it.”\nNot to be shock-ey, but so more people are aware that eating disorders come in all shapes and sizes and manifestations.\nI’m sick of hiding in the darkness alone.",
      "created_utc": 1541475539.0,
      "score": 52,
      "context": []
    },
    {
      "id": "e962c4y",
      "author": "Lilith-Rising",
      "body": "I’m going to start telling people the truth, that it’s restrictive eating disorder helping me lose weight. Maybe if we told the truth people would get the hint it’s inappropriate to comment on people’s bodies and congratulate weight loss unless prompted, because people could be losing weight because they’re sick or dying, it’s not uncommon. I don’t say thanks. I say “You think so?” And tell them I have a history of ED. Then they feel slightly embarrassed, which is good because they will think twice at the next poor lass they want to “congratulate.”",
      "created_utc": 1541523284.0,
      "score": 15,
      "context": []
    },
    {
      "id": "e94vh3r",
      "author": "caketherapy",
      "body": "It depends on how close you are to them. If it's someone close who doesn't know you're anorexic, maybe you tell a little more truth like, \"You know, I was way too strict with myself to lose this much weight. I'd rather try a healthier way going forward.\" With close people who do know you're anorexic, maybe say, \"Thanks for the compliment but I need support from you to be healthier with myself.\" With strangers, I think you can just say thanks and move on. You're not thanking them for celebrating the WAY you lost the weight, just that they are noticing you and trying to connect with you. ",
      "created_utc": 1541470411.0,
      "score": 18,
      "context": []
    },
    {
      "id": "e94x3bs",
      "author": "tiredgurl",
      "body": "I lied to a nurse once who kept asking how I did it. Said ping pong. Straight faced. She looked at me confused and said hmm... I'll have to try it... Ok lady. Have fun. 🥴\nEdit: I can't spell ",
      "created_utc": 1541471838.0,
      "score": 13,
      "context": []
    },
    {
      "id": "e94uoqf",
      "author": "ballerina_inprogress",
      "body": "This happens to me too :( People always want to know my secret and how I did it and wow you look so small etc. etc. It makes me so uncomfortable, and I always say the same thing- diet and exercise! Protein shakes and pilates! That makes me feel bad though because some of them are overweight and really want to get in shape and I feel like that is misleading information but I can't just tell them I starve myself obviously. I am also at a healthy weight, but gained a ton of weight from a 3 year binge cycle which I have lost. So its not like I look like a skeleton- I HOPE they would be concerned if that were the case, not saying congrats like they do now. I don't really know how to deal with it either, so I don't have an answer to your question, but I can relate <3 ",
      "created_utc": 1541469709.0,
      "score": 6,
      "context": []
    },
    {
      "id": "e951zon",
      "author": "daisyandrose",
      "body": "I feel this so hard. It’s especially rough when they know what you did to get there. I had an ex, the day that I finally broke down and told him about it when I was 110 pounds (5’9”), and he said he was upset after me and him broke up for the first time cause I started to lose weight and that I looked so good then. He also commented on my recovery about how much weight I gained ",
      "created_utc": 1541476306.0,
      "score": 5,
      "context": []
    },
    {
      "id": "e95tdxt",
      "author": "Caketryahaim",
      "body": "Urgh. This happens to me too... including some really disgusting comments that make my skin crawl. \n\nHow do I deal with it? I smile and nod, giving vague answers and trying to change the subject. Then I restrict even harder, because it further enforces the \"self worth = body fat %\" mantra in my head. \n\nIt's just so unbelievably fucked up. I hate being in public now. I hate people looking at me and weighing up how hot I am in their heads. I'm a fucking mess.\n\nI know this isn't helpful, but I sympathize. ",
      "created_utc": 1541516159.0,
      "score": 5,
      "context": []
    },
    {
      "id": "e953o2j",
      "author": "None",
      "body": "((internet hugs))\n\nI told them as much of the truth as they could handle. I thanked them, and said I exercised more, and ate fewer refined carbs (flour products and sugar). \n\nIf they press the issue, I recommend they check in with their healthcare provider so that he or she can look over any diet plan they had in mind.  I only discuss gritty details with my closest recovery friends. \n\n\n",
      "created_utc": 1541477948.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eb9yc8e",
      "author": "hushtula",
      "body": "a girl i went to high school with and worked the same job with came to visit me when i was living in NJ. i had previously moved from where we had been friends at (by about 6/8 months). before i had moved, i weighed about 110 lbs at 5’4/ 5’5. i had a flat stomach. i had toned legs, thanks to dancing at home every day and night, as well as walking for hours and hours during the day at car shows multiple times a week. my body was beautiful. i wasn’t underweight, though some would argue. but, whatever. \ni became a heavier smoker in NJ. i started eating more again, because i was high all the time and had the munchies, you feel? \ni remember when she came to visit. she said “you look good, you look different”. and i could tell off the bat what that meant. not long before she came to visit, i began feeling insecure about my weight again. i was at 125/130 at that time, and that was the most i had weighed since HS. (at this time, during this visit, i was 19, almost 20). \nlet’s set that aside. \n\ni moved down to GA later that year. i was about to move again- this time, out west. she randomly showed up to my house which is about nine hours from her own, to surprise me, and to help me make my move. \nside note, of which is irrelevant but shows you that she’s kind of shitty: she only came to NJ because she needed a concert ticket out of her hands and money in place of it. as well as a place to stay, and another car to utilize so that she wouldn’t have to put more miles on the rental car. \nused. \nnow this time, she’d been wanting to go visit the place i was moving to since before i had even the slightest idea i was moving there. \nshe wasn’t here to be my friend. not entirely. i believe and know a small portion was for that, but not the priority. \ntruthfully, i didn’t want her to come. \ni didn’t need the help. \ni’ve moves more times in my life than anyone i’ve ever met, and i wish that that was an exaggeration. i’m a fucking pro ok \n\ngoing back now. \nwithin the first half an hour of her being in my packed up home, she looks at me and goes “damn girl, you’ve lost a lot of weight! you’re looking way better than when i saw you up north”. \n\n\nshe didn’t know. \n\n\ni never told her that i began passing out a couple months ago. \nshe didn’t know i was starving myself. \nshe didn’t know i lived alone and had even more fear consume me about my collapsed, forfeited body on my floors. \nshe didn’t know my mom cried the first time it happened, and then came over the next morning and made breakfast... in my own kitchen- something i had never done after living in that house for a year. \nshe didn’t know that after that first time passing out, after telling my mom about that first time, that my mom no longer gave a shit about the second time i passed out. not the second time, not the third, fourth, or, to keep it short- the twelfth time i had passed out. \nin an empty home. \njust my dog, and i. \nno neighbors in sight with the exception of one across the street. \nno one to find me, and wake me up but my precious dog. \nshe didn’t know how much physical pain it took to lose almost thirty pounds within 5 weeks, tops. \nshe didn’t know how my mind consumed my body.... literally. \nshe didn’t know i didn’t care to make myself eat, even with all of these factors. \nshe didn’t know how much more difficult it was, because of exactly that. \nshe\ndidn’t\nknow\nshit. \nin fact, she never even bothered to ask how i did it. \nno encouragement, had i have had done it in a healthy manner. \nno concernment for the possibility that i dropped weight too quickly, or too much due to starving myself. \njust a simple compliment. \n“compliment”.\n\ni didn’t know what to say.  i didn’t know what to do, feel, think.\njust had to remind myself that, though were the same age, she’s naive, and young, and immature. no depth to her adolescent mind. \nso i let it go. \ni smiles and said, “yeah dude, right? thank god. it was the weed man, telling you, hahaha”\nand even then, with that comment having been made back to her... still didn’t ask the obvious question: “well, did you sober up?” \nnothing. \nshe literally, simply, changed the topic on how excited she was to see something off of the east coast. \n\n\nnow a days, when anyone, at any point in time comments on my weight-\nwhether it is:\n• “you lost weight”\n• “you’ve gained weight”\n• “you’re looking better”\n• how did you lose that weight”\netc. \n\ni answer abruptly with, “i have an eating disorder so it makes weighing in at 108 lbs (what i’m at currently) just that much easier. nonetheless, i’m stressed. like, all of the time. so. that helps. i also get exercise by running from my problems and staying hydrated.” \n\nthat’s it. \nthat’s all it takes for them to realize that they are a fucking douche wad for even thinking it was okay to be talked about. \nbecause, here’s the thing- and this thing goes for a whole lot of things: \nyou don’t know. \nyou don’t know what someone is going through. \nyou don’t know there train of thoughts, or how it changes and varies, depending on mood, sometimes the weather, a day at work, a poor evening with a significant other or family member. \nyou. do. not. know. \nyou can guess. you can assume. you may know that person a good amount. you may have known them since the first grade. and guess what? \nyou don’t know. \nyou don’t know what’s going on behind closed doors, behind their eyes, inside of their spirit, body, mind, heart. \n\npeople have got to become more aware of this. people have got to quit ignoring this. people must stop and think before they spew out words, and don’t taste them first. \nso, you train people. \ni promise you, when i give anyone that answer of which i shared with you all.... they’re not going to make that dumb ass, mindless comment to someone else. \nsure as hell not to me, \nguaranteed. \n\nwe don’t deserve to be reminded of our pain from someone who is ignorant to it. \nnot only to “it”, but to ignorance in general. \n\ngive them the straight, cold, abrasive answer. \n“i don’t eat. that’s how i look ‘ this good ‘ . \n\n\nin closing, i just want to pass on a quote i read once somewhere. \nit goes as follows: “it’s funny to me that when we see ribs and can count fingers on spines on animals, we say ‘ that animal is sick ‘ . when we see it on humans, it’s considered ‘beauty’.\n\n",
      "created_utc": 1544168912.0,
      "score": 2,
      "context": []
    },
    {
      "id": "e97yxez",
      "author": "ksck135",
      "body": "I'd probably go with 'counting calories' and have a little laugh inside. I know EDs are no joke, but it helps me cope.",
      "created_utc": 1541592114.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eb09aif",
      "author": "brook-k",
      "body": "Many moons ago it would REALLY piss me off when people praised my emaciation, but nowadays it’s easy to let roll of my shoulders. They’re either ignorant or lying (as a lot of people do when they they’re uncomfortable, ie. “I love that hair color” when in reality they look wack). When people would ask what I do to maintain my weight I always respond immediately that I’d like to gain weight, I just struggle in reaching that goal. I also make a point to highlight how out of shape I am, bc slender does not equal healthy. I don’t want to perpetuate the idea that this is admirable. \n\nPeople say those things to you in large part because the diet culture is so pervasive, and because so many genuinely need to slim down a little. I used to weight 200 pounds and then one day I turned up 100, so I just gotta accept those questions and comments will happen. ",
      "created_utc": 1543854319.0,
      "score": 1,
      "context": []
    },
    {
      "id": "e94vf38",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1541470365.0,
      "score": 0,
      "context": []
    },
    {
      "id": "e962g1t",
      "author": "Lilith-Rising",
      "body": "Fuck yes!! This is what will change minds and culture. Hard truths.",
      "created_utc": 1541523366.0,
      "score": 13,
      "context": [
        {
          "id": "e9516nr",
          "author": "zikaflikaflame",
          "body": "I’ve told people. Flat out. “Actually, I struggle with bulimia. I don’t recommend it.”\nNot to be shock-ey, but so more people are aware that eating disorders come in all shapes and sizes and manifestations.\nI’m sick of hiding in the darkness alone.",
          "created_utc": 1541475539.0
        }
      ]
    }
  ]
}