{
  "id": "9vzsti",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1541899271.0,
  "title": "Request: How do you deal with having your photos taken?",
  "selftext": "I very rarely take photos of myself and I avoid situations where I'd have to let other people do that. However, sometimes that's difficult to refuse - e.g. my boss has recently hired a professional photographer to take shots of all of the employees for the company website.\n\nI'm in full-panic mode because I know I'm going to be triggered when I see these. Photos are a lot like scales to me; I know I'm at a much healthier weight now than I used to be, but I can't deal with that reality yet. I start obsessing over the way my collarbones and arms and thighs looked in older photos, where I was seriously ill, and feel the need to punish myself for losing self-control.\n\nMoreover, these photos are going to be up on the company website for God knows how long and I'm already freaking out that everyone will get to see how much I've let myself go.\n\nI'm interested to hear your guys' opinions on the best methods or coping skills for handling these invasive thoughts?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/9vzsti/request_how_do_you_deal_with_having_your_photos/",
  "score": 43,
  "num_comments": 5,
  "comments": [
    {
      "id": "e9gtgvp",
      "author": "None",
      "body": "God, this post resonated with me so much. I hate seeing photos of myself, and don't even want people talking about my body. \n\nWhen I reacted negatively to people taking photos of me in the past, that just drew unwanted attention. So now I play it off like it's a big joke.  I smile, let them take their photos, and move on. If they try to show me the pictures afterward, I just unfocus my eyes or look off to the side. If they send me copies, I delete them. If they provide prints, I throw them away. \n\nI try to keep the focus on other people, and try to react in a somewhat bored manner about the whole situation. This picture thing is still incredibly difficult for me. ",
      "created_utc": 1541914322.0,
      "score": 26,
      "context": []
    },
    {
      "id": "e9gt3v4",
      "author": "iputmytrustinyou",
      "body": "I faced a similar situation a few years ago.  I refused to have my photo taken; as well as not allowing my name to be used publicly.  I framed my reason for refusing permission as a safety issue.  I have had an abuser try to contact me through social media.  It became necessary to delete accounts, and forbid friends and family from posing my pictures.  I did not want this person to be able to google my name, and find my work place.\n\nMy boss was upset and hurt that I didn’t want my picture and name not be company website and in a newspaper feature.  I did feel bad about that.  But I had and have a responsibility to take care of myself first and foremost....and you do, too.  \n\nYou have the right to say no.  It is your name and your picture.  You have a right to privacy.",
      "created_utc": 1541913867.0,
      "score": 6,
      "context": []
    },
    {
      "id": "e9gp15x",
      "author": "HexenbeistShade",
      "body": "I have struggled with my picture being taken since I a child to a point of serious escalation in my teens. Your words really resonate with me as I cannot see a photo of myself and not see unnecessary pounds. My solution so far is that when I know it’s coming (like on family trips where my mother in law never puts the camera down despite my protests), I can better prepare for the anxiety and then I work hard to never see the photos. I’m a healthy, fit person but photos trigger unnecessary negative thoughts. At work, I have kindly requested to not be photographed due to general dislike (not revealing the deeper reasoning) and my bosses typically obliged. Sometimes I can’t get out of it, but I mentally prepare for those moments (sometimes for days in advance) and again never look. We also have a website with pictures posted but I’ll bypass it in google but doing a direct search for what I need on the company site and not go to the home screen. It’s not much of a solution but it has helped. \n\nMy clothes fit well, I exercise often, and I can now look in a mirror after years of not being able to. Pictures reverse that so best to avoid for my own health. ",
      "created_utc": 1541909119.0,
      "score": 5,
      "context": []
    },
    {
      "id": "e9gposa",
      "author": "bluebandicute",
      "body": "People take photos because they want to see you. I usually just pose for the photo and when they ask if I want to see it, I say no. It’s partly my disordered brain that doesn’t want to see it, but really, nobody likes seeing themselves in pictures. So I say and turn it into a joke, like, “No, I always hate how I like haha”",
      "created_utc": 1541909799.0,
      "score": 3,
      "context": []
    },
    {
      "id": "e9h1pcy",
      "author": "houston_veronica",
      "body": "excellent advice...",
      "created_utc": 1541928459.0,
      "score": 3,
      "context": [
        {
          "id": "e9gtgvp",
          "author": "None",
          "body": "God, this post resonated with me so much. I hate seeing photos of myself, and don't even want people talking about my body. \n\nWhen I reacted negatively to people taking photos of me in the past, that just drew unwanted attention. So now I play it off like it's a big joke.  I smile, let them take their photos, and move on. If they try to show me the pictures afterward, I just unfocus my eyes or look off to the side. If they send me copies, I delete them. If they provide prints, I throw them away. \n\nI try to keep the focus on other people, and try to react in a somewhat bored manner about the whole situation. This picture thing is still incredibly difficult for me. ",
          "created_utc": 1541914322.0
        }
      ]
    }
  ]
}