{
  "id": "a1rf9q",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1543575067.0,
  "title": "Request: No more",
  "selftext": "I am done. I feel burned out, hopeless, helpless and loveless. Looking into the mirror I see a tired mare shadow of my former self. My hair, my teeth, my nails, my breasts ... it’s all messed up. Today I have decided to recover from bulimia. I have struggled with eating disorders for the past 10 years of my life (I recently turned 21), from bulimia specifically since nearly 7 years. I have tried recovery and therapy so many times. I did not work out. I am very scared and I don’t want to get fat, but this time ... I will do it. On my own. No matter how hard it is. No more excuses ... no more “ah only one time purging is fine”. I made up my mind. Wish me luck ...",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/a1rf9q/request_no_more/",
  "score": 42,
  "num_comments": 5,
  "comments": [
    {
      "id": "eas3h84",
      "author": "Down_B_OP",
      "body": "I'm proud of you. The first step is the biggest step, just remember how you feel right now. Whenever you get the urge to purge, think of it. It's hard, but you can do it.",
      "created_utc": 1543575429.0,
      "score": 9,
      "context": []
    },
    {
      "id": "easjqky",
      "author": "AndyF1069",
      "body": "You're taking a really brave step, but don't be afraid to reach out for support if you need it. You don't need to do this alone. \n\nBest of luck to you. ",
      "created_utc": 1543592968.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eas9jue",
      "author": "FreeLola",
      "body": "This is a huge step and something to be very proud of, but I urge you not to try and do it on your own.  It is possible, but it is so much easier if you can find some sort of support and accountability.  I know what you mean about that “shadow” feeling, but it is almost a blessing to be able to recognize and see that, because so many of us don’t.  I’ve lived in denial, and I’m sure you have too.  That’s when it takes over.  I truly wish you the best in your recovery.  You are important and worth taking care of.",
      "created_utc": 1543584040.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eau2cmn",
      "author": "None",
      "body": "I made a decision like this around 6 years ago when I finally decided to stop purging. It's been a long road with relapses and I still struggle with binge eating but it has overall been very freeing and I have never regretted the decision to stop. You deserve a long and happy life - good for you for having the courage to and bravery to want to make steps towards recovery. Sending lots of love and good vibes your way ❤",
      "created_utc": 1543638036.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eaxeiof",
      "author": "imnotagorl",
      "body": "You are so strong for taking this step towards recovery. Eating disorders will beat you down, scare you shitless, and take away so many of the things you love. Good for you for saying no, and just keep on saying no over and over again. It will be hard, but you got this.",
      "created_utc": 1543766577.0,
      "score": 2,
      "context": []
    }
  ]
}