{
  "id": "a2zjyq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1543919788.0,
  "title": "Request: Am I Faking An Eating Disorder?",
  "selftext": "It always feels like I don't actually have an eating disorder, I'm just faking everything, or a \"wannabe anorexic\" or whatever. Im 16F, diagnosed with anxiety and depression, and currently seeing a therapist. So for about 6 months now I've been heavily restricting, eating very little during the day but almost always ending up by binging at the end because I can't control myself. It makes me feel worse, which then makes me want to restrict more, etc... But ive barely lost any weight, so every morning when I restart restricting, it feels like I'm \"trying\" really hard to prove that I have self control and that I can be skinny, when really I'm just eating and eating and eating and just trying all over again. I don't know if that made sense but basically I just feel like nothings actually wrong with me, I just suck at weight loss.\n\n",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/a2zjyq/request_am_i_faking_an_eating_disorder/",
  "score": 49,
  "num_comments": 25,
  "comments": [
    {
      "id": "eb28ir4",
      "author": "None",
      "body": "this.....this is exactly what i’m dealing with right now.\n\nit’s nice knowing you’re not alone.",
      "created_utc": 1543921705.0,
      "score": 33,
      "context": []
    },
    {
      "id": "eb2aaak",
      "author": "oldpaintunderthenew",
      "body": "This falls right under the clinical definition of bulimia in my country. ",
      "created_utc": 1543924781.0,
      "score": 17,
      "context": []
    },
    {
      "id": "eb2ehqb",
      "author": "None",
      "body": "eating disorder = disordered eating, so yeah, you'd probably fall under bulimia/EDNOS. there's clearly something wrong with you, because your eating is fucked up and you're at least intending to lose weight by heavily restricting your calorie intake. ",
      "created_utc": 1543930199.0,
      "score": 13,
      "context": []
    },
    {
      "id": "eb2dxa2",
      "author": "None",
      "body": "I do this too. Sometimes I go weeks restricting, then binge for weeks. My weight fluctuates so much, I haven’t ever sought help though because it feels like they’d tell me to stop being silly about it. \n\nIt’s nice to know I’m not alone in feeling like this. ",
      "created_utc": 1543929567.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eb30i75",
      "author": "fableVZ",
      "body": "Don’t know how much help this will be since everyone is different, but I was the same way when i had anorexia. \n  \nI’d starve all day and binge at night, and never lost weight, but eventually I got to the point you’re shooting for and i held myself back from eating at night. After doing it once, I could do it everyday and I beg you not to do it. Food becomes disgusting.\n \nMy senior year of high school i quit the football team because of coach/school drama and weighed in at 205 (6’1”) of pure muscle. After not working out for a while it all started turning into fat and i began starving myself to lose weight. I dropped to 160 lbs at 6’1” in about 6 months. Not healthy with my build. I ate breakfast monday-wednesday-friday and that was it. \n \nI’m telling you this because the only reason i ate breakfast on those days were to keep my body moving, i almost passed out nearly every time i got out of my desk because i had no fuel. It’s not worth it to get there, if you want to lose weight do it in a healthy way. It’s better i promise (-: if you have any questions feel free to dm me, an eating disorder is so easy to develop when you’re self-conscious, but almost impossible to get out of. Sometimes all you need is someone, ANYONE to tell you to fix yourself, it was a complete stranger for me. ",
      "created_utc": 1543948237.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eb4oer7",
      "author": "_ThePalmtopTiger_",
      "body": "That absolutely falls under the parameters of an eating disorder. I struggled with similar issues and was diagnosed with \"Eating Disorder Not Otherwise Specified (EDNOS)\" a few years ago. I think they've taken out \"not otherwise specified\" diagnoses at this point in time, but whatever they're calling it now, it's definitely a real problem. \n \nYou're not faking. Your problems are valid. \n\nStarving yourself is never going to provide the results you want. When I was really starving myself, I did *not* look better. My skin and hair was dry and awful. Some of my hair even fell out. (Not fun, haha) I wasn't even happy with my body! I *looked* unhealthy, and I felt terrible.\n\nOne thing that helped me was educating myself on the nutrients/calories my body needs to be healthy and really taking control over the things I eat. You can refocus the energy you're using to restrict into developing a healthy eating plan. By making my own food, I can relax and know that things I'm eating are healthy. That way you don't feel guilty for eating and you don't build up that hunger that urges you to binge at night. \n\nIf you can see a nutritionist, I would highly recommend it. They can help make sure you're giving your body the nutrition it needs. Appointments with nutritionists generally aren't covered under insurance. However, some doctors have a nutritionist on staff and bill under the head doctors name so you only end up having to pay a co-pay. Doctors who practice \"integrative medicine\" are more likely to do something like this.\n\nAlso, it's very easy to find yourself feeling proud when you successfully restrict yourself from eating. Restriction is not something to be proud of. Your body *needs* food. Eating is *not* something that should make you feel guilty. If at all possible, make eating healthy and taking care of yourself your new goal/sense of pride.\n\nSorry for the mega-novel but I've gone through similar issues and I know how difficult it can be. However, you can definitely overcome this!",
      "created_utc": 1544003769.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eb2wixj",
      "author": "None",
      "body": "Im 24. My eating disorder started like this at 14.\nIt's never went. \nSeek help ",
      "created_utc": 1543945189.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eb2zvo6",
      "author": "None",
      "body": "Some key points. Eating disorders and depression have a comorbidity rate exceeding 60% if i recall. Also you don’t have to have an eating disorder to suffer from disordered eating. Sometimes what people struggle with does not neatly fit a particular set of criteria. You have described a problem, you agonise over eating on a day to day basis, that is real for you and it is real for us.\n\nAlso, one of depression’s greatest tricks is convincing you that you don’t really have any problems and that you are an imposter. This feeling of self doubt, that you can’t even do depression right, will ferry you to crisis faster than the depression by itself. Your experiences are real, you are suffering, this is real. You get to feel bad sometimes, and at times we have to feel bad, so if your mind tries to take that away from you, tell it to jog right on.",
      "created_utc": 1543947783.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eb54n3c",
      "author": "rosieco",
      "body": "Hey, this is a familiar story to mine when I was your age. I would restrict and have really disordered habits, as well as some strong body dysmorphia. I never looked unhealthy, or sickly thin, no matter how much I wanted to. Genetically, my body just couldn’t be the frail slip of a woman I wanted to force it into. It ended up saving me though. \n\nI was wrecking myself on the inside to try and change the outside, and after some time (and a long journey to self love) I realized that I was torturing myself for nothing. I wanted to feel the control an ED provided me, and I wanted somebody to recognize that I was fighting a demon, myself, and needed help. When that didn’t happen, it was hard. I felt like an ED poser, but looking back I recognize this was a gift! A hurtful and shitty gift, but nonetheless a gift to my future self. I got to work on and improve my relationship with food and myself before it was too late. \n\nI am standing a decade later, healthy and happy to be on this earth. It took a long time to get here, and there are still dark days/weeks, but I’ve crawled out of my hole and am filling it up shovel full by shovel full so I’ll never fall back in. I’m here if you want to PM me and talk. You are not alone. ",
      "created_utc": 1544022541.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eb94a2q",
      "author": "xorobinhood",
      "body": "Its important to remember that there are an array of ways in which eating disorders manifest. Not everyone has the same behavior or rituals. I've struggled for nearly a decade now, I'm 25M, and I have gone from overweight to underweight and back to overweight 4 times. I've gone from hospitalization for anemia and electrolyte deficiency to high blood pressure and cholesterol. Your experience is real. ",
      "created_utc": 1544140495.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eb3ei8e",
      "author": "catsbeforetwats",
      "body": "I feel you. I've never been diagnosed but I know I've definitely had a messed up relationship with food for around 14 years, but I can't stop binging which means I'm never 'thin enough to have a problem'.\n\nApparently, of all the categorised EDs, EDnos is one of the most dangerous because many people who have it aren't seen (by themselves or others) as having an issue because their body weight is in the normal range. So admitting you may have a problem is a huge step, so rather than feeling like you're fake you should be proud that you know there is an issue and you aren't in denial.",
      "created_utc": 1543958689.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eb3l5cl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1543963598.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ebojplq",
      "author": "None",
      "body": "You see a therapist, have them do an evaluation. You’re already there so just add it to their list of things to check on :)",
      "created_utc": 1544678106.0,
      "score": 1,
      "context": []
    },
    {
      "id": "elv6o2p",
      "author": "Sarah-McCrae",
      "body": "This sounds exactly like me in highschool and I’m telling you please continue to get help. It’s not fake. You’re not pretending. There is no “sick enough”. \nI did the exact same thing for years and if I had gotten help earlier on I would never have gotten to the dark place I was. \nI had doctors tell me I was fine, I had counsellors ignore me. \nSpeak up, tell people what’s going on and continue to look for help. Don’t let yourself fall deeper",
      "created_utc": 1556313499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eb2eakv",
      "author": "sugarcoatedpotato",
      "body": "Sounds like you're at the edge. You clearly suffer from disordered eating and your mindset is in a bad place. Denial, excuses and downplay are really common behavior, which can make things worse.\nPlease don't call yourself a fake, you might not have a clear eating disorder but you only do harm by bullying yourself.\n\nWhat holds you back from discussing this with your therapist? ",
      "created_utc": 1543929975.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eb3oe3d",
      "author": "Little_Bear716",
      "body": "Same. I restrict all day then binge at home after my partner is asleep. I feel like a fake because I’m still fat. ",
      "created_utc": 1543966034.0,
      "score": 5,
      "context": [
        {
          "id": "eb28ir4",
          "author": "None",
          "body": "this.....this is exactly what i’m dealing with right now.\n\nit’s nice knowing you’re not alone.",
          "created_utc": 1543921705.0
        }
      ]
    },
    {
      "id": "eb2ahk8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1543925091.0,
      "score": 4,
      "context": [
        {
          "id": "eb2aaak",
          "author": "oldpaintunderthenew",
          "body": "This falls right under the clinical definition of bulimia in my country. ",
          "created_utc": 1543924781.0
        }
      ]
    },
    {
      "id": "ehs1apk",
      "author": "flreyy22",
      "body": "When you were diagnosed with anorexia were you underweight? Also could you have days where you would want to recover and get better and feel okay with your body? Sorry to bother you i just really struggle with eating and i want to get help but i feel i am faking it and dont need/deserve the help because other people are a lot worse.",
      "created_utc": 1551720208.0,
      "score": 1,
      "context": [
        {
          "id": "eb30i75",
          "author": "fableVZ",
          "body": "Don’t know how much help this will be since everyone is different, but I was the same way when i had anorexia. \n  \nI’d starve all day and binge at night, and never lost weight, but eventually I got to the point you’re shooting for and i held myself back from eating at night. After doing it once, I could do it everyday and I beg you not to do it. Food becomes disgusting.\n \nMy senior year of high school i quit the football team because of coach/school drama and weighed in at 205 (6’1”) of pure muscle. After not working out for a while it all started turning into fat and i began starving myself to lose weight. I dropped to 160 lbs at 6’1” in about 6 months. Not healthy with my build. I ate breakfast monday-wednesday-friday and that was it. \n \nI’m telling you this because the only reason i ate breakfast on those days were to keep my body moving, i almost passed out nearly every time i got out of my desk because i had no fuel. It’s not worth it to get there, if you want to lose weight do it in a healthy way. It’s better i promise (-: if you have any questions feel free to dm me, an eating disorder is so easy to develop when you’re self-conscious, but almost impossible to get out of. Sometimes all you need is someone, ANYONE to tell you to fix yourself, it was a complete stranger for me. ",
          "created_utc": 1543948237.0
        }
      ]
    },
    {
      "id": "ecx63gf",
      "author": "Shantasticz",
      "body": "My thoughts exactly.  31 and have been attempting to cope since 12.  It starts like this. “I’ll only eat crackers”, “I’ll skip lunch on M,W,F so people see me eat on T,Th. You feel like you’re not “full blown” or like you’re faking it and before you know it you have a lifelong affliction that severely impacts your mental & physical health as well as relationships and family.  Please seek help.  I had an obsession with hanging on to my teenage body as well, but that is a body of a child, not a woman.  That transition is hard because society tells you that you should be able to maintain that body and by any means necessary.  It’s not true,  it’s a construct.  Don’t let the patriarchy and those unrealistic standards compromise your health for the rest of your life.  I had a therapist tell me it’s like addiction.  Once you have an ED, you have it forever and it’s a matter of managing it, in thought and in action.  You are worth not damaging your body and your mind into disrepair over a pants size.  You are with it 1000 times over. ",
      "created_utc": 1546227684.0,
      "score": 2,
      "context": [
        {
          "id": "eb2wixj",
          "author": "None",
          "body": "Im 24. My eating disorder started like this at 14.\nIt's never went. \nSeek help ",
          "created_utc": 1543945189.0
        }
      ]
    },
    {
      "id": "eb3l5lz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1543963603.0,
      "score": 1,
      "context": [
        {
          "id": "eb3l5cl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1543963598.0
        }
      ]
    },
    {
      "id": "eb2fool",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1543931473.0,
      "score": 2,
      "context": [
        {
          "id": "eb2eakv",
          "author": "sugarcoatedpotato",
          "body": "Sounds like you're at the edge. You clearly suffer from disordered eating and your mindset is in a bad place. Denial, excuses and downplay are really common behavior, which can make things worse.\nPlease don't call yourself a fake, you might not have a clear eating disorder but you only do harm by bullying yourself.\n\nWhat holds you back from discussing this with your therapist? ",
          "created_utc": 1543929975.0
        }
      ]
    },
    {
      "id": "eb2d3r9",
      "author": "MissyChevious613",
      "body": "Usually it's the combo of binging and purging although it doesn't have to be. This sounds like EDNOS (eating disorder not otherwise specified) / OSFED. Usually it's where you have a mixed bag of symptoms or you have some of the symptoms of one ED but not all, because if one eating disorder doesn't suck, why not have two, haha. ",
      "created_utc": 1543928598.0,
      "score": 16,
      "context": [
        {
          "id": "eb2aaak",
          "author": "oldpaintunderthenew",
          "body": "This falls right under the clinical definition of bulimia in my country. ",
          "created_utc": 1543924781.0
        },
        {
          "id": "eb2ahk8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1543925091.0
        }
      ]
    },
    {
      "id": "ehs27j0",
      "author": "fableVZ",
      "body": "First Don’t ever think about how other’s are “worse off”.  Don’t be afraid to reach out for help :) . Eating disorders are a very serious thing.\n \nTo answer your questions: \n \n1. Yes I was underweight for my type of build by all means. My natural body is pretty burly, but not fat/stocky. When i lifted weights daily i was 205-215 lbs, when I initially stopped and fit into my natural build I was hovering the 180 range and that was as thin as i had been in years. Even though i just was NOT fat, i thought i was and went down to 160 lbs. Not meaning to make it about myself, just giving you a perspective on how underweight i was. \n \n2. For me there weren’t really days that i wanted help because there were so many more things wrong with me. No matter how skinny i got i would keep thinking i’m fat, even though DEEP down when i looked at my eyes in the mirror i knew i was not okay with my body. I ask you, and anyone else reading this, that when you have that small feeing deep in your soul, do not ignore it.\n \nI just want to ask, what are you going through? Like is food unappealing? Are you self-conscious? I’m interested because i don’t want anyone to go through what I went through.",
      "created_utc": 1551720844.0,
      "score": 1,
      "context": [
        {
          "id": "eb30i75",
          "author": "fableVZ",
          "body": "Don’t know how much help this will be since everyone is different, but I was the same way when i had anorexia. \n  \nI’d starve all day and binge at night, and never lost weight, but eventually I got to the point you’re shooting for and i held myself back from eating at night. After doing it once, I could do it everyday and I beg you not to do it. Food becomes disgusting.\n \nMy senior year of high school i quit the football team because of coach/school drama and weighed in at 205 (6’1”) of pure muscle. After not working out for a while it all started turning into fat and i began starving myself to lose weight. I dropped to 160 lbs at 6’1” in about 6 months. Not healthy with my build. I ate breakfast monday-wednesday-friday and that was it. \n \nI’m telling you this because the only reason i ate breakfast on those days were to keep my body moving, i almost passed out nearly every time i got out of my desk because i had no fuel. It’s not worth it to get there, if you want to lose weight do it in a healthy way. It’s better i promise (-: if you have any questions feel free to dm me, an eating disorder is so easy to develop when you’re self-conscious, but almost impossible to get out of. Sometimes all you need is someone, ANYONE to tell you to fix yourself, it was a complete stranger for me. ",
          "created_utc": 1543948237.0
        },
        {
          "id": "ehs1apk",
          "author": "flreyy22",
          "body": "When you were diagnosed with anorexia were you underweight? Also could you have days where you would want to recover and get better and feel okay with your body? Sorry to bother you i just really struggle with eating and i want to get help but i feel i am faking it and dont need/deserve the help because other people are a lot worse.",
          "created_utc": 1551720208.0
        }
      ]
    },
    {
      "id": "eb3l5qk",
      "author": "ComeOnMisspellingBot",
      "body": "hEy, ThEbAgElFuCkEr, JuSt a qUiCk hEaDs-uP:  \n**aLoT** Is aCtUaLlY SpElLeD **A LoT**. yOu cAn rEmEmBeR It bY **It iS OnE LoT, 'A LoT'**.  \nHaVe a nIcE DaY!\n\n^^^^ThE ^^^^PaReNt ^^^^cOmMeNtEr ^^^^cAn ^^^^rEpLy ^^^^wItH ^^^^'dElEtE' ^^^^tO ^^^^DeLeTe ^^^^tHiS ^^^^CoMmEnT.",
      "created_utc": 1543963606.0,
      "score": 1,
      "context": [
        {
          "id": "eb3l5cl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1543963598.0
        },
        {
          "id": "eb3l5lz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1543963603.0
        }
      ]
    },
    {
      "id": "eb2ikwp",
      "author": "sugarcoatedpotato",
      "body": "Okay, so to number 1.: Your therapist cannot force you to anything. Don't be scared and just try to talk about what bothers you. You know the dangers. I know it doesn't feel valid, but you are worth it. You can do it :)\nWhy is being underweight so important to you?\n\nTo number 2.: I'm sorry that you feel that way. But there are many EDs and not all of them \"require\" to be underweight. Maybe it helps to know that I once also had the same thinking as you. I was convinced my problem wasn't big enough, real enough until I reached a certain weight. Terribly afraid of people not taking me serious.\nWell, I of course deserved help. The same as you do. You don't have to be the most damaged of them all. ",
      "created_utc": 1543934296.0,
      "score": 3,
      "context": [
        {
          "id": "eb2eakv",
          "author": "sugarcoatedpotato",
          "body": "Sounds like you're at the edge. You clearly suffer from disordered eating and your mindset is in a bad place. Denial, excuses and downplay are really common behavior, which can make things worse.\nPlease don't call yourself a fake, you might not have a clear eating disorder but you only do harm by bullying yourself.\n\nWhat holds you back from discussing this with your therapist? ",
          "created_utc": 1543929975.0
        },
        {
          "id": "eb2fool",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1543931473.0
        }
      ]
    },
    {
      "id": "ehs4y5j",
      "author": "flreyy22",
      "body": "I feel like if i eat food i will gain weight which will make me fat. Im extremely self conscious all the time. I hate myself if i skip the gym or i eat too much which deep down i know isn't too much because i only really eat dinner and maybe a snack. I cant stop thinking about how much i eat or what i weigh and im constantly in physical pain like my whole body aches and school is hard to get through but i force myself to the gym and im scared of calories in food. However i want help because i want to eat normally again and i consider telling someone but then i feel like im faking it and that because i want to get better and im not underweight then i shouldn't ask for help  and theres nothing really wrong. I have it stuck in my head that I have to end up in hospital to need help. Im also scared if i ask for help that then i will just gain back all the weight i have lost. sorry this is long ",
      "created_utc": 1551722719.0,
      "score": 1,
      "context": [
        {
          "id": "eb30i75",
          "author": "fableVZ",
          "body": "Don’t know how much help this will be since everyone is different, but I was the same way when i had anorexia. \n  \nI’d starve all day and binge at night, and never lost weight, but eventually I got to the point you’re shooting for and i held myself back from eating at night. After doing it once, I could do it everyday and I beg you not to do it. Food becomes disgusting.\n \nMy senior year of high school i quit the football team because of coach/school drama and weighed in at 205 (6’1”) of pure muscle. After not working out for a while it all started turning into fat and i began starving myself to lose weight. I dropped to 160 lbs at 6’1” in about 6 months. Not healthy with my build. I ate breakfast monday-wednesday-friday and that was it. \n \nI’m telling you this because the only reason i ate breakfast on those days were to keep my body moving, i almost passed out nearly every time i got out of my desk because i had no fuel. It’s not worth it to get there, if you want to lose weight do it in a healthy way. It’s better i promise (-: if you have any questions feel free to dm me, an eating disorder is so easy to develop when you’re self-conscious, but almost impossible to get out of. Sometimes all you need is someone, ANYONE to tell you to fix yourself, it was a complete stranger for me. ",
          "created_utc": 1543948237.0
        },
        {
          "id": "ehs1apk",
          "author": "flreyy22",
          "body": "When you were diagnosed with anorexia were you underweight? Also could you have days where you would want to recover and get better and feel okay with your body? Sorry to bother you i just really struggle with eating and i want to get help but i feel i am faking it and dont need/deserve the help because other people are a lot worse.",
          "created_utc": 1551720208.0
        },
        {
          "id": "ehs27j0",
          "author": "fableVZ",
          "body": "First Don’t ever think about how other’s are “worse off”.  Don’t be afraid to reach out for help :) . Eating disorders are a very serious thing.\n \nTo answer your questions: \n \n1. Yes I was underweight for my type of build by all means. My natural body is pretty burly, but not fat/stocky. When i lifted weights daily i was 205-215 lbs, when I initially stopped and fit into my natural build I was hovering the 180 range and that was as thin as i had been in years. Even though i just was NOT fat, i thought i was and went down to 160 lbs. Not meaning to make it about myself, just giving you a perspective on how underweight i was. \n \n2. For me there weren’t really days that i wanted help because there were so many more things wrong with me. No matter how skinny i got i would keep thinking i’m fat, even though DEEP down when i looked at my eyes in the mirror i knew i was not okay with my body. I ask you, and anyone else reading this, that when you have that small feeing deep in your soul, do not ignore it.\n \nI just want to ask, what are you going through? Like is food unappealing? Are you self-conscious? I’m interested because i don’t want anyone to go through what I went through.",
          "created_utc": 1551720844.0
        }
      ]
    },
    {
      "id": "eb3mmoj",
      "author": "TheBagelFucker",
      "body": "FuCk YoU BaD bOt",
      "created_utc": 1543964676.0,
      "score": 1,
      "context": [
        {
          "id": "eb3l5cl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1543963598.0
        },
        {
          "id": "eb3l5lz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1543963603.0
        },
        {
          "id": "eb3l5qk",
          "author": "ComeOnMisspellingBot",
          "body": "hEy, ThEbAgElFuCkEr, JuSt a qUiCk hEaDs-uP:  \n**aLoT** Is aCtUaLlY SpElLeD **A LoT**. yOu cAn rEmEmBeR It bY **It iS OnE LoT, 'A LoT'**.  \nHaVe a nIcE DaY!\n\n^^^^ThE ^^^^PaReNt ^^^^cOmMeNtEr ^^^^cAn ^^^^rEpLy ^^^^wItH ^^^^'dElEtE' ^^^^tO ^^^^DeLeTe ^^^^tHiS ^^^^CoMmEnT.",
          "created_utc": 1543963606.0
        }
      ]
    },
    {
      "id": "ehv1q4z",
      "author": "fableVZ",
      "body": "Do no apologize for it being so long, it’s a scary place to be, i don’t mind reading and helping :) \n \nLet me, before anything else, tell you this: I know how you feel when you say you hate yourself, think you will get fat, and are scared to take in calories. Trust me. There’s no cliche’ attempts to try and lie to relate here. Of course I have no idea who you are or anything about your background,  but I feel like you may have someone close to you that you can tell, but are scared to. I could be wrong when i say that, but I took that idea from when you said you’re thinking about telling someone. I’m no expert by any means, but when i was going through it i was afraid to tel anyone because i didn’t want the attention, nor did i want to go to a hospital. In reality, i should have told one of or both of my older siblings or my cousin because they were around my age and i could trust them not to go crazy with the family about it immediately. \n \nThe reason i tell you that is because i KNOW that’s what i should have done, but i didn’t and went through the pain a lot longer than i should have. If you’re close with your parents or other adults, by all means tell them, i just know i couldn’t have personally (still wouldn’t tell them if i went back in time).\n \nIf you do tell someone, sit them down, tell them it’s serious and say you’re just not ok. It’s not an act. Being afraid of food is not just “faking it”. I know what it’s like to be petrified of losing weight since it’s so easy to regain it. Especially when everyone else in your (my) family is skinny as can be and couldn’t gain weight if they tried. Feel free to ask me anymore questions, want any advice, or whatever. Apologies for late response, studying for midterms.\n \nNote: Again i’m no expert, so don’t take everything as if i’m a doctor, i’m just someone who has been in your shoes and knows what i did wrong and should have done back then.",
      "created_utc": 1551814606.0,
      "score": 1,
      "context": [
        {
          "id": "eb30i75",
          "author": "fableVZ",
          "body": "Don’t know how much help this will be since everyone is different, but I was the same way when i had anorexia. \n  \nI’d starve all day and binge at night, and never lost weight, but eventually I got to the point you’re shooting for and i held myself back from eating at night. After doing it once, I could do it everyday and I beg you not to do it. Food becomes disgusting.\n \nMy senior year of high school i quit the football team because of coach/school drama and weighed in at 205 (6’1”) of pure muscle. After not working out for a while it all started turning into fat and i began starving myself to lose weight. I dropped to 160 lbs at 6’1” in about 6 months. Not healthy with my build. I ate breakfast monday-wednesday-friday and that was it. \n \nI’m telling you this because the only reason i ate breakfast on those days were to keep my body moving, i almost passed out nearly every time i got out of my desk because i had no fuel. It’s not worth it to get there, if you want to lose weight do it in a healthy way. It’s better i promise (-: if you have any questions feel free to dm me, an eating disorder is so easy to develop when you’re self-conscious, but almost impossible to get out of. Sometimes all you need is someone, ANYONE to tell you to fix yourself, it was a complete stranger for me. ",
          "created_utc": 1543948237.0
        },
        {
          "id": "ehs1apk",
          "author": "flreyy22",
          "body": "When you were diagnosed with anorexia were you underweight? Also could you have days where you would want to recover and get better and feel okay with your body? Sorry to bother you i just really struggle with eating and i want to get help but i feel i am faking it and dont need/deserve the help because other people are a lot worse.",
          "created_utc": 1551720208.0
        },
        {
          "id": "ehs27j0",
          "author": "fableVZ",
          "body": "First Don’t ever think about how other’s are “worse off”.  Don’t be afraid to reach out for help :) . Eating disorders are a very serious thing.\n \nTo answer your questions: \n \n1. Yes I was underweight for my type of build by all means. My natural body is pretty burly, but not fat/stocky. When i lifted weights daily i was 205-215 lbs, when I initially stopped and fit into my natural build I was hovering the 180 range and that was as thin as i had been in years. Even though i just was NOT fat, i thought i was and went down to 160 lbs. Not meaning to make it about myself, just giving you a perspective on how underweight i was. \n \n2. For me there weren’t really days that i wanted help because there were so many more things wrong with me. No matter how skinny i got i would keep thinking i’m fat, even though DEEP down when i looked at my eyes in the mirror i knew i was not okay with my body. I ask you, and anyone else reading this, that when you have that small feeing deep in your soul, do not ignore it.\n \nI just want to ask, what are you going through? Like is food unappealing? Are you self-conscious? I’m interested because i don’t want anyone to go through what I went through.",
          "created_utc": 1551720844.0
        },
        {
          "id": "ehs4y5j",
          "author": "flreyy22",
          "body": "I feel like if i eat food i will gain weight which will make me fat. Im extremely self conscious all the time. I hate myself if i skip the gym or i eat too much which deep down i know isn't too much because i only really eat dinner and maybe a snack. I cant stop thinking about how much i eat or what i weigh and im constantly in physical pain like my whole body aches and school is hard to get through but i force myself to the gym and im scared of calories in food. However i want help because i want to eat normally again and i consider telling someone but then i feel like im faking it and that because i want to get better and im not underweight then i shouldn't ask for help  and theres nothing really wrong. I have it stuck in my head that I have to end up in hospital to need help. Im also scared if i ask for help that then i will just gain back all the weight i have lost. sorry this is long ",
          "created_utc": 1551722719.0
        }
      ]
    },
    {
      "id": "ehxf498",
      "author": "flreyy22",
      "body": "Thank you so much for all the help. I do have someone i could tell and part of me wants to but whats stopping me is although i really want to be able to eat normally again im terrified of all the weight i gain but i have weigh ins every month because last year i was like this but i convinced everyone i was fine and i would slowly loose weight and then fake the weigh ins like wear layers and drink water but now ive lost too much weight like i dont think im skinny or dangerously underweight at all but ive lost weight so i wont be able to fake it at the weigh in so i think there gonna find out in a month and im so scared. I want help but i dont know how im going to handle the weight gain if i get help so do you have any advice on how to deal with weight gain x",
      "created_utc": 1551891984.0,
      "score": 1,
      "context": [
        {
          "id": "eb30i75",
          "author": "fableVZ",
          "body": "Don’t know how much help this will be since everyone is different, but I was the same way when i had anorexia. \n  \nI’d starve all day and binge at night, and never lost weight, but eventually I got to the point you’re shooting for and i held myself back from eating at night. After doing it once, I could do it everyday and I beg you not to do it. Food becomes disgusting.\n \nMy senior year of high school i quit the football team because of coach/school drama and weighed in at 205 (6’1”) of pure muscle. After not working out for a while it all started turning into fat and i began starving myself to lose weight. I dropped to 160 lbs at 6’1” in about 6 months. Not healthy with my build. I ate breakfast monday-wednesday-friday and that was it. \n \nI’m telling you this because the only reason i ate breakfast on those days were to keep my body moving, i almost passed out nearly every time i got out of my desk because i had no fuel. It’s not worth it to get there, if you want to lose weight do it in a healthy way. It’s better i promise (-: if you have any questions feel free to dm me, an eating disorder is so easy to develop when you’re self-conscious, but almost impossible to get out of. Sometimes all you need is someone, ANYONE to tell you to fix yourself, it was a complete stranger for me. ",
          "created_utc": 1543948237.0
        },
        {
          "id": "ehs1apk",
          "author": "flreyy22",
          "body": "When you were diagnosed with anorexia were you underweight? Also could you have days where you would want to recover and get better and feel okay with your body? Sorry to bother you i just really struggle with eating and i want to get help but i feel i am faking it and dont need/deserve the help because other people are a lot worse.",
          "created_utc": 1551720208.0
        },
        {
          "id": "ehs27j0",
          "author": "fableVZ",
          "body": "First Don’t ever think about how other’s are “worse off”.  Don’t be afraid to reach out for help :) . Eating disorders are a very serious thing.\n \nTo answer your questions: \n \n1. Yes I was underweight for my type of build by all means. My natural body is pretty burly, but not fat/stocky. When i lifted weights daily i was 205-215 lbs, when I initially stopped and fit into my natural build I was hovering the 180 range and that was as thin as i had been in years. Even though i just was NOT fat, i thought i was and went down to 160 lbs. Not meaning to make it about myself, just giving you a perspective on how underweight i was. \n \n2. For me there weren’t really days that i wanted help because there were so many more things wrong with me. No matter how skinny i got i would keep thinking i’m fat, even though DEEP down when i looked at my eyes in the mirror i knew i was not okay with my body. I ask you, and anyone else reading this, that when you have that small feeing deep in your soul, do not ignore it.\n \nI just want to ask, what are you going through? Like is food unappealing? Are you self-conscious? I’m interested because i don’t want anyone to go through what I went through.",
          "created_utc": 1551720844.0
        },
        {
          "id": "ehs4y5j",
          "author": "flreyy22",
          "body": "I feel like if i eat food i will gain weight which will make me fat. Im extremely self conscious all the time. I hate myself if i skip the gym or i eat too much which deep down i know isn't too much because i only really eat dinner and maybe a snack. I cant stop thinking about how much i eat or what i weigh and im constantly in physical pain like my whole body aches and school is hard to get through but i force myself to the gym and im scared of calories in food. However i want help because i want to eat normally again and i consider telling someone but then i feel like im faking it and that because i want to get better and im not underweight then i shouldn't ask for help  and theres nothing really wrong. I have it stuck in my head that I have to end up in hospital to need help. Im also scared if i ask for help that then i will just gain back all the weight i have lost. sorry this is long ",
          "created_utc": 1551722719.0
        },
        {
          "id": "ehv1q4z",
          "author": "fableVZ",
          "body": "Do no apologize for it being so long, it’s a scary place to be, i don’t mind reading and helping :) \n \nLet me, before anything else, tell you this: I know how you feel when you say you hate yourself, think you will get fat, and are scared to take in calories. Trust me. There’s no cliche’ attempts to try and lie to relate here. Of course I have no idea who you are or anything about your background,  but I feel like you may have someone close to you that you can tell, but are scared to. I could be wrong when i say that, but I took that idea from when you said you’re thinking about telling someone. I’m no expert by any means, but when i was going through it i was afraid to tel anyone because i didn’t want the attention, nor did i want to go to a hospital. In reality, i should have told one of or both of my older siblings or my cousin because they were around my age and i could trust them not to go crazy with the family about it immediately. \n \nThe reason i tell you that is because i KNOW that’s what i should have done, but i didn’t and went through the pain a lot longer than i should have. If you’re close with your parents or other adults, by all means tell them, i just know i couldn’t have personally (still wouldn’t tell them if i went back in time).\n \nIf you do tell someone, sit them down, tell them it’s serious and say you’re just not ok. It’s not an act. Being afraid of food is not just “faking it”. I know what it’s like to be petrified of losing weight since it’s so easy to regain it. Especially when everyone else in your (my) family is skinny as can be and couldn’t gain weight if they tried. Feel free to ask me anymore questions, want any advice, or whatever. Apologies for late response, studying for midterms.\n \nNote: Again i’m no expert, so don’t take everything as if i’m a doctor, i’m just someone who has been in your shoes and knows what i did wrong and should have done back then.",
          "created_utc": 1551814606.0
        }
      ]
    }
  ]
}