{
  "id": "a6oaod",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1544958764.0,
  "title": "Request: Christmas Cookie Party Win!",
  "selftext": "Tonight I went to a Christmas cookie contest party. I made cookies without binging on them (Rare). And I ate 4 cookies at the party and didn't purge (Rarer). I had such a great time since I wasn't obsessively focused on the food. \n\nI am beginning to love fighting back against my ED and not letting it have power over me. It's so empowering and makes me excited for a future free from this disease. I am working so hard to recover but I'm still B/P 3-5 times a week. It's a huge decrease from how much I used to B/P but lately I've just been getting frustrated with my recovery and how sick I still am. So these kind of days mean the world to me. \n\nSending healing vibes to you all!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/a6oaod/request_christmas_cookie_party_win/",
  "score": 68,
  "num_comments": 9,
  "comments": [
    {
      "id": "ebwl1es",
      "author": "covhr",
      "body": "GOOD FOR YOU! Take heart in these successes. Others may consider them \"little\", but you know that they are worth shouting from the rooftops! ",
      "created_utc": 1544959921.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ebwln65",
      "author": "None",
      "body": "That's great! I'm so happy for you! Have a grand holiday time ❤️❤️",
      "created_utc": 1544960995.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ebwutiz",
      "author": "AlcatK",
      "body": "Congratulations! I realized yesterday that I miss living a healthy life. It made me really sad, but as I thought more about it, it became a motivation to change. Life is better without Ed!",
      "created_utc": 1544973176.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ebx798g",
      "author": "Beefany80",
      "body": "Yes!!!! Congrats!!! You were tested and you passed! ",
      "created_utc": 1544983617.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ebxdlo9",
      "author": "None",
      "body": "yes yes yes!! so proud of you, and especially glad that you can enjoy the holidays and fun social events without being preoccupied :')",
      "created_utc": 1544988008.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ebybvs6",
      "author": "pikachusbooty",
      "body": "That’s an amazing step, very proud 💛",
      "created_utc": 1545013578.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ec0u9s3",
      "author": "lizefb",
      "body": "That's awesome! I love hearing these kinds of successes.  Keep up the fantastic work! ",
      "created_utc": 1545103809.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ecs7zju",
      "author": "HappilyGia",
      "body": "I’m really proud of you. This is a huge accomplishment!!!",
      "created_utc": 1546059585.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ecvyoxo",
      "author": "weegey",
      "body": "You are amazing.  Life can be so beautiful without the shadow of an ED constantly hanging over you.  Wishing you a full recovery❤️",
      "created_utc": 1546194848.0,
      "score": 1,
      "context": []
    }
  ]
}