{
  "id": "adgjfv",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1546857679.0,
  "title": "Request: Haven’t Eaten In 2 Days At Boyfriend’s House And Freaking Out",
  "selftext": "I was doing so well with recovery. I felt myself bearing relapse though. Now Im staying with my boyfriend and his family at their house for a week and I can’t bring myself to eat. It’s been 2 days so far and the most I’ve had was a bite of the dinner on my plate last night.\n\nI’m too embarrassed to admit I’m hungry. I tried eating the food on my plate last night for dinner but each time I put food on my fork, I felt like I could throw up. I can’t get over this anxiety I get around eating. Food feels like the enemy.\n\nI want so desperately to be on track with my recovery, but I’m losing right now. My boyfriend doesn’t know about my problem. I have no one to talk to about this. How can I get over this feeling for now? I can’t do this for a week. I really don’t want to blackout from hunger here.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/adgjfv/request_havent_eaten_in_2_days_at_boyfriends/",
  "score": 48,
  "num_comments": 9,
  "comments": [
    {
      "id": "edgwqpy",
      "author": "None",
      "body": "Right now you have to find the safest and easiest way to give your body some fuel. This could be through drinks, can you have a cup of tea or coffee with a teaspoon of sugar? Could you snack on some nuts or something like that? If you can find a window of time alone, would you be able to eat something small? Hang in there OP, it will get easier I promise, but for now you just need fuel, somehow.",
      "created_utc": 1546867102.0,
      "score": 28,
      "context": []
    },
    {
      "id": "edgpdbw",
      "author": "wethail",
      "body": "Do you have a car? Can you drive? If you can walk to a shop and eat by yourself, instead of subjecting yourself to a meal with your bf/fam, you could pick some same foods you feel okay eating. \n\nSugar free jello?\nVeggie broth?\nCelery? \nZero calorie Gatorade?\nSugar free monsters?\n\nGet tonight sleep. Rest. Keep up your daily routine and hygiene. If eating is hard, make sure you’re very hydrated and supplement with electrolytes if needed. ",
      "created_utc": 1546860034.0,
      "score": 37,
      "context": []
    },
    {
      "id": "edgssxp",
      "author": "wwinga",
      "body": "I go through times I can't make myself eat quite often...I am not sure why but I believe it is eating with others my problem (even with my close friends... I start feeling like I will be sick even before I see the food...only the smell makes me want to throw up...and then I pass all the sweating, being really warm and suddenly shivering and being very cold and most of the times I try to force myself to have some food and I end up getting sick)...\n\n\nI do not have a solution but to avoid blacking out for hunger I always have some chocolate/sweets I can put in my mouth to keep myself going.... usually after all the anxiety and the feeling sick has gone I find a really quiet place to eat alone (in my car, in a pub with litterally no one else, in a remote location in a park where I can't see other people)...\n\nI also try to get food I can eat a little and then pack to keep eating after 2 - 3 hours (wraps, sandwiches, soups)...\n\n\n",
      "created_utc": 1546863654.0,
      "score": 6,
      "context": []
    },
    {
      "id": "edibkf8",
      "author": "rumbusiness",
      "body": "I also struggle to eat around people and always lose weight if I go on holiday with friends, or stay with family. \n\nThe best thing is to have some sweets (candy) if you can. It doesn't feel like 'eating', it doesn't make you feel full, but it will give you some basic calories for your body to run on. \n\nGood luck. ",
      "created_utc": 1546896567.0,
      "score": 6,
      "context": []
    },
    {
      "id": "edjlugn",
      "author": "tymopa",
      "body": "One thing to remember is there is no shame. You have an illness as most of us do on this site. Yes, fuel, but if possible tell your boyfriend. Does he know you have already gotten treatment? You obviously mean a great deal to him or you wouldn't be spending a week with his family. I think the suggestions listed are really good so to add to it, maybe you can \"come down with something\" which will give you time to regroup and your bf can bring you broth or jello or whatever it is that can fuel you. It's okay to ask for help. Best of luck to you. Our hearts are with you.",
      "created_utc": 1546928145.0,
      "score": 3,
      "context": []
    },
    {
      "id": "edhyb25",
      "author": "cisforcrlt",
      "body": "Where are You? Please somebody has to find You and bring You some  safe food. Come on, make a list. We are here to help You.\nSadly im in Spain and i cant do that... But doing that would be awesome.\nIn the meantime... Hugs from here.",
      "created_utc": 1546889594.0,
      "score": 3,
      "context": []
    },
    {
      "id": "edjcde0",
      "author": "StefanodesLocomotivo",
      "body": "What works best for me is eating a small healthy snack that I enjoy eating around 2 to 300 calories or so. A piece of fruit with some peanut butter or a slice of whole wheat toast with some cheese or something. That way I can tell myself that I am eating this to fuel my body. If at all possible, take a multivitamin along with this small snack/meal (be sure to add some sort of fat source, as some vitamins are fat-soluble). \n\nIt's as others have pointed out, food is fuel and you need fuel to keep going. Just try to make sure that this food source right now is as nutrient rich as possible so you're getting the most out of it, which is not only physically better for you right now, but should also 'feel' better as well, because you're actually feeding your body some proper fuel. ",
      "created_utc": 1546920004.0,
      "score": 1,
      "context": []
    },
    {
      "id": "edjr9jz",
      "author": "Em42",
      "body": "It might be ok to talk to your boyfriend about what you're going through. People are there for you so much more than you think they will be. I've been with the same person for a decade and he's always really sensitive about how hard it is for me to eat in front of people. Also that I never really think about eating so I often need reminding if we're busy. And that I have a lot of GI issues so I get afraid to eat and can't eat all kinds of stuff to begin with. \n\nHe does make fun of me about my food allergies and sensitivities, but that's just how he is, it makes me laugh so I guess it's ok. He also thinks I'm crazy and that no one is watching me eat too, but he's been humoring me and being generally a good sport about it for a really long time now. Including doing stuff like stopping somewhere after we go out with friends to get takeout for me to eat at home because I can't always eat even with people I've known for more than a decade. ",
      "created_utc": 1546934828.0,
      "score": 1,
      "context": []
    },
    {
      "id": "edxhnqz",
      "author": "throwaway24422344234",
      "body": "Hi this was my post. I meant to come back and update sooner. Thank you everyone for your advice and support. You all know as well as I do how hard it can be to deal with an ED, especially in social contexts. All the advice offered to me here helped so much. After the first few days of living off coffee and some chocolate that I could easily eat unseen, I was able to get myself to eat a little to stop from feeling sick. It was a lot easier to eat when I was just with my boyfriend, so I tried to eat a bit more while with him and eat at least a little at family meals.\nI thankfully made it through the week eating enough to feel good. I’m starting to feel a bit more comfortable about eating around his family as long as no attention is brought to me. Thank you all so so much for your help and care. To all you struggling too, my hope is with you for your recovery. ",
      "created_utc": 1547334104.0,
      "score": 1,
      "context": []
    }
  ]
}