{
  "id": "al5z7r",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1548802900.0,
  "title": "Request: Date Ideas? Guy (25M) Asking Girl (27F) Out On Date.",
  "selftext": " \n\nI met this amazing girl (27F) and what initially attracted me to her was her personality. I (25M) met her through a mutual friend. Interestingly, every time I talk to her (even if we haven’t seen each other for weeks) there’s a chemistry between us and even our friends have pointed it out. The conversations just flow ya know?\n\nShe recently posted on her IG that she has been battling with her ED (specifically Bulimia) for 5-6 years. This made me want to look more into resources to understand ED and how to support someone with Bulimia.\n\nI am pretty sure she is interested too, but I don’t even know what to do for date ideas when I ask her out.\n\nHelp please. Dancing? Walking on the beach? Hiking? Coffee/tea dates? Going to Whole Foods and cooking with her? Seriously, anything helps. How do you feel about late night dates (suggestions for best times)?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/al5z7r/request_date_ideas_guy_25m_asking_girl_27f_out_on/",
  "score": 41,
  "num_comments": 15,
  "comments": [
    {
      "id": "efb3tgu",
      "author": "AlcatK",
      "body": "Hey there! This is awesome and so encouraging to see!\n\nMaybe you could ask/tell her that you want to date and say that you wanted her to pick the activity! That way she has some control and can go with something she is comfortable with. After the date, maybe you could mention that you saw her IG post and wanted to be respectful of her so you let her choose the date activity without putting any untended pressure on her.\n\nGoodluck!",
      "created_utc": 1548804835.0,
      "score": 40,
      "context": []
    },
    {
      "id": "efbgz64",
      "author": "tdgonex",
      "body": "As someone who struggles with an ED, I commend you on trying to understand her situation and familiarize yourself with it.  There are TON of resources out there, but just remember no two EDs are the same. She may be atypical or not have some of the more common experiences with Bulimia. The best way to learn about her specific experience will be to talk to her.  It can feel really embarrassing to talk about, but it sounds like you guys are getting pretty comfortable with one another and if she is posting on IG about it she's likely to be okay opening up to you about it.\n\n\nAs far as the date goes, it's hard to say without knowing more about her and you, but something fun is always a great idea! You could try an arcade (dave & busters?), go karts,  an escape room, or something outdoorsy like a walk at the park.  Museums and art gallerys are also great.  I personally would try to avoid anything focusing too much on food or strenuous physical activity. Thats just me though. You won't know what she is comfortable with until you ask her.",
      "created_utc": 1548812591.0,
      "score": 12,
      "context": []
    },
    {
      "id": "efbtwxa",
      "author": "tymopa",
      "body": "The only thing I have to offer as far as the date you plan, which is super awesome on your part, is just not to talk about good and bad foods, diets, how awful or awesome someone else's (including your own) eating and exercise habits are. EDs focus too much on that stuff and it feeds into the disorder. Basically, stay away from food and exercise talk unless it is talking about things that bring joy vs. guilt. This isn't to say planning a fun bike excursion, hike, or walk on the beach is bad....it would be awesome. \n\n&#x200B;\n\nHave a great time. ",
      "created_utc": 1548821546.0,
      "score": 10,
      "context": []
    },
    {
      "id": "efbcey8",
      "author": "RuthCarter",
      "body": "High five for you for being thoughtful! I know I have trouble eating in front of others, even though I've been in recovery for years, so you may want to suggest a date that doesn't involve food - perhaps coffee/tea, going to a book signing, movie, cat cafe, or a comedy show. Those are some of my off-the-cuff ideas. Good luck!",
      "created_utc": 1548809721.0,
      "score": 4,
      "context": []
    },
    {
      "id": "efcbtsy",
      "author": "1ights_0ut",
      "body": "I’d say go do something fun that won’t make her feel the pressure to eat only because it may cause her to feel uncomfortable. After the date tell her it was really fun and you enjoyed spending time with her and maybe talk about the Instagram post. Talk about how you’d like to understand her situation if she feels comfortable enough to talk about it. I would assume that she wants to get better from bulimia. \n\nI used to be there too, but when I opened up to my current bf about it he offered to listen to me talk about it and try to help me heal. Help me feel that it’s okay to eat and have healthy eating habits. With time of you guys continue having a relationship, it could work out the same way. I would hope, I wish the best for you guys :)",
      "created_utc": 1548838433.0,
      "score": 3,
      "context": []
    },
    {
      "id": "efbrqnk",
      "author": "spiritkale",
      "body": "My FAVORITE dates are road trips, don't have to be super long. Road trips to watch the sunrise on the beach is a good one. I would leave food out of it on the first date just to be safe honestly. Except maybe grabbing a coffee followed by doing something else. (like dont sit in the coffee shop and drink em together. just get the damn coffee and move on lol). As someone whos been recovered I while I still feel weird about first time food stuff when im just meeting someone. ",
      "created_utc": 1548819886.0,
      "score": 2,
      "context": []
    },
    {
      "id": "efcq32h",
      "author": "RinebooDersh",
      "body": "Maybe a planetarium, or look up local events in your area and see what strikes your fancy?",
      "created_utc": 1548852667.0,
      "score": 2,
      "context": []
    },
    {
      "id": "efbaro6",
      "author": "chiefsfan_713_08",
      "body": "Obviously this is one person but my ex used to love coffee dates followed by walks. Gave her the option to consume little and then move around and feel better about anything she did eat/drink ",
      "created_utc": 1548808678.0,
      "score": 3,
      "context": []
    },
    {
      "id": "efuhbm2",
      "author": "lmperceptible",
      "body": "This is a profoundly unhelpful comment, but this post is so soft; muh heart :')",
      "created_utc": 1549424058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "efwpwx1",
      "author": "tatertotchan",
      "body": "Oh my gosh I’m sad I’m late to this but this makes me so happy to see. Good for you for asking for advice! I recommend reading up about her specific ED bulimia just to get a basic understanding, what are the behaviors and such so you know a little bit of how to handle things delicately. I recommend non food related dates, coffee can be fine but it really depends on the girl, some are ok with it some it can be a real battle. My husband and I would often go to coffee shops, get some plain coffee or tea, and go walk around downtown in our city. Parks or hikes can be nice, nothing too vigorous since you don’t want it to be all about the exercise. Really just think about keeping the date outside of food, or if you need to go somewhere that does have food because there’s not a lot of options make it clear you just want somewhere to talk and hangout and get to know each other and you can always ask if she has any better ideas. The big thing for me that helped me know my husband was the one is he would never push me to eat! He would encourage it when we were better acquainted and even make me healthy snacks to nibble on our hikes and outings but her never commented or made me feel bad for not eating. The hard thing about first dates are they are really you getting to know each other and most places you sit and talk have some variety of food. What’s important is you make it about her, not the food or the coffee or whatever. All your date ideas were good, even the cooking one, though I would save it for a little down the line. \n\nIf you want some resources on bulimia or Ed’s that helped my husband when we were first together PM me or you need advice on anything you might struggle with handling or not understand! I would be happy to help or get my husbands opinion on how he handled it because he was very very like you.  You have a very good heart and I wish you all the best!",
      "created_utc": 1549497829.0,
      "score": 1,
      "context": []
    },
    {
      "id": "efbohi3",
      "author": "virtus147",
      "body": "Thank you! \n\nLike give her options and let her choose? \n\n&#x200B;",
      "created_utc": 1548817611.0,
      "score": 8,
      "context": [
        {
          "id": "efb3tgu",
          "author": "AlcatK",
          "body": "Hey there! This is awesome and so encouraging to see!\n\nMaybe you could ask/tell her that you want to date and say that you wanted her to pick the activity! That way she has some control and can go with something she is comfortable with. After the date, maybe you could mention that you saw her IG post and wanted to be respectful of her so you let her choose the date activity without putting any untended pressure on her.\n\nGoodluck!",
          "created_utc": 1548804835.0
        }
      ]
    },
    {
      "id": "efbr8bd",
      "author": "virtus147",
      "body": "Was it like a starbucks, panera, coffee bean, etc? or was it like a hipster/organic local cafe? That sounds great! ",
      "created_utc": 1548819504.0,
      "score": 2,
      "context": [
        {
          "id": "efbaro6",
          "author": "chiefsfan_713_08",
          "body": "Obviously this is one person but my ex used to love coffee dates followed by walks. Gave her the option to consume little and then move around and feel better about anything she did eat/drink ",
          "created_utc": 1548808678.0
        }
      ]
    },
    {
      "id": "efczvus",
      "author": "tinyzeldy",
      "body": "Recovering anorexic and can confirm - coffee shop + walk OR if the weather is bad, a Starbucks connected to a Barnes & Noble is always a super fun and nice date. Can have a tiny snack with tea or just a drink and then immediately be distracted with conversation and walking around a bookstore. ",
      "created_utc": 1548859462.0,
      "score": 2,
      "context": [
        {
          "id": "efbaro6",
          "author": "chiefsfan_713_08",
          "body": "Obviously this is one person but my ex used to love coffee dates followed by walks. Gave her the option to consume little and then move around and feel better about anything she did eat/drink ",
          "created_utc": 1548808678.0
        }
      ]
    },
    {
      "id": "efbpdmk",
      "author": "cheese_wizard",
      "body": "This is risky.  You should just pick something normal and run with it.  It's just a first date.  Don't make a big deal... do something uber special about date 3 unless you really hit it off.  Girls like guys who got a plan, but who are flexible too.  \n\nI usually ask if there's any eating restrictions from them, then lay down about 3 options of things I like and ask for suggestions, but don't give the impression that you don't have any ideas.  Just don't be like, let's go skydiving!!\n\nI dated a girl with weird eating things, so we went to Whole Foods and had an innocent picnic in a public park.  Played some frisbee.  I wait until the end, ask them out again, sense the response, and if good, then a hug and maybe a kiss on the cheek.  I wait to kiss until date 2, and I ask.",
      "created_utc": 1548818199.0,
      "score": 17,
      "context": [
        {
          "id": "efb3tgu",
          "author": "AlcatK",
          "body": "Hey there! This is awesome and so encouraging to see!\n\nMaybe you could ask/tell her that you want to date and say that you wanted her to pick the activity! That way she has some control and can go with something she is comfortable with. After the date, maybe you could mention that you saw her IG post and wanted to be respectful of her so you let her choose the date activity without putting any untended pressure on her.\n\nGoodluck!",
          "created_utc": 1548804835.0
        },
        {
          "id": "efbohi3",
          "author": "virtus147",
          "body": "Thank you! \n\nLike give her options and let her choose? \n\n&#x200B;",
          "created_utc": 1548817611.0
        }
      ]
    },
    {
      "id": "efd6d1t",
      "author": "AlcatK",
      "body": "You could suggest a few things. ",
      "created_utc": 1548863063.0,
      "score": 2,
      "context": [
        {
          "id": "efb3tgu",
          "author": "AlcatK",
          "body": "Hey there! This is awesome and so encouraging to see!\n\nMaybe you could ask/tell her that you want to date and say that you wanted her to pick the activity! That way she has some control and can go with something she is comfortable with. After the date, maybe you could mention that you saw her IG post and wanted to be respectful of her so you let her choose the date activity without putting any untended pressure on her.\n\nGoodluck!",
          "created_utc": 1548804835.0
        },
        {
          "id": "efbohi3",
          "author": "virtus147",
          "body": "Thank you! \n\nLike give her options and let her choose? \n\n&#x200B;",
          "created_utc": 1548817611.0
        }
      ]
    }
  ]
}