{
  "id": "anr3g3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1549462518.0,
  "title": "Request: Friends threw me an intervention, berated me, belittled me, guilted me, then dropped me as their friend after forcing me to disclose my darkest secret",
  "selftext": "Big rant. Sorry in advance.\n\n&#x200B;\n\nSo I have a 16 year old eating disorder (strictly non-purging anorexia) schizoaffective (bipolar 2 subtype), severe depression, anxiety, and OCD. I’m currently in a serious relapse with my ED and my weight is way down.\n\n&#x200B;\n\nRecently I was (am) fairly suicidal. I only told one person. She met me with compassion and understanding. She provided me amazing nonjudgmental support when I shared my feelings. She also is supportive (in a helpful way) of my attempts at recovery.\n\n&#x200B;\n\nHowever, then a group of my other friends noticed I wasn’t doing too hot, and then figured out how hard I was struggling and decided to throw me an intervention; alone, three inexperienced women who know nothing about mental illness, and no professional insight or support.\n\n&#x200B;\n\nThey sat me down and berated me for an hour and a half. That I’m bad for not opening up to them. They’re mad that I’m still struggling. I should be getting better faster. I’m not doing enough to help myself. I should have reached out to them first.\n\n&#x200B;\n\nLike.\n\n&#x200B;\n\n1. Truly depressed people with mental illness on the verge of suicide seldom reach out. So don’t get fucking OFFENDED when you find out I didn’t tell you. Maybe you should feel like..what could I have done better for D to trust us? They NEVER text me first. Ever. So why would i share my suicidal ideation with them??\n\n&#x200B;\n\n2. Recovery isn’t a straight line and nobody’s fucking perfect. Yeah, I’ve been struggling consistently for about a year, but like..it’s not my FAULT. I have multiple mental illnesses and they all aggravate the others. It’s out of my god damn control.\n\n&#x200B;\n\n3. Don’t berate the person you’re trying to “support.” Beating down on someone (with no moderator!!) will, in fact, make whatever the bigger issue is, worse.\n\n&#x200B;\n\n4. Don’t pretend you know what you’re doing!! The first thing one of them said was, “so we’ve never done this, and we have no idea what we’re doing, but here goes!” Interventions are DANGEROUS if not done correctly.\n\n&#x200B;\n\n5. Have a fucking goal at least!! They didn’t even have a desired outcome of the intervention. They had no plan. No follow through. I don’t even know what they expected from me. I think they just wanted me to agree with them, apologize for not telling them, and then listen to their every piece of advice and treat it like it was made of gold.\n\n&#x200B;\n\n6. They told me that my therapist must be really bad. They said I needed to fire her and find someone new. Or see two therapists. Which is SOOOOOOOOOOOO unethical to each therapist! No better way to get two sets of instructions and accidentally fuck it up. (For me anyway)\n\n&#x200B;\n\n7. Do not EVER tell someone who is suicidal your personal stories of loss. Jesus Christ. Really?? I want to die and you’re GUILTING ME? Fuck dude really? My best friend passed from suicide in 2012. I’m still fucking demolished over it, not to mention the three other friends who have gone that way. I do NOT need to be told about the affects of suicide on friends and family. I’ve experienced more loss via suicide than all three of them together. So don’t fucking give me the guilt trip.\n\n&#x200B;\n\nThey literally had no clue what they were doing. And for some reason i just sat there and took it. Before the intervention they said that if I don’t do it they won’t hang out with me anymore.\n\n&#x200B;\n\nThen here we are two days later and one of them tells me I’m toxic and that she doesn’t want to know me anymore. UH OKAY. So fucking traumatize me, berate me, make me feel worthless, then bail out.\n\n&#x200B;\n\nOkay. Gotcha.\n\n&#x200B;\n\nSo here I am now, picking up the fucking pieces. Glad there was a point to all of this.\n\n&#x200B;\n\nOh, and my boyfriend told me he didn’t love me anymore last week. By text. While I was working.\n\n&#x200B;\n\nI seriously have never felt more worthless in my life. I feel like an absolutely waste of space. I’m obviously “too much” for people that they want to get away from me.\n\n&#x200B;\n\nIt’s been a hell of a week and my mental state is much worse than it was before Friday.\n\n&#x200B;\n\nIm struggling harder with food right now than I have in a long time. Between my boyfriend dumping me, my friends abandoning me because I won’t listen to their uninformed advice, and my job sucking, I’m not doing a very successful job at staying healthy.\n\n&#x200B;\n\nI WILL say that through this whole month, I haven’t caved and self harmed. It’s been almost 4 years since I last did it, and apparently men or shorty friends won’t bring me down that far!\n\n&#x200B;\n\nAnyway, this was a pointless post, and I’m sorry. But I figured you all might know how I’m feeling and may have some solid advice or words for me. Have any of you all been given an “intervention” before? How did you handle it?\n\n&#x200B;\n\nThank you.\n\n&#x200B;\n\nThere’s no tl;dr for this post. Sorry.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/anr3g3/request_friends_threw_me_an_intervention_berated/",
  "score": 152,
  "num_comments": 40,
  "comments": [
    {
      "id": "efvewbp",
      "author": "None",
      "body": "You are stronger than all those people , they know nothing of your struggle and what it takes just function daily \n\nYour strength is immeasurable and although sometimes you may feel weak , trust me you’ve got this far and you are a bad mother fucker ! \n\nKeep up the good fight surround yourself with the thought of proving all those people wrong \n\nFight the good fight , you got this ! ",
      "created_utc": 1549465185.0,
      "score": 39,
      "context": []
    },
    {
      "id": "efvhyag",
      "author": "None",
      "body": "That is absolute bullshit. Mental health is really important and it needs to be acknowledged. Those \"friends\" of yours are very insensitive for doing what they did. So is your ex. Some people simply don't understand the impact they have on others. You're not alone, friend. You can push through this. Be kind to yourself and be proud for what progress you have made.",
      "created_utc": 1549467543.0,
      "score": 20,
      "context": []
    },
    {
      "id": "efvoyua",
      "author": "BooksThings",
      "body": "First off, I would like to say that those ‘friends’ of yours aren’t true friends.  I’d say good riddance to them.  You deserve much better friends.\n\nAs someone who has struggled with ED’s for 15 years, have struggled with depression & anxiety.  I know exactly what you are going through.  Only you went through worse than even me.  I’ve never lost a friend to suicide.  I cannot imagine. \n\nThose ‘friends’ never should of put you through that.  They actually traumatized you because they were bullying and ganging up on you.  That is never OK!  \n\nSounds to me like THEY are the toxic ones.  I am mad at your friends for you.  Totally uncalled for.  \n\n",
      "created_utc": 1549472501.0,
      "score": 12,
      "context": []
    },
    {
      "id": "efvqadq",
      "author": "Valer_bear",
      "body": "This isn’t anyway to react to someone with an eating disorder. I’m sorry your friends reacted the way they did, that’s truly awful. I’ve honestly only told like 3 of my friends. They pretty much said the standard “get help.” My parents on the other hand constantly scream at me everyday to just eat and how my disorder is stupid/ childish and it’s just in my head, which technically it is but in my opinion that’s what makes it that much harder. The fact that it’s in my head makes it difficult to treat bc you have to completely change your perspective/outlook on life. So I feel you on your friends not being supportive or helpful. It’s a fucked situation. I think they’re clearly scared for you but maybe don’t know how to act about it? At least I think that’s why my parents act the way they do about it. Hopefully this helps and I hope you get better(: ",
      "created_utc": 1549473406.0,
      "score": 7,
      "context": []
    },
    {
      "id": "efvqmh6",
      "author": "ZeeBae03",
      "body": "Sounds like your “friends” did you a great service by showing their true colors and stepping out of your life. I know how much it sucks to lose friends but in this case, you WILL be better off. I’m just a stranger on the internet but I’m proud of you for what progress you have made and I can be here to talk if you need. ",
      "created_utc": 1549473635.0,
      "score": 8,
      "context": []
    },
    {
      "id": "efvu6hm",
      "author": "whinywino89",
      "body": "Oh I am so sorry that this is all happening to you. I’ve had a surprise intervention in the past as well. For me, it was related to my depression and self harm. It was...awful. I came home to find my parents, aunts, and a pastor waiting for me... completely bombarded. It only made me pull away from them more. So, know that your feelings of anger are completely valid. \n\nI can sit here and say to go speak to someone about your suicidal thoughts; but ultimately: you need to make the choice to hang around this planet yourself. Life is HARD and it’s SO much harder with a cocktail of mental illnesses. I am anorexic (recovered but still struggle time to time), have major depression, anxiety, and body dysmorphic disorder. While I cannot understand your own cocktail, I do get how they all bounce off one another and when you feel like you finally have a handle on one disorder, another decides to be a reallll asshat. \n\nI know how lonely it can get when people just don’t understand; when they sit there and say to get help, look at the big picture, see the sun between the shitty clouds. Here, on this forum, know that you are not alone.  PM me if you need to vent! You are surrounded by some sucky people BUT that does not mean that you suck. Your situation sucks. Really, really sucks. It takes a lot to get through things like this, but it is possible. Look at how long you’ve gone without self harm! That is HUGE! I am ten years from the last time I engaged in self-harm, so I know how much of an accomplishment that is for you. I also know that when things are spiraling, when people suck, when nothing feels like it’s in your control, food can be controlled...so we control it. It’s not as simple as, “just eat!” Try: just being kind to yourself. Reach out to your therapist to let him/her know what’s going o, and tackle each day as it comes; nothing more, nothing less. ",
      "created_utc": 1549475995.0,
      "score": 6,
      "context": []
    },
    {
      "id": "efvx01k",
      "author": "None",
      "body": ">\tAnyway, this was a pointless post, and I’m sorry. But I figured you all might know how I’m feeling and may have some solid advice or words for me\n\nNever pointless OP, it is good to get things written down, often it is when we make the most sense out of our thoughts and how we feel about them, as opposed to just having then swirl around up there.\n\nPlus the not self harming is a big deal, really. The fact you have held onto that part of strength is meaningful, it means you *have* made progress! If these people are really happy to bail on you because *your* problems are so very inconvenient for *them* then you are truly better off. It msy not feel like it but it is so. You have worth and a place here just as we all are deserving of.\n\n",
      "created_utc": 1549477887.0,
      "score": 6,
      "context": []
    },
    {
      "id": "efvvp6m",
      "author": "ALFanator34",
      "body": "i know im just a stranger on the internet, but please feel free to message me. if you just want to vent or whatever the case might be, im here for you OP",
      "created_utc": 1549477017.0,
      "score": 3,
      "context": []
    },
    {
      "id": "efw8smx",
      "author": "littlesleepymole99",
      "body": "Sounds like they didn't deserve you as a friend. I know what it's like to open up to friends about my mental illness and for them to belittle me. Just remember you're better than them. Sending you love from the rainy land of the UK",
      "created_utc": 1549485728.0,
      "score": 3,
      "context": []
    },
    {
      "id": "efwrg7c",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1549499082.0,
      "score": 2,
      "context": []
    },
    {
      "id": "efwvyhc",
      "author": "Sunshinecrown",
      "body": "I gotta be honest, even though you outline ways you are failing, you do it with knowledge, strength, and courage.   I think you may be cutting yourself short and not giving yourself enough credit.  I hope you agree.  \n\nSuccesses:\n1-You can spot fake friends a mile away.  \n2-You don’t value the opinion of uninformed friends.\n3-You are not a puddle on the floor over the boyfriend who gifted you a shitty text while at work. \n4-You are moving on even though a boyfriend broke up with you. \n5-You reaches out for support to a community that YOU KNOW will have your back. \n6-You have not self-harmed=Major Success!!!\nList goes on and on. .....\n\nYou are a smart person.  Your ave a shining, sparkling personality that comes through in this message.  You are worth life, and worth fighting for!   You will get the friends and love life you desire and deserve.   I know it.  Hang on.....",
      "created_utc": 1549502713.0,
      "score": 2,
      "context": []
    },
    {
      "id": "efxn3ud",
      "author": "rachihc",
      "body": "I really want to slap those people until their faces looks like a baboon ass. I am so sorry. \n\nI personally would keep those people far away from me. I would keep closer the few that actually treat you right, even if it is just a few. you are ill, not toxic, and you do not have to deal with others peoples bs. ",
      "created_utc": 1549532169.0,
      "score": 2,
      "context": []
    },
    {
      "id": "efwbt9c",
      "author": "vanillyl",
      "body": "Oh my god. That’s fucking awful. I can only hope at least one of these ‘friends’ of yours gets a clue some time in the future, thinks back on this and realises just how awful, damaging and accusatory their actions were. To me it almost sounds as though this was a bunch of people who’s only experience of interventions is what they’ve seen on TV, and actually got excited about running one themselves because it was their chance to pretend they’re in a fucking movie. As horrifically traumatic as this sounds, you can take comfort in the fact that you have been mentally strong enough to identify that what THEY were doing is what’s wrong here, and know that you were not the problem. That shows a huge amount of mental resilience and healthy thought patterns on your part! You’re already handling this incident in a healthy way by correctly identifying that!\n\nNot that this is at all comparable to what you just went to, but in answer to your second question of if anybody else has experienced something similar, I can relate on a small level. I recently told my best friend of 12 years about my ED. We text and email every day, spend hours on the phone together, used to live together, and now when we’re in the same country we usually just end up sleeping in each other’s beds. We’re close AF. I finally got up the courage to talk to her about it this Christmas, and her reaction was...not what I had hoped. She was horrified. She got really angry at me for not telling her sooner. She saw it as me lying to her. She told me I have to stop and when I tried to explain that it’s not really that simple, she just didn’t get it, or really make any attempt to. She brought up one of my massive pain points/guilt sources - that I’m 30 and this is a disease that primarily affects teenagers, and more or less told me to grow up. She didn’t ask me any questions or seem to want to talk about it at all. Since then, she’s not once brought it up or asked me how I’m doing. It’s like she’s pretending I never told her and that the issue doesn’t exist. I’m kind of crushed. This is the reason I never tell anybody I’m close to about this. It’s a very complex issue that’s shocking to people, and they find it hard to deal with. Often that leads to them reacting in very damaging ways.\n\nSo I do totally identify with what you went through, although I’m very aware that the two situations are not at all comparable. Thinking of you, and as I said I hope at least one of your friends comes to their senses and offers you an apology, at the bare minimum.",
      "created_utc": 1549487709.0,
      "score": 1,
      "context": []
    },
    {
      "id": "efwrxcr",
      "author": "throwaway24422344234",
      "body": "Hi dear! I just want to start off that I don’t like this incorrect use of “intervention” to describe what is really an attack. My close friend who struggles with depression was recently trapped in a so-called “intervention” by her old friends who berated her because they didn’t agree with her life choices. This is absolutely NOT supportive or helpful, which a true intervention should be. These “friends” used the guise of an intervention to vent about their anger directly at you in an antagonistic, selfish way. You said it yourself: they are NOT medical professionals, they have NOT reached out to you to talk first, and this fake intervention was in their self-interest not yours. Please continue to confide in your therapist and keep seeking true, professional help. And never be afraid to continue coming here and venting. We are all here to support each other through our very similar struggles.\n\nI know life feels like it’s crushing you right now, but I absolutely positively promise you that if you keep making the push to get better, you will find happiness elsewhere. Though I didn’t go through the same situations you have, I spent my high school years and earlier than that feeling as if there was nothing to live for. I didn’t desire to live or eat for the matter. It’s been a long and heavy battle but I’m still here and I’m happier than ever even when dealing with some issues here and there. I’m so happy I am where I’m at today. But I would not be here if I didn’t grit my teeth through the pain of life and keep pushing forward. I know you can do the same. I have so much faith in you, and I need you to find that faith in yourself. You ARE worth it. You ARE loved. And you are STRONG, even when you feel weakest.\n\nLeave the people behind who are only trying to drag you back. Keep moving forward and you’ll find people on the same path who will help you keep moving ahead. I know this is a long post. I just needed to tell you that even though I don’t know you, I am supporting you with all my heart. I know you can do this. Please please please don’t give up on yourself. ",
      "created_utc": 1549499471.0,
      "score": 1,
      "context": []
    },
    {
      "id": "efwsv1u",
      "author": "notenufsauce",
      "body": "The fuck kind of intervention is this",
      "created_utc": 1549500216.0,
      "score": 1,
      "context": []
    },
    {
      "id": "efwyuhf",
      "author": "kintyre",
      "body": "I'm really sorry your \"friends\" decided to do that to you. This last week has been one of the hardest ones for me and I only told people who reached out to me first how I was actually doing. When everything is shit, the last thing you need is all of the unsolicited advice, but people just seem to love to give it. Cliche as it sounds, try to focus on yourself now. Even if you can only work on one aspect of your life at a time and it's baby steps to getting to a healthier life, that's okay. ",
      "created_utc": 1549505051.0,
      "score": 1,
      "context": []
    },
    {
      "id": "efxk8fe",
      "author": "lolikittenv",
      "body": "Hey love, you’re so fucking strong. You can do this. Fuck people who treat you like shit. You’re a beautiful human being. You deserve to be healthy and happy. Breathe. Have some tea with honey. Sit outside and feel the sun. The world is full of horrible people but there is light and beauty all around you. This pain isn’t permanent. Suicide is. You can do this. You are strong. You are beautiful. You are worth so much. You deserve happiness and good health. Don’t give up. I promise this won’t be permanent. Please don’t hesitate to message me. \n\n- Recovering 12 years with anorexia, ptsd, DID, anxiety, depression. Lost my best friend to suicide in 2012 too. ",
      "created_utc": 1549527167.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ege2zq0",
      "author": "veganchknnoodle",
      "body": "you are not too much for people. you are not wrong or at fault for feeling what you feel. you are NOT your mental illnesses. if your “friends” can’t differentiate your personality from the things that go on in your brain that you can’t control ..... thank fuck they left. being alone (for right now) genuinely might be better than toxic and honestly emotionally abusive friends. i’m so sorry you have so many intrusive thoughts coming from so many directions. i’m also so proud of you for being vulnerable and opening up yourself to a community of people that share similar problems. i’m not sure where you live and even though i might be thousands of miles away you always have a friend here. please PM me any time you need someone. you’re gonna kick ED’s ass. ",
      "created_utc": 1550075580.0,
      "score": 1,
      "context": []
    },
    {
      "id": "egvxelr",
      "author": "mylifeisadankmeme",
      "body": "They are not friends.They are some things I would like to describe vividly but I won't.You get my gist.l wouldn't be surprised if a lot of people here would be happy to be your friend including me🤗.\nYou have 2 choices here,confront these bullies when you are feeling strong in yourself *in some way* ie letter,face to face or whatever suits you.\nOr let go of them,move on step by small step with help if you would like it.Hugs.xxx",
      "created_utc": 1550680606.0,
      "score": 1,
      "context": []
    },
    {
      "id": "efvwhht",
      "author": "daintyd10",
      "body": "Thank you so much. I’m trying really hard to be strong, but’s been one of those epically bad months, so I’m trying to hang in there. \n\n♥️",
      "created_utc": 1549477546.0,
      "score": 7,
      "context": [
        {
          "id": "efvewbp",
          "author": "None",
          "body": "You are stronger than all those people , they know nothing of your struggle and what it takes just function daily \n\nYour strength is immeasurable and although sometimes you may feel weak , trust me you’ve got this far and you are a bad mother fucker ! \n\nKeep up the good fight surround yourself with the thought of proving all those people wrong \n\nFight the good fight , you got this ! ",
          "created_utc": 1549465185.0
        }
      ]
    },
    {
      "id": "efvww6d",
      "author": "daintyd10",
      "body": "THANK YOU. It was such bullshit. I’m like SUPER scarred now. You better believe I’m never ever accepting an invite to something like this ever again. Unless there’s a professional, my therapist, and family. Never just with “friends”. \n\nAnd as far as the ex goes, it was a super fucked breakup. You can read about that shit here. \n\n[Worst breakup of my life](https://www.reddit.com/r/BreakUps/comments/aksui3/he_said_he_didnt_love_me_anymore_over_text/?st=JRTJ0EHQ&sh=97577c43) \n\nAnd thank you for the kind words. I really appreciate it. <3",
      "created_utc": 1549477814.0,
      "score": 5,
      "context": [
        {
          "id": "efvhyag",
          "author": "None",
          "body": "That is absolute bullshit. Mental health is really important and it needs to be acknowledged. Those \"friends\" of yours are very insensitive for doing what they did. So is your ex. Some people simply don't understand the impact they have on others. You're not alone, friend. You can push through this. Be kind to yourself and be proud for what progress you have made.",
          "created_utc": 1549467543.0
        }
      ]
    },
    {
      "id": "efvxhr9",
      "author": "daintyd10",
      "body": "Good riddance is right. The ringleader is officially out of my life as of this Sunday, but the other two are getting a second chance. Not like they deserve one. Neither contacted me to ask how I was doing after the intervention. \n\nI’m sorry you’ve been struggling so long as well. It’s a hard fucking fight every single day. Losing my best friend was one of the hardest things I’ve been through, but I pulled through. I still cry a lot, but I guess it’s gotten “easier”. \n\nAnd yes. Absolutely traumatized. I don’t know if I can look them in the eyes anymore. :(\n\nThanks for all the kind words. ♥️",
      "created_utc": 1549478215.0,
      "score": 5,
      "context": [
        {
          "id": "efvoyua",
          "author": "BooksThings",
          "body": "First off, I would like to say that those ‘friends’ of yours aren’t true friends.  I’d say good riddance to them.  You deserve much better friends.\n\nAs someone who has struggled with ED’s for 15 years, have struggled with depression & anxiety.  I know exactly what you are going through.  Only you went through worse than even me.  I’ve never lost a friend to suicide.  I cannot imagine. \n\nThose ‘friends’ never should of put you through that.  They actually traumatized you because they were bullying and ganging up on you.  That is never OK!  \n\nSounds to me like THEY are the toxic ones.  I am mad at your friends for you.  Totally uncalled for.  \n\n",
          "created_utc": 1549472501.0
        }
      ]
    },
    {
      "id": "efvy31b",
      "author": "daintyd10",
      "body": "Hi. Thanks for this. \n\nThey are awful, it’s true. And heartbreaking. We’ve been friends for a long time now, and they’ve totally betrayed my trust. \n\nMy parents used to yell at me, too. They can’t anymore bc I don’t live in the same state and hardly see them, but they do comment when they see me in pictures. \n\nAnd I would be concerned about me too, honestly. I’m in a bad place, so I understand their fears, but they went about it ass backwards. \n\nThanks for your insight. ♥️",
      "created_utc": 1549478606.0,
      "score": 3,
      "context": [
        {
          "id": "efvqadq",
          "author": "Valer_bear",
          "body": "This isn’t anyway to react to someone with an eating disorder. I’m sorry your friends reacted the way they did, that’s truly awful. I’ve honestly only told like 3 of my friends. They pretty much said the standard “get help.” My parents on the other hand constantly scream at me everyday to just eat and how my disorder is stupid/ childish and it’s just in my head, which technically it is but in my opinion that’s what makes it that much harder. The fact that it’s in my head makes it difficult to treat bc you have to completely change your perspective/outlook on life. So I feel you on your friends not being supportive or helpful. It’s a fucked situation. I think they’re clearly scared for you but maybe don’t know how to act about it? At least I think that’s why my parents act the way they do about it. Hopefully this helps and I hope you get better(: ",
          "created_utc": 1549473406.0
        }
      ]
    },
    {
      "id": "efwyx50",
      "author": "kintyre",
      "body": "The disorder is in our head, but the impact and the effects are very much real. ",
      "created_utc": 1549505111.0,
      "score": 1,
      "context": [
        {
          "id": "efvqadq",
          "author": "Valer_bear",
          "body": "This isn’t anyway to react to someone with an eating disorder. I’m sorry your friends reacted the way they did, that’s truly awful. I’ve honestly only told like 3 of my friends. They pretty much said the standard “get help.” My parents on the other hand constantly scream at me everyday to just eat and how my disorder is stupid/ childish and it’s just in my head, which technically it is but in my opinion that’s what makes it that much harder. The fact that it’s in my head makes it difficult to treat bc you have to completely change your perspective/outlook on life. So I feel you on your friends not being supportive or helpful. It’s a fucked situation. I think they’re clearly scared for you but maybe don’t know how to act about it? At least I think that’s why my parents act the way they do about it. Hopefully this helps and I hope you get better(: ",
          "created_utc": 1549473406.0
        }
      ]
    },
    {
      "id": "efvy6hg",
      "author": "daintyd10",
      "body": "I agree, thank you very much. I’m scared losing friends because I have a hard time maintaining relationships because of my other mental illnesses. So is a hard blow to me. :’(\n\nBut thank you very much for the offer. I may take you up on that. ♥️",
      "created_utc": 1549478670.0,
      "score": 3,
      "context": [
        {
          "id": "efvqmh6",
          "author": "ZeeBae03",
          "body": "Sounds like your “friends” did you a great service by showing their true colors and stepping out of your life. I know how much it sucks to lose friends but in this case, you WILL be better off. I’m just a stranger on the internet but I’m proud of you for what progress you have made and I can be here to talk if you need. ",
          "created_utc": 1549473635.0
        }
      ]
    },
    {
      "id": "efvz8ms",
      "author": "daintyd10",
      "body": "Thanks for your reply. \n\nI’m sorry you had an intervention as well. It’s honestly the worst position I’ve ever been put in. I’d have been more open if my family or therapist were present, but they didn’t think about that. They just acted selfishly, thinking they could handle an intervention. \n\nI do talk to my therapist about my thoughts, and thankfully she’s really helpful about it, but it obviously doesn’t end them as much as I’d like it to. And yes, having multiple mental illnesses is a huge bummer and each of them definitely influence my ED behaviors. I’m also sorry to hear you have multiple illnesses as well, but it’s great that you consider yourself recovered! I always hope to get there someday. \n\nAnd thank you for the offer. I may definitely reach out if I need additional support. And thanks for the kind words about my SH. That means a lot. I work really diligently to have distractions and alternative things to do. And exactly. Unfortunately my lack of eating isn’t intentional; I have no hunger queues after this long of my ED, but my will to eat is absolutely lower. It’s so hard to manage. (I use the recovery record app to remind me about meals, which is super helpful). \n\nAnyway, thank you very much for the kind words. I really appreciate it more than you know. ",
      "created_utc": 1549479376.0,
      "score": 2,
      "context": [
        {
          "id": "efvu6hm",
          "author": "whinywino89",
          "body": "Oh I am so sorry that this is all happening to you. I’ve had a surprise intervention in the past as well. For me, it was related to my depression and self harm. It was...awful. I came home to find my parents, aunts, and a pastor waiting for me... completely bombarded. It only made me pull away from them more. So, know that your feelings of anger are completely valid. \n\nI can sit here and say to go speak to someone about your suicidal thoughts; but ultimately: you need to make the choice to hang around this planet yourself. Life is HARD and it’s SO much harder with a cocktail of mental illnesses. I am anorexic (recovered but still struggle time to time), have major depression, anxiety, and body dysmorphic disorder. While I cannot understand your own cocktail, I do get how they all bounce off one another and when you feel like you finally have a handle on one disorder, another decides to be a reallll asshat. \n\nI know how lonely it can get when people just don’t understand; when they sit there and say to get help, look at the big picture, see the sun between the shitty clouds. Here, on this forum, know that you are not alone.  PM me if you need to vent! You are surrounded by some sucky people BUT that does not mean that you suck. Your situation sucks. Really, really sucks. It takes a lot to get through things like this, but it is possible. Look at how long you’ve gone without self harm! That is HUGE! I am ten years from the last time I engaged in self-harm, so I know how much of an accomplishment that is for you. I also know that when things are spiraling, when people suck, when nothing feels like it’s in your control, food can be controlled...so we control it. It’s not as simple as, “just eat!” Try: just being kind to yourself. Reach out to your therapist to let him/her know what’s going o, and tackle each day as it comes; nothing more, nothing less. ",
          "created_utc": 1549475995.0
        }
      ]
    },
    {
      "id": "efw9s2r",
      "author": "daintyd10",
      "body": "Thank you so much. \n\nI try extremely hard to not engage in self destructive behaviors (I guess except my restriction😑), and for the most part I’m pretty successful, so I very much appreciate the kudos. :)\n",
      "created_utc": 1549486371.0,
      "score": 2,
      "context": [
        {
          "id": "efvx01k",
          "author": "None",
          "body": ">\tAnyway, this was a pointless post, and I’m sorry. But I figured you all might know how I’m feeling and may have some solid advice or words for me\n\nNever pointless OP, it is good to get things written down, often it is when we make the most sense out of our thoughts and how we feel about them, as opposed to just having then swirl around up there.\n\nPlus the not self harming is a big deal, really. The fact you have held onto that part of strength is meaningful, it means you *have* made progress! If these people are really happy to bail on you because *your* problems are so very inconvenient for *them* then you are truly better off. It msy not feel like it but it is so. You have worth and a place here just as we all are deserving of.\n\n",
          "created_utc": 1549477887.0
        }
      ]
    },
    {
      "id": "efvwcxz",
      "author": "daintyd10",
      "body": "Thank you very much ♥️",
      "created_utc": 1549477460.0,
      "score": 2,
      "context": [
        {
          "id": "efvvp6m",
          "author": "ALFanator34",
          "body": "i know im just a stranger on the internet, but please feel free to message me. if you just want to vent or whatever the case might be, im here for you OP",
          "created_utc": 1549477017.0
        }
      ]
    },
    {
      "id": "efw9tyw",
      "author": "daintyd10",
      "body": "Thank you so much. Love back from the states. :)",
      "created_utc": 1549486405.0,
      "score": 2,
      "context": [
        {
          "id": "efw8smx",
          "author": "littlesleepymole99",
          "body": "Sounds like they didn't deserve you as a friend. I know what it's like to open up to friends about my mental illness and for them to belittle me. Just remember you're better than them. Sending you love from the rainy land of the UK",
          "created_utc": 1549485728.0
        }
      ]
    },
    {
      "id": "efx33ea",
      "author": "daintyd10",
      "body": "Thanks for confirming it’s not just in my head that they did this wrong. One of them has totally been making me feel irrational!",
      "created_utc": 1549508523.0,
      "score": 1,
      "context": [
        {
          "id": "efwrg7c",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1549499082.0
        }
      ]
    },
    {
      "id": "efxc277",
      "author": "daintyd10",
      "body": "Thank you so much for all of that encouragement. I read it like 3 times. Thank you thank you thank you. ♥️",
      "created_utc": 1549516571.0,
      "score": 2,
      "context": [
        {
          "id": "efwvyhc",
          "author": "Sunshinecrown",
          "body": "I gotta be honest, even though you outline ways you are failing, you do it with knowledge, strength, and courage.   I think you may be cutting yourself short and not giving yourself enough credit.  I hope you agree.  \n\nSuccesses:\n1-You can spot fake friends a mile away.  \n2-You don’t value the opinion of uninformed friends.\n3-You are not a puddle on the floor over the boyfriend who gifted you a shitty text while at work. \n4-You are moving on even though a boyfriend broke up with you. \n5-You reaches out for support to a community that YOU KNOW will have your back. \n6-You have not self-harmed=Major Success!!!\nList goes on and on. .....\n\nYou are a smart person.  Your ave a shining, sparkling personality that comes through in this message.  You are worth life, and worth fighting for!   You will get the friends and love life you desire and deserve.   I know it.  Hang on.....",
          "created_utc": 1549502713.0
        }
      ]
    },
    {
      "id": "efx0y5n",
      "author": "daintyd10",
      "body": "Thank you for such a long message. I appreciate you. \n\nI’m using the word “intervention” because that’s the word they used. One of them even cited having seen the show. \n\nAnd thank you for all the kind words. I have a hard time believing them now, but maybe I just need to read them several times. I’m sorry to about your struggles as well. I hope you’re feeling better nowadays. :)\n\nAgain, thank you so much for your support. It means the world. ♥️\n\n",
      "created_utc": 1549506765.0,
      "score": 1,
      "context": [
        {
          "id": "efwrxcr",
          "author": "throwaway24422344234",
          "body": "Hi dear! I just want to start off that I don’t like this incorrect use of “intervention” to describe what is really an attack. My close friend who struggles with depression was recently trapped in a so-called “intervention” by her old friends who berated her because they didn’t agree with her life choices. This is absolutely NOT supportive or helpful, which a true intervention should be. These “friends” used the guise of an intervention to vent about their anger directly at you in an antagonistic, selfish way. You said it yourself: they are NOT medical professionals, they have NOT reached out to you to talk first, and this fake intervention was in their self-interest not yours. Please continue to confide in your therapist and keep seeking true, professional help. And never be afraid to continue coming here and venting. We are all here to support each other through our very similar struggles.\n\nI know life feels like it’s crushing you right now, but I absolutely positively promise you that if you keep making the push to get better, you will find happiness elsewhere. Though I didn’t go through the same situations you have, I spent my high school years and earlier than that feeling as if there was nothing to live for. I didn’t desire to live or eat for the matter. It’s been a long and heavy battle but I’m still here and I’m happier than ever even when dealing with some issues here and there. I’m so happy I am where I’m at today. But I would not be here if I didn’t grit my teeth through the pain of life and keep pushing forward. I know you can do the same. I have so much faith in you, and I need you to find that faith in yourself. You ARE worth it. You ARE loved. And you are STRONG, even when you feel weakest.\n\nLeave the people behind who are only trying to drag you back. Keep moving forward and you’ll find people on the same path who will help you keep moving ahead. I know this is a long post. I just needed to tell you that even though I don’t know you, I am supporting you with all my heart. I know you can do this. Please please please don’t give up on yourself. ",
          "created_utc": 1549499471.0
        }
      ]
    },
    {
      "id": "efxbk7j",
      "author": "daintyd10",
      "body": "Thanks so much; that’s good advice. I’m just seriously like one massive ball of stress. And it’s happening through interviews at a higher paying job at a different company. My bf dumped me immediately after my first interview, and then this shit is going down right before my second interview (tomorrow morning😬😬😬). I’m extremely overwhelmed. 😞\n\nAlso, I’m sorry to hear you’re going through a rough time. I really really hope things improve for you. ♥️",
      "created_utc": 1549516066.0,
      "score": 1,
      "context": [
        {
          "id": "efwyuhf",
          "author": "kintyre",
          "body": "I'm really sorry your \"friends\" decided to do that to you. This last week has been one of the hardest ones for me and I only told people who reached out to me first how I was actually doing. When everything is shit, the last thing you need is all of the unsolicited advice, but people just seem to love to give it. Cliche as it sounds, try to focus on yourself now. Even if you can only work on one aspect of your life at a time and it's baby steps to getting to a healthier life, that's okay. ",
          "created_utc": 1549505051.0
        }
      ]
    },
    {
      "id": "efw1c6z",
      "author": "None",
      "body": "You can do it, there’s no shame in having bad days everyone on earth has them but it’s how you view the next day that counts , even on your worst day you’ve got through it , then you can say ok fuck today ! Tomorrow we go again ! \n\nI believe in you , if you ever need anymore motivation feel free to message me ",
      "created_utc": 1549480780.0,
      "score": 4,
      "context": [
        {
          "id": "efvewbp",
          "author": "None",
          "body": "You are stronger than all those people , they know nothing of your struggle and what it takes just function daily \n\nYour strength is immeasurable and although sometimes you may feel weak , trust me you’ve got this far and you are a bad mother fucker ! \n\nKeep up the good fight surround yourself with the thought of proving all those people wrong \n\nFight the good fight , you got this ! ",
          "created_utc": 1549465185.0
        },
        {
          "id": "efvwhht",
          "author": "daintyd10",
          "body": "Thank you so much. I’m trying really hard to be strong, but’s been one of those epically bad months, so I’m trying to hang in there. \n\n♥️",
          "created_utc": 1549477546.0
        }
      ]
    },
    {
      "id": "efwmahy",
      "author": "BooksThings",
      "body": "I hope things start looking up for you ❤️ and here’s to hoping you find better friends!",
      "created_utc": 1549495000.0,
      "score": 2,
      "context": [
        {
          "id": "efvoyua",
          "author": "BooksThings",
          "body": "First off, I would like to say that those ‘friends’ of yours aren’t true friends.  I’d say good riddance to them.  You deserve much better friends.\n\nAs someone who has struggled with ED’s for 15 years, have struggled with depression & anxiety.  I know exactly what you are going through.  Only you went through worse than even me.  I’ve never lost a friend to suicide.  I cannot imagine. \n\nThose ‘friends’ never should of put you through that.  They actually traumatized you because they were bullying and ganging up on you.  That is never OK!  \n\nSounds to me like THEY are the toxic ones.  I am mad at your friends for you.  Totally uncalled for.  \n\n",
          "created_utc": 1549472501.0
        },
        {
          "id": "efvxhr9",
          "author": "daintyd10",
          "body": "Good riddance is right. The ringleader is officially out of my life as of this Sunday, but the other two are getting a second chance. Not like they deserve one. Neither contacted me to ask how I was doing after the intervention. \n\nI’m sorry you’ve been struggling so long as well. It’s a hard fucking fight every single day. Losing my best friend was one of the hardest things I’ve been through, but I pulled through. I still cry a lot, but I guess it’s gotten “easier”. \n\nAnd yes. Absolutely traumatized. I don’t know if I can look them in the eyes anymore. :(\n\nThanks for all the kind words. ♥️",
          "created_utc": 1549478215.0
        }
      ]
    },
    {
      "id": "efvykyj",
      "author": "Valer_bear",
      "body": "No problem! I’m glad I could help(: yeah I feel you, I’m also in a bad place currently and people are scared for me. I know their concern comes from a good place at heart but some people just go about it the wrong way. Hopefully we can both get the help we need and get through this though 😊 ",
      "created_utc": 1549478937.0,
      "score": 1,
      "context": [
        {
          "id": "efvqadq",
          "author": "Valer_bear",
          "body": "This isn’t anyway to react to someone with an eating disorder. I’m sorry your friends reacted the way they did, that’s truly awful. I’ve honestly only told like 3 of my friends. They pretty much said the standard “get help.” My parents on the other hand constantly scream at me everyday to just eat and how my disorder is stupid/ childish and it’s just in my head, which technically it is but in my opinion that’s what makes it that much harder. The fact that it’s in my head makes it difficult to treat bc you have to completely change your perspective/outlook on life. So I feel you on your friends not being supportive or helpful. It’s a fucked situation. I think they’re clearly scared for you but maybe don’t know how to act about it? At least I think that’s why my parents act the way they do about it. Hopefully this helps and I hope you get better(: ",
          "created_utc": 1549473406.0
        },
        {
          "id": "efvy31b",
          "author": "daintyd10",
          "body": "Hi. Thanks for this. \n\nThey are awful, it’s true. And heartbreaking. We’ve been friends for a long time now, and they’ve totally betrayed my trust. \n\nMy parents used to yell at me, too. They can’t anymore bc I don’t live in the same state and hardly see them, but they do comment when they see me in pictures. \n\nAnd I would be concerned about me too, honestly. I’m in a bad place, so I understand their fears, but they went about it ass backwards. \n\nThanks for your insight. ♥️",
          "created_utc": 1549478606.0
        }
      ]
    },
    {
      "id": "efw1291",
      "author": "ZeeBae03",
      "body": "I fully understand. I lost my entire circle when I found out they all talked crap behind my back about my bipolar episodes and my anxiety. But then by some miracle I found a new group of friends that are my family more than my bio family. Just hang in there, love. Good things will come, I promise. :) ",
      "created_utc": 1549480597.0,
      "score": 3,
      "context": [
        {
          "id": "efvqmh6",
          "author": "ZeeBae03",
          "body": "Sounds like your “friends” did you a great service by showing their true colors and stepping out of your life. I know how much it sucks to lose friends but in this case, you WILL be better off. I’m just a stranger on the internet but I’m proud of you for what progress you have made and I can be here to talk if you need. ",
          "created_utc": 1549473635.0
        },
        {
          "id": "efvy6hg",
          "author": "daintyd10",
          "body": "I agree, thank you very much. I’m scared losing friends because I have a hard time maintaining relationships because of my other mental illnesses. So is a hard blow to me. :’(\n\nBut thank you very much for the offer. I may take you up on that. ♥️",
          "created_utc": 1549478670.0
        }
      ]
    },
    {
      "id": "efw9mkv",
      "author": "daintyd10",
      "body": "Thank you!",
      "created_utc": 1549486271.0,
      "score": 3,
      "context": [
        {
          "id": "efvewbp",
          "author": "None",
          "body": "You are stronger than all those people , they know nothing of your struggle and what it takes just function daily \n\nYour strength is immeasurable and although sometimes you may feel weak , trust me you’ve got this far and you are a bad mother fucker ! \n\nKeep up the good fight surround yourself with the thought of proving all those people wrong \n\nFight the good fight , you got this ! ",
          "created_utc": 1549465185.0
        },
        {
          "id": "efvwhht",
          "author": "daintyd10",
          "body": "Thank you so much. I’m trying really hard to be strong, but’s been one of those epically bad months, so I’m trying to hang in there. \n\n♥️",
          "created_utc": 1549477546.0
        },
        {
          "id": "efw1c6z",
          "author": "None",
          "body": "You can do it, there’s no shame in having bad days everyone on earth has them but it’s how you view the next day that counts , even on your worst day you’ve got through it , then you can say ok fuck today ! Tomorrow we go again ! \n\nI believe in you , if you ever need anymore motivation feel free to message me ",
          "created_utc": 1549480780.0
        }
      ]
    },
    {
      "id": "efwqq4y",
      "author": "daintyd10",
      "body": "Thank youuuuu♥️",
      "created_utc": 1549498489.0,
      "score": 1,
      "context": [
        {
          "id": "efvoyua",
          "author": "BooksThings",
          "body": "First off, I would like to say that those ‘friends’ of yours aren’t true friends.  I’d say good riddance to them.  You deserve much better friends.\n\nAs someone who has struggled with ED’s for 15 years, have struggled with depression & anxiety.  I know exactly what you are going through.  Only you went through worse than even me.  I’ve never lost a friend to suicide.  I cannot imagine. \n\nThose ‘friends’ never should of put you through that.  They actually traumatized you because they were bullying and ganging up on you.  That is never OK!  \n\nSounds to me like THEY are the toxic ones.  I am mad at your friends for you.  Totally uncalled for.  \n\n",
          "created_utc": 1549472501.0
        },
        {
          "id": "efvxhr9",
          "author": "daintyd10",
          "body": "Good riddance is right. The ringleader is officially out of my life as of this Sunday, but the other two are getting a second chance. Not like they deserve one. Neither contacted me to ask how I was doing after the intervention. \n\nI’m sorry you’ve been struggling so long as well. It’s a hard fucking fight every single day. Losing my best friend was one of the hardest things I’ve been through, but I pulled through. I still cry a lot, but I guess it’s gotten “easier”. \n\nAnd yes. Absolutely traumatized. I don’t know if I can look them in the eyes anymore. :(\n\nThanks for all the kind words. ♥️",
          "created_utc": 1549478215.0
        },
        {
          "id": "efwmahy",
          "author": "BooksThings",
          "body": "I hope things start looking up for you ❤️ and here’s to hoping you find better friends!",
          "created_utc": 1549495000.0
        }
      ]
    },
    {
      "id": "efvzbsf",
      "author": "daintyd10",
      "body": "I hope so too!!",
      "created_utc": 1549479435.0,
      "score": 2,
      "context": [
        {
          "id": "efvqadq",
          "author": "Valer_bear",
          "body": "This isn’t anyway to react to someone with an eating disorder. I’m sorry your friends reacted the way they did, that’s truly awful. I’ve honestly only told like 3 of my friends. They pretty much said the standard “get help.” My parents on the other hand constantly scream at me everyday to just eat and how my disorder is stupid/ childish and it’s just in my head, which technically it is but in my opinion that’s what makes it that much harder. The fact that it’s in my head makes it difficult to treat bc you have to completely change your perspective/outlook on life. So I feel you on your friends not being supportive or helpful. It’s a fucked situation. I think they’re clearly scared for you but maybe don’t know how to act about it? At least I think that’s why my parents act the way they do about it. Hopefully this helps and I hope you get better(: ",
          "created_utc": 1549473406.0
        },
        {
          "id": "efvy31b",
          "author": "daintyd10",
          "body": "Hi. Thanks for this. \n\nThey are awful, it’s true. And heartbreaking. We’ve been friends for a long time now, and they’ve totally betrayed my trust. \n\nMy parents used to yell at me, too. They can’t anymore bc I don’t live in the same state and hardly see them, but they do comment when they see me in pictures. \n\nAnd I would be concerned about me too, honestly. I’m in a bad place, so I understand their fears, but they went about it ass backwards. \n\nThanks for your insight. ♥️",
          "created_utc": 1549478606.0
        },
        {
          "id": "efvykyj",
          "author": "Valer_bear",
          "body": "No problem! I’m glad I could help(: yeah I feel you, I’m also in a bad place currently and people are scared for me. I know their concern comes from a good place at heart but some people just go about it the wrong way. Hopefully we can both get the help we need and get through this though 😊 ",
          "created_utc": 1549478937.0
        }
      ]
    },
    {
      "id": "efw5bnq",
      "author": "daintyd10",
      "body": "Thank you so much. I’m sorry you lost your friends as well. But it sounds like it was for the better, and hopefully mine is too. \n\n♥️",
      "created_utc": 1549483439.0,
      "score": 5,
      "context": [
        {
          "id": "efvqmh6",
          "author": "ZeeBae03",
          "body": "Sounds like your “friends” did you a great service by showing their true colors and stepping out of your life. I know how much it sucks to lose friends but in this case, you WILL be better off. I’m just a stranger on the internet but I’m proud of you for what progress you have made and I can be here to talk if you need. ",
          "created_utc": 1549473635.0
        },
        {
          "id": "efvy6hg",
          "author": "daintyd10",
          "body": "I agree, thank you very much. I’m scared losing friends because I have a hard time maintaining relationships because of my other mental illnesses. So is a hard blow to me. :’(\n\nBut thank you very much for the offer. I may take you up on that. ♥️",
          "created_utc": 1549478670.0
        },
        {
          "id": "efw1291",
          "author": "ZeeBae03",
          "body": "I fully understand. I lost my entire circle when I found out they all talked crap behind my back about my bipolar episodes and my anxiety. But then by some miracle I found a new group of friends that are my family more than my bio family. Just hang in there, love. Good things will come, I promise. :) ",
          "created_utc": 1549480597.0
        }
      ]
    }
  ]
}