{
  "id": "apf16z",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1549881821.0,
  "title": "Request: Advice for boyfriend of girl with anorexia",
  "selftext": " \n\nHey people of reddit. I’m desperate for advice...\n\nMy girlfriend of a little under a year is going through a really tough time right now and I’m not sure what to do.\n\nHer therapist, her doctor, and a few of her friends and family have all shown concern about her eating habits. We have all made attempts to talk to her about it but she shuts down and gets extremely defensive and denies the possibility of an eating disorder. For a while, I have just been by her side comforting her and being as supportive as humanly possible.\n\nThe past few weeks she’s gone to her therapist and come home extremely upset. I would ask her if it was something she wanted to talk about or something she just wanted to just be left alone. When she would talk to me about it, it was always because her therapist would begin asking her about her eating and talk to her about developing a good relationship with food, etc. she would always follow up with something along the lines of, “this is ridiculous! I don’t have an eating disorder! I can eat a lot of food when I want to! She just sounds exactly like my grandparents.”\n\nShe will eat one or maybe two “meals” a day. These meals are usually a cup of yogurt with granola or some rice with cheese, tomatoes, and black beans.... which is one of the best meals she eats. \n\nShe is very skinny. Unhealthily skinny. She still has a rather regular mensural cycle which I see as a good sign, but recently her kidneys and digestive tract have been giving her trouble along with extreme fatigue and regular depression.\n\nI have been standing by as the supportive boyfriend, but now she is threatening to stop seeing her therapist and psychiatrist because they are “trying to tell her she has something she doesn’t.” She’s underweight and still dropping weight. I really really want to know if there’s a good way to help her come around and open up to the possibility of her having an eating disorder so she can actually start getting better.\n\nShe has always been concerned about her weight and always talks about how she wants to gain weight because she knows she’s not healthy. She will do good for a few days, then go a few days eating one meal or not eating at all because she says she just forgot or it wasn’t convenient. She gets down on herself, then she won’t eat because she says she’s so down that she’s not hungry.\n\nI’m just really worried and at my wits end. Any advice is welcome.\n\nTo be clear, I am very careful NEVER to tell her to eat, tell her she should eat, tell her she is too skinny, or anything of the sort. I am sure to always tell her she will get to where she wants to be, she can do it, tell her she’s doing great when she has good days and reassure her that she is strong enough to get through the bad days.\n\nWhen I make food for myself, I always make enough for her and offer it to her in a non suggestive way and never get on her when she turns it down.\n\nTL;DR\n\nGirlfriends therapist, doctor, and some family/friends have all shown concern about her eating habits but she is in complete denial. She is now beginning to suffer extreme health consequences because of her eating habits and still won’t come around to the thought of an eating disorder. She eats  very little. She is underweight. Diagnosed depression/anxiety, ADHD. Is threatening to leave her therapist because she is showing concern for her eating. Need advice.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/apf16z/request_advice_for_boyfriend_of_girl_with_anorexia/",
  "score": 47,
  "num_comments": 14,
  "comments": [
    {
      "id": "eg7xciq",
      "author": "sharninini",
      "body": "I just wanted to say you sound like an amazing boyfriend!!! To care this much and be so careful with what you say and do. She is a lucky girl.\nIt’s hard to help people when they don’t want to help themselves. But you can see the behaviour more than she sees it, since you are there with an objective eye every day. Are there certain foods she won’t eat? Could you try asking her if you can treat her and cook her dinner and see how she reacts as a way to start a conversation?\nA professional will probably have much better ideas than me. Good luck!",
      "created_utc": 1549888818.0,
      "score": 35,
      "context": []
    },
    {
      "id": "eg7ttzv",
      "author": "rachihc",
      "body": "Wow sounds like a hard situation. Being in denial about your issues are the biggest obstacle to tackle them. Specially if you are disregarding a professionals opinion.\n\n  \nYou sound like an amazing supportive boyfriend.   \nI would suggest that when she is in the mood or talking about eating healthier and gaining weight suggest to go to a RD \\*registered dietitian\\* (it is better than a nutritionist as they are actual physicians) so she gets a nice diet and doesn't have to think about next meal, maybe offer her to follow the diet with her, so she is encouraged. Maybe get the info of one and ask if they are available, keeping the info close to pop it when the situation comes up.   \nIdk if it is her case but when I was young I had no idea of how a proper diet with the required nutrition looked like, and this is a problem for many people that think that \"they eat fine\" when they don't.   \n\n\nI really hope she keeps going to the doc and therapist. ",
      "created_utc": 1549883908.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eg8uelo",
      "author": "Spectacle_",
      "body": "I have, had anorexia. You can lead a horse to water, but you can't force it to drink. She won't beat something she doesnt think she has. Or won't admit and tell the truth about.\n\nEating disorders are egosyntonic disorders. Its not like depression where you feel bad and want to get better. She would enjoy parts of her eating disorder or be afraid to eat and gain weight. Trying to beat an eating disorder is basically signing up to feel really bad, so it maintains the disorder. You have to find a reason to fight to get well. Mine was because I didnt want to feel as mentally unwell as I was and feel like killing myself, severe anxiety and severe depression. Aka rock bottom. I wanted to not lose everything. My ability to work and be a nurse etc.\n\nThe question is, is she in denial? Lying? Or telling the truth.\n\nCognitively, what is going on for her? Is she afraid of food, very restrictive in her choices? Is she trying to lose weight? Does she think she is fat? Does she try to exercise control, or demonstrate any obsessive behaviours surrounding food? Is her portioning appropriate?\n\nOne thing I considered, is she could be telling the truth- perhaps even partially. If she has digestive issues, or certain medications or even by starvation etc... hunger cues and hormones can become diminished. She can have physical symptoms that make it hard for her to eat or even sick when she does try to. I know everyone ignores and underscored the reality of this for me in my recovery.. saying it was anxiety. I know better now.\n\nFor me it was very hard to contend with poor appetite and physical symptoms in my recovery, related to starvation and from my antidepressant.\n\n\n\n",
      "created_utc": 1549912126.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eg7yysy",
      "author": "Sal_42",
      "body": "Can I just say, props to you for being such a supportive partner. She is lucky to have someone like you who is so caring and considerate. What she is going through is very hard and complicated, and it is a tough situation for you too.\n\nPlease encourage her to keep seeing her therapist, and remind her that her therapist only wants what's best for her. If she acknowledges that her current weight is unhealthy, that's a good sign. If she can logically see that she needs to change her eating habits and gain weight, then it's logical that her therapist also wants to encourage her to eat healthily and be a healthy weight, yes?  Even though she thinks she doesn't have an eating disorder, she has depression and really does need a professional to talk to regularly. \n\nIt might be best to avoid labels while she is in a stage of denial - sometimes acknowledging that you have 'disordered eating patterns' is easier than accepting a diagnosis or label of 'anorexia'. \n\nTry and focus on small positive changes, one at a time. If she needs meals to be quick and conveniant, you could try getting protein shakes and protein bars for snacks, and look into companies that deliver pre-prepared meal plans or even microwavable meals. Making small goals, writing them down and having accountability is a good idea, but she needs to be on board with it too. Have a conversation with her and ask what small attainable goals she thinks she would be comfortable with, and agree on a way to keep her accountable to own goals - for example, aiming to eat 3 meals a day of a particular nutritional value, and talking to you about whether she was able to meet this goal every day. If she has access to foods and meals that she enjoys and are conveniant, and is still struggling to meet a very attainable and reasonable goal, this may also raise her self-awareness of her problem. An appointment with a dietician may or may not help at this point, but they might have some suggestions that she can agree on. It really depends on her level of commitment to getting better.\n\nI hope some of this advice is useful to you. Remember to look after yourself too and practice self-care.",
      "created_utc": 1549890692.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eg8lrmk",
      "author": "alybi",
      "body": "That’s an extremely tough spot to be in, but I think it’s amazing how supportive you are, wow! Ultimately though, it’s up to her. Continue showing your support, but she’s the one who has to want to get help. If she doesn’t see it as a problem, she may have a ways to go. Wishing both of you lots of luck and sending love ",
      "created_utc": 1549907265.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eg8v5b3",
      "author": "Heartfr0st",
      "body": "You sound like an amazing caring partner!  Really what you’re doing for her even now is amazing.  Maybe talk to her and find out what foods she really likes.  Try cooking for her several times a week, including those foods in the recipes.  It’ll encourage her to eat more, because it does sound like she wants to gain weight, there’s just something in her head stopping her.  Making eating a no pressure and enjoyable experience may help.\n\nAlso, encourage her to NOT stop seeing her therapist and such.  I had to stop seeing mine over winter break when I was home for college, and in that time I relapsed pretty hard and I not only haven’t been back to see her, but am now back in the mindset of not wanting to recover.  She needs to have that constant reminder and encouragement to get better or things can spiral pretty quickly.",
      "created_utc": 1549912547.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eg970jk",
      "author": "Valer_bear",
      "body": "First off, you seem very sweet and supportive which is good (: second , it’s good she still has her period and that you don’t point out how thin she is as that can be enabling her disorder . Try to maybe reason with her on why she should continue seeing her therapist / psychiatrist. Maybe talk about potentially doing IP or go to a nutritionist with her to work on meal plans she could do to slowly up her calories / meals . ",
      "created_utc": 1549919205.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ega7piv",
      "author": "None",
      "body": "Wow sounds like me. My boyfriend found it too difficult and broke up with me though, so you’re doing a great job being supportive!\nI agree with the person who said avoid labels for now. Maybe she has something like ARFID, or maybe just “disordered eating” due to stress triggers. But if she’s in denial, she’s going to get more upset at being “accused” of having a disorder. \n\nIt’s a good thing you seem to know about nutrition and what she may need/is lacking in. You’re doing a great job at offering, but not pushing, her to eat meals you’ve made. This is really really hard, for both parties. Maybe offer to see a therapist *with* her to try to keep her in therapy? But also, who knows, maybe she just needs a *different* therapist- not to quit but just find one better suited for her. \n\nWhat I wish I had: to be told I was loved no matter what. That we ALL have our problems. And that I’m worthy of being a partner even though I struggle with eating. \n\nYou’re doing great, and good luck! ",
      "created_utc": 1549944133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eg8j7y8",
      "author": "sjm021",
      "body": "You are the perfect boyfriend, believe me, she's going to go out from that eating disorder with your help. Listen, my friend had an eating disorder too, and veganism saved her life. Veganism, intuitive and healthy eating change her life, and mine tho! Maybe you can look for information about this (send me a dm and I'll send you some helpful sources) and you can introduce her on this topic. There are a lot of people who save their life by switching their lifestyle to a vegan one. I'm here to help you and your girlfriend. Feel free to send me a message ",
      "created_utc": 1549905796.0,
      "score": -3,
      "context": []
    },
    {
      "id": "eg8bka7",
      "author": "Nednerb_Mac",
      "body": "Very true about being able to see behavior from the outside. Seems like we can all spot others faults a lot easier than our own. I find it important to remind myself that we all have faults, and that I have some that I may not see.\n\nI usually do cook ya both dinner and she will usually eat it, and a big portion of it too! It’s just may be her only meal that day or the past few days.\n\nThank you for the encouraging words!",
      "created_utc": 1549901060.0,
      "score": 4,
      "context": [
        {
          "id": "eg7xciq",
          "author": "sharninini",
          "body": "I just wanted to say you sound like an amazing boyfriend!!! To care this much and be so careful with what you say and do. She is a lucky girl.\nIt’s hard to help people when they don’t want to help themselves. But you can see the behaviour more than she sees it, since you are there with an objective eye every day. Are there certain foods she won’t eat? Could you try asking her if you can treat her and cook her dinner and see how she reacts as a way to start a conversation?\nA professional will probably have much better ideas than me. Good luck!",
          "created_utc": 1549888818.0
        }
      ]
    },
    {
      "id": "eg8bu6l",
      "author": "Nednerb_Mac",
      "body": "That’s a great idea! I will be looking up RD’s in my area to keep their info on hand.\n\nI definitely do get the lack of knowledge on a proper diet. We don’t learn this stuff in school. Only reason I really know much on the topic is because I majored in Health and Fitness Science.\n\nThank you for the encouraging words!",
      "created_utc": 1549901238.0,
      "score": 4,
      "context": [
        {
          "id": "eg7ttzv",
          "author": "rachihc",
          "body": "Wow sounds like a hard situation. Being in denial about your issues are the biggest obstacle to tackle them. Specially if you are disregarding a professionals opinion.\n\n  \nYou sound like an amazing supportive boyfriend.   \nI would suggest that when she is in the mood or talking about eating healthier and gaining weight suggest to go to a RD \\*registered dietitian\\* (it is better than a nutritionist as they are actual physicians) so she gets a nice diet and doesn't have to think about next meal, maybe offer her to follow the diet with her, so she is encouraged. Maybe get the info of one and ask if they are available, keeping the info close to pop it when the situation comes up.   \nIdk if it is her case but when I was young I had no idea of how a proper diet with the required nutrition looked like, and this is a problem for many people that think that \"they eat fine\" when they don't.   \n\n\nI really hope she keeps going to the doc and therapist. ",
          "created_utc": 1549883908.0
        }
      ]
    },
    {
      "id": "eg8vv4z",
      "author": "Nednerb_Mac",
      "body": "Wow! Thank you so much. This post really brings some insight. I guess by filling definitions, she falls more under the category of disordered eating rather than having a diagnosable eating disorder. \n\nThe times she does not eat or doesn’t want to eat are when she is going through a stressful time or when she is having a panic attack.\n\nAll throughout her childhood she was told she needed to gain weight by her family. They would skip bacon or extra fat or calories in general into her meals and she became a resentful of that. Because of this, she does not have a great relationship with food and is easily triggered when suggestions of eating are directed toward her. (I have often mentioned she should try to eat something and drink some water when she says she feels faint, cloudy, complains or a headache or feels uneasy... this was more coming from a medical standpoint, knowing low blood sugar often causes these symptoms and food tends to resolve them.) It wasn’t always taken in the light I intended and I quickly learned a better approach.\n\nThe slightest implication that she SHOULD eat something or NEEDS to eat something immediately triggers this response in her that makes her not want to eat.\n\nSo in this light, maybe attacking the disordered eating wouldn’t necessarily be the best case. More like treating a symptom rather than the cause.\n\nThank you so much for your words!",
      "created_utc": 1549912957.0,
      "score": 2,
      "context": [
        {
          "id": "eg8uelo",
          "author": "Spectacle_",
          "body": "I have, had anorexia. You can lead a horse to water, but you can't force it to drink. She won't beat something she doesnt think she has. Or won't admit and tell the truth about.\n\nEating disorders are egosyntonic disorders. Its not like depression where you feel bad and want to get better. She would enjoy parts of her eating disorder or be afraid to eat and gain weight. Trying to beat an eating disorder is basically signing up to feel really bad, so it maintains the disorder. You have to find a reason to fight to get well. Mine was because I didnt want to feel as mentally unwell as I was and feel like killing myself, severe anxiety and severe depression. Aka rock bottom. I wanted to not lose everything. My ability to work and be a nurse etc.\n\nThe question is, is she in denial? Lying? Or telling the truth.\n\nCognitively, what is going on for her? Is she afraid of food, very restrictive in her choices? Is she trying to lose weight? Does she think she is fat? Does she try to exercise control, or demonstrate any obsessive behaviours surrounding food? Is her portioning appropriate?\n\nOne thing I considered, is she could be telling the truth- perhaps even partially. If she has digestive issues, or certain medications or even by starvation etc... hunger cues and hormones can become diminished. She can have physical symptoms that make it hard for her to eat or even sick when she does try to. I know everyone ignores and underscored the reality of this for me in my recovery.. saying it was anxiety. I know better now.\n\nFor me it was very hard to contend with poor appetite and physical symptoms in my recovery, related to starvation and from my antidepressant.\n\n\n\n",
          "created_utc": 1549912126.0
        }
      ]
    },
    {
      "id": "eg8dcgr",
      "author": "Nednerb_Mac",
      "body": "I definitely will keep on encouraging her to see her therapist. She’s made so much progress dealing with her childhood traumas (which seem to be where her eating habits stem from).\n\nI completely understand the avoidance of labels right now. I don’t really like labeling much either, though I do find it empowering to label something once you come to terms with accepting a situation. I’m not a very religious man, but I definitely do believe we gain power over our demons when we know their names.\n\nWhen she talks about eating disorders, she seems to have demonized them to the point that she feels the need to deny it and that it is beyond her control. I am sensitive to the fact that this is very real to her and is the reality she lives in. I just hope that I can help her see things in a different light that allow her more control.\n\nShe has a very good whole-food ingredient mass gainer that she bought a while back, but she refuses to drink the shakes. She will for a while and I will ask her if there’s anything I can do to help her out with her goal of drinking one a day, and she tells me she would like me to hold her accountable. However, she will either end up refusing to drink them or lie about drinking them. She will also set goals to eat three meals a day and stick with it for a few days but then fall off. I try to encourage her and tell her that there are some days of the week where even I only eat twice a day and that our body’s are very resilient when it comes to food and that we can get back on track the next day but it seems to skip away and she loses hope all over again.\n\nWe would also meal prep every week, but the following week, she would either be too tired to prep the meals or wouldn’t have enough money to buy all the food for it.\n\nIt seems to be pretty common advice to see a RD and I will definitely find a way to bring that up to her. Finding the money for the appointment will be a different issue as we are both struggling college students. \n\nThank you for the encouraging words and advice!",
      "created_utc": 1549902196.0,
      "score": 2,
      "context": [
        {
          "id": "eg7yysy",
          "author": "Sal_42",
          "body": "Can I just say, props to you for being such a supportive partner. She is lucky to have someone like you who is so caring and considerate. What she is going through is very hard and complicated, and it is a tough situation for you too.\n\nPlease encourage her to keep seeing her therapist, and remind her that her therapist only wants what's best for her. If she acknowledges that her current weight is unhealthy, that's a good sign. If she can logically see that she needs to change her eating habits and gain weight, then it's logical that her therapist also wants to encourage her to eat healthily and be a healthy weight, yes?  Even though she thinks she doesn't have an eating disorder, she has depression and really does need a professional to talk to regularly. \n\nIt might be best to avoid labels while she is in a stage of denial - sometimes acknowledging that you have 'disordered eating patterns' is easier than accepting a diagnosis or label of 'anorexia'. \n\nTry and focus on small positive changes, one at a time. If she needs meals to be quick and conveniant, you could try getting protein shakes and protein bars for snacks, and look into companies that deliver pre-prepared meal plans or even microwavable meals. Making small goals, writing them down and having accountability is a good idea, but she needs to be on board with it too. Have a conversation with her and ask what small attainable goals she thinks she would be comfortable with, and agree on a way to keep her accountable to own goals - for example, aiming to eat 3 meals a day of a particular nutritional value, and talking to you about whether she was able to meet this goal every day. If she has access to foods and meals that she enjoys and are conveniant, and is still struggling to meet a very attainable and reasonable goal, this may also raise her self-awareness of her problem. An appointment with a dietician may or may not help at this point, but they might have some suggestions that she can agree on. It really depends on her level of commitment to getting better.\n\nI hope some of this advice is useful to you. Remember to look after yourself too and practice self-care.",
          "created_utc": 1549890692.0
        }
      ]
    },
    {
      "id": "eg8tk6m",
      "author": "throwaway862153",
      "body": "Veganism is not a cure for an eating disorder. I understand that it may be helpful for some people.. But for the vast majority it would be extremely detrimental and is not advice that anyone who is professionally trained would suggest. This is dangerous advice. \n\nEDIT: From you own post history veganism is clearly not helping you with your eating struggles and seems to be complicating the issue so please do not go giving people this sort of advice. ",
      "created_utc": 1549911652.0,
      "score": 5,
      "context": [
        {
          "id": "eg8j7y8",
          "author": "sjm021",
          "body": "You are the perfect boyfriend, believe me, she's going to go out from that eating disorder with your help. Listen, my friend had an eating disorder too, and veganism saved her life. Veganism, intuitive and healthy eating change her life, and mine tho! Maybe you can look for information about this (send me a dm and I'll send you some helpful sources) and you can introduce her on this topic. There are a lot of people who save their life by switching their lifestyle to a vegan one. I'm here to help you and your girlfriend. Feel free to send me a message ",
          "created_utc": 1549905796.0
        }
      ]
    }
  ]
}