{
  "id": "ax5sj7",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1551696347.0,
  "title": "Request: Can’t Stop Once I Start",
  "selftext": " \n\nI’ve had a restrictive eating disorder for many years. I’ve noticed that when I start eating, I literally cannot stop. No matter what it is, when no one is watching, I can continuously stuff down an absurd amount of anything from popcorn, to cereal, to carrots, or grapes. I know it’s because I’m restricting during the day, but I restrict because I’m afraid I’ll overeat because I can’t stop! Any advice on how to break this cycle?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ax5sj7/request_cant_stop_once_i_start/",
  "score": 40,
  "num_comments": 11,
  "comments": [
    {
      "id": "ehrw0k4",
      "author": "shafaqsalman",
      "body": "I'd suggest you to first set your mind in the direction of recovery. Once you've managed to do that, let me give you a heads up- you'll be eating a lot. Since you've had a long past of restriction, your body has been deprived of calories and nutrients for a long, long time. So 'overeating'would be very normal (if not necessary) in your recovery. \n\nYou'll be hungry almost all the time. Every single hour. Just be prepared. And understand that this is normal. Since our natural human instinct is to survive, it's going to want to eat as much as possible to make up for the restrictive past. Trust your body and its needs. You're going to be okay, you won't be overeating forever. \n\nOnce your body is gonna start trusting you again, the overeating will stop because your body will know there's no threat (of starvation). Get well soon 💚",
      "created_utc": 1551716525.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ehsrm7e",
      "author": "unicorns-n-mermaids",
      "body": "I have this same problem. I'm about a year and a half into my best attempt at recovery, and it's definitely getting better as my natural hunger cues are starting to come back. For the first year or so, I would eat to the point of feeling incredibly stuffed if I ate at all, and it was so hard because I wanted to try to eat to get better. Just give yourself grace, this will pass and things will even out. Working with a nutritionist helped some, but most of all time and consciously reminding myself that it's okay to eat, if I get hungry again later I can eat again (I think part of my tendency to overeat came from feeling like this was my one chance to eat until who knows when, even when trying to recover because what if the next day was a bad day and I wouldn't be able to stop myself from restricting?) and going slow while eating. Now, when I know I'm getting full, I take one last sip of water and take the best most delicious bite possible to be my final bite for that meal. Best of luck to you! ",
      "created_utc": 1551738176.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ehsrbj1",
      "author": "VTMongoose",
      "body": "Google \"extreme hunger\" during recovery. I had it, lots of other people have it during recovery. It's horrible, but it is not binging. You are responding to physical hunger. Your leptin feedback system is broken from the restriction and the only way to straighten it out sadly is to add body fat. Just understand it's all temporary and part of the process. You will feel 1000 times better in the long run if you put genuine effort into overcoming the urge to restrict and refeeding yourself. Even a lot of the body fat overshoot goes away on its own with time. I've found the less I restrict, the less hungry I am. Ending the restriction is the key to recovery.",
      "created_utc": 1551737964.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ehrd9ft",
      "author": "covhr",
      "body": "get yourself a dietitian who can help you build a meal plan that will balance your intake. As you discovered, restricting during the day can cause bingeing later. You'd be better off eating in a balanced way all day, which will minimize your chances of a binge later.\n",
      "created_utc": 1551697726.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ehsoigh",
      "author": "caarols",
      "body": "drink a lot of water and eat a lot of veggies before you start eating anything else. Then take a 30 min break after your meal to allow yourself to decide if you are still hungry or not. Maybe have a routine or a structured schedule so that you eat main meals rather than random snacks too. Hope it help, good luck x",
      "created_utc": 1551735982.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ehre100",
      "author": "Valer_bear",
      "body": "I kind of have the same issue accept with fasting. I’m seeing a psychiatrist soon and am going to get in contact with a dietitian for it ",
      "created_utc": 1551699004.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ehs9eiv",
      "author": "None",
      "body": "You need to stop restricting and stick to a strict meal plan that will increase your intake without bingeing. It's difficult to do it by yourself. ",
      "created_utc": 1551725743.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ehsf1ti",
      "author": "EDReferral",
      "body": "There are many issues that we misunderstand and later carry on with them. Get it diagnosed properly and if you find the issue related to eating disorder then you may well find many solutions here but most of all you would get motivation from us. Stay positive, hope you get better soon ",
      "created_utc": 1551729601.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ehsso3i",
      "author": "lemon_vampire",
      "body": "Experiment with high fat animal foods when you eat. They are more satiating due to high nutrient density (which your body is craving because you keep resricting). Carbs are sugars, which will give you an energy spike but don’t satiate.  Don’t shy away from new food ideas, like eating liver and onions, resturaunt grade sashimi, or pasture raised, grass fed animal products (welfare= added nutrition=more satiation)\n\nI have struggled in the past with the same issue as you. This is what helped me",
      "created_utc": 1551738933.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eht8zkw",
      "author": "Pollyhotpocketposts",
      "body": "https://tabithafarrar.com/2017/02/anorexia-recovery-eating/",
      "created_utc": 1551751564.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ehu0i4g",
      "author": "fritz76",
      "body": "I have very similar issue. I know the problem is with restrictions and not allowing myself to eat certain stuff but I just cannot break out of that cycle. I believe the best option is to stop calorie counting and restricting but just like you I’m scared this will become a reaffirming event and I will not be able to stop myself. \nHowever, I also believe that this is just our ED telling us this and it is actually not the case. I’m trying really hard to not fully control what I eat and be more free and listen to my body. \nWe can do this, it’s hard but we can💪🏼",
      "created_utc": 1551785452.0,
      "score": 1,
      "context": []
    }
  ]
}