{
  "id": "b39uhr",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1553073675.0,
  "title": "Request: Has Anyone Ever Felt Fully Recovered?",
  "selftext": "Hi all. I have been struggling with an ED for some time now. I'm on again off again with relapsing and healthy eating/trying my best to recover.  My main question is does anyone ever feel fully recovered? I feel like when I'm in my best state of mind and I'm eating again, I still have nagging thoughts in the back of my mind of thinking I could be skinnier, I could weigh less, I could eat less. After so long of this thinking, I eventually relapse back into my ED. \n\n&#x200B;\n\nThis is all very frustrating as I want to recover and eat normally, but sometimes it feels like I will never be able to turn off that part of my brain. Has anyone ever been able to turn off that state of mind/line of thinking? Or do you just get better at ignoring it? Do you ever feel fully recovered?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/b39uhr/request_has_anyone_ever_felt_fully_recovered/",
  "score": 38,
  "num_comments": 28,
  "comments": [
    {
      "id": "eiy40nf",
      "author": "sonderandwine",
      "body": "Yes and no. It's been over ten years since I've lived with an ED and almost every time I eat or think about eating I have to talk myself out of wanting to give in. Sometimes i fail and other times I don't. I try to think of it in a positive light that it's slowly losing the grip that it used to have over my entire life. I also remind myself of how absolutely HORRIBLE it got. Even though I was the skinniest I had ever been and was in control of my life, I lost control of everything else. Friends, money, my health. Sometimes its good to reflect how much better you are now. I don't know if it ever goes away. But overtime it loses the grip it has on your life.  You can do it.",
      "created_utc": 1553076496.0,
      "score": 12,
      "context": []
    },
    {
      "id": "eiz01q0",
      "author": "ahchava",
      "body": "There are days when I feel fully recovered—sometimes months at a time. The record stops repeating in my head. Then there are days when I have to fight it. Everyone’s journey is different. I know it’s frustrating but celebrate every day when you win over your ED. I’ve been “in recovery” for almost 15 years now. The last 10 have been a lot easier than the first 5. ",
      "created_utc": 1553102729.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eizb43w",
      "author": "whinywino89",
      "body": "I honestly love the responses on this post....because SAAAAME. \n\nI am weight restored, my labs are great (lovely monthly visitor is still annoyingly irregular though), my relationship with food has gotten better, but I will always likely struggle to -some- extent. \n\nThat said, I’ve come to peace with that. Everyone has their demons....anorexia is mine. As long as I practice loving kindness, take stock of my health, and seek help in those vulnerable moments where I do have a relapse or an urge to be underweight again, it’s something that has gone from being an absolute burden and addiction to something that is manageable. \n\nFor me, I’ve noticed that my sensitivity to certain things is extreme now that I am on, what I consider to be, the upside of my recovery “journey.” For example, I need to be VERY careful with my social media use. I need to be VERY outspoken when with friends or family if they begin resorting to talk about weight loss. I need to be VERY honest with myself regarding why I’m doing cardio. I need to be an advocate for myself and for my health — if I can’t do something like be in a bridal party because I know that the stress of fitting into a dress months down the line will hinder my recovery, then I say no. \n\nRecovery, IMO, is a journey. It’s not due to a sudden, obvious, eye-opening, life-changing moment. It’s singular choices that are combined over time that make a person and his or her emotional capacity stronger. Once I stopped expecting that “aha” moment and once I stopped expecting to ever feel how I felt prior to the ED (the fact of the matter is: I screwed over my health for years. I did serious, long-term, and for some things, irreversible damage), and once I stopped being so hard on myself because, “XYZ on Instagram is a ‘recovery warrior,’ says she is fully recovered, and makes life look so fun and carefree!” the post-weight-restoration part of recovery has been easier to manage. ",
      "created_utc": 1553109637.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eiy6ch2",
      "author": "dimdiolch-jk",
      "body": "I'm not sure I will ever feel fully recovered. But I think that's okay. I feel it's part of me, just like anxiety or something, it will come and go like waves. Someday it will be good, somedays it will be harder. You just get better and sitting through and dealing with the harder days. Its been 6 years since I've been in \"recovery\" and i can live my day to day without being consumed, but I wouldn't say I'm fully recovered. You still have to check your thoughts when you eat, buy new clothes, eat a big meal, eat in front of people etc etc. It just gets a little easier. And I think you become at peace with that. ",
      "created_utc": 1553080003.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eiyo6g1",
      "author": "ultracrispypeach",
      "body": "Most of the time, yes. And there are still setbacks (restriction relapse when a relationship ended, binge relapse during exams in grad school) but I have the internal resources to bring myself back around to the recovery stage once the stressor isn’t front and center.  Most days, I truly just live my life. It took about three years of strict meal routines to get to a better place,but I’ve felt recovered, without the meal routines, for about two years since.",
      "created_utc": 1553095113.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eiysak9",
      "author": "Eesther_Greenwood",
      "body": "To be honest, there is no being fully ‘recovered’ when it comes to eating disorders and every good therapist and psychiatrist who deals with eating disorders will tell you the same thing. I don’t say this in order to create negativity, but I say this so that you can create realistic goals. It is about having less relapses and controlling your disease instead of its controlling you. You may and probably will get ED thoughts when you are stressed etc but recovery means being able to fight with them and sometimes not beating yourself up when you relapse and being able to get yourself together after a relapse easier. That is what I experience and observed in other people and heard from professionals who work in that field. I used to have ED thoughts and urges every single day and could not imagine going a single day without performing my rituals, but now I am not consumed by them everyday. I can control the urges and still relapse but it is like rare compared to the past. Think of it like other addictions. An alcoholic will never be fully recovered and will have a need to control his urges when he feels down etc. You cannot see a ‘recovered’ alcoholic who has a completely healthy relationship with alcohol like a person who has never been an alcoholic. So ED is the same.",
      "created_utc": 1553097787.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eizk4d8",
      "author": "pennybeagle",
      "body": "I feel confident that I am, but I still recognize that I will always have disordered eating habits and tendencies even if I no longer have a disorder. Self-monitoring my inner dialogue is key",
      "created_utc": 1553115202.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eiybggv",
      "author": "RaffyKadaffi",
      "body": "I was doing kind of well for years but since I'm going to college for almost a year it's gotten worse again. I have to adept to a big change in life and that doesn't always go too well :/",
      "created_utc": 1553085592.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eiyn4s6",
      "author": "jogger57",
      "body": "No",
      "created_utc": 1553094409.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eiyuhyj",
      "author": "thefragile7393",
      "body": "No...not here",
      "created_utc": 1553099184.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eiyy4z2",
      "author": "problematicbeing",
      "body": "I've relapsed and recovered 4 times now in 7 years of disordered eating and while I haven't been fully recovered yet, I do think it is possible and I think I am going to do it.   \n\n\nThe thing is, to be fully recovered, you fully have to let go of the desire to lose weight. That is really hard to do, to tell yourself I will NEVER intentionally lose weight ever again and that I will not allow myself to believe thinner is better. I believe you need to get into a HAES mindset, you need to genuinely address your internalized fat-phobia and educate yourself on the influence of diet culture while also removing yourself from the diet-mentality. I don't think anyone can fully recover until they make peace with the possibility of being fat because if you aren't willing to be fat, then you are telling yourself... okay I will gain weight til a point and if i get overweight I will go back to my ED to get my weight down. That doesn't mean you will get fat, that just means that if you do, you won't hate yourself or do anything intentional to change your weight.   \n\n\n  \nThis is my fourth round of recovery but my first round in which I was truly challenging my own fat-phobia and trying to rewire my brain to no longer see weight loss as good and gain as bad. That means every time I weigh myself I celebrate the gain, rather than freak out. It is a process but it is so freeing compared to a recovery where I still am holding on to thin-ideals.",
      "created_utc": 1553101484.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eiz06g6",
      "author": "catsbeforetwats",
      "body": "My disordered eating started about 12 and a half years ago. Since then I've yo-yoed between an underweight and overweight BMI. There are times I convince myself I'm fine and try to ignore the guilt and anxiety (usually ending up with a huge weight gain), and then I seem to bounce back to restricting and dipping underweight again.\n\nI like to hope that full recovery is possible, but for me I've only been able to ignore thoughts for so long before it gets too much. Saying that though, I've never had professional therapy, so maybe that's why I can't seem to make it the whole way to recovery.\n\nWishing you all the best for your journey, and I hope you end up with a much better recovery story than I have!",
      "created_utc": 1553102811.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eiz0jmm",
      "author": "JayJoyK",
      "body": "I’d say not really, it’s kind of like an addiction. Relapsing does happen & mentally I’m still actively Anorexia and Bulimic 50 percent of the time, if that makes sense. \nI’m not doing it so it’s okay in that way. \nBut I still have that internal war inside of me. \nYa know, the one where you feel like you’re okay one day and the next you look at yourself and think, “ Jesus Christ, I don’t deserve this food, no matter how little or how healthy it is, I’m disgusting.”\n\nI guess part of it is also Body Dysmorphia in that way. \nI’m actually not huge on labels, but with this kind of thing I’m alright with them. \nWhether you are actively or physically Anorexic, Bulimic or so on... the body imagine issue is always there. \nWe often don’t believe when other people say we look fine. For some reason people get frustrated when I don’t think that about myself sometimes. \n\nI’ve learned how to cope, but I notice when I’m feeling sick and I’m genuinely not hungry, my mom especially will try to get me to eat and ask me if I’ve eaten, even though I eat dinner with my bf every night when I do feel hungry. Force feeding isn’t healthy. I drink water when I am sick, I listen to what my body needs or doesn’t at the time.\n\nI do get tired of being asked if I ate. Every time I’ve lost weight and for some reason my body keeps dropping weight, my mom stares at me and looks concerned and sort of like she doesn’t believe me. I actually love food to be honest. I just eat very healthy and not overboard. I stay very hydrated, but it’s always a worry for someone else as well. I wish they could be in my head sometimes and realize I’m alright for the most part. \n\nSo to answer, it’s always there, but with support from others and yourself, it stings a little less. If any of you don’t have someone to support you or feel like you need more support, I’m here. Always open to talk. \nI clearly talk a lot so sorry about the long paragraphs. ❤️😂",
      "created_utc": 1553103044.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eizimqp",
      "author": "Valer_bear",
      "body": "I have yet to recover but everyone I talk to who has just seems to relapse :/",
      "created_utc": 1553114256.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ej04y6o",
      "author": "None",
      "body": "I don’t think there’s ever a true “recovery”... you will always remember the past, the terrible, twisted world where starvation/food manipulation is safe. You just learn to manage, live with the uncomfortable feelings, and then... the feelings just become less and less uncomfortable. ",
      "created_utc": 1553129426.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ej07v4q",
      "author": "FairenAppledore",
      "body": "I do believe in full recovery and I know that I’m not alone. Carolyn Costin is a very well known therapist who strongly believes and has many clients who have become recovered. I wrote a book that you can get on Amazon called Putting Together the Puzzle Pieces of Full Eating Disorder Recovery. It IS possible but it takes work and a leap of faith.",
      "created_utc": 1553131592.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ej0epsi",
      "author": "MzJessie_Strange84",
      "body": "That’s not a real thing for any addict #neverendingfight ",
      "created_utc": 1553136829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ej0t4om",
      "author": "SuplexPrincess",
      "body": "I have had multiple people tell me that it takes 12 years to fully recover from ED, and both of those people seem to be fully recovered. It’s different for everyone no matter what, but I think that it is a real possibility that you could fully recover.  But it’s hard to say what qualifies being in recovery Vs having had a full recovery  ",
      "created_utc": 1553152437.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ej392ny",
      "author": "stopitma",
      "body": "Yes, absolutely. My first ED \"episode\" or whatever you call it was in high school, lasted about a year or so and afterwards I felt fat and gross for years even though I was eating normally and was a normal weight. Finally sometime in college I had a good enough relationship with my body and weight that I went on an actual healthy diet and successfully and safely lost a little bit of weight without hating myself while I was doing it. For almost all the time since, I've been free of eating disordered thinking. The only exceptions are sometimes when I wear a swimsuit or other revealing clothing, as well as a couple of relapses that were mostly short-lived.\n\nI mean obviously I'm not fully recovered because I have relapsed several times, but when I'm doing well, I'm doing *really* well. And there have been huge lengths of time where my eating disorder didn't even cross my mind.\n\nI'm sure some people have different experiences and may find it easier or harder, but with almost all things, time and perseverance will make it easier with time. It may be slow, but one day you'll stop to think and realize how far you've come.",
      "created_utc": 1553221731.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ejb2f7u",
      "author": "AgreeableMoose",
      "body": "Can I ask if you experienced some of the comorbidity such as depression, emotional response issues, anxiety... that can be associated? ",
      "created_utc": 1553475918.0,
      "score": 2,
      "context": [
        {
          "id": "eiz01q0",
          "author": "ahchava",
          "body": "There are days when I feel fully recovered—sometimes months at a time. The record stops repeating in my head. Then there are days when I have to fight it. Everyone’s journey is different. I know it’s frustrating but celebrate every day when you win over your ED. I’ve been “in recovery” for almost 15 years now. The last 10 have been a lot easier than the first 5. ",
          "created_utc": 1553102729.0
        }
      ]
    },
    {
      "id": "eizmano",
      "author": "livbray",
      "body": "THIS",
      "created_utc": 1553116574.0,
      "score": 1,
      "context": [
        {
          "id": "eizb43w",
          "author": "whinywino89",
          "body": "I honestly love the responses on this post....because SAAAAME. \n\nI am weight restored, my labs are great (lovely monthly visitor is still annoyingly irregular though), my relationship with food has gotten better, but I will always likely struggle to -some- extent. \n\nThat said, I’ve come to peace with that. Everyone has their demons....anorexia is mine. As long as I practice loving kindness, take stock of my health, and seek help in those vulnerable moments where I do have a relapse or an urge to be underweight again, it’s something that has gone from being an absolute burden and addiction to something that is manageable. \n\nFor me, I’ve noticed that my sensitivity to certain things is extreme now that I am on, what I consider to be, the upside of my recovery “journey.” For example, I need to be VERY careful with my social media use. I need to be VERY outspoken when with friends or family if they begin resorting to talk about weight loss. I need to be VERY honest with myself regarding why I’m doing cardio. I need to be an advocate for myself and for my health — if I can’t do something like be in a bridal party because I know that the stress of fitting into a dress months down the line will hinder my recovery, then I say no. \n\nRecovery, IMO, is a journey. It’s not due to a sudden, obvious, eye-opening, life-changing moment. It’s singular choices that are combined over time that make a person and his or her emotional capacity stronger. Once I stopped expecting that “aha” moment and once I stopped expecting to ever feel how I felt prior to the ED (the fact of the matter is: I screwed over my health for years. I did serious, long-term, and for some things, irreversible damage), and once I stopped being so hard on myself because, “XYZ on Instagram is a ‘recovery warrior,’ says she is fully recovered, and makes life look so fun and carefree!” the post-weight-restoration part of recovery has been easier to manage. ",
          "created_utc": 1553109637.0
        }
      ]
    },
    {
      "id": "ej0nf90",
      "author": "facelessman12345",
      "body": "Carolyn Costin is a well known and respected eating disorder author and specialist, and I have been reading in her book about being recovered. \n\nI’m learning that eating disorder are different than addictions, and I believe it’s true. ",
      "created_utc": 1553144949.0,
      "score": 2,
      "context": [
        {
          "id": "eiysak9",
          "author": "Eesther_Greenwood",
          "body": "To be honest, there is no being fully ‘recovered’ when it comes to eating disorders and every good therapist and psychiatrist who deals with eating disorders will tell you the same thing. I don’t say this in order to create negativity, but I say this so that you can create realistic goals. It is about having less relapses and controlling your disease instead of its controlling you. You may and probably will get ED thoughts when you are stressed etc but recovery means being able to fight with them and sometimes not beating yourself up when you relapse and being able to get yourself together after a relapse easier. That is what I experience and observed in other people and heard from professionals who work in that field. I used to have ED thoughts and urges every single day and could not imagine going a single day without performing my rituals, but now I am not consumed by them everyday. I can control the urges and still relapse but it is like rare compared to the past. Think of it like other addictions. An alcoholic will never be fully recovered and will have a need to control his urges when he feels down etc. You cannot see a ‘recovered’ alcoholic who has a completely healthy relationship with alcohol like a person who has never been an alcoholic. So ED is the same.",
          "created_utc": 1553097787.0
        }
      ]
    },
    {
      "id": "ejb5tvx",
      "author": "ahchava",
      "body": "I do have depression all the time since I was 5 years old. So it’s hard to figure out what’s what sometimes. I also have panic disorder that I had m first episode of at the age of 8. Many years before I started my battle with ED. ",
      "created_utc": 1553478601.0,
      "score": 2,
      "context": [
        {
          "id": "eiz01q0",
          "author": "ahchava",
          "body": "There are days when I feel fully recovered—sometimes months at a time. The record stops repeating in my head. Then there are days when I have to fight it. Everyone’s journey is different. I know it’s frustrating but celebrate every day when you win over your ED. I’ve been “in recovery” for almost 15 years now. The last 10 have been a lot easier than the first 5. ",
          "created_utc": 1553102729.0
        },
        {
          "id": "ejb2f7u",
          "author": "AgreeableMoose",
          "body": "Can I ask if you experienced some of the comorbidity such as depression, emotional response issues, anxiety... that can be associated? ",
          "created_utc": 1553475918.0
        }
      ]
    },
    {
      "id": "ej0t6zc",
      "author": "Eesther_Greenwood",
      "body": "All addictions make you relieve certain brain chemicals like dopamin and serotonin. Food can be addicting, it is known that even binge eating disorder is an addiction. In bulimia and anorexia also certain things get involved, not just food. A bulimic is addicted to purging and an anorexic is probably addicted to restricting etc. I wonder how Costin distinguishes addictions and EDs, can you eloborate?",
      "created_utc": 1553152535.0,
      "score": 2,
      "context": [
        {
          "id": "eiysak9",
          "author": "Eesther_Greenwood",
          "body": "To be honest, there is no being fully ‘recovered’ when it comes to eating disorders and every good therapist and psychiatrist who deals with eating disorders will tell you the same thing. I don’t say this in order to create negativity, but I say this so that you can create realistic goals. It is about having less relapses and controlling your disease instead of its controlling you. You may and probably will get ED thoughts when you are stressed etc but recovery means being able to fight with them and sometimes not beating yourself up when you relapse and being able to get yourself together after a relapse easier. That is what I experience and observed in other people and heard from professionals who work in that field. I used to have ED thoughts and urges every single day and could not imagine going a single day without performing my rituals, but now I am not consumed by them everyday. I can control the urges and still relapse but it is like rare compared to the past. Think of it like other addictions. An alcoholic will never be fully recovered and will have a need to control his urges when he feels down etc. You cannot see a ‘recovered’ alcoholic who has a completely healthy relationship with alcohol like a person who has never been an alcoholic. So ED is the same.",
          "created_utc": 1553097787.0
        },
        {
          "id": "ej0nf90",
          "author": "facelessman12345",
          "body": "Carolyn Costin is a well known and respected eating disorder author and specialist, and I have been reading in her book about being recovered. \n\nI’m learning that eating disorder are different than addictions, and I believe it’s true. ",
          "created_utc": 1553144949.0
        }
      ]
    },
    {
      "id": "ejb630o",
      "author": "AgreeableMoose",
      "body": "You are in my thoughts and prayers, stay strong! ",
      "created_utc": 1553478806.0,
      "score": 2,
      "context": [
        {
          "id": "eiz01q0",
          "author": "ahchava",
          "body": "There are days when I feel fully recovered—sometimes months at a time. The record stops repeating in my head. Then there are days when I have to fight it. Everyone’s journey is different. I know it’s frustrating but celebrate every day when you win over your ED. I’ve been “in recovery” for almost 15 years now. The last 10 have been a lot easier than the first 5. ",
          "created_utc": 1553102729.0
        },
        {
          "id": "ejb2f7u",
          "author": "AgreeableMoose",
          "body": "Can I ask if you experienced some of the comorbidity such as depression, emotional response issues, anxiety... that can be associated? ",
          "created_utc": 1553475918.0
        },
        {
          "id": "ejb5tvx",
          "author": "ahchava",
          "body": "I do have depression all the time since I was 5 years old. So it’s hard to figure out what’s what sometimes. I also have panic disorder that I had m first episode of at the age of 8. Many years before I started my battle with ED. ",
          "created_utc": 1553478601.0
        }
      ]
    },
    {
      "id": "elpwg60",
      "author": "facelessman12345",
      "body": "Yes, it’s not the food that’s addictive, but instead the behaviors. So perhaps purging is the addiction, restricting, and also the planning and acting out of binges. If you have experience binge eating, you may notice a sort of dissociation during the binge. Not really tasting the food, or noticing what is being eaten. \n\nAlso, food is a requirement for life, unlike alcohol or substances. So, I think it’s important to think about it differently",
      "created_utc": 1556165880.0,
      "score": 1,
      "context": [
        {
          "id": "eiysak9",
          "author": "Eesther_Greenwood",
          "body": "To be honest, there is no being fully ‘recovered’ when it comes to eating disorders and every good therapist and psychiatrist who deals with eating disorders will tell you the same thing. I don’t say this in order to create negativity, but I say this so that you can create realistic goals. It is about having less relapses and controlling your disease instead of its controlling you. You may and probably will get ED thoughts when you are stressed etc but recovery means being able to fight with them and sometimes not beating yourself up when you relapse and being able to get yourself together after a relapse easier. That is what I experience and observed in other people and heard from professionals who work in that field. I used to have ED thoughts and urges every single day and could not imagine going a single day without performing my rituals, but now I am not consumed by them everyday. I can control the urges and still relapse but it is like rare compared to the past. Think of it like other addictions. An alcoholic will never be fully recovered and will have a need to control his urges when he feels down etc. You cannot see a ‘recovered’ alcoholic who has a completely healthy relationship with alcohol like a person who has never been an alcoholic. So ED is the same.",
          "created_utc": 1553097787.0
        },
        {
          "id": "ej0nf90",
          "author": "facelessman12345",
          "body": "Carolyn Costin is a well known and respected eating disorder author and specialist, and I have been reading in her book about being recovered. \n\nI’m learning that eating disorder are different than addictions, and I believe it’s true. ",
          "created_utc": 1553144949.0
        },
        {
          "id": "ej0t6zc",
          "author": "Eesther_Greenwood",
          "body": "All addictions make you relieve certain brain chemicals like dopamin and serotonin. Food can be addicting, it is known that even binge eating disorder is an addiction. In bulimia and anorexia also certain things get involved, not just food. A bulimic is addicted to purging and an anorexic is probably addicted to restricting etc. I wonder how Costin distinguishes addictions and EDs, can you eloborate?",
          "created_utc": 1553152535.0
        }
      ]
    },
    {
      "id": "ejb91c4",
      "author": "ahchava",
      "body": "I’m just happy I finally got correctly diagnosed so I could get on meds. It took a few years, but we found what seems to be the right combo and my quality of life is better than I ever dreamed. ",
      "created_utc": 1553481195.0,
      "score": 2,
      "context": [
        {
          "id": "eiz01q0",
          "author": "ahchava",
          "body": "There are days when I feel fully recovered—sometimes months at a time. The record stops repeating in my head. Then there are days when I have to fight it. Everyone’s journey is different. I know it’s frustrating but celebrate every day when you win over your ED. I’ve been “in recovery” for almost 15 years now. The last 10 have been a lot easier than the first 5. ",
          "created_utc": 1553102729.0
        },
        {
          "id": "ejb2f7u",
          "author": "AgreeableMoose",
          "body": "Can I ask if you experienced some of the comorbidity such as depression, emotional response issues, anxiety... that can be associated? ",
          "created_utc": 1553475918.0
        },
        {
          "id": "ejb5tvx",
          "author": "ahchava",
          "body": "I do have depression all the time since I was 5 years old. So it’s hard to figure out what’s what sometimes. I also have panic disorder that I had m first episode of at the age of 8. Many years before I started my battle with ED. ",
          "created_utc": 1553478601.0
        },
        {
          "id": "ejb630o",
          "author": "AgreeableMoose",
          "body": "You are in my thoughts and prayers, stay strong! ",
          "created_utc": 1553478806.0
        }
      ]
    },
    {
      "id": "ejb9a2n",
      "author": "AgreeableMoose",
      "body": "That’s awesome and I am happy you are doing better.! I am ending my marriage because my wife is in total denial that others issues come with bulimia. The past 2 years have been brutal. ",
      "created_utc": 1553481395.0,
      "score": 2,
      "context": [
        {
          "id": "eiz01q0",
          "author": "ahchava",
          "body": "There are days when I feel fully recovered—sometimes months at a time. The record stops repeating in my head. Then there are days when I have to fight it. Everyone’s journey is different. I know it’s frustrating but celebrate every day when you win over your ED. I’ve been “in recovery” for almost 15 years now. The last 10 have been a lot easier than the first 5. ",
          "created_utc": 1553102729.0
        },
        {
          "id": "ejb2f7u",
          "author": "AgreeableMoose",
          "body": "Can I ask if you experienced some of the comorbidity such as depression, emotional response issues, anxiety... that can be associated? ",
          "created_utc": 1553475918.0
        },
        {
          "id": "ejb5tvx",
          "author": "ahchava",
          "body": "I do have depression all the time since I was 5 years old. So it’s hard to figure out what’s what sometimes. I also have panic disorder that I had m first episode of at the age of 8. Many years before I started my battle with ED. ",
          "created_utc": 1553478601.0
        },
        {
          "id": "ejb630o",
          "author": "AgreeableMoose",
          "body": "You are in my thoughts and prayers, stay strong! ",
          "created_utc": 1553478806.0
        },
        {
          "id": "ejb91c4",
          "author": "ahchava",
          "body": "I’m just happy I finally got correctly diagnosed so I could get on meds. It took a few years, but we found what seems to be the right combo and my quality of life is better than I ever dreamed. ",
          "created_utc": 1553481195.0
        }
      ]
    }
  ]
}