{
  "id": "b4r2rt",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1553392597.0,
  "title": "Request: Does The Inner Voice Ever Go Away?",
  "selftext": " \n\nI physically overcame my ed, but theres still a voice in my head that counts how many calories I ate, how much I lost, how many I should burn in order to not gain, etc.\n\nThis voice doesn’t affect my eating but sometimes I wonder if Ill ever get to eat something without thinking about it so much.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/b4r2rt/request_does_the_inner_voice_ever_go_away/",
  "score": 48,
  "num_comments": 14,
  "comments": [
    {
      "id": "ej8rj16",
      "author": "stopitma",
      "body": "For me, it has gone away. It talked a little quieter at first, then quieter, and quieter, until now I don't even hear it anymore. It takes a while, though.",
      "created_utc": 1553397610.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ej98811",
      "author": "elocin123",
      "body": "For me personally (4 years recovered) the voice doesn't completely totally go away, but it's not far off it. When you stop giving fo us and importance to those thoughts, over time, they become less prominent until you don't even hear them anymore. I never thought that I would ever not know how many calories a food item contains or not be able to work out what my calories intake was in a day but I can honestly tell you I have absolutely no idea what it is now and it is fuxking liberating! Occasionally if I'm looking at two different foods and trying to choose, the Boise says \"go for the lower calorie\". I get myself in check, remember that I have a healthy and balanced diet and don't need to worry about the difference of 100 calories in one random day, and get whichever one I damn well please.\n\nSo, no the voice doesn't entirely disappear, but you can make it almost disappear and what remains is totally negligible :) ",
      "created_utc": 1553420733.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ej8up54",
      "author": "Catamarang2319",
      "body": "It takes constant effort to make that voice go away, but it will eventually stop. If you keep pushing forward, and reminding yourself of the reasons for your recovery, you will start to hear that nagging less and less. Keep going, it is so worth it! ",
      "created_utc": 1553400768.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ej9hna1",
      "author": "None",
      "body": "There’s a saying about brains that I think about a lot: neurons that fire together, wire together (I know the comma’s not grammatically correct but it helps with the flow). That means that the associations we make end up cementing the more we make them. It’s why languages are easy to learn at a very young age; we’re not fighting years of neural chains telling us linguistic rules we’ve always known.\n\nAll this is to say, yes, that inner voice can be silenced. But it will take time, and practice. Try not to feed it when it starts; if you can cut it off before it spirals into rumination, you’re on your way. Every time you reject it, you’re forming new neural pathways that will make it just a tiiiiiny bit easier to reject the next time. Eventually, those pathways will be stronger than the ones making the inner voice. ",
      "created_utc": 1553433445.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ej96arj",
      "author": "Snowypaton1",
      "body": "It’s never gone away since I was fourteen. Today I looked at a corn chip and went ah yes four ",
      "created_utc": 1553417400.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ej8yioo",
      "author": "moonshinecocacola",
      "body": "i’m really hopeful that it will go away. ",
      "created_utc": 1553405091.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ej92mdl",
      "author": "Valer_bear",
      "body": "For me it hasn’t gone away unfortunately :/",
      "created_utc": 1553410953.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ejf3eee",
      "author": "problematicbeing",
      "body": "The voice gets quieter and quieter on its own as you distance yourself from ED behaviors and your last relapse but it doesn't go completely away until you start actively working on it and fighting against it. Talking back and correcting your thoughts is how you retrain your brain to not give a second of time to them.\n\n&#x200B;\n\nFor Example:\n\n> how many I should burn in order to not gain \n\n&#x200B;\n\nWhen this thought comes in your head, you say to yourself \"Gaining weight wouldn't be a bad thing and I refuse to put mental energy towards calculating what it would take not to gain\"   \n\n\n> that counts how many calories I ate \n\nWhen you notice this happening, literally stop yourself and say aloud or in your head \"I will not count the calories in this meal, I am stopping right now\" and if it comes back in 30 mins when your mind wanders, you stop yourself again and say \" I refuse to ruminate on the calorie count\" You have to pump the brakes, you have to do it often, but every time you do, you train yourself to give less fucks about what that voice says.\n\n&#x200B;",
      "created_utc": 1553610523.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ejb4ljr",
      "author": "omnipotent-toaster",
      "body": "Mine hasn't completely gone away but I'm so tired of listening to it that I dismiss it immediately and find that it doesn't bother me anymore. ",
      "created_utc": 1553477630.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ejnunk4",
      "author": "pinkishdolphin",
      "body": "For me it's just gotten less and less prominent. The more I ignored it and didn't dwell on it, the easier it got to ignore it, and now I don't hear it most of the time. I still have occasions where I have thoughts about how many calories are in a food or that I could purge or restrict, but 90% of the time it's not even there.",
      "created_utc": 1553872183.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ejtyeoo",
      "author": "how2dresswell",
      "body": "i thought my ED voice went away, felt like it did for a year or so. but it's creeping back in and it's exhausting :( i'm so frustrated, i feel like i'm about to have a big setback. i can see it coming, but i don't know what to do ",
      "created_utc": 1554067035.0,
      "score": 1,
      "context": []
    },
    {
      "id": "elgnbke",
      "author": "None",
      "body": "No, never. It taunts me and it’s like a demon from Hell when I decide to eat one bloody meal.",
      "created_utc": 1555893134.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ej99tw3",
      "author": "BellReveuse",
      "body": "Good for you! How much time did it take, if I can ask?",
      "created_utc": 1553423478.0,
      "score": 4,
      "context": [
        {
          "id": "ej8rj16",
          "author": "stopitma",
          "body": "For me, it has gone away. It talked a little quieter at first, then quieter, and quieter, until now I don't even hear it anymore. It takes a while, though.",
          "created_utc": 1553397610.0
        }
      ]
    },
    {
      "id": "ejp4ens",
      "author": "stopitma",
      "body": "I think the first time it took years for me to finally become comfortable with my body again. My last relapse ended about three months ago though and I was able to recover from those thoughts much more quickly. I think I relapsed because I was in a bad place and I'm not there anymore, so it helped me get better really fast. \n\nHope it's soon for you. <3",
      "created_utc": 1553901800.0,
      "score": 2,
      "context": [
        {
          "id": "ej8rj16",
          "author": "stopitma",
          "body": "For me, it has gone away. It talked a little quieter at first, then quieter, and quieter, until now I don't even hear it anymore. It takes a while, though.",
          "created_utc": 1553397610.0
        },
        {
          "id": "ej99tw3",
          "author": "BellReveuse",
          "body": "Good for you! How much time did it take, if I can ask?",
          "created_utc": 1553423478.0
        }
      ]
    }
  ]
}