{
  "id": "b62fs2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1553679777.0,
  "title": "Request: Pressure To Punish Yourself",
  "selftext": " \n\nThis is kind of weird to write, since it does not make any logical sense. I just wanted to ask whether anyone here has struggled with \"punishing\" themselves through disordered eating. I'm a college student, and I constantly feel reminded that I'm not good enough. In the past, these feelings of inadequacy have related to body image issues and weight but it's morphed into facing other times when I'm not good enough. Today, in particular, I'm finding it hard to get myself to eat even though I'm physically hungry and have an appetite. This has happened before, and I'm working with a therapist for treatment, but I just wanted some better insight into underlying reasons so I can better counteract this pressure.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/b62fs2/request_pressure_to_punish_yourself/",
  "score": 43,
  "num_comments": 8,
  "comments": [
    {
      "id": "ejhi1br",
      "author": "evanm137",
      "body": "I think about what the main causes were for my ED developing ALL THE TIME, and it's been a struggle, as some of the reasons why I've ended up in this hole are very ridiculous and sounds crazy.\n\nBut one of the reasons was because I didn't feel like I was sick enough to deserve treatment and help despite thinking about calories, food, and exercising ALL DAY LONG.  I would get anxiety and feel guilt if I felt like I ate too much, and I felt like these things weren't enough to deserve getting help.\n\nThe connection I'm trying to make is that when you say you're trying to punish/hurt yourself through your eating habits, that that is pretty much what I did too.  But for me it was because my symptoms didn't feel severe enough to warrant help, and for that I felt the need to make myself more sick by restricting myself from food more.\n\nThen as time went on I felt an attachment towards this behavior despite the fact that I was miserable, simply because I was not gaining weight and I knew I could lose more and more weight if I continued to restrict.  I've always hated the way that I've looked, so at the end of the day, I was getting something good out of this.\n\nI felt SOME form of power over people who were prettier than me and had better bodies than me, because AT LEAST I was eating less than them, since food is something that I can't control, and my ability to restrict made me feel powerful and above people in some way despite still feeling ugly and fat.\n\nI'm a guy BTW, not that it matters.  And I'm in college.\n\nIf you ever need to talk. I am here :)\n\nI know a lot of the stuff that I said probably sounds insane, fucked up, and crazy.  But that is really how all of this has gone for me.  It sucks.\n\nI have binged and purged (laxatives and fasting/more severe restriction) a couple of times though :P",
      "created_utc": 1553681906.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ejhrd8t",
      "author": "CalypsoContinuum",
      "body": "This is exactly the root cause of my Anorexia Nervosa. I never feel good enough - to the point of being unworthy of food. I hold myself to such high standards that are logically impossible to maintain, and punish myself (with severe food restriction), to try make myself... atone? For being unable to maintain my arbitrarily high standards? \n\n\nLogically I know it isn't good. I know I am too hard on myself. Yet I still do it. It is this overwhelming need for self punishment. \n\nI tell myself if I am small, if I blend into the shadows, I can likely make things better and I will be worthy of food and nourishment - but even at my lowest weight, I kept on with this fever of self degredation, loathing and punishment. \n\n\nBeen in recovery for about 2 years, on-off, and I know I am not some monster of a human who doesn't deserve basic human rights (like food). It is hard. I sometimes have to sit back and ask myself \"Would I treat a small child like this? No? Then why would I do it to myself?\" - and go from there.",
      "created_utc": 1553691854.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ejhwqpf",
      "author": "heather80",
      "body": "I can relate to this pressure, although my ED manifests in different ways. My counselor at my local rape crisis center gave me a book called “There’s Nothing Wrong With You.” It was extremely helpful to me.  It is all about getting over self-hate. I’ll provide the [link](https://www.amazon.com/There-Nothing-Wrong-You-Self-Hate/dp/0971030901)  - it is not an affiliate link. ",
      "created_utc": 1553695955.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ejhy11d",
      "author": "Powasam5000",
      "body": "My gf mentioned this issue to me two weeks ago. I am still trying to understand and how to help. She also feels like she didnt \"earn\" her food for the day. Or that she has to punish herself",
      "created_utc": 1553697126.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eji6wla",
      "author": "omnipotent-toaster",
      "body": "Yes I absolutely did that myself. If I ever felt like I made a mistake or hurt someone or did badly on a test, I would punish myself by not eating. I felt like I deserved to feel hungry, because I wasn't worth the food I would be eating. \n\nI'm glad you're with a therapist. It's a very tricky thing to deal with and tough to explain. You're not crazy for doing that to yourself but I hope you get better ❤️",
      "created_utc": 1553705312.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eji8ssk",
      "author": "thefragile7393",
      "body": "Absolutely. Ohhhhh absolutely I have ",
      "created_utc": 1553706483.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ejk01ao",
      "author": "heaven_hasadarkside",
      "body": "Currently reading a book called The Girls at 17 Swann Street. It is riveting. About girls in an inpatient eating disorder facility. I'm sharing this because it has really made me feel much less of an alien. \n\nI can relate to you restricting in order to punish yourself. I've suffered with disordered eating for years now and have my ups and downs. You should check out this book though because it is the first book I've read that has hit so close to home on this subject! \n\nGood vibes sent your way! Think positively and don't be too hard on yourself. ",
      "created_utc": 1553753211.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ek33x7w",
      "author": "Tjippie",
      "body": "Reading this really hit home with me. Thank you for writing this all out, I didn't know I needed to relate to someone about this, but I feel a little less alone (and idiotic) now. ",
      "created_utc": 1554362133.0,
      "score": 2,
      "context": [
        {
          "id": "ejhrd8t",
          "author": "CalypsoContinuum",
          "body": "This is exactly the root cause of my Anorexia Nervosa. I never feel good enough - to the point of being unworthy of food. I hold myself to such high standards that are logically impossible to maintain, and punish myself (with severe food restriction), to try make myself... atone? For being unable to maintain my arbitrarily high standards? \n\n\nLogically I know it isn't good. I know I am too hard on myself. Yet I still do it. It is this overwhelming need for self punishment. \n\nI tell myself if I am small, if I blend into the shadows, I can likely make things better and I will be worthy of food and nourishment - but even at my lowest weight, I kept on with this fever of self degredation, loathing and punishment. \n\n\nBeen in recovery for about 2 years, on-off, and I know I am not some monster of a human who doesn't deserve basic human rights (like food). It is hard. I sometimes have to sit back and ask myself \"Would I treat a small child like this? No? Then why would I do it to myself?\" - and go from there.",
          "created_utc": 1553691854.0
        }
      ]
    }
  ]
}