{
  "id": "b6x6mc",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1553865603.0,
  "title": "Request: When parents are triggers",
  "selftext": " \n\nI have been struggling back  and forth with my relationship with food since I was 11 years old. The  cycle goes like this. I have an anorexic phase, I get healthy help via  therapy and my husband, I see my mother, I have an anorexic phase. Over  and over. Now I love my mom. I really do. Happy childhood for the most  part. But for the love of God, my mom doesn't know when to stop talking  about my weight, food choices, or gym habits. She knows Ive struggled  with my eating disorder. I've been very open about it to her. But when I  come over to the house for dinner or even take one of her calls it's  always \"Have you been to the gym this week?\" \"How's your diet going?\" Or  of we're at dinner, \"Are you sure about that?\" \"I'm sorry, I just  always see you eating junk\". It really hurt when I got bit in the  stomach at work (I work with children with autism) and it left a scar. I  told my mom I got hurt and was going to urgent care and her first words  were \"Well that'll be a cute memory scar when you're skinny in a  bathing suit\". I want to recover, but I feel like I can't with my mom  being my biggest trigger. Anyone have any advice on how to address this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/b6x6mc/request_when_parents_are_triggers/",
  "score": 64,
  "num_comments": 10,
  "comments": [
    {
      "id": "ejntpig",
      "author": "pinkishdolphin",
      "body": "If you're consistently seeing your therapist and your mom's comments are still triggers, try to talk to her about it. I know it's really hard and scary, but being firm and explicitly saying that weight and diet are off-limits for you can make a world of difference. I had to explain the same thing to my mom when I started treatment. She genuinely didn't think anything was wrong with talking about that stuff until I told her how it was affecting me. But once I told her, she stopped bringing it up. She was honestly trying to be helpful but parents have their own issues so a lot of times they don't see how their comments can be harmful unless you tell them.",
      "created_utc": 1553871601.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ejnypkr",
      "author": "problematicbeing",
      "body": "Setting boundaries will be very important- \"Mom, I need you to not talk about food, dieting, bodies, weight, or size around me, are you able to do that? If you are not able to agree to this, I am sorry but I will need to distance myself from you for my health.\" If she agrees, then you still need to advocate for yourself, if she says something like \"How is your diet going?\" you have to say \"Mom you agreed to not bring this up, we are going to stop talking about this\" Shooting her down like that will gradually train her to know that those topics are truly and fully off limits and none of her business.\n\n&#x200B;\n\nIf she keeps it up, she is showing clear disrespect for you and your boundaries and it would be reasonable to distance yourself from her, or cut contact entirely. You are under no obligation to keep people in your life who are hurting you.   \n\n\n  \nAlso, educating yourself on diet culture might help ease the pain of hearing comments like the above because you will know they come from a deep routed cultural obsession that moralizes food and exercise. The Food Psych Podcast has been a great resource for me to become more educated the effects of diet culture and the concept of the wellness diet. ",
      "created_utc": 1553874639.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ejnwmjv",
      "author": "novelle",
      "body": "I'm so sorry they are saying such inapropriate things.  There are generally thee paths in any situation: \n\n1) changing it\n2) learning how to tolerate it\n3) staying the same\n\n\n**1) Changing it** You can try to set good boundaries with your mom (i.e. Use a DEAR MAN skill to structure a conversation and set a boundary).  It may go something like this:\n\n* \"I notice that I receive a lot of comments on my body, what I eat, and my exercise habits. When I hear those comments, I start to think I'm not good enough and it can trigger a cycle of thoughts that lead to restriction. I think this is putting a rift between us. If those comments could stop, I think we'd be able to be even closer and happier.  I know it can be hard to make a change and there might be some slips, but if a comment is made, I'm going to politely ask if we can change the topic. If they still happen, I'll have to leave dinner/hang up/etc.)\n\nRemember - the most important thing about setting a boundary is holding the line. If you say you will leave/hang up if x happens, you MUST do it. If you don't, the person learns that your boundaries aren't real and it becomes very hard to set one because they will constantly challenge it. \n\n**2) Tolerating it** It might be helpful to sit down with a therapist and ask why your mom is so triggering? The world says comments like these all the time, but there are often very specific reasons why those words are more hurtful coming from someone who is 'supposed' to be our biggest support.  Learning about why your reactions are what they are and how you might develop skills to be more resilient in the face of them will be important. \n\n**3) Staying the same** It's always an option to stay the same but I can see you want change - so that's a good thing! \n\nWishing you luck! ",
      "created_utc": 1553873383.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ejofdaq",
      "author": "xox_morbid",
      "body": "I’m fat. \n\nMy moms favourite thing to say is “oh I like that. You should give it to me when it doesn’t fit anymore”\n\nOh thanks ",
      "created_utc": 1553884722.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ejog6zn",
      "author": "thefragile7393",
      "body": "My mom is very very similar.  She’s been thin her whole life and doesn’t get what her comments did as a kid and even hearing them now ",
      "created_utc": 1553885221.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ejp3rx9",
      "author": "Kricascratz",
      "body": "I realized I needed a buffer so I'm rarely alone with my parents. So we'll meet up for Thanksgiving at my brothers or Christmas at my aunt's. And when they visit me I try to stay busy and have activities for them. It's gotten a lot better recently but they maybe because they have given up on me. And as I've gotten older I've worked on my self talk so I'm not just repeating the criticism of my parents.  ",
      "created_utc": 1553901298.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ejp1ahs",
      "author": "Valer_bear",
      "body": "I think you should tell your mom to not mention those types of things since they trigger you ",
      "created_utc": 1553899327.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ejq9wh7",
      "author": "None",
      "body": "Same with me :/ though my mom used to constantly just tell me how fat I am but now she just tells me indirectly how I need to lose weight.",
      "created_utc": 1553950134.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ejowjzb",
      "author": "omahanna",
      "body": "Would it be helpful for your mom to come with you to therapy? Sometimes people just don’t really understand what’s triggering even if they know you’ve struggled with anorexia in the past. ",
      "created_utc": 1553895704.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ejq4op0",
      "author": "None",
      "body": "You **need** to make boundaries with her. \n\nLiterally tell her, \"no more diet talk\", \"no more talking about my weight, ever again, got it?\" Be firm. \n\nPeople have had to cut off entire relationships with parents, never talking again, because they didn't respect boundaries and in doing so prolonged horrendous psychological issues. \n\nTo recover, you need your boundaries respected, or it'll be impossible. ",
      "created_utc": 1553942961.0,
      "score": 2,
      "context": []
    }
  ]
}