{
  "id": "bc6pgd",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1555025268.0,
  "title": "Request: My boss says she doesn’t eat and I’m struggling to not relapse",
  "selftext": " \n\nI’ve recovered physically  from anorexia, at least for the almost most part. I’m about 5 months  into a new job, and I have a great boss who is a few years older than  me, who rarely eats during the work day, 8am-6pm. We’re in an office of 4  people. She likes to say that everyone knows she doesn’t eat, whereas  I’ve been eating ok for a while now in recovery. \n\nI’m really struggling with my own body image, and constantly try and  compare my size with everyone I see daily, and I think she’s skinner  than me. I’m very competitive and she’s able to not eat and function  well, whereas when I didn’t eat I felt horrible and my hair was thinning  a lot.\n\nHow do I ignore her daily comments on not being hungry and her not  eating, since I know it’s triggering me? Is she ok and struggling like  me, or maybe she’s healthy and I’m imagining  it? I can’t say anything,  she’s my boss!\n\nI’ve started restricting at lunch and not eating any snacks during  the day since I don’t want to be seen eating food. Even when I feel  nauseous and I end up drinking a lot of water to avoid eating. I’m  stressing over eating breakfast and dinner now too. I feel the need to  slim down just in case. I’m supposed to be skinner than everyone else  els in real life.\n\nI’d really appreciate advice and tips, I’ve actually been enjoying  eating, lightly restricting though, but almost at my target weight so no  one knows by looking at me about my past struggles. It’ll be hard to  fully restrict again, but I’m trying so hard to convince myself that I  should and finalize that decision. I just get so much panic and guilt  when I eat and enjoy the food! Please. I’ll so conflicted and angry at  myself.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/bc6pgd/request_my_boss_says_she_doesnt_eat_and_im/",
  "score": 68,
  "num_comments": 8,
  "comments": [
    {
      "id": "eko96hr",
      "author": "None",
      "body": "It’s easy to be triggered by others and just brushing it off is so so difficult. You can always pull your boss aside and mention to her that you are sensitive towards this subject and would rather not have it discussed around you. I know it can be a little embarrassing or awkward to talk about but it’s for your well being. I mentioned this to colleagues who were losing weight and told them I supported them but couldn’t be around when they spoke about diets and specific numbers. They understood.  If your boss can’t respect your wishes I would actually suggest possibly finding a new job. It might sound a little extreme but it’s so easy to slip back in to old habits and you shouldn’t have to be in a toxic environment every day. You deserve better. Otherwise, if you aren’t already in therapy I encourage you to get some so you can work through your triggers. It doesn’t get easier but it becomes more manageable with time. You can do it! :)",
      "created_utc": 1555026702.0,
      "score": 45,
      "context": []
    },
    {
      "id": "ekobpux",
      "author": "throwaway-m1",
      "body": "A method I use in situations like this is acting concerned. If they are struggling, it might be a reality check and they might need someone to express concern. But either way, the concern normally makes people uncomfortable and shuts them down. \n\n\"I haven't ate all day, I never eat, haha!\"\n\nResponses: \"Oh! Are you okay?\" \"Oh, sometimes I do that when I'm really stressed out, I totally lose my appetite. Can I get you a snack?\" \"That sounds pretty dangerous!\"",
      "created_utc": 1555028550.0,
      "score": 41,
      "context": []
    },
    {
      "id": "ekoaeo2",
      "author": "None",
      "body": "You don't know how functional she is and what she's like outside of the workplace. For all you know she goes home and binges and purges at night. \n\nPersonally, I don't engage in \"diet\" or \"food\" talk at work. If someone starts talking about it to me I don't respond or just give a noncommittal grunt while continuing to work. Or change the subject.\n\n \"Haha I'm just so busy I don't eat all day.\" me: \\*silence\\* alternative response: Make eye contact and stare them down as you take a big bite of your sandwich until they get so uncomfortable they look away.\n\n\"Ugh I'm so fat I need to lose weight!/I can't eat that I'm being bad.\"  me: \"So what insane shit do you think Wikileaks is going to release for revenge on Julien Assange's arrest?\" alternative response: \"I'd step away if i were you. Those chilequiles I ate for lunch are about to announce their exit.\"",
      "created_utc": 1555027594.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ekp4v42",
      "author": "catacles",
      "body": "You could do what I do, which is just being honest and blunt. \"oh, I have to eat, I have a severe eating disorder that I just recovered from, so it's really important to me that I eat like xyz\".\nAnd then just let them handle it. But I know it's a luxury to be able to say that.",
      "created_utc": 1555056101.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ekpnox0",
      "author": "vanityprojects",
      "body": "I may sound a bit simplistic but, if you can't do a HR type of thing where you warn the boss that she's making the workspace toxic for you and to stop mentioning that, you should change jobs. This is your health and life we're talking about, even if you love your job, how much longer will you be able to do it if you let yourself relapse? Do you want to say \"I couldn't leave that job, so I relapsed, undid all my progress, and ended up at the hospital again\" or do you want to be able to say \"It was a bummer to have to leave a job I liked, but I was strong enough to prioritize my health, and I did what I had to do to protect myself. As long as I removed myself from the toxic space, I was able to correct my path and go back to recovery. I saved myself!!\"",
      "created_utc": 1555074564.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eko9otc",
      "author": "getitbitch100",
      "body": "It sounds like you’re on a good path! Sucks that you have to deal with this. It sounds like maybe she could be struggling too. If you’re comfortable, I would try to take her aside and just ask if she could tone down the comments about eating. Either she’ll have no idea she’s doing it and hopefully apologize and stop or you will have a new partner to heal together. Hope it works out ☯️",
      "created_utc": 1555027066.0,
      "score": 10,
      "context": []
    },
    {
      "id": "el408iq",
      "author": "britxbane",
      "body": "That’s unfortunate you’re in that environment. I hope it doesn’t affect your recovery.\n\nI highly suggest saying something if you’re comfortable. Hopefully she can understand confidentiality and not say anything to others in the workplace.\n\nGood luck in your recovery. <3",
      "created_utc": 1555516852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "emgsvbu",
      "author": "Unicorn-Tears-",
      "body": "Ok here’s my two sense from a few povs\n\nFirstly I am so sorry your dealing with hearing this shit it would make me wanna put my head through a wall. \n\nAs far as your boss not eating that unhealthy and will catch up to her in one way or another trust me on that (you can’t always see he affects off anorexia as they are internal and fuck up your system from the inside. I speak from experience as anorexia and bad eating habits really really fucked me royally). Also with this I would say she’s either lying to you or is so insecure and having her own body dysmorphia issues that she may just be out of control. \n\nNot eating is not exactly going to keep you smaller, it will starve your body and when you do eat that will turn into fat and store in you, so your better off just snacking healthy and the drinking copious amounts of water is rly good but don’t over-drink or you will throw off your electrolyte balance and then you will have next health issues. Also as you age and the more you stress your system and not feed it nutrition you may risk heart attacks and other shit like that (it happened to my exis anorexic mother she had athletic anorexia it was rly messed up) she almost collapsed at the dinner table, scary shit. \n\nLastly if you are stressed about your bod just start doing an activity that you like that is active and mix in healthy eating (I mean homemade and not snacking on crap bec your absolutely right that will only make you gain weight or feel empty if it’s not actually properly feeding your body). I would just start researching  nutrition and learning about it bec it will help you feel good bec you will b filing  your body properly. \n\nAlso I if you feel like your loosing your mind when you have not eaten for a long time it’s bec you are depriving your brain of nutrition and you may start to feel like your hearing shit as your brain will probably be responding slow. \n\nSo don’t torture your self, get educated, not eating is not a sustainable way to live and will catch up trust me it always wins and you got this!! \n\nAnd if you would like some help, I just know from how I eat and it’s not to bad and it took me a while to get there but I did it 🙂🙂",
      "created_utc": 1556947259.0,
      "score": 1,
      "context": []
    }
  ]
}