{
  "id": "bgvhmt",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1556117217.0,
  "title": "Request: Can eating disorders be considered as trauma?",
  "selftext": "I was on the net the other day and I found a few comments talking about how once people recover from their eating disorder, they categorise it as trauma. I’ve never felt like the same person after recovering from my ED and I believe forever I’ll carry the weight that believes that I’ll never be able to live a worthwhile life anymore unless I’m participating in it. (I’m fine now).  Can any experience with mental illness then be considered as trauma? Would you only categorise it as something that is an experience that is lived through?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/bgvhmt/request_can_eating_disorders_be_considered_as/",
  "score": 55,
  "num_comments": 10,
  "comments": [
    {
      "id": "elo0n0w",
      "author": "smallbutreadytopunch",
      "body": "Unfortunately, yes. It can be very traumatic for some people to experience body issues or eating disorders specially if it has  happen for long periods of time. It causes insecurities, thoughts that NEVER go away, fear of shopping, body dysmorphia, etc etc. I can’t say for others, but for me I can’t eat anything without thinking of the future effects that the food will have on my body. I can shut off the thoughts for short periods of times, but it comes back every time something can seem unhealthy or “fattening” to me. No matter what it is. But I’ve suffered body image issues since like age 5 so I can’t speak for people who’ve had this for short periods of time.",
      "created_utc": 1556122325.0,
      "score": 21,
      "context": []
    },
    {
      "id": "elo29ut",
      "author": "None",
      "body": "Mine will remain a traumatic experience. Although I have almost entirely recovered, the years in treatment centers spent starving and alone will haunt me. The staff watching me use the restroom and having to keep the door open when I shower. Having to spend months on end in bed because I wasn’t allowed to walk. Not being able to go outside for over a month (multiple times) and longing for fresh air. Having tubes shoved down my throat. Losing all my friends and the trust of my family. Being afraid of walking in to hospitals because what if they hospitalize me?\n\nI’ve been hospital free for 2 years and those years in the centers alone are enough to make a person traumatized. This doesn’t include the ED behaviour and so much more.\n\nI did end up getting a subtle tattoo to commemorate my battle and I never would’ve met my best-friend without it so I suppose there is some good that comes with it. I grew from the experience and became who I am today. \n\nIs it a trauma? Absolutely",
      "created_utc": 1556123297.0,
      "score": 15,
      "context": []
    },
    {
      "id": "elon3ez",
      "author": "Discalced-diapason",
      "body": "Yes, I agree that having an ED is traumatic in itself. \n\nI’m also realising I need to watch for anniversaries. Last year, it was Holy Week that everything got so bad that I decided to go to treatment. This year, I’ve been doing pretty well, but Holy Week was extraordinarily difficult and some behaviours have crept back in, I think, in part due to having flashbacks about how terribly I was doing last year. I was having emotional flashbacks all last week and I’m having a lapse right now. \n\nLast week felt like other instances that have triggered me into an emotional flashback, except this time, the subject matter is my ED itself and not other traumas I’ve survived.",
      "created_utc": 1556135563.0,
      "score": 5,
      "context": []
    },
    {
      "id": "elonndz",
      "author": "nonirunsalot",
      "body": "100% yes. Even though I no longer take part in the harmful things I went through with Bulimia, I still think about calories in excess, how my body looks, shopping and eating out is still extremely difficult, and I am still insanely picky/critical when it comes to what I eat (e.g., if I eat something \"bad\" I will obsess over it for some time.) I definitely think going through an ED can be considered traumatic, especially with the insane mental damage/harm you undergo.",
      "created_utc": 1556135882.0,
      "score": 3,
      "context": []
    },
    {
      "id": "elpbmm3",
      "author": "BrokenPaintedLady",
      "body": "Most definitely. I (34F) am not the same person after struggling with mine for about 12 years total, 5 of which were an absolute nightmare. I'm now technically about 10 years past when it was last \"active\", but it scarred me deeply, and still affects my daily life. I have anxiety attacks if I go to the grocery store, I still don't cook at all (my dear husband does these things), even just thinking about feeding myself on a daily basis to maintain basic nutrition still feels exhausting. And the state of my psyche ever since then has been a very damaged and changed one. I am a severe depressive, and have a few auto-immune conditions and suffer from chronic fatigue. \n\nIt's pretty rough right now, and I even just resigned from my very good paying job in my career field, to take a part-time job and finally - for the first time in my life - actually do what it takes to get well. It's time. But yes, I very much feel like a trauma survivor as a result of my ED. I have never considered this perspective before, but I think you're on to something.",
      "created_utc": 1556151255.0,
      "score": 4,
      "context": []
    },
    {
      "id": "elpbvn9",
      "author": "Maddiesin",
      "body": "Definitely. I have been trough so many unbelievably ugly things because of this and I have done so many bad things to myself just for the sake of doing what my Ed wants me to do. From stealing to regularly throwing into a plastic back, constant lying, isolation, insomnia, constsc fear of being broke because you spent all your money on food (Mia)... There are too many things. The worst is the constant existential dread you feel because you spent so so so much time and money on your addiction. I don't know who I was before all of this, it's like Ive been stuck in a timeless space ever since I got sick. Nothing ever happens here. I don't recognize myself anymore.",
      "created_utc": 1556151427.0,
      "score": 5,
      "context": []
    },
    {
      "id": "elphqua",
      "author": "None",
      "body": "I have thought about that a few times and while I'm not sure if the term \"trauma\" is justified, the experience has changed me a lot. Apart from stuff that has already been mentioned, I've felt somewhat fragile and emotionally unstable ever since my \"recovery\". Partially because remembering how having an ED changed my perception and made me hurt myself and others has robbed my of an implicit trust in myself that other people seem to have.",
      "created_utc": 1556155474.0,
      "score": 5,
      "context": []
    },
    {
      "id": "elpo1nm",
      "author": "teenytinylittleant",
      "body": "I have wondered that about depression.",
      "created_utc": 1556159706.0,
      "score": 2,
      "context": []
    },
    {
      "id": "elq7wei",
      "author": "throwaway-m1",
      "body": "In addition to what others have said, eating disorders are traumatizing to your body, to varying degrees. Often our disordered behaviors are aggressive and violent (like, the entire nature of bulimia), and then many of us have major symptoms and long term damage as a result of malnourishment. So just the physical part alone is enough to be traumatizing.",
      "created_utc": 1556177139.0,
      "score": 2,
      "context": []
    },
    {
      "id": "em6eh3y",
      "author": "jasw1n3",
      "body": "I've heard people say that trauma is an instance of emotional distress that you frequently revisit in your mind. I cant tell you how many scenes of low points during my ED that I replay in my mind daily. This being said it's possible to healthily process trauma.",
      "created_utc": 1556663895.0,
      "score": 2,
      "context": []
    }
  ]
}