{
  "id": "bl58lc",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1557102709.0,
  "title": "Request: does anyone ever 'miss' their ED?..",
  "selftext": "*TRIGGER WARNING* \n\ni know it sounds crazy, but, i sometimes miss my eating disorder. Its something thats almost always in the back of my head and i dont really know who i am without it.😕 \n On one hand it sucked but on the other hand it helped me cope with my emotions. It was my best friend, my security blanket and my form of feeling in control of my life. Sometimes when i feel depressed or lonely or really anxious i end up restricting or purging to take my mind off of the other stuff. It distracted me in a way.\n I just feel kind of lost rn and dont know what im doing with my life. Nothing really feels familiar to me except the ED. its almost sort of comforting in a weird way. \nAnyway im just wondering if anyone else can relate to this feeling/ mentality. \nThanks",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/bl58lc/request_does_anyone_ever_miss_their_ed/",
  "score": 197,
  "num_comments": 53,
  "comments": [
    {
      "id": "emlpl3p",
      "author": "nakedcatz",
      "body": "i definitely relate to this. no one seems to talk about this feeling much at all. when i was in treatment everyone always talked about recovery and how everything will be better without my ED. now that i’m recovered for the most part, i realize how hard it is even after i’ve gotten over my disorder. i miss how i looked and how much control i felt that i had, and some days i really do miss it. it’s a very weird, specific type of “miss” but i can most definitely relate to what you’re saying. the road after recovery is almost just as hard as the road to achieve it, if that makes sense. i know it feels silly and doesn’t make much sense, but it’s real. you’re not alone.\n\nedit: spelling",
      "created_utc": 1557103214.0,
      "score": 40,
      "context": []
    },
    {
      "id": "emlxvva",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1557108877.0,
      "score": 19,
      "context": []
    },
    {
      "id": "emokh8g",
      "author": "None",
      "body": "All the time. I was prettier and skinnier, and I had much more confidence back then. Of course, I was dying and constantly hungry, but everyone loved me for my beauty before my downfall: recovery. It sickens me because people are dying from EDs everyday and that it is not a sustainable lifestyle, but I felt so much better with it than now.",
      "created_utc": 1557178700.0,
      "score": 15,
      "context": []
    },
    {
      "id": "emm0tf8",
      "author": "disco-potato-",
      "body": "*TW*\n\nUgh I’ve never actually thought about it until now, but I definitely do. I have recovered from restricting and purging, but I still binge from time to time. I actually sometimes miss when restriction was my vice. It was something that made me feel in control, and the weight loss (which is hardly what my ED has ever been about) was just a perk. I know how messed up it is to feel proud of yourself when you are restricting, but that’s what my ED did for me and in an odd way it helped me through tough times. Like I said, I am trying to conquer my issue with binging, which I know is bad in itself, but it also just makes me feel bad about myself when I do it. Restriction made me feel in control and proud, binging makes me feel ashamed and physically disgusting lol",
      "created_utc": 1557110657.0,
      "score": 13,
      "context": []
    },
    {
      "id": "emmsm5i",
      "author": "hpghost62442",
      "body": "I absolutely relate. I look at pictures of when I was at my worst and always feel such strong nostalgia and longing and have to remind myself that it was not actually as good a time as my rose tinted memories portray",
      "created_utc": 1557136151.0,
      "score": 8,
      "context": []
    },
    {
      "id": "emlv14o",
      "author": "Zanzan567",
      "body": "Of course, it’s normal. It’s almost like an addiction. Maybe it even is.",
      "created_utc": 1557106854.0,
      "score": 5,
      "context": []
    },
    {
      "id": "emm6i8w",
      "author": "None",
      "body": "Yes. I used to be so disciplined and thin..",
      "created_utc": 1557114235.0,
      "score": 5,
      "context": []
    },
    {
      "id": "emlsc9u",
      "author": "tangsoodoblackbelt",
      "body": "Yes I think that’s totally normal and I “missed” mine for awhile.  But I am now many many years recovered and it’s a distant memory.  It’s a part of what me made me who I am, but now I don’t “miss” it at all!",
      "created_utc": 1557105069.0,
      "score": 4,
      "context": []
    },
    {
      "id": "emlsjpu",
      "author": "halley0802",
      "body": "I relate completely to this. It became such a big part of my life and acted as kind of a band aid for all of the issues I had going on, even though I'm in recovery now sometimes it's hard to not go back to the mind set of \"everybody has their vices, at least I'm not on hard drugs\". There are even times where I think if I hadn't had my ED as an outlet I'm not sure I would've made it through.  However, it's very important to keep in mind that even if i feels like your best friend, you're hurting an innocent body. Sometimes I have to think of my own body as a separate person to my head and it reminds me that my perspective on my ED can be twisted and detrimental. Acknowledging these emotions is a step in the right direction though and I'm proud of you! Best of luck in the future!\n\nedit: spelling",
      "created_utc": 1557105226.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emlsn6x",
      "author": "jadepz",
      "body": "I can definitely relate. It’s a coping skill, not necessarily a healthy one, but one that I miss having at times. I’m always on the fine line of relapse vs. just had a weird food day. I’ve developed other coping skills over the many years of having my ED, but the thoughts never really stop..",
      "created_utc": 1557105300.0,
      "score": 4,
      "context": []
    },
    {
      "id": "emm7g0n",
      "author": "MemeWrangler69",
      "body": "I’m not really sure if I’m in recovery or not, because there wasn’t really any specific intervention involved, but I can relate to this. My ED has certainly gotten better but sometimes I feel like that recovery is some kind of betrayal. Sometimes I feel like I was so much healthier when It was worse (which is entirely not true).",
      "created_utc": 1557114894.0,
      "score": 4,
      "context": []
    },
    {
      "id": "emmet39",
      "author": "Snowypaton1",
      "body": "Relapsed badly in 2018. I started to miss it in 2017. If you start to miss it it can be a not so great sign. Look to your loved ones for support and just reaffirm to yourself why you wanted to recover.",
      "created_utc": 1557120590.0,
      "score": 4,
      "context": []
    },
    {
      "id": "emlxqxy",
      "author": "onlysaysNOO",
      "body": "This is what Ive been feeling",
      "created_utc": 1557108776.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emme7et",
      "author": "JustForBrowsing",
      "body": "Yes",
      "created_utc": 1557120096.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emn69a2",
      "author": "problematicbeing",
      "body": "I do, and even enough so sometimes that i want to relapse but, then I ask myself some things:  \n\n\nDo I really miss being a hangry bitch to the people I love the most?  \n\n\nDo I miss it being 8pm with my stomach screaming at me to eat, so much so that I couldn't do things I enjoy because all my mental energy went to thinking about food?  \n\n\nWould I really want to give up being able to eat literally whatever I want, whenever without panic or paranoia?  \n\n\n  \nAll with the knowledge that my eating disorder is always a temporary thing. Going back to it would be like signing up to be miserable for a few months/years, fucking up my relationship with food again, losing relationships again, just to have to ultimately having to gain weight, and go through the recovery process again? Hells to the nah. I am where  I need to be, I'm not taking a detour that will land me back here but more exhausted and broken up than before.",
      "created_utc": 1557148569.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emng0qe",
      "author": "thatcrazygirl_",
      "body": "Didn't notice until you said that. But I think I was a lot happier being lonely when I had an ed.",
      "created_utc": 1557154858.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emob6y7",
      "author": "fight-from-the-kid",
      "body": "YES! i'm trying to recover from anorexia/bulimia, and some days i miss the control i had and how much weight i lost. recovery is sometimes harder than the ed itself.",
      "created_utc": 1557173464.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emp0m3x",
      "author": "hunterisonfire",
      "body": "Y E S",
      "created_utc": 1557188845.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emvrb80",
      "author": "None",
      "body": "absolutely. it's totally valid. at my treatment center, we talk about not villianizing the ED because it was a coping mechanism to get through some part of our lives. it helped us survive. instead, we can grieve the ED. we can tell it thank you for helping us live but you are not going to work for us anymore. this is no longer the time or place for the ED. it served its purpose, and now we can lay it to rest.",
      "created_utc": 1557364005.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emlssee",
      "author": "emiliterally",
      "body": "i’m currently in inpatient treatment and i already miss my ED, which scares me a lot. I really don’t want to get out of treatment and just fall back into my symptoms, hopefully as it progresses I can feel more comfortable that I won’t. But I totally understand you, eating disorders are great at giving you a false sense of control and safety. Try to remember that you are not your eating disorder, there is so much more to you than that, there’s so much more to life than ED!",
      "created_utc": 1557105401.0,
      "score": 2,
      "context": []
    },
    {
      "id": "emmvgxx",
      "author": "Littleriver22",
      "body": "Totally relatable. Currently trying to recover and anytime things get stressful my mind instantly goes to “lose weight” even when I am not necessarily hating on myself, it’s just to cope.",
      "created_utc": 1557139317.0,
      "score": 2,
      "context": []
    },
    {
      "id": "emnpvl7",
      "author": "dmmge",
      "body": "Yes. It’s like an old friend.",
      "created_utc": 1557160879.0,
      "score": 2,
      "context": []
    },
    {
      "id": "emnzuan",
      "author": "squirrels-rule",
      "body": "Every day of my life 😔",
      "created_utc": 1557166989.0,
      "score": 2,
      "context": []
    },
    {
      "id": "emo0auj",
      "author": "Unicorn-Tears-",
      "body": "It’s so true how much encouragement you get when you have a ED lol I have an athletic build and a dancer so it goes win the territory no one had any idea. Eventually one of my dance teachers threatened to have me committed if I don’t start eating but other then that it was great. I also smoked a lot but I was extremely young (17-19) so I still had endurance for hard dance sequences and could still smoke and run. Now I’m working to just be healthy and happy and strong 💪🏻💪🏻",
      "created_utc": 1557167268.0,
      "score": 2,
      "context": []
    },
    {
      "id": "emorex0",
      "author": "TotesMessenger",
      "body": "I'm a bot, *bleep*, *bloop*. Someone has linked to this thread from another place on reddit:\n\n- [/r/exproed] [Request: does anyone ever 'miss' their ED?..](https://www.reddit.com/r/exproed/comments/bliux9/request_does_anyone_ever_miss_their_ed/)\n\n&nbsp;*^(If you follow any of the above links, please respect the rules of reddit and don't vote in the other threads.) ^\\([Info](/r/TotesMessenger) ^/ ^[Contact](/message/compose?to=/r/TotesMessenger))*",
      "created_utc": 1557182983.0,
      "score": 2,
      "context": []
    },
    {
      "id": "en8muzb",
      "author": "the-real-astrobean",
      "body": "Holy crap, I miss mine so much, almost every single day. I was miserable when I had it, and messed up my digestive system a bunch, but I felt so skinny and attractive. People used to comment on how thin I was and that part of it made me feel amazing.",
      "created_utc": 1557685923.0,
      "score": 2,
      "context": []
    },
    {
      "id": "enffzad",
      "author": "jtvotd",
      "body": "i feel the same way. i know i am better off eating and trying not to think too much about calories and body checks, but i miss parts of it.",
      "created_utc": 1557814901.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eo8o0dh",
      "author": "NamiNami87",
      "body": "I definitely do. Im kinda-recovering rn, and i miss the control i had, and how strong my ed was. Never broke the rules i had, and the feeling of empty stomach, or seeing low calories in my app, were the best. Now i sometimes let myself eat what i want and its harder to restrict. I Dont know how to feel about all of this.",
      "created_utc": 1558371046.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eopc1yr",
      "author": "Lms9296",
      "body": "I relate to this a whole lot and completely understand. I personally think it’s because eating disorders are an addiction and it is so much easier to use an addiction to cope and so much harder to cure that addiction.",
      "created_utc": 1558759994.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ep6cj6g",
      "author": "oceanic_whitetip",
      "body": "Sometimes I purge water. Drink a glass purposely just to feel that feeling of my anxiety going away,  because it was one of my only coping mechanisms for the longest time. Being what people consider recoveted such a foreign feeling, we can all get lost sometimes.",
      "created_utc": 1559067325.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ep98gcv",
      "author": "disasociativeana",
      "body": "I very much relate. This topped with the overwhelming feeling of hopelessness contributed to many relapses.",
      "created_utc": 1559106062.0,
      "score": 2,
      "context": []
    },
    {
      "id": "epcozdt",
      "author": "arimee",
      "body": "I’ve been struggling with my ED since early high school, but it progressed into not only restricting food but purging as well my sophomore year of college. So it’s been about two years of me consistently restricting, purging, and abusing laxatives. I will go through periods of time where I am “fine” and straying away from my habits, but I always hear that voice of never being good enough. Of weighing too much. So I continue to give in to my ED. So I don’t know if I miss it around those times, but it’s almost as if I don’t want to get better. Idk. I’m in therapy but I’ve never gotten official treatment.",
      "created_utc": 1559156763.0,
      "score": 2,
      "context": []
    },
    {
      "id": "epu2mgz",
      "author": "Mybirthrightistodie",
      "body": "I get it. I've been trying to recover and I find myself thinking I've disappointed Ana and Mia. Like I owed those imaginary people something. I want to go back because they were always a constant in my life and for me to suddenly up and leave...I don't know. Almost like you left home without a word. You don't quite know what to do with yourself anymore.",
      "created_utc": 1559502499.0,
      "score": 2,
      "context": []
    },
    {
      "id": "en2eyel",
      "author": "AshamedAmphibian",
      "body": "Not at all, because it's still with me. Forced recovery isn't recovery. I fully intend on starving myself to death in the future, and it brings me the greatest comfort.",
      "created_utc": 1557531235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "emlru3m",
      "author": "Mariat1997",
      "body": "Thank you❤ i really appreciate it! \nBtw, If you ever need to talk im here 😊",
      "created_utc": 1557104699.0,
      "score": 2,
      "context": [
        {
          "id": "emlpl3p",
          "author": "nakedcatz",
          "body": "i definitely relate to this. no one seems to talk about this feeling much at all. when i was in treatment everyone always talked about recovery and how everything will be better without my ED. now that i’m recovered for the most part, i realize how hard it is even after i’ve gotten over my disorder. i miss how i looked and how much control i felt that i had, and some days i really do miss it. it’s a very weird, specific type of “miss” but i can most definitely relate to what you’re saying. the road after recovery is almost just as hard as the road to achieve it, if that makes sense. i know it feels silly and doesn’t make much sense, but it’s real. you’re not alone.\n\nedit: spelling",
          "created_utc": 1557103214.0
        }
      ]
    },
    {
      "id": "eprhmq7",
      "author": "macabremom1",
      "body": " Am I allowed to ask what you weighed then and what you weigh now? Or at least how much you gained back and over what time period?",
      "created_utc": 1559424671.0,
      "score": 3,
      "context": [
        {
          "id": "emlxvva",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1557108877.0
        }
      ]
    },
    {
      "id": "emnyc7y",
      "author": "Mariat1997",
      "body": "Same here.. my ED wss honestly never really about body image or anything like that. But losing weight felt soo good. It kinda made me feel like i was doing something right for once. Like i was GOOD at this. And i definitely have control issues as well.",
      "created_utc": 1557166109.0,
      "score": 2,
      "context": [
        {
          "id": "emm0tf8",
          "author": "disco-potato-",
          "body": "*TW*\n\nUgh I’ve never actually thought about it until now, but I definitely do. I have recovered from restricting and purging, but I still binge from time to time. I actually sometimes miss when restriction was my vice. It was something that made me feel in control, and the weight loss (which is hardly what my ED has ever been about) was just a perk. I know how messed up it is to feel proud of yourself when you are restricting, but that’s what my ED did for me and in an odd way it helped me through tough times. Like I said, I am trying to conquer my issue with binging, which I know is bad in itself, but it also just makes me feel bad about myself when I do it. Restriction made me feel in control and proud, binging makes me feel ashamed and physically disgusting lol",
          "created_utc": 1557110657.0
        }
      ]
    },
    {
      "id": "emnyd5b",
      "author": "Mariat1997",
      "body": "Was*",
      "created_utc": 1557166123.0,
      "score": 1,
      "context": [
        {
          "id": "emm0tf8",
          "author": "disco-potato-",
          "body": "*TW*\n\nUgh I’ve never actually thought about it until now, but I definitely do. I have recovered from restricting and purging, but I still binge from time to time. I actually sometimes miss when restriction was my vice. It was something that made me feel in control, and the weight loss (which is hardly what my ED has ever been about) was just a perk. I know how messed up it is to feel proud of yourself when you are restricting, but that’s what my ED did for me and in an odd way it helped me through tough times. Like I said, I am trying to conquer my issue with binging, which I know is bad in itself, but it also just makes me feel bad about myself when I do it. Restriction made me feel in control and proud, binging makes me feel ashamed and physically disgusting lol",
          "created_utc": 1557110657.0
        }
      ]
    },
    {
      "id": "emnwgg5",
      "author": "eclaireg",
      "body": "Absolutely an addiction. I've spent the last 10+ years going back and forth between my ED and actual addiction. Whenever I'm clean, my ED creeps back in, and whenever I'm using, it makes me stop caring enough to stop my ED. It's a vicious cycle- but both are playing with fire. Sometimes I wonder which one actually has a higher chance of death; I think the risk is pretty much equal with both.",
      "created_utc": 1557165022.0,
      "score": 3,
      "context": [
        {
          "id": "emlv14o",
          "author": "Zanzan567",
          "body": "Of course, it’s normal. It’s almost like an addiction. Maybe it even is.",
          "created_utc": 1557106854.0
        }
      ]
    },
    {
      "id": "emnyz1j",
      "author": "Mariat1997",
      "body": "Yeah.. i do see it as an addiction in alot of ways. It really does 'mimic' addiction like drugs/alcohol/gambling etc.. in a way.",
      "created_utc": 1557166476.0,
      "score": 3,
      "context": [
        {
          "id": "emlv14o",
          "author": "Zanzan567",
          "body": "Of course, it’s normal. It’s almost like an addiction. Maybe it even is.",
          "created_utc": 1557106854.0
        }
      ]
    },
    {
      "id": "emplsf8",
      "author": "Mariat1997",
      "body": "Thank you! You too! ❤👍😊",
      "created_utc": 1557204355.0,
      "score": 1,
      "context": [
        {
          "id": "emlsjpu",
          "author": "halley0802",
          "body": "I relate completely to this. It became such a big part of my life and acted as kind of a band aid for all of the issues I had going on, even though I'm in recovery now sometimes it's hard to not go back to the mind set of \"everybody has their vices, at least I'm not on hard drugs\". There are even times where I think if I hadn't had my ED as an outlet I'm not sure I would've made it through.  However, it's very important to keep in mind that even if i feels like your best friend, you're hurting an innocent body. Sometimes I have to think of my own body as a separate person to my head and it reminds me that my perspective on my ED can be twisted and detrimental. Acknowledging these emotions is a step in the right direction though and I'm proud of you! Best of luck in the future!\n\nedit: spelling",
          "created_utc": 1557105226.0
        }
      ]
    },
    {
      "id": "emnz558",
      "author": "Mariat1997",
      "body": "It really does mess with your head a LOT.",
      "created_utc": 1557166572.0,
      "score": 2,
      "context": [
        {
          "id": "emm7g0n",
          "author": "MemeWrangler69",
          "body": "I’m not really sure if I’m in recovery or not, because there wasn’t really any specific intervention involved, but I can relate to this. My ED has certainly gotten better but sometimes I feel like that recovery is some kind of betrayal. Sometimes I feel like I was so much healthier when It was worse (which is entirely not true).",
          "created_utc": 1557114894.0
        }
      ]
    },
    {
      "id": "emnzcg5",
      "author": "Mariat1997",
      "body": "Yeah i do. I talk to my mom about it sometimes. Even though its hard to admit too things like relapsing with purging/restricting. Trying to look into seeing therapist for this and other stuff but having problems with insurance at the moment.😒",
      "created_utc": 1557166692.0,
      "score": 1,
      "context": [
        {
          "id": "emmet39",
          "author": "Snowypaton1",
          "body": "Relapsed badly in 2018. I started to miss it in 2017. If you start to miss it it can be a not so great sign. Look to your loved ones for support and just reaffirm to yourself why you wanted to recover.",
          "created_utc": 1557120590.0
        }
      ]
    },
    {
      "id": "emnz200",
      "author": "Mariat1997",
      "body": "Your not alone.. if you ever feel like talking just DM me. Im here to listen if you want😊",
      "created_utc": 1557166523.0,
      "score": 1,
      "context": [
        {
          "id": "emlxqxy",
          "author": "onlysaysNOO",
          "body": "This is what Ive been feeling",
          "created_utc": 1557108776.0
        }
      ]
    },
    {
      "id": "emnyorp",
      "author": "Mariat1997",
      "body": "Thank you so much!❤ its definitely a 'safety/comfort'  thing. And does feel like my identity and/or 'best/secret' friend. Its MINE and ONLY mine. Even though i also hate it and want to move on with my life now.",
      "created_utc": 1557166307.0,
      "score": 2,
      "context": [
        {
          "id": "emlssee",
          "author": "emiliterally",
          "body": "i’m currently in inpatient treatment and i already miss my ED, which scares me a lot. I really don’t want to get out of treatment and just fall back into my symptoms, hopefully as it progresses I can feel more comfortable that I won’t. But I totally understand you, eating disorders are great at giving you a false sense of control and safety. Try to remember that you are not your eating disorder, there is so much more to you than that, there’s so much more to life than ED!",
          "created_utc": 1557105401.0
        }
      ]
    },
    {
      "id": "emozkc4",
      "author": "Mariat1997",
      "body": "Same",
      "created_utc": 1557188143.0,
      "score": 2,
      "context": [
        {
          "id": "emnpvl7",
          "author": "dmmge",
          "body": "Yes. It’s like an old friend.",
          "created_utc": 1557160879.0
        }
      ]
    },
    {
      "id": "empm2hp",
      "author": "Mariat1997",
      "body": "Im really sorry your struggling with this as well. I wish you all the best in your recovery and if you ever get those types thoughts (like i do alot too) try and talk to someone about it. Maybe your mom,dad,friends, other family members etc.. Get it out of your system. Stay strong❤",
      "created_utc": 1557204557.0,
      "score": 2,
      "context": [
        {
          "id": "emnzuan",
          "author": "squirrels-rule",
          "body": "Every day of my life 😔",
          "created_utc": 1557166989.0
        }
      ]
    },
    {
      "id": "eo9bhfq",
      "author": "Mariat1997",
      "body": "Having that empty feeling from hunger felt really good to me too. I wasnt thinking of my anxiety, depression etc. Just. Hunger. I felt worthless and wanted to 'disappear' and i guess the ED was a way of compensating for those feelings.",
      "created_utc": 1558387229.0,
      "score": 1,
      "context": [
        {
          "id": "eo8o0dh",
          "author": "NamiNami87",
          "body": "I definitely do. Im kinda-recovering rn, and i miss the control i had, and how strong my ed was. Never broke the rules i had, and the feeling of empty stomach, or seeing low calories in my app, were the best. Now i sometimes let myself eat what i want and its harder to restrict. I Dont know how to feel about all of this.",
          "created_utc": 1558371046.0
        }
      ]
    },
    {
      "id": "ep8shxq",
      "author": "Mariat1997",
      "body": "I do the same damn thing sometimes 😕",
      "created_utc": 1559099283.0,
      "score": 2,
      "context": [
        {
          "id": "ep6cj6g",
          "author": "oceanic_whitetip",
          "body": "Sometimes I purge water. Drink a glass purposely just to feel that feeling of my anxiety going away,  because it was one of my only coping mechanisms for the longest time. Being what people consider recoveted such a foreign feeling, we can all get lost sometimes.",
          "created_utc": 1559067325.0
        }
      ]
    },
    {
      "id": "enacpt5",
      "author": "Mariat1997",
      "body": "Please don't do that. Please talk to someone about this! Trust me, even though really do miss this sometimes, i know deep down that its NOT worth it.\nStay strong❤",
      "created_utc": 1557717931.0,
      "score": 1,
      "context": [
        {
          "id": "en2eyel",
          "author": "AshamedAmphibian",
          "body": "Not at all, because it's still with me. Forced recovery isn't recovery. I fully intend on starving myself to death in the future, and it brings me the greatest comfort.",
          "created_utc": 1557531235.0
        }
      ]
    },
    {
      "id": "eprknh2",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1559426268.0,
      "score": 1,
      "context": [
        {
          "id": "emlxvva",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1557108877.0
        },
        {
          "id": "eprhmq7",
          "author": "macabremom1",
          "body": " Am I allowed to ask what you weighed then and what you weigh now? Or at least how much you gained back and over what time period?",
          "created_utc": 1559424671.0
        }
      ]
    },
    {
      "id": "eprrgpj",
      "author": "macabremom1",
      "body": "Thanks for the reply! \nSo you were skinny but felt terrible?",
      "created_utc": 1559429844.0,
      "score": 2,
      "context": [
        {
          "id": "emlxvva",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1557108877.0
        },
        {
          "id": "eprhmq7",
          "author": "macabremom1",
          "body": " Am I allowed to ask what you weighed then and what you weigh now? Or at least how much you gained back and over what time period?",
          "created_utc": 1559424671.0
        },
        {
          "id": "eprknh2",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1559426268.0
        }
      ]
    }
  ]
}