{
  "id": "bmfhrr",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1557376182.0,
  "title": "Request: Today I stop tracking my calories and macros",
  "selftext": "I thought that tracking calories would maximize my fitness journey's results. Consequently, I have been doing it religiously and obsessively for the past 8 months non-stop.\nStarting with dinner today (which is in about 30 mins from writing this), I'll stop logging calories, \nWhy?\nI really feel that\n1/ given my somewhat OCD/perfectionist nature (I don't have OCD though, lol, just very mentally strict with some things ocassionally), I feel that this was slowly developing out of control, to the point where I am on the verge of (but haven't) developing an eating disorder. I have first-hand experience with friends/family with ED, and I know it destroys lives (beyond just its victim). I'm glad I haven't developed ED, am sympthetic to those who have, and refuse to ever develop it.\n2/ I have wasted so much time and effort on it - inputting food to the gram, researching the cooking method before eating it, etc.\n3/ I've sacrificed so many opportunities (to make and hang out) with friends and families\n4/ missed out on so many good (but healthy) foods. I used to love cheese, but have had periods where I avoided them because of minimum/maximum calorie and macronutrient requirements\n5/ It isn't even that accurate. Let's be honest: companies fail in their food labels, you probably don't know your exact TDEE (which is made more volatile due to varying daily activities), and you don't always measure stuff correctly anyways\n6/ even if every measurement and bit of labelling were accurate, the actual calories published are just estimates, even for the most basic whole foods like rice or oil\n7/ your body doesn't treat all macronutrients the same (beyond total energy balance, a calorie is not a calorie), and doesn't absorb 100% of the macros you eat anyways\n8/ it's costly: I sometimes had to go buy stuff last minute because food I already had ready at home did not fit my macros\n9/ just more mental freedom really\n10/ hindering my gains at the gym: (not applicable to everyone): - for a very long time my obsession with certain caloric and macro intakes have slowed down my progress because I feared I might over/under eat\n11/ Lost productivity - I spend my time thinking way too much about meal planning, when I could've gone out and make money, study harder, or just play some FIFA (soccer video game).\n12/ Personally, I don't intend to compete in anything professionally (bodybuilding, professional sports, ...) that requires obsessive control of macro and caloric intake; I'm just someone who enjoys physical exercise, wants to get big and strong and fit\n13/ I can still look and feel healthy, stay fit, and have decent physical performance when needed (e.g. if I have to help someone carry stuff), and good bloodwork without calorie and macro tracking\nThere are probably a couple more reasons, but I think 1/, 10/, and 11/ are the most important ones.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/bmfhrr/request_today_i_stop_tracking_my_calories_and/",
  "score": 82,
  "num_comments": 5,
  "comments": [
    {
      "id": "emwpomq",
      "author": "badash99",
      "body": "Congrats! That seems like a healthy choice in your case, I'm happy you're in a good spot and figuring out what is best for you :) I know how that incessant control can get in the way of other activities as well, especially social participation. Good luck as you progress!",
      "created_utc": 1557398765.0,
      "score": 3,
      "context": []
    },
    {
      "id": "emwvnv6",
      "author": "kompassionatekoala",
      "body": "I really admire this. I’m struggling so hard with doing this myself and it has actually led to an ED in my case. Now I am in that place where I *can’t* stop because I panic and the anxiety is unbearable. I’m so happy you’re making this super healthy choice for yourself and can let yourself enjoy the things you love.",
      "created_utc": 1557403405.0,
      "score": 4,
      "context": []
    },
    {
      "id": "emyy2wh",
      "author": "Princess_Goose3",
      "body": "This is something I have seriously started to consider. It's so awful when you have a bad day as well, it almost makes me want to binge MORE because just thinking about adding the calories to my tracker spikes my anxiety.",
      "created_utc": 1557446416.0,
      "score": 2,
      "context": []
    },
    {
      "id": "epusgzj",
      "author": "maevb97",
      "body": "I developed orthorexia as a result of using My Fitness Pal for a year. I developed it last March and finally decided to seek help in October. I lost about 30 lbs and I was eating about 1,500 a day. I’m 6’2... definitely not the correct amount of calories I should’ve been eating!! I suggest stopping the counting ASAP. It was so hard for me. However, I started going to an ED therapist and I was encouraged to get on an antidepressant that is specifically for OCD. It has helped tremendously and now I am officially done tracking calories and I’m now at a proper weight for my height and activity level. I still struggle with my ED every day, but I am now able to eat without counting my calories or restricting entire food groups. You can do it!! Talk to a therapist if you are comfortable with it. It really did save my life.",
      "created_utc": 1559515223.0,
      "score": 1,
      "context": []
    },
    {
      "id": "enaz6gi",
      "author": "macyhart_",
      "body": "Me too :/ I track absolutely every single calorie and cannot stop.",
      "created_utc": 1557732662.0,
      "score": 1,
      "context": [
        {
          "id": "emwvnv6",
          "author": "kompassionatekoala",
          "body": "I really admire this. I’m struggling so hard with doing this myself and it has actually led to an ED in my case. Now I am in that place where I *can’t* stop because I panic and the anxiety is unbearable. I’m so happy you’re making this super healthy choice for yourself and can let yourself enjoy the things you love.",
          "created_utc": 1557403405.0
        }
      ]
    }
  ]
}