{
  "id": "bt623d",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1558863388.0,
  "title": "Request: post request- Anyone ever experience restriction in other areas of their lives?",
  "selftext": "I have noticed that along with food my restrictive tendencies tend to also affect my spending and amount of fun time. I have also gotten into living more environmentally friendly and have restricted my plastic use severely. Are these all other ways for me to punish myself? Any advice for how much is ok?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/bt623d/request_post_request_anyone_ever_experience/",
  "score": 38,
  "num_comments": 12,
  "comments": [
    {
      "id": "eoui7wc",
      "author": "covhr",
      "body": "SAME! I used to, when I was in a restrictive phase, delete hours & hours of television from my DVR. I also refused to purchase nice things for myself, or sometimes not even \"nice\" things, but ANY thing. \n\nWhat helped is that I was honest with what I was doing with my treatment team. They helped me set small goals to make changes.",
      "created_utc": 1558868413.0,
      "score": 12,
      "context": []
    },
    {
      "id": "eouilqh",
      "author": "smokeyhuskys",
      "body": "Same hat!! If I had too much free time I would make myself do something \"productive\" and I wouldn't allow myself to sleep for more than a designated period.\n\nThat being said, it's probably not best to try and justify any perceived restrictions you have. If you think it's a restriction good chance that your brain does too. It might just be a part of the same neural network as your ED and it's always worth challenging if you think it'll make life better for you.",
      "created_utc": 1558868946.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eoun7uk",
      "author": "houston_veronica",
      "body": "yes.  check out this article: [https://awomensthing.org/blog/minimalism-as-restraint/](https://awomensthing.org/blog/minimalism-as-restraint/)",
      "created_utc": 1558874582.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eouq5pk",
      "author": "SentientRiceCake",
      "body": "Not restriction, but I would lock myself in library rooms to force myself to study for hours and I’d make myself strive for “perfection” in many areas of my life.\n\n I suppose that’s tied to a lot of the reasons I restricted to begin with. I perceived my lack of food and very strict rules of intake as a form of perfect behavior. I almost felt superior in a very stupid way for having “control” over the parts of life that required great great self discipline. I’d look around and scoff at others who couldn’t resist a cookie at the dining hall, would make excuses to wake up early, or would fail their courses out of negligence. \n\nNeedless to say, I’m happy thats not the case anymore. Don’t know how former anorexic me would’ve handled plastic restriction or shopping restriction.",
      "created_utc": 1558877477.0,
      "score": 4,
      "context": []
    },
    {
      "id": "eouxeyc",
      "author": "nagmamahal_kiwi",
      "body": "Hm! I think not using plastic is actually a nice habit… one that I am trying to cultivate. \n\nAs for the restriction on activities that are fun… purging SUCKS. I hate my binging tendencies bc i carve time out of my day to burn it off afterwards, which sometimes means missing out on planned events. \n\nTake my words with a grain of salt of course. Ive never been diagnosed with an eating disorder, but might have developed worse habits if my teachers did not notice and discourage my tendencies around food.",
      "created_utc": 1558883449.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eov0nka",
      "author": "overdramaticteen",
      "body": "Perfectionism is a huge part of disordered eating for a lot of people. For me it’s so much so that the rituals and routines are actually more important to me than what my body looks like. You should look up Obsessive Compulsive Personality Disorder, it’s a diagnosis I have and it makes me restrict in similar ways to what you described, in order to be in control.",
      "created_utc": 1558885912.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eov4g8n",
      "author": "Rotorr89",
      "body": "I was restrictive/controlling with my food and finances (which kind of leaked into all part of my life cause finances are connected to almost everything). \n\nI worked through the restriction with food but it wasn’t until I met my husband that I realized how bad my restrictions with money really was. Through budgeting, planned date nights, etc I was able to start seeing it was ok to let go and have fun. \n\nI don’t think restricting plastic is bad and do feel that in some cases the ability to restrict can benefit (this is one area cause plastic is horrible) it’s just a matter of using it in a way that doesn’t hurt you or others. You can still get what you want it’s just a matter of finding a way. If you’re using the plastic restriction to keep you from eating when you need to then I’d say ease up a bit and give yourself what you need until you can find a way to cut out plastic. It’s not always all or nothing.",
      "created_utc": 1558888301.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eowf2i9",
      "author": "ohvp",
      "body": "I know it’s not advice but there are definitely a lot of aspects in my life I’ve become more restrictive or controlling on recently and until I read this post I hadn’t even considered that it might be in connection to restrictive eating, if you come across any helpful ways of approaching this I’d love to know. Wishing you all the best x",
      "created_utc": 1558908964.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eoye8jp",
      "author": "Mandsee",
      "body": "I wonder if I know you in real life! You remind me exactly of my friend who does the same thing. She has anorexia but also is very concerned about the planet. Sometimes she doesn't buy food because of the packaging waste involved.\n\nAnyway, I also have heard of financial anorexia. At Monte Nido, the treatment center, Carolyn Costin used to say \"your relationship with food is like all your other relationships\" and I found that pretty accurate. I restrict pleasure, time with people, travel, and so much. Sometimes I binge. Sometimes I can't get enough and then I feel overwhelmed. I think think this is definitely pretty typical. I don't know how you decide what's okay and what's pathological. Limiting plastic use is fine. Perhaps find ways to still get what you need just not use as much plastic. Use reusable bags, bring your own bottles and cups, etc",
      "created_utc": 1558938887.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eqq6ln2",
      "author": "clayshapercaleb73",
      "body": "If developing OCD counts as restriction then yes. After I recovered my mind needed something else to obsess about and that kickstarted OCD.",
      "created_utc": 1560213443.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eouqs5w",
      "author": "SentientRiceCake",
      "body": "This is a great article. I’m a minimalist myself and I never thought of it this way.",
      "created_utc": 1558878027.0,
      "score": 3,
      "context": [
        {
          "id": "eoun7uk",
          "author": "houston_veronica",
          "body": "yes.  check out this article: [https://awomensthing.org/blog/minimalism-as-restraint/](https://awomensthing.org/blog/minimalism-as-restraint/)",
          "created_utc": 1558874582.0
        }
      ]
    },
    {
      "id": "ep1vo8b",
      "author": "purplecourt",
      "body": "That is a great explanation! Thank you!",
      "created_utc": 1558997195.0,
      "score": 1,
      "context": [
        {
          "id": "eoye8jp",
          "author": "Mandsee",
          "body": "I wonder if I know you in real life! You remind me exactly of my friend who does the same thing. She has anorexia but also is very concerned about the planet. Sometimes she doesn't buy food because of the packaging waste involved.\n\nAnyway, I also have heard of financial anorexia. At Monte Nido, the treatment center, Carolyn Costin used to say \"your relationship with food is like all your other relationships\" and I found that pretty accurate. I restrict pleasure, time with people, travel, and so much. Sometimes I binge. Sometimes I can't get enough and then I feel overwhelmed. I think think this is definitely pretty typical. I don't know how you decide what's okay and what's pathological. Limiting plastic use is fine. Perhaps find ways to still get what you need just not use as much plastic. Use reusable bags, bring your own bottles and cups, etc",
          "created_utc": 1558938887.0
        }
      ]
    }
  ]
}