{
  "id": "bts0ve",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1558994667.0,
  "title": "Request: People/influencers who claim to use fitness to overcome their ED?",
  "selftext": "I see so many Instagram accounts of people who follow intense lifting programs and are super “fit,” claiming that they have overcome their eating disorders through lifting, etc. These people seem to still be obsessed with food and exercise and although being (physically) super fit, I question whether fitness has just allowed them a new (socially condoned) way of continuing their disordered thoughts and behavior? I was wondering if people had thoughts on this.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/bts0ve/request_peopleinfluencers_who_claim_to_use/",
  "score": 62,
  "num_comments": 18,
  "comments": [
    {
      "id": "ep1sv79",
      "author": "ryden2008",
      "body": "in my opinion, their ED likely just transformed into orthorexia (strictly healthy diets + exercise). you’re right, they do still obsess over food and it seems like they just find new ways to restrict",
      "created_utc": 1558995299.0,
      "score": 63,
      "context": []
    },
    {
      "id": "ep1u67k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1558996176.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ep1uhwg",
      "author": "carmelita19",
      "body": "I agree as well. I think it’s a way to obsess and it’s a dangerous game to play. I know because I was once big in the fitness world. I stuck to crazy eating plans, and worked out too much to control my body. Today is different for me because I practice the 12 spiritual principles and recovered from my illness. I no longer follow crazy meal plans or work out for hours in the gym. I finally found freedom, and it was by letting go of control.",
      "created_utc": 1558996396.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ep47i9l",
      "author": "None",
      "body": "I try not to assume too much but I side eye it, no lie. I know people who train like they think they’re elite athletes because “recovery!”, like...you literally just changed ED behaviors and slapped a “wellness” label on it but ok \n\nI do also know some folks in recovery who seem to genuinely have the healthy balance, they’re runners but they don’t seem disorder about it and have spent many years getting to the point they’re at. \n\nSo yeah it varies I guess but I’ll ALWAYS side eye it a little since it’s so easy to find new behaviors and use “health” as an excuse to engage.",
      "created_utc": 1559035017.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ep4g9qy",
      "author": "FickleKaleidoscope",
      "body": "I agree for most that it’s more that their ED morphs into orthorexia - with one specific exception I’ve found. She’s mostly on YouTube but also Instagram. Her name is Natacha Océane and she’s amazing and quite open about recovering from her eating disorder and how she eats now etc",
      "created_utc": 1559039570.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ep2jd7m",
      "author": "Unicorn-Tears-",
      "body": "I guess it’s all situational, manny athletes train like crazy bec they do it for competition and no one questions it. Maybe they want those results and know the only way to achieve them is crazy strict regimes. But who knows, I think you never know till much later and also nothing lasts forever so even if they do they may later in years explain or maybe they just love that way of life, who rly knows.",
      "created_utc": 1559009057.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ep3mcpj",
      "author": "dontt1",
      "body": "I got into sport and fitness for the same reason, I wanted to convince myself that weight doesn't matter but I'm not sure it completely worked for me.\n\nI started exercising regularly 3 months ago and like yeah the results are starting to show but I got 3 kilos heavier, and I hadn't gained weight since 2013 so it bothered me to no end, now I'm 'shedding fat' which means I'm shifting from anorexic to orthorexic I guess (getting the right amounts of nutrients from the right sources and shit like that), I still eat more than before but I eat way less than the average human, also I moved from obsessively calorie counting to obsessively calorie burning.  \n\nBasically everything changed and nothing did.",
      "created_utc": 1559025153.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ep567nf",
      "author": "sahara575",
      "body": "I do find that weightlifting has been helpful for me and I get into a healthier mindset. I can tell myself I want strong not thin. But then if I don’t go to the gym I beat myself up about it. There is no magic cure for an eating disorder.",
      "created_utc": 1559051141.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ep41t54",
      "author": "KilaVik",
      "body": "Yeah probably. Wanting to recover but that subconscious desire for control desperately tries to sneak in through every crack and It manifests in many ways. When I first started recovery my immediate reaction was to do keto. I never gave a shit about macros prior to this. Even in my worst phase of anorexia, the only thing that mattered were calories. Now I start eating 2000 calories a day and suddenly I have to restrict carbs \"because reasons and stuff\". It gave me something to control and obsess over while eating a healthy amount of calories.  Also did intermittent fasting \"because reasons\" lol it's amazing how the mind works.",
      "created_utc": 1559032323.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ep6n2zg",
      "author": "artsy-pamplemousse",
      "body": "I think there are certain fitness cultures that cultivate, tolerate, and disguise EDs very well and naturally people that have an unhealthy relationship with their bodies often gravitate towards these sports, whether it be bodybuilding, dance, figure skating, long-distance running or otherwise.  \n\n\nOn the flipside, there are some sports that lend themselves much more to body positivity and or welcome a wider range of body types. Yoga and triathlon come to mind as being a couple. I think in these contexts tracking your personal progress or achievement on social media is more about performance and fueling rather than examining the aesthetics of a specific body part or obsessing over macro-nutrients.  \n\n\nI think that the divide between recreation and competitive also plays a role in hiding ED's. Competitive strains of any sport help to justify extreme eating behaviors and regimes much more than recreational ones.",
      "created_utc": 1559071133.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ep6t0s5",
      "author": "jordan921",
      "body": "Coming from just my personal experience, fitness really helped change my relationship with food. When I started crossfitting and lifting, I wanted to get stronger because my body felt so much better, and I began to see food as the fuel and energy my body needed in order to kick ass and feel great. In the beginning I counted calories and macros, but then I stopped caring about meeting certain numbers and my weight and more about how my body was feeling and the energy I had. I learned to eat intuitively for fuel, and although I worked out 5-6 days a week, it wasn't obsessive for me. It was just something I genuinely enjoyed and made me feel good. If I missed a day or had to take a week off it's fine, I don't need to get restrictive. My muscle memory will pick it back up when my body is ready again. I got excited about eating enough and fueling my body and being healthy. Mind you I do stick too a mainly clean diet and avoid certain foods due to intolerances and allergies and how some make me feel foggy and tired, and generally try to stay away from some foods I used to binge on, but I'm not highly restrictive and will indulge myself some treats at a party and not feel bad and ashamed about it. The disease is still there trying to drag me down always, it's mostly am emotional battle for me and every once in a while depression and anxiety will make me want to use ED behaviors to cope, but with fitness it makes it easier for me to not revert to them because I realize I want to be strong and feel healthy, and exercise helps with endorphins. Being healthy makes me feel happy.",
      "created_utc": 1559073205.0,
      "score": 1,
      "context": []
    },
    {
      "id": "epabw2n",
      "author": "j01ene",
      "body": "Eating disorder is much about goals, achievments, being the best. Transferring weight loss goal to a weigh lifting goal helps to switch to a much healthier obsession. And yes, they all are still obsessed with food, workout routine etc. \n\nThe main thing here is that it is way more healthy.",
      "created_utc": 1559125450.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eq8vmpp",
      "author": "cadorable",
      "body": "As a person who has had an eating disorder for almost 3 years and is into the gym/fit life. I can say that going to the gym has helped lessen the intensity of my ED, and I do see it possible that one day I could stop completely. I’ve noticed it in other people with EDs who stopped and transitioned over to going to the gym. But I can’t say that it’s an unhealthy thing in the same was that my ED is and it’s nowhere nearly as obsessive. So I think it’s genuinely possible for some influencers claims to be true, but other could have just replaced their old habit with a new one?",
      "created_utc": 1559876740.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eqkmaek",
      "author": "DizzyLynnette",
      "body": "Exercising and sports really did help me and put me in a better mindset, UNTIL I started doing 7+ hours a day 5-6 days a week. I felt great at the time, but hindsight, not so good probably... went into really bad depression when I had to stop and didn't know how to manage without it.",
      "created_utc": 1560126361.0,
      "score": 1,
      "context": []
    },
    {
      "id": "epbcpt3",
      "author": "okaygrl",
      "body": "This orthorexia is really a problem because not so many people know about it, yet it is a great way to manage comments implying that they have ED. They still promote unrealistic body image but are hidden behind this “wellness/holistic” facade.\n\nIf they truly loved themselves like they say (to spread positive message) they would just eat something they really like without burning all of it later at the gym.",
      "created_utc": 1559140810.0,
      "score": 8,
      "context": [
        {
          "id": "ep1sv79",
          "author": "ryden2008",
          "body": "in my opinion, their ED likely just transformed into orthorexia (strictly healthy diets + exercise). you’re right, they do still obsess over food and it seems like they just find new ways to restrict",
          "created_utc": 1558995299.0
        }
      ]
    },
    {
      "id": "ep6a081",
      "author": "tangsoodoblackbelt",
      "body": "Yep agree with this!  It’s just a justification of the ED behaviors.",
      "created_utc": 1559066438.0,
      "score": 3,
      "context": [
        {
          "id": "ep1sv79",
          "author": "ryden2008",
          "body": "in my opinion, their ED likely just transformed into orthorexia (strictly healthy diets + exercise). you’re right, they do still obsess over food and it seems like they just find new ways to restrict",
          "created_utc": 1558995299.0
        }
      ]
    },
    {
      "id": "ep291zl",
      "author": "Rotorr89",
      "body": "I agree. I became obsessed with running and working out. Even though I was eating a lot in comparison to how much I restricted myself. I heavily relied on running and exercising as a way to mentally balance out (and if I didn’t Run or I missed a work out I’d feel anxious and panicked) When I became injured, the real work had to kick in. Realizing my patterns, noticing my cycle and making conscious efforts to respond differently. \n\nFor me I feel like ED will never be “fixed” but something I work on every day.",
      "created_utc": 1559004348.0,
      "score": 14,
      "context": [
        {
          "id": "ep1u67k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1558996176.0
        }
      ]
    },
    {
      "id": "epq9gyn",
      "author": "emdee39",
      "body": "Physically healthy, but not mentally healthy.",
      "created_utc": 1559402003.0,
      "score": 2,
      "context": [
        {
          "id": "epabw2n",
          "author": "j01ene",
          "body": "Eating disorder is much about goals, achievments, being the best. Transferring weight loss goal to a weigh lifting goal helps to switch to a much healthier obsession. And yes, they all are still obsessed with food, workout routine etc. \n\nThe main thing here is that it is way more healthy.",
          "created_utc": 1559125450.0
        }
      ]
    },
    {
      "id": "epq9k98",
      "author": "j01ene",
      "body": "Better than nothing, you know..",
      "created_utc": 1559402050.0,
      "score": 1,
      "context": [
        {
          "id": "epabw2n",
          "author": "j01ene",
          "body": "Eating disorder is much about goals, achievments, being the best. Transferring weight loss goal to a weigh lifting goal helps to switch to a much healthier obsession. And yes, they all are still obsessed with food, workout routine etc. \n\nThe main thing here is that it is way more healthy.",
          "created_utc": 1559125450.0
        },
        {
          "id": "epq9gyn",
          "author": "emdee39",
          "body": "Physically healthy, but not mentally healthy.",
          "created_utc": 1559402003.0
        }
      ]
    }
  ]
}