{
  "id": "bynnlj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1560106589.0,
  "title": "Request: Do you ever really recover",
  "selftext": "I can’t imagine ever having a healthy relationship with food. I can’t take this for much longer, I know I look too skinny and I know I’m harming my body but I can’t even imagine eating a meal and not feeling like shit and making myself throw it back up,,, I really cannot live like this\n\n\n\n\nSorry if I’m requesting to post wrong I’m just drunk and looking for advice I’m so sorry if this is triggering or breaks post rules",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/bynnlj/request_do_you_ever_really_recover/",
  "score": 52,
  "num_comments": 11,
  "comments": [
    {
      "id": "eqjmucu",
      "author": "Corrupted-angel",
      "body": "I was at my very worst last fall, now im doing miles better. Its possible! Never give up, every tiny thing counts. You won’t notice the “change” as it happens, bc its so small at the time. An extra bite, a snack, not looking at the labels, passing by the mirror without feeling disgust, laughing a little more, feeling the energy in your body and mind come back. Idk what im saying anymore but yes recovery is possible. \nSure i need to be mindful of triggers still but i feel like myself again. My mind is no longer consumed with my eating disorder and im happy with that",
      "created_utc": 1560107817.0,
      "score": 11,
      "context": []
    },
    {
      "id": "eqk9x5a",
      "author": "almondsandolives",
      "body": "Yes. I am 100% recovered. And have been recovered from anorexia and bulimia for 4 years without any relapsing or ED thoughts. I struggled for 11 years (I almost died twice) and went to rehab every summer. It’s possible.",
      "created_utc": 1560118629.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eqk67hp",
      "author": "tolkiensghost",
      "body": "When people go to Alcoholics Anonymous, they're told, once you're an alcoholic, you're always an alcoholic. You might be an alcoholic who hasn't had a drink in 20 years, but you're never \"recovered.\" It's part of who you are forever. I think eating disorders are the same; you're always an anorexic or bulimic or whatever the case may be. But you can be one who's been in recovery for a really, really long time. I don't think it has to be discouraging; just because it's always part of you doesn't mean it always has to control you. I think it's just good to be aware that food-negative thoughts will probably always be there, and it's always going to be a challenge, but one you can absolutely win if you keep working.",
      "created_utc": 1560116775.0,
      "score": 8,
      "context": []
    },
    {
      "id": "eql2hv6",
      "author": "lunalyra",
      "body": "That’s a hard one. I’m 20 now and I’ve had an eating disorder since I was about 12. Half of those 8 years were spent not eating anything at all and ruining my body and the other were trying to “recover” but binge eating and again ruining my body. I have now been in “recovery” for the better part of 2 years it was spent binge eating again to try and recover from my lowest weight ever and now I’m trying to lose weight the healthy way through minimal deficits and exercise and honestly it is the hardest thing I’ve ever done. My mind keeps jumping back and forth between starving myself again or hard work. I don’t know if I want my thigh gap back or to highlight my natural curves. I go from healthy eating to binging to starving to IF and I can’t just land on one method or way of thinking and therefore I just stay in place. I’ve tried mixing intermittent fasting with exercise and a moderate calorie intake but it just isn’t fast enough. I just keep thinking, I know how to do this fast and effectively but I know it’ll just repeat the cycle I’ve been stuck in for years. I think you can have a healthy relationship with food and exercise and your body eventually but I don’t think that nagging voice in your head even if it’s only once in a blue moon ever completely goes away. I hope one day I can just eat food and not stress about losing weight or my calorie intake or where it’ll go but sadly I’m not sure it ever will entirely happen. Then again I’ve never gone to therapy for my disorder or gone inpatient so maybe those things could help. But I will say this even my attempts at healthy living regardless of what I think sometimes is the best thing I’ve ever done. I am happier and healthier now comparatively to when I was at my lowest weight and that counts for a lot.",
      "created_utc": 1560135843.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eqljxk3",
      "author": "vanillyl",
      "body": "I’m 31 and I’ve struggled with anorexia/bulimia since I was 13. At times I’ve been so depressed and caught up in my illness that all I’ve wanted to do is die, so that I don’t have to live like this any more; the most recent time I felt like this would have been maybe 8 months ago. \n\nToday, I was thinking about making a post saying how much better I feel at the moment. Since March, I’ve really turned a corner. I’ve been watching what I eat less, haven’t binged, and have only purged maybe 4 times or so. 8 months ago I was caught up in my usual pattern of starve as long as I can stand it, finally cave, eat a huge meal, then purge immediately afterwards. This most recent spell lasted over 2 years. I felt so utterly hopeless and like a total failure having fallen right back into the same shit that destroyed my enjoyment of life when I was still just a kid.\n\nLast week I purged and admitted as much to my partner, and cried about how sorry I was. And he gently reminded me that it was the first time I’d done so in weeks, that he doesn’t expect the problem to go away overnight and that I shouldn’t either. I hadn’t even realised until he mentioned it how well I’ve been doing. I’ve broken the cycle of needing to purge every time I eat. I’ve broken the cycle of needing to purge every time I feel full. The part I haven’t come to grips with yet is purging when I feel overly full, or know I’ve consumed over my rough mental calorie budget for the day. But I’ve made progress. \n\nYou will get better. You will get worse. You will be unable to cope sometimes. You’ll break down, and cry, and not want to go on any more. You’ll beat yourself up. You will feel like you should be able to change this and fix it yourself, you will feel like this is a choice you are making, and you will blame yourself. Sometimes you will tell people who understand, sometimes you’ll tell people who make you feel even worse about it. Sometimes you’ll want to die, and sometimes you’ll be so angry that you’re like this you will find an unexpected motivation to get better. Some therapy will help, some will be next to useless.\n\nThis illness is not your fault. It is just that, an illness. It is not something you will always be able to control. It is not a choice.\n\nThe choice that is in your hands, is to start back up the road to recovery. If therapy is too costly, or you’re not ready to make a start yet, you can take some small steps yourself, and start to make some small choices to battle this. The first is to be as kind to yourself as you possibly can be. Try and wean yourself off some of those daily ED rituals, like weighing yourself multiple times, measuring your wrist with your fingers, admiring your protruding bones in the mirror. Don’t try and rush yourself into stopping altogether, just put it off for a while and make those intervals longer and longer. \n\nFind a new focus in life to take up your thoughts. Learning a language can be great like this. If you catch yourself calorie counting, switch to rattling off as many numbers as you can in your target language. If you have any foods you consider safe, increase your portion size of those to get yourself used to the feeling of being full; leafy greens, low calorie fruit etc. Gradually build on that so maybe just a bowl of plain spinach gets a few additions, like tomato, red onion, feta etc. until you’re up to a full salad. Don’t rush yourself, but not don’t let yourself get away with too much either. This is about rebuilding your relationship with food, in a healthy way.\n\nI’ve done this for 18 years. It does get better. Your relationship with food will improve. There might be times you relapse, and that’s ok. You’ll get better again. As somebody who is well aware this is an issue I am still in the thick of, please feel free to take any of my advice with a grain of salt. These are just techniques I’ve found that have helped. I’m not a licensed therapist by any means, despite how many I’ve seen. What I can tell you is that this will get better, and you are not alone. \n\nPlease DM me if you ever want to talk.",
      "created_utc": 1560145706.0,
      "score": 3,
      "context": []
    },
    {
      "id": "equwmzc",
      "author": "LinnSamirCat",
      "body": "I believe you can recover 100%, eat intuitively and not care about food anymore. However, I believe only a minority of people reach this (mainly due to bad ED care. If you're at a stable weight and symptom free you're recovered enough for the psychiatry to ditch you.). \n\nI haven't reached full recovery, but in behaviour I've been perfectly healthy for 10 years. Still I definitely do feel bad about my weight, eating certain things and my body is my prison. I also believe how severe these thoughts are can depend on what happens in our life, and they can be stronger and weaker during different times. My doctor agreed to send me back to the ED care to get help for my thoughts and body dysphoria, to try to reach a fuller recovery. I just hope they'll take me and won't say my body is healthy, then they don't care. We'll see. I don't want to live like this anymore. I'm tired of being so restrained still. The better self esteem I've gotten during these years I've realised I deserve to be free. We all do.",
      "created_utc": 1560336896.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eqjqxml",
      "author": "Queenfanforever",
      "body": "I do t know if it’s possible either. At the end of everyday I tell myself I will do it tomorrow. Tomorrow is the day I will finally get it together and every tomorrow I fail. I don’t know :(. All I can say is I hope it will happen and can happen. You know?",
      "created_utc": 1560109799.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eqkw37c",
      "author": "hunkydory45",
      "body": "Yes. It's possible!! I am proof! Feel free to pm me if you want to chat.\n\nEdit: I once thought I never would be!",
      "created_utc": 1560132368.0,
      "score": 2,
      "context": []
    },
    {
      "id": "er6wf13",
      "author": "fifthsonata",
      "body": "You can recover. It’s never 100%, but you can get to a point where you can be pretty normal about food. I’ve had relapses, I periodically get “stuck” and find myself restricting without doing it on purpose....but for several years now, I’ve been okay. It really helped me to be open with the people I love, ask for help when I needed it, and just be around people with normal eating habits.\n\nYou’re never really “normal” and that argumentative voice in your head doesn’t go away.....but you learn how to turn down the volume.",
      "created_utc": 1560559486.0,
      "score": 1,
      "context": []
    },
    {
      "id": "et6djpx",
      "author": "iistra",
      "body": "It works for many people with ED types, but have you ever thought about going vegan? You will be forced to eat much healthier foods in general and can build up from there, for me it really helps to eliminate 90% of the “choice stress” regarding food, simply because 90% or more of the products sold in regular supermarkets contain some form of animal based additions and are therefore no longer an option... also it helps to keep the weight more stable naturally, because all the processed foods normally make us crave more and leave us dazed and confused, while eating vegan will/might make you feel more healthy and proud of your choices, which will lead to more happiness about yourself and therefore a healthier relationship with your body and food! Remember we have only one life in this particular lifetime, it would be a shame to turn 65 and realize we have wasted the best years of our life thinking we were fatter than we actually were..... good luck and keep faith!<3 Xo",
      "created_utc": 1562510291.0,
      "score": 1,
      "context": [
        {
          "id": "eql2hv6",
          "author": "lunalyra",
          "body": "That’s a hard one. I’m 20 now and I’ve had an eating disorder since I was about 12. Half of those 8 years were spent not eating anything at all and ruining my body and the other were trying to “recover” but binge eating and again ruining my body. I have now been in “recovery” for the better part of 2 years it was spent binge eating again to try and recover from my lowest weight ever and now I’m trying to lose weight the healthy way through minimal deficits and exercise and honestly it is the hardest thing I’ve ever done. My mind keeps jumping back and forth between starving myself again or hard work. I don’t know if I want my thigh gap back or to highlight my natural curves. I go from healthy eating to binging to starving to IF and I can’t just land on one method or way of thinking and therefore I just stay in place. I’ve tried mixing intermittent fasting with exercise and a moderate calorie intake but it just isn’t fast enough. I just keep thinking, I know how to do this fast and effectively but I know it’ll just repeat the cycle I’ve been stuck in for years. I think you can have a healthy relationship with food and exercise and your body eventually but I don’t think that nagging voice in your head even if it’s only once in a blue moon ever completely goes away. I hope one day I can just eat food and not stress about losing weight or my calorie intake or where it’ll go but sadly I’m not sure it ever will entirely happen. Then again I’ve never gone to therapy for my disorder or gone inpatient so maybe those things could help. But I will say this even my attempts at healthy living regardless of what I think sometimes is the best thing I’ve ever done. I am happier and healthier now comparatively to when I was at my lowest weight and that counts for a lot.",
          "created_utc": 1560135843.0
        }
      ]
    },
    {
      "id": "eqjty2t",
      "author": "None",
      "body": "I’ve been telling myself I’ll start tomorrow for the last five years, it doesn’t feel like long until I’ve actually sat down and thought about it, I feel like I’ve thrown away years of my life",
      "created_utc": 1560111195.0,
      "score": 1,
      "context": [
        {
          "id": "eqjqxml",
          "author": "Queenfanforever",
          "body": "I do t know if it’s possible either. At the end of everyday I tell myself I will do it tomorrow. Tomorrow is the day I will finally get it together and every tomorrow I fail. I don’t know :(. All I can say is I hope it will happen and can happen. You know?",
          "created_utc": 1560109799.0
        }
      ]
    }
  ]
}