{
  "id": "byvwqt",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1560160268.0,
  "title": "Request: “Just eat healthy”",
  "selftext": "I’m a little past overweight and trying to recover from an ed. I’m in a hospital program and my girlfriend knows all of this. Today i wanted to go to the beach but had a breakdown because clothes don’t fit me like they used to and she got really upset at me telling me to “just stop” saying mean things about myself (I know I shouldn’t but I was really upset). And when we were calling later she’s like “if you want to lose weight why don’t you just eat healthy?” And that hurt a lot. I can’t formulate the right words to explain why that bothers me so much. Does she think I didn’t try that first? Does the think I am faking the disorder? Does she think I don’t fight with myself whenever I get symptoms? Does she think I want to be fat? She knows my goal in recovery isn’t supposed to be weight loss. I’m just really really hurt.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/byvwqt/request_just_eat_healthy/",
  "score": 49,
  "num_comments": 17,
  "comments": [
    {
      "id": "eqnjupj",
      "author": "drinksriracha",
      "body": "It's possible to binge eat on healthy food.. I sold know. Granola, nuts, grains, beans.. There are plenty of high calorie health foods out there.",
      "created_utc": 1560176811.0,
      "score": 13,
      "context": []
    },
    {
      "id": "eqnilna",
      "author": "problematicbeing",
      "body": "People without ED's(who are also living in diet culture) don't realize how harmful it can be to tell someone in recovery to lose weight, because culturally it's ingrained to be like \"Overweight by blah blah blah standards? This is obviously a problem and you need to do something\"\n\n  \nKnow what is an actual problem? Having an effing eating disorder. Overweight by the dumb bmi scale doesn't usually/necessarily mean any health risks but having an eating disorder ALWAYS comes with very real health risks.  \n\n\n  \nED recovery is hard, part of it is building resiliency to comments like this, and that's really really hard to do. But you know what is right for you, and losing weight is definitely wrong and harmful for you. It's reasonable to be hurt, and It's reasonable to set boundaries with people, like asking them not to comment on your body or food intake.",
      "created_utc": 1560176405.0,
      "score": 22,
      "context": []
    },
    {
      "id": "eqncsk6",
      "author": "belikegracekelly",
      "body": "My boyfriend does this too and I think he says things like this out of frustration. He does so much for me but it obviously cant fix my ED. Their brains dont work like ours. I'm not trying to excuse these hurtful comments, rather explain why I think it happens. 🖤",
      "created_utc": 1560174496.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eqnu3pr",
      "author": "sutureIO",
      "body": "Once you get past the hurt, make sure she understands that there's no simple fix, no magic words, or moment of enlightenment that will solve your ED. Maybe you can compare it to something that is a large enough problem someone else has that they're not fully in control of, like telling a poor person to just make more money to stop being poor. \n\nThey are obviously trying, their life depends on it, but it's not like they can wake up and say, \"I'm going to be rich today.\"\n\nIf she accepts that, great, you've got a healthy supportive partner who simply became frustrated as an outsider with even less control than you. If you can forgive her and move on, congrats! You have a healthy dynamic and just like your problems won't be gone in a day, you should be grateful that you've got someone there on your journey with you, and be mindful of the next positive thing she's directed towards you and to be thankful to her for that.",
      "created_utc": 1560180247.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eqq4vgz",
      "author": "deena812044",
      "body": "There are websites and resources out there for friends and family of people with eating disorders. For a casual friend, this might not be something you want to pass along. But for a boyfriend or family member, I definitely think it's worth sharing with them. My boyfriend did a little research after I finally told him about my Ed, and it was so helpful to have him understand how to support me. At first, he admitted that he really didn't understand and had no idea what to say! So he definitely appreciated getting some information",
      "created_utc": 1560212212.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eqqmztm",
      "author": "MDeCambra",
      "body": "This is how I feel when people tell me I need to cut this and that and don’t eat this and don’t eat that or that I need to MEAL PREP. What people don’t understand is if something doesn’t feel good to eat in that time frame I won’t eat. If I don’t have something in my fridge that sounds good I won’t eat. If I restrict myself too much I stress about food and don’t eat. It’s not as simple as normal people act and it’s devastating and so frustrating. Those thoughts are more intrusive and disruptive than people realize.",
      "created_utc": 1560225430.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eqr4cd8",
      "author": "edie43",
      "body": "I had the same issue with my bf who recently admitted that he didn’t take my disorder seriously when I first told him and that he thought it had to do with a lack of self control. I posted about it i r/bulimia and got a lot of really nice replies there. I could link to the post here, but I’m not sure how? Anyway, the bottom line was that usually they mean well, but it’s really hard for someone who hasn’t been through it to understand how serious it is and how much control it has of your body. I would suggest taking your gf to therapy with you or maybe give her some literature so she can read up and get a better understanding?",
      "created_utc": 1560247504.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eqr6o7p",
      "author": "MaryContrary26",
      "body": "Kind of like telling an alcoholic to just have one drink...So I get that she can't really empathize with how it feels to have an eating disorder but I'll bet she has some addiction that she wouldn't be able to \"just quit\" (smoking? shoes? her phone?) Maybe she can begin to understand it from that perspective.",
      "created_utc": 1560250788.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eqrftu1",
      "author": "LinnSamirCat",
      "body": "I completely understand you! You have every reason to be upset! She needs more knowledge on eating disorders, and if you are talking to someone professionally, consider bringing her with you and talk about how she can best support you. What she should and shouldn't say.\n\nLastly I just want to give you a BIIIIG HUUUUUG!! It's gonna be okay, sweety <3",
      "created_utc": 1560259777.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eqry9k3",
      "author": "cindycindyy",
      "body": "Your girlfriend should seriously do some research about ED.\n\n&#x200B;\n\nOn another note, I know exactly how you feel about clothes not fitting like they used to. I was so fed up I finally decided to buy two pairs of jeans that fit. Best decision ever! Having clothes that fit your body the way you like is super important, and can help you feel better!",
      "created_utc": 1560272578.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eqnjv50",
      "author": "agree-with-you",
      "body": "I agree, this does seem possible.",
      "created_utc": 1560176815.0,
      "score": 1,
      "context": [
        {
          "id": "eqnjupj",
          "author": "drinksriracha",
          "body": "It's possible to binge eat on healthy food.. I sold know. Granola, nuts, grains, beans.. There are plenty of high calorie health foods out there.",
          "created_utc": 1560176811.0
        }
      ]
    },
    {
      "id": "eqp7kao",
      "author": "buceo21",
      "body": "I agree with this. My boyfriend is my greatest advocate and the biggest support I have had overcoming my ED. But sometimes he’s insensitive and says things that I don’t think he really means. Or rather, he didn’t mean what I heard. I know how hard it is, but she is allowed to get frustrated, you’re talking bad about someone she loves, of course it’s upsetting. People who don’t have eating disorders will always tell you stuff like why don’t you just eat healthy. It’s wrong, but don’t fault her for that. What you heard isn’t exactly what she meant, I’m sure. She didn’t mean to hurt you, discourage you, or belittle you. I think she meant to offer you a solution, one that might work for someone without an ED. Again, don’t fault her for that. Maybe kindly explain why it hurt you, but don’t make her feel bad about it. Like the other commenter said, her brain doesn’t work like yours.",
      "created_utc": 1560196711.0,
      "score": 4,
      "context": [
        {
          "id": "eqncsk6",
          "author": "belikegracekelly",
          "body": "My boyfriend does this too and I think he says things like this out of frustration. He does so much for me but it obviously cant fix my ED. Their brains dont work like ours. I'm not trying to excuse these hurtful comments, rather explain why I think it happens. 🖤",
          "created_utc": 1560174496.0
        }
      ]
    },
    {
      "id": "eqqn37d",
      "author": "MDeCambra",
      "body": "I wish my boyfriend did this. When I got diagnosed mine laughed and said “wow, you must be a fat anorexic then”",
      "created_utc": 1560225512.0,
      "score": 3,
      "context": [
        {
          "id": "eqq4vgz",
          "author": "deena812044",
          "body": "There are websites and resources out there for friends and family of people with eating disorders. For a casual friend, this might not be something you want to pass along. But for a boyfriend or family member, I definitely think it's worth sharing with them. My boyfriend did a little research after I finally told him about my Ed, and it was so helpful to have him understand how to support me. At first, he admitted that he really didn't understand and had no idea what to say! So he definitely appreciated getting some information",
          "created_utc": 1560212212.0
        }
      ]
    },
    {
      "id": "er1kfso",
      "author": "Musling15",
      "body": "\"If I don't have something in my fridge that sounds good I won't eat.\"\n\nOof. I'm going through this right now. I have litlle apetite at the moment, so when I open the fridge, I get overwhelmed and I push back eating untill I feel weak and sick.",
      "created_utc": 1560433031.0,
      "score": 2,
      "context": [
        {
          "id": "eqqmztm",
          "author": "MDeCambra",
          "body": "This is how I feel when people tell me I need to cut this and that and don’t eat this and don’t eat that or that I need to MEAL PREP. What people don’t understand is if something doesn’t feel good to eat in that time frame I won’t eat. If I don’t have something in my fridge that sounds good I won’t eat. If I restrict myself too much I stress about food and don’t eat. It’s not as simple as normal people act and it’s devastating and so frustrating. Those thoughts are more intrusive and disruptive than people realize.",
          "created_utc": 1560225430.0
        }
      ]
    },
    {
      "id": "er3lorp",
      "author": "None",
      "body": "Yes exactly! Like you wouldn't tell someone with depression to \"just be happy!\" or someone with a broken leg \"just walk!\". Things that seem obvious and easy for healthy, neurotypical people are NOT those things to people with illnesses. \n\nOP, your girlfriend should realize that if you could be cured from your eating disorder by snapping your fingers, you would've Thanos snapped that shit away ages ago. But illnesses don't work that way. You can't just say \"I'm suddenly cured and healthy and I have a normal relationship with food again\" and be done with it.",
      "created_utc": 1560466226.0,
      "score": 1,
      "context": [
        {
          "id": "eqr6o7p",
          "author": "MaryContrary26",
          "body": "Kind of like telling an alcoholic to just have one drink...So I get that she can't really empathize with how it feels to have an eating disorder but I'll bet she has some addiction that she wouldn't be able to \"just quit\" (smoking? shoes? her phone?) Maybe she can begin to understand it from that perspective.",
          "created_utc": 1560250788.0
        }
      ]
    },
    {
      "id": "eqr46py",
      "author": "edie43",
      "body": "This is awful, I feel really sorry for you that you had to experience this from the person who’s supposed to love and support you. He may have meant it in a humorous way, but in any case it’s incredibly insensitive and down right harmful to say something like that. I hope you either get rid of this guy or have a long serious talk. Good luck on your recovery!",
      "created_utc": 1560247257.0,
      "score": 3,
      "context": [
        {
          "id": "eqq4vgz",
          "author": "deena812044",
          "body": "There are websites and resources out there for friends and family of people with eating disorders. For a casual friend, this might not be something you want to pass along. But for a boyfriend or family member, I definitely think it's worth sharing with them. My boyfriend did a little research after I finally told him about my Ed, and it was so helpful to have him understand how to support me. At first, he admitted that he really didn't understand and had no idea what to say! So he definitely appreciated getting some information",
          "created_utc": 1560212212.0
        },
        {
          "id": "eqqn37d",
          "author": "MDeCambra",
          "body": "I wish my boyfriend did this. When I got diagnosed mine laughed and said “wow, you must be a fat anorexic then”",
          "created_utc": 1560225512.0
        }
      ]
    },
    {
      "id": "eqr3wkc",
      "author": "throwthediary",
      "body": "I hope ex boyfriend",
      "created_utc": 1560246813.0,
      "score": 2,
      "context": [
        {
          "id": "eqq4vgz",
          "author": "deena812044",
          "body": "There are websites and resources out there for friends and family of people with eating disorders. For a casual friend, this might not be something you want to pass along. But for a boyfriend or family member, I definitely think it's worth sharing with them. My boyfriend did a little research after I finally told him about my Ed, and it was so helpful to have him understand how to support me. At first, he admitted that he really didn't understand and had no idea what to say! So he definitely appreciated getting some information",
          "created_utc": 1560212212.0
        },
        {
          "id": "eqqn37d",
          "author": "MDeCambra",
          "body": "I wish my boyfriend did this. When I got diagnosed mine laughed and said “wow, you must be a fat anorexic then”",
          "created_utc": 1560225512.0
        }
      ]
    }
  ]
}