{
  "id": "c0d7hy",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1560469771.0,
  "title": "Request: How do you deal with waking up in the morning, looking in the mirror, and seeing your body different everyday?",
  "selftext": " \n\nI don’t know how to be okay with seeing parts of myself as bigger or smaller everyday, or even if these changes are real. I’ve dealt with body dysmorphia for almost as long as I can remember, and even with therapy once a week, I still struggle with accepting what I see in the mirror everyday. Every morning I wake up and inspect my stomach, thighs, arms to make sure they aren’t bigger or different than they were the previous day, and every morning I look different to myself. Does anyone else feel as though their body fluctuates everyday? Is this real or just dysmorphia messing with my mind? Any advice would be more than greatly appreciated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/c0d7hy/request_how_do_you_deal_with_waking_up_in_the/",
  "score": 110,
  "num_comments": 16,
  "comments": [
    {
      "id": "er3swd2",
      "author": "None",
      "body": "Wow I have the same problem. One day I’m feeling good and by the end of the day I feel like huge.",
      "created_utc": 1560471809.0,
      "score": 28,
      "context": []
    },
    {
      "id": "er3rl8z",
      "author": "_sileighty_",
      "body": "I just try to not look at myself in the mirror unless i really have to. Or just look at my face",
      "created_utc": 1560470810.0,
      "score": 15,
      "context": []
    },
    {
      "id": "er3rtf7",
      "author": "RadioActiveXSmile",
      "body": "I have never been diagnosed with body dysmorphia, but I constantly check my body all day. I have OCD and other anxiety issues that can explain my obsession with my body and compulsion to check it. My clothes don’t fit any different, but I also see different shapes and sizes throughout the day. \nI’ve convinced myself it’s mostly in my head and slight changes throughout the day are normal anyway.\nNot a solution, but you’re not alone.",
      "created_utc": 1560470982.0,
      "score": 12,
      "context": []
    },
    {
      "id": "er3vy6k",
      "author": "None",
      "body": "Eliminating ‘body checking’ helped so much.",
      "created_utc": 1560474207.0,
      "score": 6,
      "context": []
    },
    {
      "id": "er4i0d6",
      "author": "ragnarlybruh",
      "body": "I experience this all the time. But then I also experience the complete opposite. I've lost 40lbs and I still fail to see any physical changes. I still feel like I look just as fat.",
      "created_utc": 1560492706.0,
      "score": 2,
      "context": []
    },
    {
      "id": "er4qodk",
      "author": "RN2U",
      "body": "I honestly try not to look in the mirror for extended periods of time ... and I try to be dressed \nIt’s a cheat but for me it helps ... if I’m dressed I can focus on my face and hair ... if I’m less dressed well it’s bad",
      "created_utc": 1560505258.0,
      "score": 2,
      "context": []
    },
    {
      "id": "er5ziox",
      "author": "neddy_seagoon",
      "body": "I have a nightlight in my bathroom. I do everything but shave and comb my hair without the main light on when I remember. I struggle less with feelings about my size than with picking at my face as stress-relief, and it does a good job stopping that behavior.",
      "created_utc": 1560536734.0,
      "score": 2,
      "context": []
    },
    {
      "id": "erdggn3",
      "author": "sugarluna",
      "body": "I have the same thing!! It changes daily :( one day il look at my tummy from the side, its lean and tight and small. A day will go by and itll be like flubber and puffy and I feel I can grab a handful of it :( it's really stressful and triggers my fasting",
      "created_utc": 1560741212.0,
      "score": 2,
      "context": []
    },
    {
      "id": "er46uu6",
      "author": "courtnelly",
      "body": "I like to wear baggy clothes so I can't see the outline of my body, it's a good distraction.",
      "created_utc": 1560482587.0,
      "score": 1,
      "context": []
    },
    {
      "id": "er4hhft",
      "author": "EmbarassedBlueberry",
      "body": "I just avoid looking in the mirror for longer than I have to. It’s really helpful to keep a jacket that’s oversized and lightweight enough so you can cover up when things get really bad without overheating. It’s not the best solution but it gets me out of the house on bad days",
      "created_utc": 1560492099.0,
      "score": 1,
      "context": []
    },
    {
      "id": "er6m15c",
      "author": "theshizirl",
      "body": " I need to tell myself that my self-perception is skewed given my anorexic tendencies, and consciously choose to believe that obsession with a mirror or my perceived measurements will never do any good or change anything. \n\n It's hard and sometimes it feels like a constant battle. Like all mental disorders, and especially eating disorders, however, we have to realize that feeding into the problem will always make it worse, and we must hang in there, as hard as it is.",
      "created_utc": 1560550916.0,
      "score": 1,
      "context": []
    },
    {
      "id": "er6tev1",
      "author": "MaryContrary26",
      "body": "Ever go to a house of mirrors and some of them make you look really wide and some make you look really narrow? You know you don't really look like either one so maybe try to remember that what you see in your mirror isn't reality either. It took years after I recovered to finally be able to see what I really looked like and it was shocking to me that I thought I was so much bigger than I was.",
      "created_utc": 1560556882.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ereysxi",
      "author": "kelsobunny",
      "body": "I’ve kind of given up on trying to look good anymore. At this point I just try to always stay covered so no one else has to look at me either.",
      "created_utc": 1560796010.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f0judiu",
      "author": "GurnCity",
      "body": "I need to do the same I've gained 26 pounds in the last couple months and my life has been going downhill fast and keep looking at my self and I just look disgusting with my curved spine and buldging fat but I keep looking and it ain't getting any prettier, any advice?",
      "created_utc": 1568663255.0,
      "score": 1,
      "context": [
        {
          "id": "er3rl8z",
          "author": "_sileighty_",
          "body": "I just try to not look at myself in the mirror unless i really have to. Or just look at my face",
          "created_utc": 1560470810.0
        }
      ]
    },
    {
      "id": "es8hpts",
      "author": "ExoticOlives",
      "body": "I completly agree.",
      "created_utc": 1561698332.0,
      "score": 1,
      "context": [
        {
          "id": "er3vy6k",
          "author": "None",
          "body": "Eliminating ‘body checking’ helped so much.",
          "created_utc": 1560474207.0
        }
      ]
    },
    {
      "id": "f0zw127",
      "author": "_sileighty_",
      "body": "do small things to feel prettier, its a long road but it works. Exercise, intermittent fasting(i lost 15 pounds in like 2 months!!!) put some mascara, get a haircut, some new clothes. Not everyday will be good but if you start working for it now, its only gonna go uphill",
      "created_utc": 1569103741.0,
      "score": 1,
      "context": [
        {
          "id": "er3rl8z",
          "author": "_sileighty_",
          "body": "I just try to not look at myself in the mirror unless i really have to. Or just look at my face",
          "created_utc": 1560470810.0
        },
        {
          "id": "f0judiu",
          "author": "GurnCity",
          "body": "I need to do the same I've gained 26 pounds in the last couple months and my life has been going downhill fast and keep looking at my self and I just look disgusting with my curved spine and buldging fat but I keep looking and it ain't getting any prettier, any advice?",
          "created_utc": 1568663255.0
        }
      ]
    }
  ]
}