{
  "id": "c0xict",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1560606770.0,
  "title": "Request: I feel gross for eating.",
  "selftext": "I’ve dealt with anorexia in my young teenage years. I gained a lot of weight when I got older and got treated for my mental health issues. I’ve tried for years with diets and gym, and finally I’ve gotten to the point where i constantly losing weight. I still have some to lose, but I have gone from a healthy diet with chicken, to barely eat anything at all. \n\nI have the weekends where I enjoy chocolate and a bowl of popcorn, but yesterday I felt gross for eating. And it has been like that with all foods for the past five days. I feel sick and disgusted over being hungry and I’ve basically starved myself these five days. I finally managed to eat properly yesterday, also a few tortillas with beans. That’s is. And I felt horrible. Stomach cramps and nauseous. I’m scared. \n\nI’m at loss, and I’m scared I’ll end up like I did when I was a teen.\n\nI’m 28 and struggle with depression, which also has gotten worse over the past days.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/c0xict/request_i_feel_gross_for_eating/",
  "score": 45,
  "num_comments": 2,
  "comments": [
    {
      "id": "era9jzv",
      "author": "stopitma",
      "body": "I’m glad you’re reaching out! If you can, I would suggest trying to get some professional help before this gets worse.\n\nThe fact that you have the self reflection right now to see that you are struggling is a good thing. You can do this. Sometimes recovery includes small relapses and learning how to get back on our feet again. I hope that happens for you soon. \n\nHas something specific been bringing you down lately? I’ve noticed I’m more likely to relapse during times of stress, personally.",
      "created_utc": 1560638496.0,
      "score": 6,
      "context": []
    },
    {
      "id": "erinqmu",
      "author": "rileyyj001",
      "body": "Totally agree with you! Recovery is never linear. We have to remind ourselves that we can either take the setbacks at face value and continue trudging forward, or we can let them suck as back into the darkness that is this illness. If we are strong enough to live and struggle with this, we are strong enough to OVERCOME it.",
      "created_utc": 1560902449.0,
      "score": 1,
      "context": [
        {
          "id": "era9jzv",
          "author": "stopitma",
          "body": "I’m glad you’re reaching out! If you can, I would suggest trying to get some professional help before this gets worse.\n\nThe fact that you have the self reflection right now to see that you are struggling is a good thing. You can do this. Sometimes recovery includes small relapses and learning how to get back on our feet again. I hope that happens for you soon. \n\nHas something specific been bringing you down lately? I’ve noticed I’m more likely to relapse during times of stress, personally.",
          "created_utc": 1560638496.0
        }
      ]
    }
  ]
}