{
  "id": "c1gi5a",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1560727964.0,
  "title": "Request: Is it normal to go through cycles of recovery and relapse without any trigger?",
  "selftext": "For the last significant portion of my life I have been suffering from fear of eating. Right now I'm very underweight but not long ago I was a healthy weight and I don't know what even triggered my anxiety again for me to start obsessing about food and making me stop eating. So yeah my question is, is it normal to relapse for no reason with no trigger?\n\nThanks anyone that helps. I'm very desperate.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/c1gi5a/request_is_it_normal_to_go_through_cycles_of/",
  "score": 47,
  "num_comments": 7,
  "comments": [
    {
      "id": "erd3p3r",
      "author": "emfitch00",
      "body": "I don't know if I want to call it \"normal\" but it's common. I'm going through that exact same and my therapist said it's a common thing and probably triggered by stress/anxiety. Eating disorders are most often caused by a desire for control so when you feel out of control, restricting is an easy way to feel like you have that control once again. Prayers for you, me, and everyone else going through this, I believe all of us can one day recover :)",
      "created_utc": 1560729960.0,
      "score": 16,
      "context": []
    },
    {
      "id": "erd4dxz",
      "author": "youkillmewell11",
      "body": "It’s definitely common, for sure in my experience. I’d have the mindset to want to get better, but as someone else said only up to a point. The only thing I can say is keep trying- your effort alone means that you’re on the right track, even if you relapse. I know it’s not super helpful.. but know that we can relate and you’re never alone ❤️",
      "created_utc": 1560730546.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ere2hor",
      "author": "pukie-pie",
      "body": "It's common like everyone else has said. I'm rarely conscious of a trigger. Sometimes in retrospect I think \"Ah this thing happened which might have contributed\" but it may also be coincidence. I think there's a lot about our physiology and our subconscious that we are just unaware of. It can be unsettling but sometimes things just happen that we can't rationally explain.",
      "created_utc": 1560770881.0,
      "score": 4,
      "context": []
    },
    {
      "id": "erd3vnw",
      "author": "Brittmartini",
      "body": "Honestly I dont know how much help I can give but I definitely understand where you're coming from... i get like this all the time... it's like i can only recover up to a certain point until i start resorting back to old habits... the important thing is that you are and stay in the recovery mindset, no matter your symptoms because as long as you can stay in that mindset (even if your body isnt exactly recovering) you have a much better chance at recovery.... I believe that this process is filled with a bunch of set backs and they can make you feel horrible and that you'll never get better but it's all a part of recovery... maybe the faster you realize that you're relapsing the more successfully you can recover. Good luck in your recovery :)",
      "created_utc": 1560730114.0,
      "score": 3,
      "context": []
    },
    {
      "id": "erd3zdn",
      "author": "wormsocks",
      "body": "i think it is, that is really common with me and others that i know.",
      "created_utc": 1560730201.0,
      "score": 3,
      "context": []
    },
    {
      "id": "erd4s5x",
      "author": "tangsoodoblackbelt",
      "body": "Relapse is a normal part of recovery.  The most important thing is that you pull yourself out of it (with professional help if needed!) and continue working toward recovery.   \n\nTwo steps forward, one step back is how recovery goes.  It’s not a straight up path.  You will have setbacks, but it’s important to continue moving forward toward your goal of recovery.",
      "created_utc": 1560730885.0,
      "score": 3,
      "context": []
    },
    {
      "id": "erfkw7x",
      "author": "Synchro_Shoukan",
      "body": "There’s always a trigger, whether you realize or not.",
      "created_utc": 1560810909.0,
      "score": 1,
      "context": []
    }
  ]
}