{
  "id": "c1w8q0",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1560822641.0,
  "title": "Request: How to cope with weight gain?",
  "selftext": "The past few years I've been anorexic and bulimic. I barely ate and when I did I would track my calorie intake. I ran everyday. I puked out every thing I've ate. I've lost a ton of weight but it wasn't enough for me. \n\nIt got so bad that i had to go to the hospital. \n\nAfter that I realized I needed to change. I tried to eat regularly. I went vegan to convince myself to eat. I got rid of my weighing scale and my full body mirror (I constantly check my weight and my reflection to see if i gained weight or looked fat). I ended up trying out for our cheerleading team and that motivated me to continue eating so I wouldn't faint during my training.\n\nFor awhile I felt happy with my body. I was fit and healthy. I had no thought and signs of my eating disorder. I stopped counting calories and enjoyed eating. I realized how much I miss eating food. I got in a relationship soon after  My boyfriend is also an athlete with a high calorie intake so we would constantly go out to eat or go to buffets.\n\nAfter game season ended we stopped training for a bit and I gained weight. \n\nI cried when i saw my body at the mirror. I cried when i saw my weight. I cried when i realized my pants don't fit anymore. \n\nI've been binge eating and I'd purge right after. I'm back to working out everyday. I'm so lost since I struggled so hard to recover and now I'm relapsing so hard. How do you guys deal with weight gain? How to handle relapses? I don't want to stay bulimic",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/c1w8q0/request_how_to_cope_with_weight_gain/",
  "score": 39,
  "num_comments": 9,
  "comments": [
    {
      "id": "ergp9wc",
      "author": "covhr",
      "body": "it sounds like you never had any sort of treatment. I would advise you to get yourself a competent eating disorder trained therapist who will help you.",
      "created_utc": 1560851347.0,
      "score": 12,
      "context": []
    },
    {
      "id": "erg35ug",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1560825085.0,
      "score": 27,
      "context": []
    },
    {
      "id": "erh5hj7",
      "author": "slaystationone",
      "body": "First of all, I want to commend you for sticking around to stick this out. I want to remind you that your feelings are valid, what you're going through is relatable, and you trying your best shows how strong you are.\n\n>How do you guys deal with weight gain?\n\nThis is gonna sound weird, but there was this image collage I saw on Tumblr years ago—this person took pictures of their side as the day went, from after they woke up, after they ate lunch, and before they went to bed—that changed my perspective on weight gain, especially keeping a flat tummy throughout the day. As the day goes on, it's unrealistic to expect your stomach to be as slim as it is when you wake up. Obviously, you may look more bloated by the time you finish your dinner. That being said, I deal with my weight gain in a number of ways: being aware of my appetite and figure fluctuations with my menstrual cycle and stress levels and daily tasks, my diet, and when I eat. I'm at the point where I know that if I eat more on one day, the next day my appetite will probably be nil. I also try my best to remind myself \"you're hungry probably because you're stressed, but this is your body wanting to survive.\" I try my best to separate my emotional mechanisms from my physical mechanisms. It's easier to justify more trail mix than usual at night when I forget my room is messy and realize I'm going up and down three flights of stairs cleaning the house. It's also easier to justify more snacks in the afternoon than usual when I skip breakfast that day. It's also easier to reason my weight gain when I know the meals I cooked and snacks I chose are as nutritious as I could afford.\n\n>How to handle relapses?\n\nI have a mental countdown that's kinda like \"it's been \\~ <8 months since the last time I purged\" and it motivates me to keep that streak, similar to ex-smokers counting the days since their last cig. Considering how much money I spent on the food I ate, how hard I worked to pay for those ingredients, and the flavors I savored helps me put the importance of food into perspective; I'm less likely to purge if I think \"if I do, I'll be wasting my money, my nutrients, and this savory experience I worked hard to create.\" Something I continue to struggle with is figuring out what's purging in vain vs. purging because I'm genuinely nauseous or experiencing some digestive illness. If you know you're purging because something you ate isn't sitting right with you or you're experiencing symptoms that you know signal food poisoning, then purge. Otherwise, do breathing exercises or distract yourself with a hobby, try to let your temptations dissipate, drink water, and then evaluate.\n\nHave you talked to your boyfriend about how both of your dietary needs compare? I think being honest with him about your dietary expectations and anxieties can give him some perspective. It can also give him an idea of how both of you can compromise when you eat out together. Him being an immediate support system may help you balance your portions, communicate when you feel triggered—or on the flip side grateful for his support—and have a buddy to motivate you through your recovery.",
      "created_utc": 1560867653.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eri3rj0",
      "author": "isthised",
      "body": "For me it was focusing on function over form. Being really mindful and appreciative of the functions my body could do. If I could do them, so what if I was a little heavier or lighter.",
      "created_utc": 1560888891.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eri3bsp",
      "author": "None",
      "body": "Maybe some people won't agree that working out will help with recovering, I remember at the last outpatient I went to they would scold us for doing any kind of physical activity but I totally disagree. Working out made me feel better about eating and keeping it down. I am also bulimic and no matter how much I worked out it didn't matter if I ate enough to feel my fullness I would want to purge. I've been bulimic for over a decade and no matter how many days, weeks, or months I go without puking I can't not purge if I'm too full. The initial  weight gain when you recover is hard. It kind of creeps up on you and when you are and feel it, it just sucks. All I can recommend is eating smaller meals more often. Don't eat big meals and keep working out. Also I used get down on myself for slipping and purging if it's been awhile then I say fuck it and b/p more but a slip doesn't negate all the time you didn't purge and just pick up where you left off the next day.",
      "created_utc": 1560888622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eriwks7",
      "author": "None",
      "body": "I Lost a tooth to purging. I was throwing up one day and it just detached itself after all the damage from the stomach juices and I threw it up with the rest of the food. \n\nDid that stop.me? Nope \n\nWhat stopped me happened last October.\nI was throwing up basically ice cream, easier to bring back up right?\n\nSecond belch I get a piercing pain at the back of my head. It does not go away for hours. It's night. I wait for my husband to come home and my vision starts getting blurred. He makes me call emergency, I had a stroke. A fuxking blood vessel bursted in my head.\n\nThat's how quick it is to get to die.\n\nThat stopped me and gave me absolute thanatophobia and really put things into perspective.",
      "created_utc": 1560909186.0,
      "score": 1,
      "context": []
    },
    {
      "id": "erwl3hi",
      "author": "Gregisagoodfish",
      "body": "Hi, so a brief version of my story is that I had anorexica when i was young, I saw a deitian, gained some weight, not as much as she wanted but I though I was fine I felt fine everything was good the end. Nope, I relapsed hard a few years later. the outpatient nutritionist I saw even said she wouldnt see me, I needed a higher level of care. Eventually though, because my parents wouldnt support my schooling if I wasnt gaining weight and I just did not know how to deal with it, I fell into binge eating. I ate myself sick for 2 months basically.. And when I finally did start treatment I was a bit suicidal, they found something I had written, and I was dropped from treatement for 3 more weeks because they thought they could stick me in the hospital but the hospital let me go. When I finally got into inpatient treatment I was sick from binging THE NIGHT BEFORE. I had given up, my body and brain didnt know how to work with eachother. \n\nAfter I finally made it into the level of care I needed, I worked though it in a few months, got out and now I am doing pretty well. I still have minor slip ups but i know how to fuel my body and mostly accept it at the size it likes to be at. I can do other things, I am able to live without constantly thinking about food. I wish so much that I had fully dealt with my issues when they first came up. Getting help in a binge spiral feels terrible, at least for me it felt terrible, but its as good a time as any to deal with your issues so you can focus on the rest of your life. Best of luck.",
      "created_utc": 1561346929.0,
      "score": 1,
      "context": []
    },
    {
      "id": "erif8o5",
      "author": "gobluebabyyy",
      "body": "Some of this is good advice but I think for anyone who has struggled with an eating disorder counting calories is probably not “okay.” You need to see a dietician who specializes in eating disorders, not try to “eat healthy” or not drink any calories.",
      "created_utc": 1560896195.0,
      "score": 4,
      "context": [
        {
          "id": "erg35ug",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1560825085.0
        }
      ]
    },
    {
      "id": "erl2zdn",
      "author": "bloddymarey",
      "body": "I see what you're saying, but I have an eating disorder and have found positives in counting my calories. I set a goal, and it ends up letting me eat more calories than I thought I could. This is just my personal opinion and what I felt has helped me in my struggle. It may not be for everyone.",
      "created_utc": 1560977089.0,
      "score": 1,
      "context": [
        {
          "id": "erg35ug",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1560825085.0
        },
        {
          "id": "erif8o5",
          "author": "gobluebabyyy",
          "body": "Some of this is good advice but I think for anyone who has struggled with an eating disorder counting calories is probably not “okay.” You need to see a dietician who specializes in eating disorders, not try to “eat healthy” or not drink any calories.",
          "created_utc": 1560896195.0
        }
      ]
    }
  ]
}