{
  "id": "c5yy29",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1561597544.0,
  "title": "Request: Things are going far better than I'd anticipated",
  "selftext": "Hi, everyone. I just wanted to share with you how much I appreciate this sub. Today it's been 72 days since my last purge. I can't remember last time I felt that good. It's the longest I didn't purge in 6 years. \nI mean I still have these intrusive thoughts and sometimes it's not easy to eat my dinner. I gained a couple of kilos and that also makes me a bit sad. But I am NOT relapsing, can you beleive that???\nThis sub and my therapist saved me, I am sure. I feel almost healthy. I feel like I can make it to 90, 100, 1000 days. I'm typing this post and crying. I feel sorry for myself, for who I was. But I am hopeful, I enjoy my food and I finally felt full and liked it. \nI got a part time job so I could embrace my hobbies.\nI love my bullet journal. I love my ceramics. I love taking a nap during the day. And I love my breakfast, my lunch, my snacks and my dinner. \nThere is hope! Please enjoy life. There is a way to recover and thank you for showing it to me!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/c5yy29/request_things_are_going_far_better_than_id/",
  "score": 42,
  "num_comments": 6,
  "comments": [
    {
      "id": "es5nqb7",
      "author": "houston_veronica",
      "body": "omgosh!!! you're amazing!!!  I am in recovery for 14 years of AN.  (((((hugs)))) life is too great to give up. :-)",
      "created_utc": 1561619313.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es6bpxz",
      "author": "dontgetsad",
      "body": "I love reading things like this! Thank you for sharing! I made it 4 days without purging which is HUGE for me. I’ve slipped a few times but I’m not giving up this time. So proud of you!",
      "created_utc": 1561645585.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es6dga7",
      "author": "annielovesbacon",
      "body": "This just made me so happy!! You are FANTASTIC. Keep on keepin’ on and thank you for your kind words!",
      "created_utc": 1561646749.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es626q4",
      "author": "cadorable",
      "body": "I love this, I love this so much. Congrats, I hope I can one day get to your level, you’re showing me that it’s possible. Keep up the great work, you’ve truly come far .",
      "created_utc": 1561638173.0,
      "score": 2,
      "context": []
    },
    {
      "id": "es6kv05",
      "author": "tymopa",
      "body": "Congrats! I stopped after a 32 year cycle and it is the best. One thing I would avoid is weighing yourself. Your body has been through hell and worrying about weight is what has gotten most of us into ED. Do your body, mind, and soul a favor by giving the finger to the scale. Healthy people are at all sizes.",
      "created_utc": 1561651585.0,
      "score": 2,
      "context": []
    },
    {
      "id": "es6l22k",
      "author": "tymopa",
      "body": "Therapy my friend...I tried to quit on my own for 32 years and realized I needed an ED treatment program. You'll be surprised at how liberating and empowering it is.",
      "created_utc": 1561651711.0,
      "score": 1,
      "context": [
        {
          "id": "es626q4",
          "author": "cadorable",
          "body": "I love this, I love this so much. Congrats, I hope I can one day get to your level, you’re showing me that it’s possible. Keep up the great work, you’ve truly come far .",
          "created_utc": 1561638173.0
        }
      ]
    }
  ]
}