{
  "id": "c6eea5",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1561688252.0,
  "title": "Request: How do I accept the fact that I have an eating disorder?",
  "selftext": "I'm finally going to a therapist specializing in eating disorders starting July, but I constantly doubt myself and go back and forth from \"I have an eating disorder\" to \"I just have low self-esteem and I'm overreacting.\" I know I fall under almost all the characteristics of anorexia, but I'm at a healthy weight and I don't purge so I constantly feel like a fraud. I don't know what to do or how to cope or whatever. I feel like because I'm not doing as bad as other people with eating disorders that I don't truly have an eating disorder and that I don't need help. All advice welcome, thanks!!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/c6eea5/request_how_do_i_accept_the_fact_that_i_have_an/",
  "score": 38,
  "num_comments": 11,
  "comments": [
    {
      "id": "es8doiv",
      "author": "annielovesbacon",
      "body": "The idea of not being “sick enough” or “bad enough” is a huge thing in eating disorders. Your brain/eating disorder voice is lying to you. You deserve help and treatment no matter what you weigh, because eating disorders are MENTAL illnesses that just happen to have physical symptoms. Best of luck to you <3",
      "created_utc": 1561694489.0,
      "score": 26,
      "context": []
    },
    {
      "id": "es8almg",
      "author": "pyruvat3",
      "body": "Eating disorders (ED) are competitive. Don't compare yourself to other people or their eating disorder (easier said than done of course). I had this issue when I was going through recovery. I felt like I was also overreacting about my situation. When this happened to me, I journaled so I could work through my thoughts. It helped me put everything into perspective. In my head (where my thoughts were very chaotic) I would think it's not that bad, I'm just making a mountain out of a molehill. But when I took a step back, I could see how my ED consumed, controlled, and manipulated my life. If you feel like the ED behaviors are affecting your way of life and your happiness in any way, that is what matters. It doesn't matter how it compares to other people's. Also, ED are a mental illness so being at your healthy weight shouldn't prevent you from seeking help.",
      "created_utc": 1561691948.0,
      "score": 10,
      "context": []
    },
    {
      "id": "es8ep52",
      "author": "swaggysalamander",
      "body": "i’m really proud of you that you reached a point where you can admit that you have an issues. i know a lot of people with eating disorders never feel like they’re “sick enough” and because they’re not severely underweight that means they cannot have an eating disorder. however, one of my favorite sayings is that if one person drowns in three feet of water and one person drowns in nine feet of water, they both die. it’s grim, but gets the point across. eating disorders, though portrayed that way in modern media, can effect anyone and i’m glad you have the courage to recognize you have an ed",
      "created_utc": 1561695405.0,
      "score": 5,
      "context": []
    },
    {
      "id": "es8ho0v",
      "author": "None",
      "body": "If you're suffering, you're suffering. Don't worry about whether you have an eating disorder. You made an appointment because your behavior worries you, or you have \"low self-esteem\", or for some other reason. Your therapist will evaluate you, and make recommendations. Take them seriously; people in the throes of ED often have cognitive impairment, so don't rely too heavily on your own thinking. If you're not sure about what the therapist is saying, come back here and check with the ED crowd.\n\ntl,dr:\n\nTrust the experts.",
      "created_utc": 1561698283.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es8iiu7",
      "author": "ACatNamedLuna",
      "body": "Denial is a huge part of an ED. I’m proud of you for seeking help and showing up. Recovery means something different for everyone and can be many different paths, but I genuinely believe working with a therapist changed my life. After one year of hard work, the cognitive behavioral therapy truly changed my thoughts. From then on, when I thought “I don’t really have a problem compared to other people, I’m just reacting” I had the tools to redirect my thoughts and tell myself, “no, you do, and you deserve better than this”. I still use these tools every day. It took a long time to accept the ED, but eventually it clicked.",
      "created_utc": 1561699172.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es8v0uk",
      "author": "artsy-pamplemousse",
      "body": "Whether you have a mild eating disorder or a severe one ( which in the course of recovery can vary greatly in terms of your day to day behavior) - the issue is that you've recognized there's a problem and have sought professional help. Nothing but good can come of that and you have no need to feel guilt or shame about it, although this is very common as well. As eating disorders are about your mental health as much as the behavior around food that surrounds them, I think you've definitely taken the right steps forward.",
      "created_utc": 1561716295.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es8zqj9",
      "author": "zerotakashi",
      "body": "whatever bmi is considered 'healthy' is arbitrary. Plenty of slim 1920's flappers - boyish and slim was the ideal beauty type. Now that the US wants fatter women, anyone who is 1920's flapper-type is deemed underweight.\n\nSocietal standard aside, fat people can have an unhealthy relationship with food, too. bmi doesn't matter\n\nTruth is, we should encourage more people to get help at an earlier point, not later. It's preventative of worsening of symptoms, too. You also never know fully about yourself like a psychologist does - trust me. I get surprised often by myself through my psychologist's help. It's a whole worldview.",
      "created_utc": 1561722435.0,
      "score": 3,
      "context": []
    },
    {
      "id": "es8f1i8",
      "author": "48anon",
      "body": "Eating disorders are so tricky and the lies are so believable. But remember that you typically aren’t recommended to get help unless there’s an actual problem. I would trust them and go with it and I can pretty much guarantee once you look back, you will see it. I was forced into inpatient and still had to sometimes ask my therapist if I actually had an ed. But looking back it almost killed me and it’s hard for me to see how I ever believed I didn’t. Even though it’s confusing, stick with it- you will be glad you did.",
      "created_utc": 1561695721.0,
      "score": 2,
      "context": []
    },
    {
      "id": "escqzae",
      "author": "simonemeatsix1",
      "body": "Being a healthy weight means nothing when you have an unhealthy relationship with food! I think a big thing about eating disorders is that you always compare yourself to others. from experience the longer you leave it and don't talk to anyone the worse it gets. I hope you get the help you need!!",
      "created_utc": 1561836588.0,
      "score": 2,
      "context": []
    },
    {
      "id": "esae7oj",
      "author": "tangsoodoblackbelt",
      "body": "This is so true!  I said the exact same thing to my therapist.  Her response was: if you cannot stop doing what you are doing, you are “bad enough”.  She was right. \nAlmost 30 years of recovery.  I still love to exercise, and I eat a lot of things I would never eat before.  And best news: my biggest fear that I would “get fat” never did come true.  \n\nGet help and get better!  Then live your live to the fullest!",
      "created_utc": 1561757610.0,
      "score": 3,
      "context": [
        {
          "id": "es8doiv",
          "author": "annielovesbacon",
          "body": "The idea of not being “sick enough” or “bad enough” is a huge thing in eating disorders. Your brain/eating disorder voice is lying to you. You deserve help and treatment no matter what you weigh, because eating disorders are MENTAL illnesses that just happen to have physical symptoms. Best of luck to you <3",
          "created_utc": 1561694489.0
        }
      ]
    },
    {
      "id": "esah4eu",
      "author": "annielovesbacon",
      "body": "That sounds like something someone once said to me — “Wanting to be ‘bad enough’ means you’re already ‘bad enough.’ Healthy people do not want their mental or physical health to deteriorate.”",
      "created_utc": 1561759481.0,
      "score": 6,
      "context": [
        {
          "id": "es8doiv",
          "author": "annielovesbacon",
          "body": "The idea of not being “sick enough” or “bad enough” is a huge thing in eating disorders. Your brain/eating disorder voice is lying to you. You deserve help and treatment no matter what you weigh, because eating disorders are MENTAL illnesses that just happen to have physical symptoms. Best of luck to you <3",
          "created_utc": 1561694489.0
        },
        {
          "id": "esae7oj",
          "author": "tangsoodoblackbelt",
          "body": "This is so true!  I said the exact same thing to my therapist.  Her response was: if you cannot stop doing what you are doing, you are “bad enough”.  She was right. \nAlmost 30 years of recovery.  I still love to exercise, and I eat a lot of things I would never eat before.  And best news: my biggest fear that I would “get fat” never did come true.  \n\nGet help and get better!  Then live your live to the fullest!",
          "created_utc": 1561757610.0
        }
      ]
    }
  ]
}