{
  "id": "c90ab4",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1562230262.0,
  "title": "Request: I would like input on how to help my daughter",
  "selftext": "My daughter is 14 and is struggling with body image issues. I recently learned that she will sometimes not eat for days, when she does finally eat it's a binge it seems. this has caused her to become sick enough to vomit. She is seeing a therapist but the therapist said today that if this continues she would need a therapist that specializes in ED. \n\nI have removed the scale from the bathroom and I'm trying to check in with her about how she's feeling and trying to make stuff she would want to eat. But I really don't know how to approach this.\n\nTomorrow is gonna be super hot but she said she wont go swimming, I guess cause she doesn't want people to se her in a swimsuit. She's so beautiful and is at a good weight for her height and age but no amount of reassurance is helping. Please help",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/c90ab4/request_i_would_like_input_on_how_to_help_my/",
  "score": 66,
  "num_comments": 26,
  "comments": [
    {
      "id": "esrpesf",
      "author": "xopoppyxo",
      "body": "An ED specialist therapist will be the only way for your daughter to recover. It’s impossible for someone without the disorder/without training in the disorder to understand its mechanisms because it’s a very illogical condition. The only things you can do outside of professional counselling are making sure your daughter knows that she can trust you and speak to you whenever she wants to. As an anorexic teenagers myself the most helpful thing my mum does for me is taking me to buy my own food from supermarkets. Your daughter is much more likely to eat if she can select her own safe foods and count the calories in shop bought food rather than eating home cooked meals. The disorder is all about control and, even though this isn’t a sustainable system, giving her as much control over what she eats as possible might encourage her to eat at least some food, rather than nothing at all. Once the anorexic mind has been activated it’s nearly impossible to combat it alone, so get her on to that ED specific therapist as soon as possible.",
      "created_utc": 1562232365.0,
      "score": 46,
      "context": []
    },
    {
      "id": "esrttuc",
      "author": "youkillmewell11",
      "body": "Hi! It means so much that you’re looking for advice on how to help your daughter. I’m sure it’s hard to know what to do about such a touchy subject.  \n\nA specialist for ED will work much better than a general therapist. I think that seeing someone who can truly understand will be helpful. \n\nAs for what else you can do, let her know you’re there for her always if she needs someone to talk to or needs help.  She needs to know she’s not alone, even though she probably feels that way. Try to praise her on things unrelated to weight or beauty. It may get frustrating, but one thing to not do is place blame on her or the situation. \n\nJust love her through it and get some professional help for her. \n\nBest of luck! You are an amazing mom.",
      "created_utc": 1562236510.0,
      "score": 19,
      "context": []
    },
    {
      "id": "esrpbmk",
      "author": "IJustLikePornThanks",
      "body": "Try to post this in r/edanonymous as well. And good luck. I don't really have any good advice :)",
      "created_utc": 1562232276.0,
      "score": 6,
      "context": []
    },
    {
      "id": "esrrl5j",
      "author": "rachihc",
      "body": "Hi. I am sorry about this situation, it is hard for everyone around. You are a great parent to be there for her.   \n\n\nI am almost 30 now and I have being battling this for 18 years. So there might be a few things that I can say that in retrospective would have helped me. But keep in mind that everyone is different and what she needs might be very specific.  \n\n\nI would go with the therapist recommendation and find a specialist. And maybe search for support for yourself too, this can be a very overwhelming battle.   \nKeep reminding her that you love her and you will support her no matter what. Be patient with her, our sickness tries to convince us that we are disgusting and no one loves us.  \nTry to avoid comments about weight or calories around her, specially about her, but in general preferably. Instead try to bring the idea of being grateful that our body allows us to be in this wold, that we can do so much things we mostly take for granted, like walking, hearing or seeing.   \nBe supporting but not pushing, sometimes with our willing to help we can become too much and be contra productive, how much is too much,  well you will have to find out by listening and asking.   \nSafe foods, each of us have a few foods that we feel save to eat at any moment. For me fruits and yogurt for example. Always make sure she has her safe foods available and offer them every time she passes on a meal.   \nGet some multivitamins, specially once with B12. Vitamin deficiency can leave permanent damage.\n\nAlso a nutritionist can be helpful  in this process.",
      "created_utc": 1562234441.0,
      "score": 5,
      "context": []
    },
    {
      "id": "essr8l0",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1562256489.0,
      "score": 5,
      "context": []
    },
    {
      "id": "esryray",
      "author": "JaneFairfaxCult",
      "body": "I agree with others about an ED specialist.\n\nJust a thought about making foods you think she’d like to eat: \n\nI would avoid providing  things she’s likely to find “hyper palatable” and binge triggers.  Having them around may only make her anxious.  She may be more likely to eat enough if she’s convinced that she’s eating “healthy foods”, however she defines it for now.  An ED specialist can help her with balance - for now I’d just focus on mitigating her anxiety and helping her with an environment that won’t cause her to panic.\n\nJust my ramblings, not an expert, just lived it for decades.  Sending good thoughts.",
      "created_utc": 1562240738.0,
      "score": 5,
      "context": []
    },
    {
      "id": "esueynt",
      "author": "fauxghouI",
      "body": "I agree with everyone else saying that the ed specialist would help. It’s a mental illness, it takes time to recover from it. Best wishes to you and your daughter.",
      "created_utc": 1562282412.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eswc14y",
      "author": "None",
      "body": "Ive had annorexia for over years with relapses on and off. I have real issues with how  treatment is done. This is my prefered way to do things.\n\n\nDont remove her control! It will freak her out and lead to more extreame behaviours to compensate.\n\n\nLet her weigh herself - but in the context of normal  fluctuations e.g. food weight,  constipation, dehydration etc. I always weigh the least on a Thursday for a reason. If she doesnt know if shes losing or gaining she may restruct extra to ensure a loss.\n\n\nLet her know how many calories are in food , even homemade food. It can be a relief to know. I would teach her about recipies and weighing food, but also that its not an exact science - and thats okay! Its okay not to know sometimes and its okay to go over your allowance sometimes. Make it as stress free as possible.\n\n\nTeach her about TDEE and NEAT.\n\n\nTeach her about body composition - how losing more weight wont get rid of the jiggle but building muscle will. And you need to fuel muscle growth with lots of protein. Show her the pictures on the internet comparing thecsize of muscle and fat that weigh the same. Explain how you can weigh more but be a smaller size with weight lifting. Its great exercise.  \n\n\nTeach her how fat, even animal fat is essential for homone function and skin integrity. Fat is better for intestinal transit than fibre.\n\n\nFasting is okay, its benefical. Let her fast as long as she refuels properly afterwards ( not binging on sweets and carbs) \n\n\nRestriction is an addiction. Treat it that way.\n\n\nAvoid keeping trigger foods in the house - sweets, bread etc.  Keto is a brilliant way to get rid of binge cravings. She might get a bit hypoglycemic. She should try one or two glucose tablets to ese the feelkng so she can then make better food choices and avoid binging. \n\n\nHypoglycemia was a huge binge trigger for me. Sweets and carbs just make it worse, by far. \n\n \n\nRemember : she is growing. Her prefrontal cortex is still growing its cover so her thoughts ate not as rational as an adult, plus she is swimming in hormones. Please stay calm with her, listen. Reassure her that you love and value her. Dont resort to emotional blackmail. \n\n\nShow her the reddit instagram reality. Its eye opening. \n\nThere is more i can say here.\n\nMistakes:\nRemoving the scale. Removes the control\n\n\nSneaking additional calories into food. She will never trust you again, never feel comfortable trusting the calorie counts of food as she wont get the results she expected \n\nDo not lie to her. Ever. If she is chubby or flabby , acknowledge it, in the context that she isxin control of her body and can change it if she wants to. Emphasis on fitness and fueling perfomance through healthy eating ( mot vegan imo). I really believe in the keto/ low carb carnivore way of eating\n\n\n\nDo not force her to eat. Maybe offer an alternative. This was a major cause of my annorexia. My parents tried to force me to eat - it became a battle of wills i was determined to win. And i did. The more they forced the less i ate - just to spite them. \n\n\nIf she wants to be a low healthy bmi, thats okay. 18 is fine. No lower, but dont try to force a bmi of 22 as she will over compensate any go lower than 18 next time.\n\nThis is eveything i wished id known at 15. Im 42 now and i have a handle on it , but i still get into binge restrict cycles if im not careful \n\n When i say binge  i mean normal eating for normalkinda unhealthy people - pizza and carbs and sweets.  Im very petite and cant eat like that regularly without gaining weight.  I can look like a regular bmi 22 person eating some of that,  but i prefer myself at a bmi 18 and fittibg my  smaller clothes. Its not worth it to me to eat that stuff. \n\nI was veggie for many years (16) and it ruined my body composition (even though i danced). I had terrible cellulite at a low weight as my skin fascia was damaged by all the sugar (process of glycation) which made me restrict more. Much more meat and collagen supplements havd fixed this for me and im focusing of fitness and muscle tone now. I really wish someone had told me all this years ago. \n\nMy heart goes out to you and your daughter.",
      "created_utc": 1562312628.0,
      "score": 2,
      "context": []
    },
    {
      "id": "estzf2b",
      "author": "sickbagsong",
      "body": "See the specialist, definitely. Don't pressure her into stressful situations such as eating cake at a birthday party, just be there for her. Let her know you know this is difficult and it's not about the food, it's about her emotional and physical health. Make sure she knows they're equally important.\n\nSet meal times but choose not scary food like vegetables, salads, protein and legumes etc. Ask her on walks and maybe over time she will open up to you.\n\nThe most important thing is to strike the balance between understanding and interfering - it will be the hardest thing you'll ever do but also the greatest display of unconditional love. Make her feel supported and loved and try to make her see that food is not the most important thing in the world. These are all things I know I would have appreciated.\n\nI wish both you and her the best of luck 💖",
      "created_utc": 1562275567.0,
      "score": 1,
      "context": []
    },
    {
      "id": "esub50s",
      "author": "None",
      "body": "Help her find a therapist that she feels comfortable and safe with. No matter how many appointments that is, allow her to find that therapist. Finding a therapist is like finding the perfect pair of jeans. Let her know that she is loved and you are there for her, often. Reassurance is so helpful. Constant reminders and seeing that someone is concerned for her would help a bit. Try to see if you guys can go out and eat, but something healthy. If you expect her to eat a burger with you she will probably lose her shit, get upset, and obviously not eat that burger. Bring more healthy foods and snacks to the house to help her get a healthy relationship with food. If she’s surrounded by a lot of unhealthy and processed foods that she knows has a lot of calories she will not eat it. However if it’s healthy she may eat bits of it but please remember to be slow with her. Do not rush anything bc it may just make her feel worse. Please do not yell at her, be calm and try to be understanding. Go shopping with her maybe but only at a point you see her feeling a bit better and let her know that she looks okay. I am saying when she is better because the numbers and sizes are scary.  When it comes to food try to keep numbers off the table too. Also she probably does know that this isn’t healthy, but when you start to become anorexic nothing really matters. It’s so painful, you feel so alone, you never feel comfortable in your own body, you hate yourself, so much negativity it hurts so much. I’m still on and off and barely managing myself, but it’s so painful to see someone else struggling like me. I used to go to ediop and group therapy too and it helped. I’m stable now it’s just still difficult. I don’t want her to have permanent damage like me it just sucks..",
      "created_utc": 1562280742.0,
      "score": 1,
      "context": []
    },
    {
      "id": "esvzlh4",
      "author": "crazytoothbrushrat",
      "body": "don't watch her eat that might make her uncomfortable and upset and start hiding food",
      "created_utc": 1562306819.0,
      "score": 1,
      "context": []
    },
    {
      "id": "et5cuxq",
      "author": "Preshylust",
      "body": "I’ve battled with an eating disorder for 15 years now. Honestly, I think you are an amazing mother to recognize there may be a problem early and you are seeking help for her. My parents did the same thing and sent me to treatment at 19. Fast forward I got so sick this time around they sent me to residential out of state. HUGE, life changing help. Completely removing yourself to focus on yourself is scary but helped me a lot.\nThe biggest difference this time with my parents I noticed that’s more helpful is they ask how they can support. They don’t tip toe around or accuse me like they did before when they noticed I was under weight. \nMy parents and boyfriend have participated in family support groups to better understand. ED is such a touchy thing but especially more sensitive at her age. There is an underlining issue usually. With the right treatment team, and your support she has a high success rate of recovery. I wish you guys the best! 😉",
      "created_utc": 1562470139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "et6btvt",
      "author": "iistra",
      "body": "I want to wish you great strength with the situation! Being an anorexic/bulimic for 16 years now myself, I would advise to not ignore the problems. Send to serious (specialized, like recommended) therapy as fast as possible, and try to make her understand it is actually DEADLY and extremely life threatening what she is doing! Also chances are slim the situation will get better on its own, hearing the stage it is in, and seriously - it can always get worse, and the longer it is apparently accepted by the surroundings, the more it will be engraved in the core of her identity and the harder it will be to get rid of. It can get so ugly that she will wish she had gone to treatment herself, 15 years from now, at least I know I do.. so, once again, good luck and all blessings! Xo",
      "created_utc": 1562509166.0,
      "score": 1,
      "context": []
    },
    {
      "id": "etklv5n",
      "author": "None",
      "body": "I would push for that referral to see a specialized mental health clinician for your daughter.  If you are paying out of pocket, and are in the US, you may find a clinician here:  \n[Psychology Today:  Find a Therapist](https://www.psychologytoday.com/us/therapists) \n\nOn the other hand, you may want to learn more about eating disorders, which I would recommend searching for Dr. Laura Hill (based in Ohio), who has done significant research on the subject.",
      "created_utc": 1562901467.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eugs2cp",
      "author": "sausagechihuahua",
      "body": "Please get her to an eating disorder specialist. Some of the comments below about giving her more “control” by allowing her to count calories, or teach her about macros, or telling her to eat “healthy” foods, or exercise... probably mean well... but as someone who had an ED for 8 years, that could just transition her from anorexia or bulimia to orthorexia. She could just shift the obsession from restricting to eating “super healthy” and exercising excessively. I was so proud I “cured my own eating disorder” in my own mind... even though I was going to the gym 6 days a week and peeling breading off of chicken when no one was looking. The worst thing was, I was constantly praised for how “healthy” I was being when I was actually breaking my body down. \nUsually the underlying issues behind eating disorders are the need to feel in control, self esteem, anxiety. Did you know some people with anorexia have a negative chemical reaction in their brains after they eat that causes anxiety and the desire to avoid food? There are so many factors at play here that you really can’t recover alone. It’s impossible, no matter how caring and loving of a parent you are, for you to magically become a professional in this. You wouldn’t try to heal her broken leg yourself, so don’t feel that you can or should try to heal her ED yourself. Especially not just using some advice from reddit and some googling. Please get her to an eating disorder specialist. They will be so much more able to help you than anyone here on reddit.",
      "created_utc": 1563813822.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ev4izww",
      "author": "horahj",
      "body": "when my ED was the loudest voice I heard, it was often difficult for me to receive comments like \"you'll be okay\" or \"just eat, you'll be fine\", and my mother would often become upset with me when i would become triggered with her words which she had intended to use to encourage me.\n\nwhat i wish my mum did for me then (and i still wish she would do this with me now, as well) is listen to me. oftentimes, my mum would attempt to immediately extinguish my negative thoughts which never truly worked for me-- what i really wanted her to do was talk me THROUGH it and help me to understand why i was thinking the way i was.",
      "created_utc": 1564214820.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f26bc67",
      "author": "dragoono",
      "body": "Avoid talking about her appearance. I don't mean this to sound the way it does, but eating disorders are a type of attention-seeking behavior. More a cry for help than anything. Talking about her appearance will just put more fuel on the fire. If you want to express how scared you are for her, go ahead and do that, but try to talk about how you feel and less about what she's doing. The starving and self-image issues are just the tip of the iceberg, and I don't mean this to scare you, but what she's going through is something far more than you or anyone on this subreddit will understand. Everyone's disorder is different, and is rooted in different things. I'm not a parent, so I can only imagine how gut-wrenching this must be for you. Look up if there are any support-groups in your town or around it. It might be nice to talk to other families of people suffering from mental illness. I wish you and her nothing but good luck. This is a very dangerous illness, and she's lucky to have a mom like you to reach out to this community for her.",
      "created_utc": 1570001477.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ess8207",
      "author": "tipping",
      "body": "Would it be helpful to show her how to weigh her food and count calories or is that counter productive?",
      "created_utc": 1562246869.0,
      "score": 2,
      "context": [
        {
          "id": "esrrl5j",
          "author": "rachihc",
          "body": "Hi. I am sorry about this situation, it is hard for everyone around. You are a great parent to be there for her.   \n\n\nI am almost 30 now and I have being battling this for 18 years. So there might be a few things that I can say that in retrospective would have helped me. But keep in mind that everyone is different and what she needs might be very specific.  \n\n\nI would go with the therapist recommendation and find a specialist. And maybe search for support for yourself too, this can be a very overwhelming battle.   \nKeep reminding her that you love her and you will support her no matter what. Be patient with her, our sickness tries to convince us that we are disgusting and no one loves us.  \nTry to avoid comments about weight or calories around her, specially about her, but in general preferably. Instead try to bring the idea of being grateful that our body allows us to be in this wold, that we can do so much things we mostly take for granted, like walking, hearing or seeing.   \nBe supporting but not pushing, sometimes with our willing to help we can become too much and be contra productive, how much is too much,  well you will have to find out by listening and asking.   \nSafe foods, each of us have a few foods that we feel save to eat at any moment. For me fruits and yogurt for example. Always make sure she has her safe foods available and offer them every time she passes on a meal.   \nGet some multivitamins, specially once with B12. Vitamin deficiency can leave permanent damage.\n\nAlso a nutritionist can be helpful  in this process.",
          "created_utc": 1562234441.0
        }
      ]
    },
    {
      "id": "essye6w",
      "author": "youkillmewell11",
      "body": "I had a hard time with my mom too when she found out about my ED.  My mom called me disgusting and never once sought help for me (my ED began at 16).  She kept me away from family members or anyone she knew because I “made her look bad”.  It took me 10 years to tell a professional.  I respect this mom so much for looking for advice rather than lashing out.",
      "created_utc": 1562259524.0,
      "score": 3,
      "context": [
        {
          "id": "essr8l0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1562256489.0
        }
      ]
    },
    {
      "id": "essch62",
      "author": "rachihc",
      "body": "I would say is contra productive. When I learned this (by my own) I became obsessed with it. I was not able to eat anything that I myself didn't measured. This meant, not eating my mom's food, or anything someone else cooked. living counting the almonds you eat is hell.",
      "created_utc": 1562249386.0,
      "score": 9,
      "context": [
        {
          "id": "esrrl5j",
          "author": "rachihc",
          "body": "Hi. I am sorry about this situation, it is hard for everyone around. You are a great parent to be there for her.   \n\n\nI am almost 30 now and I have being battling this for 18 years. So there might be a few things that I can say that in retrospective would have helped me. But keep in mind that everyone is different and what she needs might be very specific.  \n\n\nI would go with the therapist recommendation and find a specialist. And maybe search for support for yourself too, this can be a very overwhelming battle.   \nKeep reminding her that you love her and you will support her no matter what. Be patient with her, our sickness tries to convince us that we are disgusting and no one loves us.  \nTry to avoid comments about weight or calories around her, specially about her, but in general preferably. Instead try to bring the idea of being grateful that our body allows us to be in this wold, that we can do so much things we mostly take for granted, like walking, hearing or seeing.   \nBe supporting but not pushing, sometimes with our willing to help we can become too much and be contra productive, how much is too much,  well you will have to find out by listening and asking.   \nSafe foods, each of us have a few foods that we feel save to eat at any moment. For me fruits and yogurt for example. Always make sure she has her safe foods available and offer them every time she passes on a meal.   \nGet some multivitamins, specially once with B12. Vitamin deficiency can leave permanent damage.\n\nAlso a nutritionist can be helpful  in this process.",
          "created_utc": 1562234441.0
        },
        {
          "id": "ess8207",
          "author": "tipping",
          "body": "Would it be helpful to show her how to weigh her food and count calories or is that counter productive?",
          "created_utc": 1562246869.0
        }
      ]
    },
    {
      "id": "esshuxm",
      "author": "None",
      "body": "Definitely don't do this.",
      "created_utc": 1562252089.0,
      "score": 6,
      "context": [
        {
          "id": "esrrl5j",
          "author": "rachihc",
          "body": "Hi. I am sorry about this situation, it is hard for everyone around. You are a great parent to be there for her.   \n\n\nI am almost 30 now and I have being battling this for 18 years. So there might be a few things that I can say that in retrospective would have helped me. But keep in mind that everyone is different and what she needs might be very specific.  \n\n\nI would go with the therapist recommendation and find a specialist. And maybe search for support for yourself too, this can be a very overwhelming battle.   \nKeep reminding her that you love her and you will support her no matter what. Be patient with her, our sickness tries to convince us that we are disgusting and no one loves us.  \nTry to avoid comments about weight or calories around her, specially about her, but in general preferably. Instead try to bring the idea of being grateful that our body allows us to be in this wold, that we can do so much things we mostly take for granted, like walking, hearing or seeing.   \nBe supporting but not pushing, sometimes with our willing to help we can become too much and be contra productive, how much is too much,  well you will have to find out by listening and asking.   \nSafe foods, each of us have a few foods that we feel save to eat at any moment. For me fruits and yogurt for example. Always make sure she has her safe foods available and offer them every time she passes on a meal.   \nGet some multivitamins, specially once with B12. Vitamin deficiency can leave permanent damage.\n\nAlso a nutritionist can be helpful  in this process.",
          "created_utc": 1562234441.0
        },
        {
          "id": "ess8207",
          "author": "tipping",
          "body": "Would it be helpful to show her how to weigh her food and count calories or is that counter productive?",
          "created_utc": 1562246869.0
        }
      ]
    },
    {
      "id": "etvgpgy",
      "author": "mignon8822",
      "body": "Once a got a food scale I got obsessive and I can not eat if I don’t weight my food. \nTo be honest scales in general are bad. Body scale is bad because even though when we achieve. Point we wanted we gonna want to punch even further and further, because we cannot see us as thin.",
      "created_utc": 1563234941.0,
      "score": 2,
      "context": [
        {
          "id": "esrrl5j",
          "author": "rachihc",
          "body": "Hi. I am sorry about this situation, it is hard for everyone around. You are a great parent to be there for her.   \n\n\nI am almost 30 now and I have being battling this for 18 years. So there might be a few things that I can say that in retrospective would have helped me. But keep in mind that everyone is different and what she needs might be very specific.  \n\n\nI would go with the therapist recommendation and find a specialist. And maybe search for support for yourself too, this can be a very overwhelming battle.   \nKeep reminding her that you love her and you will support her no matter what. Be patient with her, our sickness tries to convince us that we are disgusting and no one loves us.  \nTry to avoid comments about weight or calories around her, specially about her, but in general preferably. Instead try to bring the idea of being grateful that our body allows us to be in this wold, that we can do so much things we mostly take for granted, like walking, hearing or seeing.   \nBe supporting but not pushing, sometimes with our willing to help we can become too much and be contra productive, how much is too much,  well you will have to find out by listening and asking.   \nSafe foods, each of us have a few foods that we feel save to eat at any moment. For me fruits and yogurt for example. Always make sure she has her safe foods available and offer them every time she passes on a meal.   \nGet some multivitamins, specially once with B12. Vitamin deficiency can leave permanent damage.\n\nAlso a nutritionist can be helpful  in this process.",
          "created_utc": 1562234441.0
        },
        {
          "id": "ess8207",
          "author": "tipping",
          "body": "Would it be helpful to show her how to weigh her food and count calories or is that counter productive?",
          "created_utc": 1562246869.0
        }
      ]
    },
    {
      "id": "eswdg7e",
      "author": "None",
      "body": "For me that would be a great idea. It would give me control.",
      "created_utc": 1562313311.0,
      "score": 1,
      "context": [
        {
          "id": "esrrl5j",
          "author": "rachihc",
          "body": "Hi. I am sorry about this situation, it is hard for everyone around. You are a great parent to be there for her.   \n\n\nI am almost 30 now and I have being battling this for 18 years. So there might be a few things that I can say that in retrospective would have helped me. But keep in mind that everyone is different and what she needs might be very specific.  \n\n\nI would go with the therapist recommendation and find a specialist. And maybe search for support for yourself too, this can be a very overwhelming battle.   \nKeep reminding her that you love her and you will support her no matter what. Be patient with her, our sickness tries to convince us that we are disgusting and no one loves us.  \nTry to avoid comments about weight or calories around her, specially about her, but in general preferably. Instead try to bring the idea of being grateful that our body allows us to be in this wold, that we can do so much things we mostly take for granted, like walking, hearing or seeing.   \nBe supporting but not pushing, sometimes with our willing to help we can become too much and be contra productive, how much is too much,  well you will have to find out by listening and asking.   \nSafe foods, each of us have a few foods that we feel save to eat at any moment. For me fruits and yogurt for example. Always make sure she has her safe foods available and offer them every time she passes on a meal.   \nGet some multivitamins, specially once with B12. Vitamin deficiency can leave permanent damage.\n\nAlso a nutritionist can be helpful  in this process.",
          "created_utc": 1562234441.0
        },
        {
          "id": "ess8207",
          "author": "tipping",
          "body": "Would it be helpful to show her how to weigh her food and count calories or is that counter productive?",
          "created_utc": 1562246869.0
        }
      ]
    },
    {
      "id": "essdjqh",
      "author": "tipping",
      "body": "ok thanks for your input",
      "created_utc": 1562249967.0,
      "score": 3,
      "context": [
        {
          "id": "esrrl5j",
          "author": "rachihc",
          "body": "Hi. I am sorry about this situation, it is hard for everyone around. You are a great parent to be there for her.   \n\n\nI am almost 30 now and I have being battling this for 18 years. So there might be a few things that I can say that in retrospective would have helped me. But keep in mind that everyone is different and what she needs might be very specific.  \n\n\nI would go with the therapist recommendation and find a specialist. And maybe search for support for yourself too, this can be a very overwhelming battle.   \nKeep reminding her that you love her and you will support her no matter what. Be patient with her, our sickness tries to convince us that we are disgusting and no one loves us.  \nTry to avoid comments about weight or calories around her, specially about her, but in general preferably. Instead try to bring the idea of being grateful that our body allows us to be in this wold, that we can do so much things we mostly take for granted, like walking, hearing or seeing.   \nBe supporting but not pushing, sometimes with our willing to help we can become too much and be contra productive, how much is too much,  well you will have to find out by listening and asking.   \nSafe foods, each of us have a few foods that we feel save to eat at any moment. For me fruits and yogurt for example. Always make sure she has her safe foods available and offer them every time she passes on a meal.   \nGet some multivitamins, specially once with B12. Vitamin deficiency can leave permanent damage.\n\nAlso a nutritionist can be helpful  in this process.",
          "created_utc": 1562234441.0
        },
        {
          "id": "ess8207",
          "author": "tipping",
          "body": "Would it be helpful to show her how to weigh her food and count calories or is that counter productive?",
          "created_utc": 1562246869.0
        },
        {
          "id": "essch62",
          "author": "rachihc",
          "body": "I would say is contra productive. When I learned this (by my own) I became obsessed with it. I was not able to eat anything that I myself didn't measured. This meant, not eating my mom's food, or anything someone else cooked. living counting the almonds you eat is hell.",
          "created_utc": 1562249386.0
        }
      ]
    },
    {
      "id": "eswdkm9",
      "author": "None",
      "body": "I never found this. I still count almonds ( if i eat them). Its not a hassle",
      "created_utc": 1562313368.0,
      "score": 0,
      "context": [
        {
          "id": "esrrl5j",
          "author": "rachihc",
          "body": "Hi. I am sorry about this situation, it is hard for everyone around. You are a great parent to be there for her.   \n\n\nI am almost 30 now and I have being battling this for 18 years. So there might be a few things that I can say that in retrospective would have helped me. But keep in mind that everyone is different and what she needs might be very specific.  \n\n\nI would go with the therapist recommendation and find a specialist. And maybe search for support for yourself too, this can be a very overwhelming battle.   \nKeep reminding her that you love her and you will support her no matter what. Be patient with her, our sickness tries to convince us that we are disgusting and no one loves us.  \nTry to avoid comments about weight or calories around her, specially about her, but in general preferably. Instead try to bring the idea of being grateful that our body allows us to be in this wold, that we can do so much things we mostly take for granted, like walking, hearing or seeing.   \nBe supporting but not pushing, sometimes with our willing to help we can become too much and be contra productive, how much is too much,  well you will have to find out by listening and asking.   \nSafe foods, each of us have a few foods that we feel save to eat at any moment. For me fruits and yogurt for example. Always make sure she has her safe foods available and offer them every time she passes on a meal.   \nGet some multivitamins, specially once with B12. Vitamin deficiency can leave permanent damage.\n\nAlso a nutritionist can be helpful  in this process.",
          "created_utc": 1562234441.0
        },
        {
          "id": "ess8207",
          "author": "tipping",
          "body": "Would it be helpful to show her how to weigh her food and count calories or is that counter productive?",
          "created_utc": 1562246869.0
        },
        {
          "id": "essch62",
          "author": "rachihc",
          "body": "I would say is contra productive. When I learned this (by my own) I became obsessed with it. I was not able to eat anything that I myself didn't measured. This meant, not eating my mom's food, or anything someone else cooked. living counting the almonds you eat is hell.",
          "created_utc": 1562249386.0
        }
      ]
    },
    {
      "id": "esy28eg",
      "author": "tipping",
      "body": "That was my thought. But for some people it can become obsessive I suppose. Thanks for your input",
      "created_utc": 1562338092.0,
      "score": 1,
      "context": [
        {
          "id": "esrrl5j",
          "author": "rachihc",
          "body": "Hi. I am sorry about this situation, it is hard for everyone around. You are a great parent to be there for her.   \n\n\nI am almost 30 now and I have being battling this for 18 years. So there might be a few things that I can say that in retrospective would have helped me. But keep in mind that everyone is different and what she needs might be very specific.  \n\n\nI would go with the therapist recommendation and find a specialist. And maybe search for support for yourself too, this can be a very overwhelming battle.   \nKeep reminding her that you love her and you will support her no matter what. Be patient with her, our sickness tries to convince us that we are disgusting and no one loves us.  \nTry to avoid comments about weight or calories around her, specially about her, but in general preferably. Instead try to bring the idea of being grateful that our body allows us to be in this wold, that we can do so much things we mostly take for granted, like walking, hearing or seeing.   \nBe supporting but not pushing, sometimes with our willing to help we can become too much and be contra productive, how much is too much,  well you will have to find out by listening and asking.   \nSafe foods, each of us have a few foods that we feel save to eat at any moment. For me fruits and yogurt for example. Always make sure she has her safe foods available and offer them every time she passes on a meal.   \nGet some multivitamins, specially once with B12. Vitamin deficiency can leave permanent damage.\n\nAlso a nutritionist can be helpful  in this process.",
          "created_utc": 1562234441.0
        },
        {
          "id": "ess8207",
          "author": "tipping",
          "body": "Would it be helpful to show her how to weigh her food and count calories or is that counter productive?",
          "created_utc": 1562246869.0
        },
        {
          "id": "eswdg7e",
          "author": "None",
          "body": "For me that would be a great idea. It would give me control.",
          "created_utc": 1562313311.0
        }
      ]
    }
  ]
}