{
  "id": "ca0mbe",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1562458322.0,
  "title": "Request: How do you stop emotional over-eating?",
  "selftext": "I am well into adulthood and can’t seem to stop eating bad food excessively when I’m stressed/depressed/tired. For my health, I need to stop, but I can’t seem to last more than a day or two. The harder I try to stop, the more I eat. I feel mentally and physically awful, but I can’t break the cycle. How do I do this? Help!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ca0mbe/request_how_do_you_stop_emotional_overeating/",
  "score": 41,
  "num_comments": 6,
  "comments": [
    {
      "id": "et4yp5b",
      "author": "HuedGradiation",
      "body": "I'm recovering from an ED and also a social worker. We have a saying in SW school that you will always do the same behaviors until you find something better. Find something better. \n\nFor me, I didn't even realize it until I started doing it, but whenever I'm stressed or pissed off (my default emotion is normally anger whenever I am upset), I go for a walk. I've walked for hours all over Manhattan (I live in NYC) with headphones on, Spotify blasting (9/10 it's a Disney music playlist- dunno why, but it's the best when I'm feeling things), near trampling tourists on my way. I walked 4 miles (according to google maps) in about an hour just because I was super pissed.\n\nThat's just me though, but it could be literally anything: doing a sheet mask, watching a favorite movie (my husband knows that I need a good cry whenever he's not home and I watch one of those dumb young adult movies i.e Five Feet Apart, Dear Simon, If I Stay, etc.), playing a computer game, knitting, reading, whatever. I have a friend who paints her nails. She has like 200 nail polishes, paints them, and then listens to books on tape while she's letting them dry.",
      "created_utc": 1562460322.0,
      "score": 16,
      "context": []
    },
    {
      "id": "etc3a7p",
      "author": "bbnoelle",
      "body": "It has been religion for me. Just keep praying and feeling loved by God. And just try to relax and not overthink too much.",
      "created_utc": 1562673873.0,
      "score": 2,
      "context": []
    },
    {
      "id": "et57be8",
      "author": "pykfighter",
      "body": "I agree with what has been said. Find a different way to cope with whatever you are dealing with. Going out with my friends and doing something fun or active helps. Figure out what is stressful and try to solve that problem.",
      "created_utc": 1562465923.0,
      "score": 2,
      "context": []
    },
    {
      "id": "et5ms3g",
      "author": "tymopa",
      "body": "I could not stop until I got therapy with and actual eating disorder therapist.",
      "created_utc": 1562479795.0,
      "score": 1,
      "context": []
    },
    {
      "id": "et658n0",
      "author": "JayJoyK",
      "body": "For me I think to myself: Am I actually hungry or am I just upset? ( not in a starving myself sense ) \nI still ask myself every once and awhile when I’m upset if I’m just wanting to eat out of sadness. \n\nI do something healthy to take my mind off of that sad thing. Whether it be writing my issues on paper instead of self destruction or instead of getting angry at others, mediating, doing something spiritual, taking a bath, listening to music, going for a walk in a field, or even just hanging out w/ my dog or sitting outback to get fresh air. \n\nIf I’m hungry then I’ll eat, if it’s just something that’ll make me feel worse later then I wait until I’m actually hungry.",
      "created_utc": 1562504193.0,
      "score": 1,
      "context": []
    },
    {
      "id": "et528vp",
      "author": "Bedheady",
      "body": "I’m OP. Thanks for responding! I had to laugh a bit though because walking is also my thing. In fact, it’s probably the only reason I’m not overweight. I get what you’re saying about finding something to replace the habit, but I’m just not sure what can compete with food. The taste, texture, and instant gratification are intoxicating. I have young kids so I don’t have much time to develop new interests. Even finding a few minutes to out on makeup is often a challenge. But food is always right there. I guess I need to explore more, but I’m just so exhausted and discouraged that it sounds daunting.",
      "created_utc": 1562462529.0,
      "score": 7,
      "context": [
        {
          "id": "et4yp5b",
          "author": "HuedGradiation",
          "body": "I'm recovering from an ED and also a social worker. We have a saying in SW school that you will always do the same behaviors until you find something better. Find something better. \n\nFor me, I didn't even realize it until I started doing it, but whenever I'm stressed or pissed off (my default emotion is normally anger whenever I am upset), I go for a walk. I've walked for hours all over Manhattan (I live in NYC) with headphones on, Spotify blasting (9/10 it's a Disney music playlist- dunno why, but it's the best when I'm feeling things), near trampling tourists on my way. I walked 4 miles (according to google maps) in about an hour just because I was super pissed.\n\nThat's just me though, but it could be literally anything: doing a sheet mask, watching a favorite movie (my husband knows that I need a good cry whenever he's not home and I watch one of those dumb young adult movies i.e Five Feet Apart, Dear Simon, If I Stay, etc.), playing a computer game, knitting, reading, whatever. I have a friend who paints her nails. She has like 200 nail polishes, paints them, and then listens to books on tape while she's letting them dry.",
          "created_utc": 1562460322.0
        }
      ]
    }
  ]
}