{
  "id": "cetmv0",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1563462268.0,
  "title": "Request: Humiliated by my family",
  "selftext": "Unbeknownst to my family I have been dealing with bulimia/binge eating for a while now. I don’t live with them and I haven’t told them about it but recently I have been back home for a few weeks due to uncertain circumstances with my job and living situation. \n\nBeing back home has been challenging because there is always someone there watching, meaning I have to be careful about what I eat and when etc as I don’t want them to find out. I stopped purging a few weeks ago but I still have issues with binging and overeating. It hasn’t happened much but on a few occasions I have binged in the middle of the night when I thought everyone was sleeping. My younger sisters bedroom is directly next to the kitchen so she has apparently heard me in there rummaging etc. Then I heard my mum talking to my brother and sister this morning about how all I do is eat and that all the food she buys is disappearing. She said she can’t afford for me to stay here eating her food so I either have to leave, buy my own food or give her money towards groceries. I think that’s fair but I just feel so humiliated that it’s gotten to the stage where my family are talking about it behind my back. I already feel ashamed about the amount of weight I have gained during recovery and it makes it even worse to know that my family are talking about me saying I’m greedy and some kind of pig that won’t stop eating.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/cetmv0/request_humiliated_by_my_family/",
  "score": 55,
  "num_comments": 6,
  "comments": [
    {
      "id": "eu4vjdw",
      "author": "cindycindyy",
      "body": "Hi. I'm so sorry you're going through this. It seems like your family doesn't understand, because they don't know what's going on.",
      "created_utc": 1563464160.0,
      "score": 17,
      "context": []
    },
    {
      "id": "eu4wf2v",
      "author": "Tallulahbelle1971",
      "body": "HI!!!\n Its a tough place to be in...and i feel your pain!\nIve often said I can straight out tell people Im an alcoholic but It feels so much worse to say Im bulimic.. The words just wont come out...\nIts like people do not understand it...  unless theyve been there..\nMy family has pretty much ignored my ED..for years and thats been cool with me... I have uber healthy parents and Ive been a stress eater since HS \nI binge and purge because it gives me a release and I could control something.. \nI have my good and bad days\nIve learned tho not to beat myself up if I \"fall off the wagon!\"\n   Your family doesnt understand your disease...They cant and probably wont ever \"Get It!\"\nJust do the best you can.. if that means buying your own food and you can afford it then i would do that until you can get back out on your own\n I dont know if this helps you at all but I just wanted you to know you are not alone!✌️&❤️",
      "created_utc": 1563464719.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eu4w13i",
      "author": "None",
      "body": "They don’t understand \nI’m so sorry you are going through this \nI hope everything gets better but you aren’t embarrassing\nYou are struggling and you don’t deserve it",
      "created_utc": 1563464473.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eu790u5",
      "author": "AwkwrdSparklyPusheen",
      "body": "Your family is terribly rude, my family always says that the food in the house is everyone’s and we never have to ever think about eating something if we are hungry because “you never know when you’ll last meal with be lol” especially if your having money troubles already. Please don’t relapse because of them you’ve made progress and any progress is amazing. I would suggest getting an eating disorder workbook to help you with your internal needs. However I don’t have great advice on how to talk to them about it or if u should there’s free eating disorder books online as well.\nEdit: I have noticed that people without eating disorders say this type of stuff or jokes about weight without any thought that someone may have an issue, it’s so normal for them that sometimes I can’t even fathom it.",
      "created_utc": 1563522302.0,
      "score": 1,
      "context": []
    },
    {
      "id": "euadfne",
      "author": "None",
      "body": "Kill em all",
      "created_utc": 1563612627.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eu5spwb",
      "author": "tangsoodoblackbelt",
      "body": "Agree 100%... if family doesn’t know, they don’t understand why food is disappearing and can’t be supportive. \n\nMay I suggest that your consider that your family is not actually “humiliating you.”   Humiliation is something YOU feel as a reaction to the circumstances.  They are not intentionally or unintentionally “making” you feel that way.  \n\nPlease get into therapy/treatment.  Eating disorders are practically impossible to overcome without professional help.",
      "created_utc": 1563484494.0,
      "score": 4,
      "context": [
        {
          "id": "eu4vjdw",
          "author": "cindycindyy",
          "body": "Hi. I'm so sorry you're going through this. It seems like your family doesn't understand, because they don't know what's going on.",
          "created_utc": 1563464160.0
        }
      ]
    }
  ]
}