{
  "id": "cf5ixc",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1563529315.0,
  "title": "Request: Should I be worried if my partner who was previously hospitalized for an eating disorder is throwing up occasionally",
  "selftext": " \n\nMy partner was hospitalized for an eating disorder about five years ago during college. She has talked to me about it and says that she is in recovery and has it under control but still struggle sometimes. I also have my issues and remind her she is lovable and worthy even if she struggles or is imperfect.\n\nI’ve noticed that when things are going well she still throws up a couple times a month. When things aren’t going well (stress in our relationship, stress at her job, stress with her family) she throws up multiple times a week or even every day. I don’t bring it up when I notice.\n\nI have asked if there is anything I can do to be supportive and she says It’s not my responsibility and she has it under control, which I accept. I’ve encouraged her to see a therapist (she has expressed wanting to see one just for a normal life help). Is there more I should be doing? I want to maintain healthy boundaries but also worry about her.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/cf5ixc/request_should_i_be_worried_if_my_partner_who_was/",
  "score": 41,
  "num_comments": 9,
  "comments": [
    {
      "id": "eu7fo28",
      "author": "rosieb1",
      "body": "She doesn’t. She’s not okay. No one who throws up multiple times a week has it under control. They just think they do cause it’s a mental illness. My heart goes out to you two ❤️",
      "created_utc": 1563529827.0,
      "score": 43,
      "context": []
    },
    {
      "id": "eu7keaq",
      "author": "someone52207",
      "body": "There are 3 reasons why someone would be throwing up that often:\n\n1. Medication or health condition making her sick- she needs to see a doctor to get that straightened out.\n\n2. Anxiety so high she's getting sick- if anxiety gets to be bad enough that you're throwing up regularly, you definitely need to talk to a therapist and doctor. \n\n3. Eating disorder- she has a history of one, so this is most likely what's happening. You start off thinking it will only be this one time to help you cope because it was a bad day. Then it gets worse and next thing you know you're in full on relapse. If that's the case and she is/was serious about recovering she definitely needs to talk to a therapist and doctor. \n\nThere is no reason to be throwing up that often. If this is a recent relapse, it's best to address it before it becomes more ingrained. You should be worried. \n\nPlease address it carefully though. Come from a place of concern and try not to sound accusatory. You can suggest seeing someone and offer to help her find some help, but don't force it or make ultimatums. Remind her that you care about her wellbeing and that you just want to see her healthy and happy. \n\nAlso don't force her to stop or be a nazi patrolman about her puking. That will mean she'll become even more secretive and/or stop seeking you for help or disclosing it with you. You can be clear that you don't like seeing her suffer, but she needs to find another healthy coping skill before this one is stolen away.",
      "created_utc": 1563534766.0,
      "score": 15,
      "context": []
    },
    {
      "id": "eu7frku",
      "author": "rachihc",
      "body": "Yes. It is a clear sign of relapse. The sooner something is done to prevent the situation to decline, the better.  \n\n\nIt is not ok to purge even if we are stress, that is a warning sing, and that is not a fully recovered case. It is not your responsibility, sure, but that issue is clearly not under control and she is delusional to think so. Throwing up causes serious medical issues, that are not to ignore.  \n\n\nI suggest keep trying to find her a therapist. Maybe you can make a list of places for her to call (a ED specialist would be best) and offer to take her and wait for her. It is scary the first time. But is true if you push too much it can be unhelpful.",
      "created_utc": 1563529938.0,
      "score": 15,
      "context": []
    },
    {
      "id": "eu7ztk9",
      "author": "MedievalShrimp",
      "body": "Support her in positive ways and encourage her to seek help. Like others said don't try to 'cure her' on your own, itll only make her resent you and hide her behaviors more",
      "created_utc": 1563546669.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eu8fzdj",
      "author": "RayRay_Hessel",
      "body": "I agree with the others. Bulimia can cause death it is not a safe coping mechanism. She really needs some better coping skills. She's not in control. Ask her if being in hospital helped her any. And try to reduce stress in her life if u can. Ask her if she would rather talk about what's bothering her.",
      "created_utc": 1563556312.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eu8ibrs",
      "author": "tatisbrainhurts",
      "body": "Remind them they have had success in the past and this just a blip in their recovery. Ask what you can do to be supportive in this and what helps.",
      "created_utc": 1563557661.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eu8r7qt",
      "author": "lccarter28",
      "body": "You can call NEDA for help!",
      "created_utc": 1563562893.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eu9sntq",
      "author": "bflowry",
      "body": "As someone in recovery herself, it’s not easy to accept confrontation when approached with something as sensitive a topic as this. It sounds like you’re doing the best you can to support her. At the end of the day, she is responsible for her actions. The only person we can change is ourselves, and it’s often the hardest to do. \n\nSending good energy and hope you and your partner’s way. ♥️",
      "created_utc": 1563589648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "evdny4x",
      "author": "rileyyj001",
      "body": "Agree wholeheartedly about not forcing her to stop. I wish more people understood how important it is to not “threaten” the ED because by doing so, it becomes THAT much stronger. It sucks, but it’s true...",
      "created_utc": 1564442952.0,
      "score": 2,
      "context": [
        {
          "id": "eu7keaq",
          "author": "someone52207",
          "body": "There are 3 reasons why someone would be throwing up that often:\n\n1. Medication or health condition making her sick- she needs to see a doctor to get that straightened out.\n\n2. Anxiety so high she's getting sick- if anxiety gets to be bad enough that you're throwing up regularly, you definitely need to talk to a therapist and doctor. \n\n3. Eating disorder- she has a history of one, so this is most likely what's happening. You start off thinking it will only be this one time to help you cope because it was a bad day. Then it gets worse and next thing you know you're in full on relapse. If that's the case and she is/was serious about recovering she definitely needs to talk to a therapist and doctor. \n\nThere is no reason to be throwing up that often. If this is a recent relapse, it's best to address it before it becomes more ingrained. You should be worried. \n\nPlease address it carefully though. Come from a place of concern and try not to sound accusatory. You can suggest seeing someone and offer to help her find some help, but don't force it or make ultimatums. Remind her that you care about her wellbeing and that you just want to see her healthy and happy. \n\nAlso don't force her to stop or be a nazi patrolman about her puking. That will mean she'll become even more secretive and/or stop seeking you for help or disclosing it with you. You can be clear that you don't like seeing her suffer, but she needs to find another healthy coping skill before this one is stolen away.",
          "created_utc": 1563534766.0
        }
      ]
    }
  ]
}