{
  "id": "cg6m2r",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1563757424.0,
  "title": "Request: commenting on my food at a party",
  "selftext": "I'm a former anorexic who has also had issues with bulimia. Today I was feeling major swallowed up by my social anxiety...but I had to go to a friend's party. It was packed. The food line was crazy long and I was so stressed out about having to get in line and have everyone see me. I didn't know many people, so I felt especially nervous. In the past I would have just not ate.\n\n   I am trying to do opposite actions. So I got in line. I got salad with fatty regular Italian dressing and a piece of lasagna. Was still afraid to eat in front of everyone...I ended up eating back in the kitchen by myself. A couple friends ended up joining me and it eased my anxiety some- had some laughs etc, etc.\n\n   A couple minutes later I went back and got dessert. A small brownie and tiny piece of cake. Was feeling really proud of myself...and as I'm headed back to the kitchen a man stops me and says, \"you know that all turns to fat,  right?\" I said nothing and just looked at him...THEN a woman stops me and says, \"Hey, I saw those up there...I wonder if they're worth the calories\" I said, \"I don't know....I don't count calories\". Regardless, I ate the food. And I can't get their comments out of my head hours later. \n\n   I feel like I've been punched in the stomach and I don't know why. I find this kind of stuff especially detrimental to me and it makes me honestly hate people. I came home and ate too much food and I hate myself more. I just want to isolate and not go to parties ever. I literally forced myself to go to this one. How do you deal with this stuff? Am I overreacting?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/cg6m2r/request_commenting_on_my_food_at_a_party/",
  "score": 166,
  "num_comments": 20,
  "comments": [
    {
      "id": "eueza8b",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1563758119.0,
      "score": 60,
      "context": []
    },
    {
      "id": "euf3jv2",
      "author": "lilchunk_",
      "body": "I've been in recovery for a very long time and these kind of comments still get to me. My first reaction to them is always anger. I want to scream that how many calories I eat is no one's business. Why is it at all socially acceptable to openly comment on the healthiness of food that *people around them are eating and enjoying?*  \n\nWhen people make these kinds of comments, I have to remind myself that they don't understand what some people go through to be able to eat at all. They think they're doing what's best for their bodies, and that what's best for them must be best for everyone.  \n\nI try to get away for a moment when people say things like this. I spend a few minutes in the bathroom to take deep breaths and think about how far I've come. Remind myself that other people's issues with food do not have to be my issues with food. Remind myself that the people who make these comments may be struggling with their image, and may be looking for a way to show people that they're \"healthy\".   \n\nIt is **hard**, and a lot of the bounceback from these comments come with time. \n\nKeep reminding yourself that you are doing what you need to do to keep **YOU** healthy - and that negative influences don't deserve to take up space in your life.",
      "created_utc": 1563761545.0,
      "score": 16,
      "context": []
    },
    {
      "id": "euf9nzi",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1563766714.0,
      "score": 10,
      "context": []
    },
    {
      "id": "eufnpvd",
      "author": "kiselozele",
      "body": "No, you're not. \n  As someone with and ED I'm sitting here and wondering: Why the hell would you complain about calories and fat at a party. What the hell. Just let people have fun. To be honest, that's irritating EVEN for people without ED behaviours... Just have fun and eat/drink whatever you want and don't make people feel shitty about their choices.",
      "created_utc": 1563782486.0,
      "score": 6,
      "context": []
    },
    {
      "id": "eufztmc",
      "author": "ResponsibleTea",
      "body": "I expected that story to end differently, so well done for eating the food despite their comments!! Your progress isn't about how those comments made you feel, it's about what you were able to achieve despite what was said! I don't have disordered eating and that would still bother the fuck out of me. They have no right to make those comments so it's a huge win for you that you were able to be confronted with a trigger and power on despite it, even if you may not feel like you did. Keep going to parties! It will only get easier as you get stronger every day :)",
      "created_utc": 1563796274.0,
      "score": 5,
      "context": []
    },
    {
      "id": "euial3m",
      "author": "None",
      "body": "Maybe it's not helpful, but I think the only appropriate response to those comments is righteous anger. Especially the first man's comment. You don't have to say anything out loud to him, but if you have a confidant, or a therapist, giving voice to your rage at being ... lied to, bullied, manipulated ... that's what I would do, in your shoes.",
      "created_utc": 1563843768.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eug68wu",
      "author": "houston_veronica",
      "body": "Well, 1: you are incredibly awesome for doing opposite actions. That is so smart, and so important for putting Ed in his snake pit where he belongs.\n\n&#x200B;\n\n2: The comments that people make are always ignorant, unless they too have had an ED. Think about how long and challenging an ED is, and how we all have had to bang up against the hardships that have illustrated just how difficult it is to recover. Those are experiences that make us painfully aware of what it REALLY means to have an ED.  What that guy or woman said is absent of all these experiences. It's like commenting on trig or Physics when you've never even learned algebra or grade 5 science. If you can think -- in your mind -- \"This person has the ED knowledge of a newborn\" -- then you can properly contextualize this sort of ridiculous comment. (Example 2: a friend of mine shared that her child said \" Mom, you've got a big butt!\" -- this friend has a TINY butt! But to children, ALL butts are \"big\" -- that is their little perspective from a tiny person's view.  While those words are hurtful, they really are not meaningful because they aren't based in reality!)\n\n&#x200B;\n\n3. I know this is herculean-level hard, but what if you used those opps as a teaching moment?  When that woman said what she did, you could have said \"you know, it's really important that we see food for what it really is: valuable energy AND a mechanism through which we socialize. The brownies are worthwhile so  long as we value life and the ability to enjoy it with others. If that's not valuable, then I am not sure calories are the biggest problem...\"\n\n&#x200B;\n\nOR you could say \"what is worthwhile to you?\" -- if she says \"oh, if it's beyond delicious!!\" -- then say \"yup, it's worth it.\"  (Whatever she says...\"yup, it's worth it.\" -- because that is the answer every time!)\n\nThis might all sound super ridic, but it really needs to be how we change this world. \n\nWhat we've all had to endure (Ed sufferers) is so much pain and difficulty that would be almost in vain if we don't use it wisely. We need to make the most of our experience by sharing our lessons with others. Also, we may be the defense or ally for another silent person who is watching and listening to see what we say; people suffer with EDs all the time, \\*including\\* those two that you ran into, so you may actually be helping them! That's the ultimate payback to putting ED in his (gross) place.",
      "created_utc": 1563801068.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eug77b8",
      "author": "Martyfisch",
      "body": "You aren't over reacting. I get that same punched in the stomach feeling when I'm having a bulimic episode. It's almost like I'm holding the food, ready to get rid.\n\nYou ate the food, you did well, you nourished yourself. The man who told you it turns into fat is a creeper, and the woman who asked about the calories is asking for herself, not you. People, especially people who are drinking, stop seeing beyond their own narrative. The comments will go from your mind soon enough.",
      "created_utc": 1563801727.0,
      "score": 2,
      "context": []
    },
    {
      "id": "euuyi0h",
      "author": "None",
      "body": "Ah, it’s crazy people don’t understand how those comments can affect people, but I think the best point to get at is a point of understanding. I remember before my eating disorder, I thought dieting was good. Hell, I thought it was virtuous or one of those ultimate life goals to pursue weight loss. And many, many people do. Even now after my eating disorder, despite some relapses, I still find is disorienting to think of who I was at that time because it was like I was another person. So I think the best thing for me is realizing that not everyone is going to understand and understandably so. Our culture praises dieting and being thin. \n\nKeep your support close and try to use instances like those to remind yourself exactly why you recovered. I’m rooting for you💕",
      "created_utc": 1564052729.0,
      "score": 1,
      "context": []
    },
    {
      "id": "evdnl7s",
      "author": "rileyyj001",
      "body": "All I can say is how sorry I am that you had this encounter, but it was so incredibly brave of you to not only use your voice in rebuttal to their comments, but also push forward and eat the damn dessert! That is a serious win you should be proud of!!! \n\nKeep going and don’t let ignorant comments completely derail your recovery. <3",
      "created_utc": 1564442687.0,
      "score": 1,
      "context": []
    },
    {
      "id": "euf0na1",
      "author": "iwasntlucid",
      "body": "Thank you so much for the thoughtful words. It's true that their reactions are projections of their own situation. It still just takes me by surprise. I just don't get it...",
      "created_utc": 1563759208.0,
      "score": 14,
      "context": [
        {
          "id": "eueza8b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1563758119.0
        }
      ]
    },
    {
      "id": "eufx3ab",
      "author": "VegetarianCurry",
      "body": "Some people just won't shut up (and it is often people who project their own insecurities a la \"crabs in the bucket\"). I have friends who tease me for panicking at all you can eat restaurants, talk about their diets not working and I see them shoving tons of food down their throat...\n\nBut I must be reprimanded for eating veggies D:",
      "created_utc": 1563793785.0,
      "score": 3,
      "context": [
        {
          "id": "eueza8b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1563758119.0
        }
      ]
    },
    {
      "id": "exg3cfp",
      "author": "rileylophy",
      "body": "I agree. That was such an insightful description of our culture and the cycle of dieting industry. It’s such a major part of ED’s. Thanks for your thoughts ❤️",
      "created_utc": 1566254537.0,
      "score": 1,
      "context": [
        {
          "id": "eueza8b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1563758119.0
        }
      ]
    },
    {
      "id": "eufa2ws",
      "author": "iwasntlucid",
      "body": "I'm glad I'm not the only one who gets ragey about comments like that. I spent the rest of the evening thinking about how everyone else who wasn't me would have reacted. Just laughed and shrugged it off. I feel like the eating disordered wound never really heals..it gets easier to deal with, but sometimes it's raw. I've had 3 relapses, but I try my best to fight. I've been in the game for 17 years or so.",
      "created_utc": 1563767090.0,
      "score": 5,
      "context": [
        {
          "id": "euf3jv2",
          "author": "lilchunk_",
          "body": "I've been in recovery for a very long time and these kind of comments still get to me. My first reaction to them is always anger. I want to scream that how many calories I eat is no one's business. Why is it at all socially acceptable to openly comment on the healthiness of food that *people around them are eating and enjoying?*  \n\nWhen people make these kinds of comments, I have to remind myself that they don't understand what some people go through to be able to eat at all. They think they're doing what's best for their bodies, and that what's best for them must be best for everyone.  \n\nI try to get away for a moment when people say things like this. I spend a few minutes in the bathroom to take deep breaths and think about how far I've come. Remind myself that other people's issues with food do not have to be my issues with food. Remind myself that the people who make these comments may be struggling with their image, and may be looking for a way to show people that they're \"healthy\".   \n\nIt is **hard**, and a lot of the bounceback from these comments come with time. \n\nKeep reminding yourself that you are doing what you need to do to keep **YOU** healthy - and that negative influences don't deserve to take up space in your life.",
          "created_utc": 1563761545.0
        }
      ]
    },
    {
      "id": "eui9m8y",
      "author": "catastrophichysteria",
      "body": "\"People's issues with food do not have to be my issues with food\" \n\nI love that, I'm gonna write that down as a reminder. I'm 2 years into my recovery and still struggle so much with diet culture and how to combat it, but you're totally right. I don't have to have issues with certain foods just because someone I'm with does.",
      "created_utc": 1563843208.0,
      "score": 2,
      "context": [
        {
          "id": "euf3jv2",
          "author": "lilchunk_",
          "body": "I've been in recovery for a very long time and these kind of comments still get to me. My first reaction to them is always anger. I want to scream that how many calories I eat is no one's business. Why is it at all socially acceptable to openly comment on the healthiness of food that *people around them are eating and enjoying?*  \n\nWhen people make these kinds of comments, I have to remind myself that they don't understand what some people go through to be able to eat at all. They think they're doing what's best for their bodies, and that what's best for them must be best for everyone.  \n\nI try to get away for a moment when people say things like this. I spend a few minutes in the bathroom to take deep breaths and think about how far I've come. Remind myself that other people's issues with food do not have to be my issues with food. Remind myself that the people who make these comments may be struggling with their image, and may be looking for a way to show people that they're \"healthy\".   \n\nIt is **hard**, and a lot of the bounceback from these comments come with time. \n\nKeep reminding yourself that you are doing what you need to do to keep **YOU** healthy - and that negative influences don't deserve to take up space in your life.",
          "created_utc": 1563761545.0
        }
      ]
    },
    {
      "id": "eug6gce",
      "author": "houston_veronica",
      "body": "Great words here.",
      "created_utc": 1563801212.0,
      "score": 1,
      "context": [
        {
          "id": "euf3jv2",
          "author": "lilchunk_",
          "body": "I've been in recovery for a very long time and these kind of comments still get to me. My first reaction to them is always anger. I want to scream that how many calories I eat is no one's business. Why is it at all socially acceptable to openly comment on the healthiness of food that *people around them are eating and enjoying?*  \n\nWhen people make these kinds of comments, I have to remind myself that they don't understand what some people go through to be able to eat at all. They think they're doing what's best for their bodies, and that what's best for them must be best for everyone.  \n\nI try to get away for a moment when people say things like this. I spend a few minutes in the bathroom to take deep breaths and think about how far I've come. Remind myself that other people's issues with food do not have to be my issues with food. Remind myself that the people who make these comments may be struggling with their image, and may be looking for a way to show people that they're \"healthy\".   \n\nIt is **hard**, and a lot of the bounceback from these comments come with time. \n\nKeep reminding yourself that you are doing what you need to do to keep **YOU** healthy - and that negative influences don't deserve to take up space in your life.",
          "created_utc": 1563761545.0
        }
      ]
    },
    {
      "id": "eufa4a3",
      "author": "iwasntlucid",
      "body": "Thank you, that's helpful.",
      "created_utc": 1563767124.0,
      "score": 3,
      "context": [
        {
          "id": "euf9nzi",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1563766714.0
        }
      ]
    },
    {
      "id": "eug6lt0",
      "author": "houston_veronica",
      "body": "So true - I cannot say how many people find it grating and boring to talk about diets, and in fact it was listed as one of the top 7 things to not discuss -- by people who actually understand etiquette and social graces!! Why? because NO ONE CARE. See this link for fun:  [https://www.thisamericanlife.org/511/the-seven-things-youre-not-supposed-to-talk-about](https://www.thisamericanlife.org/511/the-seven-things-youre-not-supposed-to-talk-about)",
      "created_utc": 1563801319.0,
      "score": 3,
      "context": [
        {
          "id": "eufnpvd",
          "author": "kiselozele",
          "body": "No, you're not. \n  As someone with and ED I'm sitting here and wondering: Why the hell would you complain about calories and fat at a party. What the hell. Just let people have fun. To be honest, that's irritating EVEN for people without ED behaviours... Just have fun and eat/drink whatever you want and don't make people feel shitty about their choices.",
          "created_utc": 1563782486.0
        }
      ]
    },
    {
      "id": "eugp6yy",
      "author": "iwasntlucid",
      "body": "Really good rationalization here. I could have said something but I just shut down. It felt like it wasn't worth my time...but those are good points for the next time something like that happens.",
      "created_utc": 1563812280.0,
      "score": 1,
      "context": [
        {
          "id": "eug68wu",
          "author": "houston_veronica",
          "body": "Well, 1: you are incredibly awesome for doing opposite actions. That is so smart, and so important for putting Ed in his snake pit where he belongs.\n\n&#x200B;\n\n2: The comments that people make are always ignorant, unless they too have had an ED. Think about how long and challenging an ED is, and how we all have had to bang up against the hardships that have illustrated just how difficult it is to recover. Those are experiences that make us painfully aware of what it REALLY means to have an ED.  What that guy or woman said is absent of all these experiences. It's like commenting on trig or Physics when you've never even learned algebra or grade 5 science. If you can think -- in your mind -- \"This person has the ED knowledge of a newborn\" -- then you can properly contextualize this sort of ridiculous comment. (Example 2: a friend of mine shared that her child said \" Mom, you've got a big butt!\" -- this friend has a TINY butt! But to children, ALL butts are \"big\" -- that is their little perspective from a tiny person's view.  While those words are hurtful, they really are not meaningful because they aren't based in reality!)\n\n&#x200B;\n\n3. I know this is herculean-level hard, but what if you used those opps as a teaching moment?  When that woman said what she did, you could have said \"you know, it's really important that we see food for what it really is: valuable energy AND a mechanism through which we socialize. The brownies are worthwhile so  long as we value life and the ability to enjoy it with others. If that's not valuable, then I am not sure calories are the biggest problem...\"\n\n&#x200B;\n\nOR you could say \"what is worthwhile to you?\" -- if she says \"oh, if it's beyond delicious!!\" -- then say \"yup, it's worth it.\"  (Whatever she says...\"yup, it's worth it.\" -- because that is the answer every time!)\n\nThis might all sound super ridic, but it really needs to be how we change this world. \n\nWhat we've all had to endure (Ed sufferers) is so much pain and difficulty that would be almost in vain if we don't use it wisely. We need to make the most of our experience by sharing our lessons with others. Also, we may be the defense or ally for another silent person who is watching and listening to see what we say; people suffer with EDs all the time, \\*including\\* those two that you ran into, so you may actually be helping them! That's the ultimate payback to putting ED in his (gross) place.",
          "created_utc": 1563801068.0
        }
      ]
    },
    {
      "id": "euf16ux",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1563759644.0,
      "score": 9,
      "context": [
        {
          "id": "eueza8b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1563758119.0
        },
        {
          "id": "euf0na1",
          "author": "iwasntlucid",
          "body": "Thank you so much for the thoughtful words. It's true that their reactions are projections of their own situation. It still just takes me by surprise. I just don't get it...",
          "created_utc": 1563759208.0
        }
      ]
    },
    {
      "id": "eug7mzv",
      "author": "kiselozele",
      "body": "Yeah, I personally HATE it and always imagine it like a conversation between girls in a 2000's movie lol. Just checked the list... never even thought of a period talk hahah",
      "created_utc": 1563802022.0,
      "score": 3,
      "context": [
        {
          "id": "eufnpvd",
          "author": "kiselozele",
          "body": "No, you're not. \n  As someone with and ED I'm sitting here and wondering: Why the hell would you complain about calories and fat at a party. What the hell. Just let people have fun. To be honest, that's irritating EVEN for people without ED behaviours... Just have fun and eat/drink whatever you want and don't make people feel shitty about their choices.",
          "created_utc": 1563782486.0
        },
        {
          "id": "eug6lt0",
          "author": "houston_veronica",
          "body": "So true - I cannot say how many people find it grating and boring to talk about diets, and in fact it was listed as one of the top 7 things to not discuss -- by people who actually understand etiquette and social graces!! Why? because NO ONE CARE. See this link for fun:  [https://www.thisamericanlife.org/511/the-seven-things-youre-not-supposed-to-talk-about](https://www.thisamericanlife.org/511/the-seven-things-youre-not-supposed-to-talk-about)",
          "created_utc": 1563801319.0
        }
      ]
    },
    {
      "id": "euf4jzj",
      "author": "iwasntlucid",
      "body": "That's true...thank you so much for that. Hadn't thought of it that way. I had to unfortunately leave therapy after 2 yrs when my insurance changed and I could no longer afford it. I just switched jobs and I'm so excited to start again soon. That might sound weird, but I hold my therapist in very high regard...got me through the worst times in my life.",
      "created_utc": 1563762366.0,
      "score": 3,
      "context": [
        {
          "id": "eueza8b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1563758119.0
        },
        {
          "id": "euf0na1",
          "author": "iwasntlucid",
          "body": "Thank you so much for the thoughtful words. It's true that their reactions are projections of their own situation. It still just takes me by surprise. I just don't get it...",
          "created_utc": 1563759208.0
        },
        {
          "id": "euf16ux",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1563759644.0
        }
      ]
    },
    {
      "id": "exg5r77",
      "author": "rileylophy",
      "body": "\n     Thank you for pointing that out, gnosiscna. I feel that’s something perhaps overlooked. Our relationship to BAD foods, that we may only eat in private. I’m not comfortable myself yet to even do what she did, it’s so inspiring. What do you think about secret eating of foods; any more thoughts you have on it? \n\n     I’m struggling with eating during the day, and I make my boyfriend do takeout so we don’t eat in public, I feel picky and listen to Ana during the day, yet change into a sloppy, gross person (in my own head, still feels real but is not) that eats more until I’m full. Then I feel that the weight is put on me, I’m completely a different sort of person, I feel disgusting in my own body when I eat around others, yet disgust myself on my own, just fighting and wounding myself. \n\n     I’m vegan as well, so I already feel isolated in my eating. I am vegan for moral reasons, but it is making me sick and less sociable. \n     \n     I recently dropped a lot of weight, not meaning to or doing anything differently. Now I feel more obsessed about body dysmorphia. The more I think about the scale, the more it triggers phobic, debilitating thoughts of binging that I don’t and haven’t done in so long. My image of what my body’s appearance is and how body dysmorphia plays a huge part of what I eat.\n\n      Do you think any of all my ranting(haha) can come from Depersonalization Disorder or at least plays a role in my ED?",
      "created_utc": 1566256099.0,
      "score": 1,
      "context": [
        {
          "id": "eueza8b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1563758119.0
        },
        {
          "id": "euf0na1",
          "author": "iwasntlucid",
          "body": "Thank you so much for the thoughtful words. It's true that their reactions are projections of their own situation. It still just takes me by surprise. I just don't get it...",
          "created_utc": 1563759208.0
        },
        {
          "id": "euf16ux",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1563759644.0
        }
      ]
    }
  ]
}