{
  "id": "ci6ipm",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1564165527.0,
  "title": "Request: Need advice, how to deal with other people’s commentary on your appearance?",
  "selftext": "Several years back I gained a lot of weight.  Through extreme calorie restriction, I lost the extra weight, and I got into lifting weights, but the restricted calorie diet gave me some pretty disordered eating habits. My relationship with food is very touchy and I still struggle every day to find the balance between binge eating and/or not eating at all. THEN, I went through a divorce within the past year, and got “too skinny” according to family and coworkers (which is so inappropriate for anyone to comment on). I have been struggling lately as my appetite has picked up (I work out a lot) so my muscle mass has increased which has led to some weight gain. I am at a healthy weight currently, and I know they mean well, but when people just take it upon themselves to point out that I look “healthier” and that I “was too skinny”, it is SUCH A TRIGGER.  It makes me feel like I have to restrict myself again since other people are noticing... how do you deal with that??",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ci6ipm/request_need_advice_how_to_deal_with_other/",
  "score": 41,
  "num_comments": 7,
  "comments": [
    {
      "id": "ev1wo1g",
      "author": "glokash",
      "body": "I'm not sure what the best method of dealing with this is but I know for me, I have said to those people that make comments that I'm dealing with some personal medical issues and that usually shuts them up. There's probably a better way about this, though...",
      "created_utc": 1564166433.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ev1x1h4",
      "author": "junebug-2019",
      "body": "I am struggling with the same thing about how i have lost weight and I am \"getting too skinny\" and they ask when i am going to stop. its none of their business and it makes me feel like a whale.",
      "created_utc": 1564166618.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ev5dbor",
      "author": "None",
      "body": "Frankly, it’s nobody’s business but yours, and when people ask me about my weight I remind them that’s a personal matter and politely tell them to mind their own. A forward “Thank you for your concern, but this is a private matter of mine” has always ended those conversations swiftly.",
      "created_utc": 1564231890.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ev6et7a",
      "author": "flyingsqueak",
      "body": "Depending on who the comments are coming from I might be super honest \"Comments about a person's body are not appropriate in general, and for me they are particularly problematic because I have a history of eating disorders.\" Or just, \"Please do not comment on my body,\" please is in there...but if I'm saying that I tend to say it rather harshly. \n\n I also use Facebook for this. A few times a year, or if I'm having a month with a lot of these comments, I'll make a big post about all the reasons why you shouldn't comment on people's weight or appearance in general. Sometimes I'll share the frequently shared post about talking with your daughters about eating habits and appearance [This one](https://m.facebook.com/lovewhatreallymatters/posts/1050392618316469). I seem to get fewer comments for a while after sharing something like that.",
      "created_utc": 1564245932.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ev5pnpz",
      "author": "nodaybuttoday__",
      "body": "So instead of validating that you \"look healthier,\" practice responding with what health-affirming behaviors you've engaged in that have nothing to do with your change in shape or size. You can respond with, \"I'm really happy, and I've been making sure to move more mindfully!\" or \"I really feel balanced and at peace in my life right now,\" and that invites them to discuss with you the ways you've been moving and eating more mindfully as a result.",
      "created_utc": 1564237168.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ev224x9",
      "author": "bukasha",
      "body": "That is an honest and efficient response. Even if it doesn't feel honest, it is. EDs are a medical issue. \n\nFor me, and it took years to wrap my head around my own mental health but I find describing things as medical symptoms makes it easier.\n\nFor example, especially recently, I've been putting it like this:\n\n\"My appetite is non existent because my mood is low.\"\n\nGranted, I've only been telling close friends, but it puts me at ease to put it in more, third party, medical terminology to sort of validate my experience. I find it to be empowering. \n\nIt may not be like that for you and OP so I'd suggest considering what I have to say and try to incorporate what works for you and leave out what doesn't. Everyone is different and my advise or commentary may not be applicable to you or OP. \n\nKeep on trucking, my loves. You're worth it all.",
      "created_utc": 1564169143.0,
      "score": 12,
      "context": [
        {
          "id": "ev1wo1g",
          "author": "glokash",
          "body": "I'm not sure what the best method of dealing with this is but I know for me, I have said to those people that make comments that I'm dealing with some personal medical issues and that usually shuts them up. There's probably a better way about this, though...",
          "created_utc": 1564166433.0
        }
      ]
    },
    {
      "id": "ev5p5if",
      "author": "nodaybuttoday__",
      "body": "Saying something that redirects or establishes a boundary is usually helpful, and sends them the signal that you're uncomfortable talking about it. Some helpful responses that don't make them feel like they need to be defensive (because you don't want to invalidate others in order to validate yourself), \"I appreciate that! I am focusing on (thing I like) about myself at this time, though.\" or even setting an example by shooting a non-body related compliment back at them, like \"your hair is really pretty!\" or \"I like the color of your dress/shirt!\" (because it focuses the attention on an inanimate object such as clothing rather than on the actual body itself).",
      "created_utc": 1564236979.0,
      "score": 1,
      "context": [
        {
          "id": "ev1x1h4",
          "author": "junebug-2019",
          "body": "I am struggling with the same thing about how i have lost weight and I am \"getting too skinny\" and they ask when i am going to stop. its none of their business and it makes me feel like a whale.",
          "created_utc": 1564166618.0
        }
      ]
    }
  ]
}