{
  "id": "ck64n2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1564565424.0,
  "title": "Request: Dealing with triggers in front of people???",
  "selftext": "Hi, this is my first post here so I'm kinda nervous.  I'm 19F.  Currently I am rehearsing a musical and one of the cast members makes comments about their body and weight that make me really uncomfortable.  Not only do I worry for this person, but it triggers me and makes it hard for me to continue eating my lunch (this often happens at lunch time).  I've tried leaving the room, but I don't want to isolate myself from the rest of the cast.  Our director also mentioned one eating disorder by name while we were dry running a scene and to distract myself/calm down I drank half my water bottle.  I'm feel like my weird reactions are gonna draw attention to me and I don't want that to happen.  I'm just confused and nervous and any ideas or comfort would be greatly appreciated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ck64n2/request_dealing_with_triggers_in_front_of_people/",
  "score": 49,
  "num_comments": 5,
  "comments": [
    {
      "id": "evk5bi0",
      "author": "drinksriracha",
      "body": "I'm so sorry you're dealing with this.\nI have known a lot of people like this. \nThese situations happen a lot:\n\nI go out to eat with a few friends, and they complain the whole time while eating how fat they are and how they are going to work off this food later that day and how they are so full and how effortlessly thin I must be since I'm eating the same food as them. But they eat this way all the time, and they always cry while they eat this way, all while continuing to eat.\n\nThey say stuff like \"im going on a diet tomorrow.\" Or \"I'm totally fasting tonight.\" \n\nSometimes, after going out to eat, some people I am with won't finish their food while I polish off my whole plate, and they all make comments like \"wow how did you eat that much? But you are so thin. I wish I was thin like you and could eat this much. \" like bitch, I still have room to eat your face off.\n\nOr like, Thanksgiving day when you are allowing yourself to eat and everyone is griping about how much weight they are gaining and how they can't stop. \n\nThey start a new diet (like paleo) and all they can talk about is how good they feel and all the weight they've lost. \n\nBasically, a lot of American women (and men) have very poor body image and an unhealthy relationship with food, which they voice and often can often gain sympathy from those around them. This is really triggering to those of us who are disordered, especially if we are working really hard to eat.\n\nGoing to therapy can help. Talking about the triggering things people say helps. Also, if you feel comfortable, you can ask these people not to talk about these things in front of you. They may or may not respect your request.\n\nEither way, I am sorry you are dealing with this. I know it's hard.",
      "created_utc": 1564575719.0,
      "score": 14,
      "context": []
    },
    {
      "id": "evkguwp",
      "author": "edie43",
      "body": "I know this situation so well... honestly, what I’ve started doing is just being vocal about how I don’t like us talking like that about ourselves. People usually shut up. If they get offended or brush it off or laugh about it, I just smile politely but stay persistent. Now, I’m 27 and I understand that this might not be easy for a 19yo, so in your case maybe you should try and talk to the director or something? Someone who people listen to who can talk to the group and maybe make a rule to lay off the diet talk and triggering behaviour? They don’t have to know it’s you. I’m sorry you’re going through this, people are often too self absorbed to realise they’re not just putting themselves down in these situations...",
      "created_utc": 1564581296.0,
      "score": 9,
      "context": []
    },
    {
      "id": "evlt0xg",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1564598840.0,
      "score": -10,
      "context": []
    },
    {
      "id": "evlk1st",
      "author": "glokash",
      "body": "I agree with this. Speaking up to fight against [\"fat talk\"](https://psychlopaedia.org/health/fat-talk-can-lead-poor-body-image/) is how we stop this kind of negative behavior from continuing.",
      "created_utc": 1564595631.0,
      "score": 3,
      "context": [
        {
          "id": "evkguwp",
          "author": "edie43",
          "body": "I know this situation so well... honestly, what I’ve started doing is just being vocal about how I don’t like us talking like that about ourselves. People usually shut up. If they get offended or brush it off or laugh about it, I just smile politely but stay persistent. Now, I’m 27 and I understand that this might not be easy for a 19yo, so in your case maybe you should try and talk to the director or something? Someone who people listen to who can talk to the group and maybe make a rule to lay off the diet talk and triggering behaviour? They don’t have to know it’s you. I’m sorry you’re going through this, people are often too self absorbed to realise they’re not just putting themselves down in these situations...",
          "created_utc": 1564581296.0
        }
      ]
    },
    {
      "id": "evlzwmw",
      "author": "SmirnOffTheSauce",
      "body": "Do you think you’re being helpful right now?",
      "created_utc": 1564601399.0,
      "score": 6,
      "context": [
        {
          "id": "evlt0xg",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1564598840.0
        }
      ]
    }
  ]
}