{
  "id": "cmebxb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1565027519.0,
  "title": "Request: I finally told",
  "selftext": "While running today (one of my terribly forced habits) I thought about the fact that I feel awful and I am clearly not eating enough. I know I have a problem. I finally decided I had to do something. I called my mother, and absolutely balled my eyes out while trying to explain that I need help. She was reluctant to believe me at first but in the end decided to arrange a doctors appointment. \n\nI regret it so much. I feel worse and can’t stop crying. I feel like I’ve ruined everything I’ve done for so long. I’m just going to get fat again. I’m going to hate myself. I already do.\n\nIs it entirely normal to regret telling and regret trying to recover? I really wish I hadn’t said anything and my head keeps telling me I’m fine. I don’t know what to do now",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/cmebxb/request_i_finally_told/",
  "score": 50,
  "num_comments": 10,
  "comments": [
    {
      "id": "ew1o77b",
      "author": "balloongirl0622",
      "body": "I promise you, you don’t regret it. Your eating disorder regrets it. I know it’s cliche, but it will get better and easier.",
      "created_utc": 1565027708.0,
      "score": 43,
      "context": []
    },
    {
      "id": "ew1pmjq",
      "author": "ElfjeTinkerBell",
      "body": "It's entirely normal and will come back during recovery. You made the right call. You're awesome!",
      "created_utc": 1565028616.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ew1s75g",
      "author": "buttsniffer666",
      "body": "It goes up and down!! The part of you that reached out for help will get louder (and softer) as your journey continues. Remember to listen for it. The wolf you feed, amirite???",
      "created_utc": 1565030265.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ew1x17u",
      "author": "spacelincoln",
      "body": "This is a huge step- good job!\n\nPlease keep in mind that unless they specialize in eating disorders, most doctors get something like 4 hours on eating disorders  during their entire education. If at all possible talk to a specialist.",
      "created_utc": 1565033347.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ew2sxa5",
      "author": "Docwifearchivistlife",
      "body": "I felt the same way, telling my parents and my husband. Now I feel like every time I mention anything food-related or exercise-related, they're judging me, but I know they're just worried about me. Admitting you have a problem is a huge first step that takes courage, especially when admitting it to someone else, and I'm proud of you!! Like another poster said though, tried to find someone who specializes in eating disorders. My husband is a general medicine doctor and he barely knows anything about eating disorders. Stay strong!!❤️",
      "created_utc": 1565055051.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ew35yqx",
      "author": "None",
      "body": "You can do this! It's hard, but recovery is possible and you've made it this far. We believe in you!!!",
      "created_utc": 1565065289.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ew4xoqg",
      "author": "teriyakigirl",
      "body": "You regret it at first, but getting better is THE best thing that will ever happen to you. You'll have a taste for life again once you start recovering, I promise you.",
      "created_utc": 1565120894.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewyjr5g",
      "author": "fuzzgrub1",
      "body": "I’m so proud of you",
      "created_utc": 1565882258.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ey9uflm",
      "author": "faIIawake",
      "body": "You should be incredibly proud of yourself. Your eating disorder lies to you. It’s a fight, and it’s hard when you first step out to take control over the thing that’s been controlling you. I know- I had an ED for 6 years.. I went to a programme that helped me understand the roots of my behaviours, my thoughts and feelings.  But what helped the most was learning that there are people out there who do understand and I didn’t have be alone. The same is for you too. You don’t have to be alone. And you can and you will beat this! I’m 2 years recovered now- you will get there! Find good counsel and get people behind you that believe in you! Also, you are stronger than you think!!",
      "created_utc": 1566952788.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ew2zkpa",
      "author": "None",
      "body": "That’s so important to hear right now. I recently been relapsing and it’s been very hard deciding if I am going to continue down this rabbit hole or if I will slap my ED in the face. It’s been telling me how prettier and happier and better my life was when I was skinny but i know it’s lying. My life had no purpose other than being thin and controlling food. Easier said than done of course as I can easily ignore my rational brain but I’m trying my best.",
      "created_utc": 1565059900.0,
      "score": 4,
      "context": [
        {
          "id": "ew1o77b",
          "author": "balloongirl0622",
          "body": "I promise you, you don’t regret it. Your eating disorder regrets it. I know it’s cliche, but it will get better and easier.",
          "created_utc": 1565027708.0
        }
      ]
    }
  ]
}