{
  "id": "cogc2f",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1565432153.0,
  "title": "Request: Post Request: Are other people's perception of \"healthy\" distorted?",
  "selftext": "Hey. So I've struggled with Anorexia Nervosa B/P Subtype for many years. I'm 20 years old and had hit my lowest weight this year. I have recently gained a small amount of weight, like single digits. But I've been eating consistently for about a month straight and having a lot of energy. I have stopped using diuretics but still taking a lot of stimulant laxatives. Anyways, my BMI is severely low (I have been hospitalized and had heart attacks at a higher weight than my current) yet people are telling me I look \"glowing\" \"so great\" \"way healthier.\" Someone even commented on my full face when in reality my face is so swollen from purging so much. I'm trying so hard and eating a lot everyday but these comments are so discouraging. Like, if I look so healthy at this severe of a low weight (literally, I've had an ng tube at a higher weight and everyone said I looked so ill), than what am I gonna look like if I ever reach a normal weight? This is making it so much harder for me to stop taking laxatives. I'm so frustrated and my therapist is the only one who sees that I'm struggling. It's like since I'm able to drive again and not slitting my wrists everyday and been showering and putting on makeup, everyone thinks I'm healthy now. Even my guy friend said I look \"so hot with the weight on\" and I literally began bawling and told him to never comment on my weight again because it makes me uncomfortable. Is my therapist wrong about me needing to keep eating? How can people think I'm healthy in five weeks when it took me 7 years to get this sick?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/cogc2f/request_post_request_are_other_peoples_perception/",
  "score": 41,
  "num_comments": 12,
  "comments": [
    {
      "id": "ewi2xd7",
      "author": "rachelberleigh",
      "body": "Your friends want to be supportive of you recovering, so a way they know how to do that is say positive things about your appearance. So they say things like “wow you look great” etc even though you know you just purged. I am 100% sure if you asked any of them, their intention is to support you, not that they prefer you at your current weight. However much weight you gain, whatever recovery will look like for you, I guarantee they will still always stick by your side because they’re your friends and they love you. Because it isn’t about the weight. It’s about your health, happiness and wellbeing that they care about. And if they betray you, fuck em.",
      "created_utc": 1565436003.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ewiddrh",
      "author": "lalaloosh",
      "body": "I got tons of positive feedback after immediately losing my pregnancy weight, but it was due to the fact that I had relapsed into my eating disorder. I finally just came out to everyone with the truth of my disease over fb, and I can’t tell you how much it has helped me. I now have 2 weeks purge free. People were just trying to be supportive and kind until they realized I was sick. Eating disorders come in all shapes and sizes, and it can be impossible to detect if you haven’t been around one. I realized most people will not understand our messed up way of interpreting their compliments, and that’s ok. I just had to change my reaction to people and be honest. When someone would tell me how good I looked, I told them the truth, that it wasn’t healthy. Honesty has been my ‘get out of jail free’ card. \nSending you love and support. You can do this!!",
      "created_utc": 1565446460.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ewjgkaf",
      "author": "None",
      "body": "Had a few family therapy sessions with my dad. The therapist was explaining how sensitive and irrational people with eating disorders can be and how we have very intense reactions to innocuous comments. He said understanding eating disorders is like learning another language. \n\nIf you try to see it as your family and friends not understanding the language you speak, it could help with frustrations around feeling misunderstood.",
      "created_utc": 1565466337.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ewk4n7w",
      "author": "makeupyourworld",
      "body": "OP Here. \n\nAny more advice is really welcomed. I could use it so much. My family seems to be okay with not commenting, but my friends are terrible. Or, if I simply post a photo on my Snapchat of myself smiling or grabbing coffee/a muffin with a friend I'll get so many people commenting on my \"glow.\"\n\nThis morning my mother put some things in to perspective. She said, \"You look so pretty today!\" I said, \"pretty? Like healthy? Or fat? Do I look fatter today and that's why you think I look pretty?\" I got so defensive. She put it in to perspective and said, \"No, you do not look fat. You look pretty. You look extremely underweight and I am very concerned about how much you're eating and your health, nonetheless, you can be underweight and still look very pretty today. Do not tie all compliments to your weight. There are other positive qualities about your appearance that have nothing to do with your weight.\"",
      "created_utc": 1565476455.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ewirlq3",
      "author": "None",
      "body": "I'm so sorry you've had such a terrible time! Agreed with the other posters that these people are just trying to be supportive or encouraging about your progress, but they don't understand the negative impact it has on you. People don't know what to say, and will say things that they think are helpful but come off as insensitive or hurtful (like telling a person who just lost a pregnancy \"It's ok, just try again!\"). This year a friend's MIL who I only see maybe once a year at Thanksgiving told me that I looked \"so much better\" than the year before because before I was \"just too skinny and - ugh - \\*grossly\\* thin last year!\" (and in reality, I weighed less than I did the year before  I want to punch her freaking teeth in). I was furious about her comments about my body. I didn't know what to say to her (that I wouldn't regret...especially at a big Thanksgiving family dinner) so I just kept drinking as she continued to blather and I think all I could manage was an \"mmmhm\" and terse smile. I think my friend or her husband had mentioned to her about my ED and she went about it the wrong way. Even my friend and her husband would say \"You look great, you don't look too skinny! Really, you look healthy!\" and I'd say \"Dude, I weigh less than I did last time you saw me and I'm not healthy!\". It's really hard. \n\nYou \\*do\\* need to keep eating. I think a better response from people (please by all means tell me if this is \\*not\\* helpful!) would be \"Yes! Keep going! You're getting a little \\*healthier\\* day by day!\" and not comment about your \\*body\\*, hotness, etc. It's small steps to get to your goal and can take a long time. You have to physically AND mentally heal, and before you can be completely physically recovered you have to get get dat \\*mental fitnessss\\*, gurl. And people telling someone with an ED at a low weight that their physical appearance \\*looks hot\\* is obviously detrimental. I don't blame you for crying, and it's commendable that you said \"Please don't comment on my weight it makes me uncomfortable\". I don't think I could've responded without cursing. With someone who \"doesn't get it\", I think saying \"I'd rather not talk about it\" to change the subject, or \"Thanks, but I'm trying to focus on my health and not my looks because of how this ED distorts my thinking about body image\". \n\nI don't know, I struggle with how to reply too. That's how I would \\*hope\\* to respond, but of course it's easier said than done (see Thanksgiving example, lol!). I hope what I said is helpful and not detrimental!",
      "created_utc": 1565455393.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ewjlef6",
      "author": "Sloppy0tter",
      "body": "All of this is both heart breaking and so relatable. Nothing hurts like people saying \n\n\"you look better\" or \"you look healthy\".\n\n Its impossible to tell people how offensive the term \"Healthy\" is.  During my sickness \"healthy\" has always meant \"fat\" to me. I know this is wrong but that is my interpretation as an E.D sufferer.\n\nYour perspective may be skewed as mine is but there is room for recovery, I promise we will one day learn to see the word \"healthy\" as it is truly meant. Not ill. Not fat, but normal.\n\nBest of luck on your journey and know you always have a friend here. It doesn't matter how lonely or dark it gets there are people who understand.  Message me if you ever need a friend. \n\nThe world isn't as cruel as it pretends to be.",
      "created_utc": 1565468388.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ewkx9ft",
      "author": "seatangle",
      "body": "Yes, in general, other peoples’ ideas of ‘healthy’ are distorted. But so is how we interpret what they say. They are saying things like that because they think it will be encouraging. You’d think people would be more aware of what these kinds of words do (that’s like EDs 101!) but not everyone has been absorbed in the world of EDs like we have.\n\nI was in a similar place to this once (also Anorexia, BP subtype for many years, now I’m at a healthy weight), so here is my take on things:\n\nWhen I think back to how severely underweight I was, and the comments I got then, as well as the lack of concern by some people in my life, it actually makes me angry. However, the way I see it now, is that these family members, friends, etc. had seen me so ill for so long that they sort of got used to it. And so when they saw me even slightly better, the contrast was probably a little surprising, in a good way, and they couldn’t help saying something. \n\nAnyway, hope that helps in some way. I’m more than happy to talk about stuff further. I know how hard it is!",
      "created_utc": 1565497530.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewljxvi",
      "author": "None",
      "body": "Honestly, I think that it is your friends trying to support you in your recovery. To echo what everyone else has said here, people confuse “gaining the weight back” with “woohoo they eat now, the worst part must be over!” Which obviously isn’t true. \n\nSomething that really helped me was I made a list of the reasons I was trying to recover. 1. So that I don’t have competing relationships between my ED and my boyfriend 2) so that I can finish my doctoral degree... I found that in the times where I really really don’t want to eat or really want to purge, having that list handy can make it easier to remember those reasons why I am fighting against my ED rather than engaging in my ED behaviors. \n\nBest of luck to you. Feel free to message if you want to talk.",
      "created_utc": 1565527256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ezydh56",
      "author": "madeleinetwocock",
      "body": "god im sorry, i feel this though. i also struggle with an-bp and have for years and whenever i go through a particularly rough/aggressive purging phase, i always get \"you look so good\" or \"youre looking healthier\" but its just the post-purge chipmunk cheeks, not any actual weight gain. idk man, i feel like unless the person youre with has(/had) and ed  then they wouldnt even know that facial swelling is a physical side effect of purging :( take care my dude x",
      "created_utc": 1568265931.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ewjheiy",
      "author": "None",
      "body": "Another thing is that \"normal\" people confuse weight restoration with being mentally in a better place. They think your gaining of 9lbs or so means your eating disorder is releasing it's grip on you. By telling you how good you look after gaining some weight, people are trying to motivate you to continue with your increased eating because they want to see you at a healthy weight. They mean well but they don't speak the ED language so they don't get how their comments confuse you.",
      "created_utc": 1565466694.0,
      "score": 8,
      "context": [
        {
          "id": "ewjgkaf",
          "author": "None",
          "body": "Had a few family therapy sessions with my dad. The therapist was explaining how sensitive and irrational people with eating disorders can be and how we have very intense reactions to innocuous comments. He said understanding eating disorders is like learning another language. \n\nIf you try to see it as your family and friends not understanding the language you speak, it could help with frustrations around feeling misunderstood.",
          "created_utc": 1565466337.0
        }
      ]
    },
    {
      "id": "ewxdaen",
      "author": "nosniborhael",
      "body": "Do you think this sensitivity and irrationality ties into other aspects of life, too? Wondering whether people with EDs also feel quick to intense reactions for things other than body image, weight, etc., but more generally as well, toward anything that feels like a slight against an imperfection.",
      "created_utc": 1565853206.0,
      "score": 1,
      "context": [
        {
          "id": "ewjgkaf",
          "author": "None",
          "body": "Had a few family therapy sessions with my dad. The therapist was explaining how sensitive and irrational people with eating disorders can be and how we have very intense reactions to innocuous comments. He said understanding eating disorders is like learning another language. \n\nIf you try to see it as your family and friends not understanding the language you speak, it could help with frustrations around feeling misunderstood.",
          "created_utc": 1565466337.0
        }
      ]
    },
    {
      "id": "ewxi5rt",
      "author": "None",
      "body": "From what I've heard in group therapy sessions, yes. And eating disorders are usually symptoms of high anxiety so it's not uncommon catastrophize. \n\nI'm personally quite assertive and not usually phased by constructive criticism, but when I'm in a situation that really riles me, or I feel intense emotions, my first and immediate thought is to stop eating. It's like starving myself is my go to method for solving my uncomfortable emotional state, regardless if the original trigger was related to my weight.",
      "created_utc": 1565858096.0,
      "score": 1,
      "context": [
        {
          "id": "ewjgkaf",
          "author": "None",
          "body": "Had a few family therapy sessions with my dad. The therapist was explaining how sensitive and irrational people with eating disorders can be and how we have very intense reactions to innocuous comments. He said understanding eating disorders is like learning another language. \n\nIf you try to see it as your family and friends not understanding the language you speak, it could help with frustrations around feeling misunderstood.",
          "created_utc": 1565466337.0
        },
        {
          "id": "ewxdaen",
          "author": "nosniborhael",
          "body": "Do you think this sensitivity and irrationality ties into other aspects of life, too? Wondering whether people with EDs also feel quick to intense reactions for things other than body image, weight, etc., but more generally as well, toward anything that feels like a slight against an imperfection.",
          "created_utc": 1565853206.0
        }
      ]
    }
  ]
}