{
  "id": "cp7bpr",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1565583438.0,
  "title": "Request: how do you deal with others' diets?",
  "selftext": "how do you cope with people around you being on a diet? i'm in college and home for the summer and my mom has severe GI issues and is on a super-strict no carb diet and barely eats throughout the day. definitely disordered eating but she just talks about how it's helping her lose weight and she needs to lose weight and the diet soooo much and then on top of that my dad will just casually mention not eating and my brothers make fat jokes. none of them know about my ED issues bc they started after i was an adult and so i can't fault them but how are you supposed to try and have healthy eating habits when everyone around you just doesn't?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/cp7bpr/request_how_do_you_deal_with_others_diets/",
  "score": 44,
  "num_comments": 5,
  "comments": [
    {
      "id": "ewnspbu",
      "author": "Fuckmenumb",
      "body": "I'm sorry you're going through this. Families can be the most triggering in my experience.\n\n I've learned that I need to separate myself from what I call \"eating disorder energy\". I can smell it a mile away on someone. Sometimes to protect yourself you have to limit time with people who are clearly suffering. This isn't to say I'm not there to help or listen if someone wants it! But EDs are tricky and you can't help someone who's not ready. Protect yourself as much as you can. Family can be hard though, esp if you live at home. \n\nI think your response will depend a lot on your relationship with your family, or individual members.\nI'm more comfortable being direct with my dad than my mom. So with my dad I asked him not to comment on my weight, even if it's weight loss. He had no idea he had been impacting me at all with comments for years. I didn't elaborate, I just said \"hey, I struggle with weight fluctuations. I appreciate compliments but it would be a lot easier on me if you just didn't mention my weight, positive or negative.\"\n\nMy mom is too deep in her own disordered eating and very passive so that wouldn't work. With her I just don't acknowledge comments about food, weight, or diet. Or I respond with \"huh\" and change the subject. I refuse to validate those comments. \n\nI might consider mentioning to your mom how all this focus on food and her diet kind of ends up making you feel bad about your body. Finding a way to share that her intense fixation affects other people. Sometimes people don't realize they are having an effect on others in that way. \n\nWhen I HAVE to hear triggering things I mentally review personal experiences that validate how unhelpful and draining that thinking is. I think about my list of positive experiences since recovery. \n\nSorry this is long. You'll find a way through this!",
      "created_utc": 1565589071.0,
      "score": 18,
      "context": []
    },
    {
      "id": "ewo7c0o",
      "author": "amandalucia009",
      "body": "is it possible your mom & your family environment actually helped to develop your disorder?\nif they don’t know, they can’t help you. but it may also be more painful for you for them to know and still talk that way around you\n\nsorry you have to deal with that...",
      "created_utc": 1565608943.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ewoglu2",
      "author": "sevenswns",
      "body": "my friends know about my ED because i'm very open about it, as being open helps me to receive support, so they don't speak about their diets with me or around me. online, i mute anyone that posts bad thoughts about their body or their bad relationship with food. i used to have a friend that would actually send me snaps about his ED and bad relationship with food, and when i politely asked him not to because it's triggering to me, he ended the friendship and completely ghosted me after 10 years of close friendship.",
      "created_utc": 1565617442.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ewogshs",
      "author": "sevenswns",
      "body": "i would just politely ask your mother to not talk about her diet around you because it makes you feel bad. it's going to be an uncomfortable conversation, but it really is the only way around it.",
      "created_utc": 1565617584.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ewp8oq9",
      "author": "rainsfriend",
      "body": "Make sure to do extra self care. Double up on all the positive coping mechanisms you have. If you can't ask them to stop, taking care of yourself after those sorts of conversations must become your priority. I would suggest finding someone to vent to and putting a safety plan in place. And remind yourself that different bodies need different nourishment, so what is right for your mom is not necessarily right for you. Good luck, and stay safe. <3",
      "created_utc": 1565635853.0,
      "score": 2,
      "context": []
    }
  ]
}