{
  "id": "ctgdzy",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1566391766.0,
  "title": "Request: How should I talk about my child's mom's eating disorder to him?",
  "selftext": " \n\nTo give some background, I am a single dad and am no longer with my son's mom. We were in a relationship for roughly 5 years. We had a child at the end of our relationship and are working to co-parent our child. She has recieved therapy, both inpatient and outpatient, for roughly 20 years including several dozen times of inpatient and basically constant outpatient over the years.\n\nI understand a lot about how to support recovery myself as I've gone through years of support groups, therapy sessions with her and on my own, yet I know that there is always more to learn.\n\nMy child's mom is currently in inpatient. It's not the first time since our child has been born. But our child is getting older and has some more questions (and fears) about it. The little one is roughly about school age.\n\nHow should I explain this to them? What should I tell them? How specific should I be? What should I avoid?\n\nOur child absolutely loves mom and rightfully is concerned about her. There are questions about what this place is that she is at and whether she is sick or is going to get better.\n\nI don't want to lie. I want to tell the truth in a way that is able to be understood. And I definitely don't want to scare.\n\nBut the truth is that this is going to be something that is lifelong. There will likely be inpatient treatment at least once a year. There will be mental health and emotional issues that will come up with her. And we will all have to deal with that together.\n\nHow do I explain this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ctgdzy/request_how_should_i_talk_about_my_childs_moms/",
  "score": 48,
  "num_comments": 7,
  "comments": [
    {
      "id": "exkpk0s",
      "author": "pasie24",
      "body": "i guess you could try to say something along the lines of “mommy is sick, but she’s at the doctor’s because they’re trying so make her better. Sometimes she will have to go back to the doctor’s, but she’ll be okay”. Try not to shoot out health risks, because that’s just gonna scare the kid",
      "created_utc": 1566395920.0,
      "score": 42,
      "context": []
    },
    {
      "id": "exkrpof",
      "author": "yellowposy2",
      "body": "I’d echo the other commenters in terms of saying “mommy’s sick, but the doctors are helping her get better.” Be there for him if he has questions. I’d recommend contacting any local ED support groups or therapists for a meeting to see if they can offer any advice. If your child is showing symptoms of severe stress related to his mom being in the hospital, child therapy or play therapy can be extremely beneficial. Sending you love and support, you sound like a really great parent ❤️",
      "created_utc": 1566397392.0,
      "score": 25,
      "context": []
    },
    {
      "id": "exl2wnu",
      "author": "TeatothewhY",
      "body": "I’m a mom of two young children. Kids definitely do understand more than we think, even at young ages. I would agree with those above suggesting to simplify what’s going on but also without shying away from the truth. I would tell my kids ‘mommy is sick, and she needs the doctors help to get better. She’ll be better soon and things will go back to normal and we can plan a nice day just you and mommy together when she’s better. Mommy gets sick sometimes just like how you get a tummy ache sometimes, she just has to go to the doctor for her tummy aches. ‘\nI would also give him a time to ask any questions at all. Answering them truthfully, but simplified. Ask him if it might help to make mommy some cards to send (if it’s allowed, I’m not sure but just an idea) to help mommy feel better. Something like that can be very therapeutic. Giving them a certain project or something hands on and tangible to work on can help them cope with things they can’t understand. Maybe even decorating mommy’s room for her to surprise her when she gets back. Or scrapbooking pictures and hand drawn cards for her. I hope this helps, I can’t imagine how hard that must be as a parent. You’re a good dad.",
      "created_utc": 1566404802.0,
      "score": 12,
      "context": []
    },
    {
      "id": "exng2ed",
      "author": "tymopa",
      "body": "I agree with most comments but based upon her history I would avoid saying she'll be better soon. Consulting with a professional about this is the best advice so far.",
      "created_utc": 1566455123.0,
      "score": 1,
      "context": []
    },
    {
      "id": "exkm47i",
      "author": "paaba",
      "body": "i mean eating disorders are mental illnesses among others so i guess you could say she is sick, because the truth is that she might die one day because of it and it’s kinda a gateway to the possible time she won’t be coming back...",
      "created_utc": 1566393488.0,
      "score": -5,
      "context": []
    },
    {
      "id": "exkpea9",
      "author": "None",
      "body": "dont mention anything that could upset or affect him. tell him something that easy for a kid to understand perhaps add some analogy about a cartoon character or something. make it serious so he understands but light-hearted so he doesn't stress as a young child.",
      "created_utc": 1566395812.0,
      "score": -6,
      "context": []
    },
    {
      "id": "exks14x",
      "author": "yellowposy2",
      "body": "While this is sweet advice, I think it may be misguided. Children are not stupid, and they notice a lot more than we think. It’s better to be honest with them (within reason- sparing details is important) because otherwise he might find out by overhearing information. The situation is already going to stress and upset the kid- his mom is not around right now. Being honest and open will help to strengthen the relationship between parent and son and allow him to explore his feelings in a healthy way.\n\n\nEdit: source: I’m a certified early childhood educator",
      "created_utc": 1566397607.0,
      "score": 15,
      "context": [
        {
          "id": "exkpea9",
          "author": "None",
          "body": "dont mention anything that could upset or affect him. tell him something that easy for a kid to understand perhaps add some analogy about a cartoon character or something. make it serious so he understands but light-hearted so he doesn't stress as a young child.",
          "created_utc": 1566395812.0
        }
      ]
    }
  ]
}