{
  "id": "cx9x3l",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1567127317.0,
  "title": "Request: My sister has an eating disorder and is mad that I told our parents.",
  "selftext": "I noticed over the summer that my sister's eating habits were getting strange. She'd skip breakfast and lunch, then tell our parents she ate a lot during the day to skip dinner. At first, I thought she was eating snacks when I wasn't looking, but it was getting pretty obvious that she just was not eating at all. I told my parents what I had noticed, and then they put her into therapy and pulled her out of her dance classes, which has been making her absolutely miserable. She knows that I'm the one who said something and is pissed about it. I feel awful that I caused her to get pulled out of dance, but I do want her to get the help she needs. But it's hard to deal with my sister hating me. I know, it's the eating disorder talking, not her, but a lot of it is still coming out of her mouth and I hate having to hear that from my sister. I feel like our relationship is ruined and I don't know what to do! How can I make it up to her?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/cx9x3l/request_my_sister_has_an_eating_disorder_and_is/",
  "score": 83,
  "num_comments": 11,
  "comments": [
    {
      "id": "eyjujjq",
      "author": "Kinsey_Millhone",
      "body": "Years ago my best friend told my parents about my eating disorder and self-harming. I was so hurt and angry and betrayed. He probably saved my life and is still my best friend to this day. I have sisters. I think you did the right thing but it probably sucks for everyone right now",
      "created_utc": 1567128625.0,
      "score": 55,
      "context": []
    },
    {
      "id": "eyk0lyn",
      "author": "None",
      "body": "First of all, you didn’t cause her to get pulled out of dance. Her eating disorder caused her to get pulled. You did the right thing. The sooner she gets the treatment, the more likely she will recover. It is normal for her to be angry and blame you though. Just remember again, it’s the eating disorder that’s mad at being caught, and it will kick and scream before letting go of your sister. Please don’t hesitate to ask your parents if you can see a therapist or counselor to help you during this time as well.",
      "created_utc": 1567133383.0,
      "score": 20,
      "context": []
    },
    {
      "id": "eyjtfgd",
      "author": "iamadreammachine",
      "body": "First of all, you did the right thing. My personal opinion is that you don't really have anything to make up for, rather you should let her know that you did what you did because you love her and were worried about her. And you want to support her and help her while she gets help. \n\nI understand her feelings too. Eating disorders carry a lot of secrecy and shame. It's very hard to admit you have one, especially to yourself. It's possible in her mind she really doesnt feel she has a problem. However I really feel you did the right thing.\n\nGive her time. It may take a while, but she needs to recover and get help and some day she will understand you just wanted to help her.",
      "created_utc": 1567127775.0,
      "score": 26,
      "context": []
    },
    {
      "id": "eyk177v",
      "author": "leobasementboy",
      "body": "You did what was right. She’s going to see that one day.",
      "created_utc": 1567133859.0,
      "score": 9,
      "context": []
    },
    {
      "id": "eykzejt",
      "author": "sevenswns",
      "body": "hi! you've posted this before, and the answer is still the same as we've told you before: you need to give her space, and let her come to you. she is upset and feels betrayed, but that is her illness speaking. continue to be kind and supportive while she goes through treatment, and she'll come back to you once she realizes that you did it because you care.",
      "created_utc": 1567172374.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eykddbr",
      "author": "None",
      "body": "As someone who has had a lifelong battle with anorexia- you have nothing to make up for. Her anger is fueled by what her eating disorder wants. Sooner or later she will understand, although the journey is painful for everyone. Looking back, I wish someone had held me accountable (not that anyone is to blame in this sort of situation). It would have saved me from a very long and tiresome journey.",
      "created_utc": 1567146047.0,
      "score": 5,
      "context": []
    },
    {
      "id": "eyl0m1o",
      "author": "ambxvalence",
      "body": "you absolutely 100% did the right thing. it may hurt right now but you have to seperate her from the disorder as best you can. her being mad is her disorder, not her. things will get better with time and with recovery.",
      "created_utc": 1567173255.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f0j9qy1",
      "author": "None",
      "body": "I’ve never been in dance but read dance and gymnastics can be fuelling to eating disorders, so it’s best that she isn’t in dance until she is in a more recovered mindset I think. Harsh but necessary I guess.",
      "created_utc": 1568653106.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eym8gd5",
      "author": "demonsinursoup",
      "body": "You did the right thing. I know that its difficult right now, but in time, she will realize that you did her a huge favor. In the mean time, just remember that she loves you. Shes just struggling. Hang in there 💖",
      "created_utc": 1567202145.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eyovs56",
      "author": "None",
      "body": "She may be mad now, but trust me, she thank you in the future, this will benefit her in the long run, telling your parents will help them give the help and support she needs, she may not see is at first but in due time she’ll be recovering from it. Youre an amazing sister for helping 💖",
      "created_utc": 1567284183.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f863z7l",
      "author": "RagingPython",
      "body": "I’m sure you’ve done the right thing. Your sister... I can see why she she’s angry. I’m sure she feels like she’s been betrayed, and that by telling your parents about something she probably doesn’t feel is an issue, you caused her to get pulled out of her dance classes.\n\nBut don’t feel bad. Someday, I’m sure, your sister will realise that you really helped. She’s in therapy now, so she should start getting better.\n\nDon’t feel like your relationship is ruined. Even if she doesn’t realise it yet, she’ll be really grateful to have a supportive brother like you who cares about her.",
      "created_utc": 1574289273.0,
      "score": 1,
      "context": []
    }
  ]
}