{
  "id": "cy2k6u",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1567293682.0,
  "title": "Request: ward experiences",
  "selftext": "Hi I'm (15F) and I was hospitalized earlier this year.\nPersonally I hated my experience and it didn't exactly motivate me to get better. I'm just really confused by everything.\n\nI stayed at the hospital a bit and nothing noteworthy happened there, but soon I was moved to a psych ward. The place wasn't specifically for eating disorder patients, but there were a couple others. First evening I struggled to eat, and the guy watching my meal just basically started yelling at me. \n\nNext odd thing to me was the constant surveillance which yea I get the point, but it was uncomfortable, like wherever we went there was a nurse listening and it was so awkward I guess.\n\nI hated the ward so much, it felt like punishment more then anything. We would literally get told that \"This isn't a place to be happy, focus on your treatment\" if we were having \"too much\" fun (I mean like just laughing loudly and cracking jokes and chilling with each other)\nAnother specific instance was when I was having trouble eating at all and I had been refusing to drink the meal replacement thingy. A guy just starting on his shift comes in takes the drink pours it in the sink and says that I'm just wasting everyone's time.\n\nThe last thing is that no one has ever mentioned putting me in theraphy. Not even in the checkups. I mean they just make me go to some family sessions, but nothing individually for me.\n\n\nI mean I don't know, maybe that all is standard, but I hated it and it didn't help me one bit. It just made me suicidal if I'm being honest.\nI'm sorry that this is so long and if I'm being a dumbass. I just feel really confused about my experiences\n\n\n(Hi so I'm really sorry if I didn't do this posting thing correctly I'm a bit confused)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/cy2k6u/request_ward_experiences/",
  "score": 48,
  "num_comments": 7,
  "comments": [
    {
      "id": "eyps4v7",
      "author": "None",
      "body": "Overall inpatient in my experience will never be pleasant. I’ve been at a few establishments and although some are better, there are reasons they can’t make it too campy. I know a lot of people rely on inpatient because it gives them a sense of stability, a disconnect from their actual reality (home/work life), they make friends and they can abandon responsibility when they’re in care. There’s also the whole aspect of competitiveness where people tend to try and rack up the most IP stays to he the best anorexic. Basically, I feel as though because anorexia is a very action driven mental illness they try and limit the amount of positive reinforcement when it comes to that behaviour.\n\nOverall, most of my experiences were horrible and it definitely encouraged me to stay « healthy enough » to stay out of the hospital but it took me way too long to learn proper habits because i wasn’t taught them in the hospital. If you received no counselling I don’t believe they were properly equipped to have people with ED’s. In general, any inpatient program should have psychologists and I’m so sorry that wasn’t provided for you. I hope you have someone outside the hospital to provide you with proper help and if not you should seriously consider it. \n\nWhen it comes to certain protocols, a lot of them are universal for eating disorders. Leaving the door a crack open while someone stays at the door while you pee is super normal in hospital world and in some places you get to earn the privilege to pee on your own lol. Same goes for showers. It’s uncomfortable but girls would definitely purge otherwise and they still try to work that rule. \n\nWorkers tend to be desensitized when it comes to people in wards if they’ve been there for so long. I’m sorry people lost patience with you but you also need to be determined to try your best to recover. You’re still very young, I was sick at your age too and I deeply wish I had realized younger that I had more to offer the world than trying to be skinny. I hope you find something that gives you purpose and fulfills you. I hope you realize your potential and learn to listen to the kind words around you rather than the harsh ones in your head. I hope you embrace recovery despite your traumatic experience and learn to love yourself. You’re worth it, please don’t make the choice to watch your teenage years waste away to a disorder that just wants to watch you fail.",
      "created_utc": 1567309437.0,
      "score": 15,
      "context": []
    },
    {
      "id": "eypgyo6",
      "author": "bearthedog3",
      "body": "I had a really bad experience in inpatient too. The structure of the ward seemed really poorly put together, I would switch doctors constantly, I was held in the ward way longer than I should have been and a doctor straight lied to my face. It was very sketchy. I think especially for juveniles, there is not much adequate and even less good treatment options for eating disorders. It's sadly just an area that has little medical research or widespread treatment options. And they are especially not organized, where they do exist. Your experience is not abnormal, unfortunately. I feel for you. I struggled for many years after inpatient. It is certainly not a magical cure all.\n\nThe most important thing for you to do is focus on yourself right now. I wish I could offer more specific advice but truly you are your worst enemy, but also your best help. Try to learn to turn the mean voice inside yourself into a positive one, or at least to tune it out. \n\nDon't give up, try not to feel discouraged. The journey to recovery is rough and bumpy. Good luck friend, sending hugs and good vibes your way.",
      "created_utc": 1567299801.0,
      "score": 7,
      "context": []
    },
    {
      "id": "eyq4oos",
      "author": "rainysounds",
      "body": "As someone a little older who's been to treatment centres and hospitals, that sounds like an absolutely atrocious experience and I'm sorry you were treated so cruelly and incompetently by purported mental health care professionals.\n\nI've only ever gone to inpatient treatment voluntarily (I've always been over 18), so my experiences are different than being forced to go, but I've still had run ins nurses, therapists, and CRCs who, despite being entrusted with your care, don't give a flying fuck about you. It's so beyond discouraging to a patient in such a vulnerable place like that to realize the person with total authority over you and your treatment is actually disdainful of you.\n\nDo keep this in mind though: a psych ward in a hospital is leagues different from a dedicated eating disorder treatment centre. I've been a patient in both, and psych wards are not about treatment, they're about warehousing you and keeping you alive. It's shitty, and now how we should be treated, but it is different than going to a facility where the focus is patient recovery. People tend to give a shit, there.\n\nHave you asked for personal therapy? Would your parents find you a therapist of you did? It would really be worth it to start. A therapist would even help you sort out these disappointing encounters with the mental health care system.\n\nAnd as someone who's been 15 and compelled into treatment, let me say that it is worth it to recover, even to try. I'm in my late 20s and still not completely recovered, but treatment helped me. Meds helped me. Therapy helped me. Even when times are bad, I'm happy I've stuck around.",
      "created_utc": 1567324814.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eyq94av",
      "author": "houston_veronica",
      "body": "You are no dumba$$. You are a wonderful, valuable person - a walking miracle for having bravely agreed to confront the beast called \"ed\".  \n\nI have had AN for 13 years, and it was after a very loving intervention by my fam that I went to ED trx. last June 2018. It took me 75 days to get home, and I learned so much about myself and about the positives and negatives of treatment.  I am thankful for:\n\n* their ability to weight-restore me from a very, very severe point.\n* the love and care that went into the acute area of my treatment; I felt all the things you feel, but there was so much care put into the patients that it is easy to forget the \"non-rosy\" aspects of that time.\n* the friendships I made - by far, the best gift of all.\n* progress; no, I am not \"over\" it, but I am so, so much stronger.\n\nWhere I falter in being thankful (aka, what freaked me out, lol):\n\n* how much hate and anger exists toward Eds by the professionals - which they should! - but how it can feel *almost* directed at you, the patient. (not so, but how it FEELS).\n* the feeling that you're in prison and a second-class human. Constant humiliation. I even asked the director if the goal was to \"be like the military...break you down hardcore, then try to build you up?\" -- she was one of the best MDs I've ever had, and she said \"uh, no!\" -- but I think she doesn't realize how horrible it can be and feel.\n* how black/white the thinking of the facility can be, despite us all knowing that black-white thinking is the affliction that can fuel an ED. (ex: \"you will never recover if you dip your apples in yogurt. That is a behavior! Stop that immediately!\"...patient thinks: \"I'll just never recover because that's the least thing I do wrong in my ED. Oh well.\")\n\nWhile I was at Trx. I met some AMAZING, walk-on-water professionals. That was the most valuable gift, other than the friendships I made with my peers. The professionals always had this motto to share with us: \"Take what you can use, and leave the rest.\"  \n\nThat is the advice I give ALL of us! Even non-ED sufferers. In life, you're going to encounter amazing moments in places that also have flaws and scars. Like all of us, nothing is perfect. Even if it's like 95% imperfect, try to take what you can out of the situation, and don't worry about the other stuff. Chalk up the bad things to just not being helpful, but don't let that detract you from the good that is to be had.  \n\nOf course there are exceptions, but if you are in a situation where you are truly choosing the best option possible-- even if it's being in a psych ward - - try to say a prayer or meditation to your faith power, and say \"Let me please get what I am supposed to receive from this program. Even if it is one thing only, please let me recognize it and appreciate it.\" -- \n\nThere are LOTS of good treatment places, but those same places are also regarded as \"horrible\" by other people who either genuinely had an exceptionally bad situation OR people who have not realized the philosophy above. :-)  Try your best, leave the rest, and keep fighting HARD. You're so beautiful on your own - you don't need an ED to identify you. You're much more than some BS ed, and your life is precious. You mean a lot to me, and I'm just an internet stranger... ;-)",
      "created_utc": 1567332015.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eypefp1",
      "author": "None",
      "body": "You were just really unlucky. I’m sorry you were put in such an awful place. Trust me you deserve to recover. And there are lots of places which are great. Don’t let this experience stop you from recovering in the future. If I were you I would try to book some therapy sessions for now.",
      "created_utc": 1567297733.0,
      "score": 3,
      "context": []
    },
    {
      "id": "eyphlqr",
      "author": "somegenerichandle",
      "body": "I'm sorry you had to experience this. I was in a children's ward in the late 1990s for three weeks. We definitely had surveillance and the amount of food we ate was scored. They'd punish me by making me go to bed early and threaten to not release me.\nA guy pouring your drink down is terrible. I've had staff take away my food too.\n\nI don't think my experience was helpful either. I actually became a ward of the State because i was involuntarily hospitalized. I'm glad you are out of it now, and I hope you find a way to heal.",
      "created_utc": 1567300332.0,
      "score": 2,
      "context": []
    },
    {
      "id": "eyrmv91",
      "author": "mourningxdove",
      "body": "I had a similar experience in a psych ward. They seem to have no knowledge of eating disorders whatsoever.",
      "created_utc": 1567372744.0,
      "score": 1,
      "context": []
    }
  ]
}