{
  "id": "cyng57",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1567421386.0,
  "title": "Request: How to pick yourself back up after a binge?",
  "selftext": "I hadn't binged in over a month but today I gave in. I don't plan out my binges, I guess one day it just comes over me and I decide to. Sometimes I get thoughts but I'm pretty good at resisting them. \n\nTonight I felt very sad and alone after I got some upsetting news. I binged for comfort\n and it made me feel better in the moment, but now I just feel disgusting, awful, sick, and like a failure. I purged to \"compensate\" but obviously that made me feel worse. \n\nI feel like I'm just going to balloon up and gain a bunch of weight from this. Which really scares me. I don't know how to recover. What makes you feel better after a binge? I've just been crying pathetically, and thinking horrible things about myself, and regretting it.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/cyng57/request_how_to_pick_yourself_back_up_after_a_binge/",
  "score": 45,
  "num_comments": 7,
  "comments": [
    {
      "id": "eyt2vvj",
      "author": "Tomek8787",
      "body": "I know the feel, best thing you can do is get right back onto the wagon, pick up where you left off from, don’t scale back calories or torture yourself with cardio.\n\nYou said you have been tracking good for a few months, you should be proud of yourself and use that as motivation. Binging disorders take a long time to get over and many people never do dissolve them entirely, this was an expected hurdle and how you bounce back from this will play a big role.",
      "created_utc": 1567422436.0,
      "score": 16,
      "context": []
    },
    {
      "id": "eyuhfys",
      "author": "annielovesbacon",
      "body": "Physically what makes me feel better is drinking a lot of water (it’s hard after eating so much, but it will help with digestion and water weight) and using a heating pad on my stomach or taking a hot bath. \n\nEmotionally, I journal about what maybe caused the binge and try to process how I’m feeling. It’s painful to think about and I’d rather just avoid those thoughts but it does help in the long run. \n\nThe most important thing: eat your next meal. I know the instinct is to restrict to “make up for” the binge, but restricting leads to binging. \n\nYou got this. Sending love <3",
      "created_utc": 1567462241.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ez05ibs",
      "author": "c-r-i-k-e-y",
      "body": "Something I noticed that helped me was drinking a lot of water before bed. It doesn’t really undo damage, but it can help your body process and break down food better. I also notice I retain less water the next day when I drink a bunch of water before bed. When I used to binge a lot in the past, I would make sure to drink a gallon before bed, and I would stay up later so I could take my time drinking it.",
      "created_utc": 1567631202.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ez9yac6",
      "author": "Rachcake93",
      "body": "My therapist always told me, \"Do the next right thing\" which isn't restriction or purging. Go back to your meal plan & be kind to yourself and practice grace/forgiveness. Healing is not linear and you are certainly not alone. Feel free to reach out to me if you ever wanna talk (this applies to anyone struggling w an ED).",
      "created_utc": 1567791707.0,
      "score": 1,
      "context": []
    },
    {
      "id": "eytbrt5",
      "author": "lolaecho",
      "body": ">how you bounce back from this will play a big role.\n\nThis is so important. Your eating disorder is shouting at you but what you do next can show that you can stand up to the negative thoughts and take back control. Drink a lot of fluids (preferably with electrolytes) to try to replace what was lost in the purging and be kind to yourself. Eat as you would normally in the next few days, and if that is extremely difficult, try fruit and veggies or anything that still hits calorie requirements but is easier to take. \n\nThis does not make you weak! Not in the slightest way and please try to ignore any voices in your head that tells you otherwise! You are not a failure because you are trying to be better and that is amazing in itself. \n\nTry to be nice to yourself in the next few days (and the rest of your life of course). Good luck!",
      "created_utc": 1567432099.0,
      "score": 8,
      "context": [
        {
          "id": "eyt2vvj",
          "author": "Tomek8787",
          "body": "I know the feel, best thing you can do is get right back onto the wagon, pick up where you left off from, don’t scale back calories or torture yourself with cardio.\n\nYou said you have been tracking good for a few months, you should be proud of yourself and use that as motivation. Binging disorders take a long time to get over and many people never do dissolve them entirely, this was an expected hurdle and how you bounce back from this will play a big role.",
          "created_utc": 1567422436.0
        }
      ]
    },
    {
      "id": "eytec4s",
      "author": "ginmonty",
      "body": "Amen to being nice to yourself, a key piece to ED recovery. Setbacks happen OP, it’s in the past do what you need to do to get back on track.",
      "created_utc": 1567434254.0,
      "score": 3,
      "context": [
        {
          "id": "eyt2vvj",
          "author": "Tomek8787",
          "body": "I know the feel, best thing you can do is get right back onto the wagon, pick up where you left off from, don’t scale back calories or torture yourself with cardio.\n\nYou said you have been tracking good for a few months, you should be proud of yourself and use that as motivation. Binging disorders take a long time to get over and many people never do dissolve them entirely, this was an expected hurdle and how you bounce back from this will play a big role.",
          "created_utc": 1567422436.0
        },
        {
          "id": "eytbrt5",
          "author": "lolaecho",
          "body": ">how you bounce back from this will play a big role.\n\nThis is so important. Your eating disorder is shouting at you but what you do next can show that you can stand up to the negative thoughts and take back control. Drink a lot of fluids (preferably with electrolytes) to try to replace what was lost in the purging and be kind to yourself. Eat as you would normally in the next few days, and if that is extremely difficult, try fruit and veggies or anything that still hits calorie requirements but is easier to take. \n\nThis does not make you weak! Not in the slightest way and please try to ignore any voices in your head that tells you otherwise! You are not a failure because you are trying to be better and that is amazing in itself. \n\nTry to be nice to yourself in the next few days (and the rest of your life of course). Good luck!",
          "created_utc": 1567432099.0
        }
      ]
    }
  ]
}