{
  "id": "d90x1s",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1569404204.0,
  "title": "Request: “i wish i had your eating disorder”",
  "selftext": "this is something that a couple of my friends have said to me. and it pisses me off to no end. \n\nive dealt with almost every eating disorder since i was a pre-teen. it all began with me binge eating, which led to me gaining my weight and getting an extreme amount of self hatred and body dysmorphia. then that turned into bulimia. ive gone through phases of obsessively counting calories, purposely starving myself, and just generally having an awful relationship with food. ive gained and lost weight countless times, many times in a short period of time. and right now i guess i would be considered anorexic. so ive kind of been through it all. \n\ntwo of my friends are self diagnosed binge eaters. one of them i completely believe, she goes to therapy (pretty sure she’s diagnosed) and we’ve talked about our relationship with food before. the other one however seems to just generally eat too much because she likes food and occasionally uses the label. im not trying to say she doesn’t have any issues with food, it just seems like she throws around the label of an eating disorder very loosely. \n\nanyways, both of these friends have made comments before about “i wish i had that eating disorder” and “haha i got the wrong eating disorder” and especially “we get it. youre skinny”. and it really fucking sucks. like ive had years of obsessing over every bite of food that goes into my body. most of the time i cant even enjoy food. and they act like they’re jealous of it. \n\nthis is mostly just kind of a rant because its on my mind. its not something either of them say often, and they aren’t purposely trying to hurt me. i was mostly just curious if anyone else has dealt with something like this, or if you have any advice on how to handle it",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/d90x1s/request_i_wish_i_had_your_eating_disorder/",
  "score": 111,
  "num_comments": 6,
  "comments": [
    {
      "id": "f1dxqpg",
      "author": "None",
      "body": "I've had this from a couple of people (not Friends, just people I talk to rarely);\n\n I either ignore it (as they're not really aware it can be damaging to hear that, Not their fault) or say \"You really don't want this, I'm constantly tired/weak with awful thoughts\".\n\n&#x200B;\n\nMost people don't realise mentioning your weight or saying they want our problem can be damaging so I don't hold it against them.",
      "created_utc": 1569404802.0,
      "score": 26,
      "context": []
    },
    {
      "id": "f1e82y9",
      "author": "Rachcake93",
      "body": "I have been on both ends of the spectrum, obese from my ED & underweight. I get it and I try and explain to people I was just as miserable when I was xxxlbs as I was when I was xxlbs. Weight is just a symptom of my ED for me. I am sorry you're struggling. Just because we have smaller bodies now doesn't mean we don't have the same self-hatred, OCD, and issues... love & light to you",
      "created_utc": 1569415537.0,
      "score": 21,
      "context": []
    },
    {
      "id": "f1e2v5j",
      "author": "None",
      "body": "It sounds like both of your friends have issues with food and don’t realize that they’re saying really hurtful things to you. You should shoot them a text with the same things you told us in your post. If they don’t care enough about your feelings to stop, it’s time to consider some distance.",
      "created_utc": 1569410902.0,
      "score": 11,
      "context": []
    },
    {
      "id": "f1elzsz",
      "author": "None",
      "body": "I struggle with over-exercising (in particular, running). I ran competitively for a long time, and dedication vs unhealthy, obsessive habits were easily muddled.\n\nCoworkers and friends CONSTANTLY say things like “I wish I could run like you” “I wish I had your body” etc. What they do not know is I am constantly battling myself in my head. They do not see me pushing myself to run sometimes until I am in so much pain that I am crying. They cannot fathom what exercise addiction is and how it can negatively impact your social and work life. This only exacerbates my urge to continue over exercising and restricting because I feel that I am “not sick enough” for those around me to realize that it is a problem for me and to quit making harmful comments disguised as compliments. \n\nI realize this is unhelpful, but I guess my point in writing this is that you are not alone. It sucks when the people you love lack sensitivity. I don’t think you need to cut these people out of your life, but search for friends who are sensitive and who uplift you and make you feel heard. Sending love your way.",
      "created_utc": 1569425252.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f1f6xr3",
      "author": "rumbusiness",
      "body": "I've also had this. The other day my gym friend said \"I wish I had your problem!\". Meanwhile my throat is torn to shreds, I'm hoping the burning pain in my stomach is gastritis and not a hernia, I'm shitting blood, my brain feels like it's going to explode, and I haven't kept a dinner down in weeks. I don't have any constructive advice, but I do share your pain. x",
      "created_utc": 1569438085.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f1f1rq1",
      "author": "girlonthetra1n",
      "body": "I've gotten this before as well.  Mostly from clueless people who say things like, \"I wish I could starve myself-- I can't stop eating!\" Even my mother has said things along the lines of wishing to be anorexic.  I know it hurts, but they don't realize. People are ignorant. However, I think they are likely facing their own difficulties with body image whether you think they fit a diagnosis or not. Individuals handle things in very different ways and self-image is a complicated matter. They see you as the epitome of what they want to be likely, which is wrong of course since you have an eating disorder. I think maybe letting them know that it hurts you the next time they say something like that would make a difference and if they are good friends they will stop.   \nBest of luck to you, though. I hope you are able to recover and find peace in your body <3",
      "created_utc": 1569435207.0,
      "score": 2,
      "context": []
    }
  ]
}