{
  "id": "d9sxxj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1569545612.0,
  "title": "Request: My little sister is showing signs. Help",
  "selftext": " I’m 19 and struggled with bulimia heavily for years . My little sister is in 4th grade and  has been making concerning comments about food and weight and portraying the early habits of an eating disorder. I try to talk to her about it every time I catch her saying those things, but it’s really difficult because I don’t know what the right thing to say is. I really don’t want her to be like me and I need some advice on things I Should say. If anyone began ED habits at a young age let me know what you wish someone would’ve told you before it was too late.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/d9sxxj/request_my_little_sister_is_showing_signs_help/",
  "score": 54,
  "num_comments": 9,
  "comments": [
    {
      "id": "f1l9qz0",
      "author": "katsnackshackysacks",
      "body": "I wish people, especially women, in my life had stopped modeling behavior concerning dieting and body image. I also wish that, when I had said things about how uncomfortable I was in my body, they would have said “you are so healthy” or “as long as you feel good and energetic you are fine” rather than just reassuring me that I was skinny, because these only reinforces my obsession with body weight. I also don’t recall a time in my life where others would compliment me on my accomplishments rather than my appearance... they meant well but I think this puts the focus of young people in the wrong place.\n\nI also wish they had told me certain habits were NOT okay. I stopped eating lunch when I was in middle school and my friends told my mom- but she didn’t do enough at the time to intervene. She could have supported me just by helping me pack one, because even that would have dignified that it mattered and also instilled a healthier habit.\n\nI wish meals had been social and transparent at home. A lot of people in my house got home at different times so ate dinner separately. This obviously made it easy to skip meals, and I also think I missed out on a lot of opportunities to make positive associations with food. Eating together with your sister, even sometimes, might make a difference. Cooking too.",
      "created_utc": 1569549132.0,
      "score": 33,
      "context": []
    },
    {
      "id": "f1lecl5",
      "author": "annielovesbacon",
      "body": "I was in high school when I first began to exhibit signs but I just wish someone had noticed. I always stayed in my teachers’ rooms during the lunch period without eating and just once wished one of them would have expressed concern. It sounds like you’re already being verbal about noticing these things in your sister so I hope that’s helping!\n\nIf you feel things are getting bad enough, maybe talk to her teacher? They may be able to keep an eye on her and see if she is eating or eating enough during lunch, or making comments about her weight/appearance.",
      "created_utc": 1569552536.0,
      "score": 12,
      "context": []
    },
    {
      "id": "f1lq6ql",
      "author": "pennycenturie",
      "body": "Starting when I was about 8 I had fantasies about cutting my stomach off with ribbon cutting ceremony scissors, and would react to any incident of shame surrounding food with determination to “never eat again.”\n\nI think it might have helped if someone sat me down to rationalize that thinking (impulsive restriction) with grounded logic about eating as a spectrum. I was overweight at  that time so a holistic effort to improve my diet would have been great, but I didn’t really understand the science of it, I just saw deprivation as a success. By the time I was in 7th grade I was romantically and obsessively skipping lunch and regularly refusing food at home, but I never thought about food choices. I was just so broken in my relationship with food that all food was the same, and the less I could eat, the better a person I would be.",
      "created_utc": 1569563572.0,
      "score": 9,
      "context": []
    },
    {
      "id": "f1l6hed",
      "author": "stabbednsoping",
      "body": "I wish someone would have told a teacher or counsiler before I starved down to an anorexic weight. Tell her the dangers of eating disorders if she's showing signs of early behavior.",
      "created_utc": 1569547031.0,
      "score": 15,
      "context": []
    },
    {
      "id": "f1m2pbr",
      "author": "turtle090227",
      "body": "Nowadays it’s easier for kids to become weight obsessed because they’ve got access to social media n skinny promo bullshit that we all probably didn’t have as kids. I think reassurance is important, possibly try get her into a sensible eating regime. Discuss body positivity around her . Talk about her friendships ( a lot of the time its peers have an influence) . I remember as a kid I used to be told I had to go on the bottom of the piggy back, and it’s the little things that usually play on your mind.",
      "created_utc": 1569581984.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f1lypqj",
      "author": "KimFishe",
      "body": "I have an ED too. And I have a little sister who also displays similar behaviours I did. Refusin to eat after an argument, refusing to eat things she just dont want to. Eating unhealthy at times.. like, either everything or nothing. Which is very similar to mine.\n\nI havent told her about the eatingdisorder Im struggling with. Because informing her of that could just put ideas in her head. Rather, when she brings it up, tell her how dangerous it is and that its nothing to look for, no need to go in depth unless she pushes it. Try positive reinforcement instead. \"Today we find out what to wat together, and if u chose today, i chose tomorrow. Then we make the food together and have a great time, maybe we can watch a movie or play uno as well\"\n\nI barely evee talk to hee about how she looks. I could probably have avoided making jokes of myself back when I was obese. But i guess i cant change the past. Ive lost a lot of weight now and Im scared that'll influence her too, especially if she finds out why. Im not going to tell her unless she directly ask me.\n\nIm focusing more on being a generallt supportive role. That she can talk to me about absolutely everything. Embarrassing, scary, sad, happy, funny, anything. And in that, I think I have succeeded.\n\nI think thats whats important. That she knows shes loved. And she knows she has a safe person to come to when she needs to talk, laugh, or just cry and be hugged. That wont get mad, and will always support her no matter what.\n\nIts usually when we feel like we dont have that better, safer coping mechanism. We develope bad ones like self harm, eating disorders and substance abuse.",
      "created_utc": 1569576578.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f1md3qh",
      "author": "None",
      "body": "Do you guys have any trauma or a dysfunctional family?. \n\nEating disorders are methods we use to cope. What could she be using it for?",
      "created_utc": 1569591084.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f1leg65",
      "author": "annielovesbacon",
      "body": "I totally agree. I feel like a really common response is “aw, no, you’re not fat!” which just reinforces the idea that being fat is bad.",
      "created_utc": 1569552613.0,
      "score": 10,
      "context": [
        {
          "id": "f1l9qz0",
          "author": "katsnackshackysacks",
          "body": "I wish people, especially women, in my life had stopped modeling behavior concerning dieting and body image. I also wish that, when I had said things about how uncomfortable I was in my body, they would have said “you are so healthy” or “as long as you feel good and energetic you are fine” rather than just reassuring me that I was skinny, because these only reinforces my obsession with body weight. I also don’t recall a time in my life where others would compliment me on my accomplishments rather than my appearance... they meant well but I think this puts the focus of young people in the wrong place.\n\nI also wish they had told me certain habits were NOT okay. I stopped eating lunch when I was in middle school and my friends told my mom- but she didn’t do enough at the time to intervene. She could have supported me just by helping me pack one, because even that would have dignified that it mattered and also instilled a healthier habit.\n\nI wish meals had been social and transparent at home. A lot of people in my house got home at different times so ate dinner separately. This obviously made it easy to skip meals, and I also think I missed out on a lot of opportunities to make positive associations with food. Eating together with your sister, even sometimes, might make a difference. Cooking too.",
          "created_utc": 1569549132.0
        }
      ]
    },
    {
      "id": "f1oehyv",
      "author": "forestgreenwhore",
      "body": "Our family is very dysfunctional and traumatic. I didn’t really think that she could be using it to cope but that is a really helpful idea",
      "created_utc": 1569642683.0,
      "score": 0,
      "context": [
        {
          "id": "f1md3qh",
          "author": "None",
          "body": "Do you guys have any trauma or a dysfunctional family?. \n\nEating disorders are methods we use to cope. What could she be using it for?",
          "created_utc": 1569591084.0
        }
      ]
    }
  ]
}