{
  "id": "dca606",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1570022704.0,
  "title": "Request: People Complained When I Said EDs Are About Control",
  "selftext": "Was on a subreddit and said anorexia is about obsession and control and people said I was generalizing. Has anyone who has actually gotten treatment also been told they have control/chaos/coping issues? The ncbi and national institute for eating disorders both mention control as a major part of EDs, but I guess I'm wrong",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dca606/request_people_complained_when_i_said_eds_are/",
  "score": 60,
  "num_comments": 23,
  "comments": [
    {
      "id": "f26wxoi",
      "author": "d0llyem",
      "body": "One of my the main reasons my anorexia started in the first place was because it felt like my life was out of control, and I found something (my ed) to control. However, we all know that ed will start controlling you. I think I see where people are coming from when they say you’re generalizing, some peoples eds may have started for different reasons. But yes, I think there are plenty of people who had an ed start from controlling issues, myself being one of them.",
      "created_utc": 1570025497.0,
      "score": 32,
      "context": []
    },
    {
      "id": "f27v6bj",
      "author": "scart22",
      "body": "As a bulemic / BED who is currently in treatment, it is (FOR ME), \\*absolutely\\* about control. 100%.   \n\n\nThe important part: \"for me\".",
      "created_utc": 1570046768.0,
      "score": 8,
      "context": []
    },
    {
      "id": "f27hz20",
      "author": "SpaceWhale88",
      "body": "I agree that just saying it's about control is an oversimplification. \n\nMy bff in college had anorexia and he was so anxious and OCD about food. His brain was reminding him that food isn't very pleasurable and leads to further anxiety. Obsessive uncontrollable thoughts about food led to compulsive behaviors. I think anorexia is much better described as a subtype of OCD. \n\nI know I restrict more when I'm really anxious and on edge and binge when I'm more depressed. When I'm somewhere in the middle of anxiety and depression I do all behaviors. I \"diet\" till I can't take it because of the physical effects of not eating enough then binge and purge. \n\nI'm also tired of the troup that person feels helpless, then consciously realizes their body is withing their control as it feels like nothing else is, and then said person takes a knowing step forward like \"I can't control my situation so I'll control my food.\" \n\nI remember a Ted talk about a woman telling her experiences with treating anorexic patients. She talked about how the brain doesn't respond normally to food so you get little reward when you eat anyway and it may just actually increase anxiety and obsessive thoughts. \n\nIn a different Ted talk (I think? This info was from a while ago) people with bulimia experience similar responses to food. Say a normal person eats half a cup of ice cream and feels satisfied. A person with bulimia only has a mild pleasure response to that same amount. In order to feel enough of that dopamine high, they may need to consume a whole pint. And when you purge you body releases endorphins so you become addicted to that high. Both eating disorders have a biological component that interferes with the body's expected and normal response to eating. \n\nHence, when people hear \"it's all about control\" we roll our eyes.",
      "created_utc": 1570038645.0,
      "score": 14,
      "context": []
    },
    {
      "id": "f2712zt",
      "author": "None",
      "body": "It’s a cliche and oversimplification. People with anorexia and eating disorders have measurable changes in their hormones, metabolism, and how their brains react in response to food, stress, and restriction that are not seen in healthy controls.",
      "created_utc": 1570028324.0,
      "score": 15,
      "context": []
    },
    {
      "id": "f28dk39",
      "author": "None",
      "body": "Mine was about control and it may be really common but it's still a generalization and any generalization excludes a group of people. So you weren't wrong but it was still a generalization and you could have easily said \"for a lot of people, anorexia is about obsession and control\" and it would have been fine.",
      "created_utc": 1570058815.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f28g44k",
      "author": "riessk4",
      "body": "Mine has absolutely NOTHING to do with body image and has completely everything to do with control! Not everyone with an eating disorder developed one for the same reason",
      "created_utc": 1570060717.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f2907io",
      "author": "SelfAwarenessMonster",
      "body": "I am in a 30 week therapy course called Radically Open Dialectical Behavioral Therapy to help me cope more effectively with my over controlled temperament. It is one of the main reasons I developed an eating disorder. \n\nNot all disorders include control but it is not uncommon.\n\nAlso, at their core EDs are anxiety disorders. We feel anxious when we don’t know how to cope with our surroundings which can feel chaotic and ... out of control. So we find someone that is within our control as a way to self soothe. It is maladaptive and harmful but it is still soothing in its own way.",
      "created_utc": 1570075865.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f28g941",
      "author": "mourningxdove",
      "body": "Mine started out as a control issue. My life was chaotic and the only thing i could control was food.",
      "created_utc": 1570060822.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f28r8xn",
      "author": "None",
      "body": "For me it wasn't the case. My anorexia grew out of severe untreated OCD. It was completely debilitating and left me barely functional. I don't know how I made the connection, but I found that when I was hungry, my OCD symptoms were less severe. It's not hard to see how that turned into an eating disorder.\n\nIn a sense what really happened was that all my compulsive behaviours became food centred. I developed a lot of bizarre OCD-like food related rituals. Anything related to body image came much later, and I don't know what role, if any, control played.",
      "created_utc": 1570068724.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f28vdv6",
      "author": "Mariat1997",
      "body": "I mean.. for me it was definitely about control. Though i do understand how some people may feel like that is a over generalization. There usually is a lot more to EDs than 'control' and/or body image. \nEveryones story/experience is different. For me a lot of it was a coping mechanism for my emotions and a way to 'compensate' for feeling worthless and wanting to disappear.",
      "created_utc": 1570071675.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f29g66q",
      "author": "Butteredtoastinbed",
      "body": "i understand that for a lot of people it is about control, but for me i never felt a lack of control that then lead to my ED. idk what it is, but i don't think control is an issue personally. having saying this, everyone i know irl with an ED have said that a sense of control is the main factor - so it really does depend on the person",
      "created_utc": 1570096363.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f29i1f3",
      "author": "Blaziken4vr",
      "body": "Loss of control is the main reason my issues started.",
      "created_utc": 1570098276.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f27ljz1",
      "author": "alekzanderp0pe",
      "body": "My therapy is based on teaching me how not to be a perfectionist and a control freak.  I relapse like clockwork when life becomes unstable and things are out of my control.  For me, it's not about weight. I know I look and feel sick when I'm  underweight but it's not about that.",
      "created_utc": 1570040923.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f29kbr3",
      "author": "oceankasidis",
      "body": "In my experience, control has been a common theme when I discuss my anorexia with my psych so I would say that it is a generalisation but that doesn't mean it can't be true",
      "created_utc": 1570099648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f3ogpkw",
      "author": "1reason_thats_me",
      "body": "I get them coming strong in unhealthy relationships. Also, if I’m about to go on vacation, a concert. I feel this idea I’ll be happier if I’m smaller.",
      "created_utc": 1571017452.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f864rsy",
      "author": "RagingPython",
      "body": "I’ve kinda let myself develop one over the last month, but I’m trying to fight it now before it gets worse.\n\nI’d say mine is entirely about control. It took my appearance and weight, which are aspects I’m not happy with, and used them as an excuse to start taking control of me. But now it’s really hard to keep sticking to a normal diet, as I felt so in control and happy when I listened to it and I keep feeling like I want to go back to it.\n\nI expect it wouldn’t be so bad if my life wasn’t such a mess that I really can’t control because of my poor health.",
      "created_utc": 1574289755.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f283vus",
      "author": "elicchika",
      "body": "yeah that's pretty much the point of any eating disorder",
      "created_utc": 1570052129.0,
      "score": 0,
      "context": []
    },
    {
      "id": "f27qjsr",
      "author": "1BubbleGum_Princess",
      "body": "I don’t know that it’s all about where or why you start, but I do think it is part of the “why” people do it- not the only part though, and maybe not the biggest part- for some anyway...",
      "created_utc": 1570044000.0,
      "score": 6,
      "context": [
        {
          "id": "f26wxoi",
          "author": "d0llyem",
          "body": "One of my the main reasons my anorexia started in the first place was because it felt like my life was out of control, and I found something (my ed) to control. However, we all know that ed will start controlling you. I think I see where people are coming from when they say you’re generalizing, some peoples eds may have started for different reasons. But yes, I think there are plenty of people who had an ed start from controlling issues, myself being one of them.",
          "created_utc": 1570025497.0
        }
      ]
    },
    {
      "id": "f864iwu",
      "author": "RagingPython",
      "body": "That is exactly how I feel. My life is a total mess, and I can’t control it. My body is getting weaker as my CFS gets worse and becomes more constant. My mental health is getting worse, and I can’t fix it because most of the causes are out of my control.\n\nSo I think that’s how I kinda got so bad over the last month. It gave me something to control and made me feel like I was in control of something for once. I’m trying to fight it now before it becomes worse, but I miss that feeling of control so much.\n\nIt’s not even about my weight anymore, I think it is just a control thing. It used my weight and appearance as an excuse to take over and now it’s hard to get past it.",
      "created_utc": 1574289613.0,
      "score": 1,
      "context": [
        {
          "id": "f26wxoi",
          "author": "d0llyem",
          "body": "One of my the main reasons my anorexia started in the first place was because it felt like my life was out of control, and I found something (my ed) to control. However, we all know that ed will start controlling you. I think I see where people are coming from when they say you’re generalizing, some peoples eds may have started for different reasons. But yes, I think there are plenty of people who had an ed start from controlling issues, myself being one of them.",
          "created_utc": 1570025497.0
        }
      ]
    },
    {
      "id": "f27qde6",
      "author": "1BubbleGum_Princess",
      "body": "This person did not say it was a healthy way of getting control.",
      "created_utc": 1570043891.0,
      "score": 2,
      "context": [
        {
          "id": "f2712zt",
          "author": "None",
          "body": "It’s a cliche and oversimplification. People with anorexia and eating disorders have measurable changes in their hormones, metabolism, and how their brains react in response to food, stress, and restriction that are not seen in healthy controls.",
          "created_utc": 1570028324.0
        }
      ]
    },
    {
      "id": "f27qv7e",
      "author": "d0llyem",
      "body": "Yes, and that’s exactly why people gotten bothered by it. As many other people have replied, it’s an oversimplification. Needing or wanting control is not the only reason that eating disorders develop, and overlooking that is ignorant if you’re discussing why eating disorders develop. A little ignorant for anyone really if you aren’t a professional.",
      "created_utc": 1570044190.0,
      "score": 4,
      "context": [
        {
          "id": "f26wxoi",
          "author": "d0llyem",
          "body": "One of my the main reasons my anorexia started in the first place was because it felt like my life was out of control, and I found something (my ed) to control. However, we all know that ed will start controlling you. I think I see where people are coming from when they say you’re generalizing, some peoples eds may have started for different reasons. But yes, I think there are plenty of people who had an ed start from controlling issues, myself being one of them.",
          "created_utc": 1570025497.0
        },
        {
          "id": "f27qjsr",
          "author": "1BubbleGum_Princess",
          "body": "I don’t know that it’s all about where or why you start, but I do think it is part of the “why” people do it- not the only part though, and maybe not the biggest part- for some anyway...",
          "created_utc": 1570044000.0
        }
      ]
    },
    {
      "id": "f27r6ss",
      "author": "None",
      "body": "Lol, by “healthy controls” I meant study participants without eating disorders. It’s the term used in medical research.",
      "created_utc": 1570044381.0,
      "score": 8,
      "context": [
        {
          "id": "f2712zt",
          "author": "None",
          "body": "It’s a cliche and oversimplification. People with anorexia and eating disorders have measurable changes in their hormones, metabolism, and how their brains react in response to food, stress, and restriction that are not seen in healthy controls.",
          "created_utc": 1570028324.0
        },
        {
          "id": "f27qde6",
          "author": "1BubbleGum_Princess",
          "body": "This person did not say it was a healthy way of getting control.",
          "created_utc": 1570043891.0
        }
      ]
    },
    {
      "id": "f27rbw4",
      "author": "1BubbleGum_Princess",
      "body": "The OP did not say that it was the only reason. They didn’t say that it was part of the reason either, but I don’t think (though I wouldn’t know) that they are claiming control as the one and only reason for ED. Also, this is reddit- probably gonna need to take stuff with a grain of salt anyways.",
      "created_utc": 1570044464.0,
      "score": 4,
      "context": [
        {
          "id": "f26wxoi",
          "author": "d0llyem",
          "body": "One of my the main reasons my anorexia started in the first place was because it felt like my life was out of control, and I found something (my ed) to control. However, we all know that ed will start controlling you. I think I see where people are coming from when they say you’re generalizing, some peoples eds may have started for different reasons. But yes, I think there are plenty of people who had an ed start from controlling issues, myself being one of them.",
          "created_utc": 1570025497.0
        },
        {
          "id": "f27qjsr",
          "author": "1BubbleGum_Princess",
          "body": "I don’t know that it’s all about where or why you start, but I do think it is part of the “why” people do it- not the only part though, and maybe not the biggest part- for some anyway...",
          "created_utc": 1570044000.0
        },
        {
          "id": "f27qv7e",
          "author": "d0llyem",
          "body": "Yes, and that’s exactly why people gotten bothered by it. As many other people have replied, it’s an oversimplification. Needing or wanting control is not the only reason that eating disorders develop, and overlooking that is ignorant if you’re discussing why eating disorders develop. A little ignorant for anyone really if you aren’t a professional.",
          "created_utc": 1570044190.0
        }
      ]
    }
  ]
}