{
  "id": "dfoh0w",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1570659713.0,
  "title": "Request: told my boyfriend about my eating disorder",
  "selftext": "Last night I told my boyfriend about my eating disorder. (History of anorexia and more so binge/purge) and I’m scared it’s going to impact our relationship. \n\nI’m scared of having someone analyze my eating habits, and monitoring me in general. He made me promise to tell him when I have these thoughts of purging/ restriction and he’ll be checking on me to make sure I’ve eaten. Basically he’s gonna be the food police. \n\nI’m also scared I don’t look sick enough. I’ve always been relatively thin but I’m not underweight. Teetering on the edge of it but not quite there. I almost feel like I need to prove my disorder to him. \n\nThis is all new to me. Basically nobody has ever known about my eating disorder in the 5 years it’s been going on, and when my parents found out when I lived at home nothing happened. Being thin is the ultimate goal for a woman’s appearance in my family. \n\nThis is really long but it’s just all so new. This is supposedly the start of my recovery but I just can’t imagine anything changing.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dfoh0w/request_told_my_boyfriend_about_my_eating_disorder/",
  "score": 60,
  "num_comments": 8,
  "comments": [
    {
      "id": "f355fri",
      "author": "Nut-Loaf",
      "body": "I dated a girl who had an eating disorder. She was a purging anorexic. I had the same thoughts as your boyfriend. I would pay careful attention to her eating habits and stay up late at night with her because she would worry about purging. Eventually, it got to a point where I was not always going to be able to check up on her and see if she was eating properly. I had my life and I was in college. Moreover, it stressed me out having to check up on her all the time, and if she relapsed, she would fall deeper into her disorder, causing more stress in our relationship. I tried putting up with it and thought I could help her get through it. But it was just too much for me and I started feeling resentment for the position I was in. Over this last summer, she came forward to her parents about her ED, and she was able to see a therapist. Eventually, she ended up being sent off to a residential facility where she fully invested into recovery. She progressed a lot and has never been happier. Unfortunately for us, she had some other issues with her trauma and that destroyed our relationship along the way. Part of our relationship ending was because I invested so much energy and my life into her recovery, I became very unhappy and lashed out at her over the phone. She took it very personally and eventually broke up with me about a month later, despite the fact that I had invested into her recovery for over nine months of our relationship. \n\nThe point? Your boyfriend needs to be supportive and patient to an extent that still allows him to focus on his life. And part of that is you taking action on your ED. In other words, you’re going to have to take some responsibility and get help for your ED, because relationships become extremely difficult when partners refuse to seek help for their personal problems. It can cause tension, depression, hurt, resentment, and a whole lot of other awful feelings. I know recovery sounds like a horrible pursuit, but you have to think really hard about your future. How do you think your ED will be in the next five years without professional assistance? How will this impact your life and your personality? How will it impact your family, friends, and your boyfriend? Although eating disorder recovery is a personal journey, it has a great impact on the relationships around you. Your boyfriend might think he can get you through it, but trust me, he can’t. Only you can completely bear the responsibility of recovery. Your boyfriend and family can be supportive though. I really hope you think about this",
      "created_utc": 1570668878.0,
      "score": 32,
      "context": []
    },
    {
      "id": "f34tycr",
      "author": "None",
      "body": "I am sorry to hear this.\nBut you dont need to prove anything your boyfriend sounds caring and is worried about you and he belives you,if he didt he wouldt be your \"food police\"hope you are doing better.:)",
      "created_utc": 1570660632.0,
      "score": 9,
      "context": []
    },
    {
      "id": "f35wzle",
      "author": "None",
      "body": "I don’t think that is appropriate in a love relationship. His intentions might be good, but he isn’t your father. Health professionals should be the one checking up with you, and your bf is there to lean a shoulder to cry on. You might want to consider couple therapy while getting your health on track.",
      "created_utc": 1570695314.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f35vdq7",
      "author": "None",
      "body": "i will try to give you my two cents. I don't have an ed but some other issues which I have shared with my boyfriend and the outcome was a bit similar to yours.\n\ned is a mental disorder so I think that if he wants to be a part of the recovery process make sure not to wear him down because you have it in yours hands and it's basically what you have to figure out and he can help, not the other way around. I don't think you should make him a food police of any sort because that's not essentially his responsibility to get you better. you need to be the iniciator. so if you are comfortable with him enough to share this whole journey I suggest you have some agreement and when something happens you go to him for advice or something like that, so that you are the one who is working on it and not him. he can help you but you really need to help yourself a lot in this in the first place.\n\nalso make sure to be prepared for the disorder to be angry at him when he disagrees with something. the resentment is real. try to compose yourself in these situations so that you are not nasty to him because that wouldn't be fair. this part was hard as hell for me but he is just trying to help so he doesn't deserve any rudeness.\n\nand you do not need to prove anything to him. I understand this feeling completely but your disorder is not about him. it has nothing to do with him. you know what you know and what you do and that's what's going on.\n\nI'm happy you have support in this and I really wish you the best. it must be hard to live in a family with a pressure on you to look a certain way. I believe you will get through it and wish you the best luck, you can do it 🍀",
      "created_utc": 1570692746.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f3e3nvn",
      "author": "halle-lu-jah",
      "body": "I felt similar when I struggled with my eating disorder. I never hit “underweight” but i was still very disordered. You don’t need to prove it to him. I understand it’s hard because you think people won’t validate you because you haven’t hit underweight. It’s ok. Recovery is still possible. And telling someone is a big first step into getting the proper help. \n\nYou are still valid. And I had a similar experience. I felt like people would care about me more if I looked extremely sickly.\n\nBut people do care and you don’t have to look a certain way to have them prove it. Help is out there. And reaching out to knowledgeable sources in order to overcome this is always helpful. Take your time, these types of things do not magically go away overnight. In fact, it took me many months to finally admit I hadn’t truly recovered. Then I finally realized that this was not how I wanted to live. \n\nBut asking for help isn’t embarrassing. Sometimes we as people just need some support. You can do it! I believe in you.",
      "created_utc": 1570856374.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f3jglv3",
      "author": "jsandwicheater",
      "body": "I think it is very brave of you to be open with your boyfriend about your disorder.\n\nNo matter what, this will impact your relationship. It is just whether or not it impacts it in a positive or negative way, and this is in both of your control. \n\nHaving a strong support network is one of the cornerstones of recovery. It sounds to me as if, unfortunately, you don't have a lot of support from your family. \n\nWhen I first began my journey of recovery, I was exactly the same as you. I couldn't imagine anything changing - in fact, I think I wanted it to remain the same, because I felt safe. But this is just fear disguised as safety. You are already overcoming this fear by sharing a part of your self with your boyfriend.\n\nAnother thing to remember is that eating disorders aren't one size fits all - everyone is different and they manifest in different ways. They are complex mental illnesses and cannot be narrowed down to something as simple as the appearance of thinness. It is your thoughts that are causing this disorder, not your appearance. \n\nYou need to seek the appropriate help from someone who is skilled in this area. As lovely as your boyfriend is for offering his help and guidance, this may end up causing unnecessary drama in your relationship. Whilst he might think he can learn to understand - he will never know what it is like to suffer through the constant negative thoughts that come along with an eating disorder.\n\nI wish you luck in your recovery.",
      "created_utc": 1570952391.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f574ec0",
      "author": "nyctose7",
      "body": "“despite the fact that I had invested into her recovery for over nine months”\nwe are all allowed to end a relationship of any sort, at any time, for any reason(s). this is not a transaction or a contract. no matter what you chose to do in the past, she is a whole person with autonomy and if one day she decides she doesn’t want to be with you, she does not owe you anything.",
      "created_utc": 1572031305.0,
      "score": 2,
      "context": [
        {
          "id": "f355fri",
          "author": "Nut-Loaf",
          "body": "I dated a girl who had an eating disorder. She was a purging anorexic. I had the same thoughts as your boyfriend. I would pay careful attention to her eating habits and stay up late at night with her because she would worry about purging. Eventually, it got to a point where I was not always going to be able to check up on her and see if she was eating properly. I had my life and I was in college. Moreover, it stressed me out having to check up on her all the time, and if she relapsed, she would fall deeper into her disorder, causing more stress in our relationship. I tried putting up with it and thought I could help her get through it. But it was just too much for me and I started feeling resentment for the position I was in. Over this last summer, she came forward to her parents about her ED, and she was able to see a therapist. Eventually, she ended up being sent off to a residential facility where she fully invested into recovery. She progressed a lot and has never been happier. Unfortunately for us, she had some other issues with her trauma and that destroyed our relationship along the way. Part of our relationship ending was because I invested so much energy and my life into her recovery, I became very unhappy and lashed out at her over the phone. She took it very personally and eventually broke up with me about a month later, despite the fact that I had invested into her recovery for over nine months of our relationship. \n\nThe point? Your boyfriend needs to be supportive and patient to an extent that still allows him to focus on his life. And part of that is you taking action on your ED. In other words, you’re going to have to take some responsibility and get help for your ED, because relationships become extremely difficult when partners refuse to seek help for their personal problems. It can cause tension, depression, hurt, resentment, and a whole lot of other awful feelings. I know recovery sounds like a horrible pursuit, but you have to think really hard about your future. How do you think your ED will be in the next five years without professional assistance? How will this impact your life and your personality? How will it impact your family, friends, and your boyfriend? Although eating disorder recovery is a personal journey, it has a great impact on the relationships around you. Your boyfriend might think he can get you through it, but trust me, he can’t. Only you can completely bear the responsibility of recovery. Your boyfriend and family can be supportive though. I really hope you think about this",
          "created_utc": 1570668878.0
        }
      ]
    },
    {
      "id": "f576h7n",
      "author": "Nut-Loaf",
      "body": "You are right. Our breakup was pretty awful though, and she didn’t believe me anymore when I told her that I still care about her. There were other things she did before we broke up that was extremely hurtful to me, but I tried working it out. Basically, I cared more about working things out than she did, which was disappointing. There are a whole lot of details I could mention but that would take hours to write. All I know is that she has every right to break up with me for any reason. But I can still think her reasons sucked",
      "created_utc": 1572032050.0,
      "score": 1,
      "context": [
        {
          "id": "f355fri",
          "author": "Nut-Loaf",
          "body": "I dated a girl who had an eating disorder. She was a purging anorexic. I had the same thoughts as your boyfriend. I would pay careful attention to her eating habits and stay up late at night with her because she would worry about purging. Eventually, it got to a point where I was not always going to be able to check up on her and see if she was eating properly. I had my life and I was in college. Moreover, it stressed me out having to check up on her all the time, and if she relapsed, she would fall deeper into her disorder, causing more stress in our relationship. I tried putting up with it and thought I could help her get through it. But it was just too much for me and I started feeling resentment for the position I was in. Over this last summer, she came forward to her parents about her ED, and she was able to see a therapist. Eventually, she ended up being sent off to a residential facility where she fully invested into recovery. She progressed a lot and has never been happier. Unfortunately for us, she had some other issues with her trauma and that destroyed our relationship along the way. Part of our relationship ending was because I invested so much energy and my life into her recovery, I became very unhappy and lashed out at her over the phone. She took it very personally and eventually broke up with me about a month later, despite the fact that I had invested into her recovery for over nine months of our relationship. \n\nThe point? Your boyfriend needs to be supportive and patient to an extent that still allows him to focus on his life. And part of that is you taking action on your ED. In other words, you’re going to have to take some responsibility and get help for your ED, because relationships become extremely difficult when partners refuse to seek help for their personal problems. It can cause tension, depression, hurt, resentment, and a whole lot of other awful feelings. I know recovery sounds like a horrible pursuit, but you have to think really hard about your future. How do you think your ED will be in the next five years without professional assistance? How will this impact your life and your personality? How will it impact your family, friends, and your boyfriend? Although eating disorder recovery is a personal journey, it has a great impact on the relationships around you. Your boyfriend might think he can get you through it, but trust me, he can’t. Only you can completely bear the responsibility of recovery. Your boyfriend and family can be supportive though. I really hope you think about this",
          "created_utc": 1570668878.0
        },
        {
          "id": "f574ec0",
          "author": "nyctose7",
          "body": "“despite the fact that I had invested into her recovery for over nine months”\nwe are all allowed to end a relationship of any sort, at any time, for any reason(s). this is not a transaction or a contract. no matter what you chose to do in the past, she is a whole person with autonomy and if one day she decides she doesn’t want to be with you, she does not owe you anything.",
          "created_utc": 1572031305.0
        }
      ]
    }
  ]
}