{
  "id": "dgglyt",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1570806967.0,
  "title": "Request: Did you know you had an eating disorder?",
  "selftext": "So I was diagnosed with EDNOS/OSFED earlier this year, and when talking to my therapist about my behaviour around food when I was a child we found out that my disordered eating has been present since around the age of 11. But I was only aware of my destructive behaviours very recently (within the last 6 months).\nIs it normal to have an eating disorder for 10+ years and not even realise? Even with periods of a healthy relationship with food? Have any of you ever experienced this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dgglyt/request_did_you_know_you_had_an_eating_disorder/",
  "score": 37,
  "num_comments": 14,
  "comments": [
    {
      "id": "f3bgst9",
      "author": "wishfulmelody",
      "body": "I have had an eating disorder for +10 years but it wasn't until recently I truly realized that I had one and began treatment, and it was probably because I had periods (sometimes year long periods) where I didn't restrict at all...so it happens. \n\nIt's been a bit of a struggle for me to confront this now in recovery and I don't know how it is for you, but I really wish you the best on your road to healing! <3",
      "created_utc": 1570809922.0,
      "score": 9,
      "context": []
    },
    {
      "id": "f3bf7s0",
      "author": "Funderwear420",
      "body": "I thought I was a super picky eater until I made a list of food I like a couple weeks back and it was 19 items. I didn't even know arfid existed because people only talk about ana/mia. I really wonder how many people are orthorexic without knowing.",
      "created_utc": 1570808867.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f3bhemx",
      "author": "itslikekangaroo",
      "body": "I think I’ve always struggled. My mom and grandmother both had weight loss surgery so body image was a big deal in my household my entire life. I started noticing that I was restricting and binging more and more as I got older and my mom’s feelings about my weight became more vocal. Junior year of high school is when I just kinda started “forgetting” to eat meals and would binge but my mom told me that my body image was the most important thing so I thought I was doing it the right way. It full blown developed into a binge eating disorder my first two years of college and then orthorexia during my 3rd. When speaking to a doctor about this we’ve been able to bring it all the way back to my moms weight loss surgery when I was 10 and watching how she ate likely influenced how I did.",
      "created_utc": 1570810330.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f3bslfb",
      "author": "prekheadaches",
      "body": "I had this happen. I went into a treatment program and while they were asking about when my ED started I was telling them about the past year. When we went back it was realized I struggled majorly with ARFID and food rules from age 7+ but my family just always said I was \"quirky\"  about food. \n\nI think if I had been treated as a child I could have avoided a lot of issues relating to food later on.",
      "created_utc": 1570815696.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f3c58ow",
      "author": "pawpatrolchasesucks",
      "body": "i had problems for pretty much my whole life but didn't realize until they spiraled recently and got much worse and more intentional. so i get where you're coming from",
      "created_utc": 1570819946.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f3bji77",
      "author": "drinksriracha",
      "body": "I'm still in denial about having an eating disorder. If I even have one. I have some disordered habits at times (binging, compulsive eating, sugar addiction, chewing and spitting) but for the most part I high restrict and lose extremely slowly, and I'm fairly healthy, so I don't think it's a problem that I'm a little underweight since I don't plan on going too far.",
      "created_utc": 1570811711.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f3blgpz",
      "author": "pagangothunicorn",
      "body": "No, but I was forced to eat by my first stepmom when I was younger. So there’s bulimia and binge which I found out later on. When it was just me and my dad, I got to eat whatever and how ever much I preferred. Then he got married again after my brother was born and she was better about not forcing me but she did ask if my brother and I finished everything on our plates. He did better than I did and she let my dad give me smaller portions. Eventually we became old enough where she let everyone serve themselves and then would just ask us if we could add this or finish that. She became vegetarian around the time I said I was going Vegan. I developed anorexia through orthorexia. How I found out about all this was by living with a nutrition coach mostly specified in chakra testing. She and her boss tested me for food allergies, problems, and disorders. Recovering from orthorexia and anorexia pushed me into bulimia and binge again. I went on the Keto diet and reintroduced chicken and all foods I had dangerously eliminated. Now with celiacs disease I am gluten free, can’t process sugar so that’s out, and I’m lactose intolerant. I still try to follow Keto (mostly some of the rules) but while being Pescatarian. Sometimes I’m Paleo Vegan or Raw Vegan/Fruitarian. I checked with them from living back at home after nannying turned wrong for me and it works! I no longer have orthorexia or anorexia. I can eat until satisfied and have the occasional treat on Saturday- which I call sweet Saturday (I try to have sugar free still on that day, but if I have it, it’s no big deal because its just that one day). I’m mostly eating berries, veggies, fruits, fish, and eggs. I try to do fish Monday unless I’m craving fish. We do what we can and do it in a way that helps and heals our bodies. I love exercising as well, which definitely helps me eat better and keep my depression and anxiety down which also plays roles in eating disorders. \n\nBesides celiacs and the others, I also have SIBO, Candida, anemia, IBS, PCOS, diabetes T1. Some of it ties into one another, which makes it harder.",
      "created_utc": 1570812680.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f3cgj6i",
      "author": "None",
      "body": "I knew pretty much from the start that I was developing an eating disorder, I just didn’t care.\n\nFor me, anorexia grew out of poorly managed OCD. I realised that when I was hungry, my obsessions and compulsions were easier to manage. That lead to restricting quite severely. I knew from the start that it was dangerous, but OCD had made my life so miserable and restricting seemed to be the only thing that helped, so I didn’t really care if it was endangering my health. I later developed body image disturbances and other more typical ED thought patterns, but that wasn’t the primary driver of my ED, at least in the beginning.\n\nEating disorders, among other mental illnesses, have affected a many of my family members, so I recognised it pretty quickly. Actually seeking help was a different story. I didn’t want to give up the only thing that helped me manage my OCD symptoms, so I hid it. Throughout the most severe period, I knew that I was ill, and could possibly die, I just didn’t particularly care.\n\nThat said, when I had a relapse, with a more insidious development of bingeing and restricting, I didn’t realise until much later. I rationalised or downplayed the binges and told myself I wasn’t hungry when I was restricting. Even despite massive weight fluctuations, I didn’t think anything was wrong.\n\nI think in my case, it was a matter of the specific behaviours. It’s a lot easier to ignore occasional and gradually escalating binges and mild restriction than it is to ignore not eating for days at a time.",
      "created_utc": 1570823801.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f3e2gy4",
      "author": "irishdancer2",
      "body": "Know? Maybe. Would admit it to myself? No.\n\nMany times I thought to myself, “I have some disordered eating habits, not an eating disorder.”",
      "created_utc": 1570854987.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f3jcuhn",
      "author": "None",
      "body": "no and tbh I'm not sure if what I have even counts as an eating disorder and if it does, what type of ED I have. Like it definitely started when I was a teen and I would actively skip meals because my mother was emotionally and physically abusive to me and I chose not to eat because it meant I wouldn't have to see her (the kitchen is right there in front of the stairs when you go down so there was no way to avoid her) since I was so afraid of her. I grew so used to either eating 1 meal a day or going several days without any actual meals (I sustained myself on crackers and bread rolls on days I didn't have school), all because I was afraid of my mom, and eating was the one thing I knew she couldn't force me to do. To this day there are often times where I don't even eat much, like today all I had was fried rice at lunch and I didn't have the appetite or will to eat anything else.",
      "created_utc": 1570950673.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f3rt2ir",
      "author": "isayessi",
      "body": "Was always fit and skinny younger year's, Hit my mid 30's and 2017 was in my high school size 4 and today hit hardest for gaining 60 lbs and yo* dieting trying lose weight but got worsening every time tried lose it amd ate less but drinking issues now as recently drank 3 beers a day and one meal a day..I realized the only secrets are the ones you can't control. Lost control and decided to punish myself tommorow no alcohol or eating once a day.",
      "created_utc": 1571091431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f3sxxd6",
      "author": "prplppl8r",
      "body": "I didn't have it for 10+ years without realizing it, but I did not actively pursue getting an eating disorder. There was this one year in high school that I suffered greatly from depression and stopped eating because of it. I stopped eating because my stomach always hurt after I ate (the stomach pain was actually due to stress and not the food), but then it led to an obsessive thought process on how long I can go without eating.\n\nI remember the day that I realized I had a problem. It was about a 1.5 years after my dark depression days, and I realized that I couldn't eat a healthy normal meal without the desire to purge. I remember being in a sense of shock of,  \"Oh shit, I can't stop\" and \"How did I get here?\"",
      "created_utc": 1571112054.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f3bi73a",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1570810850.0,
      "score": 3,
      "context": [
        {
          "id": "f3bgst9",
          "author": "wishfulmelody",
          "body": "I have had an eating disorder for +10 years but it wasn't until recently I truly realized that I had one and began treatment, and it was probably because I had periods (sometimes year long periods) where I didn't restrict at all...so it happens. \n\nIt's been a bit of a struggle for me to confront this now in recovery and I don't know how it is for you, but I really wish you the best on your road to healing! <3",
          "created_utc": 1570809922.0
        }
      ]
    },
    {
      "id": "f3fbf93",
      "author": "montymm",
      "body": "This is me. How do u eat more? I really fucking hate new foods :(",
      "created_utc": 1570894133.0,
      "score": 1,
      "context": [
        {
          "id": "f3bf7s0",
          "author": "Funderwear420",
          "body": "I thought I was a super picky eater until I made a list of food I like a couple weeks back and it was 19 items. I didn't even know arfid existed because people only talk about ana/mia. I really wonder how many people are orthorexic without knowing.",
          "created_utc": 1570808867.0
        }
      ]
    },
    {
      "id": "f3bowaj",
      "author": "wishfulmelody",
      "body": "Oh gosh, that's it! I somehow always told myself when I got close to what I percieved as the \"danger zone\" that \"I'm probably fine and just haven't eaten enough\" which often led me to eat better for some time, but I should have thought more about why I had restricted in the first place and why it kept happening every now and then (and especially in times of stress)... \n\nThank you so much, and I wish you the best <3",
      "created_utc": 1570814147.0,
      "score": 3,
      "context": [
        {
          "id": "f3bgst9",
          "author": "wishfulmelody",
          "body": "I have had an eating disorder for +10 years but it wasn't until recently I truly realized that I had one and began treatment, and it was probably because I had periods (sometimes year long periods) where I didn't restrict at all...so it happens. \n\nIt's been a bit of a struggle for me to confront this now in recovery and I don't know how it is for you, but I really wish you the best on your road to healing! <3",
          "created_utc": 1570809922.0
        },
        {
          "id": "f3bi73a",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1570810850.0
        }
      ]
    }
  ]
}