{
  "id": "dke70g",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1571541468.0,
  "title": "Request: I’m new and scared and just tried to post this",
  "selftext": "My girlfriend was going to kill herself today because her healthcare won’t cover eating disorder rehab and I don’t know what to do\n\nShe wasn’t answering her phone so I went over and let myself in.  She was asleep in bed so I woke her up and she told me she took 5mg of ativan and 4 beers and was just going to sleep all day.  I found a 5 page suicide note detailing her struggle to get into a bulimia program and hoping her death would change the system.  She has been trying for over a year to get into a residential program on Medicare and nobody will take her without like 10k to 30k up front.  I snooped around a little and found all her blankets and pillows in an empty closet with a noose hanging from the door.  She is breathing fine and just sleeping over the pills right now.  I’m probably going to take her to the hospital later but this has happened before and they’ll hold her for a week then let her go and say they can’t help with getting her eating disorder treatment.  I have no idea what to do.  Healthcare is fucked.  I’m in Massachusetts.  I tried to contact Elizabeth Warren directly to no avail.  I am at a loss.  I can be with her until Tuesday to make sure she doesn’t make an attempt but after that I have to go back to work.  I don’t know.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dke70g/request_im_new_and_scared_and_just_tried_to_post/",
  "score": 52,
  "num_comments": 9,
  "comments": [
    {
      "id": "f4f6scj",
      "author": "covhr",
      "body": "you say you're in Massachusetts and mentioned Medicare, but I think you meant Medicaid (Mass Health - the program for people with very few financial resources). Not sure where in Massachusetts you're from, but Mass Health SHOULD cover intensive treatment at Walden Behavioral Health. \n\nSee this link for details on what providers are available:\n\nhttps://www.masspartnership.com/",
      "created_utc": 1571567182.0,
      "score": 17,
      "context": []
    },
    {
      "id": "f4gajyo",
      "author": "CrystalizedCage",
      "body": "I’m so sorry you’re going through this together. Bulimia sucks. Getting into a treatment program sucks. I wish you all the luck. I hope she gets help. She deserves it. Her death won’t change the system but if she lives to tell her story of suffering- that will change the system. \n\nTell her that I love her for exactly who she is. I am a fellow ED sufferer who spent a lot of my life being invalidated because I didn’t nearly fit into a diagnosis box for the doctors to check off. \n\nYou matter. She matters. Life gets better once our brains stop trying to kill us.",
      "created_utc": 1571579132.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f4dh8l3",
      "author": "Carranbieri",
      "body": "May I ask what kind of eating disorder she has? That is important when it comes to treating it.\nFor now, try the following \n1. Keep an eye on her and offer any support you can.\n2. There are suicide prevention hotlines - they may know more about possible treatments, it might be worth calling them.\n3. There are self-helping groups, that can help a lot! If there aren't any in your area, there will be some online.\n4. For eating disorders what might help is DBT - dialectic behavioral therapy. Look for books by Marsha Linehan. There are worksheets as well as explanations. \n5. Consider asking friends and relatives for helping with covering the costs. Another option is to directly contact psychologists in your area, ask for a discount or alternatives. They are people as well, and I'm sure you'll find someone willing to help a dying girl! I know it's a terrible feeling, but surely preferable to suicide.\n6. PM me, if there's anything I can do to help.\n\nBest of wishes to you, much love and strength to both you as well as your girlfriend!",
      "created_utc": 1571542599.0,
      "score": 8,
      "context": []
    },
    {
      "id": "f4ieper",
      "author": "Nikita_Saks",
      "body": "Hi there,\n\nI am a psychiatric nurse and a psych nurse practitioner student in Massachusetts. I am really sorry about what you are going through. I am extremely concerned about your girlfriend's safety. She really needs inpatient level of care because she is suicidal and making preparations to act (e.g. suicide note, noose in closet) AND taking action (5mg Ativan and 4 beers could be a lethal combo, keep monitoring her breathing). \n\nAt this point, residential treatment is not the best for your girlfriend. Please take her to an ER or call 911. Walden Behavioral Care in Waltham has an inpatient eating disorder unit as well as an inpatient psychiatric unit. The ER can help coordinate transfer to Walden. [https://www.waldeneatingdisorders.com/locations/massachusetts-locations/inpatient/](https://www.waldeneatingdisorders.com/locations/massachusetts-locations/inpatient/)\n\nAll the best to you and your girlfriend.\n\nEdit: grammar",
      "created_utc": 1571603048.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f4g748z",
      "author": "48anon",
      "body": "Look at Project Heal for grants and payment plans. And there is a link at the bottom to send a complaint about insurance. One of the girls that started a chapter had to fight insurance for a couple of years. It’s exhausting. But sometimes persistence gets noticed. Here is the link [Project Heal](https://www.theprojectheal.org/treatment-access-program-1)",
      "created_utc": 1571578207.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f4dnejd",
      "author": "None",
      "body": "I know of a treatment center in Birmingham, Alabama that really helped me with my ED. I know you said you’re in Massachusetts but I met people there from DC and Florida. They have a house where she can live while she goes through treatment. It’s called ACED, or A Center for Eating Disorders. It’s definitely worth looking into, they really helped me. I can’t really say how much it is because I didn’t pay for it so I don’t know. I’m so sorry your girlfriend is going through such a terrible time. I really hope she can get the help she needs.",
      "created_utc": 1571544942.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f4gvb40",
      "author": "annielovesbacon",
      "body": "There may be private eating disorder treatment clinics that give “scholarships” (for lack of a better word) — financial assistance for people like your girlfriend who need care but can’t afford it. I’m sorry I’m not familiar with any, but it’s definitely worth looking into.",
      "created_utc": 1571585225.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f4i3sha",
      "author": "MaryContrary26",
      "body": "Yes, call one of the private agencies and ask for a scholarship. My friend just got a full scholarship. Not uncommon.",
      "created_utc": 1571599727.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f4id4pg",
      "author": "Nikita_Saks",
      "body": "Unfortunately in MA, Medicare does not cover ED residential or partial levels of care. It is really messed up.",
      "created_utc": 1571602511.0,
      "score": 2,
      "context": [
        {
          "id": "f4f6scj",
          "author": "covhr",
          "body": "you say you're in Massachusetts and mentioned Medicare, but I think you meant Medicaid (Mass Health - the program for people with very few financial resources). Not sure where in Massachusetts you're from, but Mass Health SHOULD cover intensive treatment at Walden Behavioral Health. \n\nSee this link for details on what providers are available:\n\nhttps://www.masspartnership.com/",
          "created_utc": 1571567182.0
        }
      ]
    }
  ]
}