{
  "id": "dls2lg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1571794066.0,
  "title": "Request: How can I stop being so focused on what my boyfriend eats?",
  "selftext": "Ive been with my boyfriend for about a year and I’ve been recovering on and off from an ED for about three years. I recently had a pretty ugly relapse and now I can’t help but be so focused on what my boyfriend has eaten and make sure I eat less than he does. The problem is my boyfriend is naturally very thin, and has days where he eats less than others. He has no history of an eating disorder and eats to his hunger cues. I am jealous that he is able to do that and wish I could be the same way. However I am not there yet and still have a very distorted relationship with food. On his days where he simply isn’t as hungry as others how do I stop myself from feeling jealous and feeling like I also should eat less even if I’m still hungry? I feel guilty for feeling this way about him and I never want to put that burden on him so I haven’t really talked to him about it because I know it isn’t his fault for not being hungry. I really want to fix this because I’m scared it’s going to ruin my relationship",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dls2lg/request_how_can_i_stop_being_so_focused_on_what/",
  "score": 43,
  "num_comments": 3,
  "comments": [
    {
      "id": "f4uls2w",
      "author": "nooorecess",
      "body": "ah god i'm in the exact same boat. this is one of the toughest parts of the ED for me, especially because i'm prone to becoming irritable and snappy toward people when i'm hungry or feeling food-related anxiety, and i can't help feeling resentful sometimes when my bf or whoever i'm with eats less than me (which either makes me feel guilt for eating more, or cheated of getting enough food because i think i need to stop eating when they do.)\n\ni know this comes from the ED behaviours being so normalized in my own brain that i falsely attribute them to other people's actions - it's hard to believe anyone's ever \"not hungry\" or feeling sick etc; i just automatically assume they are purposely trying to eat less than me as an act of hostility when really they are just doing what's normal for them and have no idea what's going on in my anxious mind lol.\n\nanyway wigglytuffest is right, the meal plan enforcement is what i've been doing and it does take practice but i can tell it's getting better. it also helps that i'm lucky enough to have a supportive partner who is in the loop with my treatment plan so he doesn't question when i pull out snacks at odd hours or whatever. if you feel comfortable discussing this stuff with your boyfriend i highly recommend just getting it all out in the open. i find just talking and joking casually about my weird \"prescribed snacking\" makes it not feel so weird or shameful. so much of eating disorder behaviours thrive in secrecy so i'm finding the more i can just be honest about it, the less power it has over me",
      "created_utc": 1571816786.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f4wzzyj",
      "author": "scouttheog",
      "body": "I agree with the other comments that a meal plan can be helpful in the beginning, but over time you shouldn't need it. It can become your new safe thing: It's okay to eat, but ONLY if it's at the approved time, or the approved amount, etc. At that point it's holding you back. So watch out for that as you progress. The food obsession will go away naturally as your body is no longer in calorie deficit, so if you focus on your own nutrition for a while (very difficult, I know) it will become easier and easier to ignore your boyfriends food habits",
      "created_utc": 1571861251.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f4ye5zt",
      "author": "paradoxicalconundrum",
      "body": "I think the meal plan idea is a good technical solution, but from the emotional perspective I think you should try to put your mind towards your own normalities (being the way you process food/when you eat/your relationship with food) and try to remind yourself that his normalities and bodily functions are probably very different. We are all very different in the way we consume foods and the way we feel, so it’s only natural that your partner may have different eating patterns and feelings about food than you do. It’s difficult dealing with a bad relationship with food, and it’s easy to feel isolated around and envious of people who don’t really have to worry about that. If you feel like he would be receptive to a conversation about it then I’d say go for it so you’re being open with him, maybe just let him know you really don’t want him to feel guilty and things of that nature.",
      "created_utc": 1571875160.0,
      "score": 2,
      "context": []
    }
  ]
}