{
  "id": "dmhkpq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1571929049.0,
  "title": "Request: Do other people think they’re faking an ED?",
  "selftext": "Hi everyone, I’ll make it short: I often feel like I’m faking my eating disorder and this thought is making me feel like an horrible person. I also have BPD and other issues, I talked to my therapist about this matter but she always reassure me saying that my problems are real. But there are some periods in which I’m not obsessed with food, I do not restrict nor I care about the calories or everything else I’d think/do normally. I always alternate periods of obsession and IDGAF. What does that mean? Omg I feel absolutely terrible when I’m able to eat like a normal person and then thinking “I actually have an ED” because it feels so...fake? So I don’t know, anyone else feels like this? It would be so encouraging knowing that I’m not alone.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dmhkpq/request_do_other_people_think_theyre_faking_an_ed/",
  "score": 122,
  "num_comments": 26,
  "comments": [
    {
      "id": "f50s1eu",
      "author": "lolaecho",
      "body": "This is very normal and part of the ED. It sounds counter intuitive, but thinking that you don't have an ED can make your restrictive/purging behaviours worse as you may feel you have something to prove as you aren't \"fake\".  \n\nYou are definitely not alone so don't worry about that aspect!",
      "created_utc": 1571932011.0,
      "score": 32,
      "context": []
    },
    {
      "id": "f50o1rw",
      "author": "None",
      "body": "I feel like this, too. Whenever I manage to eat a \"bad\" food, or more than I usually do, I just end up feeling like I'm being dramatic and faking my issue. I've seen others saying they feel similarly as well, so we're not alone in this.",
      "created_utc": 1571930324.0,
      "score": 22,
      "context": []
    },
    {
      "id": "f524xhg",
      "author": "Aiiga",
      "body": "I have some days when I eat normally and I'm like 'wow, seems like I have everything under control. No ED, I'm just a stupid little drama queen who wants to be quirky.' And then my weight skyrockets the same evening and following morning so I start restricing. Even when I do restrict I'm constantly going back and forth between 'oh shit, it's bad, I have a problem, I need help, I'm scared' and 'I'm fat, there is no ED, I just don't have enough control to lose weight'. It just feels so shitty",
      "created_utc": 1571947282.0,
      "score": 19,
      "context": []
    },
    {
      "id": "f50uik3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1571933066.0,
      "score": 10,
      "context": []
    },
    {
      "id": "f5119lv",
      "author": "AwkwardTeen96",
      "body": "Absolutely same here.",
      "created_utc": 1571935839.0,
      "score": 8,
      "context": []
    },
    {
      "id": "f512717",
      "author": "puppymartin",
      "body": "Definitely not alone. I do this too.",
      "created_utc": 1571936193.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f5350ns",
      "author": "lxverbxd",
      "body": "I feel like I am all the time. It was so sensationalized. It's like depression and anxiety. I'm not sure if I actually have those or if I fake it because that's what everyone my age does. Same thing with bipolar. I'm the only one in my family not diagnosed. I'm scared to tell my therapist if I'm having mood swings because, yet again, im not sure if it's actually that or if im just saying that cause that's what everyone says.\n\nLike yeah, drawing attention to mental health is a big thing, but if I have something I'll honestly never know because I'm not sure if that's really me or if I'm just saying/doing something because that's what society expects",
      "created_utc": 1571956348.0,
      "score": 8,
      "context": []
    },
    {
      "id": "f52bzpt",
      "author": "nooorecess",
      "body": "i have the same thing and did hear that it's common. i've wondered if maybe it's part of the \"imposter syndrome\" that can accompany self confidence issues - im constantly questioning my own authenticity or my \"right\" to be in certain spaces or getting whatever kinds of attention. these traits/thought patterns are probably partly what make someone vulnerable to ED in the first place, i imagine\n\nand as others have mentioned, i do think it can also be a way of avoiding fully committing to recovery when you're ambivalent about it. i didn't take my problem seriously for many years because in the back of my mind i was assuming \"this isn't a real problem, you could stop any time you wanted.\" it was only when my disorder had basically fully ruined my life and i truly wanted to stop that i realized i was actually in very deep and needed serious help\n\nanother random thought, not sure about your sex OP but i think that in general women can tend to minimize/dismiss our health concerns even in our own minds because we've historically had a harder time being taken seriously by medical professionals. so there is also that ¯\\ _(ツ)_/¯",
      "created_utc": 1571949028.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f53p3fq",
      "author": "williamson6195",
      "body": "I think thinking i was faking it made things worse for me to be absolutely honest. I didn’t think it was “that bad” with what shape I was in, sometimes still dont. Your struggles are absolutely real and valid tho",
      "created_utc": 1571962312.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f541ar4",
      "author": "bflowry",
      "body": "Having an eating disorder is not solely based on not being able to eat “normally.” There are a myriad of other factors at play. Give yourself grace—please remember that recovery fluctuates; recovery ebbs and flows between highs and lows.",
      "created_utc": 1571968627.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5460eg",
      "author": "stevieisbored",
      "body": "I have imposter syndrome in literally every area of my life. Nothing I do is real. Evetything is fake. Who am I? Probably a big piece of shit. \n\nBut like, no one else thinks I'm a piece of shit so they've obviously been taken in by my lies. Ahhhhhhhh. Am I even good enough to have imposter syndrome or am I just in denial about being shitty? All fun questions I ask myself at work and at home and all the time.",
      "created_utc": 1571972089.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f54avve",
      "author": "schoolishard18",
      "body": "I have felt like I have faked each one of my diagnosis. I still question my ADHD diagnosis even though it has been confirmed by 2 psychiatrists and a therapist that specializes in ADHD. I questioned my anxiety/panic disorder until I was having a full blown panic attack and ended up calling an ambulance because I thought I was dying. I questioned my depression until I was hospitalized for a few nights in the psychiatric unit. I now have 2 counsellors working together to try to get me into a proper inpatient treatment facility for my ED yet I still feel like I’m faking my ED and don’t get why they are trying so hard to get me into a clinic. \n\nI find that because I feel like I am faking this disorder is more harmful because I’m trying to prove that I have one by trying to make myself as sick as possible.",
      "created_utc": 1571976109.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f54h2ry",
      "author": "dirtyhip",
      "body": "I’m so happy you posted this because I literally feel the EXACT same way and I’m going to bring this up in therapy now that you’ve sort of validated it so thank you for this.",
      "created_utc": 1571982093.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f54n5hg",
      "author": "None",
      "body": "It can fluctuate! Sometimes I feel fit as a fiddle. Other days, not so much. Trust your body. You aren’t faking it to get attention. Listen to what you need.",
      "created_utc": 1571987043.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f58hdxt",
      "author": "bullardberry",
      "body": "I feel exactly the same. I constantly think I’m not “sick enough”, or that if I tell people about my ED they won’t believe me. I’m still in the early stages of therapy, and it feels like many sessions this comes up and I am asking for validation that I deserve help and for her to reassure me that I do gave an ED. \nI wish I knew what more to say other than you are not alone.",
      "created_utc": 1572056216.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5d8cng",
      "author": "tallulahtallulah",
      "body": "I wonder if it's a BPD trait as well? I feel like I have periods of disordered eating where I'll be absolutely obsessed for awhile but then once my mind shifts into a new obsession I relax on it quite a bit or don't think much on it. It's usually triggered by a non intentional weight loss and then becomes intentional almost in a way where I want to see how far I can push it? Sometimes I think with BPD it's another form of self harm. I've recently quit drinking and now I'm obsessed with how little I can eat? I wonder sometimes why my brain is so intent on hurting me. \nBut I also am always wondering 'am I doing this for attention? Am I just pretending?'\n\n....and that all sounds absolutely insane. But I really needed to get it out somewhere and I am waiting to get into my psychiatrist. So please don't judge me to harshly.",
      "created_utc": 1572149982.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5omcqf",
      "author": "None",
      "body": "Totally feel you. I had the same imposter syndrome feeling like I didn’t belong in law school even though I had a good LSAT and good grades I worked my ass off for. I’ve also felt the same about my on and off alcohol struggles. It is real and you deserve support, love and attention no matter what your eating is like atm.",
      "created_utc": 1572322509.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f52qidz",
      "author": "Jaefiz",
      "body": "Listen I've been (5.3) 188lbs and I've been 90lbs, and everything obviously in between. Right now I'm around 120lbs, but it honestly doesn't matter what weight you're at and no matter how much you weigh. You're obviously going through something. It's always my goal to get back to my lw but just because I'm not underweight doesn't mean I don't have a problem.",
      "created_utc": 1571952462.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f85y7nz",
      "author": "RagingPython",
      "body": "Oh my god. Yes. Except for me, it's not just with the ED I feel like I’ve been developing, it’s for all my mental health problems. Even for some of my physical ones. I’m always feeling like it’s somehow my fault that I’m depressed, that I let myself develop an ED, that I’m autistic, or that I’m so anxious, and even that I suffer from CFS. It feels like I’m faking it, and making it happen. But I’m not, I know what.\n\nI can wake up in the morning, unable to even get up without spending over an hour lying in bed feeling awful, lacking in all motivation, unable to find a reason to get up, with so much tiredness and fatigue that everything hurts and I can barely think, while desperately anxious that everyone hates me and it’s all my fault, hearing the voice of the ED I let myself develop calling at me to come back and listen to it, and it’ll still feel like I’m faking it all. But I don’t know why I feel like it. I don’t want to have all these problems, and if I could I’d make them go away, but they don’t. I can’t stop them, just distract myself from them, because they are real.\n\nBut it doesn’t feel like they are, it feels like I’m faking them. I’m really glad I’m not the only one to have this.",
      "created_utc": 1574285813.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f52b37e",
      "author": "None",
      "body": "This is because EDs are egosyntonic, meaning the disorder aligns with your core values and identity so it’s really hard to see that you have a problem. It’s why denial and ambivalence toward recovery is a issue with seeking treatment as well. It normalizes your behavior for you in your mind so when you have a good day, you can frame it as “I don’t have a problem, clearly, I am eating right now.” It’s also hard bc we live in a disordered society which values weight loss and discipline through dieting. Hard to find someone who ISNT on a diet so it’s very easy to normalize disordered behavior.",
      "created_utc": 1571948834.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f5ale99",
      "author": "None",
      "body": "A- why are you attacking me like this\nB- but what if I actually am faking it and it’s just an extreme diet?",
      "created_utc": 1572109622.0,
      "score": 5,
      "context": [
        {
          "id": "f50s1eu",
          "author": "lolaecho",
          "body": "This is very normal and part of the ED. It sounds counter intuitive, but thinking that you don't have an ED can make your restrictive/purging behaviours worse as you may feel you have something to prove as you aren't \"fake\".  \n\nYou are definitely not alone so don't worry about that aspect!",
          "created_utc": 1571932011.0
        }
      ]
    },
    {
      "id": "f50uj6m",
      "author": "I-Am-Dad-Bot",
      "body": " Hi failing, I'm Dad!",
      "created_utc": 1571933074.0,
      "score": -4,
      "context": [
        {
          "id": "f50uik3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1571933066.0
        }
      ]
    },
    {
      "id": "f5d7eo2",
      "author": "tallulahtallulah",
      "body": "Thank you for mentioning the 'right' to things. I struggle with feeling like a faker because I don't feel like I have the right to 'claim' a struggle because I believe someone else has it much worse and I would somehow be taking away from them? I do this with many things and it has heeded me in getting help for a few different things but it's a very hard idea to work past in your brain!",
      "created_utc": 1572149595.0,
      "score": 3,
      "context": [
        {
          "id": "f52bzpt",
          "author": "nooorecess",
          "body": "i have the same thing and did hear that it's common. i've wondered if maybe it's part of the \"imposter syndrome\" that can accompany self confidence issues - im constantly questioning my own authenticity or my \"right\" to be in certain spaces or getting whatever kinds of attention. these traits/thought patterns are probably partly what make someone vulnerable to ED in the first place, i imagine\n\nand as others have mentioned, i do think it can also be a way of avoiding fully committing to recovery when you're ambivalent about it. i didn't take my problem seriously for many years because in the back of my mind i was assuming \"this isn't a real problem, you could stop any time you wanted.\" it was only when my disorder had basically fully ruined my life and i truly wanted to stop that i realized i was actually in very deep and needed serious help\n\nanother random thought, not sure about your sex OP but i think that in general women can tend to minimize/dismiss our health concerns even in our own minds because we've historically had a harder time being taken seriously by medical professionals. so there is also that ¯\\ _(ツ)_/¯",
          "created_utc": 1571949028.0
        }
      ]
    },
    {
      "id": "f85ypkm",
      "author": "RagingPython",
      "body": "Jesus this is so relatable. I’ve never felt it quite as far as you, to the point of hospital involvement, but that’s only because I can’t ever involve a hospital because I have to hide everything from my family.\n\nEven the last bit, I’m trying not to, but especially whenever my depression is worse, I’m constantly fighting this desire to return to the ED-behaviours I’ve been trying to force myself to not have for the last week.",
      "created_utc": 1574286119.0,
      "score": 1,
      "context": [
        {
          "id": "f54avve",
          "author": "schoolishard18",
          "body": "I have felt like I have faked each one of my diagnosis. I still question my ADHD diagnosis even though it has been confirmed by 2 psychiatrists and a therapist that specializes in ADHD. I questioned my anxiety/panic disorder until I was having a full blown panic attack and ended up calling an ambulance because I thought I was dying. I questioned my depression until I was hospitalized for a few nights in the psychiatric unit. I now have 2 counsellors working together to try to get me into a proper inpatient treatment facility for my ED yet I still feel like I’m faking my ED and don’t get why they are trying so hard to get me into a clinic. \n\nI find that because I feel like I am faking this disorder is more harmful because I’m trying to prove that I have one by trying to make myself as sick as possible.",
          "created_utc": 1571976109.0
        }
      ]
    },
    {
      "id": "f54npep",
      "author": "flowersaregrowin",
      "body": "❤️",
      "created_utc": 1571987420.0,
      "score": 2,
      "context": [
        {
          "id": "f54h2ry",
          "author": "dirtyhip",
          "body": "I’m so happy you posted this because I literally feel the EXACT same way and I’m going to bring this up in therapy now that you’ve sort of validated it so thank you for this.",
          "created_utc": 1571982093.0
        }
      ]
    },
    {
      "id": "f5355jw",
      "author": "lxverbxd",
      "body": "Dad bot, not cool",
      "created_utc": 1571956400.0,
      "score": 5,
      "context": [
        {
          "id": "f50uik3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1571933066.0
        },
        {
          "id": "f50uj6m",
          "author": "I-Am-Dad-Bot",
          "body": " Hi failing, I'm Dad!",
          "created_utc": 1571933074.0
        }
      ]
    },
    {
      "id": "f85yccm",
      "author": "RagingPython",
      "body": "Oh god, now did this happen? More importantly, how did it get -5 points? I don’t even see a downvote button on comments in this sub.",
      "created_utc": 1574285891.0,
      "score": 1,
      "context": [
        {
          "id": "f50uik3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1571933066.0
        },
        {
          "id": "f50uj6m",
          "author": "I-Am-Dad-Bot",
          "body": " Hi failing, I'm Dad!",
          "created_utc": 1571933074.0
        }
      ]
    }
  ]
}