{
  "id": "dmva69",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1571997926.0,
  "title": "Request: Mom doesn't acknowledge my recovery efforts and enables my ED.",
  "selftext": "Request: Mom doesn't acknowledge my recovery efforts and enables my ED. \n\nHello, I hope this is allowed here. I am currently (20F) and have struggled with an ED since I was 13. I was initially diagnosed with Anorexia Nervosa Restrictive Subtype but last year began abusing laxatives and diuretics so I am diagnosed as 'Purging Subtype.' I went through a six month period of severe B/P behaviors while at my lowest weight ever. Basically, I would fast all week, than plan a massive binge, than make myself purge all night. And repeated every. single. week. I was so miserable and so food obsessed. I would cook ridiculous meals like a buffet and eat until I would nearly vomit, I was torturing myself. In July, I began making some recovery efforts. Returned to my therapist, had to get stomach surgery from the damage my purging had done, and began attempting to eat more regularly. First just a solid, non restricted meal once a day, than twice, and now three times per day. My mother has been incredibly triggering and grows more angry with me at any efforts I take to further my independence. My grades and gpa have greatly improved, and as a foodie at heart, i am not only able to cook meals but portion them and eat. I have become much better at not asking for reassurance and instead assuring myself that i need to eat. My parents work a lot so I log my food via photography which i send to my best friend or therapist for support, and i even make efforts to bring snacks such as some muffins i bake, or a smoothie to school. I have deleted my calorie counters but i am not really able to eat at restaurants yet, as i dont feel mentally ready. \n\nMy mother seems to miss my former B/P behaviors. I went through a really intense period of binging 10000+ cals per day, to the point where in july i needed hospitalization and as i mentioned earlier, a surgery due to severe bowel impaction. Sometimes, she implies that she misses these behaviors. I used to compare what I ate to her and refused to eat alone or while she worked, meaning i would wait to have dinner with her at 9 pm, usually fainting in the process or having a B/P session. She often puts down what I eat, as her and I have different likes/dislikes. I need wheat bread for my GI issues, and i tend to eat a lot of dark meat chicken which she claims is \"fattening\" which is just so triggering. I am usually hungry at much different times of day than her, like she wont eat til 1 pm where as I make breakfast at 8 am as i feel i really need a schedule. This evening for dinner we were ready to sit and eat and she said she was also going to have a bit of smoked salmon with her meal (we made lasagna). I told her i wasn't really in the mood for that and id pass. she said i NEEDED to have some. I said, \"i dont want any though. i dont make you eat foods you dont want to eat.\" for example, she eats fish for dinner a few nights a week which im allergic to. i eat oats with peanut butter all the time which shes allergic to. she then told me she misses the old days when id make elaborate platters and host big dinners with the neighbors. i said \"those were binging and purging sessions. id wake up at 4 am, go for a run, than center my entire day around binging and purging. it was so painful. i dont miss any of that. i was going through a lot of pain.\" apparently she sees those meals as lovely family time even though she saw how bad itd get. id throw up at the table. i was feeling tortured in my own mind. she also makes fun of my body. i wore a sports bra today and she said i looked disgusting and skeletal. i said \"im practicing body confidence. it was really hard to put this on. i was trying to feel more confident in myself instead of covering my body since its changed.\" im not at my lowest weight anymore and trying to accept change. i really dont know what to do. i have mt friends and therapist in my corner encouraging me, but she is so toxic to my recovery. can anyone give me some advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dmva69/request_mom_doesnt_acknowledge_my_recovery/",
  "score": 65,
  "num_comments": 11,
  "comments": [
    {
      "id": "f5598ru",
      "author": "saltinado",
      "body": "I'm so sorry, it sounds like she has some body issues of her own. That doesn't excuse her behavior though. I had much more mild issues, and I still needed mountains of support to get through. If there's any way for you to move out, I wouldn't blame you. Wear your sports bra and feel good about it! I promise you don't look disgusting or skeletal.",
      "created_utc": 1572002886.0,
      "score": 24,
      "context": []
    },
    {
      "id": "f55d71j",
      "author": "stevieisbored",
      "body": "I wonder if it would be possible to have a group session with your parents and therapists. It probably sounds super scary but maybe it can help her see the reality of your situation. \n\nIt sounds like you're doing a wonderful job in recovery so far - keep up the good work! I hope your mental health continues to improve and that your mom can work through her own hangups and start supporting you on your journey.",
      "created_utc": 1572005226.0,
      "score": 15,
      "context": []
    },
    {
      "id": "f55nwux",
      "author": "SayHiToHowie",
      "body": "> but she is so toxic to my recovery. can anyone give me some advice?\n\nThere is one answer and one answer only, move out.  Take control of your life. \n\nGet a job if you have to, many people myself included worked 25+ hours per week in addition to going to college full time and took out student loans that took years to pay back.  But we were able to live as adults while in college and support ourselves.",
      "created_utc": 1572010808.0,
      "score": 13,
      "context": []
    },
    {
      "id": "f55appr",
      "author": "makeupyourworld",
      "body": "OP here. edit that im allergic to shellfish not salmon, i just did not want fishy lasagna",
      "created_utc": 1572003777.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f55wgz6",
      "author": "Joy_BBSolution",
      "body": "There is a 12-step fellowship for the family and friends of people with eating disorders. It’s called O-Anon. Even an Al-Anon meeting would help.",
      "created_utc": 1572014809.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5626gr",
      "author": "makeupyourworld",
      "body": "My mom has BED I believe. She has always been very overweight and tends to binge in secret when she fees sad. In the past she said, \"she ate for two,\" to try amd encourage me to eat since I'm emaciated. I'm like, nobody forces you to binge just like nobody has ever forced me to have anorexia. They are their own seperate entities and illnesses. She refuses to seek counseling and refuses to accept any mental health diagnoses, she HATES my therapist since my therapist believes she is abusive. If it were up to her, I'd see a different therapist but luckily I can afford my therapist out of pocket. Personally, I do not believe I am well enough to work yet. I am still s very underweight BMI and get tired pretty easily, especially considering my job is with kids and I wouldn't feel responsible enough to be the best caretaker until I'm further along",
      "created_utc": 1572017399.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f55xov6",
      "author": "scouttheog",
      "body": "I think it would help if your mother also went to therapy. Seems like she has a pretty skewed view and maybe some disordered behavior herself. You said you threw up at the table and she considered it a nice family meal. You were hospitalized and she still thinks it's okay to comment on your appearance and food. These are not normal or acceptable behaviors when your kid has an eating disorder. Even if she thinks it's helpful, i.e \"if I tell her shes too thin she will want to gain\" it is damaging and you would both benefit from her going to therapy and learning what is helpful and good.",
      "created_utc": 1572015392.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f5660g0",
      "author": "SayHiToHowie",
      "body": "If you are too tired to work with kids, I would not suggest you get a job with kids, depending on the age of the children those are physically strenuous jobs and from what you wrote you aren't in the physical shape to do them.\n\nYou could work at a desk job, like a call center or work at the checkout desk of a library, those are just 2 examples.  \n\nIf you aren't going to work, take out student loans and use that money to pay to live on your own.\n\nIf you insist on living at home, then you are going to have to find a way to deal with your mother.  You aren't going to change her and your illness has had a negative affect on her life, you need to think about her feelings too, it is not just all about you.  She's  human too and has had her life dominated by your mental illness/medical problems.  Not a great life for her either.\n\nThe other people telling you the problem is your mother aren't helping you.  You need to get yourself out of the situation you are in.  It's doable.  Take out student loans if you aren't/can't work.  Go to school part time if you need to in order to free up energy to work.\n\nIf your mother is truly abusive, get out of her house.  That is the only answer.  Figure out a way to make it happen even if that means you have to take a LOA from school in order to work.  It's doable.  You're an adult, time to live like one.",
      "created_utc": 1572019037.0,
      "score": 0,
      "context": [
        {
          "id": "f5626gr",
          "author": "makeupyourworld",
          "body": "My mom has BED I believe. She has always been very overweight and tends to binge in secret when she fees sad. In the past she said, \"she ate for two,\" to try amd encourage me to eat since I'm emaciated. I'm like, nobody forces you to binge just like nobody has ever forced me to have anorexia. They are their own seperate entities and illnesses. She refuses to seek counseling and refuses to accept any mental health diagnoses, she HATES my therapist since my therapist believes she is abusive. If it were up to her, I'd see a different therapist but luckily I can afford my therapist out of pocket. Personally, I do not believe I am well enough to work yet. I am still s very underweight BMI and get tired pretty easily, especially considering my job is with kids and I wouldn't feel responsible enough to be the best caretaker until I'm further along",
          "created_utc": 1572017399.0
        }
      ]
    },
    {
      "id": "f566qm8",
      "author": "makeupyourworld",
      "body": "Yes. I have a full ride and my dad has agreed to pay half my rent next semester if I can keep my grades and health on a good path. He says he doesn't mind helping as long as I'm transparent w him (eating, keeping in touch a few times a week for safety, doing my best in school). And yes, I know my illness has affected her but I also was in foster care for 2 years of my life and out of her custody due to extreme circumstances of abuse. My father got mental help during the time and my mother refused to (I was only 14 at this time and in depths of ED at this time). \n\nMy degree and certifications rn are in elementary education/special education so i am technically qualified to work with kids, but i dont feel healthy enough to be at my very best for the kids i can work with. A desk job would definitely be less physically challenging for me to keep up with at this point while im still in school",
      "created_utc": 1572019314.0,
      "score": 3,
      "context": [
        {
          "id": "f5626gr",
          "author": "makeupyourworld",
          "body": "My mom has BED I believe. She has always been very overweight and tends to binge in secret when she fees sad. In the past she said, \"she ate for two,\" to try amd encourage me to eat since I'm emaciated. I'm like, nobody forces you to binge just like nobody has ever forced me to have anorexia. They are their own seperate entities and illnesses. She refuses to seek counseling and refuses to accept any mental health diagnoses, she HATES my therapist since my therapist believes she is abusive. If it were up to her, I'd see a different therapist but luckily I can afford my therapist out of pocket. Personally, I do not believe I am well enough to work yet. I am still s very underweight BMI and get tired pretty easily, especially considering my job is with kids and I wouldn't feel responsible enough to be the best caretaker until I'm further along",
          "created_utc": 1572017399.0
        },
        {
          "id": "f5660g0",
          "author": "SayHiToHowie",
          "body": "If you are too tired to work with kids, I would not suggest you get a job with kids, depending on the age of the children those are physically strenuous jobs and from what you wrote you aren't in the physical shape to do them.\n\nYou could work at a desk job, like a call center or work at the checkout desk of a library, those are just 2 examples.  \n\nIf you aren't going to work, take out student loans and use that money to pay to live on your own.\n\nIf you insist on living at home, then you are going to have to find a way to deal with your mother.  You aren't going to change her and your illness has had a negative affect on her life, you need to think about her feelings too, it is not just all about you.  She's  human too and has had her life dominated by your mental illness/medical problems.  Not a great life for her either.\n\nThe other people telling you the problem is your mother aren't helping you.  You need to get yourself out of the situation you are in.  It's doable.  Take out student loans if you aren't/can't work.  Go to school part time if you need to in order to free up energy to work.\n\nIf your mother is truly abusive, get out of her house.  That is the only answer.  Figure out a way to make it happen even if that means you have to take a LOA from school in order to work.  It's doable.  You're an adult, time to live like one.",
          "created_utc": 1572019037.0
        }
      ]
    },
    {
      "id": "f56910d",
      "author": "SayHiToHowie",
      "body": ">  I have a full ride and my dad has agreed to pay half my rent next semester if I can keep my grades and health on a good path.\n\nYou are very lucky.  Focus on how lucky you are.  I spent a couple of decades paying off student loans and wasn't able to buy a house until I was middle aged because of all of my student debt.\n\n> but I also was in foster care for 2 years of my life and out of her custody due to extreme circumstances of abuse. My father got mental help during the time and my mother refused to (I was only 14 at this time and in depths of ED at this time). \n\nThen you shouldn't be living with your mother.  You are an adult.  If you have to take a LOA from school in order to free up the energy to work, then do that.  You should get yourself out of the situation you are in if it is that bad.\n\n> My degree and certifications rn are in elementary education/special education so i am technically qualified to work with kids, \n\nJust a word of advice.  I would scrub your social media accounts if I were you, because employers and parents do look at those now.  You have written a lot about your issues with your ED and your mother on the internet in accounts that you have identifying info about yourself and even pictures of yourself, and I don't think that is a good idea.  If I were you, I would make a throwaway account to use when you discuss your ED and your mother issues.  And go through your post history and delete any posts about these personal topics that are associated with your accounts in which you have posted pictures of yourself.  There is no reason to have so much personal info about yourself linked to your photo on the internet.  \n\n> but i dont feel healthy enough to be at my very best for the kids i can work with. A desk job would definitely be less physically challenging for me to keep up with at this point while im still in school\n\nRight now the jobs are plentiful but if we go into a recession, which is getting more and more likely, that won't be true.  So I would try to get one now so that if we do go into a recession you have a chance of keeping your job if you have done a good job.  You seem very organized and pay attention to detail so you would likely be a good worker that they would want to keep if they have the ability to keep you during a recession.  If you live in Florida now is the beginning of season so there will be even more jobs available now.",
      "created_utc": 1572020177.0,
      "score": 0,
      "context": [
        {
          "id": "f5626gr",
          "author": "makeupyourworld",
          "body": "My mom has BED I believe. She has always been very overweight and tends to binge in secret when she fees sad. In the past she said, \"she ate for two,\" to try amd encourage me to eat since I'm emaciated. I'm like, nobody forces you to binge just like nobody has ever forced me to have anorexia. They are their own seperate entities and illnesses. She refuses to seek counseling and refuses to accept any mental health diagnoses, she HATES my therapist since my therapist believes she is abusive. If it were up to her, I'd see a different therapist but luckily I can afford my therapist out of pocket. Personally, I do not believe I am well enough to work yet. I am still s very underweight BMI and get tired pretty easily, especially considering my job is with kids and I wouldn't feel responsible enough to be the best caretaker until I'm further along",
          "created_utc": 1572017399.0
        },
        {
          "id": "f5660g0",
          "author": "SayHiToHowie",
          "body": "If you are too tired to work with kids, I would not suggest you get a job with kids, depending on the age of the children those are physically strenuous jobs and from what you wrote you aren't in the physical shape to do them.\n\nYou could work at a desk job, like a call center or work at the checkout desk of a library, those are just 2 examples.  \n\nIf you aren't going to work, take out student loans and use that money to pay to live on your own.\n\nIf you insist on living at home, then you are going to have to find a way to deal with your mother.  You aren't going to change her and your illness has had a negative affect on her life, you need to think about her feelings too, it is not just all about you.  She's  human too and has had her life dominated by your mental illness/medical problems.  Not a great life for her either.\n\nThe other people telling you the problem is your mother aren't helping you.  You need to get yourself out of the situation you are in.  It's doable.  Take out student loans if you aren't/can't work.  Go to school part time if you need to in order to free up energy to work.\n\nIf your mother is truly abusive, get out of her house.  That is the only answer.  Figure out a way to make it happen even if that means you have to take a LOA from school in order to work.  It's doable.  You're an adult, time to live like one.",
          "created_utc": 1572019037.0
        },
        {
          "id": "f566qm8",
          "author": "makeupyourworld",
          "body": "Yes. I have a full ride and my dad has agreed to pay half my rent next semester if I can keep my grades and health on a good path. He says he doesn't mind helping as long as I'm transparent w him (eating, keeping in touch a few times a week for safety, doing my best in school). And yes, I know my illness has affected her but I also was in foster care for 2 years of my life and out of her custody due to extreme circumstances of abuse. My father got mental help during the time and my mother refused to (I was only 14 at this time and in depths of ED at this time). \n\nMy degree and certifications rn are in elementary education/special education so i am technically qualified to work with kids, but i dont feel healthy enough to be at my very best for the kids i can work with. A desk job would definitely be less physically challenging for me to keep up with at this point while im still in school",
          "created_utc": 1572019314.0
        }
      ]
    },
    {
      "id": "f571xa7",
      "author": "tangsoodoblackbelt",
      "body": "Above is REALLY good advice!  \n\nI’m so sorry your mom isn’t being more supportive but as others have said, it seems like she has food and body issues herself.   Please don’t let her drag you down.  You are on a good path to putting the ED behind you- don’t get derailed!",
      "created_utc": 1572030436.0,
      "score": 3,
      "context": [
        {
          "id": "f5626gr",
          "author": "makeupyourworld",
          "body": "My mom has BED I believe. She has always been very overweight and tends to binge in secret when she fees sad. In the past she said, \"she ate for two,\" to try amd encourage me to eat since I'm emaciated. I'm like, nobody forces you to binge just like nobody has ever forced me to have anorexia. They are their own seperate entities and illnesses. She refuses to seek counseling and refuses to accept any mental health diagnoses, she HATES my therapist since my therapist believes she is abusive. If it were up to her, I'd see a different therapist but luckily I can afford my therapist out of pocket. Personally, I do not believe I am well enough to work yet. I am still s very underweight BMI and get tired pretty easily, especially considering my job is with kids and I wouldn't feel responsible enough to be the best caretaker until I'm further along",
          "created_utc": 1572017399.0
        },
        {
          "id": "f5660g0",
          "author": "SayHiToHowie",
          "body": "If you are too tired to work with kids, I would not suggest you get a job with kids, depending on the age of the children those are physically strenuous jobs and from what you wrote you aren't in the physical shape to do them.\n\nYou could work at a desk job, like a call center or work at the checkout desk of a library, those are just 2 examples.  \n\nIf you aren't going to work, take out student loans and use that money to pay to live on your own.\n\nIf you insist on living at home, then you are going to have to find a way to deal with your mother.  You aren't going to change her and your illness has had a negative affect on her life, you need to think about her feelings too, it is not just all about you.  She's  human too and has had her life dominated by your mental illness/medical problems.  Not a great life for her either.\n\nThe other people telling you the problem is your mother aren't helping you.  You need to get yourself out of the situation you are in.  It's doable.  Take out student loans if you aren't/can't work.  Go to school part time if you need to in order to free up energy to work.\n\nIf your mother is truly abusive, get out of her house.  That is the only answer.  Figure out a way to make it happen even if that means you have to take a LOA from school in order to work.  It's doable.  You're an adult, time to live like one.",
          "created_utc": 1572019037.0
        },
        {
          "id": "f566qm8",
          "author": "makeupyourworld",
          "body": "Yes. I have a full ride and my dad has agreed to pay half my rent next semester if I can keep my grades and health on a good path. He says he doesn't mind helping as long as I'm transparent w him (eating, keeping in touch a few times a week for safety, doing my best in school). And yes, I know my illness has affected her but I also was in foster care for 2 years of my life and out of her custody due to extreme circumstances of abuse. My father got mental help during the time and my mother refused to (I was only 14 at this time and in depths of ED at this time). \n\nMy degree and certifications rn are in elementary education/special education so i am technically qualified to work with kids, but i dont feel healthy enough to be at my very best for the kids i can work with. A desk job would definitely be less physically challenging for me to keep up with at this point while im still in school",
          "created_utc": 1572019314.0
        },
        {
          "id": "f56910d",
          "author": "SayHiToHowie",
          "body": ">  I have a full ride and my dad has agreed to pay half my rent next semester if I can keep my grades and health on a good path.\n\nYou are very lucky.  Focus on how lucky you are.  I spent a couple of decades paying off student loans and wasn't able to buy a house until I was middle aged because of all of my student debt.\n\n> but I also was in foster care for 2 years of my life and out of her custody due to extreme circumstances of abuse. My father got mental help during the time and my mother refused to (I was only 14 at this time and in depths of ED at this time). \n\nThen you shouldn't be living with your mother.  You are an adult.  If you have to take a LOA from school in order to free up the energy to work, then do that.  You should get yourself out of the situation you are in if it is that bad.\n\n> My degree and certifications rn are in elementary education/special education so i am technically qualified to work with kids, \n\nJust a word of advice.  I would scrub your social media accounts if I were you, because employers and parents do look at those now.  You have written a lot about your issues with your ED and your mother on the internet in accounts that you have identifying info about yourself and even pictures of yourself, and I don't think that is a good idea.  If I were you, I would make a throwaway account to use when you discuss your ED and your mother issues.  And go through your post history and delete any posts about these personal topics that are associated with your accounts in which you have posted pictures of yourself.  There is no reason to have so much personal info about yourself linked to your photo on the internet.  \n\n> but i dont feel healthy enough to be at my very best for the kids i can work with. A desk job would definitely be less physically challenging for me to keep up with at this point while im still in school\n\nRight now the jobs are plentiful but if we go into a recession, which is getting more and more likely, that won't be true.  So I would try to get one now so that if we do go into a recession you have a chance of keeping your job if you have done a good job.  You seem very organized and pay attention to detail so you would likely be a good worker that they would want to keep if they have the ability to keep you during a recession.  If you live in Florida now is the beginning of season so there will be even more jobs available now.",
          "created_utc": 1572020177.0
        }
      ]
    }
  ]
}