{
  "id": "donhvc",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1572341970.0,
  "title": "Request: just want to thank the community and introduce myself",
  "selftext": "Iv been lurking between a few of these reddit forums for eating disorders lately.\n\nI was going to post anonymously because I didnt particularly want to be tied to this, but I'm trying to get to a point where own what's going in with myself.\n\nIt wasnt until recently that I admitted to myself that I had a problem.  One that's been with me for years.  For the longest time I blamed being sick or that I was reacting to food badly but I got to the point where I was sick of making excuses.\n\nAfter losing a lot of weight I became obsessed with that one or two extra pounds and for years went through purging forcefully to the point where I'd eat anything unhealthy and my body would react.\n\nI didn't want to accept that I had a problem, because how could a big dude have an eating disorder?  But I came to find out through and other forums that others had the same issue and it really helped me take a first step in admitting I have a problem.  \n\nIt got so bad that I started to gain weight because it destroyed my metabolism. So much that I stopped eating for extended periods of time, made it worse, and the cycle just perpetuated itself.  I would literally have a bowl of cereal and go running until my body couldnt move for the sake of justifying food, and then still end throwing up because I hated how I felt and looked.\n\nEverything just kept mounting up, up until I stopped doing costumes entirely because I couldnt look at myself in photos.  My depression and unhealthy relationship from food got worse and worse.  \n\nSo here i am, taking the first step and admitting out loud that i have an issue, and thanking all those.who have posted with similar issues in helping me move forward from here.  \n\nTime to get healthy for the first time in a long time, and not just my food but my mind.  \n\nSorry the long rant, I guess it just needed to be put out there so I know who and what I am going forward.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/donhvc/request_just_want_to_thank_the_community_and/",
  "score": 40,
  "num_comments": 4,
  "comments": [
    {
      "id": "f5p6te4",
      "author": "Triptaker8",
      "body": "I'm glad you're here and happy/excited? for you that you've made it to the point where you can admit to yourself and to others that you have an issue. That's a big deal and it makes me smile to see that you're there! \n\nLike you said, you can focus on being in a healthier place mentally and physically now. It won't always be easy but it will be rewarding to take care of yourself for the first time in a long time. It will be a journey, and journeys come with setbacks. But as long as you work hard not to get discouraged, you will end up in a much healthier, happier place full of love for yourself and that's exactly what you deserve.\n\nThank you for sharing, it's inspiring to hear what you've gone through and where you're headed :)",
      "created_utc": 1572350805.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f5qxk4x",
      "author": "textbookbitch",
      "body": "Thank you for sharing! Lots of love. Realizing it the first step. <3",
      "created_utc": 1572384741.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f5s37lr",
      "author": "tymopa",
      "body": "Yes...it's nice to be part of a supportive community who really gets it. Congrats on your first step. I didn't get real therapy until 28 years after taking my first step. I hope you don't wait like I did thinking I could just work on controlling it once I had admitted to it. There's nothing like really getting to the bottom of that beast and understanding all of its parts. Wherever your journey takes you, best of luck.",
      "created_utc": 1572410240.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6o1ffp",
      "author": "theronincosplay343",
      "body": "Hi all, so I'm the OP and I just wanted to give an update on this.\n\nI told my friend everything and actually came forward to having a problem to someone i know, felt a lot better than I expected it to\n\nThe past two weeks have gone well, have kept down every meal including two cheat meals.  I feel physically horrible but cleaning up my diet for real and moving forward.\n\nMore updates to come.",
      "created_utc": 1573005356.0,
      "score": 1,
      "context": []
    }
  ]
}