{
  "id": "dq1xao",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1572600830.0,
  "title": "Request: Extreme Hunger recovering from Exercise Addiction",
  "selftext": "I'm recovering from using exercise as a tool to 'earn' food on a daily basis.  (Long workouts 2x/day).  I'm a 30yo male, and have been suffering on and off with exercise addiction and anorexia for the better part of 15 years.\nI'm at a normal weight for my height (middle of BMI range), and to be honest I have been using exercise as a tool for my recovery from anorexia, so I honestly have no idea what 'real' eating looks like for a person like me.\nAll I do know is I'm ravenous all the time.  Now that I'm trying to dial back on exercise (still working out daily, but just 1 session, and working on shortening it), I fear that my food consumption (or rather hunger) is accelerating, and my fear is putting back on all the weight from when I was younger and this whole spiral started.\nI know I have to change, I'm always exhausted, irritable, and  have little patience for my wife (and children), but at the same time I can't calm the voice in my head that urges me to go run off the extra snack I had in the day.\nSuppose my question(s) are:\n1) For those of you that recovered from over-exercise, does the hunger go away?\n2) What are strategies you've deployed to stop from falling in the same habits? (eg. form new routines)\n3) Any tips (or support) you could provide :)\n\nThanks",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dq1xao/request_extreme_hunger_recovering_from_exercise/",
  "score": 47,
  "num_comments": 13,
  "comments": [
    {
      "id": "f602bwf",
      "author": "Jovrat",
      "body": "I think your second point is 90% of the answer . Having to replace one routine with another helps a lot . I have been in same situation and i replaced mine with reading and listening podcast while i sip through my manually brewed coffee . ( I use to hit the gym every morning at 6 am for 1.5-2 hours irrespective of the weather . Now i hit 3 times a week for 45 minutes only ) . Also i used vacation to overcome my fear of eating food . First vacation of 1 week was scary as neither could i weigh myself everyday , i couldn’t control what i ate . Post 1 week vacation , i ended up with actually no gain at all which made me loosen up a bit with my restrictive diet . So take small steps to enjoy good things in life .",
      "created_utc": 1572601693.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f603yrj",
      "author": "covhr",
      "body": "are you in any sort of treatment? I would recommend consulting a registered dietitian who can help you with a meal plan to normalize your eating.",
      "created_utc": 1572604167.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f60o9gu",
      "author": "Kommandant45",
      "body": "1. Yes, it does go away. When I was in recovery I had to increase how much food I was eating. I was horribly underweight despite my vigorous regime when I started recovering, and honestly I was more hungry then and chose to ignore my body. As I started to eat more food more consistently, the intense hunger subsided. It took time for sure (4 months or so), but it did get better. Granted, I was still cycling, but as I gained weight, I actually got way stronger and faster. I didn't even know how much my low weight was holding me back.\n2. I'm extremely goal-oriented, and I leveraged that with the help of my therapist to focus my athletic efforts into something productive. Part of what got me to the point of anorexia was extreme adherence to my extremely low-calorie diet and drive to perform. I turned the narrative around and started saying, 'you can only get faster if you eat more so you can build more muscle and fitness'. I wasn't going to get better if I didn't gain weight and change my perspective on food.\n3. A lot of people will tell you that you have to give up exercise in recovery. Unless you're dangerously underweight or absolutely can't stop exercising for any reason like injury or sickness, you shouldn't have to back off completely. Of course, please consult a doctor or therapist on this – I'm just some guy on reddit, so if your therapist tells you to stop, then do it.\n   1. Developing a healthy relationship with everything is key though. For me, proper nutrition and nourishment is equally, if not more important than the miles I put in. Eating enough is as much a goal for me as a PR on a segment is. Making into a goal like that was critical for me. Sure, sometimes I still get stuck on eating that cookie if I didn't 'earn' it, but more often than not, lizard brain doesn't win and that cookie becomes a part of my positive goal and my own normal relationship with food.",
      "created_utc": 1572622125.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f61pcc1",
      "author": "JulietSenpai666",
      "body": "It seems everyone in the comments are pretty much covering that basics, just wanted to shout out your courage being a man suffering from an ED. Men and young men who struggle often go unheard and seeing other men open about struggling is very important. Best of luck in your recovery stay strong.",
      "created_utc": 1572643843.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f609ub7",
      "author": "VTMongoose",
      "body": "Howdy, also 31 YO formerly obese male here. Just so we're clear, the exercise addiction didn't cause the extreme hunger. The consistent calorie restriction from the anorexia did. You can keep exercising if you want, it's just that overdoing it will make you feel a lot more hungry and prolong the process. Cardio exercise always makes me hungry, even \"post recovery\". Recovery is a long process, by the way. It took me about a year to feel completely physically and mentally \"normal\" post-recovery.\n\n&#x200B;\n\nMy advice would be to shift your exercise focus. Your goal right now is to stop feeling hungry and start living normally again. Your main goals have nothing to do with exercise. It doesn't mean you should completely stop - exercise is a healthy habit you want to keep. So stop doing cardio other than maybe 1-2 sessions a week just to maintain your fitness level. Keep doing weight lifting. Weight lifting burns almost no calories but it makes you stronger and it makes you feel better. It diverts calories that would be used to build fat towards building muscle.\n\n&#x200B;\n\nYou're going to have some degree of fat rebound, but this will go away on its own in time. Your hunger will stop at some point, guaranteed. You might need to gain 30 pounds of fat, but trust me, eventually everyone hits that point where their hunger just turns off. You'll never go back to obesity unless you go back to the habits that got you into an obese state in the first place, whether it be binge eating, eating the Standard American Diet (fast food or other junk food), whatever. Eat as many whole, healthy foods as you want. You'll never \"get fat\" eating chicken, potatoes, vegetables, fruit, etc. Sure, you'll gain a relatively small amount of fat in the short term. That's exactly what the goal is - that's literally how you stop the extreme hunger.\n\n&#x200B;\n\nWithout throwing out numbers, I was a certain weight when I was obese, which ***I spent half my lifetime at,*** and I starved myself to 50% of that. I rebounded to 55.7% of my max weight about 1.5 years ago. Even eating as much as I possibly could recently (trying - and succeeding - at setting some PR's in my cycling hobby), I was only able to reach 58.5% of my maximum obese weight and my strength and energy levels were off the charts. I didn't really have much of a desire to eat more at that point. Didn't eat 100% clean, either. I would still eat out occasionally, drink beer, have a pizza, whatever. Since then been tightening up a bit, eating more protein, and I've drifted down to 56.5% of my max without even trying really. History tells me once I get much lower than about 54%, I start to feel hungry all the time, my workout quality drops and I lose fitness. So even in a former morbidly obese person, yes, the body's \"internal regulatory stuff\" works **perfectly** post-weight loss because I habitually eat whole foods and exercise now, whereas when I was obese I habitually ate high-calorie foods for pleasure and sat and played video games all the time. You can see my body likes to stay in a very, very narrow range. This is normal for regular exercisers - studies have shown our bodies' internal energy regulation and hunger cueing is superior to non-exercisers.\n\n&#x200B;\n\nAll the times during my extreme hunger rebound, the eating disorder told me I was uniquely broken in some way and that I was going to binge my way back to being obese. It was a lie. I'm just like everyone else. Watch Stephanie Buttermore's \"All In\" videos for more real-world education on this process.",
      "created_utc": 1572611024.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f609knf",
      "author": "bower105",
      "body": "When I worked as a counselor at an eating disorder residential care, some clients recovering from anorexia would go into a hyper metabolic state and they would need 3000 or 4000 calories a day just to gain one pound a week (young teens). For sure get a dietitian to help you in your recovery!",
      "created_utc": 1572610764.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f608odu",
      "author": "altmuffin",
      "body": "The hunger will pass but the obsessive ideation may not. The former poster offers sound advice in finding something to occupy your mind. Ultimately it’s the idle “what should I be doing now” moments that ensnare you. Find something (either a previous interest or search out a new one, can also be a good use of your time and mental power) to occupy yourself.",
      "created_utc": 1572609856.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f60j10l",
      "author": "None",
      "body": "Well, feels like I wrote this myself. haha So my parents are health NUTS so I started having personal trainers and nutritionist since i was 12 years old... That can't mess up a 12 year old girl right??? \\*eye roll\\*\n\nMy whole life I have gone through high weight and extremely low weight. 4 years ago I was in the best shape of my life. But I was INSANELY unhealthy. I was working out 2-3x a day. 4am, lunch, 8pm. And rarely eating. Basically eating eggs and vegetables. But not enough to sustain me at all. I looked fabulous and felt like complete shit. I might mention I was single at the time as well because I thought that was the only way I was going to find someone to want me. But I was running myself ragged and so obsessed with my routine that I was in bed by 8pm everynight and didn't do anything social. I even gave up an internship I REALLY wanted because it cut into my routine.\n\nI then met my husband and he loved me for me and I found so much worth in that, got in a life altering car accident. And have been on so many medications that i have gained weight. Not a ton but enough to notice. For the past year I have been going to therapy to deal with my disorders because I fell into a deep depression because I wasn't allowed to work out due to my recovery and so instead I was just not eating. Or I was binging and then hating myself.\n\nI am finally in a place where I can be moderate with my exercise to be healthy, and I eat to fuel my body, and sometimes indulge. I really think a lot of it was with the help of therapy realizing how mean I am to myself when I give everyone else around me allowance to be themselves and not be perfect. I hold myself to an impossible standard which sounds like you do as well. I also found a love for cooking, making food and feeding other people which in turn helps me enjoy food but also me mindful of what I am eating. I also have learned that when I am in the binge hunger feeling I have a HUGE laundry list of healthy low calorie snacks.\n\nOne other thing I did is took my work outs outside the gym. Hiking, biking, yoga classes or any group classes, just night time walks with my dog and husband. To make it more of a positive experience working out then killing myself in a gym. I still go to the gym occasionally. But making it more of a making memories experience helped it be a more positive experience for me.\n\n&#x200B;\n\nI hope any of this helps, even if it's just to let you know you aren't alone!",
      "created_utc": 1572618490.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f616cg2",
      "author": "None",
      "body": "Eating more regularly will help. When sugar levels in the blood drop, you will crave more and more. My therapist told me to avoid spacing food more than 4 hours. Each meal needs carbs too. You shouldn't restrict on food you crave but you need to portion control to make you don't overeat. 2 chocolate pieces is better than zero when you're recovering. But 2 chocolate pieces is also better than 10 as you're learning to eat normally.\n\nHave you tried meditation and/or yoga to replace some of the time spent in your exercise session? Most yoga sessions or relaxation sessions will be 10 to 15 minutes if you do them daily, and that will be some time you can take to reflect on how your body feels, what you really want to become, etc.\n\nAnd mindful eating is very important. Do not get distracted while you eat.",
      "created_utc": 1572634134.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f617nmb",
      "author": "None",
      "body": "Because of other medical reasons and lack of motivation, I’ve scaled back my training, so I do the same more or less but less intensity. And I did it gradually so your body adapts better and doesn’t have some « knee-jerk » reaction. Get rid of processed foods and eat all the fruits and veggies you want, and your normal portion of everything else.",
      "created_utc": 1572634972.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6vm3r0",
      "author": "Redhawkgirl",
      "body": "Such a brave post thank you.\n\nYour metabolism will take a while to adjust to the new less exercise amount. ED plus exercise can cause a hypermetabolic state as well. Hunger is a signal to EAT, it’s hard but listen. The body knows what you need. Probably food and rest for a while. I was training for ultramarathons while fully engaged in bulimia. I ended up not able to train or run at all but starving as my body was desperate to rebuild. Oh man I did not want to feed it because I wasn’t running!!! I get it.",
      "created_utc": 1573190648.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f60j13c",
      "author": "None",
      "body": "If you or someone you know is contemplating suicide, please do not hesitate to talk to someone.\n\n**US:**\n\nCall 1-800-273-8255 or text HOME to 741-741\n\n**Non-US:**\n\n[https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines](https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines)\n \n --- \n \n^^I ^^am ^^a ^^bot.  ^^Feedback ^^appreciated.",
      "created_utc": 1572618491.0,
      "score": 1,
      "context": [
        {
          "id": "f60j10l",
          "author": "None",
          "body": "Well, feels like I wrote this myself. haha So my parents are health NUTS so I started having personal trainers and nutritionist since i was 12 years old... That can't mess up a 12 year old girl right??? \\*eye roll\\*\n\nMy whole life I have gone through high weight and extremely low weight. 4 years ago I was in the best shape of my life. But I was INSANELY unhealthy. I was working out 2-3x a day. 4am, lunch, 8pm. And rarely eating. Basically eating eggs and vegetables. But not enough to sustain me at all. I looked fabulous and felt like complete shit. I might mention I was single at the time as well because I thought that was the only way I was going to find someone to want me. But I was running myself ragged and so obsessed with my routine that I was in bed by 8pm everynight and didn't do anything social. I even gave up an internship I REALLY wanted because it cut into my routine.\n\nI then met my husband and he loved me for me and I found so much worth in that, got in a life altering car accident. And have been on so many medications that i have gained weight. Not a ton but enough to notice. For the past year I have been going to therapy to deal with my disorders because I fell into a deep depression because I wasn't allowed to work out due to my recovery and so instead I was just not eating. Or I was binging and then hating myself.\n\nI am finally in a place where I can be moderate with my exercise to be healthy, and I eat to fuel my body, and sometimes indulge. I really think a lot of it was with the help of therapy realizing how mean I am to myself when I give everyone else around me allowance to be themselves and not be perfect. I hold myself to an impossible standard which sounds like you do as well. I also found a love for cooking, making food and feeding other people which in turn helps me enjoy food but also me mindful of what I am eating. I also have learned that when I am in the binge hunger feeling I have a HUGE laundry list of healthy low calorie snacks.\n\nOne other thing I did is took my work outs outside the gym. Hiking, biking, yoga classes or any group classes, just night time walks with my dog and husband. To make it more of a positive experience working out then killing myself in a gym. I still go to the gym occasionally. But making it more of a making memories experience helped it be a more positive experience for me.\n\n&#x200B;\n\nI hope any of this helps, even if it's just to let you know you aren't alone!",
          "created_utc": 1572618490.0
        }
      ]
    },
    {
      "id": "f61v2q1",
      "author": "TTom17",
      "body": "Hi there, \n\nThanks for your post. I am I working really hard in my recovery and phrase right now now trying to find the balance of moderation I all things but I am still having some urges to binge. Would you mind sharing some of your low cal high consumption foods you use so when i can start building my own list to have when I need a little extra help?\n\nI appreciate any help",
      "created_utc": 1572647791.0,
      "score": 1,
      "context": [
        {
          "id": "f60j10l",
          "author": "None",
          "body": "Well, feels like I wrote this myself. haha So my parents are health NUTS so I started having personal trainers and nutritionist since i was 12 years old... That can't mess up a 12 year old girl right??? \\*eye roll\\*\n\nMy whole life I have gone through high weight and extremely low weight. 4 years ago I was in the best shape of my life. But I was INSANELY unhealthy. I was working out 2-3x a day. 4am, lunch, 8pm. And rarely eating. Basically eating eggs and vegetables. But not enough to sustain me at all. I looked fabulous and felt like complete shit. I might mention I was single at the time as well because I thought that was the only way I was going to find someone to want me. But I was running myself ragged and so obsessed with my routine that I was in bed by 8pm everynight and didn't do anything social. I even gave up an internship I REALLY wanted because it cut into my routine.\n\nI then met my husband and he loved me for me and I found so much worth in that, got in a life altering car accident. And have been on so many medications that i have gained weight. Not a ton but enough to notice. For the past year I have been going to therapy to deal with my disorders because I fell into a deep depression because I wasn't allowed to work out due to my recovery and so instead I was just not eating. Or I was binging and then hating myself.\n\nI am finally in a place where I can be moderate with my exercise to be healthy, and I eat to fuel my body, and sometimes indulge. I really think a lot of it was with the help of therapy realizing how mean I am to myself when I give everyone else around me allowance to be themselves and not be perfect. I hold myself to an impossible standard which sounds like you do as well. I also found a love for cooking, making food and feeding other people which in turn helps me enjoy food but also me mindful of what I am eating. I also have learned that when I am in the binge hunger feeling I have a HUGE laundry list of healthy low calorie snacks.\n\nOne other thing I did is took my work outs outside the gym. Hiking, biking, yoga classes or any group classes, just night time walks with my dog and husband. To make it more of a positive experience working out then killing myself in a gym. I still go to the gym occasionally. But making it more of a making memories experience helped it be a more positive experience for me.\n\n&#x200B;\n\nI hope any of this helps, even if it's just to let you know you aren't alone!",
          "created_utc": 1572618490.0
        }
      ]
    }
  ]
}