{
  "id": "dqzcjg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1572781602.0,
  "title": "Request: Has anyone found that calorie counting gave them an eating disorder?",
  "selftext": " \n\nHas anyone found that calorie counting gave them an eating disorder?\n\nI never had disordered eating until I started counting calories maybe 10 years ago. I am currently overweight and struggling with my weight but the more I control/diet the more I binge and gain. Anyone broke free of this cycle?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dqzcjg/request_has_anyone_found_that_calorie_counting/",
  "score": 164,
  "num_comments": 35,
  "comments": [
    {
      "id": "f6de5hg",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1572793536.0,
      "score": 46,
      "context": []
    },
    {
      "id": "f6davuv",
      "author": "iloveujoon",
      "body": "Oh definitely. Whenever I don’t calorie count I binge excessively but when I do force myself to count calories I restrict and feel like shit constantly. It’s given me a very unhealthy view of calories and food",
      "created_utc": 1572792801.0,
      "score": 16,
      "context": []
    },
    {
      "id": "f6ezbbe",
      "author": "carotoffel",
      "body": "Yep. I was overweight when I started exercising and counting calories. I had NO idea about portion sizes and calories prior to that, I was always an overeater and had a biiiiig sweet tooth. I started eating „normal“ portions, calculated my intake with whatever I burned jogging. I lost weight, which made me happy! Then the results didn‘t come as quick as they did in the beginning (which is understandable, but was seen as failing in my diet back then). So I cut down again and increased my exercise. Again and again and again. Fast forward two years, I‘m anorexic with b/p and almost died on my birthday due to heart problems. Not fun :(",
      "created_utc": 1572809191.0,
      "score": 9,
      "context": []
    },
    {
      "id": "f6h8f4y",
      "author": "Iscariiot",
      "body": "Kinda? I technically already had one. That said, two weeks ago I downloaded an app to count calories and my eating disorder has rocketed into extreme levels since. I used to have at least two meals a day, but after seeing what this stupid app had to say I can barely manage one. Keeping my intake below 1,200 calories quickly became < 900/day. And there’s nothing I can do to stop it. I check literally every food that goes in my body to see how many calories I’ve ingested. It bothers me so much to eat anything above 300 calories at a time. I hate it so much. Earlier I avoided eating a small pretzel rod because the app told me I’d be slightly above 900 for the day. I couldn’t bring myself to do it even though I was incredibly hungry. \n\nThe only thing I seem to be able to ignore is coffee. Even if I put 2-3 teaspoons of sugar in it at a time, I can’t bring myself to add it to my daily intake. I need that one thing (or, 3-5 things. Since I drink a lot of coffee in a day.)",
      "created_utc": 1572839526.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f6e4ndo",
      "author": "aranide",
      "body": "I have type 1 diabetes and I need to count my carbs. ITs the same as counting calories, just different numbers (4 calories=1 carbs). Growing up I hated doing it, so i started doing it less and less. Until I didnt check my blood glucose either, and stopped taking my insulin to lose weight. Now I strugle to gain weigh. I've made so much damage to my body, it doesn't want to cooperate anymore. SO yeah counting calories, carbs, macro nutriment, ect, can become toxic enough to actually introduce an ED. But not counting them too can be harmfull in a way. Seek help, and find your balance.",
      "created_utc": 1572800151.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f6dhy88",
      "author": "sociallyawkweird",
      "body": "Yep!",
      "created_utc": 1572794401.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f6dndck",
      "author": "wishfulmelody",
      "body": "I'm trying to recover from being underweight at the moment (due to orthorexia) and I began counting calories to make sure to gain weight and eat enough since I've struggled a lot with hunger signals this past year, but I noticed that I've been very stressed about it since I've started.   \n\n\nSometimes I worry that I eat to little or eat too much, and since the app I'm using tracks things like saturated fats and such I've been more anxious about that as well but try to not think about it too much. (I've gotten more anxious about health things that I weren't worried about before which feels a bit ironic since I'm trying to heal myself from that.)\n\nI don't trust myself enough at the moment to stop counting, but I guess it would be good if I could try to eat more intuitively soon since it was what I did before developing orthorexia.",
      "created_utc": 1572795516.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6hn438",
      "author": "SpottedRocks",
      "body": "I think many people binge (not including bed here) because they restrict too much and/or for too long. \nThen they binge and try to restrict even more, which leads to more binging and so on.\n\nYou can try eating at maintenance for a while to see if that reduces or stops the binges.\nIf it does and you want to restrict again only reduce your calories by a very small amount and don't ever eat under your bmr.\n\nIt's possible that the counting in itself leads to disordered eating and in that case you have to stop doing it and try other things like intuitive eating.\n\nThe best option would be to get professional help that is specialized in eating disorders.\n\n(Poor calories never did anything to me, but I can't do intuitive eating. Everyone is different I guess.)",
      "created_utc": 1572856750.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6fflf1",
      "author": "judethedude1398",
      "body": "Yes, I was slightly overweight and started calorie counting and it ruined my life. I never had eating problems beforehand. Now I cannot stop thinking about food. I hate it",
      "created_utc": 1572813809.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6gtef2",
      "author": "chachainthechacha",
      "body": "YES. it made me obsessive for a while and I had an unhealthy food relationship, then it devolved into me doing a \"chew and spit\". I've stopped counting calories or weighing myself for the past few weeks, and things have gotten so much better. I should mention though that I know how to eat healthy and am familiar with calories in foods, so even when not tracking I still knew what to eat. The biggest change I've noticed is that I don't crave junk nearly as much, I can recognize hunger cues way better, and I can eat until satiety instead of until I run out of cals.",
      "created_utc": 1572830349.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6mqu67",
      "author": "Hannah_Banana_525",
      "body": "Yes. I became obsessed with having as little calories as possible in my body to lose weight. Then I just stopped eating in general. Then threw up if I binged out of loss of control. It’s a vicious horrible cycle.",
      "created_utc": 1572977113.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6nryqn",
      "author": "spark99l",
      "body": "OP here- thanks for the posts all. \n\nNow what did you do to get over this issue? Stop counting calories and just trust your gut (haha)? Will the obsession with counting calories eventually go away?",
      "created_utc": 1572998556.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6f0vpp",
      "author": "regrettospaghetto",
      "body": "HELL YES big regret now",
      "created_utc": 1572809599.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6gm6fp",
      "author": "1cecream4breakfast",
      "body": "Weight watchers gave me or enhanced my already existing BED. Not sure because I have always had some problems with food but wasn’t diagnosed until a year and a half after giving up WW.",
      "created_utc": 1572827691.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6gx7mk",
      "author": "None",
      "body": "I don’t think it caused mine. But it isn’t helpful for me at all. And I hate her some of the recovery programs I am in force it. It really turned me off from the recovery community in general, which is unfortunate. But I think there are many reasons, this just doesn’t help.",
      "created_utc": 1572832235.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6h9pqr",
      "author": "kittehkittehkitteh",
      "body": "Yup. Every time it causes me to fall back.",
      "created_utc": 1572840579.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6haoxp",
      "author": "None",
      "body": "Yes",
      "created_utc": 1572841367.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6hhkna",
      "author": "DeciduousTree",
      "body": "Yes that’s how my ED started when I was a teenager. I wanted to lose weight and then got addicted to calorie counting and eating less than 1200 calories a day. It’s been 12 years and my relationship with food still hasn’t fully recovered.",
      "created_utc": 1572848703.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6kta6f",
      "author": "cottoncandykeroppi",
      "body": "Im struggling really really bad with this right now... like im making it a competition and feel horrible seeing any caloric value",
      "created_utc": 1572920180.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6ow0rf",
      "author": "sydneyrenae7",
      "body": "I don’t think it necessarily gave me an eating disorder but it was definitely something that made me even more obsessive around food. When I first started into my eating disorder I didn’t count calories but I was super conscious of them. I didn’t even download or start weighing my food until I was like 1-2 years into my ED. I do think it can cause you to become very rigid around food and can trigger an ED. Being that rigid about calories and what’s going into your body is definitely going to cause ED behaviors to pop up in someone who’s already predisposed to having the illness. I’m a year into recovery and I’ve gotten out of the calorie counting cycle. I do still weigh my food to make sure I’m getting enough but I’m slowing trying to let that go because it’s a huge control piece of my ED",
      "created_utc": 1573037999.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6s9mmc",
      "author": "k_b_6600",
      "body": "In a way, my mom made me starts eating the usual \"weight loss\" amount when I was in 4th grade. I really became obsessed with it because I had already struggled for about 4 years earlier with body image and restricting foods ocassionally (throwing out a few things of lunch, only eating salad for dinner, skipping a birthday party)  but when my grandfather died it Triggered me further and my eating disorder went full blown. So in a way it did, because it opened me up to calorie counting at a really young age and eating way less than i should havr been at that age, which I continued with pretty religiously. It also made me obsessed with burning off the calories when i was in 4th grade.",
      "created_utc": 1573130046.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f7d5oh3",
      "author": "FIoorboards",
      "body": "Yes. About a year and a half ago I tracked my macros (carbs, fats, and proteins) in every single food item I put into my body. I used directions from a fitness website to calculate exactly how much of each macro I could eat per day to lose weight. I was succesful at losing 30 pounds quickly, however once it came to the last 10 pounds I could no longer control myself. I was eating less than what I had originally calculated. Somewhere aroubd 1200 calories a day. I would all of a sudden binge eat, then to try and compensate, I would fast for 24+ hours. Then right after the fast I would binge eat again. One thing led to another and soon I regained all of the weight back within a couple of months. Now anything I put into my mouth is calculated. I analyze the macros in every single food I eat now. Even when there is no label on the food like at a restaurant, I will still calculate in my head how much I am eating. I can no longer enjoy any type of treat like a cookie or icecream without feeling the need to fast for the next 12 hours. Every time I try to compensate through fasting or restriction, I almost always end up failing and ending up eating even more. I wish I never calcualted my food in the first place.",
      "created_utc": 1573608263.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f87c8a2",
      "author": "throwmeaway4everrr",
      "body": "Counting recently made me relapse. I had an ED in high school and early college, but that was ten years ago. Recently I started counting calories again and then today I purged for the first time in 8 years. I just couldn’t accept the number that I had to track.",
      "created_utc": 1574325629.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8b6tw5",
      "author": "TrinityLee1228",
      "body": "That’s how mine started. At first i started counting calories, it went to 800 a day... then 600... when I’d peak into 1000 I’d freak out and spiral into a panic attack and i regretted it... then one day i started staying under 400... then 100... I was obsessed with calories. I memorized the calorie count in so many foods and i can still tell you by heart how many are in an apple, a medium sized banana, and a pack of ramen, a granola bar, and the list just goes on.",
      "created_utc": 1574428877.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8om11l",
      "author": "thatchickwiththekids",
      "body": "I know I’m late but just wanted to share! I spent 8 years struggling wit anorexia and then bulimia, went through loads of recovery etc fell pregnant to twins, have two very healthy 3 three year old girls. I was recovered but like......not. Binge/purge free for 1 1/2 years. I was exercising but not overdoing it. The trainer then said I should aim to lose 3kg in 8 weeks (mind you, I did NOT need to) eat 1200 calories, track it in MyFitnessPal. I did that.....I shouldn’t have. I relapsed for 2 months. I’m just regaining control back now. I could never advise morreeeeeeeee, tracking calories leads to eating disorders and leads to relapses. It’s the control. It’s bloody shit.",
      "created_utc": 1574685523.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8sdky5",
      "author": "j_cdz",
      "body": "Once you start dieting, it's not possible to stop😭",
      "created_utc": 1574777872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8uk8aa",
      "author": "silentlymodest",
      "body": "Calorie counting honestly was the thing that set off my ED I was already in a mindset of losing weight and counting made it worse. \n\nWhile in recovery I watched alot of ED coaches on YouTube and by far my favorite has been Tabitha Farrar, She honestly helped my recovery she covers all sorts of topics from bloating, weight gain, food guilt to exercise after recovery and so much more I really do recommend watching her when your having a bit of doubt and thinking about relapse. And please stay strong 💪",
      "created_utc": 1574832217.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f90c03a",
      "author": "aprettybadbitch",
      "body": "Oh yah, there are different contributors obviously, but calorie counting is like my #1 disordered behavior that I know if I start doing again will send me down a relapse",
      "created_utc": 1574970345.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f91a4tv",
      "author": "None",
      "body": "Yes, me. I started to water fast one day a week for health and mental purposes and just eat slowly the rest of time, and get help from my body dismorphia...",
      "created_utc": 1574985143.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fljduya",
      "author": "DrJohnLennon",
      "body": "It did for me. I was in the danger zone for weight. Problem was the app thought half of normal calories was good for me. And like a idiot I believed it.",
      "created_utc": 1585208347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6hd030",
      "author": "scouttheog",
      "body": "Exactly what happened to me in high school. I was already restricting but as soon as I got a calorie counter it got way worse",
      "created_utc": 1572843506.0,
      "score": 1,
      "context": [
        {
          "id": "f6h8f4y",
          "author": "Iscariiot",
          "body": "Kinda? I technically already had one. That said, two weeks ago I downloaded an app to count calories and my eating disorder has rocketed into extreme levels since. I used to have at least two meals a day, but after seeing what this stupid app had to say I can barely manage one. Keeping my intake below 1,200 calories quickly became < 900/day. And there’s nothing I can do to stop it. I check literally every food that goes in my body to see how many calories I’ve ingested. It bothers me so much to eat anything above 300 calories at a time. I hate it so much. Earlier I avoided eating a small pretzel rod because the app told me I’d be slightly above 900 for the day. I couldn’t bring myself to do it even though I was incredibly hungry. \n\nThe only thing I seem to be able to ignore is coffee. Even if I put 2-3 teaspoons of sugar in it at a time, I can’t bring myself to add it to my daily intake. I need that one thing (or, 3-5 things. Since I drink a lot of coffee in a day.)",
          "created_utc": 1572839526.0
        }
      ]
    },
    {
      "id": "f6hcs9x",
      "author": "scouttheog",
      "body": "I think you'd benefit from Tabatha Farrar on YouTube. She has mentioned SO many times that you don't need to count calories to make sure you eat enough. If you think you didn't eat enough today, eat more. That's it, you don't need an app to tell you that. Easier said than done of course but I think it's true that counting is more on he disordered side than the helpful side.",
      "created_utc": 1572843291.0,
      "score": 3,
      "context": [
        {
          "id": "f6dndck",
          "author": "wishfulmelody",
          "body": "I'm trying to recover from being underweight at the moment (due to orthorexia) and I began counting calories to make sure to gain weight and eat enough since I've struggled a lot with hunger signals this past year, but I noticed that I've been very stressed about it since I've started.   \n\n\nSometimes I worry that I eat to little or eat too much, and since the app I'm using tracks things like saturated fats and such I've been more anxious about that as well but try to not think about it too much. (I've gotten more anxious about health things that I weren't worried about before which feels a bit ironic since I'm trying to heal myself from that.)\n\nI don't trust myself enough at the moment to stop counting, but I guess it would be good if I could try to eat more intuitively soon since it was what I did before developing orthorexia.",
          "created_utc": 1572795516.0
        }
      ]
    },
    {
      "id": "f7yjmg1",
      "author": "yeefuqkinhaw",
      "body": "This is exactly what is happening to me right now. You literally couldn’t have put it better and I came to this sub because I feel even worse than when I started, even though I’m ten pounds less.",
      "created_utc": 1574096269.0,
      "score": 1,
      "context": [
        {
          "id": "f6fflf1",
          "author": "judethedude1398",
          "body": "Yes, I was slightly overweight and started calorie counting and it ruined my life. I never had eating problems beforehand. Now I cannot stop thinking about food. I hate it",
          "created_utc": 1572813809.0
        }
      ]
    },
    {
      "id": "f6skvpz",
      "author": "None",
      "body": "I am just recently getting out of my own obsession, and I ordered a book called \"Intuitive Eating\" which I am hoping to adapt ro help me live a happier life without the idea of needing to lose weight. I plan on ordering The F*ck It Diet\" next and read that one. Just trying to stop the obsession with food where it was literally all I thought about. It's really difficult.",
      "created_utc": 1573135816.0,
      "score": 1,
      "context": [
        {
          "id": "f6nryqn",
          "author": "spark99l",
          "body": "OP here- thanks for the posts all. \n\nNow what did you do to get over this issue? Stop counting calories and just trust your gut (haha)? Will the obsession with counting calories eventually go away?",
          "created_utc": 1572998556.0
        }
      ]
    },
    {
      "id": "f91dqp5",
      "author": "None",
      "body": "I started to eat slower. I used to chunk food ridiculously fast. I added a 1day water fast per week for mental health aid...",
      "created_utc": 1574987082.0,
      "score": 1,
      "context": [
        {
          "id": "f6nryqn",
          "author": "spark99l",
          "body": "OP here- thanks for the posts all. \n\nNow what did you do to get over this issue? Stop counting calories and just trust your gut (haha)? Will the obsession with counting calories eventually go away?",
          "created_utc": 1572998556.0
        }
      ]
    },
    {
      "id": "f6ipbxe",
      "author": "wishfulmelody",
      "body": "Thank you, I'll check her out. <3 (And yeah, I totally agree...like, I've never counted calories before and it has made me focus a lot more on numbers and eating a specific amount of food rather than just sit down and feel what I need or want to eat at the moment...and it's pretty tiresome to weigh food too.)",
      "created_utc": 1572882241.0,
      "score": 1,
      "context": [
        {
          "id": "f6dndck",
          "author": "wishfulmelody",
          "body": "I'm trying to recover from being underweight at the moment (due to orthorexia) and I began counting calories to make sure to gain weight and eat enough since I've struggled a lot with hunger signals this past year, but I noticed that I've been very stressed about it since I've started.   \n\n\nSometimes I worry that I eat to little or eat too much, and since the app I'm using tracks things like saturated fats and such I've been more anxious about that as well but try to not think about it too much. (I've gotten more anxious about health things that I weren't worried about before which feels a bit ironic since I'm trying to heal myself from that.)\n\nI don't trust myself enough at the moment to stop counting, but I guess it would be good if I could try to eat more intuitively soon since it was what I did before developing orthorexia.",
          "created_utc": 1572795516.0
        },
        {
          "id": "f6hcs9x",
          "author": "scouttheog",
          "body": "I think you'd benefit from Tabatha Farrar on YouTube. She has mentioned SO many times that you don't need to count calories to make sure you eat enough. If you think you didn't eat enough today, eat more. That's it, you don't need an app to tell you that. Easier said than done of course but I think it's true that counting is more on he disordered side than the helpful side.",
          "created_utc": 1572843291.0
        }
      ]
    }
  ]
}