{
  "id": "drfx5c",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1572864150.0,
  "title": "Request: Women with body issues compliment my body and it triggers me",
  "selftext": "For reference, I am severely underweight. \n\nThere are many women in my life who either have eating disorders, or just don’t like the way their body looks. If they see my body, when I’m in a bra and underwear or tight clothes they’ll say “wow I wish I had your body!” \n\nThis makes it so difficult for me to gain weight and try to have a healthy BMI because in my head I should be happy to have my body since women want to look like me. \n\nAlso in my head I think that if I’ll gain weight, I’ll be unhappy with the way I look, the same way these women are.\n\nIf anyone has any advice, I would be so grateful! It is literally stopping me from recovering.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/drfx5c/request_women_with_body_issues_compliment_my_body/",
  "score": 97,
  "num_comments": 8,
  "comments": [
    {
      "id": "f6i0j0b",
      "author": "omun1828",
      "body": "These women in your life, do they know you are sick? I bet if you told them you gave an eating disorder they'd stop commenting.\n\nOne time my cousin was like \"wow have you lost weight?\" I go maybe, I'm stressed and sick. Shut that convo down quick",
      "created_utc": 1572869494.0,
      "score": 34,
      "context": []
    },
    {
      "id": "f6j2rmk",
      "author": "wishfulmelody",
      "body": "I experienced this a lot when I was younger... and I think it's important to understand that you're not only your looks. Many focus too much on the surface, but beneath it all there's organs that need fuel and fat to keep them warm and working properly. If we give our body enough fuel (and make sure that there's always a healthy amount of extra fuel stored as fat) we have energy to do the things that makes us happy without having to worry if we have enough to live and breathe. \n\nHaving happiness being connected to your weight is an emotional rollercoaster (and a dangerous one), and I know it isn't easy, but remember that you're so much more than your body. Your body's job is to keep YOU alive so you can do all the things that you want and need to, and one shouldn't be too concerned about what it looks like because it doesn't matter as long as it does its job and it's healthy. <3",
      "created_utc": 1572888268.0,
      "score": 12,
      "context": []
    },
    {
      "id": "f6k0sa4",
      "author": "Ari3n3tt3",
      "body": "this situation sucks because if you straight up tell them 'Im thin because Im sick' you almost always end up having to comfort them because they feel so bad about saying it",
      "created_utc": 1572903137.0,
      "score": 11,
      "context": []
    },
    {
      "id": "f6l0op1",
      "author": "None",
      "body": "Super relatable. My mom constantly wants to split food with me when I want to eat my own whole meal. Or she’ll see me finish my food and say “oh, I can’t finish mine, I won’t eat for the rest of the day.” Or she’ll give me her old  clothes and say “here you go, these are too big for me now.” It’s hard. On top of all of my aunts that eat terribly and drink a lot, and then tell me that they wish they were as thin as me. “Thin” is such an awful word for me.\n\nI think what helped me the most was putting physical space between me and these people. My therapist also nailed it in my head that I can’t control what other people say to me, so I try to think about all of the awful things that tell women how to be and how that effects my mom and my aunts. It doesn’t completely erase the pain, and perhaps your relationship with food is more fraught than mine, but that’s something that helped me.\n\nAdditionally, when I started feeling stronger and more level-headed after getting my health back, I found other ways to value myself. I regularly work out (it took me years to get there), and I’m a lot stronger than my mom and my aunts, so if I lift heavy things for them, for example, they’ll comment on that accomplishment and we both feel okay. \n\nIt’s really awful, and maybe this comment isn’t the most helpful, but I hope you can stay strong. ❤️",
      "created_utc": 1572925647.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6llxfi",
      "author": "None",
      "body": "I can totally relate. I’ve been athletic all my life and so most of my friends are involved in competitive sports even as adults now, but after my husband died, I plunged into a deep depression which caused me to lose a ton of weight and am now a few pounds underweight (or as my nutritionist would say, underweight and underfat). About 20 years ago, my ED was more serious, more so mentally in my mind than physically and now it’s more physical than mental. I think as I got older, more experienced in life (job, career, relationships etc), my self-esteem naturally got better and I think this is true for a lot of women. \n\nBut the recent invasion of Instagram and social media in our lives has negatively affected the way women view themselves I think, and while I may have gotten better, others have become more obsessed and it isn’t just their problem, because it then affects ME with their comments. \n\nIt’s hard to ignore. I don’t have any good advice but I understand how it feels. While I can avoid social media, I can’t ignore *hearing* the comments. But when I get them, I don’t react and don’t engage in that conversation. Makes for a bit of an awkward moment at the time but for the most part it sends the message that I don’t like the comments and they don’t bring it up again (Although I can see people staring at me). It’s the best I can do right now to « deal » with it. I’m so glad it’s winter and I can hide behind layers of clothes... !\n\nIt’s just never right or OK to comment on someone’s body. I wish I had better advice... There is a small movement I’ve noticed where some women are speaking out about that and I hope it spreads fast!",
      "created_utc": 1572952265.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6jw1wf",
      "author": "WenVoz",
      "body": "I don’t have any advice per se. I have been in your predicament.  It helped me to learn that you cannot control what they say only your response. If your response is being resistant to maintaining a healthy weight...remember they are projecting their insecurities on you. Try to minimize contact. Natacha Oceane says the least interesting thing about you is the way you look! I have been battling this for 30 years now! I wish my family and yours would have taught me that instead!! You are worth more than you think! Best.",
      "created_utc": 1572901079.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6sliwx",
      "author": "None",
      "body": "Our society still portrays underweight as an ideal body type. Your health is more important than your looks. Those women have also fallen into the sad trap of value looks or what someone in an Instagram post looks like over being happy and healthy. Maybe just ignore their comments or try to challenge their statements, or talk to a therapist about how to deal with it.",
      "created_utc": 1573136131.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8hlfzy",
      "author": "lucindaannemay",
      "body": "I've been there, but I pushed through all of the annoying comments and stigmas to reach a healthy and happy weight. I get less attention for my body now,  and less ignorant women telling me how they wish they had my body.  The western society is honestly sick, it wasn't until I started traveling in South America that I realised how people glorify unhealthy body shapes in western culture. Yes,  Colombia does have the second highest plastic surgery in the world, and yes, people are people, and people are superficial and sexual even in South America,  but they glorify fat!!  The bigger you are the better!! And when I experienced that,  I just realised how stupid people are in general and how their opinions don't even matter.  Who cares.  Get fat!!  Get curvey!! Get full!!  And most importantly, get content. You are beautiful no matter what you look like.  Either tell those women the hard facts,  or just stop talking to them.  Move to South America where you can eat as many empanders as you feel and just get sexier.",
      "created_utc": 1574576420.0,
      "score": 1,
      "context": []
    }
  ]
}