{
  "id": "drxhon",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1572950679.0,
  "title": "Request: Anybody else experienced PTSD caused BY an eating disorder?",
  "selftext": " \n\nThis weekend marked 1 year into anorexia recovery for me.\n\nAbout 5 or 6 months into my recovery I started experiencing PTSD symptoms, which I am now treating the ptsd with exposure therapy and emdr.\n\nI feel traumatised by my time with anorexia, it includes flashbacks and body memories of the scariest times during restriction during my recovery and I was scared for a while that even though I physically recovered I'd be reliving the experience forever and ever.\n\nSo I wondered, has anyone else experienced anything similar? Is it normal for an ED to trigger ptsd in someone? I really thought that i would just have to heal from the ED itself.\n\nWhenever I Google stuff I can only find things about how PTSD causes ED and not the other way round so I'd love some insight, and if anyone can relate\n\nKeep going <3",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/drxhon/request_anybody_else_experienced_ptsd_caused_by/",
  "score": 46,
  "num_comments": 11,
  "comments": [
    {
      "id": "f6mb0wk",
      "author": "None",
      "body": "Yes. Not only did my ED take so much away from me, literally cant remember 2 years of my life, it also added so much trauma. Whether that has to do with certain locations, people, songs, movies, ETC... this disease has done a lot of damage, thats why we must conquer and defeat it!",
      "created_utc": 1572969671.0,
      "score": 15,
      "context": []
    },
    {
      "id": "f6mxmt2",
      "author": "T_86",
      "body": "Post Traumatic Stress Disorder is an\nAnxiety disorder developed after a person experiences or witnesses a traumatic event.\n\nComplex ptsd is something a doctor may diagnose after a person has experienced prolong or repeated trauma over a period of months or years.\n\nI’m thinking that even though complex ptsd isn’t recognized in the DSM, you probably relate to it more. Like all anxiety disorders, theirs treatment. You might benefit from some type of psychotherapy; CBT, DBT or EMDR.",
      "created_utc": 1572981083.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f6mbq6z",
      "author": "shiveryourselfskinny",
      "body": "Yes, and it's been really rough. I believe in you though and though I know how hard PTSD treatment can be (I'm going through it right now), I believe in you and the fact that you can make a full recovery from your eating disorder ❤️",
      "created_utc": 1572970068.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6n6pq2",
      "author": "None",
      "body": "Actually for me, it was the opposite. Through dealing with trauma, I developed eating issues. If CBD therapy does not work for you I highly suggest EMDR. I can say EMDR totally changed my life honestly, and I was one of the people who always thought “nothing is going to work for me” or “nothing will change”. EMDR helped process the traumatic memories I had while using bilateral stimulation (with buzzers in each hand) to distract me from getting distressed and helped process the blocked images in my head. Message me if you ever need anything. ❤️",
      "created_utc": 1572985719.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6niiwa",
      "author": "nooorecess",
      "body": "yes this actually makes a lot of sense and made me wonder if i'm experiencing a similar thing. i also find that i have a sometimes debilitating anger/resentment toward people who distanced themselves from me while i was suffering most; maybe partly because in mind this experience was a gruelling and painful event whereas to others it just looked like a passive state i happened to be in for years. i can't blame people for resuming their lives without me but there is a feeling of injustice or something, like they might have been more understanding toward someone who underwent a more sudden and \"obvious\" kind of trauma like an accident or things we tend to associate more with ptsd",
      "created_utc": 1572992258.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6njp1j",
      "author": "stonesandswords",
      "body": "I think yes but not really PTSD caused directly by my eating disorder but PTSD caused by how certain people reacted and behaved surround my ED and recovery which I just associated with my ED.",
      "created_utc": 1572992992.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6nl4ay",
      "author": "None",
      "body": "I mean I’m not going to go diagnosing myself with PTSD and honestly I don’t think I do have ptsd but I definitely agree ED’s leave a lot of trauma. \nI think of my ED in kind of two phases. Phase 1) simple anorexia/not eating when I was 11, and Phase 2) restricting and bingeing starting at 17.\n\nPhase 1) had a lot of trauma associated with how my family reacted to it and how it affected our home life at that time. I would cry a lot which wasn’t nice for my parents and siblings. My parents also began to hit me and lose their temper with me. Eventually I was hospitalised which was good in the sense that I was away from home and bad in the sense that I was mostly alone in hospital even though my parents visited every day. I carry a lot of guilt and trauma for what I did to my family and how they were towards me in response. \n\nPhase 2) I went on the pill at 17 and a girl that was large told me she used to be my size before she went on the pill too. I was super worried about losing what I thought was the only valuable thing about myself, which was my natural thinness. The hormones made me depressed and foggy and gave me constant cramps which were easily confused with appetite. I was trying to restrict and would chew gum relentlessly to stop myself eating. Then I would binge and eat so much i felt like i was going to literally die. From that period I carry a lot of trauma for what i did to my body and how scary it was to make myself feel so unwell and literally like i was going to die. I also carry a lot of shame for this. \n\nMoving past all the trauma is definitely a long process, especially because remnants of my eating disorders still linger and working out my relationship with food, eating, my body, and all that shame is kind of an ongoing process.",
      "created_utc": 1572993909.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6noyzr",
      "author": "Khaydii",
      "body": "yes, im glad youre recovering and its been a full year! be proud of yourself. i myself awhile back developed anxiety and i wouldnt eat, then i wouldnt eat for so long id feel nauseas and would faint and i would puke up my stomach bile and just be dead for the rest of the day, and this went on for almost a year, now whenever i dont eat something for awhile i get a lot of anxiety that im gonna feel like crap so then i get stomach pain from the anxiety and try to snack of crackers or something, and this has been going on for a year aswell as im still in recovery from whatever that is. so yes ptsd from ed is real",
      "created_utc": 1572996491.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6ogusm",
      "author": "JellyfishinaSkirt",
      "body": "Actually I was wondering this myself because since recovering (mostly) from my ed in high school I’ve had a much harder time eating the same foods I used to eat when I was anorexic and forcing myself to do things like homework, exercise, go to new places.  it all reminds me of when I would force myself to be miserable for the sake of losing weight and I am terrified of going back to that dark place",
      "created_utc": 1573017397.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6ojx6e",
      "author": "annielovesbacon",
      "body": "I’m not sure if I’d classify it as PTSD for me (I’ve never really thought about it in this way) but I do feel a certain amount of trauma when I look back on my life. Knowing that my childhood/adolescence/young adulthood was stolen from me by my ED and having literally every memory tainted by my ED is painful. Thinking about my past is traumatic to me knowing the hell I went through (and am going through).",
      "created_utc": 1573020695.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8wr1yd",
      "author": "sunshine43210",
      "body": "this has been happening to me recently it's pretty scary",
      "created_utc": 1574897623.0,
      "score": 1,
      "context": []
    }
  ]
}