{
  "id": "dsekwq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1573036871.0,
  "title": "Request: What is normal eating supposed to be like?",
  "selftext": "I’m recovering from eating issues (at first it was anorexia and then weird diet restrictions, wayyy over exercising for years, and the past few it’s been purging but no binging and I stopped working out a lot in June) and I literally don’t know what normal eating is supposed to be like.\n\nI have an appointment with a dietitian in a few weeks and in a couple months I’m going to do outpatient treatment so I will get guidance soon but until then I don’t know what I should be shooting for.\n\nGoogling what to eat recovery is confusing. 3 meals a day? AND snacks? Snacks plural? I’m used to making myself wait until dinner time to eat and then purging half of it. Maybe a light lunch occasionally. I’m trying to eat 3 meals and it is really hard. I don’t feel hungry yet for breakfast or lunch, and then I feel so much guilt for eating those meals when I don’t feel hungry yet. I start feeling really hungry around 2:30pm and my stomach goes nuts all growly and hungry and then if I wait an hour I don’t feel hungry anymore. \n\nWhat is normal eating supposed to look like? I feel like it should be something like “eat when you’re hungry” whenever that is, but my hunger cues are all out of wack. \n\nSo should it be structured? Based on specific times of day? Because if that’s the case, it’s one more thing for me to over obsess on and I fall in the negative panic attack depression cycle for being off the schedule. \n\nAnd how do I know how much to eat? Is my metabolism a great deal slower from damage? Or just a little bit?\n\nIf anybody wants to weigh in on advice, explanations, tips, random facts, personal opinions, conspiracy theories, recipes, macro guides, or knock knock jokes, please feel free. I’d really appreciate it. \n\nOh, also, if you feel better messaging me directly feel free to do that too. \n\nThanks guys. You are worth it <3",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dsekwq/request_what_is_normal_eating_supposed_to_be_like/",
  "score": 62,
  "num_comments": 13,
  "comments": [
    {
      "id": "f6pmaqc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1573059482.0,
      "score": 21,
      "context": []
    },
    {
      "id": "f6oyfgf",
      "author": "samcat11",
      "body": "Have a a couple meetings with a dietitian they will give you a meal plan and after a while your hunger cues will be more reliable",
      "created_utc": 1573041163.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f6p2a9t",
      "author": "carolinapenguin",
      "body": "I'd say normal eating is whenever you're hungry. To me, that's an hour ish after I wake up, sometime in the middle of the day, a small snack in the afternoon and dinner at 8ish. It took me a while to figure this out, but it's what works for me. It doesn't have to work for anyone else.\nI say, try eating when you're hungry. Some days that might be 3x a day, others it might be 5x or more. But I'm not a professional so also take into account what your dietitian says.",
      "created_utc": 1573045174.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f6p7dha",
      "author": "bearthedog3",
      "body": "I went into inpatient at a time when my eating was waaaayyy out of cycle, and so we're my hunger cues. They immediately put me on a schedule that included three meals and a snack, and was determined basically by the time of day. I hated it, because I was *never* hungry, and it was always a struggle to eat as much as they wanted me to. Eventually I asked to trade some of the snacks and meal side dishes with nutritional drinks, because those were just easier for me to get down. But I'll tell you, after about a month of this schedule, I felt my body getting back on track. It felt normal to eat this much, and I even started getting hungry between meals again. Looking back, I knew I never would have been able to fix my eating or hunger cues without being in inpatient. So I'm thankful for that. It wasn't permanent, I did relapse basically right after leaving outpatient, but I think it was an important lesson for me. Im not saying you should check yourself into inpatient, just that it *will* feel wrong to you, in the beginning. You have to trust your dietician and stick with your meal plan for a while before you start to feel like you are actually making any progress.",
      "created_utc": 1573049480.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f6pfc9f",
      "author": "whispering_syndrome",
      "body": "Here's what worked for me:\n\nI made a meal plan with my dietician, nothing too wild, just what I thought I could handle. I set my alarm 6 times a day for eating. It's really important to take time to eat, really sit down, don't try to rush it. Try to eat mostly at the same times each day, it'll make it easier for your body to understand when you're supposed to be eating. And don't be to hard on yourself, start out easy. You can't expect to go from eating next to nothing to eating like a regular person overnight. Choose things that are easy to eat for you and that you enjoy eating! Maybe choose some yoghurt and fruit over pancakes for breakfast, a salad instead of a sandwich for lunch etc. Know that in the beginning the most important part is getting used to eating again, both physically and mentally. You can start to eat more and different things once you're getting hunger cues at the right time. You'll just need to settle into a routine first. Whenever I get confused about the right amounts, I just look it up on the Internet. It gets easier over time, just be kind to yourself and your body. It's really all worth it. Hang in there.",
      "created_utc": 1573055087.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6q87nd",
      "author": "Funderwear420",
      "body": "Everyone's given good advice, so yeah, I'll just agree that 3 meals and snacks is hard but you get used to it. I love carrots and ranch because I can eat a lot through the day without getting stuffed, but ranch is full of fat. My metabolism was all out of wack for a while. Like, meat takes 7 hours to digest but my blood sugar crashes if I only eat simple carbs. Consulting with a doctor really helps if you're up front about past issues",
      "created_utc": 1573072595.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6pzd9y",
      "author": "tangsoodoblackbelt",
      "body": "I believe that in early recovery, you need to eat regularly scheduled meals regardless of hunger cues because your brain is so used to ignoring them, you won’t feel hunger like a normal eater.  \n\nFor me, I followed a structured food plan for at least a year- it was 3 meals and bedtime snack.  \n\nOver time, I was able to relax that and not be so rigid, but I still eat similarly today (maybe 1-2 more snacks on some days).  \n\nBe patient with yourself and follow the advice of your treatment team (dietitian, etc.)",
      "created_utc": 1573067611.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6q4t41",
      "author": "MaryContrary26",
      "body": "You may feel like the dietician is giving you way too much food but believe it or not, no. It takes a while to mentally adjust to eating normally but you really do need 3 meals and 3 snacks. What will probably feel like a huge amount at first will eventually feel normal.",
      "created_utc": 1573070889.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6qcvcj",
      "author": "regrettospaghetto",
      "body": "I dont speak english first language sorry for any misspelled or french words !!\nConsidering your state at the moment, you might have gastritis or something in your esophogus! Just to be safe if you ever feel sick, happened to me from purging.\nAnyway, i would say your stomach is SO small so before you start that dealio, make sure you start slow!\n•Breakfast can be the biggest meal but some people cant. Carbohydrates give energy (Protein too) so that meal tends to be packed with those:) eg. Eggs, cereal, toast, fruit like pears or bananas.  Starting with vitamins is nice to convert throughout the day. Coffee or tea too. MOST IMPORTANTLY- WATER!! \n°Usually not a snack but some people do depending on their physical activity.\n•Lunch is usually something small but not the smallest. Usually a sandwhich to make more energy and stay full or a salad with fruits, like berries, and nuts. \n°A snack would be good now! Something like crackers, nuts, some people take a fruit or granola bars. \n•Dinner should be the smallest meal. Its late and the amount of excercise is typically low. Its unwinding time. This would be time for something like chicken, fish, or a nicely proportioned red-meat. A salad or mashed potatoes. \n°Light snack. Again maybe cucumbers, fruits, sometimes a treat like chocolate or chips. Depends on person. I was told that it is recommended to take a snack like 2 hours before due to sleeping on acid. \n\nI have gastritis so my diet is different BUT this was my diet when i didnt dive so deep in my disorder. This was a balanced diet for me at least!:) \nHope this way okay??",
      "created_utc": 1573074988.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6r6swc",
      "author": "westalalne",
      "body": "3 meals 3 times a day, & choose a plate  of normal size on which you eat each time. Promise yourself to fill it up with good stuff+fav foods (A mix of both) & try to finish it each time. Gradually your body will fall in line.",
      "created_utc": 1573095164.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6rf2qv",
      "author": "snazzyjazzyaxton",
      "body": "I feel this!!! I’ve had anorexia B/P sub type for years, and now that I’m giving recovery a solid crack, I don’t even know what normal eating looks like!!!! I’m worried I’m eating ti much but then I’m worried I’m restricting and ugh!!! I feel your frustration!!! You’re not alone with this one x",
      "created_utc": 1573101829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6vl1dv",
      "author": "Redhawkgirl",
      "body": "Eventually it will mean eating when you are hungry and stopping when you are full but a dietician will help you with a baby steps plan to getting there. Structured eating meal plans help most people because our normal cues are so screwed up. A good dietician will write a plan that doesn’t further trigger your perfectionism or obsession or stress you out. \n It does take a lot of trust so find someone you like. You could always pm someone HEALTHY on here and ask for help in sharing their meal plan until your appointment. 3 meals and 2 snacks was always my plan. The only thing different now is that I don’t always need snacks between meals but I do usually have something with me. I am aware of my hunger and satiety and energy now which feels like freedom.\n\nHappy to share more details privately. I’m in recovery from anorexia and bulimia. Getting a food plan and following it really helped get me started. Getting too hungry or under eating will always be a trigger so a solid meal plan is a good first step.",
      "created_utc": 1573189555.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f8b7amr",
      "author": "TrinityLee1228",
      "body": "Honestly, yeah, normal eating is like 600-700 calories a meal and yes, sometimes you yes, do have snacks. But I’d say take it a bit slower. don’t throw yourself into eating normal portion amounts because it’s going to overwhelm your body.",
      "created_utc": 1574429297.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6qvmi7",
      "author": "None",
      "body": "This is a very good comment. I never told anyone about my ED, so I never got “proper” recovery help, but that’s how I did it. At the very beginning, on the days when I could stop myself from binging (extreme hunger ftw), I tried to shoot for a minimum calorie goal. The goal was low but I was disordered, and eating a lot at the beginning probably would’ve been physically bad anyway. 3 meals, 3 snacks. Then I slowly moved up in calories. It was insanely hard but the process was moved along since, again...binging.\n\n\nIt helped when I went home for holiday breaks because I could watch my family & friends eat - it sounds odd, but it was a good guideline for how “normal” people eat.",
      "created_utc": 1573087075.0,
      "score": 8,
      "context": [
        {
          "id": "f6pmaqc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1573059482.0
        }
      ]
    }
  ]
}