{
  "id": "dtdus2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1573210801.0,
  "title": "Request: I binge or I don’t eat at all. Why can’t I find a balance?",
  "selftext": "I’ve struggled with my weight and body image my whole life. I probably have body dysmorphic disorder, but I am for sure overweight by BMI standards.\n\nI’ve been overweight most of my life due to uncontrollable binge eating, but I have also gone through several periods of anorexia over the years. During these recurring ED shifts, my weight has fluctuated several times drastically in both directions. \n\nWhen I get into my binge mode it’s like I’m literally insatiable. It’s never enough food, no matter how much I eat.\n\nWhen I’m in my anorexic mode, it’s like food isn’t even edible. My favorite foods don’t look good anymore and I can barely make myself chew and swallow even the most basic, plain, bland foods. \n\nNeedless to say, I like anorexic me better (as far as looks are concerned) but I don’t *like* that I like anorexic me. My weight seems healthier on paper but I know I’m not actually healthy based on my lack of nutrition. \n\nI’ve never met anyone else who struggles in quite the same way with this issue, and I could use some guidance to break this cycle I’m caught in.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dtdus2/request_i_binge_or_i_dont_eat_at_all_why_cant_i/",
  "score": 74,
  "num_comments": 6,
  "comments": [
    {
      "id": "f6w8b48",
      "author": "Luci_purr666",
      "body": "Do you have an ED therapist or have you considered going to treatment? ED cycles are SO hard to break, and one good thing about treatment is they can literally help with meal plan and balance with food (as well as therapy).",
      "created_utc": 1573219765.0,
      "score": 11,
      "context": []
    },
    {
      "id": "f6wl2e9",
      "author": "None",
      "body": "I've been there. My whole life I have felt the same way you've been feeling for a while. Your post is the perfect description of my teen years. So first thing I want to say to you is that you are NOT alone in this. \n\nI've been struggling like forever both with my body shape and my weight. I used to think and feel the lesser I weigh, the better I was. So wrong, I know it now. \nI've always been overweight and I was so uncomfortable with that, so I diet. I did a lot of diets. I've been on VERY restrictive diets so many times and every time I ended up eating max one yogurt per day and that yogurt always felt bad to me. I still remember the fights with my parents who wanted me to eat and somehow forced me to eat, no matter if my eyes were filled with tears because I felt like eating was such a horrible and unnatural thing to do. I understand you feel more or less the same when you're in your anorexic time. \nDuring these terrible diets I used to lose like 20/25 kg. But I ate nothing. Yet I was so comfortable with that. Like you, I liked myself better when I was in the anorexic times. My self-confidence and self-esteem depended on my weight. I would feel so bad and guilty and such an horrible person if I gained even 1 kg. \nBut then, after every restrictive diet I have ever done, well, then there was the binging time. I used to eat everything, no matter the weight. During this period, I used to gain every single kg I had lost until I found myself in an overweight shape AGAIN. So I diet AGAIN. And this fucked up circle repeated itself until I was 20, when my eating disorder exploded.\n\nThis whole story to tell you that breaking this mad circle is the most difficult thing to do. Recovering from my ED was the hardest thing I have ever done in my life. Even now the thought of all that pain hurts. \nMy suggestion is to seek professional help. EDs are never about food really: the complicated relationships with food and body shape are just the results to an inner struggling. You can't fight this on your own. It's not like you need to fix some broken thing and these kind of thoughts and behavior you have and I had are hard to fix. \n\nI would really like to say to you that these feelings will go away on their own eventually, that this is just a phase. But it's not. In my experience behaviors like those you descripted in your posts lead me to a fucking, serious desease.  \nPlease, don't do the same because you and your weight are two very different things. \n\nYou may try school counseling if you're a student or go see a therapist specialized in ED.\nI really wish you the best",
      "created_utc": 1573229045.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6wfpq8",
      "author": "Tigrella17",
      "body": "Totally agree that you need to see an ED therapist and dietician. To your question: the binging is your body in survival mode trying to compensate for your periods of restriction. It is incredibly hard to get out of this cycle, because the ONLY way to break it is to eat meals and snacks at regular intervals. Your body is in a place where it doesn’t trust you to nourish it regularly, so it maintains the binge/restrict cycle. Part of recovering from this type of ED is reteaching your body how to eat intuitively. I hope that you’re able to find support for this through mental health professionals. Recovery is possible.",
      "created_utc": 1573225464.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6xwswk",
      "author": "None",
      "body": "The reason for lack of balance is our lack of accepting the emotions we feel about things and we use ED behaviors to control it. I say ‘it’ as in the thoughts we have when we are active in our ED behaviors. Our ED behaviors are completely reactionary to our environment and thought processes. As everyone has mentioned, therapy can help learn about emotions and how to work with them instead of against. If you can’t get to a therapist, there are several videos on YouTube and books you can read. I have been to therapy for years and it’s just recently I found a new tool to help me called ACT (acceptance commitment therapy). This is an easy lesson on it;\n\nhttps://www.google.com/amp/s/ideas.ted.com/5-effective-exercises-to-help-you-stop-believing-your-unwanted-automatic-thoughts/amp/\n\nI named my mind Olivia and when I notice I want to binge, I internally ask Olivia what’s going on and why she wants to keep hurting herself, then I tell her it’s Ok and I don’t resort to my ED behavior. It’s amazing to me. \n\nYou are not alone in this battle. \n\nSmall steps always and don’t seek perfection, just progress. 💛🤗",
      "created_utc": 1573260828.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8akbu8",
      "author": "oliviared52",
      "body": "This is long but may really help. It’s not something wrong with you. It’s because you’ve been working against your biology instead of with it, like sadly so many girls / people do. I had this exactly! When I had an ED it was the heaviest I had ever been. I cured it and have now been a healthy weight I love for 3 years. I also am in the medical field so have a science background and decent understanding of biology and weight. Here are the steps I took: \n\n1. I decided to give up fad diets / starving myself completely. I knew the healthy way to lose weight was to eat healthy and exercise, but that seemed like it was going to take too long so I kept starving myself when I felt fat. Well after years of failing to lose weight and keep it off, I figured the healthy way was better than nothing. \n\n2. Starting October 2016, I ate when I was hungry. This is the scary part, but I truly believe over 90% of weight issues are mind issues (whether that be anxiety, depression, stress). I took this time to focus on healing my mind. I ate when I was hungry, and at times that meant eating half a jar (or more) of peanut butter in one sitting. Biologically when your body has been starved you crave calorie dense foods. This phase of overeating most days lasted for 3-4 months for me. And the scary part comes in because I did gain weight. But did I lose any friends? No. Did I lose my job? No. Was my life any worse in any way? No. I actually felt awesome because the temptation to binge slowly went down. Don’t take this time to let yourself eat till you’re sick, but eat until you are satisfied and feel ok with it, even if it seems like a lot. \n\n3. January 2017, I started a weight lifting and meal prep regime with no calorie counting. I would lift (starting slow but increasing weight each week)  3-4 times per week. And meal prep on Sundays for the week. It actually saved me so much time and money. For meal preps I would make whatever I was craving but made sure to use mostly whole foods with a good blend of carbs, protein, and fat. I never ever counted calories since my ED. But (and this part is huge) if I ended up binging one weekend, I let myself do it and didn’t feel bad about it. But for that upcoming week I would add more carbs (usually rice) and fat (either fattier meat or avocado) to my meals because clearly I wasn’t getting enough which is why I binged on crap. I didn’t weigh myself either. But after doing this for 6 months, I learned from doctors visits that I had lost 25 pounds. And the weight I was after weight lifting (125 pounds at the time and I’m 5’6) looked so much better on me than when I was 125 and starving myself because it was mostly muscle so my stomach was totally flat. 125 with an ED I had a belly. 125 with weights I had a butt and no belly. The scale really doesn’t matter. \n\n4. Every time I looked in the mirror, I reminded myself instead of hating on my body to thank my body. Whenever I would start to think my legs look fat, I would think instead “thank you legs for carrying me everyday” Or for my stomach “thank you core for giving me strength and stability for everything I do”. I know it sounds stupid but it really worked.\n\nNow I have less time to work out because of my crazy schedule, but I have gotten good at intuitive eating so my weight stays healthily low (lower than 125 pounds since I lost muscle... which is sad but shows this way has worked to keep the weight off). I never made any food off limits. And I can’t even remember the last time I binged... it’s been years which I never ever thought would be possible. Your body doesn’t want to be overweight. It wants to be healthy, so if you treat it right and give it what it needs, it will treat you right back.\n\nI’m sorry this was so long but hopefully it can help!",
      "created_utc": 1574399966.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8al0ib",
      "author": "oliviared52",
      "body": "Hey my name’s Olivia! Lol love the post 😊",
      "created_utc": 1574400624.0,
      "score": 1,
      "context": [
        {
          "id": "f6xwswk",
          "author": "None",
          "body": "The reason for lack of balance is our lack of accepting the emotions we feel about things and we use ED behaviors to control it. I say ‘it’ as in the thoughts we have when we are active in our ED behaviors. Our ED behaviors are completely reactionary to our environment and thought processes. As everyone has mentioned, therapy can help learn about emotions and how to work with them instead of against. If you can’t get to a therapist, there are several videos on YouTube and books you can read. I have been to therapy for years and it’s just recently I found a new tool to help me called ACT (acceptance commitment therapy). This is an easy lesson on it;\n\nhttps://www.google.com/amp/s/ideas.ted.com/5-effective-exercises-to-help-you-stop-believing-your-unwanted-automatic-thoughts/amp/\n\nI named my mind Olivia and when I notice I want to binge, I internally ask Olivia what’s going on and why she wants to keep hurting herself, then I tell her it’s Ok and I don’t resort to my ED behavior. It’s amazing to me. \n\nYou are not alone in this battle. \n\nSmall steps always and don’t seek perfection, just progress. 💛🤗",
          "created_utc": 1573260828.0
        }
      ]
    }
  ]
}