{
  "id": "dtdw22",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1573211018.0,
  "title": "Request: when you think your SO might be an accidental trigger",
  "selftext": "Ok let me start off by saying I don't think anything I feel is his fault. Everything I think  is my responsibility. But.\n\nEverything he has ever said about what he likes is about really skinny women. And I can't help but compare myself to the women that he shows me that he finds attractive and the things he finds attractive. And now at every turn I see women skinnier than me, dressing more provocative than me, acting more ditsy than me. Essentially acting like many of the porn stars he has mentioned. But I'm not that. And I know he loves me. But I also know the part of him he can't control is attracted to this thing that I'm not. And it triggers me. Walking, At work, at the grocery store, In line at a random fucking place. Does anyone else feel this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dtdw22/request_when_you_think_your_so_might_be_an/",
  "score": 40,
  "num_comments": 14,
  "comments": [
    {
      "id": "f6wbt95",
      "author": "Elmorage2018",
      "body": "I don't know about this. My SO has never show me pictures of other women he's attracted to. I feel like he would be worried it would hurt my feelings and I would never do that to him either. I would definitely tell your SO how it makes you feel.",
      "created_utc": 1573222627.0,
      "score": 27,
      "context": []
    },
    {
      "id": "f6w3v2i",
      "author": "carolinapenguin",
      "body": "I relate with this. My boyfriend is a leg kind of guy and he shows me photos of women with nice legs (mainly Taylor Swift) and I can't help but compare myself to them. He also called me thicc once and I died a little inside.",
      "created_utc": 1573215382.0,
      "score": 12,
      "context": []
    },
    {
      "id": "f6x55p1",
      "author": "regrettospaghetto",
      "body": "That isn't healthy. I recommend telling him to stop. ED or not, it's hurtful.\nI dont believe its 'you and your brain twisting it'. If you get called ugly, you dont blame yourself, it's the other person being hurtful, right? \nIt sounds like they're comparing you :( \nMaybe I'm overanalyzing BUT\ngive me a good, solid reason as to the purpose of telling your SO body preference you dont have? What good can come from it? \nIf not, I stand by my comment lol\nEdit- elaborated to clear the word 'that'",
      "created_utc": 1573242185.0,
      "score": 10,
      "context": []
    },
    {
      "id": "f6x5t2n",
      "author": "privatecaboose1",
      "body": "Okay, I'm now 33 and am still dealing with the fallout from the boyfriend I was head over heels for at 19. Because it started with little comments like this and then they became more biting. And cruel. Eventually he refused to sleep with me and eventually cheated many times. When confronted about it his words were \"well maybe if you were a more attractive weight I wouldn't have needed to cheat.\" I blamed myself and my weight for years, and that insecurity still rears its ugly head now and then and it just sucks.\n\n You deserve more than being compared to people who are impossible to emulate.\n\nThat relationship turned me into a shell of a person and it still takes effort not to slip back into purging to try and make the pounds go away. But I deserved better and so do you. All of you do.",
      "created_utc": 1573242615.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f6wgxk8",
      "author": "AZgirl70",
      "body": "In my opinion, he needs to keep that to himself.  In essence he is saying you are not good enough.  And that is cruel.  I don't blame you for being triggered.  I would ask him to not make those comments to you.  There is nothing good that comes of it for either of you.",
      "created_utc": 1573226306.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6wzjnk",
      "author": "rhymeswithpanda1987",
      "body": "My boyfriend likes big girls. I've lost over 100 pounds, and I constantly feel like he's trying to sneakily make me get fatter.   \nI don't know which is worse? \n\nI'm sorry that you have to deal with this.",
      "created_utc": 1573238490.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6y0uux",
      "author": "None",
      "body": "Dump him",
      "created_utc": 1573264290.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f6w32wp",
      "author": "nolita-fairytale",
      "body": "yeah, i feel it. not sure how to handle it but you aren’t alone",
      "created_utc": 1573214445.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f6xd2g0",
      "author": "nooorecess",
      "body": "yeah this sounds like toxic stress you don't need at all, i hope you can talk to him about it... remember that a partner should have an active interest in your happiness and well-being. he wouldnt want to keep doing something he knows is negatively affecting your health, right?\n\nand i don't know the dynamic of this relationship but if you suspect he could be doing this intentionally as a means of chipping away your self worth or passively suggesting you lose weight, i hope you'll consider kicking him to the curb",
      "created_utc": 1573247140.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6xlzqm",
      "author": "unrestricted_domain",
      "body": "From one who's been in the shoes of the SO here, and deals with ED tendencies personally, they seem to have an unhealthy relationship with physical attraction in romantic relationships. Mentioning preferences in females directly to their SO is particularly telling.\n\nI don't like to tell people how to act, but you need to mention how it hurts you at the minimum. They likely don't know it hurts you. It took a while for me to realize it in my previous relationship. Gently ask them why they point out other females.\n\nThe reason I'm so emphatic about this regards the other issues it can lead to. Low self-worth, and body dysmorphic disorder among others. ED is already tough without these.\n\nFor now please keep in mind that your self-worth should not be gauged based off of any metric of beauty. I know this won't solve the issues, but it's something important to keep in mind that is easy to forget when dealing with the ED.\n\nI really wish you and your SO the best.",
      "created_utc": 1573252377.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f6wf9ex",
      "author": "None",
      "body": "I feel this exactly. My boyfriend likes to date gorgeous girls, and I never feel like I can completely be myself around him, like I need to restrict and purge when I don’t, etc, because he doesn’t want a fat girlfriend and I’m so terrified of losing the only guy who’s ever treated me right.",
      "created_utc": 1573225150.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f6wd24v",
      "author": "None",
      "body": "Yeah I agree..... I mean we have talked about what we are attracted to, especially what we like abt each other’s bodies, but idk. Not like that. I would bring it up for sure",
      "created_utc": 1573223564.0,
      "score": 9,
      "context": [
        {
          "id": "f6wbt95",
          "author": "Elmorage2018",
          "body": "I don't know about this. My SO has never show me pictures of other women he's attracted to. I feel like he would be worried it would hurt my feelings and I would never do that to him either. I would definitely tell your SO how it makes you feel.",
          "created_utc": 1573222627.0
        }
      ]
    },
    {
      "id": "f6x1695",
      "author": "thunder_fucked",
      "body": "Totally agree. My SO won't tell me unless I straight up ask who his celebrity crushes are. You don't have to be constantly exposed to that. Definitely let him know how it makes you feel.",
      "created_utc": 1573239572.0,
      "score": 2,
      "context": [
        {
          "id": "f6wbt95",
          "author": "Elmorage2018",
          "body": "I don't know about this. My SO has never show me pictures of other women he's attracted to. I feel like he would be worried it would hurt my feelings and I would never do that to him either. I would definitely tell your SO how it makes you feel.",
          "created_utc": 1573222627.0
        }
      ]
    },
    {
      "id": "f6wmqm7",
      "author": "AwkwrdSparklyPusheen",
      "body": "It depends on the relationship me and my significant other used to talk about stuff like that all the time. It’s gotta be mutual conversational stuff.",
      "created_utc": 1573230136.0,
      "score": 1,
      "context": [
        {
          "id": "f6wgxk8",
          "author": "AZgirl70",
          "body": "In my opinion, he needs to keep that to himself.  In essence he is saying you are not good enough.  And that is cruel.  I don't blame you for being triggered.  I would ask him to not make those comments to you.  There is nothing good that comes of it for either of you.",
          "created_utc": 1573226306.0
        }
      ]
    }
  ]
}