{
  "id": "du4148",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1573344364.0,
  "title": "Request: The more aware I am of my ED, the more I enjoy my unhealthy habits?",
  "selftext": "Has anyone dealt with this? \n\nBasically, I’ve been told I am in denial of having an eating disorder by a professional. But I have noticed, the more I’m aware of my eating disorder, and fear of gaining weight, the more I want to keep my body underweight. I will look up photos of other girls, and convince myself my unhealthy habits are fine and that my underweight body is attractive. \n\nThe less I think about my ED, the more I want to gain weight, and see my body as sick. \n\nPlease help, thanks!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/du4148/request_the_more_aware_i_am_of_my_ed_the_more_i/",
  "score": 103,
  "num_comments": 10,
  "comments": [
    {
      "id": "f728cgp",
      "author": "felonnotme",
      "body": "Yes. Sometimes I fall into traps of being too focused on my ED, and at that point I start to think of it so much that I almost romanticize it or grow an affinity for it. I always think of it like this: the more its on my mind, the more it is keeping me company and distracting me from my underlying issues. Therefore, once I try to focus on improving I seem to somehow do worse or cling to the ED even harder. It’s odd.",
      "created_utc": 1573355564.0,
      "score": 14,
      "context": []
    },
    {
      "id": "f72m5fr",
      "author": "moonie-me",
      "body": "Yes YES yes. It’s been a long time since I stopped being in denial of my ED. Now I openly speak about it with my bf and other close people, I feel almost no shame and sometimes even a certain sense of pride. There are moments when I feel superior than other people (normies) because I have an extensive knowledge about nutrition and fitness, and my habits and abnormal - hence, according to my brain, better.",
      "created_utc": 1573368461.0,
      "score": 8,
      "context": []
    },
    {
      "id": "f74j7nd",
      "author": "AZgirl70",
      "body": "I have heard a saying, \"What we focus on, grows\".  I know this is true for my ED.  I can get on a loop in my head that is very unhealthy.",
      "created_utc": 1573403267.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f72m2t8",
      "author": "MyUsername168",
      "body": "So know what you mean! I’ve recently discovered that when I start telling people I’m finally feeling better and doing better, I relapse.",
      "created_utc": 1573368369.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f8b6yiz",
      "author": "TrinityLee1228",
      "body": "Yes, trust me, i know what you’re going through. Except my situation is a bit different. The more i was aware of my eating disorder the scareder of it i acted around my two best friends but i still don’t want to stop. I act like i do but in the end I don’t.",
      "created_utc": 1574428997.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f73sqha",
      "author": "melonyhope1",
      "body": "Yeah, I do that in such a bad way!",
      "created_utc": 1573394653.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f77skfu",
      "author": "None",
      "body": "I think with a lot of things that we are told we are in denial of by people who know us well (not strangers), they are right and we know it inside. We are just not yet willing to admit to anyone else that we know...",
      "created_utc": 1573473956.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f72t8s4",
      "author": "ribcagerexie",
      "body": "I am the same.",
      "created_utc": 1573378337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f9pf2c2",
      "author": "_anightonmars",
      "body": "Oh all the time. When my ED was at its worst, I almost passed out while in classes from it, and I felt so proud of myself for not being able to eat for that long. I would also get comments from people telling me that it looks like I’m losing weight, and they get all excited about it (I’m overweight, so people haven’t noticed I have an ED yet and only get excited because I’m “finally losing weight”). Shit like that just fuels my bad patterns even more",
      "created_utc": 1575532814.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f71uvcv",
      "author": "neetsfjsh",
      "body": "Yesss",
      "created_utc": 1573348667.0,
      "score": 1,
      "context": []
    }
  ]
}