{
  "id": "dx5o8p",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1573903052.0,
  "title": "Request: Personal: unable to feel full",
  "selftext": "Hi everyone,\n\nNew here, but I’m currently 21 and I was previously suffering from eating disorder(s) (won’t dive into it extremely). From 14-16 was the worst of my issues, then I seemed to recover, and had a few slip ups in between. \n\nHowever, last year I got very heavily into exercising and dieting. I started to track my macros and that kinda sparked bad habits again. I got too obsessive and eventually broke down because it was wearing me thin. I was always hungry, tired, and drained, so I stopped counting and went back to eating intuitively. I also drastically increased my calories. \n\nAlthough I am eating more and I’m no longer counting what I eat, I am still literally so hungry that it is insatiable. I am 5’3, small frame, I should not require half as much food as I eat but I literally can eat PLATES upon PLATES of food in one sitting, and then 45 minutes later be hungry again. It is LITERALLY like my stomach has no end, like I don’t know what full is anymore. I tried to eat until I was full once recently, and it literally involved shoving my face with food.\n\nI haven’t known what full feels like in so long it’s ridiculous. I didn’t have this problem previously, and it’s getting annoying, because I’ll go out to eat and then have to eat again 45 minutes later. And I’m not eating extremely small portions anymore - I’m eating normal sized portions. Any advice? How do I make this go away? I’m back at a weight my body sits comfortably at so I don’t know why my hunger hasn’t subsided.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dx5o8p/request_personal_unable_to_feel_full/",
  "score": 42,
  "num_comments": 13,
  "comments": [
    {
      "id": "f7nl1i9",
      "author": "luckylittle-",
      "body": "I have this exact same problem. Would love some help. I don’t understand it.",
      "created_utc": 1573908911.0,
      "score": 12,
      "context": []
    },
    {
      "id": "f7nlnft",
      "author": "sewing_bitch",
      "body": "Hey, I'm not sure of your full medical situation but this may be able to help you find some clarity.\n\nhttps://youtu.be/coc5U-hHGYE\n\nThis is Stephanie Buttermoore and shes be recovering from extreme hunger. It's been so inspiring and incredibly useful as there is not a lot of common public knowledge about women's bodies in a scientific sense.",
      "created_utc": 1573909650.0,
      "score": 10,
      "context": []
    },
    {
      "id": "f7nm9eb",
      "author": "cutiepie538",
      "body": "Do you see a dietician? Honestly i would get my blood work done and see if there is any underlying issue, if not, your metabolism might just be recovering and you may actually be hungry. Don’t focus on your weight, we know that’s a pointless measure, listen to your body. You may actually need the food! \n\nIf you can afford one, find a dietician who specializes in eating disorders who can help work with you on these issues. Sometimes we still need the professionals even after we think we’ve healed.",
      "created_utc": 1573910217.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f7pou8f",
      "author": "emilyrun79",
      "body": "I have heard about this \"phenomena\" (for lack of a better term) a lot lately... I have witness many people curing this issue by going \"All In\". You can look at Youtube videos or just google search it to get some opinions on what people have exactly done and if this is something you would be be interested in doing.",
      "created_utc": 1573952374.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f7o9k7n",
      "author": "freeheartsrecovery",
      "body": "I had extreme hunger in recovery!! Most important thing : listen to it. Eat every time you have physical or mental hunger (aks when u find yourself thinking of food noticeably). Your body is communicating with u and u can actually trust it. It knows what it's doing, which is crazy for us to believe. You won't balloon up. It is trying to help u survive and it had a TON of jobs to do inside u on the cellular level. It's trying to make up for the deficit u lived i  for so long. Check out extreme hunger vids on YouTube. Totally helped me! Yout body will take you to the place u were programmed to be at. Intuitive eating is the key and is hard to get the swing of!! Cuz for so long we \"felt\" like not eating or wh binging etc.. it's all about tuning in and doing the opposite of what the e.d. voice says. Scary I know, but it gets so easy in time!! U got this xoxo we",
      "created_utc": 1573923542.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f7nqn78",
      "author": "freds__",
      "body": "If you don’t have a dietician, and if you have the resources to get one, they could help you. My dietician has helped me a lot with recovery (meal plans etc), she calls me every week at the same time to check up on me.\n\nI agree with the user above, you could talk about this with your doc to see if there’s some bloodwork that hasn’t been done that could explain this situation!",
      "created_utc": 1573913238.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f7y3pyy",
      "author": "kscott29",
      "body": "Hey I was having this problem too. I am a recovered bulimia/anorexia  (7-8 years), but I still have restrictive dieting habit and work out a lot. I stopped eating carbs because you hear what all the women say and I would eat and I was always hungry. It didn’t seem to matter. I normally eat collard greens and turkey burger for lunch. And I would need to keep snacking because I was never satisfied.  The last 2 weeks I started eating 1 piece of bread with my lunch and MY GOD do I feel amazing. A piece of bread is only 100 calories, but I actually feel satisfied. I don’t need to keep snacking after and my brain isn’t constantly thinking about food. Not only that but im not gaining weight like all the media says carbs make you do. Like I said before I work out a lot so maybe this should have been obvious to me but it wasn’t. Your body is trying to tell you something, maybe you need more carbs, more protein, or something else that your diet is lacking but you are feeling hungry for a reason! Listen!",
      "created_utc": 1574085588.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f85vd7j",
      "author": "RagingPython",
      "body": "Oh, this is something I have experience with! A couple of years back, I was diagnosed with CFS, Flu, an unknown flu-like illness, Bell’s Palsy, and something else that I’ve forgotten the name of. This lead to me being stuck at home for 6 months, practically bedridden for most of it. But during this period, I ate very little. Like, for the first 4 months, I was lucky to eat more than half a sandwich for the entire day. I wasn’t really hungry, and I felt too sick and tired to eat. I started eating more for the last couple, but I never caught up to my normal amount.\n\nAfter it ended though, and I recovered mostly, I had the same problem as you. I’ve always been someone who was hungrier than most, even as a baby, but this was ridiculous! Just like you said, I had to eat so much to feel full (1,500+ calories per meal) that I’d feel sick, and then I’d feel hungry again really quickly. Generally, I couldn’t eat enough to feel full most of the time simply because I couldn’t eat anymore without literally throwing up, or much more likely because my family wouldn’t let me.\n\nFor me, although I wanted to eat more, I live with my family and back then my mum insisted on doing all my cooking for me despite being nearly an adult, and that meant that I couldn’t eat much more than normal because of her. I ate a lot more snacks and started eating 4 meals a day for a while, 3 during the day and one at night when everyone else was asleep since my sleep schedule was still wrecked.\n\nEventually, it just went away. No clue why. It was horrible when I had it, but I couldn’t eat enough to make myself full most of the time.\n\nI expect I probably triggered it because I ate so little during those 6 months. I lost a huge amount of my weight, it was the lowest I’d been in years, but as soon as it ended I just kept gaining it at such an extreme rate that I ended up as fat as I am now. I’m not sure if that’s just because my metabolism got lowered or because I was eating too much due to being hungry.\n\nGood luck with it, regardless. I’m currently dealing with the opposite issue and if anything that’s even weirder, but I know how bad extreme hunger can be so I can sympathise.",
      "created_utc": 1574284005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f7npxqu",
      "author": "dumbbtchenergy",
      "body": "I have been following her extremely closely and I LOVE her - the issue is though that I am back to where my body would normally sit, and when I eat to full satiation it’s almost enough to make me feel sick as well. I’ve been eying this up to do it, but I’m also a bit nervous so I’ll see how it goes. I think I normally range upwards of 2.5k-3k calories now.",
      "created_utc": 1573912823.0,
      "score": 6,
      "context": [
        {
          "id": "f7nlnft",
          "author": "sewing_bitch",
          "body": "Hey, I'm not sure of your full medical situation but this may be able to help you find some clarity.\n\nhttps://youtu.be/coc5U-hHGYE\n\nThis is Stephanie Buttermoore and shes be recovering from extreme hunger. It's been so inspiring and incredibly useful as there is not a lot of common public knowledge about women's bodies in a scientific sense.",
          "created_utc": 1573909650.0
        }
      ]
    },
    {
      "id": "f7p5e83",
      "author": "None",
      "body": "I had it too! My weight went up to right about where I was before I started the disordered eating. Then, slowly, I started noticing fewer and fewer instances of needing to \"over\"eat. Things are so much easier now, and I'm at a healthy weight for my height. Last night I was sitting in front of a big jar of cookies, and I noticed them as I sat down, then didn't think about them again since I'd already eaten. It honestly felt like a miracle. For the past five years, it would have been pure torture, and I wouldn't have been able to focus on anything but those cookies. But now my body trusts me to feed it properly, so I no longer experience extreme hunger or food fixation.\n\n&#x200B;\n\nAnyway, totally normal OP! The more you honor that hunger, the faster you'll recover to a place where food doesn't dominate your life so much.",
      "created_utc": 1573942582.0,
      "score": 4,
      "context": [
        {
          "id": "f7o9k7n",
          "author": "freeheartsrecovery",
          "body": "I had extreme hunger in recovery!! Most important thing : listen to it. Eat every time you have physical or mental hunger (aks when u find yourself thinking of food noticeably). Your body is communicating with u and u can actually trust it. It knows what it's doing, which is crazy for us to believe. You won't balloon up. It is trying to help u survive and it had a TON of jobs to do inside u on the cellular level. It's trying to make up for the deficit u lived i  for so long. Check out extreme hunger vids on YouTube. Totally helped me! Yout body will take you to the place u were programmed to be at. Intuitive eating is the key and is hard to get the swing of!! Cuz for so long we \"felt\" like not eating or wh binging etc.. it's all about tuning in and doing the opposite of what the e.d. voice says. Scary I know, but it gets so easy in time!! U got this xoxo we",
          "created_utc": 1573923542.0
        }
      ]
    },
    {
      "id": "f7nqix1",
      "author": "sewing_bitch",
      "body": "I understand your hesitation. Eating a lot is daunting, no matter the benefits\n\nHave you spoken to your doctor about what you're coping with? Perhaps it'll be good to speak with someone who can safely monitor your progress. \n\nI'm sure you're very capable,   but having a knowledgable person that you can trust  could be beneficial in this situation",
      "created_utc": 1573913166.0,
      "score": 3,
      "context": [
        {
          "id": "f7nlnft",
          "author": "sewing_bitch",
          "body": "Hey, I'm not sure of your full medical situation but this may be able to help you find some clarity.\n\nhttps://youtu.be/coc5U-hHGYE\n\nThis is Stephanie Buttermoore and shes be recovering from extreme hunger. It's been so inspiring and incredibly useful as there is not a lot of common public knowledge about women's bodies in a scientific sense.",
          "created_utc": 1573909650.0
        },
        {
          "id": "f7npxqu",
          "author": "dumbbtchenergy",
          "body": "I have been following her extremely closely and I LOVE her - the issue is though that I am back to where my body would normally sit, and when I eat to full satiation it’s almost enough to make me feel sick as well. I’ve been eying this up to do it, but I’m also a bit nervous so I’ll see how it goes. I think I normally range upwards of 2.5k-3k calories now.",
          "created_utc": 1573912823.0
        }
      ]
    },
    {
      "id": "f7zeuok",
      "author": "jho95132",
      "body": "Not to be too focused on calories, but Stephanie said she ate around 5000 calories a day during her all in. I wouldn't be surprised if 3k wouldn't be making you feel full, as crazy as it sounds.",
      "created_utc": 1574109660.0,
      "score": 2,
      "context": [
        {
          "id": "f7nlnft",
          "author": "sewing_bitch",
          "body": "Hey, I'm not sure of your full medical situation but this may be able to help you find some clarity.\n\nhttps://youtu.be/coc5U-hHGYE\n\nThis is Stephanie Buttermoore and shes be recovering from extreme hunger. It's been so inspiring and incredibly useful as there is not a lot of common public knowledge about women's bodies in a scientific sense.",
          "created_utc": 1573909650.0
        },
        {
          "id": "f7npxqu",
          "author": "dumbbtchenergy",
          "body": "I have been following her extremely closely and I LOVE her - the issue is though that I am back to where my body would normally sit, and when I eat to full satiation it’s almost enough to make me feel sick as well. I’ve been eying this up to do it, but I’m also a bit nervous so I’ll see how it goes. I think I normally range upwards of 2.5k-3k calories now.",
          "created_utc": 1573912823.0
        }
      ]
    },
    {
      "id": "f80pq1q",
      "author": "dumbbtchenergy",
      "body": "It honestly sucks speaking to healthcare professionals sometimes about being hungry (like normal doctors, not specialists) because they just say to eat more. I just honestly want to know why I don’t have any “full” receptors, like full isn’t a feeling for me anymore. I’m going to look into seeing a specialist but I am weary as I’ve had a few bad experiences with doctors, like my previous gastro telling me I was too skinny (although I was already 4 years into recovery) and then basically telling me that the pain that would literally make me feel like my stomach was paralyzed was nothing. I’ve been hesitant but I know I can’t just let one experience mean that I never get professional guidance again, but it’s always in the back of my mind.",
      "created_utc": 1574134968.0,
      "score": 3,
      "context": [
        {
          "id": "f7nlnft",
          "author": "sewing_bitch",
          "body": "Hey, I'm not sure of your full medical situation but this may be able to help you find some clarity.\n\nhttps://youtu.be/coc5U-hHGYE\n\nThis is Stephanie Buttermoore and shes be recovering from extreme hunger. It's been so inspiring and incredibly useful as there is not a lot of common public knowledge about women's bodies in a scientific sense.",
          "created_utc": 1573909650.0
        },
        {
          "id": "f7npxqu",
          "author": "dumbbtchenergy",
          "body": "I have been following her extremely closely and I LOVE her - the issue is though that I am back to where my body would normally sit, and when I eat to full satiation it’s almost enough to make me feel sick as well. I’ve been eying this up to do it, but I’m also a bit nervous so I’ll see how it goes. I think I normally range upwards of 2.5k-3k calories now.",
          "created_utc": 1573912823.0
        },
        {
          "id": "f7nqix1",
          "author": "sewing_bitch",
          "body": "I understand your hesitation. Eating a lot is daunting, no matter the benefits\n\nHave you spoken to your doctor about what you're coping with? Perhaps it'll be good to speak with someone who can safely monitor your progress. \n\nI'm sure you're very capable,   but having a knowledgable person that you can trust  could be beneficial in this situation",
          "created_utc": 1573913166.0
        }
      ]
    }
  ]
}