{
  "id": "dz0e4y",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1574246556.0,
  "title": "Request: Think I might have an eating disorder. Don't know what to do",
  "selftext": " \n\nI'm afraid. I think I might have an eating disorder. recently, i've always struggled with the way I look but it's getting really bad. I'm weighing myself constantly, i've lost quite a bit of weight but I don't see a difference in my appearance and the people around me do. I still look huge and gross. I eat once a day and little as possible. The thought of eating makes me think I'm just going to become fatter and I'd do anything to stop it. I haven't talked to anyone about this yet. I don't want anyone to know or possible tell my parents. I decided to write this when I made a plan in my head to fake a migraine so I don't have to eat dinner tonight. What should I do?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dz0e4y/request_think_i_might_have_an_eating_disorder/",
  "score": 40,
  "num_comments": 7,
  "comments": [
    {
      "id": "f84h3oh",
      "author": "Mentalsupporthoodie",
      "body": "I don't quite know about giving advice on eating disorders, but I'd recommend eating small meals throughout the day if you can. And by meal I mean what people would normally have for lunch or dinner. Just downsize it. It's a step in the right direction. I've gotten to the point where I'm bedridden and I'm sick as all hell, I'd recommend eating, this isn't fun. Please please just eat a few meals x \nAccepting your body for how it is will be the next step ♡♡ your strong and you've got this x",
      "created_utc": 1574248251.0,
      "score": 13,
      "context": []
    },
    {
      "id": "f84lm83",
      "author": "pantomfine",
      "body": "I’m not a doctor at all, let me preface this. But it sounds like you may have body dismorphia. It goes hand in hand with eating disorders and your mind can play tricks on you and make you feel like you are larger than you are. Let me tell you though; don’t let your mind do that to you! I know it’s tough, but please take care of your body. Start having meals you really love and treat yourself to them. \n\nI struggle with an eating disorder too, only just recently seeing help for it and learning why I have such terrible body issues. It helps a lot to understand why you feel certain ways about yourself and to treat it. If you can afford to start seeing a professional, I would recommend it. Also there are groups online and anonymous centers you can go to to help you through this sort of thing. \n\nOr, alternatively, if you’d like to message me to just talk to someone who is going through something similar, I can at the least lend an ear. I’d hate to give you terrible advice since I’m still new to dealing with my own ED, but I know how hard it is to go through it alone.\n\nIn the meantime, please be kind to yourself! Don’t look in the mirror if you have to, have someone hide your scales, and eat foods you enjoy to help pace yourself through it! \n\nEvery journey has to start somewhere, and knowing what issues you have is a great first step to helping yourself heal. You can do it! ❤️",
      "created_utc": 1574253680.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f858xiz",
      "author": "RagingPython",
      "body": "It certainly sounds like it to me. I’m not a doctor but it looks like a case of body dysmorphia causing you to develop one. Judging by the fact that you are already eating once a day and not much, it’s probably pretty bad.\n\nI don’t know what advice to give, but you should probably consider talking to someone professional, like a doctor or something.",
      "created_utc": 1574270165.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f869rc7",
      "author": "Devansffx",
      "body": "I am not a professional but i suggest you talk to one. It's really good that you are self-reflective enough think about it.\n\nMy (48f) daughter (19) is currently involved in an intense disorder program. I know that just saying \"but you're not fat\" doesn't help. Recovery is a process that takes work on your part and support of loved ones. Please talk to your parents or someone you trust.\nMD i have a recommendation.\nIf it would help, feel free to PM me. I have no idea where you are but if you are near Baltimore",
      "created_utc": 1574293206.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f869rrm",
      "author": "Devansffx",
      "body": "I am not a professional but i suggest you talk to one. It's really good that you are self-reflective enough think about it.\n\nMy (48f) daughter (19) is currently involved in an intense disorder program. I know that just saying \"but you're not fat\" doesn't help. Recovery is a process that takes work on your part and support of loved ones. Please talk to your parents or someone you trust.\nMD i have a recommendation.\nIf it would help, feel free to PM me. I have no idea where you are but if you are near Baltimore i have a referral if that would help.\n\n*Big momma hug*",
      "created_utc": 1574293214.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f878eub",
      "author": "tymopa",
      "body": "Good on you for being so concerned about this because EDs are relentless and rarely let go without professional help. There is so much isolation, shame from lying and keeping secrets, and physically damaging behaviors. You are not alone in this. I would look on NEDA's site and figure out what resources there are for you. Also, check out the advise for parents. Then, hopefully sooner than later, you'll talk to your parents so they can get on board. All of this takes education and patience, but don't underestimate how vicious something like this can turn into if it isn't addressed. You are worth being healthy and accepted for all of your perfections and  imperfections.  Best of luck.",
      "created_utc": 1574320317.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f87e7ae",
      "author": "lupoverde",
      "body": "Go to your doctor. It’s really, really fucking difficult to talk to someone about it, but I promise they will be understanding. It took me 7 years to see someone and I’m glad I finally did.",
      "created_utc": 1574328750.0,
      "score": 2,
      "context": []
    }
  ]
}