{
  "id": "dzhfy1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1574332469.0,
  "title": "Request: My BF is underweight and it really triggers my ED",
  "selftext": "My BF is really underweight, he doesn’t choose to be he just forgets to eat all the time and really wants to gain weight. I’m “trying” to recover atm and it’s really hard because he barely eats and when he eats it’s always unhealthy (soup, grilled cheese, fastfood). Just seeing him barely eating makes me wonder if I really need food and makes me jealous of how easy it is for him. I don’t want to upset him but I don’t know what to do.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dzhfy1/request_my_bf_is_underweight_and_it_really/",
  "score": 89,
  "num_comments": 13,
  "comments": [
    {
      "id": "f87y8og",
      "author": "illygreen",
      "body": "My boyfriend eats a meal a day without fail. He's also really tired all of the time and it's obvious it's because of his eating habits. I get envious of his ribs sometimes but seeing him exhausted after 9 hours of sleep is a good incentive to keep going on a healthier path.",
      "created_utc": 1574345012.0,
      "score": 24,
      "context": []
    },
    {
      "id": "f87h9vx",
      "author": "Sataninchen99",
      "body": "I know how you feel... my bf is the same and he really gets triggered when someone comments on his eating... like we had full on fights about it... \nthe whole thing kinda made me relapse but I’m fighting everyday to not give in the urges to not just fucking eat everything around me... it’ll get better with time but it’ll never be “easy”... I’m sorry",
      "created_utc": 1574332694.0,
      "score": 17,
      "context": []
    },
    {
      "id": "f88tsgn",
      "author": "posicovery",
      "body": "I know this is not the point of your post, but I think one thing you need to break yourself of is classifying some foods as “good” and some foods as “bad.” Everything we eat provides the body with nourishment, and honestly when you get down to it breaks down into the same chemical compounds. Food should be neutral as long as you’re eating a mindful amount of it. If you classify foods as “bad” or “junk” you end up restricting them, which makes them forbidden fruit, which makes you crave them so much more than if you just gave yourself permission to eat it mindfully every so often.",
      "created_utc": 1574361008.0,
      "score": 10,
      "context": []
    },
    {
      "id": "f89c70b",
      "author": "RaqnRoller",
      "body": "I have never related to anything more. My boyfriend is so so skinny and constantly talks about how he wants to gain weight but his metabolism is so fast and how he “eats so much” when he doesn’t eat much at all. It always makes me feel like “maybe I shouldn’t eat anything, if he doesn’t need to eat neither do I”",
      "created_utc": 1574370636.0,
      "score": 8,
      "context": []
    },
    {
      "id": "f887wgc",
      "author": "blazerfan360",
      "body": "I think we’ve all “forgotten” to eat, but if he’s really listening to his body, he would be able to make room for food. Men are so under diagnosed with eating disorders",
      "created_utc": 1574350102.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f8810ok",
      "author": "regrettospaghetto",
      "body": "We're all different! He can't help it to some degree! Yes, he needs to get healthy but try and get help (always) and try to focus on yourself. Im in the same boat rn and i should take my own advice but i just want you safe and healthy!! yiu deserve food too!!",
      "created_utc": 1574346576.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f8a0ccw",
      "author": "PrincepsMagnus",
      "body": "I’m that guy. My girlfriend is sad because I don’t eat enough. I used to be over 210 lbs. now I’m 170 soaking wet. I hate my body and how small I got. My relationship with food is ruined.",
      "created_utc": 1574384313.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f87zjsa",
      "author": "T_86",
      "body": "Does he know about your ED struggles? Not just know you have an ED, but does he know the anxieties you feel and how others eating habits can play a big trigger? If not, please try to help him understand. Maybe you two can set timers or reminders to both eat at certain times when you’re both together. Just a thought. :)",
      "created_utc": 1574345769.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f887hza",
      "author": "anoradragona",
      "body": "I know how you feel! You guys should try to eat healthier together. Does he know about your ED? If not, maybe you should tell him and you should also tell him that it makes you uncomfortable that he’s underweight and that he should eat healthier so he has a healthy weight.",
      "created_utc": 1574349900.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fakfz94",
      "author": "p_nks",
      "body": "My partner is struggling with their body image and I don't know how to best support them while taking care of myself. I've tried to rationalize their feelings with them and be supportive but it's almost every day now and it's super triggering for me. He definitely has developed body dysmorphia, sometimes I wonder if it's bc of me that he has this at all.",
      "created_utc": 1576166489.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fb9odtx",
      "author": "witchoftheswamp",
      "body": "I relate to this a lot! My last relationship was with a very overweight guy and I ended up gaining a lot of weight throughout the three year long relationship, both because of naturally copying his unhealthy eating habits and the fact that the relationship itself was very unhealthy and caused me to binge eat. Towards the end of that relationship I began restricting and lost about 50 pounds. Now I'm at a pretty healthy/ normal weight. But now I'm dating a very skinny guy and it triggers my ED and causes me to mimic his poor eating habits. I envy his bony figure and it makes me judge myself a lot. I'm not sure how to combat this besides learning to love yourself and fill your time with positive activities/ people. Best of luck!",
      "created_utc": 1576644289.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f9p9c1a",
      "author": "jujuulia",
      "body": "happy cake day!  i hope you continue on your healthy path <3",
      "created_utc": 1575526017.0,
      "score": 2,
      "context": [
        {
          "id": "f87y8og",
          "author": "illygreen",
          "body": "My boyfriend eats a meal a day without fail. He's also really tired all of the time and it's obvious it's because of his eating habits. I get envious of his ribs sometimes but seeing him exhausted after 9 hours of sleep is a good incentive to keep going on a healthier path.",
          "created_utc": 1574345012.0
        }
      ]
    },
    {
      "id": "fb9owz5",
      "author": "witchoftheswamp",
      "body": "Also just wanted to add- thank you for sharing this! This is something I've been thinking about a lot but have never really seen it addressed before",
      "created_utc": 1576644769.0,
      "score": 1,
      "context": [
        {
          "id": "fb9odtx",
          "author": "witchoftheswamp",
          "body": "I relate to this a lot! My last relationship was with a very overweight guy and I ended up gaining a lot of weight throughout the three year long relationship, both because of naturally copying his unhealthy eating habits and the fact that the relationship itself was very unhealthy and caused me to binge eat. Towards the end of that relationship I began restricting and lost about 50 pounds. Now I'm at a pretty healthy/ normal weight. But now I'm dating a very skinny guy and it triggers my ED and causes me to mimic his poor eating habits. I envy his bony figure and it makes me judge myself a lot. I'm not sure how to combat this besides learning to love yourself and fill your time with positive activities/ people. Best of luck!",
          "created_utc": 1576644289.0
        }
      ]
    }
  ]
}