{
  "id": "dzzb3j",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1574419231.0,
  "title": "Request: Worried about daughter",
  "selftext": "My wife has a really bad eating disorder. I worry that it will rub off on my daughter. Combined with the eating disorder is really bad anxiety. She refuses to go to therapy. \n\nI'm worried about my daughter though. My wife gets to me pretty often and hurts me emotionally and I'm a grown man - I can only imagine the affect it has on our daughter. She's only 4. \n\nRecently our daughter is refusing to eat lunch at daycare. She eats decently at home, albeit slowly. I'm worried the eating disorder is starting to affect her. I've heard it can affect even kindergarten aged children. \n\nIs this normal kid behavior or the beginning of an eating disorder?  How do I make sure my daughter doesn't copy my wife's behavior?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/dzzb3j/request_worried_about_daughter/",
  "score": 66,
  "num_comments": 15,
  "comments": [
    {
      "id": "f8bbjby",
      "author": "None",
      "body": "Honestly this is concerning especially as she’s so young. My mom didn’t have an ED but she did have an unhealthy relationship with her body and both my sister & I have developed EDs. You should talk to a therapist yourself as well as your child’s pediatrician . Your daughter’s health is the priority. I’m so sorry you’re dealing with this, OP.",
      "created_utc": 1574432768.0,
      "score": 34,
      "context": []
    },
    {
      "id": "f8b59t9",
      "author": "myufp",
      "body": "the well-being of your child is probably a little out of our league as redditors to give advice, i highly recommend doing some research about eating disorders in children and encouraging your wife to see a professional, if not for her then for her daughter. and above all, letting your daughter know you love her.",
      "created_utc": 1574427394.0,
      "score": 18,
      "context": []
    },
    {
      "id": "f8b0tk3",
      "author": "None",
      "body": "I’m afraid that if your daughter gets an ED you would blame your wife. EDs are genetic. Your wife could be 100% recovered and your daughter would still be at risk\n\nThat being said, teach your child the importance of eating healthy. Provide home cooked dinners at the table as often as you can as she grows up. \n\n\nhttps://www.ahaparenting.com/parenting-tools/safety/prevent-eating-disorder-child this has good advice",
      "created_utc": 1574422296.0,
      "score": 31,
      "context": []
    },
    {
      "id": "f8bmg63",
      "author": "None",
      "body": "Counseling or counseling with a dietitian who believes in intuitive eating may be helpful to the daughter then. They would have the most insight into what is normal and what is abnormal for her age. They could also coach you on demonstrating healthy and normal eating behaviors to the little one. As you know, the kiddos see and pick up on sooooo much more than you’ll even know until they’re much older. It’s vital this is addressed now. \n\nI first began engaging with my ED in the first grade, and that’s really only as early as I can remember. My mother had an untreated ED too. Earlier intervention by a professional could have saved me soooo much struggle. \n\nSo, it’s your choice and it may be hard to find someone wanting to work with this situation, but unless you’re going to leave your wife, I urge you to consider my suggestion :) Good luck! It’s great that you have this insight and want to help your child develop normally and safely.",
      "created_utc": 1574440315.0,
      "score": 5,
      "context": []
    },
    {
      "id": "f8bcx02",
      "author": "None",
      "body": "i’d start therapy for her as soon as she gets old enough to adequately convey her feelings. i’m not a neurologist and i know nothing about children; note that that time could be now. but early intervention would’ve done wonders for me.",
      "created_utc": 1574433791.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f8dc0d4",
      "author": "juniorasparagus13",
      "body": "Sometimes kids that young just go through weird phases, especially if they have had a big change or a trauma come up. While it could be eating disorder related, I would give it a week or two and see what happens. With a four year old, maybe making the food fun or allowing for some playing with foods could help. I would also recommend having the mom get help for her eating disorder. Even if she refuses inpatient treatment, there are free eating disorders anonymous meetings, recovery podcasts, and tons of literature focused on eating disorders and recovery.",
      "created_utc": 1574484907.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f8d6wvc",
      "author": "karupiin",
      "body": "EDs run in my family. Me, my sister, my mom, my uncle, and my grandmother all have an ED of some sort. My little sister (not the one with the ED) is someone I worry about constantly. She’s much younger than I am, only 11, but she grew up in a house with three women who had EDs. She’s very vigilant about that stuff, she’s seen me looking into a mirror and instinctively knew I was criticizing myself, she hugged me and told me I look great. She’s very slim and athletic and still worries about her body so I worry that she will develop one as well. I’ve had my eating disorder since I was even younger than 11, she could already have one for all I know. \nMy advice is to have a GOOD talk about this with your wife. You are 100% valid in being worried for your daughter, I would be too. \nMake sure you teach your daughter healthy eating habits, and never make her feel ashamed for ANYTHING she eats. GUILT is a main factor in eating disorders, remember this. A major reason I developed anorexia is because of my mother criticizing my eating habits from an early age and never teaching me proper eating habits. My mother is bulimic and would always eat in secret/by herself so we never sat down for proper meals at proper times, she would occasionally make me dinner and then I had to just raid the snack cabinet/fridge for all my other meals. My whole life I never had breakfast, and would often just skip lunch at school because she never packed me anything and the school lunches were not appealing to me since I’m a picky eater. In the end this lead to me only eating dinner, and I would eat a lot at once which made my mother angry because she thought I was binging even though it was my only meal that day. Even now, being a full grown adult who does not live with her, I only eat at night, even when I’m trying to eat normally. The only food I can bring myself to eat during the day is meal replacement bars. \nI never had a father, maybe if I had a caring and supportive dad to make sure I was properly fed things would have been very different. Your daughter is so lucky to have a father like you who cares! \nThere’s only so much you can singlehandedly do, your wife has a lot more she needs to do to make sure your daughter grows up with a healthy attitude towards food and her body. Your wife needs to realize that her eating disorder is not just about herself anymore, children pick up on behaviors very easily and it’s not something they can simply un-learn when they are older. If your daughter develops an ED, it could be what kills her. \nAlso, as someone very stuck in their disordered habits, I know it won’t be easy for your wife to just stop having an eating disorder. What she really needs to do is pay close attention to what your daughter sees and hears. She needs to NEVER criticize her own appearance or her eating in front of your daughter. \nYou can’t control your wife’s actions, she might never change because eating disorders can make people very selfish. Even if she doesn’t change, just do the best you can. Love your daughter no matter what, be positive with her, always be encouraging. Never give up on her. Make sure she NEVER feels unloved. I really REALLY hope your daughter never has to go through this terrible disease. And I hope your wife can get better too.",
      "created_utc": 1574480104.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f8dcdsm",
      "author": "None",
      "body": "In my experience my mom had a gastric bypass sometimes she would throw up the food because she couldn’t swallow. I developed an ED slowly through middle school and always saw it as something normal since my mom “would throw up too.”",
      "created_utc": 1574485287.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f8c54ny",
      "author": "regrettospaghetto",
      "body": "Yes make sure to do something!!! I have mekories of my mom and its affected me SO much. Make sure she isnt eating lunch for other reasons too- i didnt eat lunch because others fed me \"better\" food. Having your mom self hate and express it WILL affect her. She looks up to her mom so she wants to be like her and make her prouder. Thats coming from someone going through it but might be different. It could turn to nothing or to anorexia or binging or another. Keep an eye on her! Thanks for reaching out! Youre a good parent!",
      "created_utc": 1574452666.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f8bmu7j",
      "author": "_kittensgalore_",
      "body": "Also while his wife may not want to see a therapist, there’s nothing wrong with suggesting therapy for their daughter. Hopefully she’s more open to getting her child help.",
      "created_utc": 1574440573.0,
      "score": 8,
      "context": [
        {
          "id": "f8b59t9",
          "author": "myufp",
          "body": "the well-being of your child is probably a little out of our league as redditors to give advice, i highly recommend doing some research about eating disorders in children and encouraging your wife to see a professional, if not for her then for her daughter. and above all, letting your daughter know you love her.",
          "created_utc": 1574427394.0
        }
      ]
    },
    {
      "id": "f8b95l1",
      "author": "Krisloveskat",
      "body": "Just want to clear up one point. ED’s do have a genetic component, but are not be ANY means a sole factor of  developing an eating disorder, there are behavioral and environmental components as well. I am sure that didn’t help you feel better, but wouldn’t you rather hear the truth?",
      "created_utc": 1574430885.0,
      "score": 27,
      "context": [
        {
          "id": "f8b0tk3",
          "author": "None",
          "body": "I’m afraid that if your daughter gets an ED you would blame your wife. EDs are genetic. Your wife could be 100% recovered and your daughter would still be at risk\n\nThat being said, teach your child the importance of eating healthy. Provide home cooked dinners at the table as often as you can as she grows up. \n\n\nhttps://www.ahaparenting.com/parenting-tools/safety/prevent-eating-disorder-child this has good advice",
          "created_utc": 1574422296.0
        }
      ]
    },
    {
      "id": "f8bc96l",
      "author": "None",
      "body": "That’s a valid point, genetics definitely aren’t end all be all in this instance and it is nurture as well as nature. I tried to communicate this previously but I might have failed.",
      "created_utc": 1574433302.0,
      "score": 12,
      "context": [
        {
          "id": "f8b0tk3",
          "author": "None",
          "body": "I’m afraid that if your daughter gets an ED you would blame your wife. EDs are genetic. Your wife could be 100% recovered and your daughter would still be at risk\n\nThat being said, teach your child the importance of eating healthy. Provide home cooked dinners at the table as often as you can as she grows up. \n\n\nhttps://www.ahaparenting.com/parenting-tools/safety/prevent-eating-disorder-child this has good advice",
          "created_utc": 1574422296.0
        },
        {
          "id": "f8b95l1",
          "author": "Krisloveskat",
          "body": "Just want to clear up one point. ED’s do have a genetic component, but are not be ANY means a sole factor of  developing an eating disorder, there are behavioral and environmental components as well. I am sure that didn’t help you feel better, but wouldn’t you rather hear the truth?",
          "created_utc": 1574430885.0
        }
      ]
    },
    {
      "id": "f8bjlwz",
      "author": "RagingPython",
      "body": "You know, that makes a lot of stuff with my family make more sense.",
      "created_utc": 1574438414.0,
      "score": 4,
      "context": [
        {
          "id": "f8b0tk3",
          "author": "None",
          "body": "I’m afraid that if your daughter gets an ED you would blame your wife. EDs are genetic. Your wife could be 100% recovered and your daughter would still be at risk\n\nThat being said, teach your child the importance of eating healthy. Provide home cooked dinners at the table as often as you can as she grows up. \n\n\nhttps://www.ahaparenting.com/parenting-tools/safety/prevent-eating-disorder-child this has good advice",
          "created_utc": 1574422296.0
        },
        {
          "id": "f8b95l1",
          "author": "Krisloveskat",
          "body": "Just want to clear up one point. ED’s do have a genetic component, but are not be ANY means a sole factor of  developing an eating disorder, there are behavioral and environmental components as well. I am sure that didn’t help you feel better, but wouldn’t you rather hear the truth?",
          "created_utc": 1574430885.0
        }
      ]
    },
    {
      "id": "f8diwie",
      "author": "brandnewdayinfinity",
      "body": "I fully blame it on my parents who were obsessed with looking perfect and being skinny. \nYes I’ve got metabolic issues that contributed but my guess is I would have reacted in a very different way if I didn’t have my parents voices screaming at me.",
      "created_utc": 1574492930.0,
      "score": 3,
      "context": [
        {
          "id": "f8b0tk3",
          "author": "None",
          "body": "I’m afraid that if your daughter gets an ED you would blame your wife. EDs are genetic. Your wife could be 100% recovered and your daughter would still be at risk\n\nThat being said, teach your child the importance of eating healthy. Provide home cooked dinners at the table as often as you can as she grows up. \n\n\nhttps://www.ahaparenting.com/parenting-tools/safety/prevent-eating-disorder-child this has good advice",
          "created_utc": 1574422296.0
        },
        {
          "id": "f8b95l1",
          "author": "Krisloveskat",
          "body": "Just want to clear up one point. ED’s do have a genetic component, but are not be ANY means a sole factor of  developing an eating disorder, there are behavioral and environmental components as well. I am sure that didn’t help you feel better, but wouldn’t you rather hear the truth?",
          "created_utc": 1574430885.0
        }
      ]
    },
    {
      "id": "f8cj95j",
      "author": "Simplicityobsessed",
      "body": "Yeah! I know that I have a tendency towards an anxious avoidant personality, which I think makes me approach my feelings about food the same way. My mother raised me having her own odd anxious relationship with food, and it was a combo of that and the genetics that made me develop my own. \n\nIt’s totally a combo of genetics and environmental, just like alcoholism cannot happen without alcohol, even if the genetics are there. :p \n\nIt’s best to talk to a therapist, and/or support group if you can! They would know what it’s like to have a loved one with an ED, and how to manage how it effects you, as well as your family and it’s dynamic. \n\nRemember, that while your wife may struggle herself, it doesn’t mean she has the right to treat you poorly, or have a evident, fraught relationship with food around your daughter! I know plenty of women who have children, and when they relapse, still make sure to eat with their children, to avoid such. So yes, while EDs May make us more predisposed to doing horrible things, it doesn’t excuse them, and if you feel like you need to get out or take a break, PLEASE do that.",
      "created_utc": 1574461434.0,
      "score": 4,
      "context": [
        {
          "id": "f8b0tk3",
          "author": "None",
          "body": "I’m afraid that if your daughter gets an ED you would blame your wife. EDs are genetic. Your wife could be 100% recovered and your daughter would still be at risk\n\nThat being said, teach your child the importance of eating healthy. Provide home cooked dinners at the table as often as you can as she grows up. \n\n\nhttps://www.ahaparenting.com/parenting-tools/safety/prevent-eating-disorder-child this has good advice",
          "created_utc": 1574422296.0
        },
        {
          "id": "f8b95l1",
          "author": "Krisloveskat",
          "body": "Just want to clear up one point. ED’s do have a genetic component, but are not be ANY means a sole factor of  developing an eating disorder, there are behavioral and environmental components as well. I am sure that didn’t help you feel better, but wouldn’t you rather hear the truth?",
          "created_utc": 1574430885.0
        },
        {
          "id": "f8bjlwz",
          "author": "RagingPython",
          "body": "You know, that makes a lot of stuff with my family make more sense.",
          "created_utc": 1574438414.0
        }
      ]
    }
  ]
}