{
  "id": "e1w945",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1574764712.0,
  "title": "Request: I Think About Food Constantly",
  "selftext": "Hi. So this is my (20F) first post to this thread so sorry if I’m doing any of this wrong. \n\nBut I’ve had a really bad relationship with food for a long time, and I’ll try and keep this short- the thing is my dad used to really meanly comment on my eating habits my whole life. Always telling me I was eating too much (I was a chubby kid, but active) and I needed to diet or I was going to end up like my obese aunt. So by the time I’d gotten to high school I’d developed pretty severe depression (more to it than just this but that’s another story) and started restricting myself from eating, exercising on the treadmill instead of going to the cafeteria for lunch, skipping meals with friends, and constantly keeping my daily calorie count below a certain number. I’ve never seen a therapist or ever really talked to anyone about it, but after graduating I’d been eating more (no more calorie counting, but I’m still very aware of how much calories I’m consuming) and in the past two and a half years I’ve put on more weight and I’ve been obsessed with how I look. And the days when the depression is at its worst are the days I don’t eat, but all I do is think about food.\n\nIf I’m not eating, I’m thinking about eating or making food, all I want to do is eat. But I hate myself for eating, I feel guilty, like I’m betraying myself, like I’m doing something wrong. I’m unhappy but I just don’t know what to do about it, I’m in an unbearable cycle. And it definitely doesn’t help that I work in a restaurant full time and I’m surrounded by food constantly. I just look down and want to eat anything I see, food is always on my mind and I just want to not think about it anymore.\n\nI don’t know if this actually fits into the classification of eating disorder or not but I’m just really not sure what else it could be... am I just crazy? Is this normal? \n\nI hate myself everyday and I just don’t know how to fix it.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/e1w945/request_i_think_about_food_constantly/",
  "score": 43,
  "num_comments": 5,
  "comments": [
    {
      "id": "f8s2ub7",
      "author": "aliheirloom",
      "body": "I'm also a 20F with a similar relationship to food. This year I gained weight back after being slim for 2 years. I've hit a low with depression and am currently fasting and low restricting in an effort to lose the weight again. \n\nI'm either binge eating or restricting to almost nothing, it's like there's not a middle ground. When you're sick like this there just isn't. I wish I could offer advice but I don't know the answers. But you are definitely disordered, this kind of thing is not normal. I'm not a doctor so I really can't say much else, but you should seek help. I need it too but I don't know if I'll ever get it.",
      "created_utc": 1574766481.0,
      "score": 10,
      "context": []
    },
    {
      "id": "f8sc1gb",
      "author": "unjennie",
      "body": "That is very similar to some of the problems I have... my therapist says that I've restricted myself from food for so long that as a result I obsess over it and that's why I feel like I will never get tired of eating, why I feel that there will never be a middle ground. He compared it to a child that has a new toy: food is my new toy and I feel like I'll never get tired of it, because I've been restricting myself from it for so long. So the way to deal with this is break the cycle. If you keep restricting yourself, food will always be a reason to obsess over, it will always be \"the new toy\". Try to eat, don't let yourself get hungry and if you binge, it's okay. The guilt will come, but accept it and don't try to make it go way, because that will result in trying to compensate and then you're back on the cycle again. With time it will lose its power, food will stop to seem so important, because eating will become a normal thing. And if you fear eating (I do) just try to always eat a little more everyday. One spoonful of rice at the time... Allow yourself to eat, you are human and need it not only to survive, but also to enjoy. I know that this is easy to say and much more difficult to do... I'm trying and I'm still not okay either, but trying is the first step. Try to seek help, if you can, it really helps. Besides that, I wish you all the luck! You deserve to eat and be happy  <3",
      "created_utc": 1574776581.0,
      "score": 6,
      "context": []
    },
    {
      "id": "f8t1qry",
      "author": "easternstorm8118",
      "body": "Deep breath. You are not crazy, struggles with food/body are far more common than anyone talks about. Normal or not, classified as an ED per the DSM criteria or not, it’s clear your relationship with food and your body has suffered and for that reason alone you are worthy of treatment and help.\n\nI’d highly suggest seeking out a local ED informed dietitian & therapist to help you unpack these deep rooted beliefs. It’s scary & it may feel impossible at times, but there is a beautiful life to experience outside this fear. You can normalize your eating, obsess over it less & feel free from these thoughts ❤️❤️❤️",
      "created_utc": 1574793910.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f8uktfq",
      "author": "silentlymodest",
      "body": "Please watch Tabitha Farrar she does an amazing job at explaining so many ED questions, you yourself can even email her, I find her a credible source as she her self has had and ED and not to mention thanks to her I started my recovery journey.\n\n[Mental Hunger is your body asking for food]\nhttps://youtu.be/bT3GKseSR9k",
      "created_utc": 1574832818.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f984nbd",
      "author": "imnotinatheater",
      "body": "Hey Thanks for posting. I can relate a bit. I’m [26 F], I’ve struggled with food my whole life. My weight has yo-yo’d since I was a kid. \n\nThere are support groups allied over eaters anonymous- they deal with all eating disorders in a group setting just like AA. \n\nThank you for helping me not feel alone tonight.",
      "created_utc": 1575173891.0,
      "score": 1,
      "context": []
    }
  ]
}