{
  "id": "e3layx",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1575063178.0,
  "title": "Request: Tinder date revealed she starts treatment for an ED. I want to see her again.. should I?",
  "selftext": "I had a first date a couple of days ago, with someone who told me she's about to be moving to my neighbourhood *for the winter* (she currently lives in a suburb of the large-ish city I live in). I asked her what was bringing her temporarily and she disclosed that she's starting treatment for an eating disorder. The date otherwise went (I felt) extremely well, and it sounds like we are both interested in meeting up again soon, but I'm wondering if it's healthy for her to pursue anything right now? Currently I'm planning to ask her the following questions:\n\n- Do the facilitators of her treatment program recommend dating while she's going through the program?\n- How can I (otherwise) support her while she's going through the program?\n\nBut also, I'm concerned about how her relationship with me could affect her recovery. Like, if we date for 8 weeks and it doesn't work out, could it exacerbate potential body dysmorphia issues (if her disorder is one which stems from those)?\n\nI'm nervous, because I otherwise felt like a hit me over the head, butterflies in my stomach type of connection, based on other things we have in common, but I don't want to pursue something with her right now if it could impede her recovery.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/e3layx/request_tinder_date_revealed_she_starts_treatment/",
  "score": 54,
  "num_comments": 14,
  "comments": [
    {
      "id": "f93trlt",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1575068300.0,
      "score": 36,
      "context": []
    },
    {
      "id": "f93z23u",
      "author": "sikkerhet",
      "body": "honestly you should probably just be a friend until she's through treatment and seems generally stable. Then, if a relationship makes sense, go for it.\n\nStarting a relationship immediately before treatment is playing a pretty risky game.",
      "created_utc": 1575072477.0,
      "score": 12,
      "context": []
    },
    {
      "id": "f93qzce",
      "author": "DelicateBones",
      "body": "I would go on the second date first to make sure you’re both on the same page. You don’t want to overwhelm her right off the bat.\n\nAnd then I think those are some really good questions to ask her.\n\nWhen my boyfriend found out about my eating disorder, he did a little bit of googling. The internet can be especially helpful (as long as they’re credible websites) in giving you a glimpse into what may be safe/unsafe topics or comments to discus/say to someone with an eating disorder.",
      "created_utc": 1575066209.0,
      "score": 23,
      "context": []
    },
    {
      "id": "f94cfh1",
      "author": "seatangle",
      "body": "I think those are good questions to ask. As someone else mentioned, friendship is probably the best route at this point. Obviously we don’t know where she is in recovery or how intensive the treatment is, but I think not rushing into anything and treating it as some thing closer to friendship would be the wisest move for the time being. \n\nTreatment can bring up a lot of feelings, I know I was definitely vulnerable at times, and it isn’t a great idea to get into anything serious when it can already be so draining.",
      "created_utc": 1575083902.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f94ueuj",
      "author": "Devansffx",
      "body": "I think the fact that you are asking questions and thinking beyond yourself says so much about you.\n\nShe should consult with her treatment providers. I don't know if i would say that a relationship is entirely a bad thing. My daughter (19) is in a program now and i know they should have resources available. You are going to want to connect to resources so that if you two are out, you don't accidentally trigger her or reinforce bad behavior.",
      "created_utc": 1575103965.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f94yl2u",
      "author": "throwaway-m1",
      "body": "I know that some people in the comments are saying that it's a bad idea to date when someone's in her situation, but she's an adult and I think if there are no red flags, you're both having a good time, and you're both communicating well, go for it. While sometimes it can be complicated dating while in recovery, I think building a life outside of your eating disorder, including relationships, is super important and healthy. \n\nI went on a few dates with the same person very early in recovery, and it didn't go anywhere, but we had a ton of fun.\n\n I met my current partner shortly after I decided to recover from a relapse. Having something going on in my life that doesn't have anything to do with my eating disorder has been so helpful. It reminds me that I am not my eating disorder, being in recovery = the ability to have a relationship. Focusing 1000% on recovery, and not having a life outside of it, personally, makes me extremely miserable and limits my recovery. \n\nAnyways, I hope this comment might encourage you to not write her off because she's in early recovery. She's a whole person outside of her disorder + recovery.",
      "created_utc": 1575110634.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f96hsmx",
      "author": "madieish",
      "body": "you're amazing for this. it could potentially be a whirlwind and a half kind of experience for you, and she may not be able to devote all of her energy towards a relationship like she wants to right now. but on the other hand, you may be the one who can help pull her through when she needs it the most...but it will be difficult for you at times. you seem to understand the severity of all of this so i applaud you!",
      "created_utc": 1575145338.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f98ykt7",
      "author": "liziphin",
      "body": "Ask her if she thinks she’s ready for a relationship rn and make sure to say it’s ok if your not I’ll be here to support you through it either way if she says yes then take is slow don’t rush anything and be the most loving and supportive partner you could ever be also refrain from doing things like calling yourself or other ppl fat even if it’s just a joke if she says she’s not ready do what you promised support her through it but since you want a relationship and she thinks she’s ready for one don’t say no cause you don’t think she’s ready and make sure she knows that if she says yes she can ask to take a break from it at anytime to spilt focus on recovery",
      "created_utc": 1575184642.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f9cc3dc",
      "author": "ladygabriola",
      "body": "Be a friend to her first and foremost. She could use the support. If you are there for her as a support system your relationship can grow into something or not. At the very least you'll both have a new friend.",
      "created_utc": 1575221728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f9408hb",
      "author": "tymopa",
      "body": "This!",
      "created_utc": 1575073467.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hwl3kk4",
      "author": "Designer-Dance-1346",
      "body": "Yes",
      "created_utc": 1644629016.0,
      "score": 1,
      "context": []
    },
    {
      "id": "f96hf5o",
      "author": "Musicluver77",
      "body": "Great advice! I would second this as well. It is very emotionally draining going through treatment, as a lot of old demons tend to surface. It is definitely not the time to start a relationship.",
      "created_utc": 1575145096.0,
      "score": 1,
      "context": [
        {
          "id": "f93trlt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1575068300.0
        }
      ]
    },
    {
      "id": "f9430um",
      "author": "shcbutterfly",
      "body": "I agree with sikkerhet for two reasons. \n\n1) When I was in (outpatient) treatment I was exhausted, physically and emotionally ALL the time. I can home from my program and immediately went to sleep, almost daily. Not sure if this is the norm or not, but there is no way I would have been able to participate in or maintain any kind of romantic relationship. \n\n2) In a weird and twisted way, the eating disorder is kinda like a boyfriend. Obviously not a good one, he’s a abusive prick, but for me it was like having an sadistic partner in my head all the time. So, jumping into a relationship with someone who is “breaking up” with their relationship with food and their body may not make a ton of sense. You probably don’t want to be the person to replace the eating disorder in her life. She needs to develop a strong sense of who she is without the ED before diving into a new relationship. You don’t want to be the ED rebound, you know? I’m not sure if I’m making any sense here, but hopefully I am!",
      "created_utc": 1575075849.0,
      "score": 8,
      "context": [
        {
          "id": "f93z23u",
          "author": "sikkerhet",
          "body": "honestly you should probably just be a friend until she's through treatment and seems generally stable. Then, if a relationship makes sense, go for it.\n\nStarting a relationship immediately before treatment is playing a pretty risky game.",
          "created_utc": 1575072477.0
        }
      ]
    },
    {
      "id": "fdmw13o",
      "author": "AintNothinbutaGFring",
      "body": "> I went on a few dates with the same person very early in recovery, and it didn't go anywhere, but we had a ton of fun.\n\nOP here, do you mind me asking why it didn't go anywhere?",
      "created_utc": 1578568435.0,
      "score": 1,
      "context": [
        {
          "id": "f94yl2u",
          "author": "throwaway-m1",
          "body": "I know that some people in the comments are saying that it's a bad idea to date when someone's in her situation, but she's an adult and I think if there are no red flags, you're both having a good time, and you're both communicating well, go for it. While sometimes it can be complicated dating while in recovery, I think building a life outside of your eating disorder, including relationships, is super important and healthy. \n\nI went on a few dates with the same person very early in recovery, and it didn't go anywhere, but we had a ton of fun.\n\n I met my current partner shortly after I decided to recover from a relapse. Having something going on in my life that doesn't have anything to do with my eating disorder has been so helpful. It reminds me that I am not my eating disorder, being in recovery = the ability to have a relationship. Focusing 1000% on recovery, and not having a life outside of it, personally, makes me extremely miserable and limits my recovery. \n\nAnyways, I hope this comment might encourage you to not write her off because she's in early recovery. She's a whole person outside of her disorder + recovery.",
          "created_utc": 1575110634.0
        }
      ]
    },
    {
      "id": "fejbblm",
      "author": "throwaway-m1",
      "body": "We where into each other, hooked up and had a great time, but after a few dates we never connected deeply, we where in very different places in life (his parents controlled most of what he did), he still had feelings for his ex. On the last date we had we agreed that neither of us where interested in a long term relationship and get more friendship-vibes",
      "created_utc": 1579165375.0,
      "score": 1,
      "context": [
        {
          "id": "f94yl2u",
          "author": "throwaway-m1",
          "body": "I know that some people in the comments are saying that it's a bad idea to date when someone's in her situation, but she's an adult and I think if there are no red flags, you're both having a good time, and you're both communicating well, go for it. While sometimes it can be complicated dating while in recovery, I think building a life outside of your eating disorder, including relationships, is super important and healthy. \n\nI went on a few dates with the same person very early in recovery, and it didn't go anywhere, but we had a ton of fun.\n\n I met my current partner shortly after I decided to recover from a relapse. Having something going on in my life that doesn't have anything to do with my eating disorder has been so helpful. It reminds me that I am not my eating disorder, being in recovery = the ability to have a relationship. Focusing 1000% on recovery, and not having a life outside of it, personally, makes me extremely miserable and limits my recovery. \n\nAnyways, I hope this comment might encourage you to not write her off because she's in early recovery. She's a whole person outside of her disorder + recovery.",
          "created_utc": 1575110634.0
        },
        {
          "id": "fdmw13o",
          "author": "AintNothinbutaGFring",
          "body": "> I went on a few dates with the same person very early in recovery, and it didn't go anywhere, but we had a ton of fun.\n\nOP here, do you mind me asking why it didn't go anywhere?",
          "created_utc": 1578568435.0
        }
      ]
    }
  ]
}