{
  "id": "e58a89",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1575332138.0,
  "title": "Request: people making you feel invalid",
  "selftext": "Let me make it clear that I love my friends to death and I wouldn’t trade them for the world. But MAN ARE THEY EVER INSENSITIVE and they say a lot of disordered stuff that’s honestly extremely triggering. I’ve talked to them in the past before about my personal triggers, and usually I’m pretty good at getting up and walking away, but sometimes they won’t be thinking and say something that really hurts my feelings. Earlier today my friend spent a solid 5 minutes making comments about how she hates her own body and how she was engaging in x behaviour. I know she didn’t mean for it to hurt me, but it did, and i ended up not saying anything because I didn’t want her to feel bad (she’s super sensitive and would probably hate herself?). Another example being that on the bus on the way home, a different friend casually talked about skipping tons of meals like it was normal. Actually a lot of people treat it like it’s normal.\nBut now i feel invalid because if what I’m going through is “normal”, then i don’t deserve to recover. And it’s hard when you’re being surrounded by triggers 24/7.\nAny advice for staying strong when you feel like you don’t deserve to be better?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/e58a89/request_people_making_you_feel_invalid/",
  "score": 48,
  "num_comments": 8,
  "comments": [
    {
      "id": "f9ij87i",
      "author": "reddituserjpg",
      "body": "man, all i can say is i’m sorry and i can relate ;(",
      "created_utc": 1575338466.0,
      "score": 7,
      "context": []
    },
    {
      "id": "f9iq4y3",
      "author": "Costabza",
      "body": "i cant help i just feel the same way, people i know skip meals and i feel like what i do is normal",
      "created_utc": 1575343280.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f9iw5i3",
      "author": "puravidahw",
      "body": "Keep reminding yourself that you DO deserve recovery. Those people don't see your struggle and may not be true friends (idk?). Fill your circle with people who will be supportive, understanding and considerate of you. No one can know exactly what triggers you, as we are all different, but real friends want to listen when you're uncomfortable and will validate your feelings. \nGood luck, and keep going! It gets better <3",
      "created_utc": 1575347576.0,
      "score": 4,
      "context": []
    },
    {
      "id": "f9j7hyz",
      "author": "tymopa",
      "body": "So you put her comfort before yours? It's not our job to make people comfortable. We have to take care of ourselves.",
      "created_utc": 1575359604.0,
      "score": 3,
      "context": []
    },
    {
      "id": "f9irf43",
      "author": "thefragile7393",
      "body": "I would look for different friends TBH",
      "created_utc": 1575344176.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f9l5nf0",
      "author": "MaryContrary26",
      "body": "Maybe think of it this way-If let's say you were a recovering alcoholic. Your friends could understand how you might feel.Okay, we can't go to a bar because she will want a drink and it's an addiction for her. Okay. Makes sense. But people who haven't had an eating disorder really don't get it because the thoughts and behaviors are so foreign to them, so bizarre that they can't relate. For example: You're afraid of that banana???!! What? You're joking, right? Wtf! They really can't understand. So it's perfectly normal for your friends to talk about their bodies or food in everyday conversation and can you ask them not to? I guess but it's a pretty big part of normal life and they may forget that it's taboo because it's such a common topic to not be able to talk about occasionally. If they talk about it frequently yeah, it's a problem (maybe even an ED) but to accuse them of hurting your feelings?  You're setting the bar too high.",
      "created_utc": 1575415025.0,
      "score": 2,
      "context": []
    },
    {
      "id": "f9j4wwe",
      "author": "None",
      "body": "Yeah that is very challenging because it can really bring up troubling thought processes which people with eating disorders follow to different conclusions. Remember your neurological pathway has been engrained to lead to a dark place while many other people flippantly adhere to thoughts one day and toss them out the next. Even if they prescribe by those ideas and hold on to them until they are disordered you now have the clarity and mental acuity to recognize where those thoughts are coming from and why. You have the experience to know how dangerous and ultimately destructive they can be. I've really struggled with this same thing. There are only a couple people in my life I really hold to the standard of confronting when I feel triggered because they are vigilant enough advocates for me to take that seriously and adjust...most other people are relatively thoughtless about things they can't understand and that's most of the world. It's painful but it's also important to learn to recognize then identity and label those things what they are, I constantly wish to be insulated because it is emotionally unnerving, but at the end of the day we have to build the ideals we strive towards, and the world we want within us; then use those to demonstrate and slowly encourage others to behave in a way we visualize as positive and helpful",
      "created_utc": 1575356280.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fc0pz2t",
      "author": "morbidbunni",
      "body": " they can't possibly monitor their conversation constantly because you may be triggered. They can do a better job of it rn but you have to learn how to be strong on your own in the real world. As someone with anorexia I know how hard it is but I'm coming from a place of experience. I use to get so down and think no one cared about me because they would from time to time forget and say something about how they were happy the scale went down. I finally realized that im in charge of my triggers and not everyone else  I decide if what so an so said about losing weight is going to cause me to restrict or i'm going to decide to remain strong and just congratulate my friend on her weight loss and be a good supportive friend to her.  It's really hard sometimes but life is hard. We are all just trying to get by as best we can. I really am not trying to be mean and I'm sorry if it comes off that way. I just know that everyone has this strength inside of them and I really do hope that things get easier for you.",
      "created_utc": 1577296843.0,
      "score": 1,
      "context": []
    }
  ]
}