{
  "id": "e95dik",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1576059844.0,
  "title": "Request: Is using laxatives after someone eats a sign of an ED?",
  "selftext": "I have a eating disorder myself, and I met up for food with a girl I met for the first time. When we were choosing what to eat, she said she ate already an hour or two ago so she doesn’t want something too big. After she ate, she had a little sealed plastic bag with pills. She mumbled to herself that she needs to take a laxative pill. I found this extremely strange? \n\nWe have the same body types, skinny and short, I am underweight but I am unsure if she is aswell, she has a very small frame though. \n\nDoes this sound like an ED? I ask because this is the first time I’ve met her and I don’t think I could be friends with someone who isn’t pro-recovery. For example, I met a different girl a few weeks and admitted she also has an ED, but is recovering.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/e95dik/request_is_using_laxatives_after_someone_eats_a/",
  "score": 50,
  "num_comments": 14,
  "comments": [
    {
      "id": "fagpchy",
      "author": "XTianoElCurioso",
      "body": "Hi there! Well done for looking after yourself. I am sure there can be a number of reasons why people take laxatives. Maybe you can gently ask whether she is not well? That shows your care and it seems appropriate as she is not hiding the fact she is taking them. \nAs you probably know better than anyone ‘coming out’ with eating difficulties might be difficult and she might tell you. \nGood luck!",
      "created_utc": 1576066630.0,
      "score": 26,
      "context": []
    },
    {
      "id": "fagwakp",
      "author": "Simplicityobsessed",
      "body": "It could be a plethora of things - stomach problems run rampant in our society, as do eating disorders. The only way to know, would be to ask.",
      "created_utc": 1576073142.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fahix36",
      "author": "lwaikart",
      "body": "As other commenters have noted, there could be other explanations for what she isn’t eating much and is having to take pills. If she does have an eating disorder, there’s a chance she could be very secretive about it, not wanting anyone to know anything. If you met someone for the first time and we’re engaging in behaviors in front of them, how would you want that person to address it? Leave it alone completely or bring it up? If you feel comfortable disclosing, you could mention that you have an ED and you’re working on recovery and see if she then takes the opportunity to share anything with you.\nThen again, there’s a chance she doesn’t have an ED. Maybe something else is going on that requires her to watch her food or to take meals at pills. Again, taking the time to share your story and being open could encourage her to do the same.\nIf at the end of the day her behaviors, whatever the motivation, make it harder for you to stay on the recovery track, then maybe right now is not the best time to become besties.",
      "created_utc": 1576086732.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fahk1b9",
      "author": "None",
      "body": "Not necessarily, though it is troubling. I have chronic constipation, so I have to take miralax regularly, but I don't think doctors generally recommend taking stimulant lax for it because of the long-term health effects of taking it so frequently.",
      "created_utc": 1576087405.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fahpjdw",
      "author": "_anightonmars",
      "body": "It could definitely be a sign of an ED. It seems like she may have disordered eating. If this is too triggering for you, I’d probably try to keep her at a distance or attempt to plan hanging out where food isn’t involved. Like some redditors mentioned, you could try to open up about your ED to her then go from there. If it’s too triggering to do so, keep her at a distance",
      "created_utc": 1576090767.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fagy8y9",
      "author": "oliviared52",
      "body": "Yes",
      "created_utc": 1576074631.0,
      "score": 4,
      "context": []
    },
    {
      "id": "faij7nn",
      "author": "tropjeune",
      "body": "It’s possible it could be for health reasons (I recently had to take laxatives because a medication I was on made me so constipated that it was hard to even breathe) but even so, taking laxatives often is so hard on your system! I get so dehydrated any time I have to take them. In fact in my experience most doctors would recommend a gentle stool softener instead, laxatives are NOT recommended for more than a week or two, so I would see if she is still taking them in a couple of weeks.",
      "created_utc": 1576109143.0,
      "score": 2,
      "context": []
    },
    {
      "id": "faikpye",
      "author": "melonyhope1",
      "body": "Yeah she could be taking it for a ton of reasons. You only just met her, Your probably going to just embarrass her. If it’s really something your thinking this hard on and you don’t really know her, maybe that’s just a sign of some negative vibes and maybe you should just not hang out. It’s so great to be aware of the people your surrounding yourself with. ✌️",
      "created_utc": 1576110203.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fcu9bh5",
      "author": "Leona_K",
      "body": "Yes",
      "created_utc": 1577975609.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fagy911",
      "author": "swtmadness",
      "body": "why would this be any of your business?",
      "created_utc": 1576074633.0,
      "score": -10,
      "context": []
    },
    {
      "id": "fah3o7p",
      "author": "None",
      "body": "Because you ought to care about to person you are with and make sure they are healthy, and not dealing with any stressors without someone to talk to about them. Its called being a caring individual. You should try it sometime.",
      "created_utc": 1576078430.0,
      "score": 8,
      "context": [
        {
          "id": "fagy911",
          "author": "swtmadness",
          "body": "why would this be any of your business?",
          "created_utc": 1576074633.0
        }
      ]
    },
    {
      "id": "fahh1m4",
      "author": "swtmadness",
      "body": "you knew them like an hour.  myob.",
      "created_utc": 1576085768.0,
      "score": -4,
      "context": [
        {
          "id": "fagy911",
          "author": "swtmadness",
          "body": "why would this be any of your business?",
          "created_utc": 1576074633.0
        },
        {
          "id": "fah3o7p",
          "author": "None",
          "body": "Because you ought to care about to person you are with and make sure they are healthy, and not dealing with any stressors without someone to talk to about them. Its called being a caring individual. You should try it sometime.",
          "created_utc": 1576078430.0
        }
      ]
    },
    {
      "id": "fahi9f6",
      "author": "None",
      "body": "Guessing you're single, you still ought to care about a person if you're going on a date with them. Doesn't matter an hour or ten years. Be a kind human.",
      "created_utc": 1576086388.0,
      "score": 3,
      "context": [
        {
          "id": "fagy911",
          "author": "swtmadness",
          "body": "why would this be any of your business?",
          "created_utc": 1576074633.0
        },
        {
          "id": "fah3o7p",
          "author": "None",
          "body": "Because you ought to care about to person you are with and make sure they are healthy, and not dealing with any stressors without someone to talk to about them. Its called being a caring individual. You should try it sometime.",
          "created_utc": 1576078430.0
        },
        {
          "id": "fahh1m4",
          "author": "swtmadness",
          "body": "you knew them like an hour.  myob.",
          "created_utc": 1576085768.0
        }
      ]
    },
    {
      "id": "fahihpe",
      "author": "swtmadness",
      "body": "i respect boundaries.",
      "created_utc": 1576086506.0,
      "score": -1,
      "context": [
        {
          "id": "fagy911",
          "author": "swtmadness",
          "body": "why would this be any of your business?",
          "created_utc": 1576074633.0
        },
        {
          "id": "fah3o7p",
          "author": "None",
          "body": "Because you ought to care about to person you are with and make sure they are healthy, and not dealing with any stressors without someone to talk to about them. Its called being a caring individual. You should try it sometime.",
          "created_utc": 1576078430.0
        },
        {
          "id": "fahh1m4",
          "author": "swtmadness",
          "body": "you knew them like an hour.  myob.",
          "created_utc": 1576085768.0
        },
        {
          "id": "fahi9f6",
          "author": "None",
          "body": "Guessing you're single, you still ought to care about a person if you're going on a date with them. Doesn't matter an hour or ten years. Be a kind human.",
          "created_utc": 1576086388.0
        }
      ]
    }
  ]
}