{
  "id": "e9md5o",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1576149882.0,
  "title": "Request: Request to post a question, “Eating disorder or a diet?”",
  "selftext": "Eating disorders and diets.What are the key differences between the two? I’m talking about if for example, you were looking at two people with similar weights and you had to figure out which one had an eating disorder and which one was just on a diet. What would you? Which would be the key factors that would help you figure out which person has which?\n\nI personally struggle with not feeling sick enough to ask for help, I invalidate myself and am in fear of people doing the same to me.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/e9md5o/request_request_to_post_a_question_eating/",
  "score": 35,
  "num_comments": 17,
  "comments": [
    {
      "id": "fajqskh",
      "author": "venusair",
      "body": "Well I think mindset is the main thing that distinguishes between them. A person whose just on a diet usually just wants to be healthy and feel better about themselves, they’re not overly obsessive about it, and their not negative in a self destructive way when they make a mistake. There are many types of eating disorders and feeling invalid is very common feeling among them. You can’t judge if a person has one based off weight and eating habits alone, its much more than that. It’s the relationship the person has with food and their self image.",
      "created_utc": 1576151507.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fakedpi",
      "author": "lwaikart",
      "body": "Oo, such a slippery slope. Like most mental disorders, eating disorders sit on a spectrum. On one end is a health, body-positive attitude and on the other is severely disordered. Those in the severely disordered side can’t think about anything other than food/ED stuff. Their behaviors support this. Whichever form the ED takes, their ED behaviors prevent them from engaging actively in life. Work, school, relationships and of course the physical body are all impacted. Those on the other side, people with a healthy attitude towards food generally don’t spend much time planning out meals/calories and if they do, there isn’t baggage that comes with it. Food is nourishment, eating is a time to socialize and it’s both a source of pleasure or not.\nMost people probably sit somewhere in the middle of this spectrum. At least within the US, there are so many mixed messages blasted all over the place about food. Good food vs bad food. Guilty pleasures. Sinfully decadent treats. Clean eating. Comfort food. Natural. We use food and diet as yet another way to compare ourselves to others and even as a source of identity. Not to say that the entirety of the US has an eating disorder, but that we have many weird hang ups with food that aren’t as prevalent in other cultures. Maybe we’re slightly further along the spectrum than say a native tribesman somewhere eating indigenous cuisine.\n\nSo what are signs that you’re slipping closer towards the disordered side of things?\nBecoming obsessive about food. You think about food all the time. What to eat, what to make, what ingredients can you have/not have.\nYou focus on the data of food: calories, macros, micros, etc. \nYou calculate what you can eat based on how much exercise you got (or vice versa)\nWhat you eat affects how you feel about yourself\nWhat you eat forms part of your identity\nYou use food to fulfill needs other than hunger\nYou use food/lack of food/exercise to manage your emotions\nYour focus on food/body/exercise impacts your ability to take part in relationships\nYour focus on food/body/exercise impacts your ability to work/go to school\nYour food/exercise choices are having a negative impact on your body but you continue.\n\nI feel like some of these signs may fire up some people. I don’t mean to say that if you do any of the above you have an eating disorder or even that you have disordered eating. We all know plenty of people who pursue health/nutrition goals and don’t appear to have anything disordered going on. Athletes in particular could probably check off many of these without crossing into disordered territory, but there are plenty of athletes who have eating disorders and who are able to hide all the red flags.\nSo back to your original question - who has the eating disorder and who doesn’t? I don’t think there’s a one size fits all answer to this. I’ve seen student athletes push their bodies passed the breaking point but denied any body image concerns. I’ve seen people obsessed with their body image and their food intake, but they were functioning, at a healthy weight and seemed happy. I’ve seen people who wanted to gain weight, enjoyed their bodies, exercised appropriately, but were chronically underweight. ED diagnoses are a way to attempt to categorize symptomology, but most people are complex and don’t fit into nice pretty boxes. There are certainly clear cases where someone is in the clinically disordered realm, but for those in the grey middle ground, I don’t think there is a clear cut answer.",
      "created_utc": 1576165700.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fak49ml",
      "author": "Redjay12",
      "body": "doing it because you hate who you are, not bc you see yourself as worth taking care of",
      "created_utc": 1576160609.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fakqgdk",
      "author": "textbookbitch",
      "body": "I’m in a treatment program right now, and what they say makes an eating disorder is the amount of distress a person feels. \n\nNot eating all day? People do that who don’t have an eating disorder. \n\nHaving two pieces of cake? People do that who don’t have an eating disorder. \n\nEating something that goes “against” your diet? People do that who don’t have an eating disorder. \n\nSkipping a day at the gym? People do that who don’t have an eating disorder. \n\nThe difference is, if I don’t eat all day, I’m feeling positive about that experience. If I eat two pieces of cake, I cry and ruminate about it. If I skip the gym, I’m anxious for days.",
      "created_utc": 1576171454.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fakp3kv",
      "author": "paradoxrevel",
      "body": "If you are thinking about this enough to post your question, I am sure you deserve help. \"Sick enough\" is definitely a disordered concept and invalidating oneself is one of my own disorders favorite ways of tricking me. Eating disorders affect people of all weights and sizes and the fact that we don't always acknowledge the disorder in people in bigger or average sized bodies IS a sign of a cultural disordered relationship to food and fixation on outward appearances (as opposed to relevant symptomology).",
      "created_utc": 1576170811.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fakp1gh",
      "author": "None",
      "body": "For me my eating disorder is kind of on and off and I struggle with both binge eating or restricting.\nDepends on the circumstanced in my life currently or what triggers are around me.\n\nThe difference to me would be how much it affects their life.\nIf they’re skipping family get togethers like thanksgiving and easter it can be more of a disorder because someone on a diet would just maintain weight that day and not panic.\nSomeone on a diet would be able to work their diet around their life, someone with a disorder would try to work their life around their diet.",
      "created_utc": 1576170783.0,
      "score": 4,
      "context": []
    },
    {
      "id": "falpnt1",
      "author": "nietheo",
      "body": "For me, dieting led to my eating disorder. I was overweight (obese, actually) and started out just trying to lose some weight, feel better, and be more active. All fine. The problem was once I got to my goal weight, I couldn't stop..I was in the middle of a divorce and I know that didn't help. I was obsessed, afraid of many foods, and couldn't enjoy eating. All I thought about was what I ate, fearing it was too much, etc. I got very thin, even underweight. After a few tears of that I snapped one day and binged, then freaked out and purged, and then that cycle set up shop for a few years. My therapist told me that for those who are already predisposed to developing an ED, dieting and stress can pull the trigger, so to speak, but the gun was already loaded. \n\n(Currently doing ok for me, minimal symptoms but really struggling to enjoy the holidays a bit without fearing a return to bulimia. Taking one day at a time and trying to think like a normal person about food, but it's never easy!!)",
      "created_utc": 1576188357.0,
      "score": 4,
      "context": []
    },
    {
      "id": "faliy8b",
      "author": "cookiecutterhands",
      "body": "I'd like to say that the biggest difference is their relationship with food as well as their relationship with themselves. A fear of food and a fear of gaining weight are tell tale signs that something more than a diet is going on. This also means that if the person has a poor self-esteem and a poor image of themself, they're at a higher risk of developing an eating disorder. A person who accepts themselves as they are but wants to improve themself for their health or enjoyment is the basis of a healthy diet, as well as knowing when to stop their diet. Some people who develop eating disorders believe that losing weight will make them loveable, beautiful, worthy and so on without realizing that they are already all of those things. Diet culture influences this a lot, whether directly or indirectly. Although, some people don't develop eating disorders because of their body image, or really even anything related. A good percentage of people with eating disorders are addicted to the false sense of control, not their body image. When the world around them is chaotic, they find comfort and control by limiting their intake, or practicing 'self-discipline' by exercising excessively. Personally, I believe that diet culture is extremely overrated because dieting is a slippery slope to unhealthy habits. While not everyone who diets will develop an eating disorder of some type, the culture that surrounds dieting really influences the idea that 'thin' means 'healthy and beautiful' when realistically, everyone's healthy range is different. Fat is not synonymous with bad or ugly, nor is thin synonymous with beautiful and worthy. It's something I'm still trying to learn, myself. To sum it up and answer your question, though, it all really boils down to their state of mind through it all. A healthy mind leads to a healthy diet, otherwise it's just a downward slope into dangerous territory.",
      "created_utc": 1576185142.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fajwwer",
      "author": "cutiepie538",
      "body": "Tbh I consider dieting to be disordered eating, especially if it’s yo yo dieting or extreme. I differentiate eating disorder and disordered eating by the mental aspect. Eating disorders are a mental illness that are usually a comorbid condition and disordered eating/dieting is not.\n\nThat’s not to say dieting can’t quickly spiral into an eating disorder and if your brain is already questioning if you need help, then you probably do need help. Whether if it’s with an eating disorder or disordered eating, both severely impact your quality of life.  Have you heard of intuitive eating?",
      "created_utc": 1576156418.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fajw6qh",
      "author": "Simplicityobsessed",
      "body": "Yes this!! Also to add: eating disorders dont have “a limit” persay; it’s never enough. While diets? Even if they are extreme, come to an end, whether it be a habit ending or a weight goal met. Because Eds are not truly functional coping mechanisms, we will always be searching for stability, control, anxiety relief, etc., and therefore never actually satisfied with our weight. \n\nThe differences are subtle and easily missed but they’re there!",
      "created_utc": 1576155981.0,
      "score": 14,
      "context": [
        {
          "id": "fajqskh",
          "author": "venusair",
          "body": "Well I think mindset is the main thing that distinguishes between them. A person whose just on a diet usually just wants to be healthy and feel better about themselves, they’re not overly obsessive about it, and their not negative in a self destructive way when they make a mistake. There are many types of eating disorders and feeling invalid is very common feeling among them. You can’t judge if a person has one based off weight and eating habits alone, its much more than that. It’s the relationship the person has with food and their self image.",
          "created_utc": 1576151507.0
        }
      ]
    },
    {
      "id": "fam6qyy",
      "author": "imthedough",
      "body": "I think what lots of people struggle with are the questions inside their heads like” maybe I’m a failed diet” “faking for attention” etc and don’t look for help.",
      "created_utc": 1576196910.0,
      "score": 2,
      "context": [
        {
          "id": "fakp3kv",
          "author": "paradoxrevel",
          "body": "If you are thinking about this enough to post your question, I am sure you deserve help. \"Sick enough\" is definitely a disordered concept and invalidating oneself is one of my own disorders favorite ways of tricking me. Eating disorders affect people of all weights and sizes and the fact that we don't always acknowledge the disorder in people in bigger or average sized bodies IS a sign of a cultural disordered relationship to food and fixation on outward appearances (as opposed to relevant symptomology).",
          "created_utc": 1576170811.0
        }
      ]
    },
    {
      "id": "fakog77",
      "author": "paradoxrevel",
      "body": "This is accurate. Culturally, we have normalized dieting. But dieting is very much a disordered relationship to food and internal hunger and fullness cues. Like, you wouldn't restrict your bathrooming times or amounts. Food is necessary for an organism's survival. Any attempt to \"manage\" that beyond what is sensible based on time, finances, preferences and availability is arguably unnecessary at best and a dangerous trigger into a full blown eating disorder at worst.",
      "created_utc": 1576170504.0,
      "score": 3,
      "context": [
        {
          "id": "fajwwer",
          "author": "cutiepie538",
          "body": "Tbh I consider dieting to be disordered eating, especially if it’s yo yo dieting or extreme. I differentiate eating disorder and disordered eating by the mental aspect. Eating disorders are a mental illness that are usually a comorbid condition and disordered eating/dieting is not.\n\nThat’s not to say dieting can’t quickly spiral into an eating disorder and if your brain is already questioning if you need help, then you probably do need help. Whether if it’s with an eating disorder or disordered eating, both severely impact your quality of life.  Have you heard of intuitive eating?",
          "created_utc": 1576156418.0
        }
      ]
    },
    {
      "id": "fam7b28",
      "author": "imthedough",
      "body": "How would you differentiate disordered eating and an eating disorder? If it’s by the mental aspect of it, disordered eating can also affect how a person feels mentally? Right",
      "created_utc": 1576197296.0,
      "score": 1,
      "context": [
        {
          "id": "fajwwer",
          "author": "cutiepie538",
          "body": "Tbh I consider dieting to be disordered eating, especially if it’s yo yo dieting or extreme. I differentiate eating disorder and disordered eating by the mental aspect. Eating disorders are a mental illness that are usually a comorbid condition and disordered eating/dieting is not.\n\nThat’s not to say dieting can’t quickly spiral into an eating disorder and if your brain is already questioning if you need help, then you probably do need help. Whether if it’s with an eating disorder or disordered eating, both severely impact your quality of life.  Have you heard of intuitive eating?",
          "created_utc": 1576156418.0
        }
      ]
    },
    {
      "id": "fam86hn",
      "author": "cutiepie538",
      "body": "Of course it can, I never said it couldn’t. I said eating disorders are a mental illness and disordered eating isn’t. It’s hard to fully differentiate between eating disorders and disordered eating because the latter has a high probability of turning into the former. \n\nDisordered eating is the term to describe unhealthy eating behaviors/unhealthy relationship with food. Eating disorders are a disease where an unhealthy relationship to food is a symptom.",
      "created_utc": 1576197900.0,
      "score": 2,
      "context": [
        {
          "id": "fajwwer",
          "author": "cutiepie538",
          "body": "Tbh I consider dieting to be disordered eating, especially if it’s yo yo dieting or extreme. I differentiate eating disorder and disordered eating by the mental aspect. Eating disorders are a mental illness that are usually a comorbid condition and disordered eating/dieting is not.\n\nThat’s not to say dieting can’t quickly spiral into an eating disorder and if your brain is already questioning if you need help, then you probably do need help. Whether if it’s with an eating disorder or disordered eating, both severely impact your quality of life.  Have you heard of intuitive eating?",
          "created_utc": 1576156418.0
        },
        {
          "id": "fam7b28",
          "author": "imthedough",
          "body": "How would you differentiate disordered eating and an eating disorder? If it’s by the mental aspect of it, disordered eating can also affect how a person feels mentally? Right",
          "created_utc": 1576197296.0
        }
      ]
    },
    {
      "id": "fam8gyy",
      "author": "imthedough",
      "body": "Oh alright, if you don’t mind me asking, I’m curious. Could you further explain more specifically the differences between the two? Since both do have similar destructive behaviors.",
      "created_utc": 1576198103.0,
      "score": 1,
      "context": [
        {
          "id": "fajwwer",
          "author": "cutiepie538",
          "body": "Tbh I consider dieting to be disordered eating, especially if it’s yo yo dieting or extreme. I differentiate eating disorder and disordered eating by the mental aspect. Eating disorders are a mental illness that are usually a comorbid condition and disordered eating/dieting is not.\n\nThat’s not to say dieting can’t quickly spiral into an eating disorder and if your brain is already questioning if you need help, then you probably do need help. Whether if it’s with an eating disorder or disordered eating, both severely impact your quality of life.  Have you heard of intuitive eating?",
          "created_utc": 1576156418.0
        },
        {
          "id": "fam7b28",
          "author": "imthedough",
          "body": "How would you differentiate disordered eating and an eating disorder? If it’s by the mental aspect of it, disordered eating can also affect how a person feels mentally? Right",
          "created_utc": 1576197296.0
        },
        {
          "id": "fam86hn",
          "author": "cutiepie538",
          "body": "Of course it can, I never said it couldn’t. I said eating disorders are a mental illness and disordered eating isn’t. It’s hard to fully differentiate between eating disorders and disordered eating because the latter has a high probability of turning into the former. \n\nDisordered eating is the term to describe unhealthy eating behaviors/unhealthy relationship with food. Eating disorders are a disease where an unhealthy relationship to food is a symptom.",
          "created_utc": 1576197900.0
        }
      ]
    },
    {
      "id": "famavwm",
      "author": "cutiepie538",
      "body": "I don’t know how I can really explain any further how they’re different. Eating disorders are a mental illness like depression, anxiety etc. They’re in the DSM. Yes both have destructive behaviors, but the difference is that the disordered eating worst case tragic end is it developing into an eating disorder. The worst case tragic end with an eating disorder is dying. \n\nSeeing as how there are multiple types of eating disorders, there are many different symptoms. An unhealthy relationship with food and unhealthy eating habits (eg. disordered eating) are a symptom of eating disorders. \n\nI personally believe dieting is a form of disordered eating. Because you’re forcing your body to not listen to it’s needs/cravings in order to meet some goal other than meeting nutritional needs and satisfying yourself. That doesn’t mean everyone who diets has an eating disorder. \n\nSomeone else mentioned how a key thing is impact and longevity. For instance a “normal” person who’s on a diet may eat a piece of cake or a big meal and feel guilty because they broke their meal plan, but this guilt fades rather quickly. They can go about the rest of their day/week without interference. For me, someone with an eating disorder, when I would eats outside my “meal plan” I would think about it constantly and I mean every second of the day for weeks. For example, I ate mac and cheese on Monday for dinner and to this day it’s *still* running through my mind every time i try to choose and eat a meal.",
      "created_utc": 1576199781.0,
      "score": 1,
      "context": [
        {
          "id": "fajwwer",
          "author": "cutiepie538",
          "body": "Tbh I consider dieting to be disordered eating, especially if it’s yo yo dieting or extreme. I differentiate eating disorder and disordered eating by the mental aspect. Eating disorders are a mental illness that are usually a comorbid condition and disordered eating/dieting is not.\n\nThat’s not to say dieting can’t quickly spiral into an eating disorder and if your brain is already questioning if you need help, then you probably do need help. Whether if it’s with an eating disorder or disordered eating, both severely impact your quality of life.  Have you heard of intuitive eating?",
          "created_utc": 1576156418.0
        },
        {
          "id": "fam7b28",
          "author": "imthedough",
          "body": "How would you differentiate disordered eating and an eating disorder? If it’s by the mental aspect of it, disordered eating can also affect how a person feels mentally? Right",
          "created_utc": 1576197296.0
        },
        {
          "id": "fam86hn",
          "author": "cutiepie538",
          "body": "Of course it can, I never said it couldn’t. I said eating disorders are a mental illness and disordered eating isn’t. It’s hard to fully differentiate between eating disorders and disordered eating because the latter has a high probability of turning into the former. \n\nDisordered eating is the term to describe unhealthy eating behaviors/unhealthy relationship with food. Eating disorders are a disease where an unhealthy relationship to food is a symptom.",
          "created_utc": 1576197900.0
        },
        {
          "id": "fam8gyy",
          "author": "imthedough",
          "body": "Oh alright, if you don’t mind me asking, I’m curious. Could you further explain more specifically the differences between the two? Since both do have similar destructive behaviors.",
          "created_utc": 1576198103.0
        }
      ]
    },
    {
      "id": "famb0nu",
      "author": "imthedough",
      "body": "Thank you! that helped clear my questions.",
      "created_utc": 1576199872.0,
      "score": 1,
      "context": [
        {
          "id": "fajwwer",
          "author": "cutiepie538",
          "body": "Tbh I consider dieting to be disordered eating, especially if it’s yo yo dieting or extreme. I differentiate eating disorder and disordered eating by the mental aspect. Eating disorders are a mental illness that are usually a comorbid condition and disordered eating/dieting is not.\n\nThat’s not to say dieting can’t quickly spiral into an eating disorder and if your brain is already questioning if you need help, then you probably do need help. Whether if it’s with an eating disorder or disordered eating, both severely impact your quality of life.  Have you heard of intuitive eating?",
          "created_utc": 1576156418.0
        },
        {
          "id": "fam7b28",
          "author": "imthedough",
          "body": "How would you differentiate disordered eating and an eating disorder? If it’s by the mental aspect of it, disordered eating can also affect how a person feels mentally? Right",
          "created_utc": 1576197296.0
        },
        {
          "id": "fam86hn",
          "author": "cutiepie538",
          "body": "Of course it can, I never said it couldn’t. I said eating disorders are a mental illness and disordered eating isn’t. It’s hard to fully differentiate between eating disorders and disordered eating because the latter has a high probability of turning into the former. \n\nDisordered eating is the term to describe unhealthy eating behaviors/unhealthy relationship with food. Eating disorders are a disease where an unhealthy relationship to food is a symptom.",
          "created_utc": 1576197900.0
        },
        {
          "id": "fam8gyy",
          "author": "imthedough",
          "body": "Oh alright, if you don’t mind me asking, I’m curious. Could you further explain more specifically the differences between the two? Since both do have similar destructive behaviors.",
          "created_utc": 1576198103.0
        },
        {
          "id": "famavwm",
          "author": "cutiepie538",
          "body": "I don’t know how I can really explain any further how they’re different. Eating disorders are a mental illness like depression, anxiety etc. They’re in the DSM. Yes both have destructive behaviors, but the difference is that the disordered eating worst case tragic end is it developing into an eating disorder. The worst case tragic end with an eating disorder is dying. \n\nSeeing as how there are multiple types of eating disorders, there are many different symptoms. An unhealthy relationship with food and unhealthy eating habits (eg. disordered eating) are a symptom of eating disorders. \n\nI personally believe dieting is a form of disordered eating. Because you’re forcing your body to not listen to it’s needs/cravings in order to meet some goal other than meeting nutritional needs and satisfying yourself. That doesn’t mean everyone who diets has an eating disorder. \n\nSomeone else mentioned how a key thing is impact and longevity. For instance a “normal” person who’s on a diet may eat a piece of cake or a big meal and feel guilty because they broke their meal plan, but this guilt fades rather quickly. They can go about the rest of their day/week without interference. For me, someone with an eating disorder, when I would eats outside my “meal plan” I would think about it constantly and I mean every second of the day for weeks. For example, I ate mac and cheese on Monday for dinner and to this day it’s *still* running through my mind every time i try to choose and eat a meal.",
          "created_utc": 1576199781.0
        }
      ]
    }
  ]
}