{
  "id": "ebxu7e",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1576599328.0,
  "title": "Request: I am free",
  "selftext": "My beautiful unicorns. I want to thank everybody here. I am making this post in order to mark this day very special. It has been 9 months since my last relapse. 9 months ago I thought it didn't have to be that way after 5 years of fighting ED. A new baby is born and it's me, free and sparkling. \nI made a post here when I hit 77 days and couldn't believe it was a real number. I came from obsessive weighing myself 3-5 times a day after eating to this. 2 months ago I stopped weighing myself in the evenings. A month ago I declared weekends \"Not today, Satan\" days and have skipped the mourning weighing routine.\nI could have never done this without you. \nAnd therapy. If you are still not in therapy, please, think about it. \nI am so much happier. On Saturday, I got engaged. \nLove yourself. I love you.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ebxu7e/request_i_am_free/",
  "score": 125,
  "num_comments": 7,
  "comments": [
    {
      "id": "fb946hv",
      "author": "tangsoodoblackbelt",
      "body": "I don’t know you, but I am so freaking happy for you!  I suffered with an ED for around 11 years before I got sick and tired of it and committed to doing whatever it took to find some relief.  I ended up finding recovery and I’ve never looked back. Keep on doing what you are doing and sharing your story to help those who are suffering see that recovery IS possible!  \n\nFreedom is amazing, isn’t it?",
      "created_utc": 1576628913.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fb8mvpq",
      "author": "assassin-mythic",
      "body": "This gave me goosebumps omg",
      "created_utc": 1576617346.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fb8weol",
      "author": "spacemuffin132",
      "body": "Amazing!!!!!",
      "created_utc": 1576623434.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fb96zty",
      "author": "kdubs27",
      "body": "Congratulations <3 This is a wonderful post, I'm so happy for you, and you deserve this so hard!",
      "created_utc": 1576630978.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fb9fro6",
      "author": "Krisloveskat",
      "body": "Congrats! Keep up with therapy and live a life worth living!!",
      "created_utc": 1576637396.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fbagdtc",
      "author": "theannoyingarmy",
      "body": "Congrats<3",
      "created_utc": 1576677420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fbe4k3x",
      "author": "anonoomoos",
      "body": "Congrats!! Every day is an achievement but that just makes your special day even more so! I second getting help, my therapist has been amazing. Good luck with the rest of your journey and congrats on the engagement too!",
      "created_utc": 1576778041.0,
      "score": 1,
      "context": []
    }
  ]
}