{
  "id": "ecrs8s",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1576753715.0,
  "title": "Request: feeling triggered by the gym",
  "selftext": "In the midst of my ED, I was going to the gym three times a day, and I had a very unhealthy relationship with both food and exercise. I did hours of cardio to try to make my body look a certain way. I felt like a failure if I was not at the gym at least twice a day. Now, I don’t even want to step foot in a gym. I have a negative feeling about it, but want to get my health back in check. Has anyone gone through anything similar? If so, do you have any suggestions to build a healthier relationship with the gym? Thanks in advance.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ecrs8s/request_feeling_triggered_by_the_gym/",
  "score": 49,
  "num_comments": 11,
  "comments": [
    {
      "id": "fbdcwz3",
      "author": "Aphanizomenon",
      "body": "What helped me was that i said 'I'll go to the gym 3 to 4 times a week' to myself and really tried to see that as the goal. What got me to the whole gym loop in the first place was that staying extra time or doing more miles or reps was always a good thing and I had to continuously remind myself now that that is counterproductive for my current goal, that every time i push myself too much I'm getting away from my goal and not towards it and that it actually, really is not a good thing. I'm not saying its not a good thing for anyone, but its not good for me. At first I felt secretly proud if I did more than I planned but you just have to keep reminding yourself why you're there. It's not to lose weight. It's to be healthy and 3x/week is enough to achieve it. It's to manage to be moderate at something, and not always on the extreme.. And that's not easy",
      "created_utc": 1576757898.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fbdahyy",
      "author": "NoopNobodyHere",
      "body": "You can try a workout buddy,  a good friend who will help you ease in maybe?",
      "created_utc": 1576755026.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fbdz6la",
      "author": "None",
      "body": "I’d suggest finding a strength training protocol to follow. You’ll have clear guidelines for exercises, reps, and weights. \n\nLike your work sets would be:\n\nBack squat, 6 reps at 70% 1RM\n3 minutes active rest\nBack squat, 6 reps at 70% 1RM\n3 minutes active rest\nAnd so on...\n\nSo I enter the gym everyday with a clear plan; a “job” that I need to complete, that I’m capable of completing. \n\nThere is no “1 more rep” or “1 more mile” I’m playing the long game. I know if I bust my ass and complete the job everyday I will stay healthy and keep improving. For me there is no emotion in going to the gym, I’m there to work.",
      "created_utc": 1576774620.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fbedjai",
      "author": "justanthergrl",
      "body": "Honestly I feel like doing stuff outside felt more freeing and open.",
      "created_utc": 1576783520.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fbeic93",
      "author": "lwaikart",
      "body": "I think it has to do with shifting your goals. In the past, your goals centered around the amount of time you spent at the gym, calories burned, etc. \nWhat are your goals now as far as getting your health back in check? Improve endurance? Build strength? Focus on what you’d need to do specifically to work on these goals vs how it will impact your body. Instead of going as often as possible put limits on yourself. Give yourself a max amount of time/intensity. Ie, walk for no more than 20 minutes at a 3.5mph pace. \nI also second the comment about doing classes as those already have limits built in.",
      "created_utc": 1576786341.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fbe6t13",
      "author": "lilaccomma",
      "body": "Maybe go running or join a yoga class in your village hall or something. If the gym is a trigger for you then you can find a way to work around that, you don’t have to face it.",
      "created_utc": 1576779486.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fbg1d3k",
      "author": "None",
      "body": "Maybe get a swol mate? Someone to go to the gym with and keep you accountable?",
      "created_utc": 1576829492.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fbh17sk",
      "author": "None",
      "body": "I had a very similar problem with excess cardio and found that the only thing that allowed me to build a healthy relationship with the gym was doing a completely different form of exercise. I can't really do cardio without it bringing up negative thoughts, so I've taken up weight training instead.",
      "created_utc": 1576863278.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fbjou9b",
      "author": "the_scientist52",
      "body": "Honestly, I would recommend not going to the gym.  You said that you don't even want to go, and forcing yourself to isn't healthy.  I know that for me, wanting to \"get healthy,\" as you mentioned, can be a very disordered thought and a way that those old behaviors can creep back in.  Even if the intentions aren't fully disordered from the outset, they can quickly become that way.  \n\nI'm not sure the status of your recovery, but based on my own experiences with relapse it's my firm belief that a person should be in stable recovery for a significant period of time before reintroducing exercise (if exercise was a part of their ED behaviors).  I know that many people don't agree with me and of course everyone's recovery is different.  I just know from my recovery and from what I've seen with friends that it can be easy to convince yourself that you're all better and jump back into exercise too soon.\n\nI also think that even if you decide that you're fully ready to start an exercise routine again, avoiding the gym at this point is still a good idea.  Find other ways to move your body:  do yoga, go on a bike ride, go ice skating, join a tennis club.  There are so many ways to move your body that don't involve a physical gym, and often those ways are going to be more enjoyable anyway.  I've also found that less structured forms of movement can be less triggering, although we still have to be careful of course.  But if the gym brings back so many bad memories, there's absolutely no reason to go back right now (or ever, if you don't want to).  It's possible to have a healthy activity level without stepping foot in a gym and the most important thing is avoiding situations that could cause relapse.",
      "created_utc": 1576937515.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fbjte31",
      "author": "coachjennyeden",
      "body": "I feel like this is very common and actually happened to me as well.  What I did was shift my movement regimen.  Instead of punishing hours on the elliptical which I dreaded and yet forced myself to do, now I do yoga and dance and nature hikes and I'm MUCH happier!\n\nI hope that helps!\n\nJenny",
      "created_utc": 1576939721.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fbvr2jq",
      "author": "brittpo9",
      "body": "I agree with this comment! I think you need to ask yourself why you're pushing yourself to go if you're not happy when you go. \n\nI took a really long time off from working out in my recovery because it's what I needed to be at a point where I viewed movement as something joyful and not as a chore. And by thinking of doing it as a form of love and not of hate/wanting to change. There's nothing wrong with taking time to heal!",
      "created_utc": 1577134839.0,
      "score": 1,
      "context": [
        {
          "id": "fbjou9b",
          "author": "the_scientist52",
          "body": "Honestly, I would recommend not going to the gym.  You said that you don't even want to go, and forcing yourself to isn't healthy.  I know that for me, wanting to \"get healthy,\" as you mentioned, can be a very disordered thought and a way that those old behaviors can creep back in.  Even if the intentions aren't fully disordered from the outset, they can quickly become that way.  \n\nI'm not sure the status of your recovery, but based on my own experiences with relapse it's my firm belief that a person should be in stable recovery for a significant period of time before reintroducing exercise (if exercise was a part of their ED behaviors).  I know that many people don't agree with me and of course everyone's recovery is different.  I just know from my recovery and from what I've seen with friends that it can be easy to convince yourself that you're all better and jump back into exercise too soon.\n\nI also think that even if you decide that you're fully ready to start an exercise routine again, avoiding the gym at this point is still a good idea.  Find other ways to move your body:  do yoga, go on a bike ride, go ice skating, join a tennis club.  There are so many ways to move your body that don't involve a physical gym, and often those ways are going to be more enjoyable anyway.  I've also found that less structured forms of movement can be less triggering, although we still have to be careful of course.  But if the gym brings back so many bad memories, there's absolutely no reason to go back right now (or ever, if you don't want to).  It's possible to have a healthy activity level without stepping foot in a gym and the most important thing is avoiding situations that could cause relapse.",
          "created_utc": 1576937515.0
        }
      ]
    }
  ]
}