{
  "id": "ed8keq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1576838677.0,
  "title": "Request: Post about my wife?",
  "selftext": "I’m looking for help understanding how to react to my wife’s actions tonight. She skipped dinner, ate a chocolate bar, felt bad about eating the chocolate bar, and insisted she needed to throw it up so she could feel better psychologically and go to bed. She said she only does it like once a year and that it’s normal and fine. How should I talk to her about this? What should I ask? Is it a big deal or not a big deal?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ed8keq/request_post_about_my_wife/",
  "score": 41,
  "num_comments": 7,
  "comments": [
    {
      "id": "fbgcco0",
      "author": "pipandmerry",
      "body": "Eating disorders are like cancer in that you might be able to treat it and recover from it, but you will always be at risk for it coming back. If your wife is being honest, it sounds like she’s mostly healthy but experiences symptoms occasionally, which is normal in the scheme of an ED. The best way I can describe my personal relationship with symptoms is like an itch. It’s really itches, but logically you know it won’t make it better to scratch it. Yet the itch is constant, so hard to ignore, it drives you bonkers and you can’t sleep or distract yourself and so finally you scratch it. And in the moment it feels like such a relief to scratch it, but it’s temporary relief. \n\nTry looking into support groups in your area, I’ve found that having a place to go to talk about it for like 1.5 hours every week (or even just when needed) helps me refocus my life on recovery. Sometimes life is hectic and it’s easy to forget how important keeping a recovery mindset is. They are also great places to get resources as a support person, and most will welcome a support person by themselves if you just want to go to talk about your fears and get advice. \n\nI would talk to her, but keep in mind that it’s an itch, it’s not a logical, sober choice to hurt herself. Be clear that you love her and you’re here to support her through even the toughest of feelings, and you know that it’s not just her making harmful choices but a reaction to the itch. Be as nonjudgmental as possible. Talking to my support person always makes it easier not to scratch, but feeling blamed and ashamed for scratching always makes me double down and scratch harder.",
      "created_utc": 1576844689.0,
      "score": 33,
      "context": []
    },
    {
      "id": "fbgsa74",
      "author": "sushi_chobab",
      "body": "You should definitely be weary about further signs. You do not want to wait till it's too late however carefully plan out how you are going to approach her regarding this because people with eating disorders go into denial whenever someone brings it up. Do not bring up anything about her physical appearance even if it's positive because eds are weird and she might feel you're lying to make her feel better. I'll repeat this again choose your words carefully when addressing her eating habits because all it takes is one wrong move for her to get defensive and fall deeper into this downward spiral. I wish you good luck m8 hope your wife gets through this soon✊",
      "created_utc": 1576857420.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fbgl6w8",
      "author": "None",
      "body": "Unless it becomes a repeated behavior, I wouldn't be too TOO, concerned... But the fact that you're picking up on this now is such a tell of the care you have for her. Seriously, people will have this behavior displayed to them for years and they don't do anything.\n\nThe only thing that's a bit fishy is her certainty that it ain't no thang. She's obviously struggled  before in order to know it's not a big deal.",
      "created_utc": 1576852491.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fbhmm1o",
      "author": "k455i",
      "body": "Plain and simple, it’s not normal and it’s definitely not fine. While I don’t know your wife or her past eating habits, I do know what an ED mind is like and I can guarantee that she does not do this “once a year.” \n\nLet her know you’re there for her to help her though this bitch of a disorder. Reassurance and love are the two best things you can do, just remember to be patient and understanding",
      "created_utc": 1576877273.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fbig27v",
      "author": "p_iynx",
      "body": "I would reaffirm to her that you love her and just want her to be healthy, and maybe tomorrow bring up going to a support group meeting. Don’t pressure her, just let her know that you’re willing to go with her if she is feeling like she needs some extra support. If she says no and that it really was just an isolated incident, respect that and don’t push. Say that you trust her and just wanted her to know that you are here if she needs support or help. Obviously keep an eye out for other behaviors just so you know it’s a moment that has passed. \n\nI have periodic blips that are almost like mini-relapses. It’s always been temporary, and if it sticks around for more than a few days it is a sign that I’m under stress that I’m not dealing with in a healthy way and that I probably need to start seeing a therapist again. But it’s not necessarily a “mayday, mayday!” emergency situation.",
      "created_utc": 1576899955.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fbhnjtm",
      "author": "HotMathStar",
      "body": "This itch analogy is so spot-on.\n\n I also agree that support groups can be helpful, but if your partner truly thinks this is an \"only sometimes\" thing, she may feel like the support group idea is overkill. In either case, you might find your own way of making it clear to her that you are open to have her talk about these feelings so that she isn't struggling with them on her own. Being able to talk about my inner dialogue, the compulsions that make the \"itch\" so unbearable, gives those thoughts less power to drive me into old habits.",
      "created_utc": 1576877912.0,
      "score": 3,
      "context": [
        {
          "id": "fbgcco0",
          "author": "pipandmerry",
          "body": "Eating disorders are like cancer in that you might be able to treat it and recover from it, but you will always be at risk for it coming back. If your wife is being honest, it sounds like she’s mostly healthy but experiences symptoms occasionally, which is normal in the scheme of an ED. The best way I can describe my personal relationship with symptoms is like an itch. It’s really itches, but logically you know it won’t make it better to scratch it. Yet the itch is constant, so hard to ignore, it drives you bonkers and you can’t sleep or distract yourself and so finally you scratch it. And in the moment it feels like such a relief to scratch it, but it’s temporary relief. \n\nTry looking into support groups in your area, I’ve found that having a place to go to talk about it for like 1.5 hours every week (or even just when needed) helps me refocus my life on recovery. Sometimes life is hectic and it’s easy to forget how important keeping a recovery mindset is. They are also great places to get resources as a support person, and most will welcome a support person by themselves if you just want to go to talk about your fears and get advice. \n\nI would talk to her, but keep in mind that it’s an itch, it’s not a logical, sober choice to hurt herself. Be clear that you love her and you’re here to support her through even the toughest of feelings, and you know that it’s not just her making harmful choices but a reaction to the itch. Be as nonjudgmental as possible. Talking to my support person always makes it easier not to scratch, but feeling blamed and ashamed for scratching always makes me double down and scratch harder.",
          "created_utc": 1576844689.0
        }
      ]
    },
    {
      "id": "fbwddcg",
      "author": "the_scientist52",
      "body": "This is exactly what I was gong to say.  The restriction of dinner is red flag number one.  And no one with a normal relationship with food forces themselves to vomit in order to feel better psychologically.  Even when a typical person feels \"guilty\" about eating a \"bad\" food, they move on without taking any severe action (such as purging) and eventually get over it.  \n\nAnd yes, I wouldn't believe the \"once a year\" thing for a second.  The \"I hardly ever do it, I can stop whenever I want, it's not a big deal\" line is something that so many ED sufferers use to throw off suspicion and convince loved ones that they're okay.  I don't mean that judgmentally because I have definitely done it as well.  It's just a fact that these behaviors are rarely a one-time thing and that people who have eating disorders usually minimize their symptoms to avoid confrontation.",
      "created_utc": 1577146957.0,
      "score": 1,
      "context": [
        {
          "id": "fbhmm1o",
          "author": "k455i",
          "body": "Plain and simple, it’s not normal and it’s definitely not fine. While I don’t know your wife or her past eating habits, I do know what an ED mind is like and I can guarantee that she does not do this “once a year.” \n\nLet her know you’re there for her to help her though this bitch of a disorder. Reassurance and love are the two best things you can do, just remember to be patient and understanding",
          "created_utc": 1576877273.0
        }
      ]
    }
  ]
}