{
  "id": "egg057",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1577476736.0,
  "title": "Request: recovering too fast?",
  "selftext": "For some reason, I’m terrified of fully letting go of my ED. Like, every time I get further in my recovery, I’m tempted to sabotage myself just so that I can start over again.\n\nRecently I’ve been having a really good week, where I’ve had (apart from 1 bad day) close to no ED urges. But now I feel like a fake, like I’ve been doing it all for attention, and that I don’t need to recover. I guess, how can I let myself let go of the ED?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/egg057/request_recovering_too_fast/",
  "score": 54,
  "num_comments": 11,
  "comments": [
    {
      "id": "fc6e028",
      "author": "reddituserjpg",
      "body": "wish i could offer you some advice, but i’m in the same boat myself. i think the reason a lot of people find it so hard to let go of their ed’s is because they feel like they’re nothing without it. like it’s their identity. at least that’s how i feel. wishing you hope and good luck!!",
      "created_utc": 1577478334.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fc6wghf",
      "author": "green-egg-and-ham",
      "body": "I'm like 80% recovered and I found that my ed thoughts, food obsessions and urges went away SIGNIFICANTLY once my body wasnt in a constant state of starvation. It's a natural bodily response! You are 100% valid 💙💚💙💚💙",
      "created_utc": 1577491264.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fc72a4b",
      "author": "moooooopg",
      "body": "There is no right way to do recovery. Try to be as confident as you can in yourself. It's not you that is scared, it's ED",
      "created_utc": 1577495627.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fc6uuqs",
      "author": "berrybagel123",
      "body": "Recovery is not easy and it is not going to be an easy battle. There are going to be days when you do really good and days where you fail, but what really matters is that you keep trying. I have been struggling with recovery myself and have recently tried to stop calorie counting, and it has not been easy. Please don't give up and keep trying!!",
      "created_utc": 1577490089.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fc84o7g",
      "author": "sharonshazyshaz",
      "body": "Thank you for this comment because I thought I was the only one. I find it hard to imagine myself without my ED even though I am trying my very best to be better.",
      "created_utc": 1577526804.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fc9cx6h",
      "author": "the_scientist52",
      "body": "I struggle a lot with feeling like I'm \"not sick enough\" to recover.  What helps me is thinking about how once I've recovered, the \"level of sickness\" I had isn't going to matter nearly as much as it does now.  It feels important in this moment because I still have ED thoughts that make me compare myself to others and get really competitive, but once I'm out of the \"ED world\" so to speak, I'm not going to care about that stuff anymore.  I'm going to be focusing on my friendships and dating and career and all of those other real-life things--and so are you!  So even though you feel like a fake right now, once you're healthier you'll be looking back grateful that you did recover, not judging yourself for how quickly you did it or anything else.  Also, the sooner you reach recovery the better, so the fact that you've been doing well is AWESOME.  Seriously.  The future you're fighting for will be so much better than staying stuck in the ED.",
      "created_utc": 1577550704.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fc7gr8n",
      "author": "stopitma",
      "body": "What is it about the ED that you're afraid of letting go of?",
      "created_utc": 1577506950.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fcajcch",
      "author": "None",
      "body": "purging is a way to self harm. maybe you have a need to harm yourself?",
      "created_utc": 1577570291.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcqreeq",
      "author": "Britt68",
      "body": "Hi. I'm happy you are recovering!\n\n I don't have sources handy and am not a professional. I want to let you know that there is talk out there to suggest regaining weight fairly quickly (aside from someone getting the uncommon, yet still possible Refeeding Syndrome) holds the best possibility for long term, sustained recovery. If periods have stopped (and likely even if they have not) regaining weight promptly, and thus periods if lost, likely helps osteopenia and osteporosis. Since our brains need fat and glucose to function properly, brain recovery seems to kick in once really weight restored, which is not just okay per charts, but which is *right for the individual,* is achieved. Sometimes it seems that full brain recovery can take up to a year, so generally the sooner you can be properly weight restored for *your body* the better. 😉\n\nAlso, we need to continue to gain roughly a couple of pounds per year into our early to mid-twenties once we've finished our major growing and are at the correct weight for *you.*  This weight is partly organs finishing development. In other words, let's just say a person is 19 yo and at a weight that provides good, medically verified physical and mental health is \"xxx,\" a person will likely need to continue gaining a couple pounds for a few to several more years simply to complete development of vital organs and this likely includes completeling bone development- can't remember that part off of the top of my head, but I think that bones are also involved there.\n\nI personally like Tabitha Farrar's podcasts, but they may or may not be something you'd like or not  based on your age. To me, she is positive and makes lots of sense. *Decoding Anorexia* by Carrie Arnold, a person recovered from AN, is a book I love too.\n\n\nOf course, always seek proper guidance from a medical professional. I am mostly recovered from a couple ED's and am posting only  from my own research and viewpoints.\n\nYou can do this! You do deserve it. ☺",
      "created_utc": 1577891022.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcqtkti",
      "author": "Britt68",
      "body": "Agree!",
      "created_utc": 1577891996.0,
      "score": 1,
      "context": [
        {
          "id": "fc6wghf",
          "author": "green-egg-and-ham",
          "body": "I'm like 80% recovered and I found that my ed thoughts, food obsessions and urges went away SIGNIFICANTLY once my body wasnt in a constant state of starvation. It's a natural bodily response! You are 100% valid 💙💚💙💚💙",
          "created_utc": 1577491264.0
        }
      ]
    },
    {
      "id": "fcan4gp",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1577572548.0,
      "score": 2,
      "context": [
        {
          "id": "fcajcch",
          "author": "None",
          "body": "purging is a way to self harm. maybe you have a need to harm yourself?",
          "created_utc": 1577570291.0
        }
      ]
    },
    {
      "id": "fcanh38",
      "author": "None",
      "body": "my bad, I assumed. Not sure what they mean then, I saw urge and read purge I think",
      "created_utc": 1577572754.0,
      "score": 2,
      "context": [
        {
          "id": "fcajcch",
          "author": "None",
          "body": "purging is a way to self harm. maybe you have a need to harm yourself?",
          "created_utc": 1577570291.0
        },
        {
          "id": "fcan4gp",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1577572548.0
        }
      ]
    }
  ]
}