{
  "id": "egppqk",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1577532128.0,
  "title": "Request: seeking advice for dealing with body dysmorphia during the christmas period",
  "selftext": "\n\ni’m a 21 y/o girl and i’m very reluctantly weight restored after struggling with anorexia for around 8 years. \nas with most people with EDs, the christmas period is my idea of a living hell. this has been my first christmas in a number of years where i’ve regained somewhat “normal” eating habits so i’ve tried to let myself eat what i want.. and the guilt has been almost unbearable. i’m pretty newly weight restored (since around septemberish) but i’m still struggling to overcome an exercise addiction - however i’m in my final year of university and the past few weeks i’ve been too busy to find time to go to the gym, and that was really my only coping mechanism. the past couple of weeks have been scrutinising in terms of body image because of the indulgent food and lack of exercise, to the point i don’t even want to take a shower because my body dysmorphia is so bad. i’ve been avoiding going outside because i don’t want anybody to see me, and baggy clothes haven’t been helping because i still feel like i look big. I can’t help but feel like my whole body is crawling because of how bad i feel that it looks. \ndoes anybody have maybe any tips on coping with body dysmorphia during this period or ways i can reassure myself? I can’t help but feel ive changed so much during the month of december and it’s eating me alive.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/egppqk/request_seeking_advice_for_dealing_with_body/",
  "score": 38,
  "num_comments": 5,
  "comments": [
    {
      "id": "fc996ry",
      "author": "None",
      "body": "Although I don't have any advice I would just like to say... Keep going I believe in you!",
      "created_utc": 1577549053.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fc9bce9",
      "author": "the_scientist52",
      "body": "If you want help with just the dysmorphia piece, you could always ask a trusted person to help you challenge the thoughts, since they're able to see you more accurately than you see yourself.  But honestly, I think that in recovery it's best to move away from focusing on your body/weight altogether.  For example, if your body really hasn't changed, you might think to yourself \"eating more intuitively for Christmas was okay because it didn't make me gain weight,\" which is still putting too much of a value on weight.  The true, non-disordered thought is \"eating more intuitively for Christmas was okay regardless of my weight, because I listened to my body's needs and ate foods that I enjoy.  My value is not determined by my weight and a change in either direction does not change my worth as a person.\"  \n\nI know these steps can be very difficult to take and maybe you aren't ready yet, but I think they're really important for a lasting recovery.  Just remember that you as a person haven't changed regardless of what your body size has done.  You still have the same good qualities that you did before December started, and your friends and family are going to have the same opinion of you that they did before.  And the efforts that you put in with weight restoration and a more recovery-focused Christmas are only going to make your life better and brighter, even if it's hard to muddle through these emotions right now.  You're setting yourself up for a much better future and the most important thing is to not let your disordered thoughts cause you to go backwards from the progress you've been making.  Use whatever coping skills it takes to not let the thoughts turn into behaviors and know that while body image issues tend to take the longest to heal, they can and will get better.",
      "created_utc": 1577550036.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fca6r9q",
      "author": "mutantandproud95",
      "body": "I'm a 24 year old man with similar body image issues. I love Christmas and spend most the time eating cookies and candy, not working ANY of it off at the gym. I know reality and logic go out the window when it comes to how you see yourself and the guilt you feel for indulging. You need to know that your body hasn't changed at all though, and just like a few days of eating next to nothing doesn't make you thin no one got fat in a week.\n\nMy advice is to keep a big picture of your health and image. Picture yourself a month from now, back in healthy routine and realize this is just a blip in the whole scope of your nutrition and your appearance. \n\nI know it is hard, but please don't let feelings of guilt and disgust ruin your holiday. You indulged because on some level you enjoyed it, that doesn't change your value as a person or make you any more or less valid or beautiful. Every day is a chance to make better choices. Forgive yourself and please don't waste time beating yourself up about the past. You are perfectly fine, you are good enough, and you deserve to be just as happy as everyone else. It isn't easy, but you owe it to yourself to believe that",
      "created_utc": 1577563887.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fc8yvzn",
      "author": "RagingPython",
      "body": "I can’t help much but I might have a bit of advice. I hate my appearance too, but for me it’s real, I’m not dysmorphic; just hideous and fat, so I for a while hated going outside or letting anyone see me. But then I realised something: no one else cares what you look like or even notices you. I was always worried about people and what they thought of me, but no one ever has any interest in me and just ignores me. It’ll be the same for you, especially as you aren’t actually anywhere near as bad as you look. (Of course, this doesn’t help with me social anxiety, so it might not work with your dysmorphia, but trying to remember that no one really cares how you look might help.)\n\nAlso, I wanted to say, congratulations on attempting recovery! A lot of people are too afraid to try and get better after even 8 years. And trying to just eat normally at Christmas is also really good, since it can be a really terrifying time from what I’ve heard. Keep it up, you’re doing great and I know you can do it!",
      "created_utc": 1577544322.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fcauw38",
      "author": "wintergirl13",
      "body": "I am in the same boat with you. I am recently recovered (weight-wise anyway) and I feel like I have another person that I'm carrying around with all this new weight even though I'm in a \"normal weight range,\" whatever comfort that is supposed to give me. I totally get the not even wanting to shower, I'm suffering the same thing, I can't even walk past a mirror unless I'm fully clothed. I am absolutely humiliated when I see friends and family that I haven't seen since I was at my lowest weight, I'm convinced they're all thinking \"wow, she let herself go.\" \n\n&#x200B;\n\nThe only advice I can give you is this: it's the holidays, there's going to be more calorie consumption than normal, and less time to exercise, but it's nothing you can't come back from. I promise you will not gain an unreasonable amount of weight that you can't lose with a regular healthy diet and exercise routine if that's really what you feel you need to do. But don't let yourself obsess about it to the point that you revert back into unhealthy behavior. Just talk yourself through it, it's temporary and any change you see only you can see. My mantra has been \"it's temporary, it's temporary.\" Hope this helps--",
      "created_utc": 1577577083.0,
      "score": 2,
      "context": []
    }
  ]
}