{
  "id": "ehl3xd",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1577706283.0,
  "title": "Request: I’d like to post about seeking advice for my 4yo",
  "selftext": "I’ve been in hospital with my 4yo son for two weeks. He hasn’t eaten in 14 days or had anything to drink in 13 days. We are very rural and are waiting to be transferred to a children’s hospital with a child psychologist and eating disorder team. \n\nHe’s on an ng tube and is steadily regaining weight. I’m happy with where he’s at considering the services available to us right now. \n\nHis diagnosis so far seems to be PANDAS or OCD and anorexia. He’s been put on anti anxiety meds and a sedative which have helped to calm his panic surrounding food immensely. \n\nHe has said that he’s worried about germs in his mouth or crumbs getting stuck in his teeth or having too much energy and going too fast. \n\nI just wanted to see if anyone had any advice on how I could talk to him about this. We’ve tried being logical which usually helps but not so much now. We’ve explained how we keep germs out of food, how to get stuck food out of your teeth, and how we make sure he doesn’t have too much energy but it hasn’t helped at all. \n\nI just hoped that maybe someone had had a similar experience and might have some advice.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ehl3xd/request_id_like_to_post_about_seeking_advice_for/",
  "score": 66,
  "num_comments": 16,
  "comments": [
    {
      "id": "fcjwwgb",
      "author": "whoatherecourt",
      "body": "I'm so sorry you and your son are going through this. This is breaking my heart. I think the best piece of advice is to advocate for him as hard as you possibly can. Get him the best doctor's that you can. Get another opinion if you feel the need. If you don't like how one doctor is treating the two of you, get another doctor. Etc. etc.",
      "created_utc": 1577708599.0,
      "score": 34,
      "context": []
    },
    {
      "id": "fck7pfi",
      "author": "AZgirl70",
      "body": "What a tough situation.  I have a daughter with mental health needs.  I also have an anxiety disorder.  The tough thing is that anxiety does not respond to logic.  A professional can assist him in learning to tolerate food.  Occupational therapists do feeding therapy.  Look up exposure therapy.  It is a proven way to reduce anxiety and treat OCD symptoms.  Don't do it yourself, the professionals can do it safely as not to overwhelm him.  Best of luck to you.",
      "created_utc": 1577718890.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fckh4aq",
      "author": "the_scientist52",
      "body": "I'm so sorry that you're going through this. I'm sure it feels absolutely horrible and I want to commend you for all of the care you're putting into his treatment.  He's very lucky to have you!  \n\nI'm not a professional but in my opinion it doesn't sound like he has anorexia.  People with anorexia struggle with body image and an intense fear of gaining weight, and it doesn't sound like he has those types of concerns.  The fact that he's so young also leads me away from that potential diagnosis.  While it isn't impossible for small children to display anorexic tendencies, it typically doesn't occur at such a young age.  And when it does show up in younger children, it's usually the thoughts surrounding body image or weight gain that start at that point--full blown restrictive behaviors tend to develop a bit later.\n\nTo me it sounds like the OCD/PANDAS route is the most likely, because the specific anxieties you mentioned aren't related to his weight but to things that tend to be common in those with OCD (and I'm assuming PANDAS, although I admittedly don't know much about that diagnosis).  I struggled with anxiety at his age and while my fears weren't related to eating, the anxiety was quite intense and difficult to rationalize with because I was so young.  And even now as an adult, I have trouble talking myself out of anxiety even though I'm aware that it makes no logical sense--so that could explain why trying to be logical with him hasn't helped much.   \n\nIf it does end up being considered an anxiety-related issue I'm expecting that they'll want to do exposure therapy to help him get used to eating and drinking again.  I'm also wondering if something in particular triggered his anxiety, like if there was some sort of traumatic event that set the ball rolling.  It wouldn't even have to be related to eating, as anxiety about one thing can manifest in other ways.  I think that the child psychology team will be working to try to find the root cause of the anxiety and can help treat that as well to prevent situations like this from arising again.",
      "created_utc": 1577725203.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fck2gz4",
      "author": "SemicolonButterfly",
      "body": "It can be hard to logic my way out of irrational fears. I struggle with it as an adult who’s had a good bit of help from therapy so I can barely begin to imagine what your son is going through.\n\n\nI recently read *The Brain That Changes Itself* which has a section specifically on OCD and might be a helpful read. That book really gave me hope that I can change my thought patterns. And children’s brains can adapt even more readily than my adult brain!\n\n\nI also thought of *Turtles All the Way Down* by John Green. It’s young adult fiction but the teenage protagonist struggles with anxiety/OCD surrounding germs and I thought the author did an excellent job capturing what the worry spiral and intrusive thoughts can feel like. Just thought of it because maybe it could help give you a glimpse into that sort of emotional experience?\n\n\nSending so many good wishes for you and your son. I hope you encounter compassion and effective help from everyone on his treatment team.",
      "created_utc": 1577714588.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fck8tvl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1577719720.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fckv509",
      "author": "alphiedactyl",
      "body": "Sounds like me...\nI am recovering from anorexia caused by severe OCD.\nHopefully he gets help quickly. Kids are resilient, though. Try and remain hopeful.",
      "created_utc": 1577733862.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fckj7ev",
      "author": "Kehndy12",
      "body": "I don't have advice but I have a question.\n\nDid he go through abuse or some sort of traumatic event?",
      "created_utc": 1577726511.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcklhwh",
      "author": "RagingPython",
      "body": "4yo!? Oh, I’m so sorry you have to deal with that. I had no clue it could even happen to someone so young, so I don’t have much advice.\n\nGood luck with him, OP.",
      "created_utc": 1577727928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcqwok8",
      "author": "Britt68",
      "body": "So sorry your son any you are facing this.\n\nYou might want to Google Kartini Clinic. Julie O'Toole, M.D. (pediatrician) and her team are known for working with really little ones with all varieties of ED's, plus co-occurring problems like OCD. Dr. O'Toole deals with issues of being afraid to swallow in kiddos, \"food phobia,\" medically caused eating issues as well as classic ED's.\n\nThe clinic itself is in Oregon, however I know she has done Skype and phone consults too. Dr. O'Toole is known for not being shy about NG tubes and also has a psychiatric nurse practitioner to work with psych meds. She can do inpatient hospitalization at the children's hospital near her clinic. \n\nPlease note: I have no personal experience with Dr. O'Toole or Kartini Clinic. This is info from my own extensive research,\n\nYou're both in my thoughts.",
      "created_utc": 1577893360.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcresah",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1577900860.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcua0q7",
      "author": "None",
      "body": "Wow, I have never heard of something like this but as a fellow parent of young children I am sure it's very frightening and an very sorry for what you are going through. \nBut to br honest this sounds like a child's notion gone to an extreme as opposed to a long term psychological disorder like am ED you would find in someone older, so hopefully it will simply pass, like a phase. Best of luck to you.",
      "created_utc": 1577976095.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcvnpl0",
      "author": "raininginmybrain",
      "body": "have you considered/thought about weed?",
      "created_utc": 1578006042.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fi960f6",
      "author": "None",
      "body": "I have a child who developed sudden onset of extreme OCD symptoms. The diagnosis was PANDAS, and the long term treatment is antibiotics. It’s not ideal, but it makes a normal life possible. In the short term, because the symptoms are caused by inflammation of the Amygdala, a limited course of NSAID like ibuprofen (Motrin) has worked for us in keeping the compulsive/intrusive thoughts under control. \n\nThe tough thing with PANDAS/PANS is that therapy doesn’t work until the inflammation is under control, any more than physical therapy can work on a wound that had not been bandaged. \n\nI would seek out a PANDAS-conversant doctor as close to your area as possible. There are still pockets of resistance within the more conservative/older doctors, although a quick google of the CDC, NIH etc., make clear that this is a fully accepted diagnosis. \n\nFeel free to DM me with any questions.",
      "created_utc": 1582256424.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ffb1mu2",
      "author": "R0ck01",
      "body": "Anorexia also can just mean to avoid eating. It is an expression or a cause. Like wanting to lose weight, trauma, nausea,OCD, etc... just pointing that out. It's a symptom that stems from something. Really, even avoiding eating to lose weight is a mental issue at its core anyways. Most of it all is but some people have nausea or appetite issues due to other things that aren't mental. \n\nI really hope anyone struggling with an flavor of all this, I hope you all find healing.\n\nI'm having a hard to dealing with it. I have been doing a lot better than years ago in ways. I guess opposed to timing my food to leave my body and not enter on time so I can throw up without wasting food from my stomach days, weeks at a time.",
      "created_utc": 1579749541.0,
      "score": 0,
      "context": [
        {
          "id": "fckh4aq",
          "author": "the_scientist52",
          "body": "I'm so sorry that you're going through this. I'm sure it feels absolutely horrible and I want to commend you for all of the care you're putting into his treatment.  He's very lucky to have you!  \n\nI'm not a professional but in my opinion it doesn't sound like he has anorexia.  People with anorexia struggle with body image and an intense fear of gaining weight, and it doesn't sound like he has those types of concerns.  The fact that he's so young also leads me away from that potential diagnosis.  While it isn't impossible for small children to display anorexic tendencies, it typically doesn't occur at such a young age.  And when it does show up in younger children, it's usually the thoughts surrounding body image or weight gain that start at that point--full blown restrictive behaviors tend to develop a bit later.\n\nTo me it sounds like the OCD/PANDAS route is the most likely, because the specific anxieties you mentioned aren't related to his weight but to things that tend to be common in those with OCD (and I'm assuming PANDAS, although I admittedly don't know much about that diagnosis).  I struggled with anxiety at his age and while my fears weren't related to eating, the anxiety was quite intense and difficult to rationalize with because I was so young.  And even now as an adult, I have trouble talking myself out of anxiety even though I'm aware that it makes no logical sense--so that could explain why trying to be logical with him hasn't helped much.   \n\nIf it does end up being considered an anxiety-related issue I'm expecting that they'll want to do exposure therapy to help him get used to eating and drinking again.  I'm also wondering if something in particular triggered his anxiety, like if there was some sort of traumatic event that set the ball rolling.  It wouldn't even have to be related to eating, as anxiety about one thing can manifest in other ways.  I think that the child psychology team will be working to try to find the root cause of the anxiety and can help treat that as well to prevent situations like this from arising again.",
          "created_utc": 1577725203.0
        }
      ]
    },
    {
      "id": "fck8dir",
      "author": "justanthergrl",
      "body": "I believe that John green captures MANY different disorders in his books. Hes simply amazing.",
      "created_utc": 1577719393.0,
      "score": 1,
      "context": [
        {
          "id": "fck2gz4",
          "author": "SemicolonButterfly",
          "body": "It can be hard to logic my way out of irrational fears. I struggle with it as an adult who’s had a good bit of help from therapy so I can barely begin to imagine what your son is going through.\n\n\nI recently read *The Brain That Changes Itself* which has a section specifically on OCD and might be a helpful read. That book really gave me hope that I can change my thought patterns. And children’s brains can adapt even more readily than my adult brain!\n\n\nI also thought of *Turtles All the Way Down* by John Green. It’s young adult fiction but the teenage protagonist struggles with anxiety/OCD surrounding germs and I thought the author did an excellent job capturing what the worry spiral and intrusive thoughts can feel like. Just thought of it because maybe it could help give you a glimpse into that sort of emotional experience?\n\n\nSending so many good wishes for you and your son. I hope you encounter compassion and effective help from everyone on his treatment team.",
          "created_utc": 1577714588.0
        }
      ]
    },
    {
      "id": "fclb5ku",
      "author": "winterswarmest",
      "body": "Right, my first thought was candy. Maybe he had a rough experience with it (got stuck in his teeth or made him hyper).  Candy is also super sticky and can get dirt and lint on then easily.\n\nI wonder if eating food in front of him and showing their teeth clear of food after chewing and showing that they feel good/unaffected by germs or jitters.\n\nI also think too many treatments before knowing the real diagnosis can be harmful too for other reasons",
      "created_utc": 1577743775.0,
      "score": 2,
      "context": [
        {
          "id": "fck8tvl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1577719720.0
        }
      ]
    },
    {
      "id": "fcte4e9",
      "author": "Splootypoop",
      "body": "To post to this sub you have to message the mods who post for you via the above username so that op can remain anonymous",
      "created_utc": 1577940363.0,
      "score": 1,
      "context": [
        {
          "id": "fcresah",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1577900860.0
        }
      ]
    }
  ]
}