{
  "id": "ei7avl",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1577819377.0,
  "title": "Request: Shopping for clothes with Body Dysmorphia",
  "selftext": "Hi, i suffer from really bad body dysmorphia and for me its almost unbearable to look at myself in a mirror. Recently my parents have been urging me to get new clothes since i wear the two baggy outfits everyday. As you might imagine, shopping for clothes is a horrendous experience for me and usually i end up wanting to cry and giving up. The process of trying on clothes, and looking at myself in the mirror is exhausting and impossible. \nDoes anyone have any tips for buying clothes while having body dysmorphia?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ei7avl/request_shopping_for_clothes_with_body_dysmorphia/",
  "score": 49,
  "num_comments": 10,
  "comments": [
    {
      "id": "fcny0v1",
      "author": "unfeel_",
      "body": "I would say shopping online is the way to go, i always buy oversized hoodies and sweatpants from ZAFUL  and  AliExpress, ZAFUL usually has a lot of reviews with pictures showcasing how it looks in person. Or you just can buy oversized hoodies from stores without trying them on. If you’re scared that it won’t look right on you and you’ll just waste money, try buying oversized clothes from thrift stores.",
      "created_utc": 1577820648.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fcnzc6g",
      "author": "theaccountforthattm",
      "body": "I never try stuff on in a shop. The mirrors and the tight claustrophobic rooms is so horrifying. Most shops will have a return policy though so often if I need new clothes, I'll buy them and try them on at home. As long as you keep the receipt and the packaging, you should be able to return them if you dont want them. That way you can wait till a slightly better day to try them on, in a safe space without any time or people pressure. Good luck.",
      "created_utc": 1577821308.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fcobczj",
      "author": "the_scientist52",
      "body": "Take it slowly.  Start by choosing one store, and if you're feeling okay afterwards move on to another one.  Decide beforehand on what constitutes your \"breaking point,\" for lack of a better phrase.  For example, maybe not liking the look of one outfit is okay, but if you start to cry/have urges to restrict/etc. that means it's time to call it a day.  Leave as soon as you reach this point.  \n\nPlan something you enjoy for after the shopping trip, something that can serve as a good distraction for you.  Maybe go to a movie with a friend, hang out at someone's house, have a game night with your family, etc.  If you're comfortable, tell them ahead of time that you're going to be having a rough day so they'll know that you might need some extra distraction/support.\n\nConsider shopping with a friend or family member.  Having someone to talk to during the experience can be distracting and help take your focus away from being completely on your appearance.  They can also offer support in the moment if you get upset.  If you're comfortable, you could ask the person for their opinion on an outfit so that you'll barely have to look in the mirror yourself.",
      "created_utc": 1577828091.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fcotrbs",
      "author": "maggiemaytatiana",
      "body": "I feel for you and totally understand.  I agree that buying oversized clothes online really works.  Or try to find a store where the lighting is better and the mirrors aren’t as bad.  There are places like that, but they’re generally smaller stores or boutiques.  At least in my town.  \nMaybe when you find something you like, buy 2 of them in different colors.  Your wardrobe doesn’t have to be big.  Just buy stuff you feel good in.  I’m sorry you suffer from this.  People that don’t really won’t understand.",
      "created_utc": 1577841326.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fcodmbd",
      "author": "Devansffx",
      "body": "I recently purchased online from Boohoo (British company) the size estimates were spot on and prices were amazing. That may help with avoiding mirrors.\n\nHowever, would it help to shop with someone who knows your challenges to help. Maybe cover the mirror?",
      "created_utc": 1577829663.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fcp5pbv",
      "author": "bluemermaidqueen",
      "body": "I make someone else shop for me/ with me! I bring my sisters or a good friend and ask them to pick out clothes. I typically don’t look at myself in the mirror but instead stand in front of them and we go over it together. \n\nIs it comfortable? Do I like the color? Is the fit flattering? Can I wear it with other things I have? \n\nIt helps to have a second opinion. And with someone else picking out clothes for me I don’t overthink the outfits.",
      "created_utc": 1577851308.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fcokj7k",
      "author": "zuccnoods",
      "body": "i relate so much. it doesn’t help that the lighting in the changing rooms are extremely bright and unflattering, pointing out all your flaws and the harsh lighting makes everyone look kinda flabby...i hate it so much. i shop online and buy a lot of oversized clothes from thrift stores",
      "created_utc": 1577834542.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcp6x4t",
      "author": "leftoutright",
      "body": "1. get a NEW oversized hoodie (As a compromise to buying regular clothes) 2.  go to the shop and just put on the clothes that look good on the rack and see if they're comfortable and you can move around in them in the dressing room. Don't worry so much about the looks ON YOU and feel free to avoid the mirror if it makes you feel better. 3. You get the comfy clothes and if you begin to feel you dont look good in them just throw your big hoodie on over them. Now you bought new clothes and can hide at will. I've done this stuff for years",
      "created_utc": 1577852482.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcpnc8u",
      "author": "None",
      "body": "To echo other folks, buy online, and I personally also order multiple sizes of the same item if it's something I know I think is cute, but am unsure what size to go with. That way, you have privacy, good lighting, space, and won't get upset having to encounter fitting room staff, and are more likely to be happy with something you purchase.",
      "created_utc": 1577868024.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fcvneqz",
      "author": "raininginmybrain",
      "body": "thrift shop(:",
      "created_utc": 1578005854.0,
      "score": 1,
      "context": []
    }
  ]
}