{
  "id": "ej9f6k",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1578021904.0,
  "title": "Request: how do I avoid being triggered by other people’s weight loss?",
  "selftext": "I’m currently in college right now, in an environment where everyone has a fear of “freshmen 15”, so everyone is extremely conscious about their weight. A couple of my friends also just lost a ton of weight. They worked hard for that, going to the gym a lot and eating healthy (to my knowledge they don’t deal with eating disorders themselves), and now they’re a lot thinner. They also like to talk about their weight loss journeys a lot because they’re proud of themselves, but I find it so hard to be supportive because of my own issues. I’ve dealt with bulimia for a long time, and though it’s a lot better now, I get trigged by seeing how much weight they lost or hearing them talk about it. These are still my friends, so I want to be happy for them, but it mentally and physically hurts me to do so. So I guess I want advice for how to deal with that (without actually telling them about my ED-I have a hard time opening up to people about that). Also just advice in general for being in an environment where everyone is so conscious about gaining weight. <3",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ej9f6k/request_how_do_i_avoid_being_triggered_by_other/",
  "score": 72,
  "num_comments": 4,
  "comments": [
    {
      "id": "fcwny74",
      "author": "not_cinderella",
      "body": "The most important thing to remember is that they are not you. They haven’t struggled with EDs the way you have. You have to remind yourself you can’t view food and exercise in the same way they do when trying to lose weight because of your past or you’ll slip into old habits. \nI feel for you. I really do. I’m in my third year of uni and only for the first time feel good about myself and what I eat. One other thing that helped me was surrounding myself that talk about food as something you need, not something good or bad. One of my friends is working on losing weight and she texted me the other day with a big bowl of a noodle salad - “post workout because I need this to refuel after all that running!”",
      "created_utc": 1578031128.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fcx5n7n",
      "author": "None",
      "body": "This might be a little scattered, I’ve got no caffeine in my body... \n\nPersonally I’m introverted and reserved, I hate opening up, I don’t talk about my feelings. However I talk about my struggles with food, it started with bulimia like yourself. I’ve stopped the purging but still struggle with binging. But I’m also the guy who is trying to drag my buddies to the gym to lift. I love health and fitness, I love learning about the human body. I love the measurable and tangible progress strength training provides.\n\nI think understanding that progress isn’t linear has helped me cope with other people. Kinda like “everyone has their own path, there is a reason I’m having these experiences and I know I’ll come out stronger.”\n\n\nYeah it sucks I added substantial weight (about 25% body mass) after I relapsed. It hurts, it’s embarrassing, but it’s me, I’ll wear that shit on my chest. The fear of external judgment isn’t worth my time or energy. Maybe by being open I’ll be able to help someone else who is struggling, maybe they are dealing with an ED but don’t know it yet. I love talking to people about their journey, and hopefully I’ll learn something from them. Maybe they have a perspective I haven’t considered yet.\n\nGood luck, much love.",
      "created_utc": 1578052244.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fcxftf9",
      "author": "Mithrakana",
      "body": "Part of what I'm seeing here is, you're certain none of them have ED experience. Many people with ED don't name it - I've had BED my whole life, and am currently working hard to gain control because of a few weight-related health problems.\n\nSo maybe doing some reflecting on how everybody handles things differently/people can all be at different stages of dealing with things/etc will help you shake some of that black and white \"they're normal and I'm not\" narrative, which in turn may help you desensitize yourself to the impact of their experience.\n\nAs someone with C-PTSD, I can also say that DBT has really helped me work on specific triggers when they're impacting my quality of life in a social setting. There's a great self-guided workbook out there!",
      "created_utc": 1578061816.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fcytznw",
      "author": "moooooopg",
      "body": "I would try to remember that most diets fail and result in more weight regain. It sounds like your a solid friend, and want to be happy for them because their happy. What I would do is 1. Don't speak food, weight, calories, diet tall, etc with them. ED will want to, it will be hard not to, but if you catch yourself, try to mindfully redirect the convo \"oh your shoes are awesome!!\" 2. Remember that even if they're allowed to diet, it doesn't work for you. My dad had to start a healthy regimine after a heart attack, and it was super hard for me having all that health talk around me, but I had to tell myself that as a recovering ED I have no place for diets and/or excessive exercise. 3. Talk to them about it. If you feel comfortable and be careful about this, as they might have the mentality that (oh I want an eating disorder... Which they don't) and just use it as reason to ask them politely to try not to talk about food/weight/shape as it's something your trying not talk about... Defs start that convo with, Im really happy for you and really appreciate your friendship, and would love it if you could not speak about diet/food/weight/shape with me as I have a past of EDs and find that topic hard\n\nEdit: also check out Food Psych podcast",
      "created_utc": 1578087040.0,
      "score": 2,
      "context": []
    }
  ]
}