{
  "id": "ekse8b",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1578306866.0,
  "title": "Request: The person that could be my soulmate is thinner than me and it sucks",
  "selftext": "Hi! I am 25 and I have been struggling with eating disorders for 16 years now mostly with anorexia but for the last year I considered myself fully recovered. During the past months I met a guy that's all I had been dreaming of and fell in love almost at first sight. The only problem is he's tiny. He's the same height and weight as I am and eats very little everyday and he likes my skinny body. He doesn't like women with curves and he actually fat shames them a lot. I have started having body image issues again, I am stressed about food the whole day and I don't like eating with him because he eats less than me. The possibility of living with him scares me and especially the possibility of getting pregnant at some point frightens me because I would be so much fatter than him. Nobody understands me, they all say it's not an even a problem. Any help would be very appreciated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ekse8b/request_the_person_that_could_be_my_soulmate_is/",
  "score": 81,
  "num_comments": 23,
  "comments": [
    {
      "id": "fddg4oz",
      "author": "Phantomsgf",
      "body": "It sounds like this guy has his own eating issues and body image problems...\nI don't think it would be a good idea for your mental state and general health to be in a relationship with someone who can essentially drag you down with them.",
      "created_utc": 1578310768.0,
      "score": 71,
      "context": []
    },
    {
      "id": "fddhn4d",
      "author": "wackinattackin",
      "body": "If he fat shames women, is he worth it? He sounds like not the right guy for someone with an eating disorder.",
      "created_utc": 1578312665.0,
      "score": 111,
      "context": []
    },
    {
      "id": "fddmkbr",
      "author": "None",
      "body": "Others have said similar things but as a male I thought I'd chime in. First of all, good for you for having gone through recovery! You described him as your \"soulmate\". To me,  (married 7 years) that means someone you are completely honest with. Does he know about your history and struggles? If he doesn't,  I definitely recommend you bring it up to him. If he adjusts his behavior,  great, if he doesn't,  then he may not be as good a fit as you think.",
      "created_utc": 1578317843.0,
      "score": 39,
      "context": []
    },
    {
      "id": "fddeor6",
      "author": "covhr",
      "body": "this guy does not sound like he is a good fit for you, given your history. Anybody who fat shames women for having natural curves should be kicked to the kerb (IMHO).",
      "created_utc": 1578308830.0,
      "score": 72,
      "context": []
    },
    {
      "id": "fddwnrk",
      "author": "FrozenOne48",
      "body": "Anyone who fat shames, or shames anyone for anything, is not your soul mate. I wouldn't ever want to be associated with or involved with someone who intentionally makes hurtful comments about another's appearance. Fuck diet culture and the way it's shaped this guy's perception of others.",
      "created_utc": 1578325797.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fddvgls",
      "author": "Musicluver77",
      "body": " In my experience this doesn’t work well. A few years ago I met a guy I really liked, and saw a future with even. I could tell that the \"picky eating\" he had warned me about went much deeper though. I was convinced he had anorexia. It stressed me out. I had worked so hard in my own recovery that watching him stress over a menu at a restaurant would cause fights. We broke up for other reasons but it wouldn't have worked. I always felt huge beside him and it brought up old demons for sure. My advice is if it is causing you stress, it isn't worth it. Fat shaming is not good for anyone, let alone a recovered ED patient. Consider it as necessary to stay in recovery, to let him go.",
      "created_utc": 1578324968.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fde92pd",
      "author": "Rachcake93",
      "body": "fat shaming women is a huge red flag that he won't be a helpful resource in your recovery. Please consider this before you dive in any deeper with him. Don't lose your progress over a mean guy",
      "created_utc": 1578333863.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fddmsue",
      "author": "Boosey0910",
      "body": "If he is TRULY your soul mate he won't care if you are skinny, heavier or somewhere in between. That's my opinion anyhow....",
      "created_utc": 1578318067.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fdeujop",
      "author": "smallspacetaker",
      "body": "Maybe you find him so appealing because this guy is triggering your disorder. This disease is so insidious, if you are honest with yourself, is this someone who does more to trigger or would be supportive ? I personally couldn’t live with anyone who was already fat shaming women.  You will drive yourself insane wondering if you are thin enough for him.  Given your decade long struggle, does it make any sense to be with someone who you know would have a problem with weight gain?",
      "created_utc": 1578346897.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fde4ts9",
      "author": "dawn990",
      "body": "He sounds selfish and rude. \n\nHaving an ED is one thing, but fate shame or make others uncomfortable because they aren't as thin or eat as little is something different.\n\nHe is either genuinely an A-hole or he's so deep into his illness it turned him into one. Regardless, person you want him to be isn't who he is right now. You see potential but reality doesn't match with it.\n\nUntil he's ready to peek his head from that self-digged hole and start to recover, he will not be a good partner.\n\nIt already took a tole on you and I wonder (because I also had similar problems) why do you perceive him as The One who you want to spend your life with while you're also scared of that future because it looks gloomy and sad? \n\nDon't ruin yourself and your progress for anyone. Partners should lift one another and not tear each other down. Intentionally or unintentionally.\n\nDo yourself a favor and re-evaluate why do you like him, is he (or anyone) worth putting your literal life at line, why do you crave future that is so scary and painful, etc.\n\nAs a fellow ED haver, I know you know that you can't change him or his views regarding food as long as he himself doesn't start to seek that change.",
      "created_utc": 1578331200.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fderkhz",
      "author": "Powasam5000",
      "body": "HE fat shames people? He is probably the worst person to have in your life right now.",
      "created_utc": 1578345130.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fdfkyy0",
      "author": "edie43",
      "body": "Been there, done that. Met «the guy of my dreams», he fatshamed others and wanted me to be skinnier. He even knew about my ED. Not my soulmate after all. I promise you can find someone better! I did!",
      "created_utc": 1578364127.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fdes2b9",
      "author": "R1HMkk",
      "body": "I do understand , it’s same with my dad ... we (my mom and 2 sisters)really love him but the food thing annoys us and usually ends with arguing . We do compare our portions , body , meals, snacks etc. to his . \nMy mom always advice him to eat well and better (specially he smokes and mentioned one time that it helps him regulate his appetite)... but since he always work with good effort and doesn’t tear out we guess it won’t harm staying away from what he used to deal with since  childhood .\n\nBut  it’s about YOU , YOU DO LOVE HIM , nothing is perfect... so stay away from what annoys you , remember  friends and family are eating same as your portions and even way more \nRemember it’s your body , and YOUR body probably has different metabolism twice boosted as your bf so no need ...\n\nGive yourselves time , he could get jealous from  you and heal ... just like my dad who gained weight lately and got in healthy shape .",
      "created_utc": 1578345423.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fddvbj0",
      "author": "ilivetomosh",
      "body": "You might need to specify \"fat shaming\". That's a huge red flag. I'm just curious what was said though, because sometimes it seems like just about anything can be taken that way in this day and age?",
      "created_utc": 1578324868.0,
      "score": 4,
      "context": []
    },
    {
      "id": "feahmdt",
      "author": "vannahhhbanana",
      "body": "Girl run",
      "created_utc": 1578948893.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fde9ihq",
      "author": "rhymeswithpanda1987",
      "body": "He sounds like not the right guy for any quality person at all.",
      "created_utc": 1578334144.0,
      "score": 55,
      "context": [
        {
          "id": "fddhn4d",
          "author": "wackinattackin",
          "body": "If he fat shames women, is he worth it? He sounds like not the right guy for someone with an eating disorder.",
          "created_utc": 1578312665.0
        }
      ]
    },
    {
      "id": "fdg1blr",
      "author": "not_cinderella",
      "body": "Honey, your soulmate would not make you fee this way.",
      "created_utc": 1578376406.0,
      "score": 9,
      "context": [
        {
          "id": "fddhn4d",
          "author": "wackinattackin",
          "body": "If he fat shames women, is he worth it? He sounds like not the right guy for someone with an eating disorder.",
          "created_utc": 1578312665.0
        }
      ]
    },
    {
      "id": "fddnjxn",
      "author": "pedismd",
      "body": "Thank you so much for your help!",
      "created_utc": 1578318752.0,
      "score": 7,
      "context": [
        {
          "id": "fddmkbr",
          "author": "None",
          "body": "Others have said similar things but as a male I thought I'd chime in. First of all, good for you for having gone through recovery! You described him as your \"soulmate\". To me,  (married 7 years) that means someone you are completely honest with. Does he know about your history and struggles? If he doesn't,  I definitely recommend you bring it up to him. If he adjusts his behavior,  great, if he doesn't,  then he may not be as good a fit as you think.",
          "created_utc": 1578317843.0
        }
      ]
    },
    {
      "id": "fddfgxw",
      "author": "beckyboo777",
      "body": "I agree although it’s very possible he’s dealing with some food related issues himself. Try to gently bring it up and let him know how it’s affecting you. If he is a good fit for you and has your best interest at heart, he will hopefully work to help you feel more comfortable and encourage you to be ok in the body you have.",
      "created_utc": 1578309897.0,
      "score": 18,
      "context": [
        {
          "id": "fddeor6",
          "author": "covhr",
          "body": "this guy does not sound like he is a good fit for you, given your history. Anybody who fat shames women for having natural curves should be kicked to the kerb (IMHO).",
          "created_utc": 1578308830.0
        }
      ]
    },
    {
      "id": "fdg4hcq",
      "author": "pedismd",
      "body": "Thank you!",
      "created_utc": 1578379675.0,
      "score": 2,
      "context": [
        {
          "id": "fde92pd",
          "author": "Rachcake93",
          "body": "fat shaming women is a huge red flag that he won't be a helpful resource in your recovery. Please consider this before you dive in any deeper with him. Don't lose your progress over a mean guy",
          "created_utc": 1578333863.0
        }
      ]
    },
    {
      "id": "fdg4n27",
      "author": "pedismd",
      "body": "He calls fat all people with a few more pounds and it's hurtful. Even the word itself hurts me",
      "created_utc": 1578379847.0,
      "score": 2,
      "context": [
        {
          "id": "fddvbj0",
          "author": "ilivetomosh",
          "body": "You might need to specify \"fat shaming\". That's a huge red flag. I'm just curious what was said though, because sometimes it seems like just about anything can be taken that way in this day and age?",
          "created_utc": 1578324868.0
        }
      ]
    },
    {
      "id": "fddnt84",
      "author": "None",
      "body": "😊",
      "created_utc": 1578318982.0,
      "score": 3,
      "context": [
        {
          "id": "fddmkbr",
          "author": "None",
          "body": "Others have said similar things but as a male I thought I'd chime in. First of all, good for you for having gone through recovery! You described him as your \"soulmate\". To me,  (married 7 years) that means someone you are completely honest with. Does he know about your history and struggles? If he doesn't,  I definitely recommend you bring it up to him. If he adjusts his behavior,  great, if he doesn't,  then he may not be as good a fit as you think.",
          "created_utc": 1578317843.0
        },
        {
          "id": "fddnjxn",
          "author": "pedismd",
          "body": "Thank you so much for your help!",
          "created_utc": 1578318752.0
        }
      ]
    },
    {
      "id": "fddnh9p",
      "author": "pedismd",
      "body": "Thank you very much for your advice!",
      "created_utc": 1578318685.0,
      "score": 2,
      "context": [
        {
          "id": "fddeor6",
          "author": "covhr",
          "body": "this guy does not sound like he is a good fit for you, given your history. Anybody who fat shames women for having natural curves should be kicked to the kerb (IMHO).",
          "created_utc": 1578308830.0
        },
        {
          "id": "fddfgxw",
          "author": "beckyboo777",
          "body": "I agree although it’s very possible he’s dealing with some food related issues himself. Try to gently bring it up and let him know how it’s affecting you. If he is a good fit for you and has your best interest at heart, he will hopefully work to help you feel more comfortable and encourage you to be ok in the body you have.",
          "created_utc": 1578309897.0
        }
      ]
    }
  ]
}