{
  "id": "elr3zg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1578480069.0,
  "title": "Request: My mom has fueled my ED for years and I need advice",
  "selftext": "Title basically says it all. I haven’t been ever diagnosed with an eating disorder properly, but you can judge my behavior and make your own analysis. \n\nI have and awful relationship with food and eating around people. For as long as I could remember, my mom would be the one to shame me in front of the family for my choices at the table. Whether it would be getting a second serving, etc. Now, I was a slightly chunky child, but it wasn’t anything extreme. I had baby fat. I wasn’t obese, and I grew out of it. But she would always make me watch shows like The Biggest Loser, modify my diet, punish me for eating sweets, and hovered over the scale like a hawk. It was big and little things. I remember once when I got my braces tightened, it hurt to eat. She’d continuously joke that I should get them tightened more often. Hell, I overheard that she joked about my severe anemia because she thought it’d make me lose more weight. \n\nShe put me on MyFitnessPal and similar apps from a young age, and when I was 14 pressured me into going to see a weight loss specialist (Dr. Zisman, Miami, if you care to look into him) , who put me on metabolism boosting pills and a strict diet. I proceeded to lose a bunch of weight, and my mom was happy, but I was utterly miserable. \n\nI turned to purging, and restricting, and binging. I sneak food, whether it’s hiding bread in my hoodie sleeve or an orange in the band of my underwear. Eating dinner with family members gives me extreme anxiety, as does eating around other people. My best friend is the only person who I really feel all that comfortable eating around, because deep down I know she wouldn’t judge me like my mother. \n\nWhen I came clean to her about my ex-purging habits, she didn’t bat an eye. She makes weight loss a condition for doing things that I like. For example, to go see my best friend in Iceland, she wants me to lose x amount of pounds by x date. \n\nI should clarify that I don’t hate my mom, but she’s left me with a deeply scarred sense of self and I fear that I’ll never be able to truly love myself at any size. She’s ruined my relationship with food and with my body, but at the same time I feel bad because it’s not her fault. My abuelo died from complications of lung cancer and diabetes, and my abuela is obese. Being overweight runs in the family, and she often talks about being the only one to have “broken the mold” by being skinny. She has baggage and she’s scared that I’ll turn out to be 500 pounds or something. \n\nI’m NOT skinny by most standards, and I just wish I had smaller boobs and a thigh gap and thinner arms and a smaller...well, a smaller everything. I’m so tired of obsessing over calories, feeling overly guilty for having an indulgent meal or not working out, and being ashamed of my body. I get so envious of people who have my “ideal” body. \n\nI feel like I’ve had much of my childhood and teenage years robbed from me because of my maybe-ED. \n\nTo anybody who’s been in a similar situation to me, I really need advice. I’m stuck and I feel so hopeless.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/elr3zg/request_my_mom_has_fueled_my_ed_for_years_and_i/",
  "score": 54,
  "num_comments": 8,
  "comments": [
    {
      "id": "fdjppmu",
      "author": "None",
      "body": "My dad is like this but less extreme and it's only been getting better for me since I moved out and distanced myself. \n\nDont have any advice unfortunately but if you want to talk DM me",
      "created_utc": 1578482549.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fdjr657",
      "author": "CookieCat3",
      "body": "Did you think about getting an outside help?\n\nI didn't have any similar experience, but I would go and talk to someone expert about it. this is a toxic behaviour and it's ruining your life. Be strong, seek for a counsellor, and try to get far from your mum, if you can (I don't know how old are you, but talking to a friend, or someone else in your family could help).  \nTons of love and DM if you need help",
      "created_utc": 1578484381.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fdk3vns",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1578495422.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fdkkgj3",
      "author": "None",
      "body": "My mom fuels my drive to gain more weight. The woman is smaller than me and says i look really small and need to gain. I'm like shit, if i look small to YOU then damn (i've been underweight for a long time)",
      "created_utc": 1578505471.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fdky9jz",
      "author": "RoseTyler38",
      "body": "Are you financially independent?  Can you move out and go low or no contact with her?",
      "created_utc": 1578513636.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fdka8zw",
      "author": "defazie",
      "body": "Both my parents did this to some extent.  I still at times have issues eating in front of people, or when people make any sort of comment about what I am eating.  I moved out and across the country it has helped along with therapy.    \n\nAlthough the demons come back when I go to visit.  I one time called my brother crying and apologizing because I had gained weight.     \n\nMy family did not mean harm and my parents only wanted us to be healthy.  So I don't blame them, they did the best they could with what they had.",
      "created_utc": 1578499589.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fdl0co2",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1578514812.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fdldhxt",
      "author": "nodaybuttoday__",
      "body": "My mom is the same UGH",
      "created_utc": 1578521693.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdlr9qq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1578530606.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdqblcm",
      "author": "None",
      "body": "this breaks my heart. you deserve to be comfortable in your own skin and your mother sounds like a) she's projecting her own insecurities- b) trying to prevent herself from losing you like your abuelo but in a twisted and warped way with no boundaries or c)- both. it does sound like you have an ED because quite frankly you wouldn't be here if you didn't. I hope that soon you can move out and distance yourself from such a toxic cycle. remember that your mum loves you and hopefully isn't trying to cause you harm, just keep you safe. it that was my mum I would've stormed out ages ago, so kudos to you. stay strong!",
      "created_utc": 1578662170.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdk20tp",
      "author": "smallspacetaker",
      "body": "It hurts when the people we love the most come up short.  Sometimes the sanest thing you can do is accept your mom loves you, despite its imperfections. And flawed as it may feel, holding onto anger or resentment towards her will only really hurt you . It’s okay to say “I have a mother who doesn’t get my e.d but I know she loves me”.",
      "created_utc": 1578494105.0,
      "score": 0,
      "context": []
    }
  ]
}