{
  "id": "em7swd",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1578565368.0,
  "title": "Request: How to deal with coworkers who gossip about each other's weight?",
  "selftext": "I recently started a new job that is an amazing opportunity for me. I'm making better money than I ever have before, and I genuinely love what I do. The problem I'm having is with the work culture.\n\nBy the end of my first week it became clear that the people I work with are not only very gossipy, but particularly so about things such as food and weight. By day three I had to listen to an extensive, 4-way conversation in the cubicles next to me about a girl we work with, what she eats, how much she probably weighs, how tall she is, how she looks, etc. Yesterday, I had to get up and go to the bathroom and cry because my entire department was sitting around talking about how much so-and-so should lose, and what weight they think they look best at. I keep my head down and don't participate in any gossip, not just because I don't want to make waves/enemies but because I really don't believe in talking about people behind their backs.\n\nI'm currently pretty deep into a relapse and struggling to get out, but one of my biggest fears is the conversations that I know will start happening about me at work. Unfortunately, I confided in my manager that I had an eating disorder when I started to struggle to remain standing during the day, only to later learn that she is not to be trusted with personal information when I overheard her gossip about another girl's mental health medications. This means that if I try to go to HR about the problem, it will become immediately apparent that I'm the one who spoke up, and I seriously doubt that no grudges would be held against me.\n\nI need to get better, but I also need to keep this job, and I have no idea how I'm ever going to feel comfortable in my recovery body while I'm there. Has anyone ever dealt with this kind of toxic work environment? What can I do to minimize the damage and be okay with gaining weight when I know for a fact that it will be a topic of conversation amongst my coworkers?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/em7swd/request_how_to_deal_with_coworkers_who_gossip/",
  "score": 39,
  "num_comments": 10,
  "comments": [
    {
      "id": "fdmzl12",
      "author": "None",
      "body": "I personally always would stand up for what you believe in. If you are diplomatic most people will accept it. If you don't judge people with HR, but come from a growth mindset, they will have no choice but to hear you out.\nThe same with direct contact with others. Express how horrible you would feel if they talked about you like that. Don't say: your gossiping is horrible. Do say: I would feel horrible if you would talk about me like that.\nThey cannot deny what you are feeling. And if they ignore your comments and HR does not pick up your feedback, consider looking for another job, while you are working in this one.\n\nMental health is extremely important in any line of work and if you are fearful at your work, you will underperform and more importantly feel miserable. You are the most important person in your life, so make sure that YOU are okay.",
      "created_utc": 1578572535.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fdn4l9v",
      "author": "PissWizardJim",
      "body": "I don't  imagine this will be very helpful at all but I feel better saying it just in case \nAre you able at all to listen to music? I definitely have no way to fix the issue but maybe if you can't  hear it happening it would help a bit.",
      "created_utc": 1578577111.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fdn3shu",
      "author": "ri-ri",
      "body": "Don't engage in those types of conversations. I work in a very very similar type of office and it triggers me beyond belief. I try to avoid it as much as I can and remove myself from these conversations. Its harder than it sounds but its critical to ignore these.",
      "created_utc": 1578576449.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fdne0ws",
      "author": "nodaybuttoday__",
      "body": "You can also set major boundaries. Either walk away, or say “can we talk about something else” or “I don’t feel comfortable talking about people on our team.”",
      "created_utc": 1578583797.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fdnfolu",
      "author": "invisiblepourlesyeux",
      "body": "For those recommending HR - please remember HR is there to protect the company, not the employee.",
      "created_utc": 1578584813.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fdofgm7",
      "author": "pajmahal",
      "body": "Call it out - just say “it’s really unkind to gossip about other peoples bodies like that and I don’t want to hear it.” What are they going to do, argue with you?",
      "created_utc": 1578604087.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fdoq1ef",
      "author": "procrastin8or951",
      "body": "I don't know how to make your coworkers stop, especially when you are new there. Maybe this is a seasonal thing where they are all in their new years diet resolutions and it'll die down soon. \n\nBut something that helps me in these situations is to remind myself that their judgment shouldn't matter to me. \n\nAnyone who is willing to act/speak so horribly and hurtfully about someone isn't someone whose approval you need. They clearly aren't good judges of anything, or they'd judge that their own behavior is vile.\n\nIt's hard and those conversations are still triggering, but I keep reminding myself not to care what they think of me. Sometimes that helps me get through it.",
      "created_utc": 1578610295.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fdndubq",
      "author": "nodaybuttoday__",
      "body": "Are you a teacher? Me too. This sounds like so many faculty rooms I’ve worked in. I simply stopped hanging out in them altogether and found a comfortable spot in the library and put in headphones to do my work.",
      "created_utc": 1578583685.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdn1ryj",
      "author": "daddydangles911",
      "body": "Thank you for the ideas. Normally, I am very much the person who stands up for others and what I believe in, but the reason it's so hard for me here is that I've never been able to hold down a real job for very long due to my illness and this one is very important to me. It's the first time I've been able to make any real sort of contribution financially in my marriage, and I actually truly do love what I do (I'm in a health care setting and get to help people a lot). I'm terrified of doing anything that will make people angry with me while I'm still in my probationary period, because as unfair as it feels to me I really do believe that this is the kind of place I could lose my job for not \"playing well with others\". I'm just very anxious about the whole situation!",
      "created_utc": 1578574667.0,
      "score": 6,
      "context": [
        {
          "id": "fdmzl12",
          "author": "None",
          "body": "I personally always would stand up for what you believe in. If you are diplomatic most people will accept it. If you don't judge people with HR, but come from a growth mindset, they will have no choice but to hear you out.\nThe same with direct contact with others. Express how horrible you would feel if they talked about you like that. Don't say: your gossiping is horrible. Do say: I would feel horrible if you would talk about me like that.\nThey cannot deny what you are feeling. And if they ignore your comments and HR does not pick up your feedback, consider looking for another job, while you are working in this one.\n\nMental health is extremely important in any line of work and if you are fearful at your work, you will underperform and more importantly feel miserable. You are the most important person in your life, so make sure that YOU are okay.",
          "created_utc": 1578572535.0
        }
      ]
    },
    {
      "id": "fdnasxm",
      "author": "daddydangles911",
      "body": "Thanks so much for the thought :) Unfortunately, I'm not able to listen to music while actually working as I have to wear a headset. But I do listen to it on my lunch break, which spares me from mealtime chats and helps my mood a lot! I will consider maybe playing very low volume music in my free ear, too- I'm not sure if my manager would approve, but it might be worth checking!",
      "created_utc": 1578581743.0,
      "score": 3,
      "context": [
        {
          "id": "fdn4l9v",
          "author": "PissWizardJim",
          "body": "I don't  imagine this will be very helpful at all but I feel better saying it just in case \nAre you able at all to listen to music? I definitely have no way to fix the issue but maybe if you can't  hear it happening it would help a bit.",
          "created_utc": 1578577111.0
        }
      ]
    }
  ]
}