{
  "id": "en6ash",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1578741664.0,
  "title": "Request: Do EDs get worse due to stress?",
  "selftext": "I'm currently facing my last mid-term exam in my final year of uni and my eating disorder has gotten so much worse. I really struggled at Christmas because of all the social eating so assumed I would feel more calm and controlled when I came home to uni but I've gotten so much worse. I know I'm making myself sick (I have developed a terrible cold) but I can't stop obsessing about food and calories. I can't focus on revision at all!! I'm going to fail because I'm stopping work every half an hour to look in the minor and am so exhausted because I haven't eaten anything. I don't know how to feel less stressed",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/en6ash/request_do_eds_get_worse_due_to_stress/",
  "score": 49,
  "num_comments": 8,
  "comments": [
    {
      "id": "fdv22ie",
      "author": "VelvetThunderstorm",
      "body": "Im sorry you're going through this right now. That sounds like a lot to deal with, especially with the added stress of uni. If you have friends you can learn on for support or a mental health professional to call, please do. In the meantime maybe plan some time for just yourself. Read, take a nice bath, go for a walk or swim at the beach. (Nature always helps me destress).\nIf you need someone to vent to, I'd be happy to listen. This random redditor hopes you start to feel better asap",
      "created_utc": 1578742296.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fdyj7bk",
      "author": "Captain_Erica",
      "body": "Yes, stress is a major factor.",
      "created_utc": 1578780363.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fdym7j3",
      "author": "dicklessfifties",
      "body": "EDs are coping mechanisms. Whether over or under eating, it’s a way to deal and “control” things we otherwise couldn’t. It’s totally normal for stress to make things worse.",
      "created_utc": 1578781279.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fdy22mf",
      "author": "mimi326",
      "body": "I’m sorry to hear that you’re going through this. From my own experience, I would say yes, absolutely. At least for me, my ED gets a lot worse when I am stressed. The same thing happened to me last year when I was studying, and my one piece of advice would be if you are ready/feel comfortable/are able, try to talk to a professional. I got so bad last year that I could barely function and it ended up being the push I needed to go and get help..so kind of a blessing in disguise. I am lucky to have a doctor who is very supportive, but I understand that isn’t the case for everyone so if that isn’t an option, having a friend or family member (or random redditor) to talk to could help you feel less overwhelmed. The other thing I would say is just hang in there, as hard as it is right now, the extra stress of exams will pass, and hopefully you’ll find that things improve once it does. Good luck ❤️",
      "created_utc": 1578775220.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fdye2zs",
      "author": "None",
      "body": "My ED does. I find that I'm triggered by upcoming social events that I'm feeling anxious about. I'm also in uni and I definitely struggle with controlling my intake when I feel out of control in my academic life. \n\nI wish I had some ground breaking cure, like we all do I'm sure, but I find what helps me is to be around people I trust and feel comfortable with. Sometimes I even blow of uni work to watch a cartoon that I watched as a kid or something like that. Familiar things seem to bring me peace and I try to avoid introducing new things into my life when I'm struggling with my ED.",
      "created_utc": 1578778730.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fe0f2bg",
      "author": "kimmylafo",
      "body": "Wish I could help. I have the same issue with looking in the mirror. I don’t even want to know how many hours a week I spend there, usually picking my face and making it look 1,000,000 times worse than it did before. Just know you aren’t alone. Good luck on your journey and take care of yourself. You deserve it ❤️",
      "created_utc": 1578812290.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fe01ynm",
      "author": "SecretIdentity8594",
      "body": "I used to think I had one (I don’t think I ever had one anymore.) and stress definitely made my symptoms worse. All the people I’ve known who’ve had them definitely got worse when they were stressed too.",
      "created_utc": 1578801060.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fe04l91",
      "author": "SecretIdentity8594",
      "body": "This is the way I understand them and I think it’s a brilliant way of explaining it. I don’t have one but I know people who do and this matches their description of it.",
      "created_utc": 1578802926.0,
      "score": 2,
      "context": [
        {
          "id": "fdym7j3",
          "author": "dicklessfifties",
          "body": "EDs are coping mechanisms. Whether over or under eating, it’s a way to deal and “control” things we otherwise couldn’t. It’s totally normal for stress to make things worse.",
          "created_utc": 1578781279.0
        }
      ]
    }
  ]
}