{
  "id": "enrty2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1578856446.0,
  "title": "Request: I think my 13 year old brother has an eating disorder",
  "selftext": "For as long as I can remember, my brother has been ‘fussy’ with his food. He will eat: chicken nuggets (only one brand), McDonald’s burger with NOTHING on it, cucumber and pasta. He will not eat sauce, if it touches his plate he will cry and scream and throw up. If his food touches he will not eat it. If it’s a different brand of food he knows IMMEDIATELY. If the food isn’t cooked correctly, he will not eat it. He keeps taking paracetamol for headaches. He exercises for a minimum of 5-6 hours per day (scootering). He is obsessive and has OCD. he picks at his food when he eats it. He drinks only 2 drinks (diet lemonade or water) He will not try any food or drink, ever. \nWhat startled me most, is that I bought him some joggers for Christmas and he said he couldn’t wear them because he looked fat. He put on skinny jeans instead and won’t wear anything else. Also, I had a meal replacement shake the other day (tooth extraction), and he immediately asked what it was and if he could have some.... he NEVER tries anything. He was very interested in trying it. His head is also kind of large in shape and he has a really skinny body. He is nutrient deficient and hyper mobile. His nails have started to get these white lines and he has huge black bags under his eyes. \n\nWhat do you guys think?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/enrty2/request_i_think_my_13_year_old_brother_has_an/",
  "score": 54,
  "num_comments": 13,
  "comments": [
    {
      "id": "fe4cth4",
      "author": "None",
      "body": "ARFID sounds way more plausible. It is a form of an eating disorder. Basically what is it is extreme picky eating that's linked with a serious uninterest in food. It's mostly seen in younger children. It can become serious if it is taken too far as it can cause the child to become severely underweight or nutrient deficient like your brother. So I suggest you talk unto your parents or your brother if you're comfortable.",
      "created_utc": 1578857960.0,
      "score": 41,
      "context": []
    },
    {
      "id": "fe4b0tv",
      "author": "None",
      "body": "Sounds like it, probably linked with the OCD. Have your parents noticed anything/talked to him about it?",
      "created_utc": 1578857431.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fe4bc9p",
      "author": "fishysalt",
      "body": "It might be arfid",
      "created_utc": 1578857546.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fe4if2x",
      "author": "urfcknmotha",
      "body": "Have you heard of sensory processing disorder? Its common with autism and ADHD. I have it and since being a toddler had a lot of eating issues of the like. Made trying new foods unbearable.",
      "created_utc": 1578859623.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fe4aja1",
      "author": "h123m00",
      "body": "Could be a case of bad anxiety combined with his OCD that slowly developed into him using food as coping method. He’s pretty young though so it’s hard to tell. I was a very very picky eater up till the age of about 14? My friends mom actually accused me of being anorexic when I was 12. (I wasn’t, and I wasn’t underweight either lol). \n\nBasically what i think is he his problems with food may be more related to OCD,\nIf he’s actively controlling food to trying to lose weight because of anxiety from bad body image then that’s an ED. based on one comment of him being fat you can’t know for sure. Remember there’s a large component of problems with body image in an anorexia or bulimia or OSFED diagnosis. \n\nI’m studying behavioural neuroscience in uni, and from what I’ve learned  it’s pretty common for young kids to have weird eating habits and not have an Ed. So it’s hard to tell",
      "created_utc": 1578857328.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fe5l1ry",
      "author": "Thekisk",
      "body": "There’s overlapping that can happen between eating disorders. Sounds like arfid but there’s always the possibility he could suffer from something else like anorexia as well.",
      "created_utc": 1578870811.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fe66oth",
      "author": "FinnianFae",
      "body": "Sounds like ARFID",
      "created_utc": 1578883004.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fe69scs",
      "author": "d0ntworryboutit",
      "body": "Might be autism",
      "created_utc": 1578884968.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fe5s032",
      "author": "Echeveria1987",
      "body": "I agree with others it sounds like avoidant/restrictive eating patterns, especially since you said “as long as I can remember” which implies, to me, this eating pattern was present throughout his childhood. What do your parents think of his eating habits?",
      "created_utc": 1578873681.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fe6stbq",
      "author": "reney11poe",
      "body": "Afrid possibly",
      "created_utc": 1578903740.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fe80m9o",
      "author": "RayRay_Hessel",
      "body": "Ocd with food definitely. My friend has that. And possibly anorexia mixed with arfid. These can be comorbid. I have ednos and ocd. I thought my ed was gone but it came back aftrr i starved myself for ocd reasons and really liked being thin. Everyone commenting on it made me more ED. The old thoughts came back.",
      "created_utc": 1578921026.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fe6itd3",
      "author": "CinnamonShipper",
      "body": "ARFID, SPD, and OCD can co-occur so it would be worth checking out",
      "created_utc": 1578892257.0,
      "score": 8,
      "context": [
        {
          "id": "fe4if2x",
          "author": "urfcknmotha",
          "body": "Have you heard of sensory processing disorder? Its common with autism and ADHD. I have it and since being a toddler had a lot of eating issues of the like. Made trying new foods unbearable.",
          "created_utc": 1578859623.0
        }
      ]
    },
    {
      "id": "fe80vcf",
      "author": "RayRay_Hessel",
      "body": "Yeah i have autism and thus spd and i can't eat certain foods because of texture etc.",
      "created_utc": 1578921114.0,
      "score": 3,
      "context": [
        {
          "id": "fe4if2x",
          "author": "urfcknmotha",
          "body": "Have you heard of sensory processing disorder? Its common with autism and ADHD. I have it and since being a toddler had a lot of eating issues of the like. Made trying new foods unbearable.",
          "created_utc": 1578859623.0
        }
      ]
    }
  ]
}