{
  "id": "ep0sl9",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1579085301.0,
  "title": "Request: Has anyone else recovered from an ED and been able to stay healthy as a vegan?",
  "selftext": " \n\nI want to be vegan for environmentalist reasons but telling myself I can't eat certain things sends me back to a bad place.\n\nI live with my family (high school senior) and can't tell them what food to buy.\n\nI'm involved in the environmentalist community and want to major in environmental biology in college and feel hypocritical.\n\nHas anyone else recovered from an ED and been able to stay healthy as a vegan?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ep0sl9/request_has_anyone_else_recovered_from_an_ed_and/",
  "score": 40,
  "num_comments": 24,
  "comments": [
    {
      "id": "fegctkm",
      "author": "f-f-fuckit",
      "body": "This is just my experience but it might help. I couldn’t manage to stay completely vegan, it triggered restrictive behaviours for me, I am still recovering though and was still recovering when I tried to make the translation so it probably wasn’t the best timing. \n\nWhat I have found works for me and is in line with wanting to be more environmentally friendly is a vegetarian diet which is vegan about 90%, shopping for local produce and reducing my use of single-use plastics. There are loads of things you can do which I’m sure you’re already aware of. There are some good subreddits as well like r/sustainability and r/zerowaste.",
      "created_utc": 1579088010.0,
      "score": 24,
      "context": []
    },
    {
      "id": "fegu0dx",
      "author": "tintinsan",
      "body": "Hi! Former anorexic and bulimic here and now healthy vegan!\n\nOne of the biggest things that helped me not only transition to being vegan (for 2 years now) was adding things to my diet before taking things away!\n\nBy this I mean instead of cutting out dairy milk I made sure to find a plant milk that I like! Instead of cutting out meat entirely I made an effort to learn to cook lots of recipes I loved using chickpeas, beans, tofu, and lentils. And I found other vegan foods to replace former staples in my diet.\n\nThis way it didnt feel like I was restricting or focusing too much on what I was making or the food I was eating. I was just eating new foods that I loved.\n\nBest of luck to you!",
      "created_utc": 1579102506.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fegie14",
      "author": "neverendingtasklist",
      "body": "I started recovery as a vegan. I switched to vegetarian because my health was so messed up after years of restricting a vegan diet just wasn't nutritious enough to allow my body to fully bounce back. Recently I found i needed even more protein and switched to pescatarian 🤷‍♀️ Enviromentalism and concern for animals is very important but after years of abuse remember your body will take a long time to bounce back, and there may be times you need to focus on nutrition and balance over anything else. Take care of yourself 🌟",
      "created_utc": 1579093721.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fegixbe",
      "author": "sunflowersadly",
      "body": "Yeah I have to some extent - because I know being too rigid with any diet will tempt me to restrict, I eat a vegan diet at home, or when I go out and order my own food (I live in an area which makes this super easy for me, lots of vegan options!), but when someone else cooks for me or everyone is sharing food at a restaurant which isn’t vegan, I’ll just eat whatever everyone else is eating.  This isn’t because I miss animal products and need an excuse to eat them, but it’s because having an eating disorder is super socially isolating, and so I need to remind myself of the joy of sharing food with loved ones, and also just to be careful not to let myself get too strict in any way with food.  It’s really worked for me.  Obviously it means I can’t truly call myself a vegan, but it means I eat vegan food 90% of the time and every little helps!\n\nHowever, I live in a big city with so many vegan options that I don’t really feel restricted at all by my food choices anyway... there’s vegan cake shops, ice cream, donuts, fried “chicken” as well as more traditional falafel and curry type vegan foods, so I don’t feel like I’m forced to make low calorie choices which is important in recovery!  if you live somewhere with few vegan choices, it might be more of a restrictive trigger, and everybody is different, so I can’t say my experience will be the same for anyone else!",
      "created_utc": 1579094182.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fegsf2j",
      "author": "mourningxdove",
      "body": "I was in recovery and vegan, strangely it helped me eat more and I enjoyed cooking and learning new recipes. I started relapsing and I then went back to being vegetarian. I really struggling with my iron intake and had to go on supplements. If you do go vegan, do your research on what foods you can get adequate nutrient from. Don't be like me and end up a weak mess. I'm a vegan now at the moment but I'm in a relapse and my bloods are whack. Basically what I'm saying is if you feel strong enough go for it, if not maybe try recover first before you go vegan as its a big lifestyle change.",
      "created_utc": 1579101456.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fegda7l",
      "author": "pedismd",
      "body": "I have!",
      "created_utc": 1579088571.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fehdxzc",
      "author": "MrsCriket",
      "body": "I think this really depends on each individual person and their own specific relationship with food. I am personally a vegan who has recovered from an eating disorder (several), however I am also a counselling psychologist and work in an eating disorder service.\n\nMy first piece of advice would be to feel as though you are generally recovered (as much as we can ever be) before taking on a vegan diet. Other peoples advice here about starting out more slowly make sense. I would also say that you need to make sure you are eating a very varied and as much as possible non restrictive vegan diet. Luckily where I live in England I can almost eat an identical diet to my diet before veganism because of the amount of vegan substitutes and the amount of options when eating out, but if that isn't possible get to grips with cooking/baking delicious and nutritious vegan meals for yourself so you dont feel deprived or restricted. Make sure you eat enough as vegan diets tend to be lower in calories overall and you may need to eat more volume than you are used to. You will also need to supplement B12 and maybe other things depending on how you chose to eat.\n\nThe last thing I would say is to listen to your mind and your body. If you get any warning signs that you know are features of your ED, you will have to consider how you can move forward in a way that works for your mind, body and values. I care about animals and the environment, but first and foremost you have to take care of yourself and your wellbeing. You are the expert on yourself, and only you can really know whether you will be able to do this safely. If it feels wrong, dont do it. \n\nAs a vegan I would like to say thank you for considering this lifestyle for the sake of animals and the planet, it is really kind and compassionate of you, but no one will blame you, or has any right to, for taking care of yourself first and foremost. If you decide to do it, monitor yourself closely, and if it looks like it could cause relapse. STOP.",
      "created_utc": 1579114565.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fegbkni",
      "author": "moonie-me",
      "body": "I'm vegan for animals, environment and health.\n\nI haven't recovered from an ED.",
      "created_utc": 1579086416.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fehogrb",
      "author": "c4ndyf10ss",
      "body": "Veganism was the main reasons for me recovering. Instead of thinking veganism is restrictive, I told myself that if I’m vegan I’m not hurting any animals. It helped me come to terms with eating, and made me feel a lot less guilty.",
      "created_utc": 1579120681.0,
      "score": 2,
      "context": []
    },
    {
      "id": "feiiohr",
      "author": "rosieb1",
      "body": "Hi! I’m a healthy recovered vegan! I used to be anorexic and also experienced bed. Being vegan actually helped me form a healthier relationship with food because it helped me to appreciate the importance of eating a substantial amount and ensuring you feed your body with the correct vitamins. Because the reality is, there’s no way you can starve yourself and be a healthy functioning vegan at the same time. I’d suggest just focus on your mentality toward food at this point in time. If you think going vegan at this point in time would be a bad headspace then just focus on getting better. Maybe veganism can be a long term goal for you instead :) I would also suggest transitioning slowly to the diet e.g going vegetarian first, as it is a huge change.",
      "created_utc": 1579139427.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fegs5zy",
      "author": "owink",
      "body": "Check out Merry Rose Howley on youtube !!",
      "created_utc": 1579101285.0,
      "score": 1,
      "context": []
    },
    {
      "id": "feh3k4k",
      "author": "flyingsqueak",
      "body": "I became vegan as I was entering recovery. For me it was both environmental and as a way to take control of something with my body. This was about ten years ago, and while I've had a few ED relapses, I've mostly maintained a healthy weight and healthy food habits. \n\nBut I did that as an adult living on my own. (kind of, it was part of leaving an abusive relationship) That would not have worked if I couldn't control what food was available in the house. You need to choose what you are eating, rather than choosing what you \"can't eat\".\n\nI'd really recommend waiting until you are on your own. If your college offers plenty of vegan options it might work then, but you might need to wait until after college.",
      "created_utc": 1579108414.0,
      "score": 1,
      "context": []
    },
    {
      "id": "feh5i7m",
      "author": "deneezu",
      "body": "Former anorexic and 4 year vegan here. \nI think it is very possible, but I gradually transitioned from vegetarian to vegan, slowly cutting out foods as I added more to my diet. I would imagine this would be challenging as a teen living at home not being able to shop for yourself. Maybe as you transition into adulthood, you can slowly substitute non veg items for veg ones. For instance, cut out red meat first and try some legumes you don’t normally eat, like lentils. I think the support of your family is crucial on this one, and mine was very apprehensive when I went veg because they thought it was simply to restrict. \n\nTake it slow, and if you feel yourself being triggered remember that you need to take care of yourself as a priority. You have your whole life ahead of you and even if it doesn’t happen immediately, it doesn’t mean it never will ❤️ feel free reach out with any questions you might have :)",
      "created_utc": 1579109563.0,
      "score": 1,
      "context": []
    },
    {
      "id": "feh63hb",
      "author": "Simplicityobsessed",
      "body": "I've been vegan for a while - and vegetarian. I remained vegan throughout my relapses, and recoveries. I now am in a pretty healthy place- I workout too, and I'd consider myself largely recovered. I was vegetarian/vegan before developing a restrictive ED, which may be a big part of why it didn't impact my ED recovery.\n\nFor me? It was all about a mindset change - about focusing on the cool new things I could try, versus the ones that I was restricted to, as a vegan. For me, dietary restrictions have also been a huge trigger in the past, and I simply expanded my plate, and committed to trying new things, so that it wasn't restrictive.\n\nIf you live in an area that is not friendly to vegans, this may be hard. I live in a rather liberal state, and near big cities, where vegan food is common. I am also okay with/have been able to always find the time to cook - so I can't possibly get away with lying to myself and excusing neglecting to eat. If you don't live in an area like this and/or have the ability to cook, it may end very differently. I don't fully understand why too, but it made me feel more connected to, and at ease with my food (being vegan that is). \n\nIf you feel like it may impact your recovery, then do what you can without sacrificing your health. People may disagree (some vegans/vegetarians can be ironically un-sympathetic with people regarding this....), but every little bit counts. If you replace one gallon of milk with almond milk once a week? It helps. If you pass up a burger for a veggie burger, or eggs for tofu once a week? it helps. You don't have to commit to a completely 100% vegan diet, to make a difference. There are also plenty of resources on zero waste, and other lifestyle factors you can change to make a difference. One of those is buying locally too!\n\nLook at it this way - if you don't take care of yourself and address your ED, you'll end up not being able to advocate for the environment, and at worst, contributing to it by ending up binge eating/etc (for me, this is when I make the worst environmental decisions).\n\nYour health should always come first - and if you want to pursue this, make sure you find a way to do it educated and with lots of support!",
      "created_utc": 1579109918.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fehxft2",
      "author": "Lilith-Rising",
      "body": "Yes, it’s just about changing the environment. It’s hard if you frame it as restriction, and it is often framed as such, then it’s going to mess with your Ed, but if you frame it as simply not an option to exploit an animal like u wouldn’t eat a baby or a pup, and see food availability as SUPER plentiful aside from those few options, there will not be that restriction nagging feeling, I’ve found. Gotta have staples in the house though bc one thing I’ve found is nothing compares to high protein meal to prevent my binges, you gotta learn to cook and not be lazy, it’s harder if you grew up in a culture that didn’t teach you to cook veg. I’ve been on both sides, restriction and binges and veg and not. It’s about priorities. But you can still have a smaller carbon footprint than say, a vegan who eats all these processed veg foods, just be mindful about your sourcing and remember that EVERYTHING comes at a price of exploitation, the degree you are complicit is something you need to examine for yourself.",
      "created_utc": 1579125793.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fegj114",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1579094270.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fegjew9",
      "author": "None",
      "body": "This is solid advice. Nutrient tracking and restricting food groups will inevitably trigger me to engage in ED behaviours, and I found it difficult to reconcile a plant-based diet with ED recovery, especially because I am prone to black and white thinking (\"if I don't recycle every single bit of plastic I use, abstain from almond milk because of its environmental impact, or fail to not give in to this particular animal product craving, I will be single-handedly responsible for the world going to hell in a handbasket\").\n\nThe thing is, though, that [personal responsibility](https://www.theguardian.com/environment/true-north/2017/jul/17/neoliberalism-has-conned-us-into-fighting-climate-change-as-individuals) only goes so far. Ethical consumption and moral perfectionism are both impossible in an imperfect world that is built on exploitation. Marx, I think, said it best: \"from each according to his ability, to each according to his needs\". If veganism would impede your recovery - and it sounds like it would - you should probably consider other ways to reconcile your moral and ethical beliefs with your lifestyle. Small things add up, and it would be difficult to help save the world in a dying body.",
      "created_utc": 1579094601.0,
      "score": 13,
      "context": [
        {
          "id": "fegctkm",
          "author": "f-f-fuckit",
          "body": "This is just my experience but it might help. I couldn’t manage to stay completely vegan, it triggered restrictive behaviours for me, I am still recovering though and was still recovering when I tried to make the translation so it probably wasn’t the best timing. \n\nWhat I have found works for me and is in line with wanting to be more environmentally friendly is a vegetarian diet which is vegan about 90%, shopping for local produce and reducing my use of single-use plastics. There are loads of things you can do which I’m sure you’re already aware of. There are some good subreddits as well like r/sustainability and r/zerowaste.",
          "created_utc": 1579088010.0
        }
      ]
    },
    {
      "id": "fehw74t",
      "author": "not_cinderella",
      "body": "Agree with this and would like to add my own experience as it’s similar. I don’t eat any meat or dairy but found cutting out eggs and honey to be a barrier for me. Just eating those 2 things helped my anxiety around food a lot (eggs go easy down my throat and honey tea helps me when I’m sick and depressed) as well as help me take part more in family meals. I try to buy local eggs and honey and also an working on my waste and buying second hand for any non food item which contains animal by-products (I.e bought my leather boots off a friend).",
      "created_utc": 1579125083.0,
      "score": 2,
      "context": [
        {
          "id": "fegctkm",
          "author": "f-f-fuckit",
          "body": "This is just my experience but it might help. I couldn’t manage to stay completely vegan, it triggered restrictive behaviours for me, I am still recovering though and was still recovering when I tried to make the translation so it probably wasn’t the best timing. \n\nWhat I have found works for me and is in line with wanting to be more environmentally friendly is a vegetarian diet which is vegan about 90%, shopping for local produce and reducing my use of single-use plastics. There are loads of things you can do which I’m sure you’re already aware of. There are some good subreddits as well like r/sustainability and r/zerowaste.",
          "created_utc": 1579088010.0
        }
      ]
    },
    {
      "id": "feh3zbe",
      "author": "flyingsqueak",
      "body": "This! Look for all the things you can eat rather than the things you can't. A vegan diet doesn't need to be even slightly restrictive.",
      "created_utc": 1579108663.0,
      "score": 7,
      "context": [
        {
          "id": "fegu0dx",
          "author": "tintinsan",
          "body": "Hi! Former anorexic and bulimic here and now healthy vegan!\n\nOne of the biggest things that helped me not only transition to being vegan (for 2 years now) was adding things to my diet before taking things away!\n\nBy this I mean instead of cutting out dairy milk I made sure to find a plant milk that I like! Instead of cutting out meat entirely I made an effort to learn to cook lots of recipes I loved using chickpeas, beans, tofu, and lentils. And I found other vegan foods to replace former staples in my diet.\n\nThis way it didnt feel like I was restricting or focusing too much on what I was making or the food I was eating. I was just eating new foods that I loved.\n\nBest of luck to you!",
          "created_utc": 1579102506.0
        }
      ]
    },
    {
      "id": "fegexux",
      "author": "None",
      "body": "You're going to hate me for saying this, but if you've got an eating disorder, veganism is not the best diet to follow. Whilst your heart if in a ood place with animals and environment, health is another issue, please question yourself thoroughly whether you are really doing it for health or whether it is a nice distraction from \"unhealthy\" and \"high calorie\" foods - treats such as ice cream, chocolate, and cakes all contain animal products and going vegan is a great excuse to avoid eating these.\n\nI was a vegetarian during my recovery and still managed to eat with as little environmental impact as was possible. Depending on where you are from, many foods (particularly fruit and veg) have been flown thousands of kilometres to get to you; some \"super foods\" such as quinoa are being grown in countries where it used to be a staple food but now the demand from the western world is so high, that producers can't even afford their own produce. If you eat nut butter (which most healthy vegans would include for fats and protein supplementation), the nuts have likely travelled far and, depending on the brand, may contain palm oil (loads of food contains this) which is detrimental to the environment.\n\nI'm sorry for the rant, but I just don't think veganism in an ED mindset is sustainable or in the least bit healthy. If you've recovered then you can reconsider.",
      "created_utc": 1579090433.0,
      "score": 15,
      "context": [
        {
          "id": "fegbkni",
          "author": "moonie-me",
          "body": "I'm vegan for animals, environment and health.\n\nI haven't recovered from an ED.",
          "created_utc": 1579086416.0
        }
      ]
    },
    {
      "id": "feguif9",
      "author": "tintinsan",
      "body": "Ethically raised meat/eggs isnt \"easier\" on the environment. Dairy milk alone uses 7x the water as oat milk. \n\nDo a little research.",
      "created_utc": 1579102826.0,
      "score": 1,
      "context": [
        {
          "id": "fegj114",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1579094270.0
        }
      ]
    },
    {
      "id": "fehloqk",
      "author": "Symj89",
      "body": "I think that when you no longer view animal products as food, then not eating them doesn’t even slightly feel like restriction.",
      "created_utc": 1579119076.0,
      "score": 4,
      "context": [
        {
          "id": "fegbkni",
          "author": "moonie-me",
          "body": "I'm vegan for animals, environment and health.\n\nI haven't recovered from an ED.",
          "created_utc": 1579086416.0
        },
        {
          "id": "fegexux",
          "author": "None",
          "body": "You're going to hate me for saying this, but if you've got an eating disorder, veganism is not the best diet to follow. Whilst your heart if in a ood place with animals and environment, health is another issue, please question yourself thoroughly whether you are really doing it for health or whether it is a nice distraction from \"unhealthy\" and \"high calorie\" foods - treats such as ice cream, chocolate, and cakes all contain animal products and going vegan is a great excuse to avoid eating these.\n\nI was a vegetarian during my recovery and still managed to eat with as little environmental impact as was possible. Depending on where you are from, many foods (particularly fruit and veg) have been flown thousands of kilometres to get to you; some \"super foods\" such as quinoa are being grown in countries where it used to be a staple food but now the demand from the western world is so high, that producers can't even afford their own produce. If you eat nut butter (which most healthy vegans would include for fats and protein supplementation), the nuts have likely travelled far and, depending on the brand, may contain palm oil (loads of food contains this) which is detrimental to the environment.\n\nI'm sorry for the rant, but I just don't think veganism in an ED mindset is sustainable or in the least bit healthy. If you've recovered then you can reconsider.",
          "created_utc": 1579090433.0
        }
      ]
    },
    {
      "id": "fegucov",
      "author": "tintinsan",
      "body": "I totally get what you're saying here but you can still enjoy burgers and ice cream, chocolate, and cake on a vegan diet and recover from an ed while vegan (I did it) though I understand it's not possible for everyone and I dont wanna force veganism on anyone or pressure them. But also not every vegan follows \"superfoods\" like quinoa and such. I've never bought quinoa in my life\n\nAs long as you do your best to avoid fad diets within the vegan community and try and focus on cooking foods you personally enjoy I think its deffinitely possible.",
      "created_utc": 1579102726.0,
      "score": 2,
      "context": [
        {
          "id": "fegbkni",
          "author": "moonie-me",
          "body": "I'm vegan for animals, environment and health.\n\nI haven't recovered from an ED.",
          "created_utc": 1579086416.0
        },
        {
          "id": "fegexux",
          "author": "None",
          "body": "You're going to hate me for saying this, but if you've got an eating disorder, veganism is not the best diet to follow. Whilst your heart if in a ood place with animals and environment, health is another issue, please question yourself thoroughly whether you are really doing it for health or whether it is a nice distraction from \"unhealthy\" and \"high calorie\" foods - treats such as ice cream, chocolate, and cakes all contain animal products and going vegan is a great excuse to avoid eating these.\n\nI was a vegetarian during my recovery and still managed to eat with as little environmental impact as was possible. Depending on where you are from, many foods (particularly fruit and veg) have been flown thousands of kilometres to get to you; some \"super foods\" such as quinoa are being grown in countries where it used to be a staple food but now the demand from the western world is so high, that producers can't even afford their own produce. If you eat nut butter (which most healthy vegans would include for fats and protein supplementation), the nuts have likely travelled far and, depending on the brand, may contain palm oil (loads of food contains this) which is detrimental to the environment.\n\nI'm sorry for the rant, but I just don't think veganism in an ED mindset is sustainable or in the least bit healthy. If you've recovered then you can reconsider.",
          "created_utc": 1579090433.0
        }
      ]
    },
    {
      "id": "feiv7z5",
      "author": "icecreamtreats",
      "body": "I have been vegetarian most of my life, since I was 10...ED began around 16. I’m in midtolate30s (ahh seems older in type). Only one in my family a vegetarian. One day I decided that I was committing to not eating animals and it was super easy to live a life without eating animals. Never ever felt like restriction for me and still doesn’t to this day. I was also vegan for some time in senior year HS and portions of college but it was not to restrict.",
      "created_utc": 1579148115.0,
      "score": 1,
      "context": [
        {
          "id": "fegbkni",
          "author": "moonie-me",
          "body": "I'm vegan for animals, environment and health.\n\nI haven't recovered from an ED.",
          "created_utc": 1579086416.0
        },
        {
          "id": "fegexux",
          "author": "None",
          "body": "You're going to hate me for saying this, but if you've got an eating disorder, veganism is not the best diet to follow. Whilst your heart if in a ood place with animals and environment, health is another issue, please question yourself thoroughly whether you are really doing it for health or whether it is a nice distraction from \"unhealthy\" and \"high calorie\" foods - treats such as ice cream, chocolate, and cakes all contain animal products and going vegan is a great excuse to avoid eating these.\n\nI was a vegetarian during my recovery and still managed to eat with as little environmental impact as was possible. Depending on where you are from, many foods (particularly fruit and veg) have been flown thousands of kilometres to get to you; some \"super foods\" such as quinoa are being grown in countries where it used to be a staple food but now the demand from the western world is so high, that producers can't even afford their own produce. If you eat nut butter (which most healthy vegans would include for fats and protein supplementation), the nuts have likely travelled far and, depending on the brand, may contain palm oil (loads of food contains this) which is detrimental to the environment.\n\nI'm sorry for the rant, but I just don't think veganism in an ED mindset is sustainable or in the least bit healthy. If you've recovered then you can reconsider.",
          "created_utc": 1579090433.0
        },
        {
          "id": "fehloqk",
          "author": "Symj89",
          "body": "I think that when you no longer view animal products as food, then not eating them doesn’t even slightly feel like restriction.",
          "created_utc": 1579119076.0
        }
      ]
    },
    {
      "id": "feh9a2m",
      "author": "None",
      "body": "Of course you can still eat ice cream etc. as a vegan, however it still is a great excuse if there is cake at work or if someone is planning on going out for a meal somewhere, particularly where the ingredients aren't listed so something like a salad is safe because the veggie burger may contain egg or the bun may contain milk. There are too many restrictive excuses which could ultimately lead to exacerbating eating disordered patterns or malnutrition. \n\nCongrats on your recovery, it's a massive achievement and takes a lot of dedication and effort. It would seem that you are in the minority who have managed to recover whilst vegan.",
      "created_utc": 1579111806.0,
      "score": 3,
      "context": [
        {
          "id": "fegbkni",
          "author": "moonie-me",
          "body": "I'm vegan for animals, environment and health.\n\nI haven't recovered from an ED.",
          "created_utc": 1579086416.0
        },
        {
          "id": "fegexux",
          "author": "None",
          "body": "You're going to hate me for saying this, but if you've got an eating disorder, veganism is not the best diet to follow. Whilst your heart if in a ood place with animals and environment, health is another issue, please question yourself thoroughly whether you are really doing it for health or whether it is a nice distraction from \"unhealthy\" and \"high calorie\" foods - treats such as ice cream, chocolate, and cakes all contain animal products and going vegan is a great excuse to avoid eating these.\n\nI was a vegetarian during my recovery and still managed to eat with as little environmental impact as was possible. Depending on where you are from, many foods (particularly fruit and veg) have been flown thousands of kilometres to get to you; some \"super foods\" such as quinoa are being grown in countries where it used to be a staple food but now the demand from the western world is so high, that producers can't even afford their own produce. If you eat nut butter (which most healthy vegans would include for fats and protein supplementation), the nuts have likely travelled far and, depending on the brand, may contain palm oil (loads of food contains this) which is detrimental to the environment.\n\nI'm sorry for the rant, but I just don't think veganism in an ED mindset is sustainable or in the least bit healthy. If you've recovered then you can reconsider.",
          "created_utc": 1579090433.0
        },
        {
          "id": "fegucov",
          "author": "tintinsan",
          "body": "I totally get what you're saying here but you can still enjoy burgers and ice cream, chocolate, and cake on a vegan diet and recover from an ed while vegan (I did it) though I understand it's not possible for everyone and I dont wanna force veganism on anyone or pressure them. But also not every vegan follows \"superfoods\" like quinoa and such. I've never bought quinoa in my life\n\nAs long as you do your best to avoid fad diets within the vegan community and try and focus on cooking foods you personally enjoy I think its deffinitely possible.",
          "created_utc": 1579102726.0
        }
      ]
    }
  ]
}