{
  "id": "epdzz9",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1579147555.0,
  "title": "Request: Cancer and my eating disorder",
  "selftext": "The past three weeks have been full of anxiety and my life being controlled by food and restriction. I’m underweight for the first time since I had surgery when I was 18 almost two years ago, and I’m happy and sad. \nBut today was my second follow up scan that gave me the good news that I am still cancer free for almost two years now. The cancer I had was rare in kids, but I was lucky I didn’t need chemotherapy and only radiation treatment. So today I celebrated that in my life, and I had a frappuccino, cheeseburger, and piece of cheesecake because I saw it and said I wanted it. Weird combination and I feel like poop but I ate it all and I didn’t care for one special day in my life and I feel good for right now at least. Today was an okay day.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/epdzz9/request_cancer_and_my_eating_disorder/",
  "score": 97,
  "num_comments": 6,
  "comments": [
    {
      "id": "feivis3",
      "author": "ilivetomosh",
      "body": "I'm glad that you're still ok ♡ and I'm glad that you ate",
      "created_utc": 1579148353.0,
      "score": 10,
      "context": []
    },
    {
      "id": "feixker",
      "author": "NegativeVibes1",
      "body": "I'm really happy for you, also glad you got to eat some tasty foods!",
      "created_utc": 1579149993.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fejcwfo",
      "author": "maddi-el",
      "body": "bless you, congratulations op. you deserve that meal more than anybody and should treat your body with kindness after winning such a tough fight 💕",
      "created_utc": 1579167763.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fekvrf0",
      "author": "NutellaKiller",
      "body": "I'm really happy for you. Let's celebrate life every day. You deserve every drop of happiness. True survivor! <3",
      "created_utc": 1579208607.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fg2suip",
      "author": "meghansmith6",
      "body": "I have cancer and an ED too I totally relate to this it’s so hard to want to help your body be healthy but then also be consumed by food issues lol hope you’re doing okay babes xo",
      "created_utc": 1580454461.0,
      "score": 1,
      "context": []
    },
    {
      "id": "feiysxz",
      "author": "rekacsenpai",
      "body": "Happy cake day!",
      "created_utc": 1579151048.0,
      "score": 1,
      "context": [
        {
          "id": "feivis3",
          "author": "ilivetomosh",
          "body": "I'm glad that you're still ok ♡ and I'm glad that you ate",
          "created_utc": 1579148353.0
        }
      ]
    }
  ]
}