{
  "id": "er77bm",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1579490516.0,
  "title": "Request: How to support my (male) friend with anorexia",
  "selftext": "I am fairly new to the world of EDs, but I've been reading as much as I can. Please do correct me if I make any incorrect assumptions, use improper/unhelpful language, etc.\n\nOne of my (F17) closest friends (M17) was diagnosed with anorexia nervosa in middle school, before I met him. He mentioned this in passing a few months ago, but he heavily implied that he had fully recovered. I didn't think much of it at the time, especially given that he had gained quite a bit of weight since middle school (he's still extremely underweight, but has improved significantly). \n\nHowever, lately I've noticed that he has been severely restricting. I don't know if he's been doing this all along and I've just been oblivious or if he's been backsliding, but I've seen him go at least 8 hours with only a few bites to eat. I'm extremely concerned about both his physical and mental health, so I've been reading what I can in an attempt to understand his experiences and be a positive force in his recovery. [FYI: his parents and doctor are aware of this issue, but I'm not sure if he's receiving any treatment]\n\nHe recently initiated a discussion with me about his eating habits. He knows that he is substantially underweight and he wants to change that, but he also says that he feels full all of the time and that he doesn't really eat when stressed. The word \"anorexia\" was never mentioned, but it was the implicit context behind the discussion. I would like to bring it up again to discuss the disorder specifically and find out how he experiences it (as has been recommended in many of the articles I've read). Would it be appropriate to say something like \"I know that you've struggled with anorexia in the past and I've noticed that you haven't been eating very much lately. I don't know a lot about eating disorders, but I would like to learn more if you feel comfortable sharing\"? I think the most natural time to bring this up would be the next time he's eating virtually nothing at lunch, but would it be better to bring it up when food isn't around?\n\nSecondly, if he chooses not to discuss the matter with me immediately, when/how can I bring it up later? What is the appropriate amount of \"pressure,\" so to speak, to apply?\n\nThirdly, I imagine that this is especially difficult for him considering that society does not typically associate anorexia with heterosexual males. Is there anything I should be cognizant of in that regard? Anything I should or should not bring up, or that I should be prepared to discuss?\n\nThank you for any and all advice!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/er77bm/request_how_to_support_my_male_friend_with/",
  "score": 36,
  "num_comments": 10,
  "comments": [
    {
      "id": "ff284s3",
      "author": "seatangle",
      "body": ">\"I know that you've struggled with anorexia in the past and I've noticed  that you haven't been eating very much lately. I don't know a lot about  eating disorders, but I would like to learn more if you feel  comfortable sharing\"\n\nThis is a good place to start. Perhaps also add that you are concerned and ask how you can help. Knowing someone cares and is there to talk is the main thing. Yes, much better to bring it up when food isn't around. If someone brought up my eating disorder while I was trying to eat or around other people, that would make it a lot more difficult.\n\nI don't think the fact he's male should be brought up, unless he wants to talk about that. I had a male friend that struggled with anorexia (we both did) and his triggers were different, but there were more similarities than differences. It's a coping mechanism underneath everything.",
      "created_utc": 1579496575.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ff2ybds",
      "author": "zstep952",
      "body": "Heterosexual male here who struggled with an eating disorder for many years. \n\nI think your intuition is right, just being available and making it clear/known that you are open to talking, listening, etc. Avoid any comments about food, body image, exercise, even if you mean well in that he looks better having gained some weight. \n\nIs his family supportive/involved? Do you know of any big changes in his life that may be triggering relapse? I always struggle more around things like new relationships, school changes, family issues. Any time something major was out of my control I tended to lean on the ED for control.",
      "created_utc": 1579528504.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ff3wumg",
      "author": "addisonxb",
      "body": "As a guy who has also struggled with anorexia in the past, I can relate to the fact that if he is bringing up his eating habits at all hes asking for some sort of help whither he realizes it or not. At least that's how I approached my situation before I went to treatment.",
      "created_utc": 1579550594.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ff2yy37",
      "author": "stpfah",
      "body": "It sounds like he's already asking for some support from you.  He obviously trusts you with this vulnerability. My best to you and to him. I hope he gets the support he needs.\n\nThat being said: take care of yourself.  You are not responsible for his ED or his recovery.  You sound like a very supportive friend. And that is fabulous!",
      "created_utc": 1579529068.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ff5d1eo",
      "author": "None",
      "body": "I would refrain from commenting on how much/little he’s been eating, as this can also be a trigger, and I’ve personally misconstrued it to be praise. A good start is asking how he’s feeling or what he’s thinking, and also letting him know you’ve been reading up on eating disorders (and I’d avoid saying the diagnosis until he says it first, again it’s a weird thing that I’ve seen trigger and been triggered by) are a bit concerned, and that you’re there to listen if he wants to talk.",
      "created_utc": 1579587836.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ffaeozi",
      "author": "rileyyj001",
      "body": "I would not bring up the fact that you’ve noticed he hasn’t been eating. He’s going to feel like he’s been under some kind of watchful eye and it could lead him into even more secretive behaviors, OR he may pull away from you. Since he initiated the first conversation, you can simply say “since we last talked about this, I have some questions...” or “I’d like to know more...” or “how are you feeling since we discussed...”\n\nI know as someone (M28) with AN I would feel very threatened and embarrassed having someone basically say “you’re drawing my attention and now I need to step in to save you.” \n\nIt’s hard to know the right thing to say, but you have to come at it completely neutral and in a non-threatening way of the walls instantly go UP. \n\n♥️♥️♥️",
      "created_utc": 1579733919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ff33u1k",
      "author": "life_of_fabiola",
      "body": "You are soooo wonderful to ask this here. I'm sure you are a good friend and he's lucky to have you :)",
      "created_utc": 1579532981.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff4jiwq",
      "author": "None",
      "body": "I think you could suggest he see a nutritionist. For me (19m) learning the truth about nutrition and the value of bulking up from underweight had huge value. For me at least, I just never thought I could change from my ED, but after learning to admire big, strong men like Arnold Schwarzenegger I still want to be skinny, but know you can still be lean and big.",
      "created_utc": 1579565125.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff4obly",
      "author": "thinker111111",
      "body": "OP here. I suspect that the stress of going to college next year, moving away from home, making new friends, dealing with impostor syndrome, etc may be part of the trigger. Do you think talking with him about these things would be helpful? Pointing out these observations?",
      "created_utc": 1579568488.0,
      "score": 2,
      "context": [
        {
          "id": "ff2ybds",
          "author": "zstep952",
          "body": "Heterosexual male here who struggled with an eating disorder for many years. \n\nI think your intuition is right, just being available and making it clear/known that you are open to talking, listening, etc. Avoid any comments about food, body image, exercise, even if you mean well in that he looks better having gained some weight. \n\nIs his family supportive/involved? Do you know of any big changes in his life that may be triggering relapse? I always struggle more around things like new relationships, school changes, family issues. Any time something major was out of my control I tended to lean on the ED for control.",
          "created_utc": 1579528504.0
        }
      ]
    },
    {
      "id": "ff65wwc",
      "author": "zstep952",
      "body": "I think so! It sounds like you are close friends and assuming he has been willing to talk about things related to his ED with you, I don’t see why not. But ya know, be sure you aren’t pushy or trying to act like a therapist, just a loving and available friend. Let me know how it goes :)\n\nThis is my story but also a helpful article too on men with eating disorders:\n\nhttps://www.sportingnews.com/us/other-sports/news/eating-disorders-runners-long-distance-running-male-anorexia-zachary-stepanovich/1bwthjj8bzkj91t048o4issf4m",
      "created_utc": 1579619904.0,
      "score": 1,
      "context": [
        {
          "id": "ff2ybds",
          "author": "zstep952",
          "body": "Heterosexual male here who struggled with an eating disorder for many years. \n\nI think your intuition is right, just being available and making it clear/known that you are open to talking, listening, etc. Avoid any comments about food, body image, exercise, even if you mean well in that he looks better having gained some weight. \n\nIs his family supportive/involved? Do you know of any big changes in his life that may be triggering relapse? I always struggle more around things like new relationships, school changes, family issues. Any time something major was out of my control I tended to lean on the ED for control.",
          "created_utc": 1579528504.0
        },
        {
          "id": "ff4obly",
          "author": "thinker111111",
          "body": "OP here. I suspect that the stress of going to college next year, moving away from home, making new friends, dealing with impostor syndrome, etc may be part of the trigger. Do you think talking with him about these things would be helpful? Pointing out these observations?",
          "created_utc": 1579568488.0
        }
      ]
    }
  ]
}