{
  "id": "ersky2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1579601113.0,
  "title": "Request: request: vomiting blood",
  "selftext": "I'm 15 and I've recently been purging and everytime bright red blood has been appearing in large quantities.\n\nTo expand I've only talked about my ed with doctors once before when I was 14 and I got no help or support but I feel now its urgent, I've never really been this scared of my ed before and would like some advice. Some of my mutuals have been saying to get help and to stay safe but I dont want to recover I just dont want to die. My parents are very controlling and strict and talk a lot about my weight in a negative way and it pushes me to continue until they care but I really want to have a future and to not suffer anymore but I just dont trust the medical professionals in my country and I'm really scared no one will believe me or be rude about my suffering. I dont think my parents will be able to afford treatment because of recent changes to the NHS. \n\nTLDR: should I tell doctors I've been purging and never recovered from my previous attempt at recovery and it's now resulting in vomiting blood.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ersky2/request_request_vomiting_blood/",
  "score": 36,
  "num_comments": 14,
  "comments": [
    {
      "id": "ff5nvgl",
      "author": "atheista",
      "body": "You should see a doctor immediately and as hard is it may be you should be 100% honest with them.  Purging can be incredibly dangerous and the blood is a sign that you have already done some potentially very serious damage.  Please do everything you can to avoid purging (I know that's easier said than done), you never know if your next purge will be the one that will lead to a full oesophageal rupture.",
      "created_utc": 1579602358.0,
      "score": 55,
      "context": []
    },
    {
      "id": "ff5nvml",
      "author": "ImSoConFuZEdeDed",
      "body": "Yes tell your doctor everything and be honest about it.",
      "created_utc": 1579602365.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ff5ylz4",
      "author": "bearalpha-",
      "body": "Blood in vomit is a very serious sign, please go to a doctor as soon as possible!",
      "created_utc": 1579614441.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ff6nz3k",
      "author": "nodaybuttoday__",
      "body": "Yes. This is probably the result of esophageal tearing and requires immediate medical attention from a qualified doctor.",
      "created_utc": 1579631251.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ff6l1nk",
      "author": "jjjezebel-69",
      "body": "as everyone else is saying: yes please tell your doctor :( I hope everything is okay and things get better for you. I know how hard it can be",
      "created_utc": 1579629471.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ff6yfs6",
      "author": "tiredgecco",
      "body": "You definitely should tell a doctor. Bright red blood is “new” and usually when you purge it it means that you have sores and wounds in your throat. It’s not that dangerous until they get infected and if you purge often that’s more and more likely to happen. Vomiting dark blood means immediately go to a doctor because you might have a big internal bleeding because tge dark color means that it is a bit “older” and the bleeding is more likely to be a bit “deeper” in your digestive system. BUT vomiting blood is NEVER normal. Please talk to professional and stay safe!",
      "created_utc": 1579637465.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ff70ezj",
      "author": "None",
      "body": "It is possible that you tore your esophagus, or ruptured an organ. These are just worse case scenarios; they scare my so much, and are big reasons I am striving my personal recovery. Please PLEASE seek care immediately, this is relatively urgent.",
      "created_utc": 1579638621.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ff733cs",
      "author": "mourningxdove",
      "body": "As somebody who use to be bulimic, please go get help!! It's a serious sign if you are vomiting up blood. Your gp can refer you to cahms, you do need to go to speak to someone. Please don't let this spiral anymore. Thinking of you and wishing you all the best ♥️",
      "created_utc": 1579640150.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ff841qz",
      "author": "He_who_humps",
      "body": "Purging is as addictive as any drug.  Purging depletes you of potassium and electrolytes which can cause cardiac arrest.  Seek help and don’t stop seeking until you get it.  I almost lost my child because of it.",
      "created_utc": 1579665422.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ff8n9h2",
      "author": "RayRay_Hessel",
      "body": "Purging can lead to a ruptured esophagus. See ur doctor immediately. I don't mean to scare u but this could be serious. Please see a doctor or go to er.\n\nAnd tell ur parents their mental abuse has led to this.",
      "created_utc": 1579687067.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ffh2cga",
      "author": "gnataral",
      "body": "See a doctor immediately",
      "created_utc": 1579921228.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff63zuv",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1579618562.0,
      "score": -35,
      "context": []
    },
    {
      "id": "ff6ken8",
      "author": "h123m00",
      "body": "That’s kinda inconsiderate to say to someone who’s clearly struggling...",
      "created_utc": 1579629084.0,
      "score": 12,
      "context": [
        {
          "id": "ff63zuv",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1579618562.0
        }
      ]
    },
    {
      "id": "ff72uua",
      "author": "mourningxdove",
      "body": "Get out of here",
      "created_utc": 1579640015.0,
      "score": 7,
      "context": [
        {
          "id": "ff63zuv",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1579618562.0
        }
      ]
    },
    {
      "id": "ff7sz2l",
      "author": "lciddi",
      "body": "because they have an ED. get with the program.",
      "created_utc": 1579657613.0,
      "score": 2,
      "context": [
        {
          "id": "ff63zuv",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1579618562.0
        }
      ]
    }
  ]
}