{
  "id": "esa977",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1579689982.0,
  "title": "Request: Realized how wrong I was about my weight",
  "selftext": " So, I was very underweight a while ago. Before today, the last time I weighed myself was threeish? months ago. I had barely entered a healthy BMI. I assumed a general linear trend upwards, so I thought I was probably 10 - 15 pounds above that weight by now, having followed semi-normalish? by my previous standards eating habits. I couldn't resist any more. It was calling to me. I stepped on the scale. My weight actually didn't change at all. And I realized how incredibly fucked up my estimations were. Like, I was genuinely terrified that I weighed 20 pounds more than this. (Which would have still been perfectly fine, but that's a whole 'nother issue.) Eating disorder brain couldn't see the difference in 20 pounds. I don't know what my point was, or if I even ever had a point. I guess just don't listen to that little voice - it's a fucking liar. \n\nDoes anyone have advice for me?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/esa977/request_realized_how_wrong_i_was_about_my_weight/",
  "score": 40,
  "num_comments": 6,
  "comments": [
    {
      "id": "ff9gecz",
      "author": "rumbusiness",
      "body": "I can't deal with not weighing myself for this reason. I used to ruin holidays by getting more and more anxious about my weight with every passing day and I'd end up having to go into pharmacies to use their scales, in public. \n\nThank fuck I found some portable travel scales online which now travel everywhere with me and save me from the immense, ratcheting anxiety.",
      "created_utc": 1579712451.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ff90sg4",
      "author": "None",
      "body": "Getting to your body's natural weight is an incredible and gratifying experience.\n\nIn 10 months gained 42lbs and returned to my pre-ED weight; but you know what happened once I got there? I stayed there (give or take a few fluctuations depending on hydration).\n\nYou begin to realise that gaining weight isn't such a huge deal. Your body works properly, you have energy, you can eat without caring that much, you can laugh with friends, you can exercise freely. It's life changing and liberating, and at the other end you realise it wasn't *that* awful.",
      "created_utc": 1579701950.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ffaj5ne",
      "author": "None",
      "body": "That happens to me a lot. My lowest and highest weight as an adult were only about 20-25 lbs apart and I literally could not tell the difference. I would be convinced I gained a ton of weight, or lost a ton, and step on the scale to see no change.\n\nI stopped weighing myself completely. I've got enough clothes now that I know become tight or loose on me when I'm at different weights, so I figure I'll notice the change in fit if my weight changes a huge amount. Otherwise, it's not worth knowing.",
      "created_utc": 1579737019.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ff9n0kx",
      "author": "dicklessfifties",
      "body": "This happens to me all the time. I feel like utter shit about myself and am CERTAIN I have gained and more often then not, I’ve actually lost. And then all of a sudden I feel proud? When two seconds ago I was ashamed. It’s all linked to (at least for me) my brain coping with its need for acceptance. If I don’t feel accepted it must be because I don’t look good enough or I weigh too much so that’s what I perceive in the mirror. My perception of my own weight will never be accurate and I’ve learned to just not shame myself no matter what I see. It’s the only way to stay away from that damn scale.",
      "created_utc": 1579716406.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ff8xbkz",
      "author": "SecretIdentity8594",
      "body": "I found out I’m wrong with mine too, I’m higher than I thought. It’s HORRIBLE. Everything I’ve done to lose it hasn’t even worked properly! I think I actually lost more just by eating healthily and normally.",
      "created_utc": 1579699127.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fffg0ey",
      "author": "None",
      "body": "This happened with me. I went to IFT at UCSD and they gave us a meal plan to implement. When I ate the 3 meals with two snacks like the recommended, I found I could portion better because I wasn’t overwhelmed with hunger and the binge prevention was astounding. It truly changed my life. One of the crazy things about your weight is that because we’ve messed up our metabolisms so massively, yes you might initially experience weight gain in recovery but eventually your metabolism will fire up again and even out. Our bodies are amazing!",
      "created_utc": 1579883150.0,
      "score": 2,
      "context": [
        {
          "id": "ff8xbkz",
          "author": "SecretIdentity8594",
          "body": "I found out I’m wrong with mine too, I’m higher than I thought. It’s HORRIBLE. Everything I’ve done to lose it hasn’t even worked properly! I think I actually lost more just by eating healthily and normally.",
          "created_utc": 1579699127.0
        }
      ]
    }
  ]
}