{
  "id": "eskx8y",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1579738892.0,
  "title": "Request: New doctor thinks I have Anorexia but I don't think I do",
  "selftext": "I'm a 23 year old guy and my new doctor seems to think that I have anorexia but I don't think I do. I just don't think it fits, and to be honest I don't want that stigma attached to me. \n\nI'm 5'11 and quite underweight for my height. \nMy previous doctor never mentioned anything about any kind of eating disorder. He just told me to eat more and didn't make a big deal out of my weight loss. I went to this new doctor because I was worried about hair loss and feeling tired and dizzy all the time. I'm aware my weight may have something to do with that but I thought it might be something else as well because I'm not that underweight and it started getting worse recently.\n\nI admit I have issues with my body image, however I never intentionally starved myself to become underweight and I don't even want to be skinny, it just happened.\n\nAbout a year ago I was obese, I started a diet and got very obsessed with it and ended up underweight. I am very happy with my weight loss and I look a lot better now, but I would like to be more muscular. I have been underweight for several months now and I'm used to it and afraid of eating more.\n\nI am very careful and controlled with what I eat and I calorie count, however I do NOT starve myself. I eat a healthy vegan diet, just enough to maintain my weight. While I was losing the weight, I ate very little. I have no desire to become thinner now, but I am very afraid of gaining the weight back, which is why I became underweight and why I haven't made any genuine effort to start gaining again. \n\nThe one thing that the doctor really latched on to was the fact that i take appetite suppressants, I only take them because I took them throughout my weight loss, and I know binging often follows restriction and I don't want to binge and gain all the weight back. \n\nIs this anorexia?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/eskx8y/request_new_doctor_thinks_i_have_anorexia_but_i/",
  "score": 51,
  "num_comments": 25,
  "comments": [
    {
      "id": "ffalzkh",
      "author": "slimdog_millionaire",
      "body": "Yeah, sounds like anorexia. No two people’s EDs are exactly alike. You should seek recovery and healthy weight gain, especially if you want to put on muscle.",
      "created_utc": 1579739074.0,
      "score": 78,
      "context": []
    },
    {
      "id": "ffameez",
      "author": "I-really-need-a-life",
      "body": "yeah honestly, sounds like anorexia- i’d say go get the help & talk to a therapist. a lot of people with EDs tell convince themselves “oh i’m not that sick”, or “no no i don’t have an ED, i just do xyz”, or “i’m not AS bad as other people”, but at the end of the day, it’s a disorder and you need help 🤷‍♀️",
      "created_utc": 1579739352.0,
      "score": 52,
      "context": []
    },
    {
      "id": "ffaswg4",
      "author": "jars-of-stars",
      "body": "I think you definitely are suffering from anorexia and likely the reason this is hard for you to accept is the stigma you’ve attached to it. I find it disappointing that mental health issues are seen this way in our society, but maybe you can agree with me that this should change. There’s no reason why eating disorders should be shameful or stigmatized, and reversing that stigma starts with the individuals who are affected.\n\nYour life is very clearly being negatively impacted by anorexia, but I’ve struggled with the same issues of acceptance that you have and I know what it’s like to be in disbelief at a diagnosis. I never starved myself completely, or went days without eating the way I thought “real” anorexics did. However your body needs a lot of calories. For me (a 5’3 teenage girl), my daily caloric needs are like 2500, but for you they’d probably be close to 3000. This means that eating around 1000-1500 can be considered severe undereating for you, which is equivalent to starving yourself in terms of health risks. You said that you’re underweight, you’re eating a low amount, and you’re scared to eat more, and these are very clear diagnostic criteria for anorexia, so I think your doctor is right. \n\nI urge you to reverse your thinking and accept the diagnosis and suggestions your doctor has given you. It might be helpful for you to find a nutritionist you could meet with who has experience with eating disorders. They can help you develop a meal plan that will prevent the developing of binge eating while returning you to normal eating habits. Reaching out can be scary, but the end result is so worth it. Good luck <3",
      "created_utc": 1579743727.0,
      "score": 32,
      "context": []
    },
    {
      "id": "ffauvbv",
      "author": "He_who_humps",
      "body": "Anorexia is a very misunderstood condition.  What you are saying is concerning enough to me to warrant investigation.  Male anorexia is even less understood than female.  You might be surprised to learn that the mechanisms at play can be so much more complicated than the cliche  of “fear of being fat”.  Sometimes anorexia is an addiction.  The achievement of weight loss can feel empowering.  Some people continue to chase that feeling. Nobody is better at resisting hunger than you. That’s something you might feel proud of.  Read “Brave Girl Eating.”",
      "created_utc": 1579745031.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ffax2x2",
      "author": "Echeveria1987",
      "body": "Research and data is showing eating disorders are closely related to anxiety and OCD-like conditions. In other words it’s much more than a desire to be thin, but rather a way to exact control when other things in your life are out of your control. I know labels suck and you don’t want to be told something is wrong, and yet you also seem concerned about your current physical state. You are taking appetite suppressants not to lose weight, but in fear your eating will increase if you don’t? You say you eat enough to maintain your weight, yet you also say you’ve lost weight unintentionally? If you are having hair loss I’m going out on a limb to guess you also are having fatigue and maybe some skin issues? Joint pain? And again, just guessing... but you probably want these physical problems to go away... as long as you don’t have to eat more or gain any weight? Trust me I was mad at everyone for telling me “to just eat more” because that was frankly just the tip of the iceberg of the hell I was going through. It took me a long time to realize it however maybe your doctor wasn’t judging you and just wants to help you get happy and healthy.",
      "created_utc": 1579746497.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ffax2ld",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1579746491.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ffax2ki",
      "author": "nodaybuttoday__",
      "body": "Jumping from one eating disorder to another is an illness. This sounds more like denial than anything. Saying you have body image issues and were obsessed with weight loss is a red flag that signals you have at the very least subclinical symptoms of ED. It doesn’t have to be anorexia, but I’d say it’s close. If you experience the symptoms of several disorders, could be OSFED. I’m not a doctor, but I’ve experienced this. You ought to listen closely and get help.",
      "created_utc": 1579746491.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ffb45kp",
      "author": "stpfah",
      "body": "**questions you could ask yourself**\n\nHow often do you think about food, eating, weight, appearance, restriction (that includes eating \"just enough to...\")?  How often is it somewhere in the back of your mind? How often do you worry you've eaten too much or stop yourself before you do? Is it ever uncomfortable sharing meals with others? What would it mean if your doctor was right about the diagnosis?... If he were wrong?\n\nLike others have said, no one's eating disorder is like another's. And often people with ED will experience different forms over the years.  In my case I've struggled with two distinct EDs at different periods in my life.",
      "created_utc": 1579751316.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ffb75vu",
      "author": "None",
      "body": "Well anorexia is the loss of appetite, anorexia nervosa is the mental aspect actively wanting to lose weight, negative thoughts etc. Listen to your doctor  hes right.  you may be in denial maybe not but just be careful",
      "created_utc": 1579753626.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ffbizdf",
      "author": "Ranjeliq",
      "body": "It was all good until \n\n>afraid of eating more\n\n>i take appetite suppressants\n\nand then \n\n>worried about hair loss and feeling tired and dizzy all the time\n\nYes, it sounds very much like anorexia.\n\nDon't be afraid to add a little bit more food to your diet, I don't know your current weight/caloric intake, and I'm not a doctor, so I won't recommend any numbers, but from your description - you need it.\n\nFirst of all, extra bit of calories (of course, not unlimited amount) won't make you obese again. Probably, you will just reach healthy weight, your situation with dizziness and tiredness will improve a bit, your hair will start growing back.\n\nSecond, if you want to be muscular, you need to workout and eat at a surplus, otherwise you'll see little to no progress.\n\nI understand your concern about the symptoms, and I know that sometimes doctors tend to blame all the problems on the weight of the patient, but you do have an issue. Even if your symptoms are not related to your weight (which I doubt), it's better to not make it worse by ignoring it.\n\nTry to gradually improve your diet and ditch appetite suppressants and then see if your conditions will improve.\n\n>I don't want that stigma attached to me\n\nYou don't need to tell that you are/were anorexic (besides the doctors, of course). No one should stick their noses into your life without your approval. No one should blame you for your illness. Would you blame someone with a cold?\n\nTry to reach psychologist/psychiatrist with your concerns. Don't be afraid of the stigma. I know, I was, and I regret it now because I could feel so much better and not be miserable for so long. I willingly told many of my close friends and my family that I was diagnosed - and none of them bat an eye.",
      "created_utc": 1579767516.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ffbkbwc",
      "author": "Blue18Heron",
      "body": "Bells and whistles going off with just about every sentence you wrote!  Please consider professional help.",
      "created_utc": 1579769408.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ffcek6c",
      "author": "ilivetomosh",
      "body": "I had an eating disorder develop around 9 yo before I even knew what an eating disorder was. It's not always intentional. You don't choose a disorder. They just develop sometimes.",
      "created_utc": 1579797769.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ffbpcue",
      "author": "lwaikart",
      "body": "A few of the things you said definitely stand out as likely anorexia: \"afraid of eating more\", \"Careful and controlled with what I eat\", \"afraid of gaining weight\". Anorexia isn't exclusively starving yourself, it's controlling what you eat to the extent that there are physical consequences. You're experiencing hair loss, feeling tired and dizzy and yet you don't want to change you're current eating structure. That's concerning. If you still question it, seek out an assessment from someone who is trained in EDs. They'll be able to give you a better idea of how severe the ED is, if it is there and recommend treatment options. Good luck!",
      "created_utc": 1579777016.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ffbx2n4",
      "author": "hannu30",
      "body": "This is anorexia yes, but you seem to be in quite an early stage, I would try to accept the fact that you have it now and start working on it without much delay.\n\nPlease start by stopping to take appetite suppressants and then listen to your body in a natural way by eating when you are hungry. You can continue with counting calories, eating vegan, etc. There is nothing wrong with that.\n\nYou say you aren't starving yourself, but why take appetite suppresants then? You are forcing your body to not feel hungry when it may just be.\n\nYou are counting your calories, so just continue with that for now and see where this gets you without the suppressants. Going 200 calories over your normal limit twice or thrice a week will not get you back to your old weight and isn't bingeing, and maybe you body just needs more then you are taking in at the moment, listen to it.",
      "created_utc": 1579785579.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ffcshwa",
      "author": "not_cinderella",
      "body": "I’m curious as to why you eat a vegan diet. Veganism certainly is not an ED in itself but sometimes people go vegan unconsciously to mask an ED.",
      "created_utc": 1579806351.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ffbgxm3",
      "author": "CinnamonShipper",
      "body": "Orthorexia?",
      "created_utc": 1579764802.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ffcgkd6",
      "author": "throwawaywywywywh",
      "body": "you definitely have an eating disorder. anorexia doesn't look the same for everyone: it's not just a teen girl trying to fit in, it can happen to people of all races, ages and to men or women.\n\nhow often do you think about food? how often are you afraid about consuming certain foods? do you have foods that are off limits or unsafe? do you percieve yourself as heavier than you are despite being clinically underweight? a lot of people chose to become vegan to more easily disguise their eating disorder, and to turn down more foods socially. \n\nget an eval done with a psychiatrist, start seeing a therapist. men can have eating disorders.",
      "created_utc": 1579798997.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ffd1odn",
      "author": "Simplicityobsessed",
      "body": "That was what my anorexia looked like - I started over weight, ended up underweight, and had a hard time gaining it back because I was anxious about my weight sky rocketing back up. It may not always be the most intentional thing, but you may be struggling with an ED - it definitely sounds like the doctor was onto something.",
      "created_utc": 1579811664.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ffd5cta",
      "author": "Kandrew2012",
      "body": "Male with anorexia here...sounds a lot like anorexia. I would def say to explore that a bit with your doctors to get a better understanding. I didn’t think I was anorexic for 2 years before getting it.",
      "created_utc": 1579813733.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ffb71n6",
      "author": "_shadesofcool_",
      "body": "that’s textbook anorexia",
      "created_utc": 1579753524.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ffdesll",
      "author": "Menapocalypse1",
      "body": "Watch 9 year nightmare on YouTube about a male anorexic ..spoiler .. he died.. but you don’t have to. Our lifespan is short enough as it is.",
      "created_utc": 1579819361.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ffdnue5",
      "author": "Ahunteman",
      "body": "Yes, this is anorexia.",
      "created_utc": 1579824849.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ffekcdu",
      "author": "Echeveria1987",
      "body": "Dude, it’s clear there’s a problem that needs behavioral changes and mental health help. And I get it labels suck. And I’m not a guy, but I’ve often heard that addressing eating disorders is even harder for men because of the stigma attached. But it doesn’t matter what you call it, heck, you can just pick something to call it. Say you’ve got a bad case of being haunted by a judge mental ghost named Sebastian if that’s easier to process in the beginning. As long as you start being honest with yourself and start on baby steps to help yourself feel better physically and emotionally, that’s all that matters",
      "created_utc": 1579851632.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ffg6z04",
      "author": "Lindsey7618",
      "body": "I second seeing a nutritionist but make sure it's one who is qualified to treat eating disorders! I'd also suggest a therapist (one who is knowledgeable about eating disorders) because they can help you work through not only your body image issues but your confusion about anorexia and they can give you an honest profile answer. You should see a psychiatrist who can confirm your diagnosis or not.",
      "created_utc": 1579899796.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ffdqafe",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1579826374.0,
      "score": 1,
      "context": [
        {
          "id": "ffaswg4",
          "author": "jars-of-stars",
          "body": "I think you definitely are suffering from anorexia and likely the reason this is hard for you to accept is the stigma you’ve attached to it. I find it disappointing that mental health issues are seen this way in our society, but maybe you can agree with me that this should change. There’s no reason why eating disorders should be shameful or stigmatized, and reversing that stigma starts with the individuals who are affected.\n\nYour life is very clearly being negatively impacted by anorexia, but I’ve struggled with the same issues of acceptance that you have and I know what it’s like to be in disbelief at a diagnosis. I never starved myself completely, or went days without eating the way I thought “real” anorexics did. However your body needs a lot of calories. For me (a 5’3 teenage girl), my daily caloric needs are like 2500, but for you they’d probably be close to 3000. This means that eating around 1000-1500 can be considered severe undereating for you, which is equivalent to starving yourself in terms of health risks. You said that you’re underweight, you’re eating a low amount, and you’re scared to eat more, and these are very clear diagnostic criteria for anorexia, so I think your doctor is right. \n\nI urge you to reverse your thinking and accept the diagnosis and suggestions your doctor has given you. It might be helpful for you to find a nutritionist you could meet with who has experience with eating disorders. They can help you develop a meal plan that will prevent the developing of binge eating while returning you to normal eating habits. Reaching out can be scary, but the end result is so worth it. Good luck <3",
          "created_utc": 1579743727.0
        }
      ]
    },
    {
      "id": "ffg75fx",
      "author": "Lindsey7618",
      "body": "Also, orthodox is also a thing. Not sure if that applies to you but would be worth looking into if you're very obsessive about \"clean\" eating and don't like junk food.",
      "created_utc": 1579899906.0,
      "score": 1,
      "context": [
        {
          "id": "ffg6z04",
          "author": "Lindsey7618",
          "body": "I second seeing a nutritionist but make sure it's one who is qualified to treat eating disorders! I'd also suggest a therapist (one who is knowledgeable about eating disorders) because they can help you work through not only your body image issues but your confusion about anorexia and they can give you an honest profile answer. You should see a psychiatrist who can confirm your diagnosis or not.",
          "created_utc": 1579899796.0
        }
      ]
    },
    {
      "id": "fh940uw",
      "author": "CluelessCat",
      "body": "Gaining muscle = gaining weight\nThe number on the scale is a misleading measure of your body.",
      "created_utc": 1581373022.0,
      "score": 1,
      "context": [
        {
          "id": "ffaswg4",
          "author": "jars-of-stars",
          "body": "I think you definitely are suffering from anorexia and likely the reason this is hard for you to accept is the stigma you’ve attached to it. I find it disappointing that mental health issues are seen this way in our society, but maybe you can agree with me that this should change. There’s no reason why eating disorders should be shameful or stigmatized, and reversing that stigma starts with the individuals who are affected.\n\nYour life is very clearly being negatively impacted by anorexia, but I’ve struggled with the same issues of acceptance that you have and I know what it’s like to be in disbelief at a diagnosis. I never starved myself completely, or went days without eating the way I thought “real” anorexics did. However your body needs a lot of calories. For me (a 5’3 teenage girl), my daily caloric needs are like 2500, but for you they’d probably be close to 3000. This means that eating around 1000-1500 can be considered severe undereating for you, which is equivalent to starving yourself in terms of health risks. You said that you’re underweight, you’re eating a low amount, and you’re scared to eat more, and these are very clear diagnostic criteria for anorexia, so I think your doctor is right. \n\nI urge you to reverse your thinking and accept the diagnosis and suggestions your doctor has given you. It might be helpful for you to find a nutritionist you could meet with who has experience with eating disorders. They can help you develop a meal plan that will prevent the developing of binge eating while returning you to normal eating habits. Reaching out can be scary, but the end result is so worth it. Good luck <3",
          "created_utc": 1579743727.0
        },
        {
          "id": "ffdqafe",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1579826374.0
        }
      ]
    }
  ]
}