{
  "id": "etidvz",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1579907811.0,
  "title": "Request: \"wanting\" to relapse....?",
  "selftext": "Hey everyone, just a bit of my background: recovered anorexic for about 5 years, was hospitalized for it for 2 months. Never had a relapse, except a close call last year in early spring - and the same thing is happening again. Both times have started with me wanting to get healthier for the new year. Since my brain has always been super black and white about everything, it's basically been all or nothing with being 'healthy'. I know how to moderate my disordered thoughts and counteract them etc., because I've dealt with this a longggg time even before I was diagnosed 5 years ago, but for some reason I have just been letting the thoughts take control. It's almost like I want them to have that control again even though I know the repercussions. This all happened last year too, and I got out of it before I really relapsed, but this time it feels more persistent. I just want to know if anyone else feels/has felt this way??? It's really conflicting and I feel like I should be able to make it stop but in a weird way I don't want it to and I've just been letting it happen. I know this is weird and doesn't really make any sense but I would really like some advice!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/etidvz/request_wanting_to_relapse/",
  "score": 39,
  "num_comments": 9,
  "comments": [
    {
      "id": "ffh5twl",
      "author": "Winterobin",
      "body": "I feeeeeel exactly the same way. I feel like I could’ve written this exact post",
      "created_utc": 1579923927.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ffhtffw",
      "author": "stpfah",
      "body": "I've experienced multiple relapses and it always starts with a lot of obsessive thinking.  It's still very easy for me to go back into ED fantasy. It does a really good job of distracting me from what I don't want to think about. There are several drawbacks: believing the bs, not taking care of the real issues I'm trying to avoid, and relapse.\n\nOne thing I hope to always remember and that has saved me more than once is this: Just because I think it doesn't mean I have to do it.  I can't control my thinking but I can decide how I'm going to respond to the thinking.\n\nI commend you and have all of this hope for you as you have exposed your ED thinking here. As others have suggested, the next best thing is to seek therapy.  \n\nGood luck and best wishes to you.",
      "created_utc": 1579952996.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ffhjxyx",
      "author": "Annawillexit",
      "body": "Yes, and it’s exactly moment you need to wait/ fight for you, - the feeling will go away and you will be secured from relapse...! Otherwise same story... I went through that... just think if you relapse all will be back again, all the pain, irritation. Wanting to relapse means you want it back ... and what next? Miserable life... try to associate relapse with physical pain in you body, that will help! Goooood luck!",
      "created_utc": 1579938699.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ffia1e2",
      "author": "None",
      "body": "I remember in treatment some of the older women got so mad when they found out there is no cure and it's a fight every day of our lives. I'm going on 8 years with an ed and its frustrating as hell.\nThe only things that can stop those persistent thoughts is a hobby. I know that sounds lame and we hear it all the time but a BUSY hobby where your mind wont bother you constantly. I found gardening and videogames to be a good outlet for me.  Best wishes xoxo",
      "created_utc": 1579968908.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ffgupdk",
      "author": "Thekisk",
      "body": "I’m in treatment right now and I feel that way sometimes. It’s hard to fight but it’s what’s best for you. \n\nA want to relapse is a sign that your eating disorder voice is getting louder. As you know from experience of being hospitalised, when it completely controls you, you have no ability to choose things for yourself. I would say take this time now to weaken that ED voice by either seeing a therapist who’s more specialised in eating disorders, and/or apply for a low level treatment program to prevent you from completely succumbing to your ED. \n\nTreat yourself as though you are someone you care about (what would you say if a friend or family member said the same thing to you?)\n\nBest of luck!",
      "created_utc": 1579915536.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ffs44vp",
      "author": "sweet1teenage",
      "body": "I personally get those thoughts when something in my life isn’t going right. Because when everything else is bad, and out of my control (somewhat), I can take control of my weight and make myself feel better. That is not the solution, of course. It’s just easy for the brain to slip into old bad ways of coping with negative stuff going on in our lives.",
      "created_utc": 1580172668.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ffhho38",
      "author": "deneezu",
      "body": "I agree with this! Now is the time to fight harder than ever. You can do it ❤️",
      "created_utc": 1579935680.0,
      "score": 3,
      "context": [
        {
          "id": "ffgupdk",
          "author": "Thekisk",
          "body": "I’m in treatment right now and I feel that way sometimes. It’s hard to fight but it’s what’s best for you. \n\nA want to relapse is a sign that your eating disorder voice is getting louder. As you know from experience of being hospitalised, when it completely controls you, you have no ability to choose things for yourself. I would say take this time now to weaken that ED voice by either seeing a therapist who’s more specialised in eating disorders, and/or apply for a low level treatment program to prevent you from completely succumbing to your ED. \n\nTreat yourself as though you are someone you care about (what would you say if a friend or family member said the same thing to you?)\n\nBest of luck!",
          "created_utc": 1579915536.0
        }
      ]
    },
    {
      "id": "ffi5qwl",
      "author": "houston_veronica",
      "body": "YES - tackle and kill that ED now -- break up with it for good and know that we are all behind you. I get what you are going through, and it is the toughest thing I've ever endured, but You. Will. Overcome!",
      "created_utc": 1579965808.0,
      "score": 3,
      "context": [
        {
          "id": "ffgupdk",
          "author": "Thekisk",
          "body": "I’m in treatment right now and I feel that way sometimes. It’s hard to fight but it’s what’s best for you. \n\nA want to relapse is a sign that your eating disorder voice is getting louder. As you know from experience of being hospitalised, when it completely controls you, you have no ability to choose things for yourself. I would say take this time now to weaken that ED voice by either seeing a therapist who’s more specialised in eating disorders, and/or apply for a low level treatment program to prevent you from completely succumbing to your ED. \n\nTreat yourself as though you are someone you care about (what would you say if a friend or family member said the same thing to you?)\n\nBest of luck!",
          "created_utc": 1579915536.0
        },
        {
          "id": "ffhho38",
          "author": "deneezu",
          "body": "I agree with this! Now is the time to fight harder than ever. You can do it ❤️",
          "created_utc": 1579935680.0
        }
      ]
    }
  ]
}