{
  "id": "ew5yym",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1580393378.0,
  "title": "Request: I knew the scale would be a bad idea",
  "selftext": "My boyfriend just bought a scale for our apartment. I’ve been in recovery for such a long time, and I go to my second therapist appointment on Valentine’s Day. He said that he bought the scale for working out, and he’s not trying to lose weight. He knows I have a history of ED. I told him last night that I wasn’t comfortable with the scale, and that it makes me nervous. And he was like “well you can either ignore it, or you can address the problem.” That kinda hurt me a lot. I’ve been avoiding buying a scale for the apartment. Because I know that I’ll just excessively weigh myself. And that’s what I’ve been doing. It’s like every time I step on I get a different number. And if I don’t like the number I panic. I want to lose weight but I don’t want to do it in an unhealthy way. But we’re also living on our own so like healthy food and drinks are really expensive right now. I need help. I know every single tome I’m going to go into that bathroom I’m going to weigh myself. No normal person does this.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ew5yym/request_i_knew_the_scale_would_be_a_bad_idea/",
  "score": 52,
  "num_comments": 9,
  "comments": [
    {
      "id": "ffzvsro",
      "author": "Chronicallyoddsgirl",
      "body": "Does the scale have to live out in the bathroom? Can he tuck it in his sock drawer or whatever and take it out to weigh himself periodically so it's not in the bathroom/in sight?",
      "created_utc": 1580394201.0,
      "score": 50,
      "context": []
    },
    {
      "id": "ffzydgm",
      "author": "None",
      "body": "I'm sorry that you're struggling with this and that your boyfriend is not being as supportive as he could/should be. You are definitely not alone. Until my husband hid the scale I was weighing myself up to 12 times per day. When my therapist suggested that he put it up, I panicked, but after some adjustment, I recognize that it has been a great thing for me. I think asking that he keep the scale out of sight is a reasonable request. In the end, keeping it around and in sight could be detrimental to your health and wellness, and this is something that I think he should be willing to compromise on.",
      "created_utc": 1580396028.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ffzzgad",
      "author": "mud_octopus",
      "body": "Does he go to the gym? Why can't he just weigh himself at the gym?",
      "created_utc": 1580396764.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fg24rvw",
      "author": "He_who_humps",
      "body": "Would you smoke sitting next to a person with lung cancer?  No.  That is what he is doing to you, though he may be ignorant of it, because he doesn’t believe that Ed is a disease that kills and ruins lives.  If it takes having a doctor tell him, then seek out an ED doc online and ask them to confirm, via email,  how important not having scales around is to your recovery.  You are a normal person with a serious disease.  Your partner needs to understand that.",
      "created_utc": 1580438194.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fg336rl",
      "author": "covhr",
      "body": "my ex wanted a scale in the house, and even hid it purportedly where I couldn't find it. Of COURSE I found it. In the end, with the help of a therapist, I insisted the scale had to leave the house.",
      "created_utc": 1580468262.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fg72op5",
      "author": "None",
      "body": "\"Address the problem\" what the fresh hell is that? Toss it. And toss the man out while you're at it. He doesn't seem to care about your recovery at all.",
      "created_utc": 1580582582.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fg2payf",
      "author": "cheesylikecheddar",
      "body": "I'd even have him hide it in a location only he knows about. Would be less tempting to weigh yourself if you didn't even know where to find it.\n\nMy mom had to do that with our scale for awhile. I won't lie: I got snoopy at first, but then after awhile I simply gave up. I found it helped a lot in the long run",
      "created_utc": 1580450699.0,
      "score": 3,
      "context": [
        {
          "id": "ffzvsro",
          "author": "Chronicallyoddsgirl",
          "body": "Does the scale have to live out in the bathroom? Can he tuck it in his sock drawer or whatever and take it out to weigh himself periodically so it's not in the bathroom/in sight?",
          "created_utc": 1580394201.0
        }
      ]
    },
    {
      "id": "fg02l3p",
      "author": "None",
      "body": "My gym doesn't have a scale, it depends on where you go I guess.",
      "created_utc": 1580398821.0,
      "score": 5,
      "context": [
        {
          "id": "ffzzgad",
          "author": "mud_octopus",
          "body": "Does he go to the gym? Why can't he just weigh himself at the gym?",
          "created_utc": 1580396764.0
        }
      ]
    },
    {
      "id": "fg0db9m",
      "author": "rampantfreak",
      "body": "Yeah, I would stick it in his gym bag and tell him to just use it there. SO should consider your feelings, but sometimes they just don't get it and you really have to spell it out. You ARE addressing the problem, so he needs to be careful not the become a part of the problem.",
      "created_utc": 1580405394.0,
      "score": 4,
      "context": [
        {
          "id": "ffzzgad",
          "author": "mud_octopus",
          "body": "Does he go to the gym? Why can't he just weigh himself at the gym?",
          "created_utc": 1580396764.0
        },
        {
          "id": "fg02l3p",
          "author": "None",
          "body": "My gym doesn't have a scale, it depends on where you go I guess.",
          "created_utc": 1580398821.0
        }
      ]
    }
  ]
}