{
  "id": "exc7dt",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1580589416.0,
  "title": "Request: Dealing with triggers",
  "selftext": "Quick summary of my current situation: I’m currently about 1-1.5ish years into recovery, so while i’m not fully recovered by any stretch of the meaning, i’m still pretty stable. My family is pretty cool, and my friends are amazing !!\n\nWhat sucks is how they all seem to somewhat normalize ED behaviours. I’ve talked to them about my ED and my triggers, but quite honestly they’re kinda clueless about what fits as a trigger, if that makes sense.\n\nOne of the things I’m really struggling with is how they all seem to engage in / talk about ED behaviours as if it’s normal. They’ll casually comment on how they skipped a meal, or how one time they went XYZ long without food, or how they’re gonna do ABC to compensate.\n\nIn my head, I guess I’m having trouble because it’s like, if everyone’s doing it, why can’t I? If this is normal, why can’t I join in with them. I know it’s not normal, but especially when people say things like “oh everyone has had sOme ED in their lifetime”, it feels really invalidating and makes me want to relapse.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/exc7dt/request_dealing_with_triggers/",
  "score": 47,
  "num_comments": 10,
  "comments": [
    {
      "id": "fg7n3rx",
      "author": "None",
      "body": "I just wanted to say that I totally understand the feeling--I'm in the same boat. It really gives me imposter syndrome, you know? Like if so many people are doing these things maybe there is nothing wrong with me. It makes me feel like I'm jut being dramatic in how much these behaviors effect me.",
      "created_utc": 1580596536.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fg8c50u",
      "author": "dicklessfifties",
      "body": " Diet culture is so fucking ingrained into our society, the only way I can Keep my ED thoughts at bay is to *get angry* \n\nAsk why the fuck you have to do sit-ups to enjoy a cookie\nAsk your loved ones WHY they hate their bodies \nThey didn’t hate it until somebody told them to hate it \nThe only way for me personally to keep from relapsing is scream fuck diet culture and all the dickheads to profit from it at least,, 5times a week.",
      "created_utc": 1580615216.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fg85290",
      "author": "denababy",
      "body": "Diet culture is second nature to so many people. They don’t even realize it anymore. And I think for some people it’s as commonplace to bring up as the weather, especially if you’re spending time together or doing things around meals or snacks or anything to do with food. \nAnd I understand what you mean.. sometimes it feels inescapable and like it wouldn’t hurt to just give in to some of the “smaller” behaviors or thoughts. But please don’t give up on your progress!",
      "created_utc": 1580609731.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fg81uu9",
      "author": "mylessandovaldpt",
      "body": "I invite you to look deeper at the belief, \"If everyone's doing it, why can't I?\" Everyone's doing all kinds of things, like texting and driving, staying up way too late on a work night, etc., etc. You *could* do any of these things. But do they lead to good outcomes? Are they helpful to your long-term well-being? Do they make you happy? If not, what can you focus on instead, so that you're thinking more about the peace, joy, and FUN of recovery instead of what you might be missing out on?\n\nFor more on the process of re-framing beliefs, check out Chapter 5: building and maintaining motivation for recovery in The FREE Unofficial SMART Recovery Handbook for Disordered Eating: [https://docs.google.com/document/d/1vPk9JbgWrGCL4LbjAmVbVW-g2fD5DFBP\\_P-8ov2F4sY/edit?usp=sharing](https://docs.google.com/document/d/1vPk9JbgWrGCL4LbjAmVbVW-g2fD5DFBP_P-8ov2F4sY/edit?usp=sharing)\n\nI hope you find it helpful. Feel free to share. Full recovery into a joyful life free from ED behaviors *and thoughts* is entirely possible.",
      "created_utc": 1580607283.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fg8bt3f",
      "author": "complexmariner",
      "body": "I completely understand the feeling, my friends know I have an ED and am in recovery but just love to say some triggering things that make me think ED behaviours are normal",
      "created_utc": 1580614952.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fgebdr4",
      "author": "stpfah",
      "body": "That last quote you wrote about is extremely ignorant of your situation. It's like people who say \"I have to keep my shoes organized, I'm so OCD about my shoes.\"\n\nThe fact is, there is a difference between disordered eating and having a diagnosable Eating Disorder.  Diet culture is filled with unhealthy disordered thinking and behaviors. I can't think of one adult family member that has a healthy relationship with food and eating.  The difference is, I have an eating disorder.  What someone who does not have an eating disorder can think about/do once can change.  For me I have to keep thinking and doing until I get help.\n\nA peer in treatment suggested a \"good for you, not for me\" approach to dealing with these situations.",
      "created_utc": 1580695706.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fggp2ur",
      "author": "ajnakeyflows",
      "body": "understanding that unfortunately people who have not dealt with the situation in which you require a more sensitive approach to handling scenarios will not be able to differentiate a trigger to what is their norm. we are all different, our dna make up is different, the way our brains are wired are different. so how someone else handles a situation may not have the result if you do the same exact thing is key here. one day, you will truly overcome the struggle of ED & when you do then you can ask yourself those questions as to “if they can, why can’t i.” but you need to face the reality that until you mentally can handle going up against the grain in that way you may have to separate yourself from those conversations or minimize your presence there. in your time of recovery it’s very crucial to remember the goal, & work solely the accomplish that.",
      "created_utc": 1580766478.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiuljdt",
      "author": "Clairbearski",
      "body": "Chiming in to say thanku for sharing<3 Just hearing (reading) that I’m not the only ‘crazy’ person consumed by these thoughts is honestly beyond validating. My entire family has a history with disordered eating (tho unacknowledged). They tried to sweep my ED under the carpet too— if I had access to this sub (& actual therapy) maybe my ED wouldn’t have consumed a decade of my life.",
      "created_utc": 1582743693.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fg8mqtr",
      "author": "I-really-need-a-life",
      "body": "exactly !!",
      "created_utc": 1580624666.0,
      "score": 2,
      "context": [
        {
          "id": "fg7n3rx",
          "author": "None",
          "body": "I just wanted to say that I totally understand the feeling--I'm in the same boat. It really gives me imposter syndrome, you know? Like if so many people are doing these things maybe there is nothing wrong with me. It makes me feel like I'm jut being dramatic in how much these behaviors effect me.",
          "created_utc": 1580596536.0
        }
      ]
    },
    {
      "id": "fiul68b",
      "author": "Clairbearski",
      "body": "Literally same.\nFinding some serious comfort in this sub, thanku<3",
      "created_utc": 1582743492.0,
      "score": 1,
      "context": [
        {
          "id": "fg8c50u",
          "author": "dicklessfifties",
          "body": " Diet culture is so fucking ingrained into our society, the only way I can Keep my ED thoughts at bay is to *get angry* \n\nAsk why the fuck you have to do sit-ups to enjoy a cookie\nAsk your loved ones WHY they hate their bodies \nThey didn’t hate it until somebody told them to hate it \nThe only way for me personally to keep from relapsing is scream fuck diet culture and all the dickheads to profit from it at least,, 5times a week.",
          "created_utc": 1580615216.0
        }
      ]
    }
  ]
}