{
  "id": "ez7t90",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1580899746.0,
  "title": "Request: Overtraining as an eating disorder",
  "selftext": "I made the realization today that I might be overtraining, and after further research, I found that this is a form of an eating disorder. Diet-wise, I've become increasingly more obsessive with my eating over the past few years. I've tried several different extreme diets, from carnivore to vegan, or even eating only one meal per day. At the same time I've become more obsessed with my workouts- trying new routines, increasing the time in the gym, etc. I found an old reddit post I made (I think it was deleted) in another sub about how I thought I was maybe overtraining, and now realized that the load I was taking on at that time was significantly lower than it is now. Right now, I'm averaging 1.5-2 hours per day six days per week in the gym. Each day, my average number of sets is anywhere from 50-60. \n\nI didn't realize this was an issue until I recently met a girl I actually like, and I've been having sexual issues with her. I'm really just not in the mood and it feels like I'm forcing myself, which is frustrating on its own. This has happened with other girls where I just couldn't get in the mood. Once I started researching what my issue might be, I came across overtraining which opened up a huge can of worms about myself. I realized I had become so obsessed with my appearance that I was making huge sacrifices for my diet and exercise regiment. I was cutting out social time with friends and saying no to plans because I needed to go train. I was hitting literally every single symptom of overtraining I found online, from missing family arrangements to severe anxiety on days I wasn't training, to going as hard as possible every single gym session and feeling some depression if I hadn't left the gym feeling like I got my ass kicked. \n\nI wish I had seen this before, and hopefully I can heal my relationship with food and training. I'm wondering if anyone else has had this before and how it affected their health. The sexual problems really kicked all this off, and it made me realize how much this is affecting both my mental and physical health. I appreciate being able to get this out there and talk about it, since none of my friends really have these issues.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ez7t90/request_overtraining_as_an_eating_disorder/",
  "score": 37,
  "num_comments": 7,
  "comments": [
    {
      "id": "fglm9kx",
      "author": "Fieryirishplease",
      "body": "You may benefit from looking into Orthorexia. It is at an overview characterized as being \"overly healthy\" to an unhealthy point. My father I believe deals with this. The struggle is quite real. Knowing is half the battle here I suppose but most people only know about Anorexia/Bulimia. That does make it difficult for us outliers to understand what is happening.",
      "created_utc": 1580904159.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fglszkt",
      "author": "runhappy18",
      "body": "Hi! I can relate on this on a spiritual level haha I am a cross country athlete washed up college runner and now run long distances road races. I train probably 1.5 hours minimum and not only doing I have AN but I use running to fuel my disorder. It’s very very draining I will choose my workouts over anything pretty much or it makes me late a lot and have anxiety when I can’t do a workout. Over training is like purging and can lead to more severe problems I’ve sustained injuries a lot and had to cut back. I’m really sorry your going through this but I think it’s a good thing your realizing it is a disorder. Also yes orthorexia is very real and mine started out at that before it got way worse I would only eat healthy foods and then it escalated and now I’m doing everything I can to stay out of the hospital so I don’t have to give up running.You deserve to not feel chained to the gym there’s so much more to life which is want I want to experience more than anything! The fitness world can be so toxic also is what I’ve learned. That’s really hard I hope that makes you feel less alone :) I’m also starting to get help which you very much deserve also!",
      "created_utc": 1580910198.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fgnbi49",
      "author": "bgdxo",
      "body": "Hey, I over train and was diagnosed with “subtype exercise bulimia” I completely feel you with this post. You are not alone",
      "created_utc": 1580941389.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fglssoh",
      "author": "seatangle",
      "body": "A lot of people don’t know that the most commonly diagnosed ED is “eating disorder not otherwise specified.” You don’t need to fit the requirements of AN, BN or other diagnoses to have an ED. If your thoughts and behaviors around food and exercise are negatively impacting your health, mental well-being, and even relationships,  that is disorder.\n\nPlease talk to your doctor about it - they might be able to refer you to a specialist.",
      "created_utc": 1580910058.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fh86wya",
      "author": "16of16",
      "body": "Identify what your training goals are. People susceptible to ED, body dysmorphia, purging via exercise need to be very mindful about why they are training and develop boundaries to keep from drifting into dangerous waters. \n\nWrite it down, be realistic, if necessary assign a specific but healthy BMI and create a plan to achieve THAT goal and stick to it! If improving conditioning and basic aesthetics is the goal, you can do that with a lot less time than you are currently spending - everything beyond a certain point is nothing but calorie burn, cortisol, and reduced immune and hormonal function. \n\nRemind yourself that is not only OK to take days off, it is healthy, necessary, and leads to improved adaptive response to exercise. Remind yourself that you only need to train for about half of what you're doing to get all the possible benefit, and everything else is garbage volume that leads to you being LESS healthy. \n\nConsider getting some therapy. It can seem like a big and scary step, but really is not a big deal. Many ED therapists have physio background and can talk exercise, nutrition, as well as looking at some of the underlying insecurities, triggers, unhealthy coping mechanisms.",
      "created_utc": 1581353362.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fi2vce1",
      "author": "cuteavocadoparty",
      "body": "Oh man I totally relate to this. Like SO much! I like how I look but my mind gets completely twisted when I can’t eat my normal foods or exercise within my workout split and schedule. I also do a lot of sets in total each workout because I feel that otherwise I won’t make any progress. Travel is the worst thing that could happen to me because that means that I can’t follow my diet and workout regime... and also the sexual topic is a struggle. I have to force myself to want because otherwise I never feel like it. I wish I could be more relaxed with food and exercise, but I feel I bit trapped",
      "created_utc": 1582090261.0,
      "score": 1,
      "context": []
    }
  ]
}