{
  "id": "f1pbxj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1581336150.0,
  "title": "Request: Anyone else have huge anxiety when going grocery shopping?",
  "selftext": "Reading all the labels, knowing practically NOTHING is good for you. \n\nI’ve spent over an hour walking back and fourth between the isles trying to find something okay to eat. \n\nToday I wanted to find something for breakfast, but I got to the store and didn’t go in. I already knew everything would be bad, and I didn’t feel like looking at all the labels. I could already feel the stress...it honestly shut me down and I’m still in a horrible mood. \n\nI don’t know what to do..",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/f1pbxj/request_anyone_else_have_huge_anxiety_when_going/",
  "score": 85,
  "num_comments": 13,
  "comments": [
    {
      "id": "fh7mx01",
      "author": "None",
      "body": "I buy the same 25 things every time. These are my safe foods that keep my nourished and healthy with a good balance of all food groups, and I know which brands I like and can afford so I never need to look at a label. This is what works for me.\n\nAlso, hard rule that I don't buy ice cream when grocery shopping with other people because it is ALWAYS an ordeal of me pacing the freezer aisle trying to decide if I can buy ice cream and if so what kind. It takes forever, it's a thing I'm willing to do on my own if I want ice cream but I won't subject someone else to the madness.",
      "created_utc": 1581338566.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fh7mgma",
      "author": "girlwhoeatscake",
      "body": "I don’t know how many times I’ve cried walking around the grocery store looking for food. I’ve found that the easiest way to do so is to plan a few safer meals and write down the ingredients before going in. Even then I’ve had anxiety attacks. \n\n\nI’m so sorry that happened to you.",
      "created_utc": 1581338111.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fh7nq96",
      "author": "saltinado",
      "body": "I'm so sorry, that's so stressful. I second the other posters. Come in with a list of things that you want to get. I think the labels are less intimidating when I can shut my laptop screen in disgust and then try again in two minutes. I feel like more of the power is in my hands.",
      "created_utc": 1581339365.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fh7snd8",
      "author": "misskittenmittenss",
      "body": "What really helps for me are buying unprocessed foods. Literally just fruits and vegetables and grains. I know my diet might be lacking (though I'm a vegetarian anyway), but at least it helps me get SOMETHING in. For protein I like to get beans and sometimes an egg. Just stuff you can steam or boil (not using oil, cause thats one of my fears). This way I NEVER check any ingredients lists cause I literally eat stuff that has only one ingredient. Maybe this could help for you too",
      "created_utc": 1581343624.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fh7phu4",
      "author": "defazie",
      "body": "I hate grocery stores so many people and carts.  And people who leave there cart in the aisle.  Then of course trying to find everything.   Yes I have tons usually go with my hubby.  Sam club is usually worse for me.",
      "created_utc": 1581341004.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fh7uwav",
      "author": "dickstiffydotnet",
      "body": "I find grocery shopping a lot easier if I plan my list in detail with exact products before hand so I can be in and out as fast as possible without having to make choices. Lots of grocery stores have all their products listed online too if that would help!",
      "created_utc": 1581345353.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fh7voiu",
      "author": "meggi42",
      "body": "I get this feeling, especially considering how MUCH food you encounter in a grocery store. It can feel a bit like sensory overload. However, the notion that ‘all the food is bad for you’ is misguided—food IS good for you, and the foods you categorize as ‘bad’ or ‘unsafe’ are considered normal to non-disordered eaters. Try this: eat what sounds good and is nutritious (fats, proteins, grains, veggies, fruits, sweets—yes, candy chocolate all that) because food is meant to be enjoyed as well as used for fuel. DO NOT turn over onto the nutrition label and check fat content, ingredients, calories. Those of us in recovery aren’t going on diets anytime soon because (a) diets are fads & statistically proven to be mostly ineffective in making a person ‘healthier’ and (b) losing weight is not the objective when choosing what to eat (unless this is agreed upon with a professional). You are not dirty or unclean or gluttonous for eating natural&artificial sugars, packaged food, or high calorie treats—this will not make you unhealthy or throw you into a body you don’t want. The eating disorder is enough torture for a life; try to be compassionate to yourself and stop looking at the labels.",
      "created_utc": 1581345937.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fh84r9p",
      "author": "CeramicHorses",
      "body": "Yes!!! When I was pregnant I was having horrible insomnia so going out was 100% worse. I finally forced myself to buy some food and stop eating canned food (all I could keep down). I decided to make a pasta dish. I felt so overwhelmed in the store I hurried out. I was halfway home when I realized I forgot the penne and started crying because I didn't want to go back there. Pregnancy and panic attacks aren't great",
      "created_utc": 1581352006.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fh8c2sa",
      "author": "ObedienceBlythe",
      "body": "Ever since I was a kid I was anxious about grocery stores - I think my fear of spending money or having money be spent on food I eat and my fear of food and eating go hand in hand, as I got older I definitely find anxiety in grocery stores because of all the options and labels and all.. unfortunately, my fear of spending money also is an excuse for me not to feed myself...",
      "created_utc": 1581356555.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fh8depr",
      "author": "karupiin",
      "body": "Pretty much every time I go into a grocery store, convenience store, or even look at a vending machine, I get too overwhelmed to actually buy anything and leave.",
      "created_utc": 1581357369.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fh8qvi5",
      "author": "AzerothVarrock",
      "body": "Yesss.... been struggling a lot with that lately. Like when my family asks me what food I want to eat (like eating out or from the grocery store) I just... cant decide... cus sometimes I'll decide and then I'll talk myself out of it and I'll be like oh wait but it's not healthy. \n\nI just gotta try to eat things again. I'm going down a slippery slope. I was doing great for a couple years and idk, gotta get a handle on this. Gonna grocery shop today if I can and I am anxious I will talk myself out of everything again and get boring foods and idk. \n\nYou're not alone though!",
      "created_utc": 1581365505.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fj92i35",
      "author": "None",
      "body": "This happens to me too. Try eating Grape Nuts. I eat mine in a coffee cup with vanilla soy milk and warm it for 30 seconds in the microwave (takes the “crunch” out). Ideally, I’ll add a banana for extra potassium, but I can’t always, you know what I mean.\nLook at the label. You won’t find anything that packs that nutritional punch, with so little food. It also sticks with you. If that’s all I have, great! I know I’ve given my body nutrients for the day and let it go♥️",
      "created_utc": 1583129699.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fj92lyd",
      "author": "None",
      "body": "Same:(",
      "created_utc": 1583129809.0,
      "score": 1,
      "context": [
        {
          "id": "fh8c2sa",
          "author": "ObedienceBlythe",
          "body": "Ever since I was a kid I was anxious about grocery stores - I think my fear of spending money or having money be spent on food I eat and my fear of food and eating go hand in hand, as I got older I definitely find anxiety in grocery stores because of all the options and labels and all.. unfortunately, my fear of spending money also is an excuse for me not to feed myself...",
          "created_utc": 1581356555.0
        }
      ]
    }
  ]
}