{
  "id": "f4yy4o",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1581894245.0,
  "title": "Request: There is hope",
  "selftext": " \n\nI suffered from bulimia and anorexia. It was very severe I was purging  breakfast/lunch/dinner and snacks or wouldn’t eat for days on end. For  the last half a year things have been amazing! I’m eating keto now which  is helping me slowly get back into the habits of eating properly,  having the right amount of meals and actually keeping them down.  I do still have bad thoughts and do still look in the mirror and cringe  but encourage (not force) myself to eat the next meal (and I make it my  fav keto treat which is steak and mushroom sauce 😍).  Just wanted to post saying THERE IS HOPE. YOU CAN DO THIS. I’m happy to  share more of my coping mechanisms. Also wanted to say, this journey I  did on my own. My family don’t know (I’m sure they guessed but I never  told them) my mum called me fat all through school (her fav phrase was  “you’d be beautiful if you just lost a little more” and I was already at  fainting point. Other people don’t dictate your version of beauty and  perfection. Being beautiful is being kind and being a good person and  perfection dosnt exist. So enjoy the moments of life - have the courage  to feed your body and if not that, feed your mind with nutrition so you  can focous and get what you want outta life. Everyone stay strong ❤️ you  got this.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/f4yy4o/request_there_is_hope/",
  "score": 54,
  "num_comments": 8,
  "comments": [
    {
      "id": "fhwapi5",
      "author": "None",
      "body": "That's great. I'm happy for you. Your mom is a cunt",
      "created_utc": 1581910716.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fhwsvzo",
      "author": "ammerzye",
      "body": "I'm sorry you had to put up with that kind of abuse it must've been awful. I'd love to hear some coping mechanisms for recovery because I've been deep in these behaviours for years and have never been in recovery really. I just think I don't deserve to get better ya'know.",
      "created_utc": 1581928593.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fihbt93",
      "author": "hizzilealy",
      "body": "That’s incredible work that you’ve come so far on your own in circumstances that must feel so difficult and unsupportive of recovery! Not purging alone is such a big step and your body will be so grateful. It’s such a stress on our poor digestive systems not to mention our teeth! \nI stopped purging ten years ago but still restricted for a long time in various ways. About a year ago I discovered Kayla Rose Kotecki on YouTube and she talks about letting go of all restriction. Even keto or Atkins or raw til 4 or whatever diet’s got you. I’d highly recommend watching her videos, even if you don’t feel inspired to go “all-in” yet. She speaks a lot of sense and there’s a lot of support on her channel. As does Elisa Oras. And I totally recommend following body-positive queeeeeens such as Iskra Lawrence and Ashley Graham who radiate beauty.\nYou deserve total nourishment and total health. I know how much work it takes to get from where you’ve been to where you’ve got to and I admire your strength and courage. That’s why I thought it worth mentioning this here, you can get even further when you feel ready. You’ve proved you have it in you to fight and I hope for you that you’ll keep going and keep expanding your comfort zone little by little. It’s really rough that your mum has brought you into her world of insecurities. But that’s her problem and by making yourself healthy and well you’re saying a massive FUCK YOU to her insecurities. Maybe one day she’ll have the courage to fight them too. I love you, you’ve got this. Keep fighting! X",
      "created_utc": 1582408559.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fhyalu5",
      "author": "Krisloveskat",
      "body": "I love your spirit and you are doing incredible, but at some point in time you will have to lose the word “diet” from your vocabulary. There are no good foods and there are no bad foods! You must eventually learn everything is fine in moderation. I know you might not be there yet, but keep this in mind. I am so proud of you!",
      "created_utc": 1581972031.0,
      "score": 2,
      "context": [
        {
          "id": "fhwapi5",
          "author": "None",
          "body": "That's great. I'm happy for you. Your mom is a cunt",
          "created_utc": 1581910716.0
        }
      ]
    },
    {
      "id": "fhx7cv7",
      "author": "zara_persson",
      "body": "Sorry about your situation, I would love to hear some coping mechanisms as well tho",
      "created_utc": 1581946950.0,
      "score": 2,
      "context": [
        {
          "id": "fhwsvzo",
          "author": "ammerzye",
          "body": "I'm sorry you had to put up with that kind of abuse it must've been awful. I'd love to hear some coping mechanisms for recovery because I've been deep in these behaviours for years and have never been in recovery really. I just think I don't deserve to get better ya'know.",
          "created_utc": 1581928593.0
        }
      ]
    },
    {
      "id": "fj5j72e",
      "author": "wiggle-wiggle-wig",
      "body": "My coping mechanisms come from sayings. I had a diary that I wrote my favourite lines in. What actually pushed me to change was the saying in the post “feed your mind”. Because I couldn’t preform underfed at all. I read those lines every day before bed 😊",
      "created_utc": 1583034025.0,
      "score": 2,
      "context": [
        {
          "id": "fhwsvzo",
          "author": "ammerzye",
          "body": "I'm sorry you had to put up with that kind of abuse it must've been awful. I'd love to hear some coping mechanisms for recovery because I've been deep in these behaviours for years and have never been in recovery really. I just think I don't deserve to get better ya'know.",
          "created_utc": 1581928593.0
        }
      ]
    },
    {
      "id": "fhyam3y",
      "author": "agree-with-you",
      "body": "I love you both",
      "created_utc": 1581972035.0,
      "score": 3,
      "context": [
        {
          "id": "fhwapi5",
          "author": "None",
          "body": "That's great. I'm happy for you. Your mom is a cunt",
          "created_utc": 1581910716.0
        },
        {
          "id": "fhyalu5",
          "author": "Krisloveskat",
          "body": "I love your spirit and you are doing incredible, but at some point in time you will have to lose the word “diet” from your vocabulary. There are no good foods and there are no bad foods! You must eventually learn everything is fine in moderation. I know you might not be there yet, but keep this in mind. I am so proud of you!",
          "created_utc": 1581972031.0
        }
      ]
    },
    {
      "id": "fj5jcr7",
      "author": "wiggle-wiggle-wig",
      "body": "I commented one above but I also relied ALOT on others. I’m not sure about you but I’m New Zealand we heals support groups and I’d go every week just to vocalise my pain and talk. It’s hard only the first time. Gets more and more empowering to speak every tome I went",
      "created_utc": 1583034141.0,
      "score": 1,
      "context": [
        {
          "id": "fhwsvzo",
          "author": "ammerzye",
          "body": "I'm sorry you had to put up with that kind of abuse it must've been awful. I'd love to hear some coping mechanisms for recovery because I've been deep in these behaviours for years and have never been in recovery really. I just think I don't deserve to get better ya'know.",
          "created_utc": 1581928593.0
        },
        {
          "id": "fhx7cv7",
          "author": "zara_persson",
          "body": "Sorry about your situation, I would love to hear some coping mechanisms as well tho",
          "created_utc": 1581946950.0
        }
      ]
    }
  ]
}