{
  "id": "f6wf3h",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1582219707.0,
  "title": "Request: Girlfriend with ED broke up with me abruptly after 4 year happy relationship",
  "selftext": "I've been in a relationship with a girl for over 4 years which has been really good with many happy times together, no big disagreements and us both seeing it as having found the person to spend the rest of our lives with, only a month or so ago she was asking me when I would propose to her.\n\nShe had and eating disorders prior to use being together and was recovered the time we started dating. Around 9 months ago however it recurred and things got gradually worse due to stress at work. She has been off work now around 6 months and is in treatment. Progress has been slow with some positive steps and some struggles but broadly things were stable or so I thought.\n\n3 weeks ago she said she was having doubts about our relationship and her attraction to me. Then after a few days se arranged to meet me insisting I was somewhere around friends or family.\n\nShe then read me a letter about how she loved me but was no longer in love with me and no longer wanted to get married and have children with me. She said her feelings had been real and they had been the best 4 years of her life but I deserved someone who wasn't having doubts and declined when I offered her more time to think or a month break to think about such a big decision. I questioned whether she thought our our relationship has been a good thing and she said I had been an amazing support and said I should work on a support line one day although I probably wouldn't feel like it now. \n\nShe had said things before along the lines of I deserved better than her and that she thinks she tricked me when we met into thinking she was normal. I insisted that I loved her and nobody is without their problems. In spite of her illness we have always had a good time when we are together.\n\nI showed her cards she had written to me about how happy she was and us spending our future together to try to remind her of who she was but she said that she had changed. When asked if she had been having doubts for a while she said no, but she just knew that she needed to be on her own right now.\n\nShe did all she could to make things final, and changed her social media pictures on that day and insisted I tell my family. She said I should not contact her as it would be too hard for me and so I can heal and go through the stages then she would love to have me as a friend. She told me not to wait for her.\n\nI couldn't get through to her when I said she was trying to push me away, I have read similar accounts online and about people with ED being consumed by guilt of what they are putting their partner through. I did tell her all the good times outweighed the difficult times but I couldn't get through and her mind was made up.\n\nI have given it two weeks since then and not been in touch with her. Have heard a little from her family and it seems her behaviour is very erratic at the moment, like she is a different person and she has also barely been I touch with her sister who she is normally very close with. Her mum and friends have been with her though so I hope she is okay.\n\nI am unsure where things stand for us now and whether she will regret this decision sooner or later. I really love this girl and want our relationship to work but I would have to be sure this couldn't happen again as this break up has been heartbreaking for me.\n\nWould appreciate any advice, as much as I want to contact her I feel like this would be a bad move if the ED voice is still very strongly controlling her and I don't know if I could get through to her if it is.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/f6wf3h/request_girlfriend_with_ed_broke_up_with_me/",
  "score": 51,
  "num_comments": 8,
  "comments": [
    {
      "id": "fi7h5mi",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1582221300.0,
      "score": 81,
      "context": []
    },
    {
      "id": "fi7maz9",
      "author": "k455i",
      "body": "This left me with a heavy heart, but I agree with the user above - the only thing to do is give her the distance she asked for and continue to care for yourself. If her friends and family truly care about her, and know what her mind has put her through, they’ll encourage her to get help as well. \n\nI hope you two find your way back to each other, one way or another.",
      "created_utc": 1582224043.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fi7mdxr",
      "author": "None",
      "body": "I’m so sorry. I really empathize with your girlfriend.",
      "created_utc": 1582224087.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fi7v13o",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1582228680.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fi7ts84",
      "author": "R0ck01",
      "body": "It sounds like she started viewing you as support and didn't want to put you through that. This may be a chance for he to prove to herself that she doesn't \"need\" that from you. That may be a good thing. Or bad if she isolates more and more to harm herself (like not speaking to her sister too...).\n\nRegardless of whether she really wants you or not, it seems like she's pushing away to try to save you the trouble and try this out on her own. Like you \"found her out\" regarding her eating disorder and she doesn't want to rely on you to pick up any pieces and doesn't want that sort of thing to get mixed up in love.\n\nHer eating disorder and whatever is underneath fueling it may try to screw herself over in this vulnerable time in her life. Yes, she needs to show herself that it's not a knight in shining armor to save her but also to not turn it back into disordered eating or other bad coping habits to make her able to feel like she's handling things.\n\nI'm only speaking as someone who has had exs push and pull due to their own inner turmoil and I myself have the fucked up disordered thinking that puts a barrier between me and those I love.",
      "created_utc": 1582228033.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fi8errv",
      "author": "canyonlands2",
      "body": "It’s times like that that really make you wish you know what’s going on in her head. I’m not her so don’t take this as absolute goal, but she feels like you’re too good for her and her ED is making her choose suffering over anything else. \n\nI’m sorry you have to suffer as well. I hope she gets better soon. No matter what happens to her, I hope you’ll be okay too",
      "created_utc": 1582238902.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fi9r3lc",
      "author": "edie43",
      "body": "I know this is heartbreaking and awful for you OP, but you have to respect her decision. It seems you want to think her eating disorder is brainwashing her into this, but you have to trust that she’s doing what she feels is best for herself. All you can do now is respect her wishes and give her the space she’s asking for. Just make sure she has family around her and is safe and move on. I’m sorry, but assuming this is her eating disorder will do more harm than good in my opinion...",
      "created_utc": 1582278142.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fi7l8qn",
      "author": "lilbitofsarcasm",
      "body": "This! so much this! Its not your job to put her back together and that saying is true sometimes the best thing you can do if you love her is let her go.",
      "created_utc": 1582223485.0,
      "score": 9,
      "context": [
        {
          "id": "fi7h5mi",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1582221300.0
        }
      ]
    },
    {
      "id": "fi81sai",
      "author": "bitchcaffeinated",
      "body": "Really? Not sure what OP said that warranted this response. \nHe never said he was trying to contact her, he never used any excuses.",
      "created_utc": 1582231845.0,
      "score": -4,
      "context": [
        {
          "id": "fi7v13o",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1582228680.0
        }
      ]
    }
  ]
}