{
  "id": "f7kuab",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1582332368.0,
  "title": "Request: Worried about my relationship?",
  "selftext": "Is it normal to worry that just because you have an ed that your partner might develop one and you'll have to compete with them?\n\nMy last partner had an ed and we just constantly played off one another and our relationship got toxic after a while.\n\nI was talking to my gf and told her if she ever has thoughts about doing the things I do to talk to me or a professional right away. She said not to worry because she loves food too much. But, I did too at one time.\n\nI don't want to be the reason why our relationship is ruined. I love her so much. But, I don't think I can handle a relationship like my last.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/f7kuab/request_worried_about_my_relationship/",
  "score": 43,
  "num_comments": 2,
  "comments": [
    {
      "id": "fibzecs",
      "author": "None",
      "body": "Hey. That’s a tough situation. I’m sorry about your previous relationship but I’m glad you realized how unhealthy that was. You seem like a very nice person, I think it’s good that you communicated your concerns with her and hopefully she doesn’t develop an eating disorder but even if she did that wouldn’t be your fault. I’d recommend to her if that happened to see a professional. I hope you are also getting help to fight the eating disorder you have. I know from experience that having an eating disorder can be hard to deal with alone, professional help can be a blessing. I’d recommend you both be open and honest with each other, but it seems you both already are which is great. I hope and pray that you get through this. I believe in you. I hope nothing but the best for you and your girl. :)",
      "created_utc": 1582333796.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fic25wt",
      "author": "Gees_sass",
      "body": "I'm sorry that your last relationship ended so badly. However, I think it's possible for you to have a healthy relationship despite potential mental health issues. Remember that communication is key-between you and your girlfriend, with a professional if necessary.\n\n I believe in you! You have the power to change your life for better 😊",
      "created_utc": 1582335754.0,
      "score": 6,
      "context": []
    }
  ]
}