{
  "id": "faa2ke",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1582798820.0,
  "title": "Request: Is something wrong with me? Do men get eating disorders?",
  "selftext": "My mother and my female friend are concerned about me but i think I'm improving my life, I'm just trying to lose weight. I know it is maybe a little extreme but I am finally motivated to change.\n\nI am a straight male in my 20s... never heard of someone like me getting an eating disorder ever, so it must be extremely rare and I probably don't have one.\n\nI hate my body due to my weight (I'm obese) and 3 months ago I started a vegetable diet of a few hundred calories a day. I've now lost 60 pounds in 3 months but I'm still fat. I also did water fasting. I have developed a fear of food and I am mostly very happy about that. Mostly all I eat is fruit and vegetables and I never ever eat carbs. I tried to train myself to not want food by self harming every time I got hungry. I know that's weird but it was a good distraction. I stopped because of the comments (my arms are already scarred due to suicide attempts but new ones got questions). I exercise a lot and if i eat too much I make up for it with exercise. I exercise until I want to die for hours every day. I'm getting so much healthier and fitter even if I am overworking my muscles a bit. \n\nI struggle sometimes because I know I don't actually *need* to eat, it's just hunger signals/greed/habit. My body has over a hundred pounds of excess fat. As long as I get vitamins, I don't actually need food. That's why I feel guilty when I eat, I don't need it.\n\nI'm taking amphetamine drugs to reduce hunger, I started that on the advice of a friend and I think it'll be difficult to stop them now. Happy I did it though. Looking in the mirror makes me want to die, it is so disgusting seeing all the rolls of fat and my huge stomach. I don't care what methods or how extreme it is, I just want to lose weight as quick as possible. Is that really so bad..?\n\nI used to be thin and good looking, I dated a lot, then somehow I became an obese food addicted alcoholic shut in. I invited one of my female friends over a couple of months ago. She was shocked at my weight gain and it was incredibly embarrassing. I got drunk and tried to kiss her and she said she wasn't interested because I was so fat. The disgust in her eyes was the worst feeling.. to go from women looking at you seductively to looking at you like you're a piece of dog shit is the worst i have ever felt. I didn't eat for 3 weeks after that (water fasting). I wanted to carry on but I'm too weak and just gave in. I want to try for 6 weeks. I won't be happy until all this disgusting fat is gone from my body. \n\nI know my thought patterns are quite negative but overall I think it's very good that I lost weight and I'm happy with my progress. I don't think I have an eating disorder but if I do then it's a good thing. Is there anything concerning here?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/faa2ke/request_is_something_wrong_with_me_do_men_get/",
  "score": 46,
  "num_comments": 22,
  "comments": [
    {
      "id": "fiws6v3",
      "author": "kayteesays",
      "body": "To provide a very simple answer, yes. Eating disorders do not discriminate based on age, sex, gender, socioeconomic status, etc. \n\nMen absolutely do get eating disorders and deserve treatment and help for them.",
      "created_utc": 1582800613.0,
      "score": 62,
      "context": []
    },
    {
      "id": "fiwt2f4",
      "author": "igotthatbunny",
      "body": "I would say all of this is VERY concerning and you should speak with a doctor or counselor as soon as you can. If you are overweight it is good to lose weight, but there are safe and healthy ways to do so and I think you have fallen into patterns very outside of that healthy methodology, particularly with the self harm and punishment behaviors surrounding hunger and food. Please get help, down the line your body will thank you for treating it properly through your weight loss journey and you will develop healthy habits to lose weight and keep it off once you reach your goal weight!",
      "created_utc": 1582801797.0,
      "score": 29,
      "context": []
    },
    {
      "id": "fix0ldb",
      "author": "invisiblepourlesyeux",
      "body": "Honestly this is all extremely concerning and it sounds like you have a pretty severe eating disorder. I’m an ED clinician and I do work with men - I think the statistics are 1 in 4 people with EDs are males, however that’s only diagnosed and my guess is that there are more that are not diagnosed due to stigma. Very few of my clients fit the stereotypical “look” of an eating disorder. \n\nI know you hate your body right now and it might not seem like a concern, but restrictive eating disorders can have the same life-threatening effects on your organs regardless of weight. There are people who end up hospitalized with organ failure despite remaining in an “overweight” or “obese” body - all because they are eating so little. I would really encourage you to talk with a professional about what’s going on because it’s not going to be so simple to stop once your body is smaller. \n\nI have a male client right now with a similar story - at least similar in that he started restricting in a larger body. Despite being currently underweight he still views himself the same way he did when he was larger and it is an every day battle to eat. You deserve more than that. And the sooner you get help the easier recovery will be.",
      "created_utc": 1582809493.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fiwsjo5",
      "author": "pzych_",
      "body": "To be honest, EDs are much more accurately characterised by thoughts about food- and a fear of food is a big indicator of an ED! Losing weight can be done healthily, but it’s important to pay attention to your thought process around it. Like with anything, your mental health is paramount- and will ultimately effect your physical health. Listen to those who care about you, they just want what’s best for you ❤️",
      "created_utc": 1582801102.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fix7vjb",
      "author": "Tigrella17",
      "body": "Hey, just to throw my two cents in here: I work at a residential treatment center for folks with eating disorders. I’ve treated people of all genders, weights, races, and socioeconomic statuses. Eating disorders are about behaviors, not about weight. \n\nYou could be doing irreparable damage to your heart, bones, and other organ systems through what you describe here. These behaviors are extremely concerning and you need to reach out for help from a doctor/therapist ASAP.",
      "created_utc": 1582814737.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fiwugrb",
      "author": "thehealthmentor",
      "body": "Eating disorders have more to do with not accepting your body and feeling bad about your appearance. And those elements are both males and females. \n\nYou need to work on self-acceptance, to release all those emotions you have about yourself. You can change to whatever you want, the only thing is that the difficulty of the change will depend on your level of acceptance.",
      "created_utc": 1582803550.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fix6qzw",
      "author": "nyloncup",
      "body": "You talk so negatively about yourself.  You don't deserve anything that you are doing to yourself, just because you're larger now. I think it would be best if you talked to a professional about all of your negative views surrounding yourself and how that might relate to how this woman in your post sees you. You are more than what she thinks of you. I hope you can see that.",
      "created_utc": 1582813993.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fixftxw",
      "author": "neddy_seagoon",
      "body": "Men can and do get eating disorders.\n\nYes, you most certainly do have an eating disorder, and you should find a doctor and seek counseling.\n\nSelf-destructive behavior and drug use are not healthy motivation techniques.",
      "created_utc": 1582819600.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fixl5ho",
      "author": "annielovesbacon",
      "body": "First of all, men most definitely get eating disorders — last stat I read, 1 in 10 men in the US has an eating disorder. They can affect anyone, regardless of gender, age, weight, race, etc. \n\nTo answer your question about seeing anything concerning — in short, yes. No one here can diagnose you with an eating disorder. But I see a lot of red flags in your post; saying you’re taking drugs to lose weight and saying you think it would be a good thing for you to have a severe mental illness are particularly concerning.",
      "created_utc": 1582822314.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fixs9al",
      "author": "updown27",
      "body": "Men of all ages and sexual orientation can develop and eating disorder. No body is immune to eating disorders. Eating disorders in men are not any more rare than eating disorders in women, however they are extremely under reported and that’s why you’ve never heard about it. Nobody talks about it in the media because it doesn’t fit the stereotype but I have been to eating disorder treatment programs with men. If you or your loved ones are concerned you should seek an evaluation at your local eating disorder clinic.",
      "created_utc": 1582825852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fixvuu2",
      "author": "theshizirl",
      "body": "Hey, I will read your post in full a little later...but I wanted to say that yes, men struggle with eating disorders as well. I do, too, and struggled with anorexia for years.",
      "created_utc": 1582827549.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiy4cq5",
      "author": "None",
      "body": "[Pro athletes have eating disorders.](https://www.cyclingweekly.com/news/latest-news/sports-dietician-says-eating-disorders-cycling-becoming-serious-problem-445709)\n\nI went from a BMI of 30 to 23 after I turned 50.\n\nInsert joke here about the Diet Mountain Dew and Diet Rockstar that I drink constantly is probably more dangerous than amphetamines.",
      "created_utc": 1582832261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiym7fo",
      "author": "addisonxb",
      "body": "As a guy with an eating disorder, I can relate to a majority of what your going through. I did just about everything you mentioned except I was on heroin for years and after getting clean I gained a bunch of weight super fast. I was already really underweight from using for so long and didnt feel real hunger for a long long time. Plus I didnt give a flying fuck about what I looked like when I was that deep in my addiction. Getting sober allowed me to see that i looked like shit, my clothes were shit, and i started to care way to much about how i looked. I didnt even notice how underweight i was and probably still dont. It was all too much for me to handle at once. I got kicked out of rehab because I stopped eating completely and I was considered a liability. Luckily they didnt find out about the self harm. Had to go do a month of inpatient and then 2 months of residential to get functional again. I've relapsed quite a few times since than a d always lose weight from it. So it always because a huge issue whenever I get clean. Your not alone my dude.",
      "created_utc": 1582842170.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiyr3y2",
      "author": "darkgirl1234s",
      "body": "Yes men can have eating disorders as well as women",
      "created_utc": 1582845071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiyszfq",
      "author": "melxdiq",
      "body": "Do we have a group chat?",
      "created_utc": 1582846256.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fiyy0l8",
      "author": "ammerzye",
      "body": "You are punishing yourself for eating too much, you seem to be terrified to put on weight and you've developed this fear of food which is classic signs of an eating disorder. \n\nThis is coming from someone who has been bulimic for around 3/4 years, please go get help now because even though it's great to loose weight and be healthy if you're obese but you have to have the right mind state or you can be putting yourself in serious danger.\n\nThese are by no means normal eating behaviours and can lead to a lot worse things down the line. It's gonna help your weight-loss journey a lot if you seek help to stop this intrusive thinking before it gets any more out of control. You're not the only one going through this either by any means, do some research as to what help is available in your local area.",
      "created_utc": 1582849575.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fj2uey3",
      "author": "None",
      "body": "I, too, am a straight male in my twenties, who has been battling an eating disorder for nearly ten years. So there's that.  I want you to know that men absolutely get eating disorders, and you are not alone. It's an extremely painful experience to not only suffer with the illness, but to also doubt whether or not you qualify for the diagnosis. It's something I've struggled with very much, a kind of shame I've carried. I understand that, and I see you.\n\nOur stories are a little different, but I can see similarities. You're not the only one.No matter how much weight I lost, no matter how much damage I did to my body (as a teenager I was on the cusp of hospitalization multiple times) or to my brain (when I'm deep in restriction my thought processes can border on delusions, my moods are wildly unstable, anxiety unbearable) --I insisted to myself that everything was fine, I was normal, I just needed to restrict more/lose more weight/purge etc. Yet internally, the whole thing felt completely unmanageable.\n\nPlease seek help. I finally made the call today, and have an assessment this coming week, Of course I'm full of doubt if I'm 'sick enough,' but for now I'm trying to quiet that voice and put my faith in some kind of healing from this. \n\nYou can do this.",
      "created_utc": 1582954344.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fj870ck",
      "author": "h0b0scratch",
      "body": "I'm a male and 36 and have an eating disorder but it scares me bc it doesn't bother me. I've been going to a doctor for it bc of my family. I've been consistently losing 5 lbs a week for the last 2 months. I lost a total of 70 lbs in 4 months. It seems easier bc I am a male and people don't suspect it.",
      "created_utc": 1583106552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fjag8yq",
      "author": "ReptilesWithMatthew",
      "body": "Yes men can have eating disorders. I’m 16m and I’ve been diagnosed with anorexia and bulimia. And honestly man, I recommend you get help. I’m telling you. Ik it’s hard and I didn’t want to either but it’s 100% worth it. Ik man. I hated and still to an extent hate my body and I still get triggered and thing my disordered eating habits will help my body images issues. But they almost make you hyper focus on the little parts of your body you don’t like. Please get help before it’s too late. Ik it’s horrible to live like this, so please get help",
      "created_utc": 1583172872.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fizbcgo",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1582858588.0,
      "score": 1,
      "context": [
        {
          "id": "fix0ldb",
          "author": "invisiblepourlesyeux",
          "body": "Honestly this is all extremely concerning and it sounds like you have a pretty severe eating disorder. I’m an ED clinician and I do work with men - I think the statistics are 1 in 4 people with EDs are males, however that’s only diagnosed and my guess is that there are more that are not diagnosed due to stigma. Very few of my clients fit the stereotypical “look” of an eating disorder. \n\nI know you hate your body right now and it might not seem like a concern, but restrictive eating disorders can have the same life-threatening effects on your organs regardless of weight. There are people who end up hospitalized with organ failure despite remaining in an “overweight” or “obese” body - all because they are eating so little. I would really encourage you to talk with a professional about what’s going on because it’s not going to be so simple to stop once your body is smaller. \n\nI have a male client right now with a similar story - at least similar in that he started restricting in a larger body. Despite being currently underweight he still views himself the same way he did when he was larger and it is an every day battle to eat. You deserve more than that. And the sooner you get help the easier recovery will be.",
          "created_utc": 1582809493.0
        }
      ]
    },
    {
      "id": "fix72qv",
      "author": "nyloncup",
      "body": "Being thin does not mean you are healthy. What you're doing now to lose weight is unhealthy. Health does not just reflect your appearance. It reflects your mind too. I know it can be diffuclt for men to speak out about these things, but I promise that a therapist who specializes in eating disorders has seen men who have problems similar to yours. It seems like you are aware that your behaviors are concerning hence this reddit post. You don't have to be diagnosed to get help.",
      "created_utc": 1582814214.0,
      "score": 3,
      "context": [
        {
          "id": "fix6qzw",
          "author": "nyloncup",
          "body": "You talk so negatively about yourself.  You don't deserve anything that you are doing to yourself, just because you're larger now. I think it would be best if you talked to a professional about all of your negative views surrounding yourself and how that might relate to how this woman in your post sees you. You are more than what she thinks of you. I hope you can see that.",
          "created_utc": 1582813993.0
        }
      ]
    },
    {
      "id": "fj0bebf",
      "author": "invisiblepourlesyeux",
      "body": "I’m glad that I can help you feel less alone. When I was in college and struggling with my own ED, the only friends I had talk to me about their own struggles were both male. And neither ever got treatment so they aren’t part of that 1 in 4 statistic. \n\nThere are lots of different reasons that can cause hospitalization or death - it can be liver failure due to the rapid weight loss, it can be organ breakdown from protein deficiency, or electrolyte imbalances leading to cardiac failure. I know it doesn’t feel like you’ll have trouble stopping now, but obsession with food is a byproduct of starvation. \n\nThere’s a study known as the Minnesota Starvation Experiment where they took healthy men (screened for both physical and psychological health) and put them on a calorie restricted diet (I think 1500 calories). They all started showing a lot of the physical and psychological symptoms we see in EDs - obsession with food, food hiding, recipe hoarding, irritability, poor judgement and poor concentration,,\n depression, decreased energy, poor temperature regulation. And this is only 1500 calories! I don’t know any of my clients who come to me eating even that much. \n\nThere’s this phenomena I see with my clients where after they are eating enough or once they hit a certain weight it’s like their brain just “clicks” out of the obsession. And it’s a pretty stark difference. I’ve heard so many people say that they’ll stop at a certain weight/size/whatever but it never ends up being enough. I was one of those people - just didn’t want to be fat anymore and ended up with a 10 year eating disorder (that still pops up in my brain sometimes after almost 10 years of recovery).\n\nAnother study you might find of interest is the biggest loser study - they followed participants after the show and not only did most (if not all?) of them regain the weight, but despite weight regain they continued to have metabolic suppression of 500 calories a day. Despite being fat again, their metabolism was burning 500 fewer calories than it was before. And their fat mass / lean mass ratio ended up significantly worse. \n\nI know it is so hard when weight loss is supposed to be this magic cure everybody should be pursuing, but I don’t know that this approach is going to get you where you want to be. I hope you’ll consider talking to someone, or if nothing else at least eating a bit more. Because I hate for this to be the next 20 years of your life. (If you do decide to talk to someone at any point you can PM me and I’d be happy to help you find someone in your area)",
      "created_utc": 1582895552.0,
      "score": 2,
      "context": [
        {
          "id": "fix0ldb",
          "author": "invisiblepourlesyeux",
          "body": "Honestly this is all extremely concerning and it sounds like you have a pretty severe eating disorder. I’m an ED clinician and I do work with men - I think the statistics are 1 in 4 people with EDs are males, however that’s only diagnosed and my guess is that there are more that are not diagnosed due to stigma. Very few of my clients fit the stereotypical “look” of an eating disorder. \n\nI know you hate your body right now and it might not seem like a concern, but restrictive eating disorders can have the same life-threatening effects on your organs regardless of weight. There are people who end up hospitalized with organ failure despite remaining in an “overweight” or “obese” body - all because they are eating so little. I would really encourage you to talk with a professional about what’s going on because it’s not going to be so simple to stop once your body is smaller. \n\nI have a male client right now with a similar story - at least similar in that he started restricting in a larger body. Despite being currently underweight he still views himself the same way he did when he was larger and it is an every day battle to eat. You deserve more than that. And the sooner you get help the easier recovery will be.",
          "created_utc": 1582809493.0
        },
        {
          "id": "fizbcgo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1582858588.0
        }
      ]
    },
    {
      "id": "fj59rnd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1583027597.0,
      "score": 1,
      "context": [
        {
          "id": "fix0ldb",
          "author": "invisiblepourlesyeux",
          "body": "Honestly this is all extremely concerning and it sounds like you have a pretty severe eating disorder. I’m an ED clinician and I do work with men - I think the statistics are 1 in 4 people with EDs are males, however that’s only diagnosed and my guess is that there are more that are not diagnosed due to stigma. Very few of my clients fit the stereotypical “look” of an eating disorder. \n\nI know you hate your body right now and it might not seem like a concern, but restrictive eating disorders can have the same life-threatening effects on your organs regardless of weight. There are people who end up hospitalized with organ failure despite remaining in an “overweight” or “obese” body - all because they are eating so little. I would really encourage you to talk with a professional about what’s going on because it’s not going to be so simple to stop once your body is smaller. \n\nI have a male client right now with a similar story - at least similar in that he started restricting in a larger body. Despite being currently underweight he still views himself the same way he did when he was larger and it is an every day battle to eat. You deserve more than that. And the sooner you get help the easier recovery will be.",
          "created_utc": 1582809493.0
        },
        {
          "id": "fizbcgo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1582858588.0
        },
        {
          "id": "fj0bebf",
          "author": "invisiblepourlesyeux",
          "body": "I’m glad that I can help you feel less alone. When I was in college and struggling with my own ED, the only friends I had talk to me about their own struggles were both male. And neither ever got treatment so they aren’t part of that 1 in 4 statistic. \n\nThere are lots of different reasons that can cause hospitalization or death - it can be liver failure due to the rapid weight loss, it can be organ breakdown from protein deficiency, or electrolyte imbalances leading to cardiac failure. I know it doesn’t feel like you’ll have trouble stopping now, but obsession with food is a byproduct of starvation. \n\nThere’s a study known as the Minnesota Starvation Experiment where they took healthy men (screened for both physical and psychological health) and put them on a calorie restricted diet (I think 1500 calories). They all started showing a lot of the physical and psychological symptoms we see in EDs - obsession with food, food hiding, recipe hoarding, irritability, poor judgement and poor concentration,,\n depression, decreased energy, poor temperature regulation. And this is only 1500 calories! I don’t know any of my clients who come to me eating even that much. \n\nThere’s this phenomena I see with my clients where after they are eating enough or once they hit a certain weight it’s like their brain just “clicks” out of the obsession. And it’s a pretty stark difference. I’ve heard so many people say that they’ll stop at a certain weight/size/whatever but it never ends up being enough. I was one of those people - just didn’t want to be fat anymore and ended up with a 10 year eating disorder (that still pops up in my brain sometimes after almost 10 years of recovery).\n\nAnother study you might find of interest is the biggest loser study - they followed participants after the show and not only did most (if not all?) of them regain the weight, but despite weight regain they continued to have metabolic suppression of 500 calories a day. Despite being fat again, their metabolism was burning 500 fewer calories than it was before. And their fat mass / lean mass ratio ended up significantly worse. \n\nI know it is so hard when weight loss is supposed to be this magic cure everybody should be pursuing, but I don’t know that this approach is going to get you where you want to be. I hope you’ll consider talking to someone, or if nothing else at least eating a bit more. Because I hate for this to be the next 20 years of your life. (If you do decide to talk to someone at any point you can PM me and I’d be happy to help you find someone in your area)",
          "created_utc": 1582895552.0
        }
      ]
    },
    {
      "id": "fjbdxx8",
      "author": "TiffB123",
      "body": "Hi, I'm a 17 year old girl (pretty much one of the most statistically likely person to have an eating disorder lol) from the UK as well. I just wanted to tell you that going to your gp is genuinely the best advice I could give you. My anorexia started when I was 11 years old, quite overweight and very shy. When I'd talk to a friend about it, they would say that it's good because I was so fat anyway, so I believed them and simply stopped eating and didn't even think there was a problem with it. My family forced me to to the gp, who did not focus on the fact that I was overweight and that losing the weight would probably \"do me some good\". She focused on WHY I wanted to lose weight, and a lot of my reasons were the exact same as yours. But I wasn't able to stop  myself because I was so obsessed with the idea of 'I'll stop once I get to a healthy weight'. Skip to a few months later, and I was still overweight (less so, but still overweight) so I still wasn't eating causing me to end up in the hospital for 4 months because of my ED, self harm and suicidal thoughts. Please, please do not think that your struggles aren't valid or don't mean anything because that's the same reasoning that lost me my entire childhood. Thin does NOT equal healthy, and neither is starving yourself. Please seek help and don't stop until you find a medical professional willing to give you it, I promise it will be the best thing you ever do",
      "created_utc": 1583191186.0,
      "score": 2,
      "context": [
        {
          "id": "fix0ldb",
          "author": "invisiblepourlesyeux",
          "body": "Honestly this is all extremely concerning and it sounds like you have a pretty severe eating disorder. I’m an ED clinician and I do work with men - I think the statistics are 1 in 4 people with EDs are males, however that’s only diagnosed and my guess is that there are more that are not diagnosed due to stigma. Very few of my clients fit the stereotypical “look” of an eating disorder. \n\nI know you hate your body right now and it might not seem like a concern, but restrictive eating disorders can have the same life-threatening effects on your organs regardless of weight. There are people who end up hospitalized with organ failure despite remaining in an “overweight” or “obese” body - all because they are eating so little. I would really encourage you to talk with a professional about what’s going on because it’s not going to be so simple to stop once your body is smaller. \n\nI have a male client right now with a similar story - at least similar in that he started restricting in a larger body. Despite being currently underweight he still views himself the same way he did when he was larger and it is an every day battle to eat. You deserve more than that. And the sooner you get help the easier recovery will be.",
          "created_utc": 1582809493.0
        },
        {
          "id": "fizbcgo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1582858588.0
        },
        {
          "id": "fj0bebf",
          "author": "invisiblepourlesyeux",
          "body": "I’m glad that I can help you feel less alone. When I was in college and struggling with my own ED, the only friends I had talk to me about their own struggles were both male. And neither ever got treatment so they aren’t part of that 1 in 4 statistic. \n\nThere are lots of different reasons that can cause hospitalization or death - it can be liver failure due to the rapid weight loss, it can be organ breakdown from protein deficiency, or electrolyte imbalances leading to cardiac failure. I know it doesn’t feel like you’ll have trouble stopping now, but obsession with food is a byproduct of starvation. \n\nThere’s a study known as the Minnesota Starvation Experiment where they took healthy men (screened for both physical and psychological health) and put them on a calorie restricted diet (I think 1500 calories). They all started showing a lot of the physical and psychological symptoms we see in EDs - obsession with food, food hiding, recipe hoarding, irritability, poor judgement and poor concentration,,\n depression, decreased energy, poor temperature regulation. And this is only 1500 calories! I don’t know any of my clients who come to me eating even that much. \n\nThere’s this phenomena I see with my clients where after they are eating enough or once they hit a certain weight it’s like their brain just “clicks” out of the obsession. And it’s a pretty stark difference. I’ve heard so many people say that they’ll stop at a certain weight/size/whatever but it never ends up being enough. I was one of those people - just didn’t want to be fat anymore and ended up with a 10 year eating disorder (that still pops up in my brain sometimes after almost 10 years of recovery).\n\nAnother study you might find of interest is the biggest loser study - they followed participants after the show and not only did most (if not all?) of them regain the weight, but despite weight regain they continued to have metabolic suppression of 500 calories a day. Despite being fat again, their metabolism was burning 500 fewer calories than it was before. And their fat mass / lean mass ratio ended up significantly worse. \n\nI know it is so hard when weight loss is supposed to be this magic cure everybody should be pursuing, but I don’t know that this approach is going to get you where you want to be. I hope you’ll consider talking to someone, or if nothing else at least eating a bit more. Because I hate for this to be the next 20 years of your life. (If you do decide to talk to someone at any point you can PM me and I’d be happy to help you find someone in your area)",
          "created_utc": 1582895552.0
        },
        {
          "id": "fj59rnd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1583027597.0
        }
      ]
    }
  ]
}