{
  "id": "fasutn",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1582886262.0,
  "title": "Request: Mental health tech looking to better understand eating disorders",
  "selftext": "I (34F) work for a psych hospital and I’ve recently been moved to a trauma/eating disorder unit. I really don’t understand much about the mind set of people with eating disorders. I’d appreciate any enlightenment on the subject. Like with food restricting, is it a body image thing? Where even though their bones are showing, they see themselves as overweight? Or is it more mental/emotional anguish that makes eating difficult?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fasutn/request_mental_health_tech_looking_to_better/",
  "score": 36,
  "num_comments": 40,
  "comments": [
    {
      "id": "fj0dknq",
      "author": "updown27",
      "body": "It’s different for everyone. I would strongly recommend doing some research in reputable medical journals and texts. Reddit is not the place for medical professionals to be getting their information. I’m sure the physicians you work with can recommend some sources.",
      "created_utc": 1582897280.0,
      "score": 57,
      "context": []
    },
    {
      "id": "fj061rg",
      "author": "dmmge",
      "body": "Sometimes it’s a control thing. I have a very busy life and a demanding schedule. My ED is the one source I can control. It’s calming to me to plan out calories and research foods and nutrition facts. I also come from a home that pushed me to be perfect and put a lot of micro-aggressions regarding food and body image in my head as a child.\n\nEveryone’s reasoning for their eating disorder is different, but it’s important to note that there’s often a lot more causes than just the desire to be skinny.",
      "created_utc": 1582890498.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fj060ut",
      "author": "None",
      "body": "Tw for trauma \n\n\nI was sexually assaulted as a child, never mentioned it to anyone until I was 18. I start with this because it's the root cause (we think). Growing up I had s lot of mental health issues, but food and body size was never an issue. \n\nAt 18, I was in a toxic home environment, and I didnt notice but I began to eat less. I was just being healthy, or so i thought. A coworker was encouraging me, even introducing me to laxatives. \n\nIt quickly spiraled, I'm not sure how it \"clicked\" but suddenly it was about counting calories, jogging in my room. I felt guilty for eating, like I was doing something wrong. \n\nI move away to university, where everything went downhill. I was so stressed, so depressed, and my trauma was coming back to haunt me. I couldn't deal with anything. \n\nFor me, being small(er) makes me feel safer. I feel guilty for eating. I have extreme anxiety over food and feeling full. It's about the number, in a way, because if its bot lower every day it crushes me. But I never went down this path intending to lose weight to fix my body image. Although I look in the mirror and can point out that I \"can still stand to lose\" weight in certain areas (etc face, thigh, whatdver) I know I look gross to others. But when I eat, everythingcomes back and I get so worked up I cannot function in my life. Anorexia has \"helped\" me survive by reducing my life to nothing, each day the same routine, I'm so exhausted that every day is a struggle to just get through the day. \n\nI hope this helps in some way. I know a lot of people with Ed's have histories of trauma (esp people with bulimia). Its tough.",
      "created_utc": 1582890470.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fj07lrb",
      "author": "workingonselfkind",
      "body": "Feel free to DM- but no. For me it was a control thing. As I lost weight my brain function actually declined and my ability to have insight diminished greatly. I would say the majority of people I have met with EDs are very intelligent in many areas and have insight but in this one area (food, self care, body image) we are quite distorted. It’s also important to point out that many people with EDs have other diagnoses as well- commonly depression, anxiety, SUD, and personality disorders.",
      "created_utc": 1582892152.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fj08jnv",
      "author": "120c",
      "body": "While body dysmorphia is a problem for many with the disorder, my struggle is more about suicidal thinking and control. I have near constant suicidal thoughts that seem less intense to me when I’m starving—essentially because I think of myself as passively dying instead.",
      "created_utc": 1582893058.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fj1e87n",
      "author": "Aphanizomenon",
      "body": "Please research this topic before you start your work...I mean reddit is great and first hand experiences can help but it just really seems like you haven't bothered to read one paper, let alone a book. Eating disorders happen as a result of interplay between social, biological and psychological factors and they mean different things to everyone, often a coping mechanism. Some have body dysmorphia and see themself much bigger then they truly are, some don't. For me for example the case wasn't that I didn't realize that I was thin, I just never compared myself to \"normal\" weight people because it seemed to me like the whole world is eating too much and I wanted to be thinner, it made me feel like I am taking control of my life (until it didn't) . And please just before starting your job understand that it's almost never about the looks",
      "created_utc": 1582918240.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fj05d61",
      "author": "knightgreyson",
      "body": "For me it started as a situational thing but it quickly turned into intentional starvation. I was overweight already and that combined with some pressure my dad had been putting on me for years as well as my own body image issues led to restricting. At first it wasn’t too often or too much, but that changed pretty fast. Now I feel guilty pretty much whenever I eat. I’m down to one or no meals a day (usually, today was three!!) just because I feel so guilty about eating. I check my BMI religiously (whenever I find out my weight, I’m not allowed to see the scale) even though I know it’s a flawed system just because I’m praying that it’ll be a normal BMI. I keep telling myself that I’ll stop restricting when I reach a healthy weight (which I’m honestly already at, but my ED doesn’t see it that way) but I doubt that. I hate the way that I looked before and the way that I look now, but at least now I’m not as fat anymore.",
      "created_utc": 1582889716.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fj0pyco",
      "author": "graveyardho",
      "body": "I've been struggling with an eating disorder and with disordered thoughts since I was seven years old. For me it's not about control, it's my body dysmorphia. I grew up being told I was fat, and I'd try to starve myself before doctors appointments so my doctor wouldn't agree with that sentiment. It became an eating disorder instead of just disordered eating when I was 14 and experienced my first heartbreak. I assumed it was because I was too fat to be with someone like him, and I spiraled. About a year later, we made up, and he started helping me recover.\nIt was quiet for a while, though I've always struggled with severe anxiety over my body, and extremely low self-esteem. Last July it flared again, and I ended up losing almost 30 pounds in six months, 20 of those in one month. Officially I was diagnosed with anorexia sub-type 2 last November, though I went through a period of about 8 months where I gained 20 pounds back in an attempt to recover.\nHere's where it gets tricky tho: I have an insecure anxious attachment, which stems from being abandoned as a child. Because of this, I also struggle with codependency. There's no definite link, but people are beginning to study whether there's a connection between this attachment style and eating disorders. (personally, I'd love to study it). I was also abused by both of my moms husbands (ex and current), both who ragged on me for my body and my weight. It's trauma that has been resurfacing, and honestly the only thing that helps it go away is to starve, restrict, and smoke.",
      "created_utc": 1582905356.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fj1prdh",
      "author": "annielovesbacon",
      "body": "Eating disorders are very complex and nuanced, it would be so hard to sum it up on Reddit (and of course they’re different for everyone). \n\nI will say that eating disorders are almost always a manifestation of something else. Eating disorders are a mental illness with physical symptoms. It’s not uncommon to develop an eating disorder in response to trauma, or use an eating disorder as a mechanism to exert control in you life. \n\nI definitely recommend reading studies from reputable journals, but I also recommend listening without judgment to people with eating disorders. It’s almost impossible to fully understand if you haven’t experienced it, but talking with people with eating disorders is the best way to try.\n\nEdit: I also wanted to add that shame and secrecy are huge parts of eating disorders. You’ll have to work hard to earn the trust of your patients.\n\nAlso feel free to DM!",
      "created_utc": 1582925102.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fj1sw5n",
      "author": "sharongrace_",
      "body": "I didn't fully realize what function my ED had until a few weeks ago, even though I've had one for 4 years now. For me, my ED makes me feel \"good\" at something. The more I engage in ED behaviors, the more validated I feel. I'm doing a good job at something, I'm accomplished, I'm succeeding. If I don't engage in ED behaviors, my feeling of \"fatness\" really boils down to feeling like I've failed, messed up, and just brings an overall feeling of guilt.",
      "created_utc": 1582927031.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fj18yku",
      "author": "onegundeath",
      "body": "Here we are all going to offer anecdotal experience which in its unique way is very enlightening in the way getting to know your patients is. \n\nAll eating disorders are different but a common factor is that the behaviors are a coping mechanism, whether the person is aware or not. \n\nYou are going to encounter a lot of behaviors and thought processes and a majority simply wont make any sense.\n\nLike I could eat cheese but yogurt was too much.\n\nI hated looking at my reflection but would weigh myself multiple times a day.\n\nWhen I would binge eat, I would still count calories.\n\nEating salsa and condiments still make me feel like I’m eating a lot more.\n\nWhen my mom said I looked nice, I heard “you look skinny”\n\nMy biggest tip to you as a person in semi-recovery and a former residential patient is that you actively listen, and also reading a few self help books would be nice.\n\n8 keys to Recovery is directed towards people trying to recover but you will learn wonders!",
      "created_utc": 1582915129.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fj25gm3",
      "author": "None",
      "body": "\nI think the biggest thing to keep in mind is that EDs are NOT ABOUT THE WEIGHT. People in fat bodies can have restrictive EDs, people in very thin bodies can have binge eating disorder. Body size and weight are a symptom. \n\nEating disorders are a coping mechanism. When the world is perceived as unsafe or a person’s environment seems out of control, an eating disorder is a way to take control back and protect yourself from pain. You know what you don’t feel as much when you’re starving/purging/binging? Feelings. Feelings are scary, and frankly people in general aren’t taught how to regulate emotions. Eating disorders are a maladaptive emotion regulation technique. \n\nAs far as restriction specifically, people who restrict tend to have messed up reward sensations. In people without EDs, hunger doesn’t feel good. You don’t like it, you know you need to eat. In people with restrictive disorders it tends to be the opposite- hunger feels amazing, it’s like a high. Even 2 years into full recovery I still like how it feels, and I forget to eat because hunger doesn’t feel bad to me and I will often not realize how hungry I am until someone mentions food. \n\nI don’t want to speak as much for bulimia or BED because binging was never a symptom for me (though people assume it is because I’m in a large body, please never assume a patient has one type of ED or symptom because of their size. A dietitian in treatment did that to me, it’s incredibly triggering) but I know all ED symptoms stem from the same general goal- to cope with something you don’t otherwise know how to cope with. \n\nI also want to say there are certain things you should never say. “I wish I had your willpower/that problem” (had a psychiatrist say that to me back in the day when I was thin), “why can’t you just eat”/“why can’t you just stop”, “you don’t look like you have an eating disorder”, things like that will never be helpful. Validation and empathy go so much further than judgment or anger ever will. \n\nIn the end, remember that people with eating disorders aren’t happy people. Like substance addiction, you don’t tend to reach for this maladaptive coping mechanism that causes numbness if you’re doing well and feeling good. You aren’t in control of your life when you have an ED, no matter how much you think you are. It controls you, it controls your thoughts, it helps you block out the bad stuff (and the good stuff- my therapist made the point recently that you don’t get to turn off certain emotions like a drink tap. Numb out and you’re numbing them ALL out). \n\nEating disorders have the highest mortality rate of all mental illness. Suicide rates are astronomical in people with EDs. These people you’re working with aren’t enjoying life and having fun, they’re stuck in the bottom of a deep hole that they’re desperately trying to claw their way out of. \n\nSorry this is so long! And sorry if it doesn’t make sense, I’ve been feeling off today but I’m v passionate about awareness. NEDA has a lot of great resources about this stuff, too.",
      "created_utc": 1582935019.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fj2vvol",
      "author": "None",
      "body": "Every time I eat a food that isn’t a safe-food, I get horrible anxiety that I’m going to gain weight, especially when I eat-when-I’m-hungry for several days in a row. When I go a day without eating I feel a lot better about myself. When I see how many hours, or especially days, that I’ve restricted for, I get the same feeling that I get when I light a cigarette— a nice hit of dopamine. Seeing the number go down on the scale feels incredibly rewarding.",
      "created_utc": 1582955833.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fj07ib8",
      "author": "Uselessness100",
      "body": "Feel free to DM me. I'll do my best to help you.",
      "created_utc": 1582892056.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj08qxy",
      "author": "Chronicallyoddsgirl",
      "body": "TW: self harm, sexual assault\n\nI have EDNOS/OSFED/whatever- I alternate between periods of binge eating, heavy restriction, and purging. I do have body dysmorphia, and there's some parts of body shaming/family pressure that helped shape how my trauma is expressed, but mostly it's about sexual trauma in childhood/teen years.\n\nFor restriction/purging, it's partly that I want to be so small/childlike that nobody looks at me sexually again, and partly self harm where the pain of an empty stomach take the place of cutting/scratching/hitting.\n\nThe binge eating side thing is also a form of self harm, but in a more long term way (similar to sexually reckless behaviour, drinking, drug use, ect). Something that's rewarding while I'm doing it, but feels awful afterwards and as a bonus gives me an overall 'reason' to feel as gross as I do so I don't have to think about why I *actually* feel gross.",
      "created_utc": 1582893247.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj0ccx4",
      "author": "violetblushxx",
      "body": "Happy if you DM any questions 😊 I have an ED but I'm also a nurse who has to work with adolescents with EDs so I see both sides of the equation",
      "created_utc": 1582896333.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj0i9jc",
      "author": "iwanttobedainty",
      "body": "My disordered eating p much started how u thought they do, body image issues, although my bones r not showing and they never have, I'm actually a healthy weight (closer to overweight actually, I'm 67kg at 5'5 and my bmi is 24.6) so I'm on the borderline between healthy and overweight. So idk if my body issues will change once I'm skinnier, however knowing that most people with eating disorders never end up happy even once their bones r showing I probably won't. A lot of it can come from body dysmorphia and self esteem issues, also can come from trauma (sexual assault is a common one) and the illusion of control, the feeling of discipline is so addicting, seeing the numbers go down feels like a high, even if u aren't doing it to lose weight. Mine was just the body image issues and bullying from schoolmates and comments on my weight from family, but mostly just myself, I'd always felt insecure abt my weight, I remember \"experimenting\" with it when I was 12, not eating for a few days and purging, lurking around tumblr Ana blogs but I decided it wasn't worth it, now I'm 14 rlly wishing I had've stuck to that decision.",
      "created_utc": 1582900598.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj16ddz",
      "author": "SoftElevator",
      "body": "Most of us are actually highly intelligent and intuitive which is our downfall. I am happy to talk to you via DM but basically for me it’s just a way to get control over my anxiety and depression. Skinny means I have perfectly controlled my intake. Fat means I failed at self control. It’s all linked for me 🤷‍♀️",
      "created_utc": 1582913806.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj19a7o",
      "author": "Working-Reaction",
      "body": "i enjoy the feeling of being hungry\ni want to prove that i can do it, that i am not like the rest of my family who are all overweight\ni get triggered by competition\nbeing insecure makes me comfortable because whenever i feel confident i eat and then hate myself severely a few days later\ni feel guilty for restricting and for eating",
      "created_utc": 1582915306.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj1lwvw",
      "author": "gumptiousguillotine",
      "body": "For me it was another form of self harm, and also a body image thing. I thought I deserved to starve to death basically, and I’d never be pretty anyway so why not be as difficult to look at as possible.",
      "created_utc": 1582922808.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj1vaxx",
      "author": "oliviared52",
      "body": "For me, I got addicted to the feeling of starving. When I was thin, I knew I was thin. I was definitely more sensitive to any weight put on than “normal” people but personally I knew how I looked. I just enjoyed the feeling of being small and starving. I enjoyed counting every little calorie. And pushing my body to the limits. I have now been recovered for 3.5 years. Now I would much rather push my body limits with snowboarding or rock climbing lol. But it was definitely a control thing for me. Which is interesting because I’m not a super control freak in most other aspects. But I can be pretty stubborn with myself. Which is good cuz it meant when I truly wanted to recover, I put everything towards that. But it took years until I 100% wanted to. I can really relate to drug addicts I’ve talked to. I think a part of it is that the feeling of starving numbs the feelings of whatever else you’re going through and want to ignore. \n\nI’ve never been that raw talking about it. I’ve been recovered for long enough that I’m really open if you have any questions. \n\nAnd for anyone with an eating disorder reading this, I am definitely way happier and love my body a lot more treating it right than I did starving myself.",
      "created_utc": 1582928583.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj1vq2a",
      "author": "AsianMemes",
      "body": "It’s a case by case issue. I think you should do research on reputable studies outside of Reddit, but here is good to get a first person perspective. For me personally, it’s a mainly control. When your life is chaotic and you feel cornered and like everything is out of control, I want to grab something to anchor me, and that’s usually food. I used to be a bad binge eater, hince the binging part of my bulimia. However, I also have a strong amount of desire to harm myself and get skinnier, so I often purge and or restrict after binges. It makes me feel like I have something to choose in my life, it gives me a satisfaction beyond the endorphin rush. Like I said, this is how I think. It’s different for everyone and the best way to approach it is to have an open mindset and try not to assume too much.",
      "created_utc": 1582928855.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj20wqv",
      "author": "kayteesays",
      "body": "I've never had body dysmorphia. I'm always aware when I look normal, too thin, bony, bloated, etc. \n\nMy ED was never about looks. I hardly ever look in a mirror, even when getting ready in the morning, because I just have never really care what I look like. \n\nMy ED developed in adulthood as more of a not-wanting-to-age thing. I had a brain injury (at age 20) and have memory loss, and it's too hard to cope with the fact that I'm getting older and don't remember doing so. It's like a slow and agonizing form of self-harm and slow death, since I could never actively commit suicide. \n\nBut like everyone else has been saying, these are all personal anecdotes and EDs are different for every person. I highly recommend doing some scholarly reading to supplement these personal testimonies if you want to get a good understanding for your work.",
      "created_utc": 1582932065.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj2lhpj",
      "author": "The_Bastard_Henry",
      "body": "I used to frequent a blogging community of people suffering from every stage of eating disorders. I won’t share anyone else’s blog, but if you’re interested, most of my older posts were exclusively related to my eating disorder s1ckb1tch dot blogspot dot com. I have thought a lot about deleting those posts, but if it can help people to understand the disorder, then I feel like I should leave them up.",
      "created_utc": 1582946774.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj2m3l7",
      "author": "yikes-aghost",
      "body": "Very different for different people. For me I feel an overwhelming feeling of guilt pretty much anytime I eat. I don’t feel rewarded in other areas of my life. If I do great on a test or at my job it just feels neutral. Not eating is pretty much the only thing that consistently feels good. \n\nWorking on it though. Therapy failed me but I’m still trying.",
      "created_utc": 1582947239.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj2tmo9",
      "author": "drippingrubies",
      "body": "My childhood was messed up. My parents were mostly neglectful but my mother was emotionally/verbally abusive. We were constantly told that we were never good enough and many much worse things. I became a perfectionist and control freak with like no self confidence which led to a major meltdown when I was 19 (tried to kill myself, went into psychosis, dropped out of school, nearly got hospitalized a few times, etc). My anorexia started developing after that. It was a way of coping and of feeling in control after all of that. \nAs I lost more and more weight, I felt a sick sort of accomplishment. I felt in control of myself when I was starving. I loved it when my bones started protruding out (even though it was painful) because they were signs of achievement. I was able to recognise that I was/am severely underweight but I would still fixate on the little bits of fat left.",
      "created_utc": 1582953574.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj2uktt",
      "author": "mkally414",
      "body": "It's different for everyone but it is known that body image is the last thing to heal when in recovery. For me, I have something called body dysmorphia (give it a Google) but basically it's like looking at yourself in a series of fun house mirrors. I honestly don't know what I actually look like. It's societal pressures mixed with faulty wiring. The ED is a coping mechanism that we've created to deal with stress. I know I've been through abuse and bullying and life changing health circumstances and sexual assault etc... And my window of tolerance for stress was extremely low before I went to residential treatment. While everyone's journey and circumstances are unique, through the people I've met in my journey, there are so many similarities. When it comes to helping people in the ward, just be open to asking questions.",
      "created_utc": 1582954503.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj30qwo",
      "author": "nellfoxface",
      "body": "It’s a form of control when you have no control. It usually stems from some sort of trauma you endure and it becomes a coping mechanism. It can also be tied to low body image and wanting to harm yourself but also control the one thing you “want” in life. There are many different reasons for different people to develop it but there is almost always trauma involved to a certain degree that triggers it to start.",
      "created_utc": 1582961641.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj3838r",
      "author": "throwaway273758291",
      "body": "I suffer from eating disorders (and have been for almost 7 years) and the basic gist for me is that I idealize a certain body type and hold my own body to extremely high standards as it is one of the few things I feel I can control in my life; eating and weight. If I feel full I feel bloated and fat and feel as though I need to get rid of what I ate to feel less uncomfortable whether through means of starvation/excercise/purging. My thinking style in general is very black and white so I am either the best or the worst, or doing my best or worse. So if I eat even a little to much I am doing the worst in my own standards. It is a difficult battle with your own mind to have an eating disorder.",
      "created_utc": 1582972161.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj0dtbo",
      "author": "None",
      "body": "I had (have?) anorexia, and it’s never been about body image. I’ve always been thin and known that. I’m being assessed soon for autism—recent research has shown that a sizeable chunk of anorexic women also likely have undiagnosed autism. \n\nTo me, this makes a lot of sense. My ED developed when I started high school and was overwhelmed by a) having to somehow find/make/plan my own breakfasts and lunches and b) deal with the cafeteria. I couldn’t get a handle on preparing my own food and I avoided the cafeteria due to the chaotic sensory environment.  Not eating meant not having to deal with my classmates or the sensory experience of food, and it made my body/mind feel quieter and calmer. I had rules about amounts/types of food so I always knew what to expect. I love rules. It felt like a game at first, a secret thing I could escape to. \n\nI went vegan overnight to further avoid the pressure to eat unexpected things at family gatherings. Didn’t have a great family environment at home and constantly felt not good enough. I was really good at restricting though. Perfectionism, rigidity, and all-or-nothing thinking are a part of my neurology. \n\nLike others here have been saying, control was a huge part of my ED. I had rules, routines, and a way to avoid things I didn’t know how to handle (people, grocery stores, public eating spaces). It gave me focus—I could hyper-fixate on learning about veganism and nutrition.",
      "created_utc": 1582897463.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fj5qyo6",
      "author": "GameofCheese",
      "body": "It's anything and everything. And at different stages. Adults getting help are usually different than minors since they are forced into it. They'll be your biggest challenge,  as well as extremely sick people that can't think correctly and are completely consumed by the disorder. The rest will be struggling but just want to end the pain and still have some hope to get the help they need,  although every day will be a challenge for everyone. It's a meal and a snack at a time thing.  \n\nFor me,  I've been anorexic, bulimic,  and an less intense disordered eater my whole life.  \n\nI've had a 6 yr period of stabilization,  but that was mainly due to a lack of stress from working fulltime since I'm on disability for my EDs, and chronic depression to make me not care.\n\nWell,  I just got back to my old ED clinic since I'm living alone and I was worried that would trigger me. It didn't really until they wanted to treat the depression,  so they put me on a new drug. \n\nI'm feeling strong emotions probably for the first time in my life or one of the only periods of time,  and I'm super struggling to deal with it. \n\nRight now it's not about weight or body image (which I have never nor will I ever be ok with,  but I have fully accepted that and don't really notice anymore). It's about numbing out those feelings I don't know how to handle despite all my many treatments. \n\nI was probably pretty numb throughout all my previous treatments which explains why I am falling back into the only thing I know to make myself feel better.\n\nStress and anxiety usually causes bulimic symptoms for me,  but right now I'm extremely restricting to get that high it brings and distract me from my new emotions (both good and bad. I feel naked with such strong reactions,  such as crying and I'm not used to it.) When you're hungry and empty it's hard to feel much else,  and you feel powerful and strong unlike how I was feeling out of control. \n\nSee, I know all these things. I'm 41 and have been in more treatments than I can count,  but I still don't seem to have the ability to care suddenly,  which makes me someone with a predisposition to an eating disorder. I will struggle for the rest of my life. There is never any \"recovered\" state,  at least not for me.  I'm hard- wired for this.  I'll try to keep fighting,  and I'm not someone that would ever give up and not ask for help. But I can't help myself alone either. \n\nI'm going to try to stay out of treatment this time,  but with this new situation,  who knows if outpatient will be enough. I hope I'm strong enough to cut this shit out, my older body won't handle it well. \n\nBut honestly,  once that weight starts coming off (I've been at an overweight/ medically obese \"set point\" which hasn't changed for years) I'll be excited to lose weight and get to normal weights again,  and that's extremely addictive and then I'll start to lose control and care more about the body image of it. \n\nSo you can see it's extremely complicated,  and doesn't really make sense to anyone including ourselves. So expect behaviors and attitudes that differ wildly between different patients and different moments. It won't be boring,  I'll tell you that,  we're all extremely dramatic once we get that sick.",
      "created_utc": 1583040203.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fj609f3",
      "author": "None",
      "body": "I’m frightened that they would put you in the eating disorder clinic with you having virtually no understanding of the disorder.",
      "created_utc": 1583050443.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fka60ks",
      "author": "Ellerm271309",
      "body": "Trauma caused mine. My brain is trying to punish me and my body for what happened. My brain is not letting me eat. My brain does not feel I deserve food. I know it sounds crazy but this is what I’m experiencing. I never understood ED until this happened to me. I’m sorry. I’m pretty damaged right now. Hope that helps.",
      "created_utc": 1583993813.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fj0dzqy",
      "author": "Boosey0910",
      "body": "I think it is an \"illusion\" of control, b/c the ED ends up controlling us, not the other way around.",
      "created_utc": 1582897596.0,
      "score": 11,
      "context": [
        {
          "id": "fj061rg",
          "author": "dmmge",
          "body": "Sometimes it’s a control thing. I have a very busy life and a demanding schedule. My ED is the one source I can control. It’s calming to me to plan out calories and research foods and nutrition facts. I also come from a home that pushed me to be perfect and put a lot of micro-aggressions regarding food and body image in my head as a child.\n\nEveryone’s reasoning for their eating disorder is different, but it’s important to note that there’s often a lot more causes than just the desire to be skinny.",
          "created_utc": 1582890498.0
        }
      ]
    },
    {
      "id": "fj1erra",
      "author": "Stargazergirl11",
      "body": "Thank you, this has opened my eyes a lot. And explains why they combined the eating disorder and trauma units.",
      "created_utc": 1582918554.0,
      "score": 7,
      "context": [
        {
          "id": "fj060ut",
          "author": "None",
          "body": "Tw for trauma \n\n\nI was sexually assaulted as a child, never mentioned it to anyone until I was 18. I start with this because it's the root cause (we think). Growing up I had s lot of mental health issues, but food and body size was never an issue. \n\nAt 18, I was in a toxic home environment, and I didnt notice but I began to eat less. I was just being healthy, or so i thought. A coworker was encouraging me, even introducing me to laxatives. \n\nIt quickly spiraled, I'm not sure how it \"clicked\" but suddenly it was about counting calories, jogging in my room. I felt guilty for eating, like I was doing something wrong. \n\nI move away to university, where everything went downhill. I was so stressed, so depressed, and my trauma was coming back to haunt me. I couldn't deal with anything. \n\nFor me, being small(er) makes me feel safer. I feel guilty for eating. I have extreme anxiety over food and feeling full. It's about the number, in a way, because if its bot lower every day it crushes me. But I never went down this path intending to lose weight to fix my body image. Although I look in the mirror and can point out that I \"can still stand to lose\" weight in certain areas (etc face, thigh, whatdver) I know I look gross to others. But when I eat, everythingcomes back and I get so worked up I cannot function in my life. Anorexia has \"helped\" me survive by reducing my life to nothing, each day the same routine, I'm so exhausted that every day is a struggle to just get through the day. \n\nI hope this helps in some way. I know a lot of people with Ed's have histories of trauma (esp people with bulimia). Its tough.",
          "created_utc": 1582890470.0
        }
      ]
    },
    {
      "id": "fj0at6q",
      "author": "bearthedog3",
      "body": "I think you described it perfectly here. It is so, so *incredibly* hard to understand, while you are in the thick of it, that your brain is actually not working at full function. Often for me, it felt like my brain was feeding me sick, incorrect thoughts that I was *sure* were actually correct. I think having body dysmorphia worsens this as well because it just becomes so hard to decipher reality from what's only in your head.",
      "created_utc": 1582895064.0,
      "score": 8,
      "context": [
        {
          "id": "fj07lrb",
          "author": "workingonselfkind",
          "body": "Feel free to DM- but no. For me it was a control thing. As I lost weight my brain function actually declined and my ability to have insight diminished greatly. I would say the majority of people I have met with EDs are very intelligent in many areas and have insight but in this one area (food, self care, body image) we are quite distorted. It’s also important to point out that many people with EDs have other diagnoses as well- commonly depression, anxiety, SUD, and personality disorders.",
          "created_utc": 1582892152.0
        }
      ]
    },
    {
      "id": "fj1emde",
      "author": "Aphanizomenon",
      "body": "I've written an article recently about this. I think reading it would help you understand but if you click \"Sources\" on the bottom of the article you will also find useful scientific papers on this subject\nhttps://www.steadyhealth.com/articles/i-survived-an-eating-disorder-heres-what-want-i-wish-my-family-and-friends-would-have-known",
      "created_utc": 1582918466.0,
      "score": 2,
      "context": [
        {
          "id": "fj1e87n",
          "author": "Aphanizomenon",
          "body": "Please research this topic before you start your work...I mean reddit is great and first hand experiences can help but it just really seems like you haven't bothered to read one paper, let alone a book. Eating disorders happen as a result of interplay between social, biological and psychological factors and they mean different things to everyone, often a coping mechanism. Some have body dysmorphia and see themself much bigger then they truly are, some don't. For me for example the case wasn't that I didn't realize that I was thin, I just never compared myself to \"normal\" weight people because it seemed to me like the whole world is eating too much and I wanted to be thinner, it made me feel like I am taking control of my life (until it didn't) . And please just before starting your job understand that it's almost never about the looks",
          "created_utc": 1582918240.0
        }
      ]
    },
    {
      "id": "fj1ymq8",
      "author": "oliviared52",
      "body": "Omg. I’m ADHD and until reading this I never thought how it was a factor into my ED but I definitely think it was. When I was starving I could focus so much better. Which to someone without an ED seems counterintuitive, but when my body was starving for a while my focus was so much better. My ED brain told me it was because I was “cleansed” but now my theory is it’s because your body is like “well we couldn’t get food with you feeling how you normally feel so it’s time to kick your brain into overdrive so we don’t die”. Then your hair starts falling out and it’s hard to get out of bed. But times my ED was the worst was when I was doing the best in school. Getting diagnosed and treated for ADHD could’ve been a huge factor in my recovery. Also the fact that it’s hard to focus on anything that doesn’t super interest you with ADHD, and counting calories really interested me. Thanks for posting! You blew my mind lol",
      "created_utc": 1582930750.0,
      "score": 3,
      "context": [
        {
          "id": "fj0dtbo",
          "author": "None",
          "body": "I had (have?) anorexia, and it’s never been about body image. I’ve always been thin and known that. I’m being assessed soon for autism—recent research has shown that a sizeable chunk of anorexic women also likely have undiagnosed autism. \n\nTo me, this makes a lot of sense. My ED developed when I started high school and was overwhelmed by a) having to somehow find/make/plan my own breakfasts and lunches and b) deal with the cafeteria. I couldn’t get a handle on preparing my own food and I avoided the cafeteria due to the chaotic sensory environment.  Not eating meant not having to deal with my classmates or the sensory experience of food, and it made my body/mind feel quieter and calmer. I had rules about amounts/types of food so I always knew what to expect. I love rules. It felt like a game at first, a secret thing I could escape to. \n\nI went vegan overnight to further avoid the pressure to eat unexpected things at family gatherings. Didn’t have a great family environment at home and constantly felt not good enough. I was really good at restricting though. Perfectionism, rigidity, and all-or-nothing thinking are a part of my neurology. \n\nLike others here have been saying, control was a huge part of my ED. I had rules, routines, and a way to avoid things I didn’t know how to handle (people, grocery stores, public eating spaces). It gave me focus—I could hyper-fixate on learning about veganism and nutrition.",
          "created_utc": 1582897463.0
        }
      ]
    },
    {
      "id": "fj2gpry",
      "author": "Stargazergirl11",
      "body": "Wow. Thanks for the info and enlightenment",
      "created_utc": 1582943233.0,
      "score": 2,
      "context": [
        {
          "id": "fj0dtbo",
          "author": "None",
          "body": "I had (have?) anorexia, and it’s never been about body image. I’ve always been thin and known that. I’m being assessed soon for autism—recent research has shown that a sizeable chunk of anorexic women also likely have undiagnosed autism. \n\nTo me, this makes a lot of sense. My ED developed when I started high school and was overwhelmed by a) having to somehow find/make/plan my own breakfasts and lunches and b) deal with the cafeteria. I couldn’t get a handle on preparing my own food and I avoided the cafeteria due to the chaotic sensory environment.  Not eating meant not having to deal with my classmates or the sensory experience of food, and it made my body/mind feel quieter and calmer. I had rules about amounts/types of food so I always knew what to expect. I love rules. It felt like a game at first, a secret thing I could escape to. \n\nI went vegan overnight to further avoid the pressure to eat unexpected things at family gatherings. Didn’t have a great family environment at home and constantly felt not good enough. I was really good at restricting though. Perfectionism, rigidity, and all-or-nothing thinking are a part of my neurology. \n\nLike others here have been saying, control was a huge part of my ED. I had rules, routines, and a way to avoid things I didn’t know how to handle (people, grocery stores, public eating spaces). It gave me focus—I could hyper-fixate on learning about veganism and nutrition.",
          "created_utc": 1582897463.0
        }
      ]
    },
    {
      "id": "fj1wben",
      "author": "oliviared52",
      "body": "So weird to think back on ED thoughts in the thick of it. I remember thinking fasting totally for 14 days would somehow be a step toward recovery 🙄. But to some degree I knew it was wrong since I wanted to hide it. Now that I’m recovered I feel so awful for what I put my loved ones through. But at the time I just thought it was none of their business.",
      "created_utc": 1582929246.0,
      "score": 2,
      "context": [
        {
          "id": "fj07lrb",
          "author": "workingonselfkind",
          "body": "Feel free to DM- but no. For me it was a control thing. As I lost weight my brain function actually declined and my ability to have insight diminished greatly. I would say the majority of people I have met with EDs are very intelligent in many areas and have insight but in this one area (food, self care, body image) we are quite distorted. It’s also important to point out that many people with EDs have other diagnoses as well- commonly depression, anxiety, SUD, and personality disorders.",
          "created_utc": 1582892152.0
        },
        {
          "id": "fj0at6q",
          "author": "bearthedog3",
          "body": "I think you described it perfectly here. It is so, so *incredibly* hard to understand, while you are in the thick of it, that your brain is actually not working at full function. Often for me, it felt like my brain was feeding me sick, incorrect thoughts that I was *sure* were actually correct. I think having body dysmorphia worsens this as well because it just becomes so hard to decipher reality from what's only in your head.",
          "created_utc": 1582895064.0
        }
      ]
    }
  ]
}