{
  "id": "fbhcba",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1583003256.0,
  "title": "Request: my parents are my triggers",
  "selftext": "so i got back from treatment in January and my parents have been horribly overwhelming. im 21 years old and they are treating me like im in high school trying to control my life and EVERYTHING I do. I’m back in school and they constantly get mad at me for staying out too late and want me to come home every weekend. i’ve noticed that the only times i have disordered thoughts or do disordered behaviors is when they are doing this. everytime i’m around them i feel sick and can’t eat nor do i even want to eat. i’m struggling with how i can tell them this in a respectful way. I’m fighting so hard for recovery and they are so supportive but at the same time they have no idea that they are making my ed behaviors worse rather than better....",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fbhcba/request_my_parents_are_my_triggers/",
  "score": 59,
  "num_comments": 8,
  "comments": [
    {
      "id": "fj4c00q",
      "author": "ElfjeTinkerBell",
      "body": "Can you discuss this with your therapist? Maybe have a conversation with your therapist and parents together?\n\nI feel like your parents are willing to protect you and simply doing that wrong..",
      "created_utc": 1583004805.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fj4ppz0",
      "author": "whisperinglight",
      "body": "They are holding on too tight. You gave them a scare and they are terrified what might happen. I don’t understand what triggered this in the first place and therefore I don’t know if it will happen again. What did we do wrong?  perhaps we weren’t there for you ? did we miss the signs ? We almost lost you and now if we hold on so tight maybe  you won’t fall again. Are we holding too tight ? Are we smuggling you . We don’t know what to do.",
      "created_utc": 1583013925.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fj4tuni",
      "author": "None",
      "body": "Maybe write a letter saying it? It might help getting your point across and it'll be easier to choose your words instead of doing so at the moment.",
      "created_utc": 1583016755.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fj4ybkf",
      "author": "kbozek",
      "body": "You are not alone!! I feel myself slipping into disordered habits around my parents bc they just don’t understand what we go through. It seems hard but you need to look out for what the best thing is for you. Only you understand what your body truly needs to be healthy. Continue to push on because you’re worth it!!",
      "created_utc": 1583019827.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fj5dav4",
      "author": "zrex05",
      "body": "Yep, it's \"you know that we are here to support you\" but also\n\nWon't shut up about food.\n\nConstantly asking me for weight loss advice (as if I'm a damn specialist)\n\nOffering me food, and for whatever reason being very persistent about it \"Oh come on, you gotta try this!\" Like how about no\n\nAngry when they notice I'm upset near food\n\nIntently watching me (try to) eat\n\n(I love them to death but jfc)",
      "created_utc": 1583029946.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fj4x448",
      "author": "eatingissad",
      "body": "i’ve experienced something similar with your situation too. Since my siblings moved out when i was younger, i used to do all these disordered behaviors when i was with my controlling mother too. Constantly told my therapist about it and we had a few sessions with therapist and the family that this is how i felt and how its affecting me but my mother never listened, she couldnt change at all despite how much it affected me. Aaaand she didnt believe a word my therapist said. I can tell she was in denial and scared but she wouldn’t tone it down? or calm the controlling? Idk :(( anyway, i then decided it was just really time to move out bc it was no help for my well-being at all. Moved in with my boyfriend (w/ lots of complications from my mother) when i was 19 and now im 21 and still have these thoughts and disordered behaviors but waaaaaay lesser and a lil more healthier than before.\n\nBut this isnt to say that you should move out too, just sharing that this is how i got through mine :) bc my mother was incapable of change is all. I do hope that soon your parents understand how their actions are affecting your mental health! You can start by telling your therapist!! If you already have and its not helping, you can tell your parents calmly about it. I hope it helps.",
      "created_utc": 1583018996.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fji9xxy",
      "author": "None",
      "body": "Omg I can totally relate in a similar way, but it’s not about my parents, but my aunt and grandma who are constantly preoccupied in constantly checking in on me what time I’ll be home and it makes me stressed. This is partially the reason why I moved out, as hard as living in a student apartment was that is 30 minutes from home, at the same time, it’s also allows me to focus on myself and well-being especially on nights when I get out late from work and want to hit the gym after work and actually have time to prepare my meals and focus on my school work. No one said moving out would be easy, especially graduate school but it’s necessary when you have family members always on your case, no offense, I respect them dearly but I’m doing the best I can in trying to become a better person. Hope this helps, the struggle is real, we’re in this together. I even had thoughts about moving back in with my family, but they took as it was a sudden move and I only did it to rebel against them. My boyfriend broke up with me after 9 months because it was emotionally stressful, aside from the fact that we had too many differences, now the question remains should I move back or how do I tell my family to respect my privacy and not to worry? This is just physically draining.",
      "created_utc": 1583363189.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fjc7uv9",
      "author": "lwaikart",
      "body": "Very much this. If you’re living with parents,  family therapy is crucial to creating a living environment conducive to recovery.",
      "created_utc": 1583211010.0,
      "score": 2,
      "context": [
        {
          "id": "fj4c00q",
          "author": "ElfjeTinkerBell",
          "body": "Can you discuss this with your therapist? Maybe have a conversation with your therapist and parents together?\n\nI feel like your parents are willing to protect you and simply doing that wrong..",
          "created_utc": 1583004805.0
        }
      ]
    }
  ]
}