{
  "id": "fc47a9",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1583111877.0,
  "title": "Request: Anorexia is ruining the relationship between me(26, F) and my sister(24, F)- any advice?",
  "selftext": "Hi firstly title says it all. In brief, I was hospitalised for anorexia a few years ago and after maybe 6-7 years would say I’m pretty much recovered mentally and physically - it has taken a lot of strong will and I’m proud of myself! \n\nI posted previously with a concern that my sister (very sporty, runner etc) was losing weight and I had noticed this and was concerned she may be developing some disordered eating habits. The responses were mainly saying that I was being hyper aware and overly obsessed with regards to eating habits (understandably) when in fact it could simply be a healthy weight loss. I accepted this may well be true and tried to ignore my concerns. \n\nFast forward another few months and my sister admits to struggling with eating via text to myself(and asks for help from me!) and she is now clearly underweight and starting to look ill. I feel vindicated by this after previous responses but in all honesty, I wish I had been being a bit psycho (!) and hoped nothing was up- sadly this isn’t the case. \n\nI’m mainly looking for any advice on how to deal with this... my parents are trying to book a family holiday in a few months- I have just seen my sister and there is no way I can spend any length of time around her without feeling angry and hugely triggered by the whole situation. I don’t want to risk my own health when I am doing so well currently. I also don’t want to speak my mind to my sister too much as I know when I was ill, I loved people noticing I was underweight (barmy I know but that was how this mental illness manifested itself in me and I’m very wary of this. I don’t want to bring attention to her weight too much if I can help it). Secondly, any advice on how to tell my parents a holiday is off the cards without breaking my sisters confidentiality? I love her dearly and do not know how to act around her/towards her to stop this lasting 6 years like it did with me. I’m at a loss because I recognise there is nothing anyone could have said to prevent my decline all those years ago. I am unfortunately not going to see her until she is better and this may be many years and this saddens me...",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fc47a9/request_anorexia_is_ruining_the_relationship/",
  "score": 42,
  "num_comments": 6,
  "comments": [
    {
      "id": "fj8kh2k",
      "author": "Gooe_girl",
      "body": "I’d be honest with your parents and do what you gotta do to stay on the path your on now. I know those can be extremely triggering events and really can fuck up your mindset when trying to get better :/  but none the less everything’s ganna be ok❤️",
      "created_utc": 1583115499.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fj8we8u",
      "author": "isabloop",
      "body": "Unfortunately, this seems to be currently happening with me and my sister (both 16F). I would say try to talk to her as much as possible, but let her know that this may be triggering for you and maybe set some boundaries? E.g no mentions of weight or how much she has/hasn't eaten or how much she's exercised. Whatever may trigger you.\n\nThe fact that she has started talking to you is an absolutely great start, and I wish my sister was as open as yours. I would try and share experiences, and maybe say things that you wish people said to you when you were sick. Your past experiences, though very sad, may be vital in helping her recover. To me, there is nothing better than someone just understanding what you are going through.\n\nAs for the frustration, omg i cannot relate more. My mother (52F) is also showing ED symptoms, and it is so easy for us to get angry with each other accusing each other of eating less than the other. It is so much easier said than done but remember you were in her place once, and you may get angry, but you are angry at the anorexia, not her. Try to make that work in your favour maybe? You're saving her from something you have already been through.\n\nI wish you the very best, my DM's are always open",
      "created_utc": 1583124093.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fj996z7",
      "author": "lupoverde",
      "body": "I have the same with a current best friend&house mate. I’m in recovery (and seeing a therapist) whilst she is losing weight and saying things like “omg I’m so full!!” after only having like 2 bites of dinner. It’s frustrating, I hate it, I’ve had to leave the room before because of it. And we used to cook & eat together but I can’t anymore because it’s so triggering to eat like a whole bowl of pasta whilst she stops after a few bites. So basically I get what you’re saying and you’re totally valid. I’m sorry it’s gotten like this :/ \n\n My first advice is to take a step back and don’t be involved in her recovery process. It sounds like you’re already doing that, which is great. She can reach out (hopefully) to other friends for help and support, and you aren’t in a place to help her because of your history and that’s FINE. Her actions will make you feel worse etc etc so it’s better just to stay out of it. You are not responsible for her recovery. I’d suggest for her to go to a therapist, but only when she’s ready to hear that of course. \n\n  I think the family holiday stuff is really tricky. Have you already said that you’ll go? I think you can come up with an excuse for it, like saying that you wanted to use the summer to go travelling with other friends or something (but then you actually have to follow that through otherwise it looks suspicious). It’s hard because you can tell your parents that you had a falling out or something, but then they will probably ask her about it. I think if you’re planning on avoiding her until she’s recovered anyway, then you can tell your sister that you don’t want to go on holiday because it’s triggering for you. And then maybe tell your parents a lighter version of the truth like “we had a fall out”. But I’d warn your sister that you’ll tell them an excuse like that, so then she doesn’t over react when she hears it from your parents. I know you said you don’t want to bring any attention to her disorder because she might react positively, but if she sees that she’s hurting someone dear to her( to the extent that you can’t be around her), then she might think twice about what she’s doing. We all know that this mental ill was destroys your life and your friendships and unfortunately this is just how it goes. It sounds harsh but we’ve all been there. \n\n  The truth hurts but sometimes it’s the only way to do it :( but I totally understand why you don’t want to go on that holiday. And you shouldn’t if it will be really detrimental to you.\n\nEdit: I don’t know how your parents are, if they are the supportive type or not, but if I had a child and they went through an eating disorder then I would want to know. It would kill me to think that my daughter was struggling and I had no idea. I’d also encourage them to talk about it, but yeah, only if it doesn’t make things worse.",
      "created_utc": 1583137674.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fj8gfmq",
      "author": "Aphanizomenon",
      "body": "I do not get it... You are angry with your sister because she's developing AN?",
      "created_utc": 1583112812.0,
      "score": -4,
      "context": []
    },
    {
      "id": "fj9grsv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1583147771.0,
      "score": 2,
      "context": [
        {
          "id": "fj8we8u",
          "author": "isabloop",
          "body": "Unfortunately, this seems to be currently happening with me and my sister (both 16F). I would say try to talk to her as much as possible, but let her know that this may be triggering for you and maybe set some boundaries? E.g no mentions of weight or how much she has/hasn't eaten or how much she's exercised. Whatever may trigger you.\n\nThe fact that she has started talking to you is an absolutely great start, and I wish my sister was as open as yours. I would try and share experiences, and maybe say things that you wish people said to you when you were sick. Your past experiences, though very sad, may be vital in helping her recover. To me, there is nothing better than someone just understanding what you are going through.\n\nAs for the frustration, omg i cannot relate more. My mother (52F) is also showing ED symptoms, and it is so easy for us to get angry with each other accusing each other of eating less than the other. It is so much easier said than done but remember you were in her place once, and you may get angry, but you are angry at the anorexia, not her. Try to make that work in your favour maybe? You're saving her from something you have already been through.\n\nI wish you the very best, my DM's are always open",
          "created_utc": 1583124093.0
        }
      ]
    },
    {
      "id": "fj8igge",
      "author": "None",
      "body": "She's not angry with her, she's frustrated with the situation because her sister is triggering and threatening her own recovery process.",
      "created_utc": 1583114151.0,
      "score": 25,
      "context": [
        {
          "id": "fj8gfmq",
          "author": "Aphanizomenon",
          "body": "I do not get it... You are angry with your sister because she's developing AN?",
          "created_utc": 1583112812.0
        }
      ]
    },
    {
      "id": "fjbme80",
      "author": "isabloop",
      "body": "Well that’s alright! If there’s one thing I’ve learned about ED recovery is to always put yourself first. Maybe give some advice to her friends then or parents to just look out for her. You certainly should not take it upon yourself or feel obliged to help her, recommend her to find professional help. All the best :)",
      "created_utc": 1583196576.0,
      "score": 2,
      "context": [
        {
          "id": "fj8we8u",
          "author": "isabloop",
          "body": "Unfortunately, this seems to be currently happening with me and my sister (both 16F). I would say try to talk to her as much as possible, but let her know that this may be triggering for you and maybe set some boundaries? E.g no mentions of weight or how much she has/hasn't eaten or how much she's exercised. Whatever may trigger you.\n\nThe fact that she has started talking to you is an absolutely great start, and I wish my sister was as open as yours. I would try and share experiences, and maybe say things that you wish people said to you when you were sick. Your past experiences, though very sad, may be vital in helping her recover. To me, there is nothing better than someone just understanding what you are going through.\n\nAs for the frustration, omg i cannot relate more. My mother (52F) is also showing ED symptoms, and it is so easy for us to get angry with each other accusing each other of eating less than the other. It is so much easier said than done but remember you were in her place once, and you may get angry, but you are angry at the anorexia, not her. Try to make that work in your favour maybe? You're saving her from something you have already been through.\n\nI wish you the very best, my DM's are always open",
          "created_utc": 1583124093.0
        },
        {
          "id": "fj9grsv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1583147771.0
        }
      ]
    }
  ]
}