{
  "id": "fd3sdj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1583278678.0,
  "title": "Request: Do you ever really feel \"recovered\" from an eating disorder?",
  "selftext": "hi all, i hope this is the right place to ask this. i am going to try to not be super specific to not be triggering.\n\ni was in a treatment centre for anorexia from the age of 12 to about 15. i convinced the treatment centre i was at i was better and didn't need any more therapy. i was 100% lying, but i hated the centre so much and i had panic attacks every time i had to go.\n\nover the next couple years, i still struggled a lot with my body image but i became weight-restored. my family and friends all stopped worrying about me, i even went through a stint in grade 11 where i gained a lot of weight. i was horrified when i went to the doctor and saw the number and lost the weight through calorie counting and exercising a lot.\n\nthe thing is throughout this whole time, i still felt very similarly to how i felt when i was younger and struggling. in terms of body-image, guilt, restrictive patterns, etc.\n\ni am now 20, and this past year was a tough one. i was eating in an extreme deficit, back on my ed twitter account, taking constant bodycheck photos, etc. i lost weight and the people in my life noticed. but i felt like a fraud, like even though i was doing restrictive behaviours i felt like my illness wasnt valid and i was just going through a phase or something.\n\ni am trying to take care of myself now and not over-restrict to lose weight. but it's very hard for me to not slip into my old ways of restriction. \n\ni guess i am  confused about what recovery means. when you are fully and legitmately recovered, do you never get these feelings again? does my relapse mean that i was never recovered in the first place? i wish i could understand these feelings, i am so frustrated at hating my body and myself so much that this is how i treat myself. \n\nthank you all for listening, i hope you stay safe <3",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fd3sdj/request_do_you_ever_really_feel_recovered_from_an/",
  "score": 53,
  "num_comments": 25,
  "comments": [
    {
      "id": "fjewho8",
      "author": "None",
      "body": "Ok first off to answer your question, for me in my personal experience, I don't think it's possible to ever get to a point like you never had an eating disorder, but with work and therapy and lots of food, you can get to a point where you're happy and you live a good life. Also by centre do you mean centre Syracuse? Sorry I just went there and thought maybe you might be someone else who went there",
      "created_utc": 1583279510.0,
      "score": 33,
      "context": []
    },
    {
      "id": "fjewde2",
      "author": "None",
      "body": "I'm currently in recovery for the millionth time. I know how you feel. I've had an Ed since I was young and I only got diagnosed 2 years ago. And I've been trying to gain weight, I struggle a lot due to extreme body dysmorphia. I have now gained weight but I'm not weight restored. My Ed nurse told me even when you're recovered fully you can always have Ed related thoughts, especially in stressful events. Recovery isn't a straight line unfortunately, it comes with many breakdowns and relapses. But hopefully when you learn to have a healthy relationship with food, the Ed related thoughts should die down, I don't purposely restrict anymore or take laxatives, but I do struggle to eat due to anxiety and lack of appetite ( even if I haven't ate). I used to binge eat a lot, before my eating habits turnt bad. I know how to have a good relationship with food but it is hard, I understand that completely. I know you'll be able to overcome this, take your time and don't rush eating etc. I hope you're well 💕",
      "created_utc": 1583279450.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fjey4p1",
      "author": "canyonlands2",
      "body": "First off, I’m sorry to hear you are still struggling so much.\n\nI developed an ED when I was really young, and I’ve spent most of my life having it or having thoughts related to it. The truth is it feels like part of my ED is always going to be with me, at least intrusive thoughts that came with it and the guilt with it too. But my ED does NOT have to be my identity and it doesn’t have to have control over my life.\n\nYou can get better, even if there’s lows where you still feel like it’s front and center page.",
      "created_utc": 1583280374.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fjezpxq",
      "author": "pennybeagle",
      "body": "Yes and no. I feel recovered in the sense that I recognize that my eating disorder caused more harm than good to my body. I don’t think much anymore about restricting insulin (diabulimia) in order to lose weight when I eat something I know isn’t good for me or have been gaining weight, and I certainly don’t act on those thoughts if I do.\n\nI do not feel I’m recovered because I still tie my worth to my weight to a certain extent.\n\nRelapse does not mean you failed as long as you want to continue to try to get better.\n\nYour eating disorder will be your past, and you will probably regret it. But you can’t change the past. All you can do is do better moving forward into the future and try to help someone in the situation you were once in.\n\nI hope you find a way to heal and am sorry to hear you’re struggling so much.",
      "created_utc": 1583281254.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fjf7cgr",
      "author": "None",
      "body": "The way I'd describe my experience of recovery is that the thoughts don't go away, but I can separate \"normal\" thinking from \"ed\" thinking. Like, the thoughts still pop up, but when I'm in a good state of mind, I can recognize it as \"the ed voice,\" and sort of say to it, \"I know your tricks. I'm not going to listen to you.\" If that makes sense. The disorder is still with me but it doesn't have the same power over me.\n\nI'm so sorry you've been struggling this long. My experience with anorexia was relatively short-lived compared to yours (although I would say I've had a disordered relationship with food and body image for most of my life). My experience may not be the same.",
      "created_utc": 1583285846.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fjfbf3c",
      "author": "rbateson",
      "body": "So I’ve been in recovery for almost 15 years and I can say yes you can almost fully recover. I still have things that trigger me and still freak out sometimes about the number on the scale or tight close or a new relationship. But I honestly feel like my relationship with food is the best it’s been. I have little anxiety around food and numbers. I *almost* feel normal.\n\nI had my ups and downs and full relapses and slight regressions. I was in treatment on and off for 10 years.  \n\nI’m not saying it will take 15 years to feel this way but it may. Just keep doing the next right thing. Life is very sweet.",
      "created_utc": 1583288289.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fjf7dy9",
      "author": "pendgame",
      "body": "Thanks for asking this; I'm really curious to read the other responses.\n\nI see it this way: I'm also someone who went through cancer, and the usual way to explain that situation isn't to say I'm cured, but to say that I  have no evidence of disease. I do not have cancer. On the other hand, I may not be binging or purging -- I have no *external* evidence of disease -- but in the way my mind works, my ED is still there. The urges still crop up. I have to be careful of triggers. I recognize some behaviors as dangerous. Whether or not I'm acting on it, I still have an eating disorder. \n\nI'm hoping that will change, but this life, with an ED that is controlled, is a good life. It requires self-awareness and occasional course corrections, but those get easier with time and this is manageable. Hang in there!",
      "created_utc": 1583285871.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fjfn1qw",
      "author": "HoldUp--What",
      "body": "A bit of hope. \n\nYes. I feel truly recovered. I probably have about as many, or possibly even fewer (because I've trained myself to recognize that line of thinking in myself) body-hate moments compared to the average person. \n\nI've been in a solid state of recovery for almost 5 years now after nearly a decade with eating disorders. My last real relapse only lasted 1 weekend and it was over two years ago. I purged all weekend, told my boyfriend (now husband), he helped me through a couple weeks of bad thoughts.\n\nNow, a few months ago (when I joined this sub) I had a couple weeks where I thought I was going to relapse. Anxiety has always diminished my appetite, I was dealing with PTSD treatment at the time, it was a bad time. But I got through it none the worse. And honestly, I think I have a healthier relationship with food and my body. \n\nI've really leaned in to the idea of radical self acceptance the last several years. I had to. I had gotten pregnant with my son (my motivation to truly recover), I couldn't risk the pregnancy, I had to learn how to deal with a rapidly growing and changing body.\n\nAre there things I'd change about my body? Hell yeah. Is having the aesthetic I want worth losing everything my body can *do* and risking more health complications and making myself miserable? Fuck no. So I accept my body as it is. I'm not super in love with it, like oh yeah I'd fuck me lol. But who is? I respect my body for what it can do and am mostly \"meh\" about the way it looks. I'm not a big fan, but it's whatever. I've taught myself (with a lot of therapy and a lot of repetition) that how I look really only matters to me, and I choose to let everything else in my life matter more.",
      "created_utc": 1583295259.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fjfm6nh",
      "author": "Dustette",
      "body": "I had an ED for 20 years, thought it was impossible to recover.\n\nI can now say I have been fully recovered after years of relapses and thinking that was as good as it gets.\nFull recovery is possible and yes you’re always aware of a decision that could make you relapse but relationship with food can be healed and have no more rules around it. I only worry sometimes about what if I relapse because I joined a new gym or something but it never happens anymore and I have also healed all the emotional issues that were leading me to resolve to an eating disorder in the first place.\n\nDon’t settle, keep up the good fight.",
      "created_utc": 1583294720.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fjfqbry",
      "author": "stay_rad23",
      "body": "Like others have said the thoughts are still there, but I'm able to acknowledge that they will not make me happy. I don't have nearly as many as I did when I first started recovery. In times when I feel more anxiety then normal I have to remind myself to keep my shit together. I have more \"ed\" thoughts during these times. Honestly, after recovery I care a lot about my hair. How long it is and how it looks. Maybe I've traded one obsessive behavior for another, but one is self care while the other was killing me.",
      "created_utc": 1583297471.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fjfrd4l",
      "author": "None",
      "body": "I’m also in my twenties and have been through a lot eating disorder wise. I lost around 5 years of my adolescence to my eating disorder. I truly believed in my darkest moments that it was going to kill me, I had even accepted it and almost wanted it to kill me because I felt so incredibly hopeless in my situation. I required so many services during my illness, ER visits, Inpatient, Outpatient, Social workers involved, feeding tubes, heart monitors,... Basically, I was told that it was a shame that I had gotten treatment so late by one of my many psychiatrists. After turning 18 for a while, I was cut off from the services that helped me stay alive during my teens. I relapsed but then I decided... it was time to recover. Nowadays, I won’t say I’m completely like I used to be. The shadow of your experiences always looms over you but I eat what I want and when I want. I don’t count calories. I don’t binge, restrict or purge. I don’t compare my body to every other girl in the room to see if I’m smaller. I don’t feel like I need to be a specific weight to be worthy, in fact I’m weight restored and I love my body so much more. Essentially, every few months I might notice I’m not eating enough because of stress and I’ll adjust and catch myself. I am cautious and make sure that I eat enough and am eating what I want but never do I restrict or feel like I am starving my body purposefully of nutrients. I am happy and I am recovered. Some days aren’t perfect but 95% of the time I am. I think one day you can get there.",
      "created_utc": 1583298215.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fjfro7z",
      "author": "None",
      "body": "I don’t know if full blown recovered is a thing, in my opinion recovery is constantly a process. Which can feel very exhausting and daunting but I’ve also learned to channel the determination I used to put into my ED into recovering from it. \n\nTo me (and it’s probably different for everyone) it’s the little things that mean the most. Being able to eat popcorn when I go to the movies, listening to my body when it craves something, having a little more energy, the way my skin cleared up- it’s small things I focus on that mean recovery to me. Maybe there are people out there who just flip a switch and one day their ED is in the past, but I think for most of us it’s about doing what you can with what you have.  And realizing that baby steps and time are the best weapon. I want things to happen so fast, and I start getting dejected when I realize I’m still so far from all of my goals- but then my therapist or my boyfriend reminds me of how far I’ve come in the past 2 years. All of that has been a slow and steady climb, not a sprint. \n\nI also want to say I’ve had other treatment experiences where I thought I was in recovery and I 100% wasnt- you have to learn, often with trial and error, what exactly it means for you and how to get there. The best advice I can give is to find a therapist that really, truly gets you and helps you, and stick with them. Therapy saves lives!",
      "created_utc": 1583298444.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fjg4ita",
      "author": "teriyakigirl",
      "body": "I would say maybe never 100% recovered, but there are times when I feel 99% recovered. Typically I range from 70 to 90% recovered.... Haven't had a REAL relapse in like 5 years.",
      "created_utc": 1583311119.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fjgh2fi",
      "author": "None",
      "body": "This thread filled me with so much hope! \n\nI realized I have downplayed a lot of my recovery. As a perfectionist (aren't we all in some way, shape or form on this account?) I thought the only way to \"recover\" was to completely stop Ed. Hearing that he pops up, and being able to identify him and seeing that as recovery has me feeling stronger than ever and willing to take on a new day. \n\nBless everyone for sharing and keep growing.",
      "created_utc": 1583326380.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fjgkfva",
      "author": "oliviared52",
      "body": "Been recovered for almost 4 years and I would say I feel like I have better relationship with food than most people who have never had an eating disorder. Because I am very in tune with my body for what it is craving, when I’m hungry, when I’m full etc. \n\nThat said, when I get stressed those thoughts definitely back. You are not a fraud. And it sounds like you are still better off from where you started. Which is not to say “oh your fine don’t worry about it” but it’s to say that recovery comes with ups and downs. So you may be having a set back, but you are still in recovery. I kind of think recovery never ends since this is how we have coped with things in the past so we need to be cognizant of it. \n\nThis sounds weird, but something that really helped me was to give my eating disorder a name. I chose Edna, real original I know. But I did it because I didn’t want to just try and suppress my ED thoughts. But I wanted to recognize them for what they were. So when I had or have weird food or body image thoughts, I ask myself is this me talking or is this Edna? And after a while she became kinda like an annoying or kinda abusive friend where it was like “yeah ok Edna that’s terrible advice but thanks for speaking up I guess”. I know it sounds kinda weird but it helped. Really proud of you for recognizing you’ve slipped back into old habits.",
      "created_utc": 1583329123.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fjgxzex",
      "author": "None",
      "body": "Recovery is certainly possible. Without a doubt, it takes a lot of time, energy, determination and most importantly, a good network of support with professional help.\n\nBecause eating, or the lack of eating is so vital to our existence as humans, recovery is a muddied image. We're constantly exposed to the things that trigger us. This isn't like alcohol where I can excise it from my life completely and isolate myself from most triggers. Food isn't something I can just say no to – after all isn't that the root of the issue?\n\nBut that isn't a sign of despair. I'm recovered now after going way down the path of ED, and I've mostly made peace with the fact that it's always going to be a part of me. Like some others, it's not my identity anymore though. Through therapy, I have learned to effectively challenge my ED-related thoughts and manage it. It doesn't control me and it doesn't make my life a constant battle. Will I ever go back to how my life was before I had this disorder? No, certainly not, but am I happy with my life? Yes.",
      "created_utc": 1583337743.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fjtdwts",
      "author": "phebe_want",
      "body": "Hey.\nSo I’ve been ‘fully recovered’ for 2 years now and I’m still the same weight (a bit heavier) when I was classified as ‘weight restored’, but I still have a huge fear of food. I’m always trying to eat less when I can, but it’s hard because I’m a competitive athlete and I have to fit into a weight category. \nI don’t really know if I can give you any advice, because I’m having the same problem. I just want you to know that you’re not alone in this. I still don’t think I’m fully recovered, and still classify myself as anorexic. \nI’m getting therapy soon and I have an amazing family and boyfriend who support me. I hope one day I won’t have a fear of food anymore.\nStay strong x",
      "created_utc": 1583606854.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fk3wep8",
      "author": "hyperchondriac93",
      "body": "I did for a good 7 or so years until I got sick again and it all cropped up. I’m just hoping I can get back to that...",
      "created_utc": 1583847970.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fjf21wg",
      "author": "None",
      "body": "oh boy, that’s ironic! i went to center syracuse too a few years ago. spent so many months there",
      "created_utc": 1583282633.0,
      "score": 3,
      "context": [
        {
          "id": "fjewho8",
          "author": "None",
          "body": "Ok first off to answer your question, for me in my personal experience, I don't think it's possible to ever get to a point like you never had an eating disorder, but with work and therapy and lots of food, you can get to a point where you're happy and you live a good life. Also by centre do you mean centre Syracuse? Sorry I just went there and thought maybe you might be someone else who went there",
          "created_utc": 1583279510.0
        }
      ]
    },
    {
      "id": "fjf0s4i",
      "author": "MissRiss918",
      "body": "This. I too feel like the ED will always be “a part” of me. I just no longer feel the ED is my identity. I’ve been in solid recovery (with a recent lapse) for the better part of 5 years. I still struggle with thoughts, and as mentioned I had a minor lapse, but I no longer give into those thoughts on the regular. \n\nRecovery gave me my life back. I was able to figure out who I am outside of food and size.\n\nGood luck!",
      "created_utc": 1583281864.0,
      "score": 4,
      "context": [
        {
          "id": "fjey4p1",
          "author": "canyonlands2",
          "body": "First off, I’m sorry to hear you are still struggling so much.\n\nI developed an ED when I was really young, and I’ve spent most of my life having it or having thoughts related to it. The truth is it feels like part of my ED is always going to be with me, at least intrusive thoughts that came with it and the guilt with it too. But my ED does NOT have to be my identity and it doesn’t have to have control over my life.\n\nYou can get better, even if there’s lows where you still feel like it’s front and center page.",
          "created_utc": 1583280374.0
        }
      ]
    },
    {
      "id": "fjf2jxu",
      "author": "None",
      "body": "I can eat with more ease now, but due to a health condition I have it makes eating more of a challenge and it's making it harder to recover, and I understand what you mean by that, my Ed was my identity at one point but now I feel more in control of my eating which is a good thing",
      "created_utc": 1583282937.0,
      "score": 3,
      "context": [
        {
          "id": "fjey4p1",
          "author": "canyonlands2",
          "body": "First off, I’m sorry to hear you are still struggling so much.\n\nI developed an ED when I was really young, and I’ve spent most of my life having it or having thoughts related to it. The truth is it feels like part of my ED is always going to be with me, at least intrusive thoughts that came with it and the guilt with it too. But my ED does NOT have to be my identity and it doesn’t have to have control over my life.\n\nYou can get better, even if there’s lows where you still feel like it’s front and center page.",
          "created_utc": 1583280374.0
        }
      ]
    },
    {
      "id": "fjf23wp",
      "author": "None",
      "body": "Do you remember dr wohlers?",
      "created_utc": 1583282668.0,
      "score": 2,
      "context": [
        {
          "id": "fjewho8",
          "author": "None",
          "body": "Ok first off to answer your question, for me in my personal experience, I don't think it's possible to ever get to a point like you never had an eating disorder, but with work and therapy and lots of food, you can get to a point where you're happy and you live a good life. Also by centre do you mean centre Syracuse? Sorry I just went there and thought maybe you might be someone else who went there",
          "created_utc": 1583279510.0
        },
        {
          "id": "fjf21wg",
          "author": "None",
          "body": "oh boy, that’s ironic! i went to center syracuse too a few years ago. spent so many months there",
          "created_utc": 1583282633.0
        }
      ]
    },
    {
      "id": "fjgrdzt",
      "author": "canyonlands2",
      "body": "Thank you! I feel like it’s pretty relatable for most people who have struggled with an ED to have a hard time in recovery because of associating it with your identity. I find it hard as mine started when I was young and hit hardest when I’m a teenager. It was part of who I was for so long that in a way it’s a safety net to revert to.\n\nI hope you stay in recovery and you can find a peace in this world",
      "created_utc": 1583333874.0,
      "score": 1,
      "context": [
        {
          "id": "fjey4p1",
          "author": "canyonlands2",
          "body": "First off, I’m sorry to hear you are still struggling so much.\n\nI developed an ED when I was really young, and I’ve spent most of my life having it or having thoughts related to it. The truth is it feels like part of my ED is always going to be with me, at least intrusive thoughts that came with it and the guilt with it too. But my ED does NOT have to be my identity and it doesn’t have to have control over my life.\n\nYou can get better, even if there’s lows where you still feel like it’s front and center page.",
          "created_utc": 1583280374.0
        },
        {
          "id": "fjf0s4i",
          "author": "MissRiss918",
          "body": "This. I too feel like the ED will always be “a part” of me. I just no longer feel the ED is my identity. I’ve been in solid recovery (with a recent lapse) for the better part of 5 years. I still struggle with thoughts, and as mentioned I had a minor lapse, but I no longer give into those thoughts on the regular. \n\nRecovery gave me my life back. I was able to figure out who I am outside of food and size.\n\nGood luck!",
          "created_utc": 1583281864.0
        }
      ]
    },
    {
      "id": "fjgrnd3",
      "author": "canyonlands2",
      "body": "I’m glad to hear you have more ease now. I’m sorry to hear you have a medical challenge to face. It it’s something that will pass, I hope you get better soon. If it’s something permanent, I still hope you feel better, but if that’s not possible, I hope there’s a way to for you to get to where you need to go",
      "created_utc": 1583334039.0,
      "score": 2,
      "context": [
        {
          "id": "fjey4p1",
          "author": "canyonlands2",
          "body": "First off, I’m sorry to hear you are still struggling so much.\n\nI developed an ED when I was really young, and I’ve spent most of my life having it or having thoughts related to it. The truth is it feels like part of my ED is always going to be with me, at least intrusive thoughts that came with it and the guilt with it too. But my ED does NOT have to be my identity and it doesn’t have to have control over my life.\n\nYou can get better, even if there’s lows where you still feel like it’s front and center page.",
          "created_utc": 1583280374.0
        },
        {
          "id": "fjf2jxu",
          "author": "None",
          "body": "I can eat with more ease now, but due to a health condition I have it makes eating more of a challenge and it's making it harder to recover, and I understand what you mean by that, my Ed was my identity at one point but now I feel more in control of my eating which is a good thing",
          "created_utc": 1583282937.0
        }
      ]
    },
    {
      "id": "fjf252c",
      "author": "None",
      "body": "of course. private message me if u wanna gossip lol",
      "created_utc": 1583282688.0,
      "score": 5,
      "context": [
        {
          "id": "fjewho8",
          "author": "None",
          "body": "Ok first off to answer your question, for me in my personal experience, I don't think it's possible to ever get to a point like you never had an eating disorder, but with work and therapy and lots of food, you can get to a point where you're happy and you live a good life. Also by centre do you mean centre Syracuse? Sorry I just went there and thought maybe you might be someone else who went there",
          "created_utc": 1583279510.0
        },
        {
          "id": "fjf21wg",
          "author": "None",
          "body": "oh boy, that’s ironic! i went to center syracuse too a few years ago. spent so many months there",
          "created_utc": 1583282633.0
        },
        {
          "id": "fjf23wp",
          "author": "None",
          "body": "Do you remember dr wohlers?",
          "created_utc": 1583282668.0
        }
      ]
    }
  ]
}