{
  "id": "fef50e",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1583508972.0,
  "title": "A subreddit for transgender people with an ED.",
  "selftext": "Hi all! \n\nI noticed a lot of transgender individuals posting in the main ed subs. As a trans man myself, i felt like it would be beneficial to have another safe space for us all within the reddit ED community.\n\nI created r/transED to accomplish just that. It will be a strictly pro-recovery environment for trans people to discuss and vent about their struggles with disordered eating, especially in relation to their gender dysphoria.\n\nI really hope this sub is able to grow and blossom! Thank you to everyone who joins.\n\n\nps: memes ARE allowed!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fef50e/a_subreddit_for_transgender_people_with_an_ed/",
  "score": 78,
  "num_comments": 5,
  "comments": [
    {
      "id": "fjnq7qv",
      "author": "Krisloveskat",
      "body": "I am sure you don’t know me, but I have been an Activist/Advocate for LGBTQ+ identifying people with eating disorders for quite sometime. Actually I founded and ran a nonprofit all on my own, Mira Alto Foundation, that’s purpose was to vet all residential and inpatient Eating Disorder Facilities to make sure they new how to properly care for this group of people and that it was done with dignity and respect.\nYou would think this wouldn’t be necessary in 2020, but we have a long way to go!\nUnfortunately I had to shut Mira Alto Foundation down due to lack of funds and broken promises.\nJust contact me if you need help!",
      "created_utc": 1583512450.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fjol0g4",
      "author": "merceec",
      "body": "I appreciate you so so much!!! Omg! THANK YOU!",
      "created_utc": 1583529878.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fjnsygs",
      "author": "transparentspruce",
      "body": "this is wonderful, as a trans woman with an ed\\~",
      "created_utc": 1583513846.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fjoawps",
      "author": "Spacemilk",
      "body": "You are a good and kind person for providing this support to people who need it ❤️",
      "created_utc": 1583524094.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fjoqrm3",
      "author": "kuroearia",
      "body": "I'm not trans myself but this is a great idea, hope it goes well!",
      "created_utc": 1583533012.0,
      "score": 3,
      "context": []
    }
  ]
}