{
  "id": "fgbgxm",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1583834572.0,
  "title": "Request: My SO won't accept our break up for my Recovery.",
  "selftext": "I recently shared how my boyfriend had told me I had gained weight and how that has significantly contributed to a relapse in my recovery. Very fortunate to have a great therapist & friends around me - however after thinking through my circumstances decided to call it off with this guy & focus all my energy on to my self & my recovery - for the first time ever, woo! \n\nBUT - the conversation was so heavy and manipulative. He did everything in his power to make me feel like I'm not stable and it's a \"phase I'm going through\". He said things like -\n\n\n• \"if you choose to leave me I won't stick around, you'll never see me again and I will not be there to support you\"\n\n• \"right now you're having a bad time but when you recover a little more you'll see that breaking up isn't what you want right now\"\n\n• \"I thought you loved me, if you did you wouldn't be leaving me right now\"\n\n• \"give me reasons as to why you cannot recover healthily and have me by your side supporting you?\"\n\n• \"the least you can do is take some time to talk to a friend about this very big decision\"\n\n• \"this is not the person I grew to love , you're not acting yourself so I think you should go away and think about this\"\n\n• \"this is so unfair and cold of you to break up with me after what we have built these last few months\"\n\n• \"does this not even upset you?\"\n\n• \"did your therapist tell you to do this?\"\n\n\nThe chat was for 3 hours. It was exhausting, all on this kinda level. So heavy. Basically trying to convince me that I need him, it's a phase and that I need to provide reasons as to why I cannot be with him and be in therapy too. \n\nIs Recovery not a valid enough reason to choose to be single? Or am I actually being a cold person like he says? Damn",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fgbgxm/request_my_so_wont_accept_our_break_up_for_my/",
  "score": 62,
  "num_comments": 20,
  "comments": [
    {
      "id": "fk3jof8",
      "author": "AnastasiaOctavia",
      "body": "Any reason is a valid reason. He's just trying his best to control you by basically gaslighting you. Breaking up with him honestly sounds like you made a great decision for your health and over all well being. He most likely told you you had gained some weight as a control tactic too. \n\nI'm sorry your having to go through this but your not cold one but for not being fazed by his manipulation. Stay strong",
      "created_utc": 1583836639.0,
      "score": 33,
      "context": []
    },
    {
      "id": "fk3p7m5",
      "author": "Jayick",
      "body": "This is pure manipulation. Please fucking run.\n\nThis man is thinking of only himself in this situation. Every excuse he gave you above, includes why you are betraying or letting him down. Always why why why? Why can't it be my way? Why can't I help you? Why can't you love me?\n\nI am a male, age 30. I see this kind of stuff all the time from men and it's horrible. No one can put their own needs and desires aside to help anyone out who is in need. This world honestly just depresses me at this point.\n\nOp please don't go back. That man is very controlling and manipulative. Please run from people like that. Please... Take this advice from the man who just dropped the woman he loves off at a battered woman's shelter because it is the only place she is safe from her ex... And even then, he still showed up to pick a fight. Took me showing up with a handgun to get him to leave. Police didn't care.\n\nRun op. Anyone that controls or asks why or me? Run before that person puts a child in you by mistake, and you are forever trapped in their lives. Run.",
      "created_utc": 1583842359.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fk3qsq0",
      "author": "AnnaGreen3",
      "body": ">Or am I actually being a cold person like he says?\n\nNo no no no!! Don't listen to him!\n\nYou are so smart an brave! It's amazing you could see his manipulations attempts on your own, that speaks highly of you as a smart woman, I admire you.\n\nDo not get him in your head, your recovery is you first, assholes never.\n\nAt this point, it shouldn't just be just your recovery \"tearing you apart\", that reaction alone is toxic, he doesn't give a crap or care about you.",
      "created_utc": 1583843711.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fk3mzq3",
      "author": "abbiiscoolx",
      "body": "You are not cold for breaking up with them. You need to recover on YOUR terms and no one elses",
      "created_utc": 1583840241.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fk3i6d4",
      "author": "EDPostRequests",
      "body": "This post is somewhat against the rules. \n\n* We are for QUESTIONS about EDs for yourself or a loved one. No rants, DAEs*, requests to share your blog, or restriction boasts or binge confessions. *Does Anyone Else\n\nHowever since it's directly related to a previous post and could possibly give others a way to learn how to deal with situations like this and/or share their own experiences this post will be up.\n\nThanks.",
      "created_utc": 1583834699.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fk3nqng",
      "author": "oliviared52",
      "body": "If your gut feeling is you need to break up to recover, I would listen to that. And I am genuinely so so proud of you for being able to put your recovery first. \n\nI know it’s tough and correct me if I’m wrong, but from this post you sound fairly confident in your decision. I’d listen to that. Rooting for ya",
      "created_utc": 1583840968.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fk3w1sa",
      "author": "hyperchondriac93",
      "body": "He sounds very toxic. Sounds like he cares more about his own feelings than yours.",
      "created_utc": 1583847717.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fk3w6sw",
      "author": "Query8897",
      "body": "This guy sounds like he's toxic at the least and potentially abusive at worst. Leave him and never look back.\nI'm rooting for you!",
      "created_utc": 1583847816.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fk3suix",
      "author": "pajmahal",
      "body": "RUN. There are so many people in the world who would want for you to make healthy choices and those are the people you should surround yourself with, whether it’s a friendship, family relationship or romantic partnership. This dude is garbage and garbage belongs on the curb.",
      "created_utc": 1583845350.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fk4jn4i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1583861761.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fk574nd",
      "author": "None",
      "body": "\"give me reasons as to why you cannot recover healthily and have me by your side supporting you?\"\n\nbecause you're fucking toxic and you caused a relapse. jesus christ.",
      "created_utc": 1583874762.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fk3w7e4",
      "author": "nobodyinparticul4r",
      "body": "Yeah my dumbass ex tried to get me back too. Get rid of him, so you can get healthy and find someone who is actually supportive. I remember how fucking hard it was to walk away, but later that year I met the love of my life. Someone who at the drop of the hat will help me and my family out. Who actually cares for and respects my feelings. Who helps me remember to eat when I need to. I almost took that ex back, and I hate to think what would have happened if I’d stayed with him.\n\nPS my ex wasn’t a bad person we just weren’t a good fit. I had to be angry with him to leave but now that it’s been a while, I wish him the best and I hope he’s happy",
      "created_utc": 1583847829.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fk41r5m",
      "author": "igotbannedforh8mail",
      "body": "Seriously if leaving him will help with your health you should do it. Always take care of yourself first in situations like this. As someone that has serious depression I’ve broken relationships off due to the fact I knew that I was not currently in the correct mindset to have a relationship. If he can not deal with that it’s on him and not you to hold his hand and act like everything is a okay. \n\nIn closing, fuuuuuck that and fuck him.",
      "created_utc": 1583851465.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fk5m9eb",
      "author": "wildxdaze",
      "body": "I've never experienced as much gaslighting as this before, It's really difficult to have conversations in any way confrontational without it being: my fault. Every, damn, time. He told me he wouldn't apologise for the weight comment, he said I hadn't set my boundaries so even tho he knows of my ED I hadn't shared with him that weight comments would effect me... again: My fault! Glad I ended it, healing is coming!",
      "created_utc": 1583883409.0,
      "score": 2,
      "context": [
        {
          "id": "fk3jof8",
          "author": "AnastasiaOctavia",
          "body": "Any reason is a valid reason. He's just trying his best to control you by basically gaslighting you. Breaking up with him honestly sounds like you made a great decision for your health and over all well being. He most likely told you you had gained some weight as a control tactic too. \n\nI'm sorry your having to go through this but your not cold one but for not being fazed by his manipulation. Stay strong",
          "created_utc": 1583836639.0
        }
      ]
    },
    {
      "id": "fk5lyg7",
      "author": "wildxdaze",
      "body": "Thank you for your honest words here... I'm absolutely not going back. I'm going to stand rooted in this decision and will be a huge lesson for the future. I hope your close one is safe & sound.",
      "created_utc": 1583883231.0,
      "score": 2,
      "context": [
        {
          "id": "fk3p7m5",
          "author": "Jayick",
          "body": "This is pure manipulation. Please fucking run.\n\nThis man is thinking of only himself in this situation. Every excuse he gave you above, includes why you are betraying or letting him down. Always why why why? Why can't it be my way? Why can't I help you? Why can't you love me?\n\nI am a male, age 30. I see this kind of stuff all the time from men and it's horrible. No one can put their own needs and desires aside to help anyone out who is in need. This world honestly just depresses me at this point.\n\nOp please don't go back. That man is very controlling and manipulative. Please run from people like that. Please... Take this advice from the man who just dropped the woman he loves off at a battered woman's shelter because it is the only place she is safe from her ex... And even then, he still showed up to pick a fight. Took me showing up with a handgun to get him to leave. Police didn't care.\n\nRun op. Anyone that controls or asks why or me? Run before that person puts a child in you by mistake, and you are forever trapped in their lives. Run.",
          "created_utc": 1583842359.0
        }
      ]
    },
    {
      "id": "fk5lkdz",
      "author": "wildxdaze",
      "body": "thank you so much! I'm glad I have been able to see through a lot of manipulations that have built up - there's been a few instances of gaslighting which only continued through our break up conversation. I also think it's super unnerving when someone *tells* you how *you* feeling when it's really far from the mark, makes you feel like you're losing the plot. None of that in my life, please + thank you!",
      "created_utc": 1583882998.0,
      "score": 2,
      "context": [
        {
          "id": "fk3qsq0",
          "author": "AnnaGreen3",
          "body": ">Or am I actually being a cold person like he says?\n\nNo no no no!! Don't listen to him!\n\nYou are so smart an brave! It's amazing you could see his manipulations attempts on your own, that speaks highly of you as a smart woman, I admire you.\n\nDo not get him in your head, your recovery is you first, assholes never.\n\nAt this point, it shouldn't just be just your recovery \"tearing you apart\", that reaction alone is toxic, he doesn't give a crap or care about you.",
          "created_utc": 1583843711.0
        }
      ]
    },
    {
      "id": "fk4ezc1",
      "author": "None",
      "body": "This is a question about skills to maintain healthy boundaries to facilitate/maintain recovery. How is that against the sub rules?",
      "created_utc": 1583859138.0,
      "score": 3,
      "context": [
        {
          "id": "fk3i6d4",
          "author": "EDPostRequests",
          "body": "This post is somewhat against the rules. \n\n* We are for QUESTIONS about EDs for yourself or a loved one. No rants, DAEs*, requests to share your blog, or restriction boasts or binge confessions. *Does Anyone Else\n\nHowever since it's directly related to a previous post and could possibly give others a way to learn how to deal with situations like this and/or share their own experiences this post will be up.\n\nThanks.",
          "created_utc": 1583834699.0
        }
      ]
    },
    {
      "id": "fk5l7lq",
      "author": "wildxdaze",
      "body": "Thank you, I'm sticking by my decision to put my recovery first. It'll be the first time since my early teens that I'll be truly single (without dating/seeing others) and I'm 24. Sounds silly, it's bloody scary. But I know this is what my gut is telling me to do. Glad I drew the line now!",
      "created_utc": 1583882790.0,
      "score": 2,
      "context": [
        {
          "id": "fk3nqng",
          "author": "oliviared52",
          "body": "If your gut feeling is you need to break up to recover, I would listen to that. And I am genuinely so so proud of you for being able to put your recovery first. \n\nI know it’s tough and correct me if I’m wrong, but from this post you sound fairly confident in your decision. I’d listen to that. Rooting for ya",
          "created_utc": 1583840968.0
        }
      ]
    },
    {
      "id": "fk5l398",
      "author": "wildxdaze",
      "body": "Thank you!!",
      "created_utc": 1583882717.0,
      "score": 1,
      "context": [
        {
          "id": "fk3w6sw",
          "author": "Query8897",
          "body": "This guy sounds like he's toxic at the least and potentially abusive at worst. Leave him and never look back.\nI'm rooting for you!",
          "created_utc": 1583847816.0
        }
      ]
    },
    {
      "id": "fk5kzqo",
      "author": "wildxdaze",
      "body": "Thank you. He also keeps sending me really long texts, and messaging my friend... ahh! it's so intense! However, the messages are only further affirming my decision to end it with him. I know i'll be grateful when I look back, although this feels difficult right now!",
      "created_utc": 1583882659.0,
      "score": 1,
      "context": [
        {
          "id": "fk4jn4i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1583861761.0
        }
      ]
    },
    {
      "id": "fk4fc9y",
      "author": "EDPostRequests",
      "body": "The problem is that it could be classified as a rant. That's why it's up. It's a valuable post that could help others. But it also is more of a rant than a question specifically about eating disorders.\n\nThanks.",
      "created_utc": 1583859335.0,
      "score": 2,
      "context": [
        {
          "id": "fk3i6d4",
          "author": "EDPostRequests",
          "body": "This post is somewhat against the rules. \n\n* We are for QUESTIONS about EDs for yourself or a loved one. No rants, DAEs*, requests to share your blog, or restriction boasts or binge confessions. *Does Anyone Else\n\nHowever since it's directly related to a previous post and could possibly give others a way to learn how to deal with situations like this and/or share their own experiences this post will be up.\n\nThanks.",
          "created_utc": 1583834699.0
        },
        {
          "id": "fk4ezc1",
          "author": "None",
          "body": "This is a question about skills to maintain healthy boundaries to facilitate/maintain recovery. How is that against the sub rules?",
          "created_utc": 1583859138.0
        }
      ]
    }
  ]
}