{
  "id": "fhgsnm",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1584021755.0,
  "title": "Request: Does my boyfriend have an eating disorder?",
  "selftext": "I first made this post in a relationship subreddit asking about my boyfriends unusual eating habits. I never recognised that he may have a disorder until someone commented that so I'm looking for other opinions. \n\nWe have been together 5 months, he is 25. This has been going on the entire time.\n\nMy boyfriend is quite weird with food, I don't know what to make of it as I've never encountered something like this before.\n\nHe doesn't eat the majority of food, because they're \"unhealthy\", \"bad\" or would cause him to \"go back to his old ways\".\n\nHe is very slim and lean, he hates having body fat and a lot of his eating seems to be focused on making sure his bf % is as low as possible. However, he used to be overweight. I don't know how big he was as he has deleted all old pictures and doesn't like talking about it, but I know it made him very self conscious and he has said before that he was \"disgusting\". He gets weirdly annoyed and upset when anyone even mentions the fact that he used to be bigger. I don't think people treated him well when he was fat. \n\nI'll try my best to explain all his weird  routines but I will probably forget stuff. \n\nHe is vegan and doesn't eat carbs, except on saturdays when he allows one small portion. He spends ages planning out his \"carb meal\" of the week. He weighs EVERYTHING and puts the calorie count in myfitnesspal. Obviously low carb vegan is super restrictive anyway, but he takes it even further to the point where the majority of his diet is just beans and vegetables.\n\nBefore every meal he drinks a cup of water and a cup of green tea. Before every evening meal he will also eat a bowl of plain boiled vegetables, usually broccoli or cabbage or something. I don't know why he does this, I asked him and he just said \"habit\" like okay... another thing he does is cuts everything into super tiny pieces and eats realllyyyyy slowly. In the last few days I realised he does this to suppress his appetite so he eats less. \n\nOne time I cooked for us and he was okay with it until I showed him the box of the vegan meat we were using. It was very high in fat and he realised it had put him over his calorie allowance for the day and got really weird and upset about it, and talked about \"spiralling\". He exercised more and ate less the next day to make up for it.\n\nWe have only been out to eat together once. The only thing he could eat on the menu was a salad. He *picked out the breadcrumbs*. Like he sat there and picked out every tiny crumb before he ate a single bite. He's aware that his eating habits are weird because he said \"don't judge me\" before he did it...but I was just like ???. I'm not sure why he is so afraid of eating bread, even tiny amounts. It's like a phobia or something. \n\nHe often says that he \"hates eating\" and wishes he didn't need to do it. I said something like \"maybe you need to eat some nicer food\" and he said something about how food is only fuel to him and eating nice food is self indulgent and unnecessary.\n\nIs this concerning or is it normal for thin people that used to be bigger? \nHe is very slim and has hardly any body fat. He has that \"paper thin skin\" look and you can see all his veins and muscles. He always has extremely cut abs. I don't think his bmi is underweight though, probably low end of healthy. He carefully tracks his body fat to make sure it is always under 8%, but he says that he is happier when it is around 5%. I think he looks a little bit gaunt and unwell sometimes, but I could be biased. He is clearly very fit as he is able to run long distances and works out every day.\n\nI spoke to him once seriously about it, and he just said \"as long as I'm healthy, I should be able to eat what I want\" which I agree with, so I'm not really sure what I can say.\n\nIt just bothers me a bit. I wish he could be a bit more free with food and enjoy things without beating himself up about it. It's clear that eating causes him anxiety on some level, he admitted to that, but he said it's better that than be obese again.\n\nShould I speak to him or is it none of my business? Is this an eating disorder?\n\n\nTldr; not sure if I should speak to my boyfriend about his eating habits. He doesn't allow himself to eat the vast majority of food and has weird rituals around eating. He used to be overweight and i think the anxiety is kind of focused on that. I'm concerned he may have am eating disorder. Is it my place to talk to him?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fhgsnm/request_does_my_boyfriend_have_an_eating_disorder/",
  "score": 45,
  "num_comments": 12,
  "comments": [
    {
      "id": "fkb7dn3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1584027592.0,
      "score": 52,
      "context": []
    },
    {
      "id": "fkbbenq",
      "author": "Tigrella17",
      "body": "As someone who works with a residential ED treatment setting, these behaviors are super concerning and are nowhere near the realm of normal. He needs professional help, and I’m sure he’ll be quite resistant to that.",
      "created_utc": 1584029838.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fkbweg6",
      "author": "such_dependent",
      "body": "“As long as I’m healthy, I should be able to eat what I want” \n\nThe thing is, this isn’t healthy. His behaviour isn’t healthy. His thoughts aren’t healthy. His behaviour with his good is obsessive and probably only going to get worse if he doesn’t get help.",
      "created_utc": 1584041168.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fkbhtkz",
      "author": "rbateson",
      "body": "Yep - smells like an eating disorder. Honestly, see if you can talk to people in his life about this and maybe they can get him to see a doctor at least who can make recommendations from there. Most likely will not get better from here on out.",
      "created_utc": 1584033248.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fkbnmcy",
      "author": "laquetha",
      "body": "Honestly sounds like he needs help or is def going to need help one day if it gets out of hand.. this makes me sad 😔 I have zero advice though on whether you should bring it up to him or not.",
      "created_utc": 1584036354.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fkc5cwf",
      "author": "mr-smileys",
      "body": "I think it’s very important that you bring this up to him again! You seem to care about him a lot and you wouldn’t be doing it to be nosey, but to make sure that he is truly happy and doing ok. This behavior could get worse and he could end up in the hospital potentially who knows.\n\nMy mom struggled with an eating disorder that was always swept under the rug and that was never any good.",
      "created_utc": 1584046099.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fkdr20r",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1584091146.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fkb0rum",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1584023746.0,
      "score": -8,
      "context": []
    },
    {
      "id": "fkb9qun",
      "author": "thedumplingthief",
      "body": "Another vote for orthorexia....",
      "created_utc": 1584028916.0,
      "score": 17,
      "context": [
        {
          "id": "fkb7dn3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1584027592.0
        }
      ]
    },
    {
      "id": "fkc731q",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1584047074.0,
      "score": 1,
      "context": [
        {
          "id": "fkb7dn3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1584027592.0
        }
      ]
    },
    {
      "id": "fkcs2zf",
      "author": "Shhsh0",
      "body": "I actually think it sounds more like anorexia (but a lot of orthorexia too) Anorexia presents differently in men and this is a more typically male presentation with his obsession with visible abs and low body fat. All his anxieties around food seem to be weight related instead of health related. He eats the way he does because he is afraid of overeating and gaining weight. \n\n5% body fat in men is unsustainable and unhealthy, even bodybuilders will only go that low briefly for a competition and it's often drug aided. The fact that he forces his already skinny body to stay like that all the time could actually be damaging his health in the long run.",
      "created_utc": 1584059869.0,
      "score": 1,
      "context": [
        {
          "id": "fkb7dn3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1584027592.0
        }
      ]
    },
    {
      "id": "fkb61yl",
      "author": "None",
      "body": "I don’t get how you can say that it’s normal- he def has an eating disorder, it’s super loud too :/ \n\nNot liking your body when your fat is normal- sure, especially if you don’t like it enough to change it- but to go the extent that OPs bf is going to is abnormal. He has an unhealthy fixation with food and calories, as well as his extreme fear of gaining body fat. It’s clearly an eating disorder, and honestly, the best thing OP can do, I think, is to talk to him about it from a place of understanding and love, and offer him support.",
      "created_utc": 1584026841.0,
      "score": 10,
      "context": [
        {
          "id": "fkb0rum",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1584023746.0
        }
      ]
    },
    {
      "id": "fkb8eeg",
      "author": "mazotori",
      "body": "Those things on their own are normal but the extent to which OPs bf goes seems to enter ED territory to me. Paired with the anxiety he displays around bf % and habbit maintenance and fear of slipping back... I think it's worth it to at least open a conversation with him about it.",
      "created_utc": 1584028170.0,
      "score": 6,
      "context": [
        {
          "id": "fkb0rum",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1584023746.0
        }
      ]
    },
    {
      "id": "fkbmyhp",
      "author": "ysbekk",
      "body": "Yes. This sounds just like me last year.. It's good that you are trying to help him ❤️ Recovery is possible! A slow and scary process - but it is doable. I felt safe and in controll when I ate my safe and healthy foods and it made me extreeeeemely anxious if I couldn't have them. I also got really defensive about my food and eating habits if someone mentioned something about it.",
      "created_utc": 1584035992.0,
      "score": 3,
      "context": [
        {
          "id": "fkb7dn3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1584027592.0
        },
        {
          "id": "fkb9qun",
          "author": "thedumplingthief",
          "body": "Another vote for orthorexia....",
          "created_utc": 1584028916.0
        }
      ]
    },
    {
      "id": "fkbpzl4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1584037642.0,
      "score": -3,
      "context": [
        {
          "id": "fkb0rum",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1584023746.0
        },
        {
          "id": "fkb61yl",
          "author": "None",
          "body": "I don’t get how you can say that it’s normal- he def has an eating disorder, it’s super loud too :/ \n\nNot liking your body when your fat is normal- sure, especially if you don’t like it enough to change it- but to go the extent that OPs bf is going to is abnormal. He has an unhealthy fixation with food and calories, as well as his extreme fear of gaining body fat. It’s clearly an eating disorder, and honestly, the best thing OP can do, I think, is to talk to him about it from a place of understanding and love, and offer him support.",
          "created_utc": 1584026841.0
        }
      ]
    },
    {
      "id": "fkbr3y5",
      "author": "None",
      "body": "True, but this CLEARLY is lol",
      "created_utc": 1584038253.0,
      "score": 5,
      "context": [
        {
          "id": "fkb0rum",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1584023746.0
        },
        {
          "id": "fkb61yl",
          "author": "None",
          "body": "I don’t get how you can say that it’s normal- he def has an eating disorder, it’s super loud too :/ \n\nNot liking your body when your fat is normal- sure, especially if you don’t like it enough to change it- but to go the extent that OPs bf is going to is abnormal. He has an unhealthy fixation with food and calories, as well as his extreme fear of gaining body fat. It’s clearly an eating disorder, and honestly, the best thing OP can do, I think, is to talk to him about it from a place of understanding and love, and offer him support.",
          "created_utc": 1584026841.0
        },
        {
          "id": "fkbpzl4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1584037642.0
        }
      ]
    }
  ]
}