{
  "id": "fhk7en",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1584034771.0,
  "title": "Inspiration: Recovery is possible!",
  "selftext": "Hey all - I've been lurking this site for the past few years but never posted. Figured I'd spread some positivism today.\n\nI'm a 37 female and I've been in recovery for over 13 years now. I started restricting when I was 12 years and didn't fully into a recovered state until I was 22/23 and decided to go back to college full-time. I will say I was very good at my eating disorder that I was inpatient 9 times in 7 different centers with a feeding tube twice. If I can get better - so can you.\n\nSome things that helped me in recovery: \n\n1. Getting out of my old ED environment. This meant moving out of my mom's house into the dorms and making new friends.\n\n2. Social Interaction - I could not do my behaviors if I was isolating. So I ate with friends and even just out in public as much as possible.\n\n3. Having a goal outside of my ED. I went back to college so I had classes and projects to focus on rather than meals and numbers.\n\n4. STAYING ON MY MEAL PLAN. I did this for the first few years. Whatever I had to do to get it in - I did it. It sucked. I did not like it for awhile then it was just normal and my anxiety became less and less. I can say my anxiety around food is zero now.\n\n5. Giving myself GRACE. This does not go away over night. It will suck some days. Some days will feel like a gift. Your body will change but that is what it takes for your mind to change!\n\nI hope this helps someone whether its a loved one or a person struggling. Please talk to people in your life about what is going on. You are not alone regardless of situation.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fhk7en/inspiration_recovery_is_possible/",
  "score": 59,
  "num_comments": 6,
  "comments": [
    {
      "id": "fkbsg9c",
      "author": "None",
      "body": "This is a great list of tips! Major congrats to you, and thank you",
      "created_utc": 1584038986.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fkbv9mj",
      "author": "alliebbb",
      "body": "So proud of you! one question, how did you deal with the inevitable bloat/GI issues that come with recovering? I’ve relapsed again & every time I make an attempt at recovery, the bloating holds me back. Not sure how I did it the first time lol\n\nSo so happy that you found balance in your life ❤️",
      "created_utc": 1584040546.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fkc8f8k",
      "author": "Dustette",
      "body": "I LOVE this!\n\nMore positivity from me: I have had binge eating disorder since at least 12 years old (I can remember body dysmorphia and bingeing already at that age) it stayed with me through college and I had a bout of orthorexia/exercise bulimia peppered with weekly binges for about 2 years which ended when I was 25 and then went back to full on BED.\n\nI am now turning 33 this year and have been fully recovered for over a year. I was already on a great path for several years before then and constantly growing, but I can say I love my body, see it for what it is, am happy, have no anxieties around food, etc... fully living life outside of obsessive food thoughts or fears of falling back into the disorder for over a year.\n\nFULL recovery is possible, no matter how long you have been stuck in the cycle. It tales patience and yes, GRACE! Or what I like to call self-compassion 💕",
      "created_utc": 1584047843.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fkc8wdv",
      "author": "ergotofwhy",
      "body": "Fantastic! Thanks for sharing and congratulations",
      "created_utc": 1584048118.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fkc8bit",
      "author": "rbateson",
      "body": "Ooofta refeeding/eating the quantity of food prescribed was uncomfortable. My body was telling me no but i know in my mind I need to do this. It’s like a betrayal almost of the body which is why it is difficult. \n\nPractically - taking a digestive enzyme supplement helped because my stomach acid was low. \n\nUnpractically - eat foods I actually liked and felt good after eating. I slept a lot. Got out of my head as much as possible. Listened to more music than ever.  Wrote ALOT in a journal. It takes time. Be patient. The body is so smart we just gotta trust her.",
      "created_utc": 1584047784.0,
      "score": 1,
      "context": [
        {
          "id": "fkbv9mj",
          "author": "alliebbb",
          "body": "So proud of you! one question, how did you deal with the inevitable bloat/GI issues that come with recovering? I’ve relapsed again & every time I make an attempt at recovery, the bloating holds me back. Not sure how I did it the first time lol\n\nSo so happy that you found balance in your life ❤️",
          "created_utc": 1584040546.0
        }
      ]
    },
    {
      "id": "fkd0hjp",
      "author": "rbateson",
      "body": "🙌♥️🙌",
      "created_utc": 1584065417.0,
      "score": 1,
      "context": [
        {
          "id": "fkc8f8k",
          "author": "Dustette",
          "body": "I LOVE this!\n\nMore positivity from me: I have had binge eating disorder since at least 12 years old (I can remember body dysmorphia and bingeing already at that age) it stayed with me through college and I had a bout of orthorexia/exercise bulimia peppered with weekly binges for about 2 years which ended when I was 25 and then went back to full on BED.\n\nI am now turning 33 this year and have been fully recovered for over a year. I was already on a great path for several years before then and constantly growing, but I can say I love my body, see it for what it is, am happy, have no anxieties around food, etc... fully living life outside of obsessive food thoughts or fears of falling back into the disorder for over a year.\n\nFULL recovery is possible, no matter how long you have been stuck in the cycle. It tales patience and yes, GRACE! Or what I like to call self-compassion 💕",
          "created_utc": 1584047843.0
        }
      ]
    }
  ]
}