{
  "id": "fifqok",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1584177611.0,
  "title": "Request: Binging Behaviors and Coronavirus",
  "selftext": "Needless to say, there have been some...developments this week, and unfortunately, the coronavirus has food implications!\n\nFor those of us who struggle with snacking, portion control, and binging behavior...how have you balanced this with the instinct/logic to stock up on food re: coronavirus? This one is really frustrating for me. I usually don’t purchase snacks or extra food to keep in the house because I end up eating it all or binging at some point. But now that everyone where I live (NYC) is stocking up on food in preparation for self quarantine, I don’t know what to do. Half of me is like “BUY THE FOOD. SURVIVAL FIRST.” The other side of me is like, “You won’t actually run out of food, people are panicking. Just continue as normal.” Thoughts on what to do? I’m incredibly torn.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fifqok/request_binging_behaviors_and_coronavirus/",
  "score": 106,
  "num_comments": 27,
  "comments": [
    {
      "id": "fkgxic0",
      "author": "thewonderfulpea",
      "body": "I bought long-shelf-life ingredients (flour, yeast, sugar, frozen veg, cans, oats) which I don't tend to binge on and have to spend time preparing.\nI'm keeping all this emergency food in a particular place out of sight.\n\nI think it's true food will still be available here for a long time (I'm in the UK) and for now I'm eating as I normally would and still buying snacks and stuff everyday and it's working but when I can't get my snacks I don't know if it will still be this easy...\n\nEdit: I would also say don't go crazy I have a pretty standard amount of food in this emergency kit, 1-2 packets of everything, it fits into one shopping bag. I agree there's no need to panic buy",
      "created_utc": 1584179206.0,
      "score": 32,
      "context": []
    },
    {
      "id": "fkgx6a7",
      "author": "muser666",
      "body": "Second one. It wont help you to have more food. You will just binge on it. Food wont be rare. People are just panicking. Dont be like them.",
      "created_utc": 1584178726.0,
      "score": 44,
      "context": []
    },
    {
      "id": "fkgypat",
      "author": "anonymousdutchperson",
      "body": "I live at home with my parents and can only binge if they're not home. Bc of colds and stuff everyone is home now. I've been to the store multiple times last week to buy food and sneak it up to my room to binge. With the food shortages and my binge foods mostly being things that have to be cooked before eating, i'm starting to struggle real bad... i know it's good to not binge but that meant i had mental breakdowns multiple times already, let alone if no one is allowed to leave the house if the rules become more strict....",
      "created_utc": 1584180903.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fkh6ldk",
      "author": "flowersliders",
      "body": "I thought this was going to be about binging from anxiety, which is something I am having issues with lol. \n\nMy first grocery trip, I impulse bought a lot of comfort junk, which I ate through in like... two days and felt terrible about. 2nd trip, I bought a bunch of frozen veggies, canned beans, tuna, pasta, rice, cup noodle. Stuff I had to cook to eat. Also bought some comfort food like hot chocolate, frozen gyoza, instant oatmeal--but all still stuff I have to prepare before I eat it. That's honestly the key for me. I'm not going to binge on something I have to go through the trouble of cooking. I didn't buy out the store or anything but I bought enough to feel comfortable with in case things do get more serious.\n\nFor me, my binge trigger foods are bread, peanut butter, cereal, shredded cheese, and crackers. Turns out I can buy weeks worth of food that don't include any of those ingredients. Also highly recommend those individual servings of instant rice, pad thai kits that only have 1-2 servings, etc.",
      "created_utc": 1584190360.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fkif8cs",
      "author": "None",
      "body": "My husband & daughter are home for a month which means I can't binge all day like I usually do while they are at school. I am so thankful for this because I've been unbelievably out of control & didn't know a way out. This may really save me.",
      "created_utc": 1584218605.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fkh3qir",
      "author": "None",
      "body": "Honestly, you should probably stock up. The CDC is recommending everyone have a 30 day supply of essentials",
      "created_utc": 1584187420.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fkhlhn9",
      "author": "VastReveries",
      "body": "I'm just shopping like normal. I'm a few months from my Master of Public Health and genuinely confused about this being treated like Armageddon.",
      "created_utc": 1584201350.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fkiayhr",
      "author": "Sanctuary_of_Love",
      "body": "Totally understand your feelings and I've felt torn too. I did go on one shopping trip to get stuff like dried beans and some canned goods, but I don't have a ton at home. Honestly, I trust that the bottomless profit motive of major stores (Walmart!!) will ensure they will find a way to sell us food no matter what happens. I don't care if it's curbside pickup or delivery by workers wearing biohazard suits--everyone has to eat and they want our money. \n\nMy real challenge is to stop eating junk so my immune system can be firing on all cylinders. I have an autoimmune disease and I feel like I catch everything that goes around during regular cold/flu season. My one advantage is that I'm an extreme introvert and totally fine with staying home and seeing no one indefinitely.",
      "created_utc": 1584215745.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fkjotw7",
      "author": "unsaintedheretic",
      "body": "If you're not sure how you'd do being around food like that maybe just make sure that someone close to you stores some for you too and is able to bring it over should things go south.\n\nI always think better safe than sorry in situations like this. I don't buy into the whole panic *that much* but I sure as hell don't want to be one of those people who didn't prepare themselves at all and have other people tell me \"hate to say I told you so\" *if things really get as bad as some people think*. \n\n\nPersonally...\nActually the pandemic is what kicked off my recovery for real this time.\n\nI live close to Italy and seeing how they're doing over there and that food is indeed getting scarce slowly gave me a big reality check... \n\nI bought canned food, rice, snacks, chocolate, cookies, peanut butter, whatever I could find that's high caloric and stocked up on it so that it will lady me at least a month or two. \nI put it away in my pantry (out of sight out of mind) and started eating semi normally again. (I still count calories but don't binge and purge anymore)\n\nThe worst thing that could happen right now is continuing my behavior and having some sort of medical emergency because of it. First off, beinf as underweight as I am is also pretty scary during a pandemic as I'm not sure how my body would handle the virus. And secondly, I don't want to have to go to a hospital where I'd take up space that's desperately needed *or* get the virus there  on top of whatever I'm there for.",
      "created_utc": 1584253262.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fkhic10",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1584199512.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fkhsfwg",
      "author": "bananacasanova",
      "body": "Honestly I would stock up on items you won't binge on, if possible.",
      "created_utc": 1584205128.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fkhdo6n",
      "author": "aujoi",
      "body": "Staying with my BF. So he’ll take care of food/groceries. Therefore, limited binge or find things to do besides being near a fridge",
      "created_utc": 1584196232.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fkhg8t5",
      "author": "None",
      "body": "idk i'm binging a lot, i'm scared that ill die before i hit my gw.",
      "created_utc": 1584198079.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fki0xry",
      "author": "baristabitch666",
      "body": "I just haven’t been eating much. It’s tough though.",
      "created_utc": 1584209702.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fkl5kc7",
      "author": "None",
      "body": "I've been stockpiling instant, single-meal soup. Hopefully, I won't binge on that. And even if I do, it's mostly water. It's enough that I don't starve in the worst case scenario. \n\nIn the meantime, I'm buying small amounts of regular food, as usual. I sincerely hope this is okay and not a symptom of another ED. I mean, I'd buy more if I hear that they are closing all shops.",
      "created_utc": 1584298954.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flhkkj1",
      "author": "None",
      "body": "Personally, I've been binge eating a LOT since the UK went on lockdown. I'm very stressed and anxious about the whole situation, and unfortunately one of my coping mechanisms is to overeat. This in turn triggers more anxiety, so it's a vicious circle, haha. I'm not sure if you would find this helpful, but for me I've been keeping in touch with my boyfriend and trying to exercise everyday with him (not over-exercise, just a nice medium). I've found that even though I'm eating a lot, I don't feel as bad knowing that I'm at least exercising a little. I'm very worried that the lockdown will trigger a bad relapse though.",
      "created_utc": 1585164426.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn5bt2b",
      "author": "sukithesealion",
      "body": "I can relate with so much of what you guys are sharing. \"Tricking\" your brain into not binging, not keeping food in the house, not keeping FLOUR (I thought I was alone in that, but I'm so glad I'm not), freezing things so slow you down... I would say I have trigger foods (ice cream, Nutella), but honestly when a serious urge comes (like you're not in control of your body and you see what you're doing and know it's wrong and hate yourself, but you can't stop) I just go from whatever is the sweetest to the least appetizing, like stale crackers. I don't think I have to explain the feeling of being so full, but still unable to stop until you're in literal pain - you guys seem like you've been there. \nI haven't seriously binged in a while since I started taking Contrave, but it's great to see this because people who don't struggle with control over food DO NOT get it. They think you're explaining a case of overeating when you say please don't bring cupcakes I will eat them all. Like no seriously, I will eat every cupcake and lick the plate for crumbs and then I'll go find something else and something else...\nIt's just really refreshing to see genuine understanding here.",
      "created_utc": 1586660812.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fki6ugn",
      "author": "graveyardho",
      "body": "Same. I don't buy anything that I can eat instantly. Exception is ramen, since it takes 3 minutes (and I rarely eat it because I'm terrified of sodium). Stock up on basics, things like rice, canned vegetables, canned fruits, frozen vegetables, etc. No snacky foods either",
      "created_utc": 1584213067.0,
      "score": 4,
      "context": [
        {
          "id": "fkgxic0",
          "author": "thewonderfulpea",
          "body": "I bought long-shelf-life ingredients (flour, yeast, sugar, frozen veg, cans, oats) which I don't tend to binge on and have to spend time preparing.\nI'm keeping all this emergency food in a particular place out of sight.\n\nI think it's true food will still be available here for a long time (I'm in the UK) and for now I'm eating as I normally would and still buying snacks and stuff everyday and it's working but when I can't get my snacks I don't know if it will still be this easy...\n\nEdit: I would also say don't go crazy I have a pretty standard amount of food in this emergency kit, 1-2 packets of everything, it fits into one shopping bag. I agree there's no need to panic buy",
          "created_utc": 1584179206.0
        }
      ]
    },
    {
      "id": "fkh2xoj",
      "author": "PsychadelicSpaceCat",
      "body": "This comment calmed me and I needed to hear it 😔 Thank you my dude",
      "created_utc": 1584186507.0,
      "score": 14,
      "context": [
        {
          "id": "fkgx6a7",
          "author": "muser666",
          "body": "Second one. It wont help you to have more food. You will just binge on it. Food wont be rare. People are just panicking. Dont be like them.",
          "created_utc": 1584178726.0
        }
      ]
    },
    {
      "id": "fkib9om",
      "author": "wolftjie",
      "body": "I am going through the same thing. We can do this.",
      "created_utc": 1584215951.0,
      "score": 5,
      "context": [
        {
          "id": "fkgypat",
          "author": "anonymousdutchperson",
          "body": "I live at home with my parents and can only binge if they're not home. Bc of colds and stuff everyone is home now. I've been to the store multiple times last week to buy food and sneak it up to my room to binge. With the food shortages and my binge foods mostly being things that have to be cooked before eating, i'm starting to struggle real bad... i know it's good to not binge but that meant i had mental breakdowns multiple times already, let alone if no one is allowed to leave the house if the rules become more strict....",
          "created_utc": 1584180903.0
        }
      ]
    },
    {
      "id": "fkhrqr8",
      "author": "None",
      "body": "This is genius!",
      "created_utc": 1584204745.0,
      "score": 3,
      "context": [
        {
          "id": "fkh6ldk",
          "author": "flowersliders",
          "body": "I thought this was going to be about binging from anxiety, which is something I am having issues with lol. \n\nMy first grocery trip, I impulse bought a lot of comfort junk, which I ate through in like... two days and felt terrible about. 2nd trip, I bought a bunch of frozen veggies, canned beans, tuna, pasta, rice, cup noodle. Stuff I had to cook to eat. Also bought some comfort food like hot chocolate, frozen gyoza, instant oatmeal--but all still stuff I have to prepare before I eat it. That's honestly the key for me. I'm not going to binge on something I have to go through the trouble of cooking. I didn't buy out the store or anything but I bought enough to feel comfortable with in case things do get more serious.\n\nFor me, my binge trigger foods are bread, peanut butter, cereal, shredded cheese, and crackers. Turns out I can buy weeks worth of food that don't include any of those ingredients. Also highly recommend those individual servings of instant rice, pad thai kits that only have 1-2 servings, etc.",
          "created_utc": 1584190360.0
        }
      ]
    },
    {
      "id": "fkjm6zf",
      "author": "draagonfruit",
      "body": "Love this insight (I’m OP). Yeah, I’ve noticed before that buying non-instant or non-snackable foods does help. However, my concern is sometimes if I don’t buy any snacks at all, I end up making stuff—like mug cakes, crepes, pancakes, very carb heavy items—and binging all of that, which can be just as calorific. My solve for THAT was to just not buy flour and make baked goods anymore, but in a time of stockpiling it naturally is a key staple and also sometimes I want to make things like zucchini fritters and I need to buy flour...\n\nIt just gets so frustrating and humiliating sometimes. I feel like I’m trying to trick some kind of monkey (my binging brain) into a cage (not binging) and I’m pretzeling myself over something that “normal” people don’t even blink twice about. Thanks for making me feel less alone though, everyone.",
      "created_utc": 1584250432.0,
      "score": 3,
      "context": [
        {
          "id": "fkh6ldk",
          "author": "flowersliders",
          "body": "I thought this was going to be about binging from anxiety, which is something I am having issues with lol. \n\nMy first grocery trip, I impulse bought a lot of comfort junk, which I ate through in like... two days and felt terrible about. 2nd trip, I bought a bunch of frozen veggies, canned beans, tuna, pasta, rice, cup noodle. Stuff I had to cook to eat. Also bought some comfort food like hot chocolate, frozen gyoza, instant oatmeal--but all still stuff I have to prepare before I eat it. That's honestly the key for me. I'm not going to binge on something I have to go through the trouble of cooking. I didn't buy out the store or anything but I bought enough to feel comfortable with in case things do get more serious.\n\nFor me, my binge trigger foods are bread, peanut butter, cereal, shredded cheese, and crackers. Turns out I can buy weeks worth of food that don't include any of those ingredients. Also highly recommend those individual servings of instant rice, pad thai kits that only have 1-2 servings, etc.",
          "created_utc": 1584190360.0
        }
      ]
    },
    {
      "id": "fkjml70",
      "author": "draagonfruit",
      "body": "This is very true. If we really starve, we’ll have other problems to worry about, like the collapse of transportation, our government, and plumbing/heating lol. I’m more so just worried about price gouging with food, especially in the dense urban location I live in, and taking a hit financially because I couldn’t control my eating. \n\nThe question then becomes, diet or money! It’s so easy to buy into the panic and the logic of “what’s the harm in being prepared?” But I keep on having to remember that for people like us, there IS a very real harm to having too much food around. :/",
      "created_utc": 1584250833.0,
      "score": 2,
      "context": [
        {
          "id": "fkiayhr",
          "author": "Sanctuary_of_Love",
          "body": "Totally understand your feelings and I've felt torn too. I did go on one shopping trip to get stuff like dried beans and some canned goods, but I don't have a ton at home. Honestly, I trust that the bottomless profit motive of major stores (Walmart!!) will ensure they will find a way to sell us food no matter what happens. I don't care if it's curbside pickup or delivery by workers wearing biohazard suits--everyone has to eat and they want our money. \n\nMy real challenge is to stop eating junk so my immune system can be firing on all cylinders. I have an autoimmune disease and I feel like I catch everything that goes around during regular cold/flu season. My one advantage is that I'm an extreme introvert and totally fine with staying home and seeing no one indefinitely.",
          "created_utc": 1584215745.0
        }
      ]
    },
    {
      "id": "fkpvnpt",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1584420779.0,
      "score": 3,
      "context": [
        {
          "id": "fkjotw7",
          "author": "unsaintedheretic",
          "body": "If you're not sure how you'd do being around food like that maybe just make sure that someone close to you stores some for you too and is able to bring it over should things go south.\n\nI always think better safe than sorry in situations like this. I don't buy into the whole panic *that much* but I sure as hell don't want to be one of those people who didn't prepare themselves at all and have other people tell me \"hate to say I told you so\" *if things really get as bad as some people think*. \n\n\nPersonally...\nActually the pandemic is what kicked off my recovery for real this time.\n\nI live close to Italy and seeing how they're doing over there and that food is indeed getting scarce slowly gave me a big reality check... \n\nI bought canned food, rice, snacks, chocolate, cookies, peanut butter, whatever I could find that's high caloric and stocked up on it so that it will lady me at least a month or two. \nI put it away in my pantry (out of sight out of mind) and started eating semi normally again. (I still count calories but don't binge and purge anymore)\n\nThe worst thing that could happen right now is continuing my behavior and having some sort of medical emergency because of it. First off, beinf as underweight as I am is also pretty scary during a pandemic as I'm not sure how my body would handle the virus. And secondly, I don't want to have to go to a hospital where I'd take up space that's desperately needed *or* get the virus there  on top of whatever I'm there for.",
          "created_utc": 1584253262.0
        }
      ]
    },
    {
      "id": "fkjmeaa",
      "author": "draagonfruit",
      "body": "Glad to know I’m not alone. My binging actually got so bad that I went to a therapist to address it for the first time in my 22 years of life just a few weeks ago. I actually really started to turn things around through starting intermittent fasting. Had just completed three weeks of IF and was due for my second therapy session when coronavirus hit the US full in the face. Thanks for nothing coronavirus.",
      "created_utc": 1584250639.0,
      "score": 2,
      "context": [
        {
          "id": "fkhic10",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1584199512.0
        }
      ]
    },
    {
      "id": "fkh4bqt",
      "author": "muser666",
      "body": "Glad to hear that. You are welcome. Keep strong!",
      "created_utc": 1584188064.0,
      "score": 4,
      "context": [
        {
          "id": "fkgx6a7",
          "author": "muser666",
          "body": "Second one. It wont help you to have more food. You will just binge on it. Food wont be rare. People are just panicking. Dont be like them.",
          "created_utc": 1584178726.0
        },
        {
          "id": "fkh2xoj",
          "author": "PsychadelicSpaceCat",
          "body": "This comment calmed me and I needed to hear it 😔 Thank you my dude",
          "created_utc": 1584186507.0
        }
      ]
    },
    {
      "id": "fkjt1c1",
      "author": "flowersliders",
      "body": "Love the monkey analogy lol. It totally feels like I'm constantly trying to outsmart my binge brain. When it comes to making food and binging on that, I've tried to cut down on how much I make, or immediately putting extra stuff like batter in the freezer. Even that isn't fail proof. \n\nYou're definitely not alone. It's always embarrassing when my husband discovers I ate literally all of his cheese, but he's been living with all my eating problems for 6 years now and doesn't show signs of leaving. I know he doesn't like it, but he still loves me, and it's helped me remember that I'm more than just my binge self.\n\nAlso, I think they sell single serving mug cake kits now and they're pretty good! I also have a sweet tooth and it's hard to find stuff I won't binge on, but I've discovered that popsicles and fudgesicles do the trick and are really hard to binge on because I get a brain freeze.",
      "created_utc": 1584258356.0,
      "score": 2,
      "context": [
        {
          "id": "fkh6ldk",
          "author": "flowersliders",
          "body": "I thought this was going to be about binging from anxiety, which is something I am having issues with lol. \n\nMy first grocery trip, I impulse bought a lot of comfort junk, which I ate through in like... two days and felt terrible about. 2nd trip, I bought a bunch of frozen veggies, canned beans, tuna, pasta, rice, cup noodle. Stuff I had to cook to eat. Also bought some comfort food like hot chocolate, frozen gyoza, instant oatmeal--but all still stuff I have to prepare before I eat it. That's honestly the key for me. I'm not going to binge on something I have to go through the trouble of cooking. I didn't buy out the store or anything but I bought enough to feel comfortable with in case things do get more serious.\n\nFor me, my binge trigger foods are bread, peanut butter, cereal, shredded cheese, and crackers. Turns out I can buy weeks worth of food that don't include any of those ingredients. Also highly recommend those individual servings of instant rice, pad thai kits that only have 1-2 servings, etc.",
          "created_utc": 1584190360.0
        },
        {
          "id": "fkjm6zf",
          "author": "draagonfruit",
          "body": "Love this insight (I’m OP). Yeah, I’ve noticed before that buying non-instant or non-snackable foods does help. However, my concern is sometimes if I don’t buy any snacks at all, I end up making stuff—like mug cakes, crepes, pancakes, very carb heavy items—and binging all of that, which can be just as calorific. My solve for THAT was to just not buy flour and make baked goods anymore, but in a time of stockpiling it naturally is a key staple and also sometimes I want to make things like zucchini fritters and I need to buy flour...\n\nIt just gets so frustrating and humiliating sometimes. I feel like I’m trying to trick some kind of monkey (my binging brain) into a cage (not binging) and I’m pretzeling myself over something that “normal” people don’t even blink twice about. Thanks for making me feel less alone though, everyone.",
          "created_utc": 1584250432.0
        }
      ]
    },
    {
      "id": "fkpxrxk",
      "author": "unsaintedheretic",
      "body": "Thank you so much! This really means a lot to me. People around me only know that I have trouble eating enough but don't know about my bulimia so it's extra hard to deal with this on my own.\n\nI hate that it is took such a huge crisis for reality to really hit me but I've actually been doing great these last ~ two weeks. Whenever I even get the slightest urge to b/p I just hit up the internet and read about Italy/corona in general... And it almost completely subsides. \n\nOf course it's still in the back of my head but I can handle it so much better. To be honest, I always felt so f'ing guilty about how much food I literally wasted but now it's just so much more real and close to home. \n\nI really hope you'll be able to stay healthy and safe too!! And I'm proud of you too! Every ED is hard to go through, however mild it may seem, and it takes a lot of willpower to not give in to it!",
      "created_utc": 1584422761.0,
      "score": 2,
      "context": [
        {
          "id": "fkjotw7",
          "author": "unsaintedheretic",
          "body": "If you're not sure how you'd do being around food like that maybe just make sure that someone close to you stores some for you too and is able to bring it over should things go south.\n\nI always think better safe than sorry in situations like this. I don't buy into the whole panic *that much* but I sure as hell don't want to be one of those people who didn't prepare themselves at all and have other people tell me \"hate to say I told you so\" *if things really get as bad as some people think*. \n\n\nPersonally...\nActually the pandemic is what kicked off my recovery for real this time.\n\nI live close to Italy and seeing how they're doing over there and that food is indeed getting scarce slowly gave me a big reality check... \n\nI bought canned food, rice, snacks, chocolate, cookies, peanut butter, whatever I could find that's high caloric and stocked up on it so that it will lady me at least a month or two. \nI put it away in my pantry (out of sight out of mind) and started eating semi normally again. (I still count calories but don't binge and purge anymore)\n\nThe worst thing that could happen right now is continuing my behavior and having some sort of medical emergency because of it. First off, beinf as underweight as I am is also pretty scary during a pandemic as I'm not sure how my body would handle the virus. And secondly, I don't want to have to go to a hospital where I'd take up space that's desperately needed *or* get the virus there  on top of whatever I'm there for.",
          "created_utc": 1584253262.0
        },
        {
          "id": "fkpvnpt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1584420779.0
        }
      ]
    }
  ]
}