{
  "id": "fioxrz",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1584217686.0,
  "title": "Request: Realizing you relapsed too late??",
  "selftext": "I got really excited this morning to make nachos to eat as a meal for me and my partner. When I realized he wouldn't be able to share with me, I ended up feeling extremely depressed. I told him I was hungry and he told me to eat, and I immediately thought \"I should have eaten with my mom\" (I'm 19 in college and still live at home with my parents). \n\nI was in the hospital for severe stomach pain last month. They said my stomach was over-producing acid. My brother's girlfriend is a med tech and said that it could be because I haven't been eating enough. \n\nThis situation today made me realize a lot. Like how the only meal I ate yesterday was the most I've eaten in probably over a month. I think it might be too late, but my inability to eat alone due to fear of losing control but also not being able to eat out because I don't want to be judged for eating by myself and the ways it's manifesting have made me realize that I'm relapsing (or quite possibly already have). \n\nHe told me to eat. And because I'd be eating alone, I'm not going to. I don't know what to do. I can't afford treatment, as colleges and universities closing down also means I don't currently have a job. I also still have to pay the hospital bill from last month before I can even attempt a follow-up with a GI. I'm worried I'm getting back to the point where my body might start rejecting food again. I'm truly at a loss. My parents have already done what they can and got rid of scales and other such things I could use to convince myself that I need to be this way, so I genuinely have no clue where to go or what to do. I just want to be healthy.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fioxrz/request_realizing_you_relapsed_too_late/",
  "score": 39,
  "num_comments": 3,
  "comments": [
    {
      "id": "fkixjvg",
      "author": "mazotori",
      "body": "Does your partner know? Can he plan to eat with you to support you while you get back on track?",
      "created_utc": 1584231013.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fkiqght",
      "author": "marilynmonrae",
      "body": "I feel this",
      "created_utc": 1584226189.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fkjqxr9",
      "author": "EyeC0uldntH3lpMys3lf",
      "body": "Ensure at 11pm. I hate morning food but when you wake up drink one. It will change your life.",
      "created_utc": 1584255697.0,
      "score": 2,
      "context": []
    }
  ]
}