{
  "id": "fmk8et",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1584817576.0,
  "title": "Request: Eating feels like a chore",
  "selftext": "here is what I want to post:\nI think I have an eating disorder. I eat a recommended **** calories a day (according to my BMI), eat three meals a day and snack, and exercise a normal amount. But everyday it is a struggle mentally. If I eat my total calories, I hate myself, feel shame and weak for not having been able to keep it lower. If I keep it lower, I give into some more food to satisfy my hunger. The people around me seem to have smaller appetites than me and are able to eat less, while still wanting less naturally. \nAlthough I tell my closest friends and boyfriend about my insecurities, I never let them know how mentally terrible and hard it is. They wouldn't get it anyways, because to them it seems like I eat normally and more, like when I get ice cream after lunch or buy something at my school snack bar. It's all just mentalI guess, the way I think about every bite of the croissant I'm eating or try to count the calories in the soup, but end up zoning out because It's impossible to estimate the calories in this soup. \nI don't want to get help because I don't even think it's a big enough deal, or that it would do anything. Also, I just want to lose weight. If I get help, I'm scared my weight loss will stop and I'l just hate myself for not doing anything about it.\n\nIs this like an eating disorder? Or is this just kind of normal weight loss things to go through.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fmk8et/request_eating_feels_like_a_chore/",
  "score": 61,
  "num_comments": 4,
  "comments": [
    {
      "id": "fl4yo7l",
      "author": "wgzoe",
      "body": "hello there :) \nlisten, I started out like you, and in some ways I still act this way: nobody from the outside would say that I have an eating disorder, if not someone who has it. I look like I feel fine, I eat normally and sometimes I even eat sweets, but for the last few months I have been seeing a psychologist and a psychiatrist because it's getting worse and worse. And it all started out with me being unhappy with my belly fat and starting to eat less and less.\nEating disorders vary a lot and are often unrecognisable from the outside: people only notice when you get in a really dangerous situation. \nMy advice is that you tell someone professional about this: the earlier you start to do something about, the easier it will be to feel good \nxx",
      "created_utc": 1584824530.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fl5ax9m",
      "author": "WaterIsMyLife2",
      "body": "Having an eating disorder mainly just means you have an unhealthy relationship with food. It comes in many different types and forms, weight and food habits in no way define an eating disorder, those things are often just symptoms of a larger problem. Plenty of people with extreme weights and diets don't have eating disorders, it's really more about how you think of and feel about food. An eating disorder is a mental thing, often defined by feelings like fear and obsession in regards to eating. If you feel like thoughts about food are taking over your life, definitely seek help. A good therapist can do wonders.",
      "created_utc": 1584832495.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fl6xvr4",
      "author": "None",
      "body": "For me there’s so much stress and guilt surrounding food, even if I seem “normal”\nI want to feel freer so I’m working through it with a therapist. I don’t technically have a diagnosis of an eating disorder, but I think I’m our culture it’s so hard not to have unhealthy relationships with food.",
      "created_utc": 1584887279.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fliltx0",
      "author": "Andra8951",
      "body": "The thing is that it's up to you to decide. If you feel like crap about your relationship with food, try to tackle it as just that. Labeling yourself prematurely could be counterproductive yet if it's become that disturbing that you may need someone to talk to about it then by all means do it! I consider myself someone with an eating disorder. I have friends and family and medical professionals say ha ha very funny. I also have friends that ask me if I've eaten and people have been worried that I absolutely have a problem. It's how you view it that is what is important. All I can say is you deserve to enjoy life, feel happy and healthy in a way that is true to you, however that looks in the mirror or what's on your plate. Sometimes it helps to talk to loved ones and other times a neutral person would be more effective. Either way, we all empathize, and care that you are well in all the ways. I'm glad you came to a safe place and I'm glad that you expressed your thoughts and feelings. You clearly have a lot of self-awareness and are trying to keep yourself well, and that is a HUGE first step. A lot of times people wait to address it and ask for some help or guidance (guilty!) but you have done it in a healthy way early on. You are doing great, I wish you the very best and I'll tell you something I need to tell myself: there is more right with you than wrong with you. Anyone on here I'm sure is willing to listen and share their experience. Always good to have healthy concern, but try not to make it into an obsessive panic. We are ALL with you. One tip: mindfulness meditation and yoga if you are more physical person. Changed my life. There are a lot of apps out there but the best by far is called insight timer and I think it might be a few bucks a month (it was free when I signed up) you can get tens of thousands of meditations of all types by thousands of different teachers, and I know there are at least a handful of crash courses that target what you seem to be going through. I still have a long way to go, but I can't tell you how much better I am since I started about two years ago. There is another book I read before I had a physical activity mindfulness practice, it was short and sweet and are little tips on how to deal with and improve any and every problem relationship you feel you may have with food. I just am bouncing back from a \"relapse\" now, which is why I really care about helping you so that you don't have to go through what a lot of us did to end up on this thread. That said I am going to try to find the title and please feel free to reach out if you need. I'm quarantined in New York City Coronaland so I have all the time to help in any way if I can. Stay strong, BELIEVE IN YOURSELF because you can be okay, you already are, and you deserve to be happy and healthy ALWAYS. Praying for your peace of mind. If nothing else please believe this one fact you need to know: You are not alone. ♡♡♡",
      "created_utc": 1585185300.0,
      "score": 1,
      "context": []
    }
  ]
}