{
  "id": "fnnjn3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1584983258.0,
  "title": "Request: 25F and I feel too old for this",
  "selftext": "I've struggled with an ED for over a decade, and was diagnosed with EDNOS years back. In the past two years, I had managed to get a handle on my restrictive behavior and get back to a healthy weight, although I never really considered myself \"in recovery\" for whatever reason, I guess because since I started seeing a new therapist a while back I've never brought up my ED. I just really don't like talking about it. I've never wanted to fully let go of the voice in my head, even during the two year time period I worked to ignore it. \nI fell extremely ill over the new year, and ended up dropping a lot of weight extremely quickly. I've since recovered from the illness, but the quick weight loss has caused me to fall back into disordered eating. I'm frustrated with myself, but at the same time I've been continuing to fall in line with my ED and haven't even tried fighting it. \nI'm 25 years old, and I guess my whole life I figured I'd grow out of this or move on by now. I feel too old to be suffering with an ED (even though logically I know that's not true). I guess I'm just looking for reassurance that I'm not alone. Idk. I'm tired of my battle with disordered eating, but I'm scared to let go.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fnnjn3/request_25f_and_i_feel_too_old_for_this/",
  "score": 50,
  "num_comments": 20,
  "comments": [
    {
      "id": "flayveq",
      "author": "saltinado",
      "body": "Hey there fellow 25 year old who's been struggling with this for a bajillion years. Tell me this, have you not gained insight? Yeah, sometimes you have bad days, weeks, months, years, but do you not have a better idea now than when you were 15 what makes it better or worse? What your triggers are? How you respond to external and internal stress? All your experience matters! You have TEN years of experience to throw at this thing, and you suffered to earn all of them. The length of time you've had an eating disorder doesn't mean that you're going to be stuck with it forever, it means you're even more prepared to fight the eating disorder and build newer, healthier habits.",
      "created_utc": 1584993917.0,
      "score": 14,
      "context": []
    },
    {
      "id": "flapo1v",
      "author": "creedbrattenberg",
      "body": "Honestly same. Mine seemingly went away in my early 20s but I’m now 31 & it’s back big time",
      "created_utc": 1584988614.0,
      "score": 6,
      "context": []
    },
    {
      "id": "flaoigf",
      "author": "nobodyinparticul4r",
      "body": "\"Gaining\" by Aimee Liu addresses this issue. Highly recommend.",
      "created_utc": 1584987954.0,
      "score": 5,
      "context": []
    },
    {
      "id": "flawbrm",
      "author": "nastrals",
      "body": "I relapses at 40. Having not had any signs since I was 20. I was going through an incredibly stressful time and I used it to cope. Stay strong. Stay healthy. Stay positive. You will continue on with your recovery. Don’t be hard on yourself.",
      "created_utc": 1584992438.0,
      "score": 3,
      "context": []
    },
    {
      "id": "flawlce",
      "author": "caughtlitesneez",
      "body": "I’m 38, I feel ya 😐",
      "created_utc": 1584992593.0,
      "score": 4,
      "context": []
    },
    {
      "id": "flarrxx",
      "author": "Solkvds",
      "body": "Same here too, I've had an ed for 9 years and am now 23, I too in the past 2 years have been not really actively in recovery but have been doing in general a lot better at not engaging with these thoughts and behaviors. However over these 2 years I had gained some weight, and for some reason I thought it was a good idea to try and lose some of that weight \"the healthy way\". I thought for sure by now after 2 years of doing okay I would be able to do that. 2 months and an insane amount of weight loss later here we are back in the same boat as when I was a teenager, and I feel ridiculous. I guess we both have to accept that after all these years we will have to completely give up our ed, and it doesn't have to be a part of our identity anymore.. wish you all the best",
      "created_utc": 1584989816.0,
      "score": 2,
      "context": []
    },
    {
      "id": "flaxxkv",
      "author": "adriftingpieceofdust",
      "body": "I’m 21 and ive been dealing with this for 6 years :( and i’m not getting any better",
      "created_utc": 1584993371.0,
      "score": 2,
      "context": []
    },
    {
      "id": "flbx8e3",
      "author": "canyonlands2",
      "body": "24 and a half. I remember looking at myself months ago and thinking, “when did I get this old without ever being young?” My ED controlled my entire youth. If we want to get overly dramatic, it stole my teens and it’s still present in my 20s. I went through a window of depression in my late teens and earlier 20s. Back when I was 22, going through a depressive episode because of a break up and big changes in my life, I kept thinking the last time I felt genuinely happy: it was the summer before I turned 20 and it was because I had unintentionally lost a ton of weight. But you know what? That was a moment I felt happy, not a period, because what happens after is the obsession and compulsion of wanting to lose more or stay the same.\n\nBut you can’t move forward in your life if you stay the same. It’s not easy, and I would be telling you a lie if I told you I had control over my ED. I don’t. It’s always there, but it doesn’t make me happy, not really. I’m sorry you’re still suffering and you wished this was something you’d grow out of. I wish it was just a phase too. Talk to your therapist about it when you feel comfortable. There’s relapses all the time, but getting help can mean you adequately deal with a relapse or at least understand that what you’re going through? It doesn’t have to be forever.\n\nI wish you the best in your journey and hope you feel peace.",
      "created_utc": 1585014723.0,
      "score": 2,
      "context": []
    },
    {
      "id": "flao5dg",
      "author": "the_scientist52",
      "body": "I feel very much the same.  My best advice is to try to use this feeling to your advantage.  Don't shame yourself for struggling at this age, but tell yourself \"I've had an ED for a long time.  I'm tired of it taking over my life and it's time for me to really live.  I want it to be gone for good now and I'll take steps to get there.\"  I recommitted to recovery a couple of months ago and honestly, a big part of my motivation was not wanting more of my life to be wasted in an ED.  At age 25, you still have a lot of life left and if you work towards recovery, think of all of the years you can spend in freedom and not having to deal with this.",
      "created_utc": 1584987744.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flbr80e",
      "author": "yktop1396",
      "body": "I'm 28 and I wish I could retweet this. Sending hopeful and positive thoughts your way <3",
      "created_utc": 1585010774.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flbtmns",
      "author": "Nozmelley0",
      "body": "I'm 35.  And, well, there's a reason I'm reading this sub.",
      "created_utc": 1585012329.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flbu4o8",
      "author": "klydsp",
      "body": "33 here and I feel you big time. I thought I was getting better then decided to weigh myself after months of not paying attention and, well away we go.",
      "created_utc": 1585012656.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flbvdwr",
      "author": "simonemeatsix1",
      "body": "You aren’t alone... I am 25 too and feel like I’ve been dealing with this shit for too long now 😢",
      "created_utc": 1585013487.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flbvztj",
      "author": "gumptiousguillotine",
      "body": "Hiya! 9 years here, 10 in august. I don’t have much to add but you’re definitely not alone. I’m sorry it’s rearing it’s head again and I really hope you can be well soon.",
      "created_utc": 1585013900.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flc1asz",
      "author": "sfvsparkes",
      "body": "I’m 27F, I hear you, I feel too old for this every day. Sending love.",
      "created_utc": 1585017456.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flcyo9n",
      "author": "Lauren_1357",
      "body": "You're not alone, I've got over 20 years, and I'll be 31 in June. I was diagnosed with AN right before I turned 10 (it was a pretty extreme case). Hospitalized 3X, once at a long-term residential facility. Many people conceptualize and treat these disorders as adolescent ones. But they are with you (in some form) for life, and your triggers, symptoms, needs, etc. will change throughout developmental stages. I never imagined I would be struggling today. \n\nJust one piece of advice that I wish I could make *my* 25 year old self more seriously consider...If you're struggling with weight gain/recovery for your *own* sake (e.g. not realizing yet that you *deserve* happiness, or thinking that you're *only* hurting yourself), of course true wellness and healing *must* be for yourself. BUT, if it helps motivate you, consider how your health habits now are affecting the possibility of motherhood down the line. You don't know *now* what you'll want in several years. My soon-to-be-husband wants children, but I haven't had a period for over 3 years, and my hormones are all very low. Even if I can gain weight now, my disordered eating has likely done *irreversible* damage. I'm in no financial position for things like IVF, and I don't have time to wait given my age.\n\nEven if I could give birth, how would my current attitudes towards food and negative body image affect my children? Having studied developmental psychology, I can tell you that children understand and are affected by *far* more than parents think they are. **Think about what you would tell a younger version of yourself, or your child, if you could. Would you be gentle and encouraging? Would you teach self-love?** **Try to think of recovery as treating yourself AND your** ***future*** **self like someone** ***worth*** **taking care of. Because you are.**\n\n**And you're stronger than you know. You can grow** ***every*** **day. That's not just cheesy self-help positivity. Your brain is plastic and it will change as you work on negative thoughts and behaviors.**",
      "created_utc": 1585051513.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fld7i9g",
      "author": "iscream80",
      "body": "I was 25 years old when I finally went to IOP at Renfrew.  It was embarrassing at first because I thought I was too old for that. Like you said. \n\nI have not restricted or listened to that voice since then. I’m almost 40. I thought I’d be like that forever. But I needed to get serious. I needed to let people know who were closest to me. And once the secret was out - it made all the difference, too. \nI spent 14-25 yrs old consumed by anorexia and bulimia.  I felt exactly like you have described.  I got serious and got help and within a year I felt like the world was lifted off my back. It took IOP and weekly therapy.  But it was worth it.  It’s harder to return to something so secretive after it’s no longer a secret.  And after hearing how much people want to help and want to see you succeed.  People around you do want t help they just don’t know how. And the people who don’t want you to get better are the ones you leave behind.  \nThis is a short version of my turnaround.  Lol.  But I thought I’d add that in case it helps at all.",
      "created_utc": 1585058445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fleay1z",
      "author": "None",
      "body": "26 and keep telling myself the same damn thing. But it never fking ends.",
      "created_utc": 1585080889.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flki41y",
      "author": "None",
      "body": "24F. Understandable for sure.",
      "created_utc": 1585241351.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flrnc5c",
      "author": "moondumpling",
      "body": "Hi there~ you're not alone for sure -- I suffered from an AN when I was 14 and struggled with it till I was around 16. From 17 to 18 I made some progress towards recovery, but from 21 I basically teetered on the edge of a relapse until I finally fell through the cracks last year at 23. I'm 24 this year and currently working through my relapse. You're not alone, sending hugs.",
      "created_utc": 1585423781.0,
      "score": 1,
      "context": []
    }
  ]
}