{
  "id": "fogdib",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1585094988.0,
  "title": "Request: i regret ever speaking up",
  "selftext": "(F 20) about a month or so ago i told my mom about my ed bulimia, ever since then she wont stop mentioning in front of my friends or her friends or even just at home in like a loud manner when my sister and father are there, everytime she sees me eating she goes \"thats why you throw up so much, stop eating in such large quantity\" or she goes \"ik how you think, you eat alot and then you feel guilty so you throw up, stop eating alot in the first place\" she does it when ever she sees me next to food or eating or just having just finished it, or she makes stupid senseless jokes about it infront of people WHO SHOULD NOT KNOW ABOUT IT. it makes me regret ever telling her about it when i broke down before and blurted it out, it makes me feel like i dont want to ever eat infront of her or eat in general, i dont restrict but this is getting on my nerves and i hate it i hate it i hate it. she doesn't understand and she never will.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fogdib/request_i_regret_ever_speaking_up/",
  "score": 308,
  "num_comments": 17,
  "comments": [
    {
      "id": "flf18jm",
      "author": "BlumpkinsRule55",
      "body": "My heart hurts for you. It’s literally nothing to speak lightly of and I’m so sorry you don’t have that support system there. Maybe you could try telling her how serious it is and how largely it has affected your life and how harsh her words are. I hope you find a way to not let her affect you or your progress.",
      "created_utc": 1585095790.0,
      "score": 59,
      "context": []
    },
    {
      "id": "flf5nah",
      "author": "None",
      "body": "I’m not an expert but I am almost certain that counts as emotional abuse. If you are in the United States I think you can call 211 as a last resort if you aren’t sure how else to handle this... they may be able to advise you better. \n\nfrom the perspective of someone who struggled with bulimia, I am ENRAGED reading this. That does not help you, in fact it could very well make things much worse for you. She needs to be educated about what eating disorders actually are, food is only the tip of the iceberg. I’m so sorry that this happened to you. Please take care of yourself, you deserve much better.",
      "created_utc": 1585098588.0,
      "score": 42,
      "context": []
    },
    {
      "id": "flf0nts",
      "author": "None",
      "body": "Have one of your friends or even your dad or sister tell her that ED is not a joke and it's a serious illness. For me I never would have thought I would ever have some sort of ED and it was really hard for me to accept how serious it is. \n\nIm sorry that this happened to you. You can get through this, if you were brave enough to speaking out on it, you are strong enough to go through this.",
      "created_utc": 1585095429.0,
      "score": 19,
      "context": []
    },
    {
      "id": "flfeq7b",
      "author": "Devansffx",
      "body": "I am so sorry you are experiencing a lack of compassion. She is ignorant of the fact that what she says won't help. My 19 year old girl struggles. I offer a big momma hug and hope you find you way. Please don't give up.",
      "created_utc": 1585104707.0,
      "score": 10,
      "context": []
    },
    {
      "id": "flgguyc",
      "author": "None",
      "body": "I’m so sorry you’re having to go through this. I also don’t have a support network in my family as they’re all misinformed and refuse to educate themselves, believing that they know the answers already.\n\nOne of the other commenters suggested these comments from your Mum could be emotional abuse - it is. The problem is that I imagine, when pressed, she would feel entirely justified in making the comments and be operating from a self-righteous position of “I’m trying to help.” \n\nIf there are other people in your network that you trust who can talk to her alone and get her to understand that her comments are damaging and unhelpful then definitely leverage these trusted people. If not, please know that her reaction and comments reflect on who *she* is as a person and actually have nothing to do with you. Your mum is a product of her own upbringing and has her own demons to battle. Unfortunately, she’s been brought up to believe that emotionally abusing others in the name of “health” is acceptable, without actually understanding one bit about what healthy looks like. This is rife in society as I’m sure you know - everyone has an opinion.\n\nIt’s difficult at first but perhaps next time she does this behaviour try to distance yourself from the words/emotions she’s pushing towards you and just watch her with curiosity - where is this coming from? Why does she feel such a need to say what she’s saying? Why is she telling your business to everyone and what does she gain by doing so? Is she trying to shame you into conforming to her standards of behaviour? What kind of person employs shame as a tactic against the people they’re supposed to love? Does she feel out of control? Is she scared for your wellbeing? Is she worried about her image and being seen as a “bad mother” by other people, as if your ED is all about her?\n\nI understand this is going to bring up some very painful emotions/memories for you if you start to analyse your true reality, but doing so may give you more clarity and a calmer mind.\n\nBest of luck to you. Be kind to yourself as best you can.",
      "created_utc": 1585142240.0,
      "score": 5,
      "context": []
    },
    {
      "id": "flgc2a2",
      "author": "just_stephani",
      "body": "I'm so sorry hun. You should not have to put up with that. It's so hard to finally admit our Ed's to anyone and then to have it thrown in your face is complete bullshit. Stay strong. You can beat this💕",
      "created_utc": 1585138469.0,
      "score": 5,
      "context": []
    },
    {
      "id": "flf8f4m",
      "author": "None",
      "body": "Before it really set in. I tried to bring it up or ask for help from specific friends. Now they constantly set off my paranoia alarm. Example. \n\nLast night before our state got the lockdown notice. I went over to their house. I forgot my jacket, because after work was incredibly sunny, warm and made me feel incredible. But it took me too long to get out of the house. So the half hour drive saw the temp drop pretty fast. So now that must've freaked them out or (and I swear I heard them whisper this, \"he's just doing it for attention\") they thought I was trying to obvious or something. Because they proceeded to freeze me out until I was shivering inside the house. Sitting watching Scooby doo on Netflix. With my group of friends that I love. One stood by the french door with it cracked. I'm sitting two feet away. I know what he's doing. I know what he wants me to do. To go grab a blanket.\n\n\n\n>> accidentally turned this into a rant so I just split it. But this was really cathartic for me and if I don't keep it as a reply. I won't be able to use this to revisit and rethink about this <<\n\n\n\n But why can't I enjoy ONE FRIGGIN NIGHT with my friends in normality?? I'm sorry. I literally didn't think of a jacket cuz of how warm it is. I have a long sleeve button and a short sleeve under that. Leave me alone. You don't want to talk about it. Because whenever I bring it up or try to talk about issues. You give me looks of incredulity or straight nothing. I hear the whispers and the scathing, (literal) behind the back, remarks. I get you're upset with me. But I'm just as upset with myself. I'm hurting you guys and I need help, but it's hard when I don't want it this much. But no one wants to talk about it anyways even though I've tried to. So why keep bothering when you keep doing things like this? My back hurt from trying to not shiver. Why can't I sit inside a house without a blanket for once? It wasn't even that cold before you opened the door. It was comfortable. I even ate the last slice of pizza you guys left on the counter you said I could have. So why would you do this to me? I can't deal with trying to figure out if what I am paranoid about with you guys is just my wrong way of thinking or actual events, when you guy's keep doing this. Either talk about it. Or don't. But the whispering is destroying me. And I don't have the courage to say anything because I know they think I'm a fake, and when I constantly feel like a fake. It just makes me feel more miserable when I can't eat. Or feel shitty while eating. Or losing control when I am too hurt and sad to protect myself from the horrifically disturbing binges.\n\n\nBut I'm trying. I'm avoiding any of the purge cravings. I'm trying to be careful. But I'm one, broken, simple person. I can't police myself 24/7. I'm alone and came to you. I came to my closest friends and the only people I use to feel comfortable around. Now I'm miserable and I try to engage again. I try to smile and laugh realistically. But the misery turns to melancholy and that turns into a different me. The me I am still trying desperately to relearn control over. \n\nEnd rant. \n\nI'm so so sorry. But it seems like your post got some feelings and words I didn't want to voice, out. So thank you and I'm sorry that your seek of help turned so sour as well. It's hard, especially when sometimes you can understand that maybe they're trying to to do this as a way to help",
      "created_utc": 1585100381.0,
      "score": 5,
      "context": []
    },
    {
      "id": "flg37el",
      "author": "MissMisanthropia",
      "body": "I am so sorry for you and it hurts me to read what you have to go through! My mother is also constantly criticizing and invalidating me, I would never speak to her about my problems because I am sure that she would use it to hurt me. I guess there is a reason why we are using dysfunctional coping mechanisms like restricting or purging, right? You are not alone, must of us suffer from emotionally abusive parents and can relate. I hope that you can find some comfort in this community and use it as a mental shield. Right now I am stuck in quarantine with my mother, my dad is away most time of the day working and she is making every encounter hell but I keep telling myself that this is not about me, this is an expression of her own issues with herself and she doesn’t know any better, growing up with serious abuse herself. No matter what she says, I tell myself to not take it serious and don’t engage in a discussion that can’t be won. It helps a bit.",
      "created_utc": 1585128655.0,
      "score": 2,
      "context": []
    },
    {
      "id": "flgibzy",
      "author": "arimee",
      "body": "I’m sorry. I felt a lot of this reading it. I know my parents would say the same kind of thing after I told them. I know for the most part they’re concerned and don’t know how to really communicate that. But now that we’re quarantined my dad keeps mentioning how we all have to eat lighter. And he had a separate conversation with me about “not wasting food.” \n\nThey don’t get it. Maybe they never will. And it hurts. But it IS a good thing you spoke up. You will get better.  Sending love. 💕",
      "created_utc": 1585143292.0,
      "score": 2,
      "context": []
    },
    {
      "id": "flgqbwv",
      "author": "lemon_vampire",
      "body": "I'm gonna be a killjoy here but I don't care.  While I don't love this method, I also can't blame your mom for bringing up your eating disorder a lot. She wants to help you but she doesn't entirely know how.  And when she says stuff like \"I know how you think\"  It implies that she also has an eating disorder, maybe even bulimia, but unlike you, she might still be hiding it.  \n\n&#x200B;\n\nI know you feel super ashamed of your eating disorder, and you want to change, you are so desperate to get rid of this horrible and possibly deadly disorder that you even told someone about it.  You know you're so much more than bulima, but the fact remains that part of who you are is bulimic.  Maybe talking about it more might help?  It definitely didn't seem to help when you kept it a secret.",
      "created_utc": 1585148220.0,
      "score": 2,
      "context": []
    },
    {
      "id": "flgxr8m",
      "author": "None",
      "body": "Please don’t feel regret. You have unfortunately learned a lesson about who you can talk to about certain troubles in your life. And you learned your mother has her own issues she’s clearly not dealing with. I got a mom like that. I never talked to her about my eating disorder but I did talk about depression. My mom handles it like a selfish bratty child. She doesn’t get the privilege of knowing about my life anymore, she has shown me she’s not grown up enough to handle certain conversations. \nI feel this about my friends too. Only certain conversations can be had with certain friends, which I again had to learn over what their responses were like. \nOne day you won’t be living with your mom and having to listen to her weird unhelpful snarky comments. You have the strength inside yourself to succeed in life. But sometimes it’s hard to feel our strength while being around someone who doesn’t want us to know we got it in us or they don’t know we do have it in us. \nYou will conquer all, it won’t happen overnight but just know that one day it’s not going to be this hard. Nothing lasts forever. Everything is in a constant state of change. This will not be your life forever. You are loved.",
      "created_utc": 1585152340.0,
      "score": 2,
      "context": []
    },
    {
      "id": "flir22l",
      "author": "stpfah",
      "body": "You don't deserve any of that.\n\nYou don't deserve to have your confidence broken - especially by a parent. You don't deserve to have your food and eating criticized - especially by a parent. You don't deserve to be publicly shamed - especially by a parent.\n\nI'm really glad you came here and posted. Reaching out for help is really hard to do. Excellent work. I hope from the responses you feel understood and not alone.  You are not alone.",
      "created_utc": 1585188681.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fllp4b2",
      "author": "DelicatePrimrose",
      "body": "Im so sorry she’s doing this to you. You deserve a lot better and she’s being a terrible parent/human being.",
      "created_utc": 1585264907.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fln1l2e",
      "author": "SabinaSanz",
      "body": "EDs are closely related to our relationship with our mothers. When my mom found out she was angry at me, like horribly pissed. Then she told people she shouldn't have. It took me a while to heal from that. I was distant from her for a long long time. Now we have a better relationship but I don't trust her. I'm sorry this is happening",
      "created_utc": 1585305676.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fme39ly",
      "author": "lost_lychee",
      "body": "I am so sorry that your going through this. \n\nIt’s horrible and it absolutely doesn’t help you. I think you should blank out  tell her that what she is doing is the wrong thing to do and that she as a mother is now helping you get worse instead of well and in that hurting her daughter. \n\nAnd if she dose not understand or cares about than you have to find a away she will. \nmaybe making your dad understand or maybe a teacher can help you. You need someone to back you up and say to her(your mom) “ya no , what you are doing is not ok”, then thats what you need to do and even if just give you support that you need in general. \n\nAnd in regards to you and your health, maybe you should see a therapist if you aren’t. Its so important to deal with this and move on to the next stage where you are stronger and much more able to deal, and that comes through therapy.\n\nLove you with all my heart and i really hope everything will be ok xxxxx",
      "created_utc": 1585987537.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmrlpuc",
      "author": "FreeTapir",
      "body": "Your mom sounds like she has trouble understanding emotional intelligence in topics related to it. I would entirely ignore her and not share anything personal with her again, on the sub and talk to us find support groups find friends, but that is the last time she gets told anything unless you want more inappropriate responses or you feel that you're able to handle a very inappropriate response.",
      "created_utc": 1586327123.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn8a19n",
      "author": "None",
      "body": "I am absolutely disgusted reading this! I can only imagine how difficult that must be for you.\n Parents have a way of making your problems seem irrelevant and something that can easily be fixed, that's kind of what my mum does too! \nFor my mum, I think it was the only way she knew how to react, she didn't actually know what else to do about it as she had absolutely zero experience with EDs and didn't know how to deal with trying to help me. \n Your mum might also be like this, try calmly talking to her and help her understand how it makes you feel, tell her how it makes you feel when she reacts the way she does too. Suggest ways in which she could help, for example by just listening and being there for you\n Most importantly, don't doubt what you're going through! Your struggles are very valid and don't let your mum make you doubt that. If you can please look into getting some professional help, if you're still in school there should be free help available!",
      "created_utc": 1586737083.0,
      "score": 1,
      "context": []
    }
  ]
}