{
  "id": "fovhb9",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1585161186.0,
  "title": "Request: Came out to my partner and I feel like I made a mistake",
  "selftext": "I'm unsure of what to do. I (F24) finally told my bf (M27) of 2 years about my ED of 7 years now. He's my best friend who's so supportive and makes me feel like so loved. We moved in together after a year of doing long distance. I never thought I would tell him about my little secret, I thought it was something I could keep him in the dark about until it eventually went away.\n\n I get stuck in a pattern: Eat moderate amount of calories a day, lift at the gym 4x a week, don't eat beyond 7pm, and use meds to aid in appetite suppressant. And then there will be one day in the week where I will splurge on to a somewhat normal amount of calories and then try to compensate with restricting and vigorously exercising.\nMy family have always had their suspicions about my eating patterns but those discussions never got anywhere productive. My childhood best friend is the one I confide in for when I'm especially struggling or when I was successfully able to \"forgive myself\" for overeating.\n\n Back to my boyfriend, ever since he saw me faint infront of his eyes, he's made more comments geared towards eating, like \"you should eat dinner, sweetie,\" and \"let's fatten you up\".\n\n But then one night two weeks ago when we got fast food together on the way home from clubbing he said \"This is the first time we got fast food together\" and added \"you eat less than you did before, you're smaller than when we first met\". In the moment, my tipsy self just word vomited \"I've been struggling with an eating disorder for a long time.\" I told him for how long and who knew, and all he could say was \"and you waited this long to tell me?\"....we never talked about it since, and kinda just carried on like I never told him. I thought I would feel better, but I feel more anxious. \n\nIdk what he's thinking or if he sees me differently. Anyone else come out to someone and somewhat regret telling them?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fovhb9/request_came_out_to_my_partner_and_i_feel_like_i/",
  "score": 67,
  "num_comments": 10,
  "comments": [
    {
      "id": "flhf2oa",
      "author": "Nashira46",
      "body": "People often don’t respond the way we expect or think they should. My guess is it sounds like you need to talk more. What was your aim in telling him? If it was for him to understand you better, you will probably need to initiate more talks and continue to open up and be patient. It can be really hard for people who have never given these issues much thought, to know how to be supportive.",
      "created_utc": 1585161448.0,
      "score": 39,
      "context": []
    },
    {
      "id": "flhmjv8",
      "author": "mazotori",
      "body": "I think talking about it more with him may relieve some of your anxieties about how me may or may not be feeling/thinking.",
      "created_utc": 1585165500.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fli1mwt",
      "author": "Powasam5000",
      "body": "As a guy whose gf of 7 yrs has an eating disorder, it's pains me that my gf says she trusts me and I'm her best friend yet she keeps many secrets regarding the Ed from me. I understand why, but I'm just saying for the OP. When they tell you stuff later or you find out on your own, it feels like they don't really trust you and hurts alot. I totally understand why, I'm just saying it's like a dagger sometimes.",
      "created_utc": 1585173588.0,
      "score": 14,
      "context": []
    },
    {
      "id": "flhu139",
      "author": "mennaisapotato",
      "body": "with my mom. she is using it 24/7 thinking she is advising me but she doesn't even know anything about it. it makes me furious that i cant take back what i said",
      "created_utc": 1585169483.0,
      "score": 3,
      "context": []
    },
    {
      "id": "flhz8nh",
      "author": "the_scientist52",
      "body": "It's definitely time to talk to him again.  The only way to know what he's thinking or if he sees you differently is to directly ask him--mind reading may be tempting, but it's often inaccurate.  It's best to check the facts with the person and let them explain.  My guess is that it came as a shock to him and if he doesn't have a lot of experience/knowledge about mental health, he might not know what to say that wouldn't make things worse.  He also could very well be offended that you'd never told him before, which is valid because it might come across as you being dishonest.  However, with mental health issues it's also perfectly valid for the sufferer to not want to share due to stigma, shame, fear of abandonment, etc. and I think if you explain your reasoning he could better understand.  It could also be a time for you to express what kind of support you would potentially like from him, and to ask him what support he would feel comfortable offering.  \n\nThe bottom line is that you both need a chance to share how you're feeling.",
      "created_utc": 1585172285.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fli102k",
      "author": "simonemeatsix1",
      "body": "I think you should talk to him again sober. From my experience a lot of people do not know how to react to something like this if they know nothing about it. I get how hard & embarrassing it can be opening up to someone but the right person will support and help you. Hope everything works out for you <3",
      "created_utc": 1585173237.0,
      "score": 2,
      "context": []
    },
    {
      "id": "flj2r7q",
      "author": "nodaybuttoday__",
      "body": "He clearly doesn’t understand that it’s an elusive, secretive and scary disease. He will probably be angry for a while, but right now he needs to learn how to support you most, and not saying the shit he’s been saying to you is probably a good start.",
      "created_utc": 1585197185.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fljpmx7",
      "author": "FR33_WILLI",
      "body": "As someone who's girlfriend is recovering from an eating disorder. I'd say he is most likely scared. Now it's not your fault at all and telling him was definitely a good thing. However, you must understand that it can be worrying especially if he hasn't noticed it himself he's probably beating himself up a bit too. If you can please get yourself into therapy it will help 100x more than any boyfriend can as they are trained to deal with it. Don't be afraid to tell him things though it sounds like he is an understanding person. Best of luck to you.",
      "created_utc": 1585222439.0,
      "score": 2,
      "context": []
    },
    {
      "id": "flj0y2x",
      "author": "alligatorskins",
      "body": "ngl i can see how ur partner could b upset with this nobody likes things being hid. especially after so long",
      "created_utc": 1585195738.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fljxord",
      "author": "dedopotatoe",
      "body": "I feel like he doesn't want to push you. He knows this is hard to talk about, as you waited a long time to tell him, and he probably feels like he fucked up his chance of getting you to talk the first time around with that abysmal response. He was drunk too I imagine, and probably regrets saying it. I'd say when you're ready, and comfortable, sit down and tell him that you've been keeping things to yourself for a long time, how much it all weighs on you, but that you're finally ready to talk now. And tell him whatever you want. Maybe you want to share how you feel, or how it started, or how your eating disorder presents. Maybe you want to tell him what kind of things trigger you, or how he can help you, or maybe you're tired to keeping it all inside and you just want to tell him everything and have a 4 hour heart to heart and let him know EVERYTHING. \n\nWhat's important is that you talk about this with someone you love and trust.",
      "created_utc": 1585229337.0,
      "score": 1,
      "context": []
    }
  ]
}