{
  "id": "fr4nw7",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1585482205.0,
  "title": "Request: How to stop the urge to binge during quarantine",
  "selftext": "Due to several unfortunate circumstances, I'm currently staying at home with my parents and sister until further notice. All of us work from home, sis has online school so there's basically very little privacy. This whole situation + the inability to go out shopping without a good excuse and find fast food in a small town makes me very anxious, which just amplifies my urge to binge eat and drink. However if I succumb, my parents will notice something's wrong. I try to keep myself contained but it's hard when your only coping mechanism in stressful situations is food and alcohol. I need some tips to stop myself from going haywire on my family's food supplies and feeling like shit for it afterwards.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fr4nw7/request_how_to_stop_the_urge_to_binge_during/",
  "score": 80,
  "num_comments": 16,
  "comments": [
    {
      "id": "fltpffh",
      "author": "Carranbieri",
      "body": "Try doing something that distracts you. Indoor sports or going for a walk or run (if you can go out). Take a bath, or (cold) shower, go to bed (this is my favourite one). The more you think about not wanting to eat, you will feel the urge to eat. So do something to keep you from thinking about it.\nThings that aren't really engaging, like watching TV, won't help, though, so best avoid these.",
      "created_utc": 1585482634.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fltr33e",
      "author": "ajwajli",
      "body": "i recommend listening to [Stop Binge Eating podcast](https://open.spotify.com/show/4omPYjNK6bIU1C0iwS6vff?si=xCUfpAnmSeSuin4hiOxLMw)",
      "created_utc": 1585484388.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fltwq1j",
      "author": "squareCat99",
      "body": "I always try and use various techniques to distract, etc when I'm feeling antsy like that.  You can try reading, journaling, drawing/painting.   Activities like coloring, puzzles, origami, or knitting can help keep you distracted.   Craft projects are great and you can order them online.  You can ask your sister to play board games, or even things like putty or stress balls can help if you don't want to talk to other people.",
      "created_utc": 1585489471.0,
      "score": 5,
      "context": []
    },
    {
      "id": "flu8ztr",
      "author": "houston_veronica",
      "body": "Lots of pragmatic suggestions below that are great - I would just say: think of the situation. Food is scarce, and it really could be harmful to go haywire. Unlike other times, we are in weird times! So - maybe use this as a challenge to see how it goes if you try to really stop the binge from happening. It may be that this COVID situation is going to help you stop bingeing. If you do it, don't beat yourself up - but remember, that guilt and horrible feeling will happen, and if you can avoid that, it's best. That's worse than food supplies going down, IMO.",
      "created_utc": 1585497798.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fluxpc0",
      "author": "mylessandovaldpt",
      "body": "There are a lot of people struggling with this unprecedented set of circumstances. Page 42 has some harm reduction guidelines for people with EDs during COVID-19: [https://docs.google.com/document/d/1vPk9JbgWrGCL4LbjAmVbVW-g2fD5DFBP\\_P-8ov2F4sY/edit?usp=sharing](https://docs.google.com/document/d/1vPk9JbgWrGCL4LbjAmVbVW-g2fD5DFBP_P-8ov2F4sY/edit?usp=sharing)",
      "created_utc": 1585512209.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fltrye7",
      "author": "workingonselfkind",
      "body": "Commenting so that I can also read some suggestions!",
      "created_utc": 1585485262.0,
      "score": 3,
      "context": []
    },
    {
      "id": "flu7qbq",
      "author": "None",
      "body": "Always keep yourself busy doing something to take your mind off food. The urges will soon dissipate, its because you aren’t used to being at home 24/7 with food readily available like this.",
      "created_utc": 1585497035.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flueyx6",
      "author": "WaterIsMyLife2",
      "body": "I'm still trying to figure it out to, stuck living with family during quarantine. It's hard. I thought I was doing ok, and I'm finally admitting to myself that I am not, I binged 4 times this week. I'm just not in control of my food intake, which is fucking me up. I won't want to eat, my mom will make me eat, and then I'll binge on everything in sight. The moment I feel like I've eaten more than I wanted to, everything feels like failure and I give in to the temptation to use food to feel better. It's so easy when all this junk is so accessable. \n\nWhen I'm going to try to do, and recommend that you try, is planning. Take control of your intake while you're in a good mindset and plan out exactly what you're going to eat and when.",
      "created_utc": 1585501267.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fluk9s2",
      "author": "caughtlitesneez",
      "body": "Totally understand, I find audio books helpful, strange enough 💕",
      "created_utc": 1585504300.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fluwln4",
      "author": "333Ginger333",
      "body": "I’m assuming you can’t go anywhere because of a nationwide lockdown? (Im in NZ but know other countries have the lockdown as well). Do you live in town or rurally. Either way, go for a walk. Look after yourself and get that it of distance that you need, if only for a little bit. It’ll be ok 😘",
      "created_utc": 1585511557.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flv011n",
      "author": "None",
      "body": "I haven’t been able to stop and I don’t know what to do :(",
      "created_utc": 1585513566.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flvldvb",
      "author": "Atxrecovery",
      "body": "Hi here is a google doc with a lot of support groups. It might be helpful to connect with people going through similar struggles. \nI also love using DBT TIPP Skill. If you google it, you should find instructions on how to use it. \n\nhttps://docs.google.com/document/d/11IsP3yKZlUwW_hP4180BFLN8dOFvy6faxiTwCkZ6x4Q/edit#",
      "created_utc": 1585526370.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flw6lhc",
      "author": "birdkey26",
      "body": "I love love love the Phit and Phat podcast-binge on those episodes if you can. Corrine is no bullshit and she has free printouts. Work through her system. Stay strong. It’s tough I know. 💜",
      "created_utc": 1585541039.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flwqyku",
      "author": "wildeyedsinner",
      "body": "i just don't go to the kitchen until its actual meal time. if i actually get like hungry ill get something small but not too much. i struggle with this too snd it seems to help a lot, maybe it could help you.",
      "created_utc": 1585561619.0,
      "score": 1,
      "context": []
    },
    {
      "id": "flwsp6d",
      "author": "Neko-Chan-Meow",
      "body": "Ive found playing stardew valley to be relaxing and keeps my mind off eating/binging.",
      "created_utc": 1585563639.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm13xy7",
      "author": "BlackBarbie3",
      "body": "I take it day by day, but I find that going for a walk helps diminish urges. 🙂",
      "created_utc": 1585671551.0,
      "score": 1,
      "context": []
    }
  ]
}