{
  "id": "fsmm1j",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1585692870.0,
  "title": "Request: Dealing with comments on your eating",
  "selftext": "I bring my lunch with me to work every day, and it’s always rice and vegetables.\n\n It’s bland and flavorless, and it’s all I’ll allow myself to eat. It’s almost always my only ‘meal’ of the day. And without a doubt, my coworkers always comment/joke about my lunch, and it’s very triggering.\n\nThey will ask what else I eat, or where I get my nutrition and I obviously have to lie. I hate it so much, it makes me not want to bring a lunch at all, but I know that’ll bring up more questions. How do you deal with people being invasive and commenting on your ED?\n\nIm scared to bring up my discomfort with their concern over my eating",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fsmm1j/request_dealing_with_comments_on_your_eating/",
  "score": 73,
  "num_comments": 17,
  "comments": [
    {
      "id": "fm2auo6",
      "author": "jcolesuperfan",
      "body": "Unfortunately this type of thing happens way more than it should & you shouldn’t feel like you owe an explanation to your coworkers for anything personal-related, especially when it comes to eating habits. If “going out” to lunch is an option, take it. You can eat your meal at home or even in your car & avoid your coworkers’ comments. If leaving isn’t an option I think you’re handling it well but you can always say something that redirects their comments to time. I usually mention something about talk < time & I need to maximize my productivity at work. It’s tough hearing comments like that often especially in the workplace but kudos to you for handling it as well as you had been.",
      "created_utc": 1585693821.0,
      "score": 24,
      "context": []
    },
    {
      "id": "fm2dgrq",
      "author": "None",
      "body": "People who don't have eating disorders view meals in such a completely different light, they probably just think it's kind of funny to point out your food choices, wouldn't even consider it would be triggering. That said, doesn't make it any less frustrating. \n\nWhen I was anorexia restricting (many years ago at this point) in college I was always annoyed at people constantly making comments on my food choices and how I just ate vegetables, small amounts, etc. Honestly, what was worse was when I started recovery and people would make comments like Oh wow you eat SO MANY TIMES in one day you're eating all the time. Basically anyone commenting on what I ate was frustrating. \n\nNow as an essentially fully recovered person I no longer can imagine caring about these comments. I think it's because after several years (repetition repetition is everything with recovery) of expanding my food choices and learning it's ok to eat \"normal\" meals, something shifted in my brain. So I know it sucks now, but if you stay strong with recovery, these types of things get better. Xo",
      "created_utc": 1585695291.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fm2dk1j",
      "author": "Margkam",
      "body": "Although it’s unfortunate that you’re in this position and your eating is none of your coworkers business, that is such a common thing to wind up happening. I think people who don’t have eating disorders don’t even have the thought that their queries may be invasive and upsetting. I have taken the tactic before that I have some sort of allergy, special dietary need, etc. IBS is one I’ve used, people tend not to ask beyond the poop implication. I wish you the best of luck.",
      "created_utc": 1585695341.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fm2eaqu",
      "author": "updown27",
      "body": "I love this topic. I spent a long time making it very clear that what I eat is nobody else’s business. Here’s a nice list of things you can say:\n\n“I’m not interested in talking about that.”\n\n“Please don’t ask me about my food.”\n\nSilence.\n\nAbruptly change subject.\n\n“I don’t want to talk about food.”\n\nLearn to say exactly what is on your mind. It will feel really bitchy at first but you’re allowed to set a boundary and the more you do it the less this will happen. I had to do this at my current job and they never ask anymore. However, I have to add, if that’s the only meal you are eating i suspect you’re co-workers know very well why you eat that every day. Perhaps they are concerned by, or judgmental of your condition. I hope you are in treatment. If so, the phrase that has had the most power for me is, “I’m in treatment for an eating disorder. I’m following guidelines given to me by my clinicians and I prefer not to discuss it further.” Once it was out in the air I used the phrase “doctor’s orders!” to remind people. \n\nBrainstorm phrases that will work for you, practice them out loud, and go for it!\n\nEdit: I know that a lot of people would be super uncomfortable telling their coworkers about their health conditions and you don’t owe anyone an explanation! Short and simple answers are great too.",
      "created_utc": 1585695761.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fm2gzqv",
      "author": "ResponsibleTea",
      "body": "I’m not sure where you are at in your recovery, but I do hope that you are at least on the path to recovery. \nAs a social worker who has worked with ED, one of the reframes that we help people focus on is to try to focus on your health, and not your body/calorie intake etc. \nFood is medicine! Everyone needs to eat to survive. Try to respond to your coworkers with health-focused statements. This is easier said than done depending on where you’re at, but remember that food makes your body and your mind strong and you have no reason to feel ashamed for nourishing yourself 💕 (That said, it sounds like maybe you’re not nourishing yourself as much as you deserve. I really hope you can work to focus more on the nourishment you need rather than on the ED thoughts that are stopping you from getting there)\nIdeas on how to respond:\n“Just keeping it cheap and getting my vegetables in!”\n“Doing what I need to do to survive!”\n“I’m a creature of habit- I found something I liked and I’m sticking to it!”\n“Im eating everything I need to keep me going through the day!”\n“I appreciate your concern for my boring ol lunch but I think I’d shock the whole office if I changed my ways, so if ya don’t mind I’d rather avoid talking more about my same ol meal cuz I’m not planning to change!”\nOr some variation of those, depending on your personality. Humour is my favourite because you can get people to shut up and still come across as nice! As a vegetarian, I used to hate people commenting on whether I got enough protein (you don’t see me asking them if they got enough of their daily nutrients!), but I learned to realize people are just looking out for me because they care, and they are just genuinely curious! \nBe kind to yourself! (And to those who care about you). I would also highly recommend looking up some CBT exercises to help with your negative thoughts, a thought record is a good place to start!",
      "created_utc": 1585697290.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fm2vxu5",
      "author": "iGetHighPlayRS",
      "body": "Put headphones in during lunch. Even if there’s nothing playing. Ignore their comments and they’ll get the hint",
      "created_utc": 1585706666.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fm38t4e",
      "author": "Rainnie_",
      "body": "I totally know how I feel. It’s like we want to recover and we need support but all the people around us are not supporting ... this is sad",
      "created_utc": 1585715950.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm40ara",
      "author": "None",
      "body": "I fully understand how exhausting this feels. Most days i get this too and a way I’ve learned to prevent this from happening is setting a boundary and telling them straightforward how it makes me feel. I don’t go into any detail or say much about it but something like ‘talking about food can be a very triggering topic for some people, it’s not funny to joke about, so i appreciate if we leave this conversation here :)’ could be helpful. I figured out taking a more kind route (as much as you have every right to go off on them) makes them more likely to understand how sincere you are about not talking about it. I guess that could depend on how close you are with your co workers but i really hope this helps and i wish you the best!",
      "created_utc": 1585743012.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm4pf8a",
      "author": "amandalucia009",
      "body": "i’m glad to read your post to get an understanding from the ED side - someone close to me has an ED, not me\n\ni’m guilty of doing this & it was probably out of ignorance but also out of concern for my loved one who suffers from ED. if you can look at it as concern for your well being, would it maybe help not to bother you so much?\n\nit’s like if someone is obviously an alcoholic: a lot of people would show concern for that person by asking if it’s healthy for them to drink so much or so often or so early. whether they are right or wrong in asking those questions, it’s mostly done out of concern\n\njust trying to give the perspective from the outside. it is probably because they care about you that they care",
      "created_utc": 1585758386.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm3fjek",
      "author": "MissMisanthropia",
      "body": "Hi there, I can relate to you sooo much! For „normal“ people talking about food is a smalltalk topic, for me it is stress and causes anxiety every time I have to eat with others. Unfortunately it is a social obligation at my workplace to eat with the others at the cafeteria. I eat salad and every time someone comments on the huge amount of salad I eat. It makes me go crazy. I feel ashamed for the amounts I eat and fat, even though I know that am skinny. I managed it to tell them that i consider it rude to comment on my food and I started to preventively tell the waiter that it’s too bad I can’t fit even more on my plate. It helps a bit and I fight off the stupid comments if I start and then change the topic. \nI few weeks ago I had to attend a workshop and the thought of eating with strangers stressed the hell out of me, I almost left as I realized there is no way to eat alone without being considered odd. I mentally prepared myself that there will be comments and I can handle it. Of course, someone commented in the “mountain of salad” and I just replied that I am sure I can allow it to myself considering how lean I am, the “healthy sized” girl making the comment was a bit bewildered but left me at peace. \nAnyways, due to corona I can finally eat alone at my desk, which is very relieving.",
      "created_utc": 1585721807.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fm3h4ud",
      "author": "None",
      "body": "I tell them the truth: I am trying to lose weight, and it's difficult. Im managing by having a strict diet, because I realize that if I allow myself to cheat, I always end up on the slippery slope back to where I was. I tried\"being reasonable\" and it failed, now I am trying to \"be strict\" with some rules I agreed to. \n\nBy talking about it with people, Ive felt it reinforced my will. There will always be welcomed advice and a lot of unwelcome, bad, or useless advice. This is where I let myself some leeway, where I point it out that its wrong, unwelcomed or useless. Or, usually I just listen to it and understand that it comes from good intentions. This helps me in my area of my life. Just like the advice im giving you, from your perspective, it might fall within any of those category, but I hope you understand it comes from good intention. \n\nI used me as an example because I can't know what will work for you, but I hope it helps you find it.",
      "created_utc": 1585723341.0,
      "score": -2,
      "context": []
    },
    {
      "id": "fm2exhk",
      "author": "None",
      "body": "Heck, eat at your desk. Get a daily 30 min podcast and zone out. I do it and it’s kinda nice.",
      "created_utc": 1585696124.0,
      "score": 7,
      "context": [
        {
          "id": "fm2auo6",
          "author": "jcolesuperfan",
          "body": "Unfortunately this type of thing happens way more than it should & you shouldn’t feel like you owe an explanation to your coworkers for anything personal-related, especially when it comes to eating habits. If “going out” to lunch is an option, take it. You can eat your meal at home or even in your car & avoid your coworkers’ comments. If leaving isn’t an option I think you’re handling it well but you can always say something that redirects their comments to time. I usually mention something about talk < time & I need to maximize my productivity at work. It’s tough hearing comments like that often especially in the workplace but kudos to you for handling it as well as you had been.",
          "created_utc": 1585693821.0
        }
      ]
    },
    {
      "id": "fmd8ehu",
      "author": "None",
      "body": "Same here. I've asked my loved one about intake and it comes across as nosy, invasive or cold. My intent is to have a bigger conversation, without having to lead in so directly. I'm hoping it will open a larger conversation, like the drinking example - it's ride to ask if someone's an alcoholic, but caring to ask if they are doing ok \"I noticed you've been at the bar every night this week\"",
      "created_utc": 1585961661.0,
      "score": 2,
      "context": [
        {
          "id": "fm4pf8a",
          "author": "amandalucia009",
          "body": "i’m glad to read your post to get an understanding from the ED side - someone close to me has an ED, not me\n\ni’m guilty of doing this & it was probably out of ignorance but also out of concern for my loved one who suffers from ED. if you can look at it as concern for your well being, would it maybe help not to bother you so much?\n\nit’s like if someone is obviously an alcoholic: a lot of people would show concern for that person by asking if it’s healthy for them to drink so much or so often or so early. whether they are right or wrong in asking those questions, it’s mostly done out of concern\n\njust trying to give the perspective from the outside. it is probably because they care about you that they care",
          "created_utc": 1585758386.0
        }
      ]
    },
    {
      "id": "fm4qi7c",
      "author": "the_scientist52",
      "body": "Yeah to me talking about \"reinforcing your will\" falls under encouraging the ED which isn't allowed on this sub.  I know that wasn't your intention but I'd caution against giving advice like this in the future that isn't helpful for anyone with an ED (including yourself).",
      "created_utc": 1585758949.0,
      "score": 3,
      "context": [
        {
          "id": "fm3h4ud",
          "author": "None",
          "body": "I tell them the truth: I am trying to lose weight, and it's difficult. Im managing by having a strict diet, because I realize that if I allow myself to cheat, I always end up on the slippery slope back to where I was. I tried\"being reasonable\" and it failed, now I am trying to \"be strict\" with some rules I agreed to. \n\nBy talking about it with people, Ive felt it reinforced my will. There will always be welcomed advice and a lot of unwelcome, bad, or useless advice. This is where I let myself some leeway, where I point it out that its wrong, unwelcomed or useless. Or, usually I just listen to it and understand that it comes from good intentions. This helps me in my area of my life. Just like the advice im giving you, from your perspective, it might fall within any of those category, but I hope you understand it comes from good intention. \n\nI used me as an example because I can't know what will work for you, but I hope it helps you find it.",
          "created_utc": 1585723341.0
        }
      ]
    },
    {
      "id": "fm3wf2e",
      "author": "jcolesuperfan",
      "body": "This is not necessarily helpful. I don’t believe that personal reinforcement when it comes to an ED is beneficial, especially when calling it a “weight loss” diet. AN is something to be addressed as such, not as a strict dietary plan. Please delete your comment.",
      "created_utc": 1585739478.0,
      "score": 1,
      "context": [
        {
          "id": "fm3h4ud",
          "author": "None",
          "body": "I tell them the truth: I am trying to lose weight, and it's difficult. Im managing by having a strict diet, because I realize that if I allow myself to cheat, I always end up on the slippery slope back to where I was. I tried\"being reasonable\" and it failed, now I am trying to \"be strict\" with some rules I agreed to. \n\nBy talking about it with people, Ive felt it reinforced my will. There will always be welcomed advice and a lot of unwelcome, bad, or useless advice. This is where I let myself some leeway, where I point it out that its wrong, unwelcomed or useless. Or, usually I just listen to it and understand that it comes from good intentions. This helps me in my area of my life. Just like the advice im giving you, from your perspective, it might fall within any of those category, but I hope you understand it comes from good intention. \n\nI used me as an example because I can't know what will work for you, but I hope it helps you find it.",
          "created_utc": 1585723341.0
        }
      ]
    },
    {
      "id": "fm4mrg1",
      "author": "None",
      "body": "If you don't find it helpful feel free to ignore it.",
      "created_utc": 1585757004.0,
      "score": -1,
      "context": [
        {
          "id": "fm3h4ud",
          "author": "None",
          "body": "I tell them the truth: I am trying to lose weight, and it's difficult. Im managing by having a strict diet, because I realize that if I allow myself to cheat, I always end up on the slippery slope back to where I was. I tried\"being reasonable\" and it failed, now I am trying to \"be strict\" with some rules I agreed to. \n\nBy talking about it with people, Ive felt it reinforced my will. There will always be welcomed advice and a lot of unwelcome, bad, or useless advice. This is where I let myself some leeway, where I point it out that its wrong, unwelcomed or useless. Or, usually I just listen to it and understand that it comes from good intentions. This helps me in my area of my life. Just like the advice im giving you, from your perspective, it might fall within any of those category, but I hope you understand it comes from good intention. \n\nI used me as an example because I can't know what will work for you, but I hope it helps you find it.",
          "created_utc": 1585723341.0
        },
        {
          "id": "fm3wf2e",
          "author": "jcolesuperfan",
          "body": "This is not necessarily helpful. I don’t believe that personal reinforcement when it comes to an ED is beneficial, especially when calling it a “weight loss” diet. AN is something to be addressed as such, not as a strict dietary plan. Please delete your comment.",
          "created_utc": 1585739478.0
        }
      ]
    }
  ]
}