{
  "id": "fu4uxj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1585903875.0,
  "title": "Request: How can I encourage my anorexic girlfriend to eat without overwhelming her?",
  "selftext": "Since a stay at home order was issued in our town a week ago, my girlfriend has been restricting her eating with worsening severity. In the last three days, despite my encouragement, I’ve watched her eat a granola bar and one small microwave meal. I am really scared, and I don’t think I responded properly at all. I told her, honestly, that I was afraid she might die if she keeps starving herself. She started crying and told me that she would die if she got fat during quarantine.  I know what I said plus my prodding her to eat probably overwhelmed her, but I’m sort of at a loss for how to help her, and I’m just so scared for her. I just don’t know how I can ease some of her fears about eating. I know I can’t make her see  how thin she, but what can I do to make sure she at least eats enough to stay alive and doesn’t completely hate her body? I don’t want to overstep here, but as her girlfriend I know I have to at least get more educated to be able to make sure she’s healthy and safe while we’re living together.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fu4uxj/request_how_can_i_encourage_my_anorexic/",
  "score": 46,
  "num_comments": 22,
  "comments": [
    {
      "id": "fmb7a08",
      "author": "shibb3h",
      "body": "This is tough, but you're right to worry. Unfortunately, the only real thing you can do is keep trying and present her with facts. Like how even if she just sleeps, or stays in one spot all day, she needs at least 1200 calories a day just to keep her organs working properly. That her starving herself will kill her much faster than eating ever will.    \n\n\nI'm not trying to scare you, but once your body has eaten away at all the neccessary fat and muscle, it does go after vital organs like your heart. For me it left me with a resting heart rate of 40, and much lower when I was sleeping to the extent that my husband finally broke down and told me he would watch me all night because he was terrified I wasn't going to wake up. That was enough for me, seeing the damage I had done to someone I love, made me want to try and snap out of it. But in turn I had to be honest with him and myself as to why I was doing it. My reasoning was my own depression and suicidal thoughts that I've battled with since I was a child. Once I was able to be open and honest with myself about it, I was able to take the steps neccessary to recover. And maybe that's the discussion you need to have with her, why does she feel the need to hurt herself in such an undeserving way.    \n\n\nBut be prepared for things to get worse before they get better, I was personally a nightmare to deal with because letting go of my rituals was like losing my best friend. And I know that can be a hard concept to understand, but many of us with an ED truly believe that \"voice\" IS our best friend and the voice of reason. And that's going to be the hardest for her, getting her to understand and accept that it's not, and that all it's doing is stealing her light and life away.    \n\nIf theres any passions or interests she used to love, but seemingly doesn't care about anymore, maybe remind her of them? I've always been an artist, but when my ED was at it worst I litterally couldn't draw. My brain was so malnourished that I couldn't be imaginative in anyway and it broke my heart to see that I had done that to myself.   \n\n\nAbove all, remind her that you're there for her. Especially during the bad times. Recovery is not linear and is VERY personal. No one has the same story, but let her know you'll be there to support her and help in anyway that you can. I do highly suggest she contacts her doctor or a physician of some sort if possible though. Depending on how malnourished her body is, she may not physically be able to take on the amount of calories that a normal person would. And that's okay, it all comes with time and consistency. I hope I was able to give a few good suggestions, there was a book both my husband and I read that REALLY helped us to understand what I needed to do and why my body was reacting the way it did. If I can find it, I'll let you know the name of it. Good luck and I hope she's able to get better.   \n\n\nEdit: the book we used is \"Recover from Eating Disorders: The Homeodynamic Recovery Method\"",
      "created_utc": 1585920164.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fmbh6wv",
      "author": "skinnymini20",
      "body": "You sound like such a caring person. For me, my boyfriend doesn't mention how much I'm eating or how my body looks but encouragement through words of affirmation. So doing fun activités during this time compliments on her personality and how amazing she is (not physically) having yummy foods but not pressuring her. Not watching her plate like a hawk. Bring small facts about her health and how you're concen but not all at once. Small conversations to plant the seed",
      "created_utc": 1585926285.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fmbqd4k",
      "author": "florzeh",
      "body": "As someone who has recovered before I always found encouragements to eat not only triggering, but it’s almost like they had the opposite effect. Like I was proud of myself for causing the impression of not eating enough, and fed on the worry of my loved ones. Sick, I know.\n\nBut as most of my friends and family were glued to me saying I should eat more, I had ONE friend that stayed by my side without ever forcing the “you should eat more” conversation upon me, and her company and support felt a lot more encouraging to me than everyone else that seemed so worried. I think you’ll probably help her more by giving her your unconditional support, company, love, empathy and always being patient and calm even if you’re worried sick. It’s really hard but she won’t recover unless she wants to and forcing her to do that may kill all the trust she places on you. Just stay by her side and make sure she knows you’ll always be there for her and want to live a healthy life together!",
      "created_utc": 1585931278.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fmbaqla",
      "author": "mazotori",
      "body": "I find encouragements to eat triggering. But one thing my partner does to support me is to cook for me and make food access easier so I don't have to think about it too much and get stuck in my brain. But my issues are likely different than your gf.\n\nIt may help to talk to her about what she finds triggering or encouraging.",
      "created_utc": 1585922464.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fmcd30i",
      "author": "GraceLife777",
      "body": "Offer to share small meals with her. Cook something and ask her to have a few bites (eat most of it). Always tell her you love her. Be understanding. \n\nAsk her to eat with you. Even if it’s sharing fries or if she only had a few bites of your meals that’s better than nothing. Tell her she’s beautiful and prove it (hug her, play with her hair, show her you care about her) \n\nBe there to help her when she’s ready to move to a different place - it is a long hard journey. Let her know you are there to walk through it with her. Don’t give up. It will get better with time love and patience.",
      "created_utc": 1585943360.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmd6g4l",
      "author": "Ironicbanana14",
      "body": "Maybe ask her if it makes her feel better to drink things? You can get the protein shakes or smoothies and like that to help her get calories. Frozen fruit goes well into smoothies and stays good longer and is cheaper if you have a blender.\n\notherwise make sure she is at least drinking water and maybe recommend her a women's daily vitamin, so she is getting nutrients/vitamins regardless. However she would have to either have a shake or a small meal to hold down the vitamin because its so rich, so idk how it will go!",
      "created_utc": 1585960370.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmbaq58",
      "author": "updown27",
      "body": "Short answer: you can’t. It is not possible to make someone with an eating disorder see the damage they are doing to their body until they are ready to see it. I’m sure the person with the long answer has some good info for you. I’m really sorry you and your gf are going through this. It’s incredibly difficult and scary and truly requires professional help to overcome. If you can find nutritional facts to help challenge her ED thoughts that might be helpful. Like how carbs are important for your brain function and glucose helps regulate your mood. Showing her that if she wants to care for her body she has to include food. Hoping for the best for you both.",
      "created_utc": 1585922456.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmbbmjc",
      "author": "LornaTragedy",
      "body": "Make yummy meals, always have delicious snacks just left out and easily available.  Eat something yourself and just offer hey do you want some. Just normalize food. Pizza and snacks with movies etc",
      "created_utc": 1585923013.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmctwsl",
      "author": "Caactiii",
      "body": "The thing that helped me the most was other people eating with me. I hated eating alone, as for some reason it made me feel like I was fat, that I shouldn't be poisoning my body with food. My best friend knows about my disorders, and will eat with me even if he isn't that hungry, just to make sure I eat. You could try this, maybe cook a meal, a healthy one, and offer to eat with her. Show her that food isn't the enemy, and food can be healthy and ok. I'd also reiterate the fact that you think she is beautiful the way she is, and that you are worried about her because you love/care about her. The best thing to do is look up recipes that look like they're healthy online. My favorite is turkey meatballs in lettuce cups with carrot strip, lettuce, and celery slaw tossed in red wine vinegar. \n\nJust try and get her to see that food isn't dangerous for her. That it isn't poison, and it helps her live. What also helped a lot was seeing people that were worse off than I am, people that were in the hospital for their disorders on feeding tubes, with hair loss and rotting teeth, etc. It might not be the nicest thing to look at, but it's the truth. However, what worked for me doesn't work for everyone. I truly hope that you're able to help her. We're all rooting for you.",
      "created_utc": 1585952769.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fme04gu",
      "author": "i_am_a_new_guy_now",
      "body": "Please see this guy's post history something is wrong",
      "created_utc": 1585984001.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmc4mm1",
      "author": "liziphin",
      "body": "Instead of encouraging just her to eat sit down for each meal and eat the exact same portion size and don’t put a full portion on the plates \nNever eat more than her when she can see if that means grabbing a few slices of bread and eating them rlly quickly the bathroom  let her think your eating exactly what she is and exactly how much she is \nDon’t talk ab food while eating don’t ask “how is it, or do you like it” play games or talk ab smt funny or embarrassing you did as a kid just anything engaging other than food and don’t let silence fall or she’ll start thinking ab how much food it is\nAnd  throw out all the scales hide them just anything to keep her from weighing herself cause she’ll see the weight gain and stop\nAnd lastly when she starts gaining weight don’t comment on it unless she says she looks fat then say she looks healthy not fat and since she’s gonna gain weight she’s gonna need bigger clothes so buy them for her it feels terrible having to buy clothes in a larger size",
      "created_utc": 1585938815.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fmd5ia9",
      "author": "drunken-black-sheep",
      "body": "I have a really hard time eating during quarantine. Smoothies have been my go to. And if you make them at home they are pretty guilt free. Bananas cancel out the flavor of kale and you can add half a banana, frozen mangos no sugar added, other fruits like strawberries and blueberries. Unsweetened Greek yogurt for healthy fat that is guilt free but key to nutrient absorption and a little bit of honey to sweeten it a little more. It’s not a lot of calories but there are a lot of nutrients in the kale and other fruits if y’all can stand the smoothie looking green. Also, I like adding unsweetened almond milk and ice for consistency.",
      "created_utc": 1585959774.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fme90t1",
      "author": "edie43",
      "body": "Shit, I just had a realisation about my own voice in my head. I never realised I actually considered it my “voice of reason” before. That’s so messed up.",
      "created_utc": 1585994545.0,
      "score": 2,
      "context": [
        {
          "id": "fmb7a08",
          "author": "shibb3h",
          "body": "This is tough, but you're right to worry. Unfortunately, the only real thing you can do is keep trying and present her with facts. Like how even if she just sleeps, or stays in one spot all day, she needs at least 1200 calories a day just to keep her organs working properly. That her starving herself will kill her much faster than eating ever will.    \n\n\nI'm not trying to scare you, but once your body has eaten away at all the neccessary fat and muscle, it does go after vital organs like your heart. For me it left me with a resting heart rate of 40, and much lower when I was sleeping to the extent that my husband finally broke down and told me he would watch me all night because he was terrified I wasn't going to wake up. That was enough for me, seeing the damage I had done to someone I love, made me want to try and snap out of it. But in turn I had to be honest with him and myself as to why I was doing it. My reasoning was my own depression and suicidal thoughts that I've battled with since I was a child. Once I was able to be open and honest with myself about it, I was able to take the steps neccessary to recover. And maybe that's the discussion you need to have with her, why does she feel the need to hurt herself in such an undeserving way.    \n\n\nBut be prepared for things to get worse before they get better, I was personally a nightmare to deal with because letting go of my rituals was like losing my best friend. And I know that can be a hard concept to understand, but many of us with an ED truly believe that \"voice\" IS our best friend and the voice of reason. And that's going to be the hardest for her, getting her to understand and accept that it's not, and that all it's doing is stealing her light and life away.    \n\nIf theres any passions or interests she used to love, but seemingly doesn't care about anymore, maybe remind her of them? I've always been an artist, but when my ED was at it worst I litterally couldn't draw. My brain was so malnourished that I couldn't be imaginative in anyway and it broke my heart to see that I had done that to myself.   \n\n\nAbove all, remind her that you're there for her. Especially during the bad times. Recovery is not linear and is VERY personal. No one has the same story, but let her know you'll be there to support her and help in anyway that you can. I do highly suggest she contacts her doctor or a physician of some sort if possible though. Depending on how malnourished her body is, she may not physically be able to take on the amount of calories that a normal person would. And that's okay, it all comes with time and consistency. I hope I was able to give a few good suggestions, there was a book both my husband and I read that REALLY helped us to understand what I needed to do and why my body was reacting the way it did. If I can find it, I'll let you know the name of it. Good luck and I hope she's able to get better.   \n\n\nEdit: the book we used is \"Recover from Eating Disorders: The Homeodynamic Recovery Method\"",
          "created_utc": 1585920164.0
        }
      ]
    },
    {
      "id": "fme98q7",
      "author": "edie43",
      "body": "This is good advice I think! Just don’t make her feel pressured. If she says no, don’t push her too much but let her open up to it in her own time. I’m having the same issues right now and it would help a lot if my partner tried to eat his meals with me.\n\nEdit: I had to remove some advice about calories. Don’t bring up calories to her!!",
      "created_utc": 1585994814.0,
      "score": 1,
      "context": [
        {
          "id": "fmcd30i",
          "author": "GraceLife777",
          "body": "Offer to share small meals with her. Cook something and ask her to have a few bites (eat most of it). Always tell her you love her. Be understanding. \n\nAsk her to eat with you. Even if it’s sharing fries or if she only had a few bites of your meals that’s better than nothing. Tell her she’s beautiful and prove it (hug her, play with her hair, show her you care about her) \n\nBe there to help her when she’s ready to move to a different place - it is a long hard journey. Let her know you are there to walk through it with her. Don’t give up. It will get better with time love and patience.",
          "created_utc": 1585943360.0
        }
      ]
    },
    {
      "id": "fmdqs2b",
      "author": "CaptWeeble",
      "body": "I would definitely second this. I find drinking my calories much easier than eating them if I'm having a tough day with the ED. \n\nOne of my dietitians recommended mixing Ensure Clear with apple juice to help me get protein after I had surgery. I try to always have some of those and some packets of Carnation High Protein instant breakfast powder in the pantry.",
      "created_utc": 1585975107.0,
      "score": 2,
      "context": [
        {
          "id": "fmd6g4l",
          "author": "Ironicbanana14",
          "body": "Maybe ask her if it makes her feel better to drink things? You can get the protein shakes or smoothies and like that to help her get calories. Frozen fruit goes well into smoothies and stays good longer and is cheaper if you have a blender.\n\notherwise make sure she is at least drinking water and maybe recommend her a women's daily vitamin, so she is getting nutrients/vitamins regardless. However she would have to either have a shake or a small meal to hold down the vitamin because its so rich, so idk how it will go!",
          "created_utc": 1585960370.0
        }
      ]
    },
    {
      "id": "fmck8i6",
      "author": "sorcerers_apprentice",
      "body": "Hi, I don't mean to sound harsh, because this strategy might be very helpful for some people, but for me personally, it would be difficult. For myself and many people with eating disorders, it can be /very/ difficult to deal with not eating less than everyone around us. I think if you (OP) would naturally be eating more than she is, it might help her feel like she is not eating \"too much.\" I would recommend against eating in secret to try to keep up the illusion that you two are eating the same amount.\n\nAdditionally, I would caution against using the word \"healthy\" when talking to your girlfriend about her body. To a lot of people with EDs, \"healthy\" = \"fat.\" If anything, I would advise commenting on her body size at all, instead giving her compliments on her outfits, jewelry, etc., or saying she looks beautiful/lovely/etc. \n\nAgain, no disrespect to you liziphin, and I am so glad if this strategy has helped you or someone you love with recovery. However, I know some of these things would be difficult for me to cope with.",
      "created_utc": 1585947280.0,
      "score": 6,
      "context": [
        {
          "id": "fmc4mm1",
          "author": "liziphin",
          "body": "Instead of encouraging just her to eat sit down for each meal and eat the exact same portion size and don’t put a full portion on the plates \nNever eat more than her when she can see if that means grabbing a few slices of bread and eating them rlly quickly the bathroom  let her think your eating exactly what she is and exactly how much she is \nDon’t talk ab food while eating don’t ask “how is it, or do you like it” play games or talk ab smt funny or embarrassing you did as a kid just anything engaging other than food and don’t let silence fall or she’ll start thinking ab how much food it is\nAnd  throw out all the scales hide them just anything to keep her from weighing herself cause she’ll see the weight gain and stop\nAnd lastly when she starts gaining weight don’t comment on it unless she says she looks fat then say she looks healthy not fat and since she’s gonna gain weight she’s gonna need bigger clothes so buy them for her it feels terrible having to buy clothes in a larger size",
          "created_utc": 1585938815.0
        }
      ]
    },
    {
      "id": "fmel7rm",
      "author": "shibb3h",
      "body": "It's definitely a harsh reality to come to, but there is an upside to it. Once you're able to recognize the voice, you can start taking the steps necessary to defy/do the exact opposite of what it tells you to do.",
      "created_utc": 1586007328.0,
      "score": 2,
      "context": [
        {
          "id": "fmb7a08",
          "author": "shibb3h",
          "body": "This is tough, but you're right to worry. Unfortunately, the only real thing you can do is keep trying and present her with facts. Like how even if she just sleeps, or stays in one spot all day, she needs at least 1200 calories a day just to keep her organs working properly. That her starving herself will kill her much faster than eating ever will.    \n\n\nI'm not trying to scare you, but once your body has eaten away at all the neccessary fat and muscle, it does go after vital organs like your heart. For me it left me with a resting heart rate of 40, and much lower when I was sleeping to the extent that my husband finally broke down and told me he would watch me all night because he was terrified I wasn't going to wake up. That was enough for me, seeing the damage I had done to someone I love, made me want to try and snap out of it. But in turn I had to be honest with him and myself as to why I was doing it. My reasoning was my own depression and suicidal thoughts that I've battled with since I was a child. Once I was able to be open and honest with myself about it, I was able to take the steps neccessary to recover. And maybe that's the discussion you need to have with her, why does she feel the need to hurt herself in such an undeserving way.    \n\n\nBut be prepared for things to get worse before they get better, I was personally a nightmare to deal with because letting go of my rituals was like losing my best friend. And I know that can be a hard concept to understand, but many of us with an ED truly believe that \"voice\" IS our best friend and the voice of reason. And that's going to be the hardest for her, getting her to understand and accept that it's not, and that all it's doing is stealing her light and life away.    \n\nIf theres any passions or interests she used to love, but seemingly doesn't care about anymore, maybe remind her of them? I've always been an artist, but when my ED was at it worst I litterally couldn't draw. My brain was so malnourished that I couldn't be imaginative in anyway and it broke my heart to see that I had done that to myself.   \n\n\nAbove all, remind her that you're there for her. Especially during the bad times. Recovery is not linear and is VERY personal. No one has the same story, but let her know you'll be there to support her and help in anyway that you can. I do highly suggest she contacts her doctor or a physician of some sort if possible though. Depending on how malnourished her body is, she may not physically be able to take on the amount of calories that a normal person would. And that's okay, it all comes with time and consistency. I hope I was able to give a few good suggestions, there was a book both my husband and I read that REALLY helped us to understand what I needed to do and why my body was reacting the way it did. If I can find it, I'll let you know the name of it. Good luck and I hope she's able to get better.   \n\n\nEdit: the book we used is \"Recover from Eating Disorders: The Homeodynamic Recovery Method\"",
          "created_utc": 1585920164.0
        },
        {
          "id": "fme90t1",
          "author": "edie43",
          "body": "Shit, I just had a realisation about my own voice in my head. I never realised I actually considered it my “voice of reason” before. That’s so messed up.",
          "created_utc": 1585994545.0
        }
      ]
    },
    {
      "id": "fmevn3o",
      "author": "GraceLife777",
      "body": "I would caution about using calories or weight for anything just because it can be a trigger for people. So be careful. Don’t be harsh when saying something about calories. Gentleness is a huge key to this battle.",
      "created_utc": 1586014520.0,
      "score": 2,
      "context": [
        {
          "id": "fmcd30i",
          "author": "GraceLife777",
          "body": "Offer to share small meals with her. Cook something and ask her to have a few bites (eat most of it). Always tell her you love her. Be understanding. \n\nAsk her to eat with you. Even if it’s sharing fries or if she only had a few bites of your meals that’s better than nothing. Tell her she’s beautiful and prove it (hug her, play with her hair, show her you care about her) \n\nBe there to help her when she’s ready to move to a different place - it is a long hard journey. Let her know you are there to walk through it with her. Don’t give up. It will get better with time love and patience.",
          "created_utc": 1585943360.0
        },
        {
          "id": "fme98q7",
          "author": "edie43",
          "body": "This is good advice I think! Just don’t make her feel pressured. If she says no, don’t push her too much but let her open up to it in her own time. I’m having the same issues right now and it would help a lot if my partner tried to eat his meals with me.\n\nEdit: I had to remove some advice about calories. Don’t bring up calories to her!!",
          "created_utc": 1585994814.0
        }
      ]
    },
    {
      "id": "fme7maz",
      "author": "Ironicbanana14",
      "body": "I'm currently fasting because of my pancreas, the ensure clear with apple juice sounds like a good choice for me right now too lol!",
      "created_utc": 1585992809.0,
      "score": 1,
      "context": [
        {
          "id": "fmd6g4l",
          "author": "Ironicbanana14",
          "body": "Maybe ask her if it makes her feel better to drink things? You can get the protein shakes or smoothies and like that to help her get calories. Frozen fruit goes well into smoothies and stays good longer and is cheaper if you have a blender.\n\notherwise make sure she is at least drinking water and maybe recommend her a women's daily vitamin, so she is getting nutrients/vitamins regardless. However she would have to either have a shake or a small meal to hold down the vitamin because its so rich, so idk how it will go!",
          "created_utc": 1585960370.0
        },
        {
          "id": "fmdqs2b",
          "author": "CaptWeeble",
          "body": "I would definitely second this. I find drinking my calories much easier than eating them if I'm having a tough day with the ED. \n\nOne of my dietitians recommended mixing Ensure Clear with apple juice to help me get protein after I had surgery. I try to always have some of those and some packets of Carnation High Protein instant breakfast powder in the pantry.",
          "created_utc": 1585975107.0
        }
      ]
    },
    {
      "id": "fmdism2",
      "author": "liziphin",
      "body": "This is personally what has helped with me in the past I rlly wanted to recover if ppl around me ate more but I felt fat if ppl around me ate less and I never wanted to hear ab how what I’m wearing is pretty when I smt Ed on my body and one day one of my fiends said no you look healthy and it hurt a bit cause like i liked how I looked before but I also preferred it over the cmts on my outfit or makeup\n\nAnd I did eventually fall out of recovery but I still feel kinda bad when ppl skeins me eat more and I never talk ab my body around ppl so I’m not sure in the other one",
      "created_utc": 1585968903.0,
      "score": 1,
      "context": [
        {
          "id": "fmc4mm1",
          "author": "liziphin",
          "body": "Instead of encouraging just her to eat sit down for each meal and eat the exact same portion size and don’t put a full portion on the plates \nNever eat more than her when she can see if that means grabbing a few slices of bread and eating them rlly quickly the bathroom  let her think your eating exactly what she is and exactly how much she is \nDon’t talk ab food while eating don’t ask “how is it, or do you like it” play games or talk ab smt funny or embarrassing you did as a kid just anything engaging other than food and don’t let silence fall or she’ll start thinking ab how much food it is\nAnd  throw out all the scales hide them just anything to keep her from weighing herself cause she’ll see the weight gain and stop\nAnd lastly when she starts gaining weight don’t comment on it unless she says she looks fat then say she looks healthy not fat and since she’s gonna gain weight she’s gonna need bigger clothes so buy them for her it feels terrible having to buy clothes in a larger size",
          "created_utc": 1585938815.0
        },
        {
          "id": "fmck8i6",
          "author": "sorcerers_apprentice",
          "body": "Hi, I don't mean to sound harsh, because this strategy might be very helpful for some people, but for me personally, it would be difficult. For myself and many people with eating disorders, it can be /very/ difficult to deal with not eating less than everyone around us. I think if you (OP) would naturally be eating more than she is, it might help her feel like she is not eating \"too much.\" I would recommend against eating in secret to try to keep up the illusion that you two are eating the same amount.\n\nAdditionally, I would caution against using the word \"healthy\" when talking to your girlfriend about her body. To a lot of people with EDs, \"healthy\" = \"fat.\" If anything, I would advise commenting on her body size at all, instead giving her compliments on her outfits, jewelry, etc., or saying she looks beautiful/lovely/etc. \n\nAgain, no disrespect to you liziphin, and I am so glad if this strategy has helped you or someone you love with recovery. However, I know some of these things would be difficult for me to cope with.",
          "created_utc": 1585947280.0
        }
      ]
    },
    {
      "id": "fmfz196",
      "author": "edie43",
      "body": "Yeah, Oh my god you’re right... I don’t know what I was thinking. I’ve been in my own head about this stuff and for me it kinda helped that my bf reminded me how many calories I could safely eat. But I forgot how much of a trigger it can be. I’m so sorry.",
      "created_utc": 1586037828.0,
      "score": 2,
      "context": [
        {
          "id": "fmcd30i",
          "author": "GraceLife777",
          "body": "Offer to share small meals with her. Cook something and ask her to have a few bites (eat most of it). Always tell her you love her. Be understanding. \n\nAsk her to eat with you. Even if it’s sharing fries or if she only had a few bites of your meals that’s better than nothing. Tell her she’s beautiful and prove it (hug her, play with her hair, show her you care about her) \n\nBe there to help her when she’s ready to move to a different place - it is a long hard journey. Let her know you are there to walk through it with her. Don’t give up. It will get better with time love and patience.",
          "created_utc": 1585943360.0
        },
        {
          "id": "fme98q7",
          "author": "edie43",
          "body": "This is good advice I think! Just don’t make her feel pressured. If she says no, don’t push her too much but let her open up to it in her own time. I’m having the same issues right now and it would help a lot if my partner tried to eat his meals with me.\n\nEdit: I had to remove some advice about calories. Don’t bring up calories to her!!",
          "created_utc": 1585994814.0
        },
        {
          "id": "fmevn3o",
          "author": "GraceLife777",
          "body": "I would caution about using calories or weight for anything just because it can be a trigger for people. So be careful. Don’t be harsh when saying something about calories. Gentleness is a huge key to this battle.",
          "created_utc": 1586014520.0
        }
      ]
    },
    {
      "id": "fmfz5wv",
      "author": "GraceLife777",
      "body": "It can be a wonderful tool but introduced gently and slowly. You have nothing to apologize for. You brought up something that can and does work. I just wanted to remind them that everything has to be taken slowly at first.",
      "created_utc": 1586037907.0,
      "score": 2,
      "context": [
        {
          "id": "fmcd30i",
          "author": "GraceLife777",
          "body": "Offer to share small meals with her. Cook something and ask her to have a few bites (eat most of it). Always tell her you love her. Be understanding. \n\nAsk her to eat with you. Even if it’s sharing fries or if she only had a few bites of your meals that’s better than nothing. Tell her she’s beautiful and prove it (hug her, play with her hair, show her you care about her) \n\nBe there to help her when she’s ready to move to a different place - it is a long hard journey. Let her know you are there to walk through it with her. Don’t give up. It will get better with time love and patience.",
          "created_utc": 1585943360.0
        },
        {
          "id": "fme98q7",
          "author": "edie43",
          "body": "This is good advice I think! Just don’t make her feel pressured. If she says no, don’t push her too much but let her open up to it in her own time. I’m having the same issues right now and it would help a lot if my partner tried to eat his meals with me.\n\nEdit: I had to remove some advice about calories. Don’t bring up calories to her!!",
          "created_utc": 1585994814.0
        },
        {
          "id": "fmevn3o",
          "author": "GraceLife777",
          "body": "I would caution about using calories or weight for anything just because it can be a trigger for people. So be careful. Don’t be harsh when saying something about calories. Gentleness is a huge key to this battle.",
          "created_utc": 1586014520.0
        },
        {
          "id": "fmfz196",
          "author": "edie43",
          "body": "Yeah, Oh my god you’re right... I don’t know what I was thinking. I’ve been in my own head about this stuff and for me it kinda helped that my bf reminded me how many calories I could safely eat. But I forgot how much of a trigger it can be. I’m so sorry.",
          "created_utc": 1586037828.0
        }
      ]
    }
  ]
}