{
  "id": "fu8zzd",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1585922756.0,
  "title": "Request: Post: I feel like I have a little of each ED, is that possible?",
  "selftext": "I’m trying to figure out why my relationship to food is so complicated. I think the most uncommon ED, Orthorexia, describes my eating habits the best, but within this I go through bingeing episodes, sometimes purging too, and then other times I’m very controlled and averse to food, more similar to anorexia. I’m trying to make sense of it all - anyone else heard of something similar?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fu8zzd/request_post_i_feel_like_i_have_a_little_of_each/",
  "score": 40,
  "num_comments": 9,
  "comments": [
    {
      "id": "fmbggn5",
      "author": "shibb3h",
      "body": "This is actually pretty common amongst people with eating disorders, you're not alone! ED's are a mental health issue, which is why it can manifest itself in many different ways. It's also the part that makes them hell to recover from. If you can manage to talk to a therapist, or even your physician about it, I highly recommend it. But the fact that you recognize that you don't belong to just one type of the disorder is a step in the right direction!",
      "created_utc": 1585925868.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fmbqi3e",
      "author": "hazelnut_mylk",
      "body": "yes. your ed is valid regardless. osfed aka used to be called ednos (ED not otherwise specific) might explain it? people with AN b/p subtype goes through binges from extreme hunger but that doesn't mean they got BED",
      "created_utc": 1585931350.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fmd0em8",
      "author": "moooooopg",
      "body": "Yes. I think of eating disorders like autism. A spectrum",
      "created_utc": 1585956587.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmbgnwk",
      "author": "mtngdss",
      "body": "Yes, that is definitely possible. Eating disorders are very complex and a lot of them overlap. If you go to get diagnosed, and your BMI is below a standard number for individuals with anorexia, it is likely you would be diagnosed with AN, even if you have symptoms of orthorexia or bulimia.",
      "created_utc": 1585925982.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmbu7ao",
      "author": "None",
      "body": "Absolutely. I have struggled with a very similar experience.",
      "created_utc": 1585933285.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmcfj56",
      "author": "Whatthedarknessdoes",
      "body": "My actual diagnosis is \"anorexia, binge eating purging type.\". So I can relate, I go through different episodes. I think this is true of a lot of people in my ED support group too.",
      "created_utc": 1585944687.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmcrbsk",
      "author": "I_own_18_penguins",
      "body": "No this makes complete sense. My food fears fluctuate between those of someone with ARFID, orthorexia, and anorexia. It means that the ED clinic kinda refused to diagnose me or treat me properly because they're still trying to place me in a box. It's ok to hace different eating disorders, just remember to let that invalidate you struggles/experiences.",
      "created_utc": 1585951273.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmdbpop",
      "author": "katsnackshackysacks",
      "body": "Absolutely. I think there should be more awareness as to what eating disorders actually look like, because they don’t often fit neatly into categories. They are very complex and sometimes can be very hard to identify, let alone treat. You are not alone!",
      "created_utc": 1585963874.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmdir53",
      "author": "brunette_xox17",
      "body": "i believe so. eating disorders can vary from person to person, everyone is different.",
      "created_utc": 1585968874.0,
      "score": 1,
      "context": []
    }
  ]
}