{
  "id": "fuyyqg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586025931.0,
  "title": "Request: I have had an eating disorder my whole life and never told anyone",
  "selftext": "I'm 26 male. This is my first time ever talking about this so sorry if it doesn't make much sense.\n\nMy eating disorder started at about 11 or 12, other kids made fun of me because I was fat and gave me a nickname that I hated. I started restricting calories and threw away my lunches. I lost the weight and managed to stay skinny in my teens. I was fit and attractive up until age 21, but I would go through episodes of binging, starving and just generally restrictive eating. I was terrified of bread and I don't think I ever ate any for 10 years. I over exercised a lot and would punish myself with it.\n\nWhen i was 21 I injured myself because of over exercising. I became a severe alcoholic and gained a ton of weight, I was just eating and drinking all the time and would drink like 5 bottles of wine a day.  I ruined my life, I developed fatty liver disease and a bunch of other health problems. I was disgusting. After 1.5 years of that I finally stopped drinking alcohol and also decided to start fasting, which was just an excuse to starve myself.\n\nI starved myself to try and \"make up\" for being fat and got down to xxxlbs (underweight bmi) at 5'10. I then got even more health problems and damaged my heart and organs. I never got ED help because I told the doctors that I lost weight because of drugs, i was too embarrassed to talk to them about it.\n\nI \"recovered\" at age 23 but unfortunately gained most of the weight back and became fat again. I stayed fat like a year (without binging and purging) then someone made a comment about me so I went on a diet and got down to underweight again, but I never got as low as before. I also developed something like bulimia, I started binging and purging and chewing and spitting out food. I started taking the weight loss drug DNP as well and overused it and had what I think may have been a heart attack. I collapsed and my whole left arm felt numb. I woke up a few hours later and never told anyone.\n\nAfter that I stopped taking it and gained up to a 'healthy weight' for a while (was still purging) then I relapsed on alcohol and gained up to my highest ever weight (xxxlbs - overweight) at 25. I'm now 26 and still obese but have lost 20lbs. I have cut back on drinking but still drink daily. I'm working on that.\n\nThe bulimia or whatever it is hasn't gone away, I throw up about half of what I eat but I'm losing weight much slower than I want. I think I'm starting to have more health problems. I know it's not healthy to throw up your food and drink daily. My gag reflex is fucked and I sometimes get extreme pain in my oesophagus when purging. \n\nNo one in my life knows about my eating disorder, not even my parents or girlfriend. People have had their suspicions but I always deny it. It just feels like something really private to me. I don't feel ready to get help right now, I just want to lose weight and get down to a healthy weight so I can stop hating myself. I can't get help right now anyway because the UK is dealing with the pandemic and we are in lockdown. \n\nHonestly, I only want to lose weight, but I'd like to do that without resorting to starving  myself again. I haven't been able to eat \"normally\" since I was a child. I don't even know what that looks like for me. I've definitely fucked up my hormones, I rarely feel \"full\" no matter how much I eat. When I think i ate too much I feel guilty and i have to make myself sick, there is no other option for me. \n\nI don't know what to do about all this. I don't want to be stuck with it for the rest of my life.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fuyyqg/request_i_have_had_an_eating_disorder_my_whole/",
  "score": 91,
  "num_comments": 14,
  "comments": [
    {
      "id": "fmfh82y",
      "author": "rottenvomit",
      "body": "you deserve to get help :( you deserve to recover from this. do you have a therapist?",
      "created_utc": 1586027186.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fmfig12",
      "author": "bearthedog3",
      "body": "Hi, your story made me feel so much. I've been through some of the same things. It sounds like your body desperately needs a break, to be taken care of. One thing that helped for me was changing my perspective, thinking about myself as a close friend or a sibling when it came to food. I would ask myself, \"would _____ be okay if they ate this?\" Maybe you can try doing the same thing. I also agree with the comment above, I think you need to express this internal anguish to someone who can give you an external opinion. \n\nBest of luck to you, my friend.",
      "created_utc": 1586027922.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fmfik2v",
      "author": "moonmosaic",
      "body": "I know that it’s such a personal and private thing, but you need to speak to people you can trust about this\nIt’s not something that is going to go away on its own and will probably escalate untreated, especially if you’ve already had health issues from it",
      "created_utc": 1586027989.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fmfouqk",
      "author": "ILOVECAT",
      "body": "I work as a therapist in addiction and mental health, and I know you are going through a lot right now, and I would like you to know there are places for you to reach out and get the help you need in a confidential manner.  I encourage you to look up some local mental health services and to seek treatment for the disordered eating and substance misuse.  Good luck, you can do it.",
      "created_utc": 1586031768.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fmfxej0",
      "author": "maverick2598",
      "body": "Though I am a currently younger than you, I relate a lot to your story. I haven’t taken any sort of recovery seriously out of embarrassment or invalidating feelings, because I’ve never felt like I am “allowed” to have these problems. Been off and on from diets, drugs, and just food in general since as long as I remember. Lately gotten deep into the drugs and even ran a couple dnp cycles as well. That shit is hell man I am sorry you had to go through that. Something different about making that choice that will stay with me for a long time. Now especially with recent events I feel like I’m in this limbo of honestly just exhaustion. Any sort of efforts I make now seem to all have slow ass results. This problem is so isolating and especially when you keep it a secret from everyone too. If you ever want someone to talk to or something feel free to message me. Keeps the secrecy, but at least you have someone to vent to. You’ll get through this and making a post recognizing and validating hopefully helps. You got this shit man, we all here for you too",
      "created_utc": 1586036850.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmixydv",
      "author": "None",
      "body": "Thank you for having the courage to post this. We are here for you. You must feel exhausted and a great sense of shame for carrying that secret. It took me more than twenty years to admit to anyone.\n\nThere's so much I'd like to tell you that I don't know where to start. It'd be easy to tell you do X or Y but we all experience life differently and there's no cookie cutter solution.\n\nWhat I can say is yes, get a nutritionist and a therapist. But be aware, it can take time to find one that you trust and that feel in-tune with. So don't despair. For the nutritionist I found it helpful to have someone who'd had ED and could empathize with me. For the therapist.... well it took 20 years to find a good one. I also, wasn't ready to deal with my deeper pains until now; to accept that the source of my 'issues' was 'me' and that 'hacking' my weight wouldn't solve them.  You may want to explore different types of therapies from CBT to psychoanalysis or more alternative ones like IFS, EMDR, and others presented in the book \"The Body Keeps the Score.\"",
      "created_utc": 1586119155.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmfwtm6",
      "author": "Smj70357",
      "body": "You've already admitted you have a problem thats the first step so congrats on that. Step 2 is getting the help you need starting with getting professional help and being honest with those close to you. People care and want to see you thrive you deserve happiness. Its going to be terrifying but you just have to keep putting that one foot in front of the other. I belive in you man you can do this. 👍",
      "created_utc": 1586036500.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmglvmk",
      "author": "None",
      "body": "Do you know what? You, your soul, your entire being is beautiful. Once you get to your ideal weight, you will only be happy for a short amount of time. It’s not the be all and end all of existence. Your relationship with food needs to be re-evaluated.\n\nI recovered from bulimia properly when I was 20 (my eating disorder was a thing since I was 8 years old, due to bullying... man it sucks). I did the alcohol thing too. I gained weight, I went through the throes of it all. Therapy is a good place so start. I’m yet to start therapy but I honestly believe there’s a deeper rooted issue that is being blanketed by your eating disorder.\n\nYou have a life to live. I’m 25F. I do struggle with self image.\n\nLOVE YOURSELF. Forgive yourself for putting yourself through hell on earth. That’s a nice place to start.\n\nI’ve had a diagnosis of bipolar 2 and borderline personality disorder. I’ve read all the books and google searched everything imaginable.\n\nDon’t be scared, don’t be embarrassed. Forgive yourself. Take small steps in self care. I was often in the boat of “why am I even bothering, I don’t like who I am”. You are who you are and you cannot change that or be anybody else.\n\nMy grandfather sat me down once and said “girly, we are all like cars. Different makes, models and sizes. We take different types of fuels, oils and parts to be optimal and not fail”.\n\nAnother one he said was “if you don’t eat, you don’t shit and if you don’t shit you die”.\n\nI hope you can take something from this. I haven’t shared or commented on this thread before but this has been a guide to help me through.\n\nGodspeed xx",
      "created_utc": 1586051915.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmgu6p8",
      "author": "mrsbertmacklin",
      "body": "Hey. It took a lot of courage to post. Thank you for sharing your story! I have similar symptoms as you- chewing/spitting, restriction, purging, and have gone through some significant weight fluctuations as well. I didn’t see anyone about it until I was 26. Lived with it underneath the surface for so long. If you need to talk, PM any time.",
      "created_utc": 1586057933.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmhj4pz",
      "author": "baristabitch666",
      "body": "Your story resonates with me I been struggling with Ed and alcohol since 14 if you ever wanna talk, hell I need it too.  You’re not alone.",
      "created_utc": 1586082306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmifqz3",
      "author": "notvscogirlbutsksk",
      "body": "I think you should get help, don't be imbarassed and do it. You can do this.",
      "created_utc": 1586108679.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmizdzq",
      "author": "sophdog0207",
      "body": "It kills me to read this. Although I am an 18 year old girl, I know where you are coming from when it’s the parasite (ed) eating at you every waking day and doesn’t end. I started paying attention to my weight and what I ate when I was around 13 years old. I remember my moms boyfriend telling me that I should start paying attention to what I eat and start making healthier choices. I had always been chubby. I think that is what started it for me in middle school was that input. I remember going on a trip with my school in about 7th grade. We went on long hikes and moved around more than I would have at home. When I returned a week later my moms bf made the comment that I had lost weight it looked like. And from there I became involved in running which I pushed myself to the point of almost puking. I started not eating and noticed I lost weight quickly. On top of that I joined this after school gymnastics for like beginners or whatever to get more exercise in, the gym teacher I had even made a comment and said “you’re really skinny.” I ate “normally” after about a year of that going to be a freshman in high school. After a breakup in my junior year I had gotten really depressed and sat and played video games everyday after school locking myself in my dark room. It was the only escape from reality that I had and I had such bad anxiety it was hard to leave the house. I had gained like 20 pounds and felt disgusting after junior year I started to starve myself and run again and of course it worked. I spent all of last summer isolated in my grandmas house no one home all day no one seeing my unhealthy patterns. It was the perfect opportunity for this Ed to take over once again. I would go for walks and runs feeling so weak it was so hard to live regular life, it felt like walking through water because I was so weak. Now over half way through my senior year I still struggle with an eating disorder and disordered eating starving myself and overeating or eating or over exercising. I started to drink in December and got into another relationship thinking it would make me feel better. It did the opposite and didn’t do shit for that lol. I left because surprise they don’t fix you! I do not know where I was going with this comment other than trying to share my mom view and experiences with living with an ed. Also because I think we are all struggling right now being trapped inside with even more access to digging a negative hole for ourselves. I just want you to know that you are not alone and life likes to test us. I am no where near where I want to be in life and in fact it’s only starting for me. But knowing I am not alone makes me feel a lot better. I just know that backing up for a even a day and reflecting may help you with a steady plan to get on and stay on. Don’t listen or compare yourself to other people’s “perfect” diets or workouts blah blah. Do you do you do you! I am still learning to stick with what I know works for me because I’m like omg I do not look how I want maybe I should try what this person is doing all that shit. I hope that you find a healthy balance for yourself and deal with your ed in the proper ways. I don’t know if you can “fully” recover from one because I know damn well I haven’t and it’s been around for a few years. All I know is that surrounding yourself with people that have the same motives in life will put you where they are. So even if it means being along for awhile and just working on yourself do it. It’s never too late. Sorry for the rant!! But I wanted to make sure you everyone else reading this is not alone :)",
      "created_utc": 1586119974.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmfmfz7",
      "author": "GraceLife777",
      "body": "I’m really proud of you! It took a lot to say all this and it’s taking a lot for you to do what you are doing. That’s amazing. You are so strong!\n\nI can only offer what has worked for me. Which is premaking food that’s easy to get to. A certain amount of calories (whatever is healthy for your age/hieght) and then I don’t feel as guilty because all I did was eat up a pre made amount of food. I also allow myself to eat something special once a week - a few M&Ms or a candy bar and I work hard to not to purge. I have one friend who knows about my eating disorder. I’ll tell them like hey I am gonna eat X can you help me out with counting down to 30 minutes? \nIf at 30 minuets I’m still sick and feel the need to purge I will. But I started at only 10 minutes. Every few weeks as I’m able to make it past 30 I increase the time. \n\nI am praying for you. I’m aware of how hard this is to deal with and you are very strong to want to find ways to help yourself. Proud of you.",
      "created_utc": 1586030326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fo4hzrk",
      "author": "lilly_illy",
      "body": "He wrote he is not ready to talk about it. I have talked about it only with one friend (who also has a history of up and downs with eating disorders), and honestly talking to people online about it helped me a lot",
      "created_utc": 1587504767.0,
      "score": 1,
      "context": [
        {
          "id": "fmfh82y",
          "author": "rottenvomit",
          "body": "you deserve to get help :( you deserve to recover from this. do you have a therapist?",
          "created_utc": 1586027186.0
        }
      ]
    }
  ]
}