{
  "id": "fvo5ug",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586130769.0,
  "title": "Request: How can you fix your metabolism after years of restriction?",
  "selftext": " \n\nFirst post, apologies for the length: I am a senior in college (home due to COVID19) that has struggled with anorexia (occasionally binge eating) all four years of college. I came into college around xxx pounds (5\"1' - normal BMI) never thinking about what I ate, started restricting what/how much I was eating pretty intensely to the point that I would count all my calories and have binge eating episodes (only when I came home) and had access to a lot of food that was not \"nutritionally efficient\" and that I had been depriving myself of.\n\nLast spring I was around xxx pounds (underweight BMI), not exercising really at all but very busy. This past summer I weighed myself every day and was around xxx pounds (still underweight BMI), eating yyy calories - a low number (I think - I don't know that this is accurate but it is what I was aiming for) or so calories every day and exercising pretty hard 4 or 5 days a week trying to gain muscle.\n\nThis past fall semester I made the decision to try to gain weight to protect my organs. I got rid of my scale at school and gradually gained weight to around xxx pounds (back into low end of normal BMI) eating quite a bit more (closer to xxx a day - a normal amount) but also cycling heavily because I didn't want to gain \"just fat\", up to 50 miles on the weekends. For the past few months (all of 2020) I have been at this weight even eating only xxx calories ( a very low number)  a day but not cycling as much and still gradually gaining weight. At the point that I was still gaining weight on xxx calories a day I decided I needed to actually fix my metabolism and stop obsessing.\n\nEven though I'm back now near where my natural weight was before college, I think my metabolism is severely messed up from doing this for so long. I had read in the past that the only way to fix deprivation for so long is something akin to the \"Homeodynamic Recovery Method\" or eating a completely unrestricted diet so your body can adjust to having more than enough nutrients. Is this true? Is that what I should be doing even if I'm not severely underweight anymore?\n\nTLDR: How can you fix  your metabolism after years of restriction?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fvo5ug/request_how_can_you_fix_your_metabolism_after/",
  "score": 50,
  "num_comments": 6,
  "comments": [
    {
      "id": "fmklt4z",
      "author": "Ghordrin",
      "body": "So, recovering from a messed up metabolism is hard. I don't have any tips specifically for you but for those interested here's a few interesting articles about hunger, metabolism and recovering:\n\nWhat are the effects of a slowed down metabolism on the body:\nhttps://www.psychologytoday.com/us/blog/hunger-artist/201603/how-does-metabolic-rate-really-change-after-anorexia-part-1\n\nSomeone who's had the same question as you on the NEDA website:\n\nhttps://www.nationaleatingdisorders.org/messed-metabolism\n\nWhat is metabolism? How does it work?\nhttps://psychology.wikia.org/wiki/Metabolism\n\nA quick summary:\n\nYour body needs time to recover. It doesn't matter which ED you've had. Any of them are harmful for your metabolism and your body. \n\nIn order to fix your metabolism, it's important to take things slow. You don't fix damage from years of restricting, purging, binging, etc... in a few days / weeks.\n\nIf you have the possibility to get a nutritionist who specialises in eating disorders, do so. They're the only ones able to ACTUALLY help YOU.\n\nAll we can do is provide information and / or experiences. But only a licensed nutritionist who specialises in eating disorders can help you. \n\nStarting to eat properly is a step towards recovery. However, unrestricted eating can bring challenges. (Trigger foods).\n\nI hope you get through this. Remember, you're stronger than your eating disorder.\n\n\nEDIT: I forgot one more important part: exercise. Stay active. It'll help",
      "created_utc": 1586159459.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fmklxwt",
      "author": "rekacsenpai",
      "body": "For me, eating as much as I felt like I needed has helped a lot. My metabolism was really messed up too. The key is eating enough (of healthy things), and you will also need LOTS of fibre! There were days when I was able to eat like 10 portions of fruits and vegetables. Of course, don't go overboard! The key is balance.",
      "created_utc": 1586159598.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fmlf72t",
      "author": "BlumpkinsRule55",
      "body": "I do not know the science behind this but I know what worked for me. I had to complete let go of counting calories and being crazy about cardio. I completely let go of all of that and started gaining weight. Throughout this I was still really active weight lifting everyday. It was hard to see me gaining weight but mentally I was getting so much better. I eventually started shedding some fat with some cardio but not near the amounts I used to. I have found that weight lifting and putting on some muscle has drastically helped my metabolism and to help me feel really strong and healthy. The body expends more calories with more muscle tone. I’m a young female and no I’m not bulky, but I feel the best I’ve ever felt. \n\nShort summary: let your body rebound on eating whatever it needs, start weight lifting and nourishing your body as needed. \n\nWishing you all the best!!",
      "created_utc": 1586185193.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fmmsg7w",
      "author": "paradoxrevel",
      "body": "I don't have advice, I am so sorry! But I wanted to drop a line to say I'm kind of going through something similar. Except I am 34. I've tried many times and been in pseudo recoveries that always led to relapses. My only wish is that I had done it sooner. I don't think it gets easier or that there's any hack, honestly. I also think there's been many studies on over-shooting set-point weight in the recovery process. I am trying to keep in mind that this is normal and temporary. I have a friend who had to take life-saving medication for a while that caused her to gain weight. Eventually, she was healthy enough to stop taking the medication and she returned to her previous weight, but there was no way to skip that stage of healing and save her life. I try to use that as an analogy to what I'm going through. Maybe I can't get to healthy without going through this phase. I'm sending you lots of love and courage and hoping you have a pair of comfy sweatpants or leggings!",
      "created_utc": 1586211197.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmmc5qd",
      "author": "blurredeyeglasses",
      "body": "Yessss! This post was so well written!",
      "created_utc": 1586202636.0,
      "score": 2,
      "context": [
        {
          "id": "fmklt4z",
          "author": "Ghordrin",
          "body": "So, recovering from a messed up metabolism is hard. I don't have any tips specifically for you but for those interested here's a few interesting articles about hunger, metabolism and recovering:\n\nWhat are the effects of a slowed down metabolism on the body:\nhttps://www.psychologytoday.com/us/blog/hunger-artist/201603/how-does-metabolic-rate-really-change-after-anorexia-part-1\n\nSomeone who's had the same question as you on the NEDA website:\n\nhttps://www.nationaleatingdisorders.org/messed-metabolism\n\nWhat is metabolism? How does it work?\nhttps://psychology.wikia.org/wiki/Metabolism\n\nA quick summary:\n\nYour body needs time to recover. It doesn't matter which ED you've had. Any of them are harmful for your metabolism and your body. \n\nIn order to fix your metabolism, it's important to take things slow. You don't fix damage from years of restricting, purging, binging, etc... in a few days / weeks.\n\nIf you have the possibility to get a nutritionist who specialises in eating disorders, do so. They're the only ones able to ACTUALLY help YOU.\n\nAll we can do is provide information and / or experiences. But only a licensed nutritionist who specialises in eating disorders can help you. \n\nStarting to eat properly is a step towards recovery. However, unrestricted eating can bring challenges. (Trigger foods).\n\nI hope you get through this. Remember, you're stronger than your eating disorder.\n\n\nEDIT: I forgot one more important part: exercise. Stay active. It'll help",
          "created_utc": 1586159459.0
        }
      ]
    },
    {
      "id": "fmkv796",
      "author": "hazelnut_mylk",
      "body": "this. intuitive eating and patience. it takes a while for your body to heal but stick to it",
      "created_utc": 1586169923.0,
      "score": 3,
      "context": [
        {
          "id": "fmklxwt",
          "author": "rekacsenpai",
          "body": "For me, eating as much as I felt like I needed has helped a lot. My metabolism was really messed up too. The key is eating enough (of healthy things), and you will also need LOTS of fibre! There were days when I was able to eat like 10 portions of fruits and vegetables. Of course, don't go overboard! The key is balance.",
          "created_utc": 1586159598.0
        }
      ]
    }
  ]
}