{
  "id": "fw84ct",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586210899.0,
  "title": "Request: Post request - is this bulimia, or another eating disorder, or even an eating disorder at all?",
  "selftext": "I’m a “healthy” BMI but have obsessive thoughts about losing weight and a lot of body insecurities. I am constantly cycling between eating more than I even want and fasting, it’s always one or the other. I’ll go days without eating anything then inevitably binge.  Every time it’s extremely emotionally distressing. I would vomit if I could but have never been able to, so I just fast. I’ve heard of “exercise bulimia” but not “fasting bulimia” and I don’t really know if it qualifies or if it would be something else",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fw84ct/request_post_request_is_this_bulimia_or_another/",
  "score": 44,
  "num_comments": 9,
  "comments": [
    {
      "id": "fmmsnud",
      "author": "Lynnae_MUA",
      "body": " It a doctor, but I am a recovered Anorexia Binge/Purge subtype recovery! This sounds like ED unspecified. I would highly recommend seeking a therapist to start to deal with the emotional side of this. And talk with your GP about making sure your body is okay. Recovery is possible! Stay strong and feel free to DM me if you need anything!",
      "created_utc": 1586211311.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fmni1rf",
      "author": "None",
      "body": "This IS bulimia. Bulimia is not specifically vomiting, it’s using compensatory measures to counter a binge. \n\n\nPer the DSM: *Recurrent inappropriate compensatory behavior to prevent weight gain, such as self-induced vomiting, misuse of laxatives, diuretics, or other medications, fasting, or excessive exercise*\n\nPlease seek help. All eating disorders are miserable and treatment can truly be life changing.",
      "created_utc": 1586226533.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fmmvk6l",
      "author": "the_scientist52",
      "body": "This sounds like it could be OSFED, which is Other Specified Feeding/Eating Disorder.  Basically it's an eating disorder that doesn't fit neatly into bulimia/anorexia/BED, which is actually super common!  A lot of people's EDs either have features of multiple disorders at once or just don't quite fit exactly with one of the other disorders.  It's a valid problem and something I'd recommend seeking help for.",
      "created_utc": 1586212912.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fmnawui",
      "author": "griceyrains",
      "body": "It's a common misconception that bulimia only involves vomiting! Bulimia involves any attempt to purge \"excess\" or unwanted calories, or make up for the consumption of them, which includes methods like fasting. Bulimics may also use laxatives or enemas, excerise excessively or use other methods. You can definitely be diagnosed with bulimia if you binge and then fast.\n\nAlso Best of luck and I hope that your health improves x",
      "created_utc": 1586221947.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fmmtabm",
      "author": "mutantandproud95",
      "body": "That is a disorder. It isn't bulimia but that kind of a relationship with food is horribly detrimental to your mental wellbeing. Just because it doesn't have the same physical symptoms as most eating disorders please pay no attention to people who try to downplay it. Your suffering is valid.\n\nI'm a man in my 20s and have been doing the same thing to myself for years. I consider myself recovered but still feel horribly guilty after over indulging. What gets me by is thinking of food as one of life's pleasures, and above all accepting and believing that you deserve that pleasure and you don't need to do anything to justify, earn, or be worthy of it. You are good enough as you are and fasting doesn't make you better. Once you believe that you're attitude and self esteem can start to improve.",
      "created_utc": 1586211659.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fmmsjyz",
      "author": "ultralighted",
      "body": "I'm not an expert but I've definitely heard of fasting being a form of purging and what you've described seems like a common experience for people with EDs, I'm sorry you're going through this\n\nI'm not sure if it would be diagnosed as bulimia or osfed or some other form of eating disorder but it sounds serious and I really really hope you can get some support",
      "created_utc": 1586211254.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fmnh6wz",
      "author": "nodaybuttoday__",
      "body": "Absolutely OSFED. Having several symptoms across different disorders is common",
      "created_utc": 1586225975.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmo6lpc",
      "author": "marilynmonrae",
      "body": "this is exactly what i was struggling with",
      "created_utc": 1586247292.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmrvzyc",
      "author": "None",
      "body": "Hello! Obviously the best thing to do is to try and get referred to an eating disorder specialist, who will not only give you a proper diagnosis but also help you find ways to manage your illness and symptoms, specific to you.\n\nI was diagnosed with bulimia nervosa a couple of years ago, but beforehand I suspected it was OSFED - like you I also went/go through phases of overeating and undereating, and didn’t start purging until I was at least a year in.\n\nI hope you’re doing okay, and are able to get the help you need!",
      "created_utc": 1586337509.0,
      "score": 1,
      "context": []
    }
  ]
}