{
  "id": "fwjsov",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586263145.0,
  "title": "Request: I feel like it's my fault for having an eating disorder",
  "selftext": "I just kinda feel responsible for all those things. I brought this onto myself. I'm choosing to continue to destruct myself and I'm doing so deliberately. I could choose to stop but I guess we all know that that's really difficult, yet I feel like I could just eat like a normal person again but I just don't want to. \n\nI knew what I was getting myself into. I guess it might have happened either way because I had problems with food even as a kid but that's just one reason more to not start starving myself and yet I did it. \n\nI tried to stop restricting but then I chose to stop eating again. I'm always going between eating healthy and not eating at all and that's just because I \"tried starving\" a few years ago. If I hadn't done that I probably wouldn't even post here.\n\nI'm no native speaker so I might have chosen words that don't exactly express what I mean but I guess you get the gist.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fwjsov/request_i_feel_like_its_my_fault_for_having_an/",
  "score": 75,
  "num_comments": 5,
  "comments": [
    {
      "id": "fmoqy9j",
      "author": "boneybabybitch",
      "body": "I can relate. \n\nI used to feel like a fraud because I felt like I “forced” some of these habits that now are my default setting. Through reflection, I figured out that my eating disorder habits when I was 12 years old (I am now 31) would not continue for all these years if I were a fraud.\n\nThe point is, it’s not your fault. This disease is, after all, a mental illness. It distorts your ability to think and act rationally at times. It may not mean much coming from a stranger on the internet, but I hope it helps to know that you are not alone.",
      "created_utc": 1586266570.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fmow52u",
      "author": "DNetherdrake",
      "body": "I feel exactly the same way, thank you for putting it into words. \n\nAlso your English looks perfect to me, don't worry.",
      "created_utc": 1586269650.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmtxrwo",
      "author": "roseroyce99",
      "body": "Hi there!\n\nOne thing I can tell you from the start is that YOU ARE NOT ALONE. Do not sit and blame your self for this and this. What I can tell you is that you are recognizing that you are wanting to stop this cycle. I personally would go days with barely eating towards eating 3 big macs without a care in the world back to guilt. \n\nOne thing that has stuck with me from therapy is that it is okay to eat what you want!! \n\nFor example, if you are craving that amazing cheeseburger and fries but feel guilty. So instead you order a salad, you truly will not be satisfied. This can lead to binge eating. \n\nEat what you want, when you want. We all know what is healthy and what is not. Do not look at food as your enemy, food is here to nourish our bodies with nutrients. \n\nI hope this helps you <3",
      "created_utc": 1586380898.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmwci16",
      "author": "None",
      "body": "you didn’t “choose” to have an ed. You might have chose to use behaviuors such as restriction, binging, purging, excessive exercise, etc, AT FIRST. After these behaviours become engrained and automatic, know that you did not choose this.  The disorder you developed perpetuated and was not intentional at all on your part. Most of us start out with the desire to lose weight, but not to develop an ed, and even if you were a butterfly at first, you probably didn’t see the consequences of the disorder. Once you notice how detrimental an ed is, you might wish you hadn’t engaged in the initial behaviours because now they are the automatic response, again, not a choice but a mental shortcut/pathway. In short, an ed is not a choice or your fault. It’s a perfect storm of compounding factors, many of which are beyond our control. Know that though you can’t choose to have an ed, you can choose recovery.",
      "created_utc": 1586444043.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmpc95r",
      "author": "dicklessfifties",
      "body": "We’ve all been force fed a narrative that we are imperfect from day 1.\nIt’s not uncommon that we regurgitated that to ourselves. It’s a really difficult battle, don’t blame yourself for having it. Just keep fighting it.",
      "created_utc": 1586278267.0,
      "score": 1,
      "context": []
    }
  ]
}