{
  "id": "fxewf9",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586380015.0,
  "title": "Request: My mind during an eating disorder cycle",
  "selftext": "I equate my weight with my self-worth in a different sort of way then usual\n\nTo make this clear I absolutely do not and would never do this to anyone but myself \n\nI’m 5’2 and (a normal BMI) currently, which makes me feel worthless. It’s a very average weight and I seem to derive self-esteem from being “different” and having enough restraint to be a very low weight \n\nI used to weigh a lot less than I currently do. I obsessively track my calories (even more at the time) and compare my BMI to others. Any half-pound I lost or gained I would obsess over, and I’d measure myself repeatedly to make sure I was getting smaller or at least not bigger. I had a small  waist which I was incredibly proud of because of how abnormally small of a measurement that was, and I wanted to lose more weight so it would be smaller. At my current weight it’s a little bigger and I can only wear baggy clothes because that’s too big and normal and I don’t identify with it\n\nI don’t know if this gives an impression of being vain but I definitely never was, again I only had these standards for myself and actually hated the shit out of myself. I felt like I had no real worth or way of expressing myself other than through my body. It was not in a way of being sexually attractive either, just being able to show my pain and control externally in a way that I identified with\n\nI did not and honestly still don’t identify with my body at an “average” weight. I wear baggy clothes thinking that I’ll wear more revealing clothes once I get below a certain weight. I’m currently stuck in a binge/purge cycle of some sort (I don’t vomit, just fast for days).\n\n I probably would have qualified as anorexic when I was thinner but don’t even know what I would be anymore. Even at my lowest weight (which fit the BMI criteria for anorexia, though I was never diagnosed) I didn’t really look skinny, just small, and I even had a family member say I was skinny-fat which would trigger me more. I wanted to be boney and “abnormally” thin, enough that no one would question it for a second\n\nI wouldn’t say I had the kind of body dysmorphia that anorexics are typically portrayed as having. Although I’m very critical of myself I didn’t exactly see myself as overweight. I just wanted to see myself as underweight. Not attractive in a conventional sense. I wanted to be unusual, I felt that making my outside appearance unusual would match more closely to how I felt internally \n\nI actually remember some amount of this starting when I was a child, in elementary school. I hated being called cute. I’d scratch my skin up and wear black and rub my eyes to make my dark circles under them worse. I was small and had light blonde hair which I hated because people would tend to see me as some kind of wholesome innocent American girl. I think my kind of reserved personality made these impressions and thus my opinions about myself worse since people didn’t have as much to judge from. And I felt like I didn’t have much of a way of expressing it since society puts so much stock into corporeal existence as a reflection of who we are anyways. Especially girls\n\nTL;DR if you want a look inside the mind of one individual with an eating disorder of some kind then I guess this is it. I don’t know how typical this kind of reasoning or whatever you want to call it is",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fxewf9/request_my_mind_during_an_eating_disorder_cycle/",
  "score": 53,
  "num_comments": 4,
  "comments": [
    {
      "id": "fmugi83",
      "author": "updown27",
      "body": "Thank you for sharing your story. Everyone’s experience with ED is unique but we all share certain aspects. I hope you don’t mind if I share my thoughts on it as I find your experience to be quite interesting and you seem to have a lot of insight into your own ED. \n\nWhat I see in this post is a lot of internalized misogyny. Do you see that too? It is modeled from birth that to be female means to be weak, taken advantage of, objectified, assaulted. From a young agr you were trying to fight back against that imagery of you being a “girly girl” trying to avoid everything that came along with it. Cute means weak, incompetent, prey. But *different* - different catches people off guard, it changes their expectations, and “look at how strong and disciplined you are for being able to starve yourself into a contortion of who you once were”. That’ll show em. You’re not like other girls. Etc. (Idk if this is accurate for you, just putting out my train of thought). \n\nWhen it comes down to it this thinking is a dysfunctional obsession being employed to cope with a world that can be extremely diminishing and even dangerous for women, or anyone who might appear weak or disenfranchised. For me, I know my ED was strongly linked to sexual assault and the sensations that both experiences created both physically and emotionally. It wasn’t until I was probably a year or two into treatment that the gravity of our misogynistic culture and it’s effects on women really hit me. I haven’t been the same since. I see everything differently now. \n\nI don’t know you, so I hope you don’t take these comments personally as they are just my interpretation of what was shared here. I’d be interested to see what you think of these ideas. Do you think this has played a role in your eating disorder? I can only imagine that wanting to seem different means that normal has something inherently wrong with it. What could that be?",
      "created_utc": 1586390952.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fmui1l6",
      "author": "ledzeppelinfangirl",
      "body": "I could have written this myself, measurements and all. I hope you're okay and I'm sending you a big virtual hug!",
      "created_utc": 1586391814.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fmugul6",
      "author": "zebra223",
      "body": "I totally get it when you said that you only have those standards for yourself and not other people.\n\nAnd yes, it sounds vain, BUT everyone is more into themselves than others. Everyone wants to be the special person that stands out. Please know that this is NOT your fault. Social media has a bad influence on people's mental health by constantly exposing us to pictures of \"perfect people\".",
      "created_utc": 1586391148.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fmuvpal",
      "author": "anorexickitten",
      "body": "I never thought about this perspective before. I can say, reading OP - it's exactly what I have gone through/go through and I haven't linked it to misogyny but I see how that could be so. We do compare ourselves to others, scrutinize ourselves but for what? to what standard? So I just wanted to thank you for expressing this, because, in a way, it will help me let go of some of that self-hatred.",
      "created_utc": 1586399934.0,
      "score": 3,
      "context": [
        {
          "id": "fmugi83",
          "author": "updown27",
          "body": "Thank you for sharing your story. Everyone’s experience with ED is unique but we all share certain aspects. I hope you don’t mind if I share my thoughts on it as I find your experience to be quite interesting and you seem to have a lot of insight into your own ED. \n\nWhat I see in this post is a lot of internalized misogyny. Do you see that too? It is modeled from birth that to be female means to be weak, taken advantage of, objectified, assaulted. From a young agr you were trying to fight back against that imagery of you being a “girly girl” trying to avoid everything that came along with it. Cute means weak, incompetent, prey. But *different* - different catches people off guard, it changes their expectations, and “look at how strong and disciplined you are for being able to starve yourself into a contortion of who you once were”. That’ll show em. You’re not like other girls. Etc. (Idk if this is accurate for you, just putting out my train of thought). \n\nWhen it comes down to it this thinking is a dysfunctional obsession being employed to cope with a world that can be extremely diminishing and even dangerous for women, or anyone who might appear weak or disenfranchised. For me, I know my ED was strongly linked to sexual assault and the sensations that both experiences created both physically and emotionally. It wasn’t until I was probably a year or two into treatment that the gravity of our misogynistic culture and it’s effects on women really hit me. I haven’t been the same since. I see everything differently now. \n\nI don’t know you, so I hope you don’t take these comments personally as they are just my interpretation of what was shared here. I’d be interested to see what you think of these ideas. Do you think this has played a role in your eating disorder? I can only imagine that wanting to seem different means that normal has something inherently wrong with it. What could that be?",
          "created_utc": 1586390952.0
        }
      ]
    }
  ]
}