{
  "id": "fxnjbp",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586414950.0,
  "title": "Request: No control around food?",
  "selftext": "I feel like I have, and have had, am eating disorder my entire life but I don't know what it is.\n\nMy biggest issue is I legitimately cannot control myself around food, especially sweets. If it is there, it will be a I think about. I go to extremes to stop myself, not buying anything I could eat a lot of, throwing away food (but not simply putting it in the trash I have to make it not edible, otherwise I will dig it out of the trash). But when I read the criteria for binge eating it doesn't fit.\n\nI also feel immense shame about what I eat, I used to not eat in front of people, I did not want to be associated with food, I didnt want anyone to know that I ate or what I ate. I no longer do that, but if I eat a bunch of junk food in a day I feel SO so ashamed, I hate myself for it.\n\nI do not throw up, or take laxatives. I don't under eat. I don't over eat to an enormous degree. I feel like I don't fit any of the eating disorders. But, this shit can't be normal, and it has haunted me my whole life.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fxnjbp/request_no_control_around_food/",
  "score": 43,
  "num_comments": 8,
  "comments": [
    {
      "id": "fmvj46l",
      "author": "Working-Reaction",
      "body": "a therapist can help you work through your distressing relationship with food, they may even diagnose you. you don’t have to wait until you are ‘sick enough’ to get help.",
      "created_utc": 1586418821.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fmx0kur",
      "author": "Ironicbanana14",
      "body": "It could always be EDNOS",
      "created_utc": 1586456321.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fmy9gab",
      "author": "F1sh1ngCr33k",
      "body": "Also, no one has mentioned it yet but sugar is quite literally addictive. And so much stuff (especially in America) is *drenched* in sugar that we get way more if it than we think. It triggers certain receptors in your brain that make you feel good, and “rewards” you for eating it... which makes you want more. Highly recommend (as others have said) both a therapist and changing what you eat. I don’t like the term diet, but I can at least suggest short term you can try to eat better foods (whole foods like vegetables, meats, fruits, etc) and cut out things with sugar (including pasta and bread) for like a week or two and see if it helps. I lived off all kinds of processed stuff as a kid and after switching to more healthy/whole food as an adult after a couple nutrition classes that made me a little more aware of vitamin/mineral needs I feel sick if I eat sugar now.",
      "created_utc": 1586481012.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fmyitk9",
      "author": "cindycindyy",
      "body": "I used to be obsessed with food, to the point where I would think about food all day. I especially love eating sweets and that made me feel like I couldn't control myself around food. It is also worth noting that I had a history with food restriction in my past, both physical and mental. Since you say you don't under eat, are you possibly mentally restricting yourself? (Ie: having thoughts such as, \"I shouldn't be eating this\"/ \"This is so bad\"/ \"This is my last xyz then I won't eat any more\"/ etc.) Science has shown that when restriction is present, you will actually crave and want that food more.\n\nI am blessed in that I overcame my past eating disorders and food restriction/anxiety, but it took a lot of work and incremental steps to realize that food is okay, that sweets are okay. As I found myself eating whatever I want whenever I want and however much I want, including sweets, the more I found freedom from food thoughts and anxieties. The more I felt free.\n\nNot sure if this is kind of what you may be going through. Good luck to you. I'm here if you need, but highly agree with others in finding a therapist who may specialize in these matters.",
      "created_utc": 1586487195.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fmxyy3n",
      "author": "lavendertourmaline",
      "body": "Have you researched the Ketogenic Diet?\nIn a nutshell, this condition isn’t your fault. Modern foods are super whack. I would look into it if I were you. When I experienced freedom from food cravings and that sense of mental slavery my gratitude was so complete I could have cried.",
      "created_utc": 1586474652.0,
      "score": -3,
      "context": []
    },
    {
      "id": "fmw857x",
      "author": "None",
      "body": "Yeah, no one can diagnose you on here, we aren’t doctors or therapists. The best thing you can do is reach out to one to get help and perhaps a diagnosis, from there you can begin to work on the problems that you are experiencing around food. Again, DON’T wait until you think you’re “sick enough” because you never will be. You’ll always think, “it could be worse” which makes one delay or deny crucial treatment.",
      "created_utc": 1586441560.0,
      "score": 4,
      "context": [
        {
          "id": "fmvj46l",
          "author": "Working-Reaction",
          "body": "a therapist can help you work through your distressing relationship with food, they may even diagnose you. you don’t have to wait until you are ‘sick enough’ to get help.",
          "created_utc": 1586418821.0
        }
      ]
    },
    {
      "id": "g0amqhc",
      "author": "imsorrybunny",
      "body": "do you recommend reading food labels for that and only purchasing zero sugar products? i live mostly off of fruits, would i have to cut those out as well? i’ve noticed that sugar makes me hungrier and i would like to try limiting my intake of it",
      "created_utc": 1596515502.0,
      "score": 1,
      "context": [
        {
          "id": "fmy9gab",
          "author": "F1sh1ngCr33k",
          "body": "Also, no one has mentioned it yet but sugar is quite literally addictive. And so much stuff (especially in America) is *drenched* in sugar that we get way more if it than we think. It triggers certain receptors in your brain that make you feel good, and “rewards” you for eating it... which makes you want more. Highly recommend (as others have said) both a therapist and changing what you eat. I don’t like the term diet, but I can at least suggest short term you can try to eat better foods (whole foods like vegetables, meats, fruits, etc) and cut out things with sugar (including pasta and bread) for like a week or two and see if it helps. I lived off all kinds of processed stuff as a kid and after switching to more healthy/whole food as an adult after a couple nutrition classes that made me a little more aware of vitamin/mineral needs I feel sick if I eat sugar now.",
          "created_utc": 1586481012.0
        }
      ]
    },
    {
      "id": "g0anoxn",
      "author": "F1sh1ngCr33k",
      "body": "Personally I’ve switched to eating as much “whole” food as possible- if it comes out of a bag/box/package I just avoid it. Otherwise, it’s fair game. Obviously this isn’t a hard and fast rule, but I stick to things that I either cook or mix myself (I am NOT a good cook, but even I can stir fry some vegetables and make scrambled eggs.) By taking out all the “extra” ingredients in most processed food it cuts out SO many extra preservatives and sugars. I feel horribly sick when I eat processed foods now- something like chex mix will give me stomach cramps for days. I eat a LOT of fruit, and I don’t feel like the “natural” sugar in fruit has the same effect as the sugar in processed foods.\n\nI’d also like to note that the things like High Fructose Corn Syrup and other processed sugars are VERY bad for you. Like, on a molecular level. I have a biochem degree and we actually learned a lot of molecular-level nutrition in some of my classes and high fructose corn syrup breaks down completely differently than the sugars and fats found “naturally” in fruits/other foods. I forget the exact details because it’s been a few years, but processed foods with a long list of ingredients are actually really terrible for you if you eat a lot of them.",
      "created_utc": 1596516185.0,
      "score": 1,
      "context": [
        {
          "id": "fmy9gab",
          "author": "F1sh1ngCr33k",
          "body": "Also, no one has mentioned it yet but sugar is quite literally addictive. And so much stuff (especially in America) is *drenched* in sugar that we get way more if it than we think. It triggers certain receptors in your brain that make you feel good, and “rewards” you for eating it... which makes you want more. Highly recommend (as others have said) both a therapist and changing what you eat. I don’t like the term diet, but I can at least suggest short term you can try to eat better foods (whole foods like vegetables, meats, fruits, etc) and cut out things with sugar (including pasta and bread) for like a week or two and see if it helps. I lived off all kinds of processed stuff as a kid and after switching to more healthy/whole food as an adult after a couple nutrition classes that made me a little more aware of vitamin/mineral needs I feel sick if I eat sugar now.",
          "created_utc": 1586481012.0
        },
        {
          "id": "g0amqhc",
          "author": "imsorrybunny",
          "body": "do you recommend reading food labels for that and only purchasing zero sugar products? i live mostly off of fruits, would i have to cut those out as well? i’ve noticed that sugar makes me hungrier and i would like to try limiting my intake of it",
          "created_utc": 1596515502.0
        }
      ]
    }
  ]
}