{
  "id": "fypjqd",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586555003.0,
  "title": "Request: My wife just told me she’s Bulimic, and I’ve been doing everything wrong",
  "selftext": "My wife just told me she’s bulimic since high school (she’s in her late 20s now). She has told no one about it but me. After we talked (the talk ended badly), I immediately went online to look for advices on how to support my partner. I found out I was doing everything wrong when I didn’t know about it.\n\n- I tell her whenever I think she’s pretty on a certain day (I end with the compliment with ‘today’)\n- I comment on her eating habits (cutting carbs, not eating enough)\n- I contradict her (strongly) whenever she tells me she feels bloated or fat\n- I get her to eat at unhealthy restaurants with me a lot and I talk to her about food a lot\n- I tell her whenever she has gotten thinner\n- I am not good at diverting topics in our conversations, I usually dwell on the topic (which is a problem if the topic is about body image or eating habits)\n- When she says she is fat, I tell her that I am fatter\n- the list goes on\n\nThings even got bad when she opened up about it cause being me, I quickly asked her if she has a plan to do something about it (which was wrong and I didnt mean it, I was just trying to be forward thinking, but it was wrong)\n\n*** I have an anxiety disorder. So I really am panicking. It is 6 am now and I havent slept yet since yesterday when she told me about it. I feel really bad since I may have made her condition worse through the years we were together just because of how I naturally am. I am an honest guy and I find it difficult to not be honest with my wife when I am asked with questions such as ‘have I gotten thinner?’ ‘Do you think I put on some weight?’. Judging from the advices on what I should do to support her, I need to change how I normally converse with her and how I am normally interacting with her, and I am very worried if I can do this properly.\n\nPlease help me out. I really want to support her. Right now, she regrets opening it up to me. I really dont know what to do first. I am scared of screwing things up. I feel pressured that I might say the wrong things again. Im afraid of actually feeling anxious everytime I talk to her.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fypjqd/request_my_wife_just_told_me_shes_bulimic_and_ive/",
  "score": 210,
  "num_comments": 21,
  "comments": [
    {
      "id": "fn1ad2b",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586557960.0,
      "score": 69,
      "context": []
    },
    {
      "id": "fn17c5d",
      "author": "None",
      "body": "You may find this helpful—\n\nhttps://www.reddit.com/r/EatingDisorders/comments/do1788/request_my_gf_is_struggling_and_i_wanna_help_her/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n\nMaybe try complimenting her on things that are not her appearance, and ask her if she has any foods that she feels okay eating (‘safe foods’). You can try to encourage her to eat these. Looking into harm reduction tips can also be very beneficial, since bulimia can be damaging.\n\n\nhttps://www.reddit.com/r/EDAnonymous/comments/eutdb1/harm_reduction_tip_for_bulimics_from_my_dentist/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n\nhttps://www.reddit.com/r/EDAnonymous/comments/9xi11j/harm_reduction_masterlist/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nr/EDanonymous may be a useful sub to visit, just to try and gain a better understanding of eating disorders in general",
      "created_utc": 1586556233.0,
      "score": 25,
      "context": []
    },
    {
      "id": "fn1jfut",
      "author": "stopitma",
      "body": "If she has been struggling with this since high school and JUST opened up about it, you can not blame yourself for it at all. The fact that you're here asking for advice is a testament that you care about her, and that's the most important thing.\n\nYou asked what to do first, I would ask her how you can best support her! Don't be worried about saying \"the wrong things\". You *will* say the wrong things sometimes, but your partner is open to talking about it now, and you'll learn how to better support her in time. You can't expect to be an expert right away.\n\nSome extra advice:\nWhen she's asking you if she's gained weight or looks thinner, this is known as \"body-checking\". Don't get involved in it. You could say something like, \"I'm not going to over-analyze your body. I think you're beautiful, full stop.\" Being honest is cool, but she's engaging in unhealthy behaviors and you don't have to. She's basically using you as an extra mirror for self-sabotage and if you can eliminate that possibility, it's gonna be a good thing.\n\nAs far as restaurants go, she may feel more comfortable in having the final say for where you go. I'm recovered from an ED but still feel more in control if I get to choose where and what to eat. She could be the same way. \n\nFor compliments go, really steer away from any comments on body image. This goes for her body, but yours too. Calling yourself fat helps no one. If she's calling herself fat, change the topic to her personality. Something like, \"I don't see you that way. I see a smart, fashionable, lovable woman and I refuse to see you any other way.\" \n\nLastly, you were NOT wrong to ask if she's going to do anything about it, but she may be alarmed because her telling you was already a huge step. Maybe you could gently encourage her to start thinking about if treatment could be a good thing for her, and expressing that you'd like to see her recover. Obviously, treatment is going to be essential at some point but she may not be ready to admit it, even to herself.",
      "created_utc": 1586563291.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fn1rtji",
      "author": "psyche_bee",
      "body": "I wish my husband looked into my ED as much as you are looking into your wife's. She is lucky you care so much and are being so understanding. Communicate with her that you are afraid of exacerbating her illness due to misunderstandings and you want to come up with a plan so you can support her, understand her, and avoid making eachother uncomfortable. Dont say you want her to be \"healthy\" healthy means fat to some ppl with Ed's. Just say you want to help her feel better and you know how hard it must be for her. You want to see her live a long time and help her reach her goals but are worried about her damaging herself / her organs. She needs more help emotionally than with habits. Le pen rning to love herself is the most important thing.",
      "created_utc": 1586568627.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fn167kf",
      "author": "None",
      "body": "What exactly happened in the talk? And did she explain how the bulimia personally affects her? Some people have triggers or different types of weight restricting methods.",
      "created_utc": 1586555596.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn1i6hm",
      "author": "emmy_the_average",
      "body": "Have you expressed to her that you did some research and realized you may have triggered her? You're doing a great thing by trying to learn about this, most people wouldn't even go this far. She is so lucky to have someone like you who puts effort in to understanding. \n\nIf I were her and I read what you wrote, I would feel so much appreciation.",
      "created_utc": 1586562527.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn1nlco",
      "author": "updown27",
      "body": "Take some deep breaths, you can learn ways to interact that are more helpful but it is up to the person with the disorder to tell people that they are struggling. You never could have changed your behavior if you don’t even know there is a problem in the first place. And same thing going forward, your wife is going to have to communicate more if your methods of supporting her aren’t helpful. No one teaches us how to navigate stuff like this. It takes effort and knowledge. \n\nHere’s a tip: when she says she feels bloated you can say something like “that must be really uncomfortable, how can I get your mind off it?” Suggest something like movie, game, sing/dance, etc. \n\nYou’re gonna be alright. You care and that’s the first, biggest, and most important step! Keep up the good work.",
      "created_utc": 1586565890.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn1o9kz",
      "author": "Nozmelley0",
      "body": "Does she know you have an anxiety disorder?  \nHonestly, there's a high probability that could make it easier for you do understand each other, so long as you can figure out how to communicate.  \n\nOr you can show her this thread.  Because seriously, it sounds like you're both too anxious to say what you mean, probably not only to each other but even to yourselves.",
      "created_utc": 1586566322.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn1ry2y",
      "author": "flightlessbird9",
      "body": "Don’t beat yourself up... many don’t know the proper way to handle these things... encourage recovery... remember that baby steps are still steps... nearly everyone in recovery has some minor relapses don’t beat anyone up over it if she’s not ready for recovery yet help her practice mindful eating... there’s plenty of things you can do to help WITHOUT forcibly bringing up food... routines help as well... :) I’m not a clinical professional these are all things I learned in residential treatment and IOP.",
      "created_utc": 1586568711.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn1tfmx",
      "author": "hazelnut_mylk",
      "body": "well, you didn’t mean it despite being your intentions and i think your willingness to try and understand so you can help her says a lot about you. kudos to her for communicating that with you!  \n\nI’d like to remind OP as well as everyone who’s struggling an ED (eating disorder) that as much as others can try and emphasise and learn to be mindful of their comments, at the end of the day, your ED triggers are there because of well, your ED. I hope you seek help because the truth is, we can’t avoid the world or what triggers there might be (other than the obvious self-sabotaging), but we can work ourselves and our perceptions.\n\nthe truth is, ed takes whatever your loved one says and twist it into something about your weight and worth when the person who said those comment might have never ever mean or thought that to begin with. \n\nwith that said, OP i hope your wife gets professional help. at the end of the day, we can only support them while they take active steps to help themselves. we aren’t the professionals after all so i’ll say to support her, be mindful of body comments/negativity, and delegate this to the professionals. \ngood luck.",
      "created_utc": 1586569690.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn28t4c",
      "author": "nodaybuttoday__",
      "body": "“Getting her to eat at unhealthy restaurants” ... isn’t wrong. If anything she needs to be exposed to any and all foods and you shouldn’t ever call a food/type of food “bad.” \n\nYou also need to understand that even though this is a mental illness, she makes choices too. It’s not just on you. Choosing to stay in her ED instead of recovering is a decision she can make when she’s ready. Let her have her agency and don’t take it so personally.",
      "created_utc": 1586581101.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn28w3v",
      "author": "nodaybuttoday__",
      "body": "Also, definitely just don’t comment on her body even if you think it’s a compliment. It reinforces that beautiful = thin and thin = good.",
      "created_utc": 1586581170.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn2bgk9",
      "author": "edie43",
      "body": "When I first told my bf I was bulimic it didn’t go well either. It turned out a few months later that he hadn’t even really taken it seriously when I told him. I blamed him for a while but now I realise that there is no way he could have known how to react because he had no experience with eating disorders at all.\n\nI agree with the comment that says you should be open about what you’re thinking right now. Tell her you’re sorry things went the way they did and that you’re just unsure how to support her but that you want to be there for her. \n\nI brought my bf to see my therapist recently and she told him that he shouldn’t change his life or act as a carer for me, but just be there as a support and understand things like the how my moods can go up and down while I’m in treatment. \n\nOP, you sound like a really good person, as long as you keep the attitude you’re showing in your post and be sure to ask her what she needs from you, you’ll be fine and there’s not much more you can do. Of course you can encourage her to get help, but don’t push her. And lastly I want to say that you haven’t made things worse over the course of your marriage. Unless you’ve actively shamed her for her body or tried to make her lose weight, you’ve acted the way any person would in a normal relationship. You didn’t know and you shouldn’t beat yourself up for it. \n\nNow try to get some sleep!",
      "created_utc": 1586583411.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn2tmdd",
      "author": "Working-Reaction",
      "body": "i think you should definitely tell her your concerns over triggering her, not only will it reassure her that you care about her very much, it will help you to understand what you can do to support her. she’ll be able to tell you what you are doing that triggers her.",
      "created_utc": 1586602822.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn36m0n",
      "author": "everydayis_caturday",
      "body": "I’m just starting the recovery journey and my doctor said something that really struck my partner and I. My doctor told us in my last appointment, that it is not his job to make sure I eat, eat more, or don’t eat, his job is to support me through meals, and support me emotionally since there is so much emotion in relation to food. As soon as my partner became my cheerleader on the sidelines, completely judgement free, he was there to support my meal time or help me prepare food when it’s just too hard for me. It’s made talking about the issues easier and more like we are battling  it together rather than alone",
      "created_utc": 1586614124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn55szm",
      "author": "None",
      "body": "Don't worry so much about what to say, there aren't really any magical words that will solve everything, so your goal should be to listen.  Let her explore this with you by allowing her to speak about it.  She trusted you enough to come to you with something that in some ways nobody knows more about than she does.  Please lose the idea that the goal is to fix this, mental health is a balancing act that we perform our entire lives, and expecting her to be fixed is setting her up for failure.  Ask her if there's anything that she needs, other than that generally try not to make her feel sick by hyper focusing on one part of her life and not allowing for the good to outshine it sometimes, whenever it can.  Always remember the woman that amazes you.",
      "created_utc": 1586656618.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn1fwfa",
      "author": "bingumarmar",
      "body": "For real! The fact OP recognizes they made some mistakes (even though it was all accidental) and now actually feel bad about it shows really great initiative and such a devotion to their partner. It's awesome.",
      "created_utc": 1586561171.0,
      "score": 25,
      "context": [
        {
          "id": "fn1ad2b",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586557960.0
        }
      ]
    },
    {
      "id": "fn1osyx",
      "author": "tymopa",
      "body": "From someone who has gone to intensive outpatient therapy for bulimia don't encourage or discourage foods at all to anyone, especially those with EDs. Keep food completely off the table 😉.",
      "created_utc": 1586566662.0,
      "score": 9,
      "context": [
        {
          "id": "fn17c5d",
          "author": "None",
          "body": "You may find this helpful—\n\nhttps://www.reddit.com/r/EatingDisorders/comments/do1788/request_my_gf_is_struggling_and_i_wanna_help_her/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n\nMaybe try complimenting her on things that are not her appearance, and ask her if she has any foods that she feels okay eating (‘safe foods’). You can try to encourage her to eat these. Looking into harm reduction tips can also be very beneficial, since bulimia can be damaging.\n\n\nhttps://www.reddit.com/r/EDAnonymous/comments/eutdb1/harm_reduction_tip_for_bulimics_from_my_dentist/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n\nhttps://www.reddit.com/r/EDAnonymous/comments/9xi11j/harm_reduction_masterlist/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nr/EDanonymous may be a useful sub to visit, just to try and gain a better understanding of eating disorders in general",
          "created_utc": 1586556233.0
        }
      ]
    },
    {
      "id": "fn1rcqo",
      "author": "PsychadelicSpaceCat",
      "body": "Don't have anything to add, just chiming in to say this is all great advice! OP hope you see the above reply. I've had bulimia ~7 years and this approach sounds like it would be really helpful and supportive",
      "created_utc": 1586568319.0,
      "score": 3,
      "context": [
        {
          "id": "fn1jfut",
          "author": "stopitma",
          "body": "If she has been struggling with this since high school and JUST opened up about it, you can not blame yourself for it at all. The fact that you're here asking for advice is a testament that you care about her, and that's the most important thing.\n\nYou asked what to do first, I would ask her how you can best support her! Don't be worried about saying \"the wrong things\". You *will* say the wrong things sometimes, but your partner is open to talking about it now, and you'll learn how to better support her in time. You can't expect to be an expert right away.\n\nSome extra advice:\nWhen she's asking you if she's gained weight or looks thinner, this is known as \"body-checking\". Don't get involved in it. You could say something like, \"I'm not going to over-analyze your body. I think you're beautiful, full stop.\" Being honest is cool, but she's engaging in unhealthy behaviors and you don't have to. She's basically using you as an extra mirror for self-sabotage and if you can eliminate that possibility, it's gonna be a good thing.\n\nAs far as restaurants go, she may feel more comfortable in having the final say for where you go. I'm recovered from an ED but still feel more in control if I get to choose where and what to eat. She could be the same way. \n\nFor compliments go, really steer away from any comments on body image. This goes for her body, but yours too. Calling yourself fat helps no one. If she's calling herself fat, change the topic to her personality. Something like, \"I don't see you that way. I see a smart, fashionable, lovable woman and I refuse to see you any other way.\" \n\nLastly, you were NOT wrong to ask if she's going to do anything about it, but she may be alarmed because her telling you was already a huge step. Maybe you could gently encourage her to start thinking about if treatment could be a good thing for her, and expressing that you'd like to see her recover. Obviously, treatment is going to be essential at some point but she may not be ready to admit it, even to herself.",
          "created_utc": 1586563291.0
        }
      ]
    },
    {
      "id": "fn1rdxf",
      "author": "tymopa",
      "body": "So much this! I started my bulimia at 15. My life slowly degraded to a desperate point at 46 when I FINALLY got serious treatment. I had no idea what I was dealing with until then. I opened up to people throughout the years, went to different therapists, and it wasn't until I found an eating disorder clinic that changed my life. Your wife knows she has a problem, but she doesn't yet understand the complexities of social messaging that perpetuates it. \n\nAs a spouse, you are starting off right. You are trying to learn and though the adjustment will be rocky, you won't be the cause for her disorder. You also won't be the cure. This is all on her. You best role will come from learning as much as you can so you can be there for her in the most understandable way possible. You will say the wrong things, but that can't be helped. Just do your best.\n\n My husband was in your shoes and even came to the clinic a couple of times to get some advice and insight. Here are some tips: 1) EDs are saturated with shame...just like addictions. Being vulnerable and seeking professional help is a sign of strength, not weakness. Reluctance to get professional help is usually tied to the idea that we can fix ourselves if we just ate right AND look a certain way.  2) EDs are rarely about food, but something different. Therapy helps unpack that and provides awareness and tools to utilize other mechanisms for coping other than bulimia. 3) Categorizing foods into good and bad exacerbate EDs. 4) Commenting on any bodies is destructive...period, but most people don't know. 5) Not all therapists are created equal. A person with an eating disorder REALLY needs someone who specializes in this. I've had really traumatic experiences with therapists because they have no clue. 6) Numbers...weight, calories, steps, carbs, BMI...dangerous...feeds into the ED. 7) NEDA.org is a GREAT resource. If you want to PM me I'm happy to chat more. Check out Brene Brown's videos on vulnerability and shame. She's a gem.",
      "created_utc": 1586568340.0,
      "score": 2,
      "context": [
        {
          "id": "fn1jfut",
          "author": "stopitma",
          "body": "If she has been struggling with this since high school and JUST opened up about it, you can not blame yourself for it at all. The fact that you're here asking for advice is a testament that you care about her, and that's the most important thing.\n\nYou asked what to do first, I would ask her how you can best support her! Don't be worried about saying \"the wrong things\". You *will* say the wrong things sometimes, but your partner is open to talking about it now, and you'll learn how to better support her in time. You can't expect to be an expert right away.\n\nSome extra advice:\nWhen she's asking you if she's gained weight or looks thinner, this is known as \"body-checking\". Don't get involved in it. You could say something like, \"I'm not going to over-analyze your body. I think you're beautiful, full stop.\" Being honest is cool, but she's engaging in unhealthy behaviors and you don't have to. She's basically using you as an extra mirror for self-sabotage and if you can eliminate that possibility, it's gonna be a good thing.\n\nAs far as restaurants go, she may feel more comfortable in having the final say for where you go. I'm recovered from an ED but still feel more in control if I get to choose where and what to eat. She could be the same way. \n\nFor compliments go, really steer away from any comments on body image. This goes for her body, but yours too. Calling yourself fat helps no one. If she's calling herself fat, change the topic to her personality. Something like, \"I don't see you that way. I see a smart, fashionable, lovable woman and I refuse to see you any other way.\" \n\nLastly, you were NOT wrong to ask if she's going to do anything about it, but she may be alarmed because her telling you was already a huge step. Maybe you could gently encourage her to start thinking about if treatment could be a good thing for her, and expressing that you'd like to see her recover. Obviously, treatment is going to be essential at some point but she may not be ready to admit it, even to herself.",
          "created_utc": 1586563291.0
        }
      ]
    },
    {
      "id": "fn9aqqn",
      "author": "tymopa",
      "body": "You are so right. Sorry you haven't gotten that support from your husband. My treatment center hosted a family night once a month. If that didn't happen I don't think my husband would have learned that on his own. Nobody gets it unless they've been through it.",
      "created_utc": 1586765635.0,
      "score": 1,
      "context": [
        {
          "id": "fn1rtji",
          "author": "psyche_bee",
          "body": "I wish my husband looked into my ED as much as you are looking into your wife's. She is lucky you care so much and are being so understanding. Communicate with her that you are afraid of exacerbating her illness due to misunderstandings and you want to come up with a plan so you can support her, understand her, and avoid making eachother uncomfortable. Dont say you want her to be \"healthy\" healthy means fat to some ppl with Ed's. Just say you want to help her feel better and you know how hard it must be for her. You want to see her live a long time and help her reach her goals but are worried about her damaging herself / her organs. She needs more help emotionally than with habits. Le pen rning to love herself is the most important thing.",
          "created_utc": 1586568627.0
        }
      ]
    },
    {
      "id": "fn2kbya",
      "author": "None",
      "body": "I have ana binge/purge subtype, so my advice came both from experience and how I would like to be treated by a significant other. I have safe foods, like rice cakes or carrots, that I feel okay about eating and am able to keep down. Might be a little off because of this, so thank you!",
      "created_utc": 1586592187.0,
      "score": 1,
      "context": [
        {
          "id": "fn17c5d",
          "author": "None",
          "body": "You may find this helpful—\n\nhttps://www.reddit.com/r/EatingDisorders/comments/do1788/request_my_gf_is_struggling_and_i_wanna_help_her/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n\nMaybe try complimenting her on things that are not her appearance, and ask her if she has any foods that she feels okay eating (‘safe foods’). You can try to encourage her to eat these. Looking into harm reduction tips can also be very beneficial, since bulimia can be damaging.\n\n\nhttps://www.reddit.com/r/EDAnonymous/comments/eutdb1/harm_reduction_tip_for_bulimics_from_my_dentist/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\n\nhttps://www.reddit.com/r/EDAnonymous/comments/9xi11j/harm_reduction_masterlist/?utm_source=share&utm_medium=ios_app&utm_name=iossmf\n\nr/EDanonymous may be a useful sub to visit, just to try and gain a better understanding of eating disorders in general",
          "created_utc": 1586556233.0
        },
        {
          "id": "fn1osyx",
          "author": "tymopa",
          "body": "From someone who has gone to intensive outpatient therapy for bulimia don't encourage or discourage foods at all to anyone, especially those with EDs. Keep food completely off the table 😉.",
          "created_utc": 1586566662.0
        }
      ]
    }
  ]
}