{
  "id": "fz1pyj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586599468.0,
  "title": "Request: 100 days purge free. I don't know what to do with myself",
  "selftext": "I’ve been bulimic since 1997,  as a 7th grader.\n\nAfter years of this, years of being unable to go three hours without vomiting, much less one full day — I managed to stop. I had to quit dating entirely, because this was a massive tigger for me, but I felt this was life or death. I stopped modeling, stopped swimming.\n\nMonday will be 100 days. The longest I’d previously gone since childhood was 33.\n\nIt’s a strange time to be in recovery: the isolation is actually helpful, because there’s no concern about what people see or think, day to day. But I’m also left completely to my devices, which has historically been bad news for the binging side of things.\n\nI think the true savior has been the fact that going to the grocery store is frowned upon. So I don’t. I have what I need, but I don’t binge because I don’t know when I’ll go shopping again.\n\nAnd now, 100 days. I don’t know what to do with myself.\n\nI’m so sorry for rambling. This was the whole point of posting: I want to have a private celebration. I don’t want to watch anything disordered or eat anything “forbidden.” I just want to .. I don’t know.\n\nSo, I’m just here to hear .. anything. An idea or something. I don’t know how to be sweet to myself but I really goddamned want to be.\n\nX.\n\nI hope you’re well.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fz1pyj/request_100_days_purge_free_i_dont_know_what_to/",
  "score": 223,
  "num_comments": 19,
  "comments": [
    {
      "id": "fn2sgkr",
      "author": "laurenthegrouch",
      "body": "you’re a fucking rockstar. \n\nwhat makes you happy? you could start there. a bubble bath? buying a new house plant? going for a long walk? cracking open a new book? \n\ni personally i would do things i hadn’t done in a while or even ever, just to really enjoy the day for what it is \n\ncongrats and keep going!",
      "created_utc": 1586601486.0,
      "score": 33,
      "context": []
    },
    {
      "id": "fn3b7mu",
      "author": "roflwaff1e",
      "body": "my highest steak is 16 days, just before this global crisis (and a bunch of other life stressors) got in the way and I had no other way to cope with the level of anxiety and stress I’ve been feeling. \n\ni know how difficult it is to tolerate not purging and bingeing. fuck yeah, friend. i’m gonna do it today too, even though it’s hard ❤️",
      "created_utc": 1586617072.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fn3237c",
      "author": "None",
      "body": "That's amazing!  You should be very proud!\n\nAlso remember that if you do relapse, it doesn't erase this accomplishment.  This 100 days started as just 1 day, so keep focusing on doing your best every day.",
      "created_utc": 1586610814.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fn2tkxi",
      "author": "covhr",
      "body": "congratulations, that is a huge achievement!",
      "created_utc": 1586602777.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fn36ulg",
      "author": "queencheryltunt",
      "body": "This is incredible! You are doing something amazing. Be proud of yourself, and good to yourself. You deserve so much happiness x",
      "created_utc": 1586614284.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fn3cjfz",
      "author": "updown27",
      "body": "Congrats!!!! What a huge milestone! So happy for you! Time for a happy dance!",
      "created_utc": 1586617890.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn3g7zw",
      "author": "seatangle",
      "body": "That’s incredible! What really hit me when I stopped B/P was the time, all the time I had to do other things I never had the motivation or energy for. It was hard at first - I didn’t know what to do with myself. A couple of hours in the evening would pass in slow motion. But then as time goes by you fall into another (healthier) routine, one that you choose and makes you feel good. It’s very freeing. I’m so glad you can experience that!",
      "created_utc": 1586620101.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn3hlpy",
      "author": "houston_veronica",
      "body": "You are an inspiration!! Keep up the amazing work! YEAH!!",
      "created_utc": 1586620900.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn3imca",
      "author": "Wen-D-Torrence",
      "body": "Bravo! Any tips? Regular mealtimes? I’m a “grazer” and do better with small quantities frequently. Would love to know your strategy to get to 100 days if you care to share.",
      "created_utc": 1586621488.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn3xm0k",
      "author": "oliviared52",
      "body": "That’s so awesome gal. Proud of you. I was also bulimic and anorexic for years. Never ever thought i would stop. Honestly thought I would rather die with my disorder than live without it. Which is wild to think about now. It’s sort of like an abusive relationship where you know it’s bad but it’s weirdly comforting.\n\nBeen binge free for 4 years and am not tempted at all to go back because it took so long for my body to realize the normal amount of food it needs. It took a while for my body to trust me to not throw up my food. And now that it does trust me I couldn’t be happier. \n\nI realized I actually really hate the feeling of being too full and just did it to feel something I guess. So now I eat whatever I want when I want just don’t stuff myself and have never loved my body more. \n\nJust sharing for stuff to look forward to I guess? Definitely take it a day at a time. Super proud of you though. Of course I have had times where I want to slip back into old habits. Then remind myself how much happier I am having a normal relationship with food.",
      "created_utc": 1586629918.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fn4jgse",
      "author": "teriyakigirl",
      "body": "Girl, you stay strong :') You've done so incredibly well for yourself goddammit, I'm tearing up. And when this is all over, keep choosing your health. You can do it.",
      "created_utc": 1586642633.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn4ty64",
      "author": "None",
      "body": "This made me tear up because I’m on my longest purge-free streak too. We’re in this together and I’m so proud of you. You’re doing all the right things and I hope your 100 days becomes a whole year and even more :) keep up the good work. You’re so inspiring right now.",
      "created_utc": 1586648908.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn4zz9p",
      "author": "iGetHighPlayRS",
      "body": "That’s awesome & I’m really proud of you!",
      "created_utc": 1586652716.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn6ot0z",
      "author": "Famous-Dust",
      "body": "So happy to hear that quarantine actually helped you break the cycle, WELL DONE!!\nIn terms of how to celebrate, what sort of things do you love doing?\nFor me fresh sheets, fresh pj's and a face mask while watching a movie is a sure way to chill out. Perhaps something like that? Or maybe journalling if you don't already, like write out positive things that you've achieved and benefits to it so you can look back should you reach a point where you need to",
      "created_utc": 1586704281.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn7xkjb",
      "author": "None",
      "body": "Give yourself a huge pat in the back because that's extremely impressive.",
      "created_utc": 1586729655.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fp85kny",
      "author": "BigLeaves9619",
      "body": "I am extremely happy for you. This is no small feat. I can still clearly remember the day I reached my 100th day. I’ll never forget it, because before then I thought recovery wasn’t possible. I fell off the wagon, and my first thought today was that I’ve had enough and I need to go read something motivational or self help related materials. This is the first group on Reddit that I saw for eating disorders and you were the first post. This gave me a lot of positivity, thank you.",
      "created_utc": 1588384092.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpf1i0x",
      "author": "sonic2cool",
      "body": "oh wow i’m so so proud of you",
      "created_utc": 1588559613.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsp43t9",
      "author": "misamay",
      "body": "this inspired me a lot ❤️ thank you for sharing i feel like there's hope",
      "created_utc": 1591145954.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fn4jtys",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586642846.0,
      "score": 4,
      "context": [
        {
          "id": "fn3xm0k",
          "author": "oliviared52",
          "body": "That’s so awesome gal. Proud of you. I was also bulimic and anorexic for years. Never ever thought i would stop. Honestly thought I would rather die with my disorder than live without it. Which is wild to think about now. It’s sort of like an abusive relationship where you know it’s bad but it’s weirdly comforting.\n\nBeen binge free for 4 years and am not tempted at all to go back because it took so long for my body to realize the normal amount of food it needs. It took a while for my body to trust me to not throw up my food. And now that it does trust me I couldn’t be happier. \n\nI realized I actually really hate the feeling of being too full and just did it to feel something I guess. So now I eat whatever I want when I want just don’t stuff myself and have never loved my body more. \n\nJust sharing for stuff to look forward to I guess? Definitely take it a day at a time. Super proud of you though. Of course I have had times where I want to slip back into old habits. Then remind myself how much happier I am having a normal relationship with food.",
          "created_utc": 1586629918.0
        }
      ]
    },
    {
      "id": "fn4mssj",
      "author": "oliviared52",
      "body": "Same! That was actually my motivation to recover. I looked back on years of notebooks of my food diaries and realized the amount of time I spent on this... I could have spent that time like writing stand up or learning the mechanics of a car or studying engineering or anything else and could have been really good at it at that point. Instead I spent my time till I got to a point I hated myself more than ever. \n\nDefinitely don’t regret it though. Made me who I am and I’m happy to be able to relate to people still going through it.",
      "created_utc": 1586644616.0,
      "score": 5,
      "context": [
        {
          "id": "fn3xm0k",
          "author": "oliviared52",
          "body": "That’s so awesome gal. Proud of you. I was also bulimic and anorexic for years. Never ever thought i would stop. Honestly thought I would rather die with my disorder than live without it. Which is wild to think about now. It’s sort of like an abusive relationship where you know it’s bad but it’s weirdly comforting.\n\nBeen binge free for 4 years and am not tempted at all to go back because it took so long for my body to realize the normal amount of food it needs. It took a while for my body to trust me to not throw up my food. And now that it does trust me I couldn’t be happier. \n\nI realized I actually really hate the feeling of being too full and just did it to feel something I guess. So now I eat whatever I want when I want just don’t stuff myself and have never loved my body more. \n\nJust sharing for stuff to look forward to I guess? Definitely take it a day at a time. Super proud of you though. Of course I have had times where I want to slip back into old habits. Then remind myself how much happier I am having a normal relationship with food.",
          "created_utc": 1586629918.0
        },
        {
          "id": "fn4jtys",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586642846.0
        }
      ]
    }
  ]
}