{
  "id": "fzu2qb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586685492.0,
  "title": "Request: My sister’s disordered eating is killing me",
  "selftext": "I’m pretty sure my sister has orthorexia, but she hasn’t been diagnosed with anything so that’s not the point. I’m in recovery from anorexia, and I’m already struggling under quarantine, let alone the fact that it’s easter (so much food), AND I somehow managed to catch covid. Everything is great(:\n\nCovid completely killed my appetite, so it’s a struggle not to just... relapse. It feels so EASY.\n\nPlus, my sister is on a very intense diet at the moment, and you can tell she’s taking out her frustrations on me by criticizing every “unhealthy” thing I eat. \n\nPart of me wants to relapse to show my sister/family how much this hurts, and also because I wanna be worse than my sister. At this point I’m running out of ideas for why i shouldn’t :/",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/fzu2qb/request_my_sisters_disordered_eating_is_killing_me/",
  "score": 90,
  "num_comments": 8,
  "comments": [
    {
      "id": "fn64p1n",
      "author": "Working-Reaction",
      "body": "that’s really wrong of your sister to criticise your eating when she knows you are a recovering anorexic... i’m so sorry you have to live with that. remember all the reasons why you started recovery in the first place, and how miserable you were in the depths of your disorder, you don’t have to prove anything to anyone, you should continue with recovery because you deserve it.",
      "created_utc": 1586687313.0,
      "score": 39,
      "context": []
    },
    {
      "id": "fn6ejab",
      "author": "MathyMama",
      "body": "Please don’t give in to this way of thinking. You matter. And relapsing is hell. Going there to prove a point would hurt you most of all. I’m so sorry you’re in such a terrible and unsupportive environment right now. I’m truly so sad for you, it is awful that the Ed is calling to you at this time. I hope you continue to eat, please don’t give the disease a toehold. You matter.",
      "created_utc": 1586697083.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fn6is5x",
      "author": "DogBreathologist",
      "body": "Your stronger than this, you got better for a reason, and you just have to remember that this crappy situation will not last forever. And I know it’s so easy to slip into old habits but in the long run you know that’s not what’s best, hell use your recovery as a way to say f you to anyone who has put you down. You do you, avoid your sister when you can, talk to your parents about what’s going on and how it’s making you feel, and find someone who can keep you accountable, wether it’s a friend or just posting updates on here, and maybe if you haven’t already find a therapist you can talk to over video chat or call a free hotline. But whatever you do please don’t go back down that hole.",
      "created_utc": 1586700370.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fn6yxo4",
      "author": "nodaybuttoday__",
      "body": "Relapsing won’t prove anything to her, especially because she herself is sick and likely will validate your behavior and make you sicker in return. Hold strong; she is not ready for recovery in the ways you are and that’s okay. Don’t judge either of your journeys, just be yourself and maintain your health for you.",
      "created_utc": 1586710067.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fn7r3t1",
      "author": "the_scientist52",
      "body": "Your sister is lashing out at you because she's miserable, and irritable, and angry.  That's what life in an ED is like, and that's not the life you want.  Does she really seem like she's happy and carefree?  Is her life what you *truly* want for yourself?  To have everything revolve around food, to obsess over every bite, to deny yourself food you enjoy?  To do all of that for nothing because you'll never be truly satisfied with your body no matter how much weight you lose?  That's her reality right now, and I hope so badly that she's able to get herself out of it too because no one deserves that.  But whether she does or doesn't, that can't affect your decision.  Your life is yours, not hers, and you get to choose what you want it to look like.  This situation right now is an important decision point.  Three years from now, do you want to look back and regret relapsing because of the misery it caused you, or do you want to look back and be grateful that you continued working toward recovery because of the freedom it granted you?\n\nAnd to be blunt, relapsing would be letting her win.  She's trying to hurt you and get a rise out of you.  Don't let her.",
      "created_utc": 1586725931.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn7umqb",
      "author": "average-roblox-user",
      "body": "Almost the exact same thing is happening at my house, so much so I asked my sister if SHE made the post! I recommend keeping your distance if possible (I know, not the best idea but for now it might be good) and talk to your parents. I’m a bit sociopathic so I’d recommend threatening a relapse to your parents if nothings done. I know it won’t likely do much but talk to your sibling and tell them about orthorexia and how it can be dangerous and how it’s affecting you. This might not help but that’s all the advice I could recommend.",
      "created_utc": 1586727972.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn809w8",
      "author": "Sourpeasalty",
      "body": "Being sicker doesn’t make you better than her, reframing from disordered habits makes you so strong! You’ve got this don’t give up on yourself just to show them. Be there for you, we are all here for you too.",
      "created_utc": 1586731226.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fn8xx16",
      "author": "mungomangotango",
      "body": "Ok, listen. If everything is as bad as it's going to be, and you say you're \"in recovery\" and not fully comfortable in being completely recovered, you're going to most likely relapse. Unfortunately, that's a reality you will most likely face. As much as that sucks, there's no beating around the bush. You've probably realized it too, and that's ok. Relapses are common, they are frustrating, and they mean NOTHING. In your recovery, you might have things happen to you that you can't control that will cause you to spiral. College, sickness, massive trigger whatever. It sucks and it happens. What does matter is what you choose to do with it. Communicate and be honest with yourself and you're team (including your family). Be easy on yourself and take it slowly.",
      "created_utc": 1586753285.0,
      "score": 2,
      "context": []
    }
  ]
}