{
  "id": "g0iuc2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586784139.0,
  "title": "Request: Mia Relapse",
  "selftext": "I’ve been dealing with bulimia for over three years now and I’m so fucking done. I’ve been almost a year, uh, healthy (?),  and I refuse to go back. \n\nBut it’s so tempting- \n\n“Just eat. Just gorge yourself and indulge in everything you’ve wanted to for so long. Just forget about those restrictions you’ve made for yourself when you were recovering. Just eat. Then purge. You know it feels good. You know the euphoria and the high you get when you purge, how good it feels. How it’s all worth it in the end. You’ll be handsome, you’ll be skinny. As of now you’re just a gay ugly bitch, so just indulge in your vices and feel good.” \n\n**NO** \n\nI’ve lived that life! I’ve been down that road! I’ve suffered through all of that, gone a month without food and kept beating myself up for it! And I still wasn’t happy! Wasn’t good enough! I’ve lied to family and friends and purposely hidden things from them! I refuse to live my life like that! \n\nBut it’s so tempting...\nI just wish it all never existed. Deseo que lo se murió. I just can’t stop it, but I refuse start it. I know that “one more snack” or “just one purge” will toss me over the edge and I don’t know if I’ll be able to stop there. I don’t want to relapse. I just- I need support, please.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g0iuc2/request_mia_relapse/",
  "score": 40,
  "num_comments": 5,
  "comments": [
    {
      "id": "fn9wftd",
      "author": "tonictorpor",
      "body": "I know your thoughts are harsh right now. They will be like that at times. But the sheer willpower you hold already is amazing! You're committed to recovery and you know it. You have a whole community to lean on here, hon. And remember that you're lovable no matter what your ed says you look like.",
      "created_utc": 1586786143.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnakbjf",
      "author": "tymopa",
      "body": "Ugh....I feel your pain. I went through that cycle starting from 15 until I was 46 and finally decided to let someone else steer the wheel because I was too powerless to break up with that insidious beast. I even went 8 years thinking I was free and clear and then Wham! I got blindsided and then was on the slippery slope to depression and alcoholism. It started interfering with my work and severely dented my bank account. Our bank account, my husband's hard working money flushed down the toilet. I was hardly bringing home a paycheck.\n\nThe shame I felt from all of the deceit was too much. I thought will power, eating right, and getting exercise was the magic combo but instead, it fed into the disease. This is a horrible disease. It tricks you into justifying everything and it's voice is so overbearing. I needed an army to fight this so I finally consulted with an ED clinic and decided to dive in to an intensive outpatient. It was recommended I go into partial hospitalization which would have given me 45 hours of therapy a week, but I opted for a downgrade which was 25 hours. It was so scary. Within a day or two I started getting a little clarity. After 3 months I felt liberated...ish. One more year of therapy 4 hours a week was essential and now I live in a place where I don't have access. I am forever grateful for having the privilege to have gotten that therapy and rely on it everyday.\n\nI wish you the best, all of you. I wish you compassion and love for yourselves because you are worth it. We all are. If you have the means just face it and get some good help. After all, we have nothing to lose but our chains.\n\nNote: I tried three therapists before landing on The Emily Program in Seattle. Those previous therapists had NO idea about EDs. One, who was helping me analyze a dream about sea life compared my body to the sea lion. He literally said, \"they're big, like you.\" Screw you therapist man....",
      "created_utc": 1586798985.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fna84eh",
      "author": "ebi_chan",
      "body": "You can start again tomorrow so dont think of this as a relapse! I know this isn’t exactly a groundbreaking discovery and many people have said it already, but one slip up does not mean all the progress you’ve made means nothing! That was my mentality for so long and its very toxic. Being too harsh on yourself will just stimulate your urge to b&p more.\n\n\nI just binged a few hours ago and was considering purging but in the end made up my mind not to. I feel so disgusting and full right now and I’M typing this whilst continuously burping which is so gross hahahahaha. Anyways know that youre not alone, we’re in this shitty situation together! Ily and youre doing GREAT SWEATY",
      "created_utc": 1586792806.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnaguf2",
      "author": "None",
      "body": "Is there something you really enjoy? Itll get your mind refocused💙",
      "created_utc": 1586797270.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnblfoj",
      "author": "rosemarylabianca",
      "body": "Is there any place to chat? I couldn’t post on this sub",
      "created_utc": 1586817626.0,
      "score": 2,
      "context": []
    }
  ]
}