{
  "id": "g0xc7x",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586832256.0,
  "title": "Request: Seeking advice on how to stop binging/restricting during lockdown",
  "selftext": "I've had an eating disorder for years now, started with anorexia and in the last few years has progressed into a major binge eating disorder/food addiction. I was slowly improving at my apartment since I kept food out of the house and only ate when I went out, which gave me some sense of normalcy. Now I'm back at home ever since the lockdown began and I've been binging almost every day, binging and restricting etc. Help me!! Please, I'm desperate and starting to lose it. Any tips and tricks you guys might have? I'm starting to feel hopeless",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g0xc7x/request_seeking_advice_on_how_to_stop/",
  "score": 53,
  "num_comments": 7,
  "comments": [
    {
      "id": "fncfckz",
      "author": "mylessandovaldpt",
      "body": "These are truly unprecedented circumstances, and they pose a special risk for people with ED history. \n\nI run a free weekly peer support group on Zoom every Wednesday night 8-10PM ET if you're looking for extra support. We talk about overcoming the obstacles along this journey. It's a good group of folks, mostly 6+ months sober with some crossover into food issues. Strong recovery. \n\nFacebook group with meeting link at: [www.facebook.com/groups/rec0veryistheway](http://www.facebook.com/groups/rec0veryistheway) where we post guided meditations, books, and journal articles about the process and science of recovering joy and meaning in sober living. \n\nThe free handbook we use can be found here, with tips on coping with the COVID obstacles on page 42: [https://docs.google.com/document/d/1vPk9JbgWrGCL4LbjAmVbVW-g2fD5DFBP\\_P-8ov2F4sY/edit?usp=sharing](https://docs.google.com/document/d/1vPk9JbgWrGCL4LbjAmVbVW-g2fD5DFBP_P-8ov2F4sY/edit?usp=sharing)\n\nHope some of this is helpful. You are definitely not alone.",
      "created_utc": 1586835388.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fnceeqf",
      "author": "Triptaker8",
      "body": "For the longest time, I have been restricting and then binging afterwards because I wasn't getting enough calories while restricting and my body was screaming at me to eat. Since I've been locked in my house, I've had the chance to reevaluate that crazy cycle. I used a tdee calculator to figure out how many calories my body actually needs so that I get enough food without inadvertently depriving myself. I'm also making sure I get enough protein, carbs, and fat for my body so I'm getting the nutrition I need. A couple of energy dense snacks during the day has done wonders for me in terms of keeping me full (ex. a bagel, celery with some peanut butter, an orange. I will have all of these between or after meals)\n\nSince I started doing this, I feel much more satiated, I don't crave fat and sugar as much, I haven't binged once, I don't feel tired or lethargic and I have all the energy to do everything I want to do. I have no idea if this will work for you but I'd thought I'd share. My situation was quite similar to yours and I can't believe how much better I feel just getting that extra amount of food during the day in a healthy way instead of cut cut cut and then starve and binge.",
      "created_utc": 1586834747.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fnd13fx",
      "author": "feedmefreshavocados",
      "body": "I had the same problem. Used to restrict a lot the past year and now during this quarantine I've been binging every other day to the point where I gained a lot more weight than I lost. A few days ago I just literally forced myself to stick to my diet (around 1500) because I know I will lose it and become very insecure if I gain any more weight. I just picture the consequences. I now limit myself to these 1500 calories a day distributed to 3 to 4 meals a day. It is enough to get me through the day. And after a while a habit started to form and it got so much easier sticking to my diet especially after I started to see results.\nSo I think it's just literally forcing yourself to control yourself (by picturing the consequences) and trying to establish a solid habit (breakfast at 8, lunch at 12, dinner at 5) by repeating the pattern over a longer period of time.",
      "created_utc": 1586854570.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnctwko",
      "author": "None",
      "body": "abby sharp put out a video on this it might help",
      "created_utc": 1586847066.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fndq2zv",
      "author": "ANGLEDHOURGLASS",
      "body": "Yea Abby sharp even responds",
      "created_utc": 1586875326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fne9vtb",
      "author": "None",
      "body": "Same. I've binged every day of the quarantine so far.",
      "created_utc": 1586885596.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnen4z7",
      "author": "hellobelloooo",
      "body": "Wow thank you, this is an interesting idea. I have eaten normally today so I will try to stick to a regular amount of food. Thank you for your input",
      "created_utc": 1586892329.0,
      "score": 2,
      "context": [
        {
          "id": "fnd13fx",
          "author": "feedmefreshavocados",
          "body": "I had the same problem. Used to restrict a lot the past year and now during this quarantine I've been binging every other day to the point where I gained a lot more weight than I lost. A few days ago I just literally forced myself to stick to my diet (around 1500) because I know I will lose it and become very insecure if I gain any more weight. I just picture the consequences. I now limit myself to these 1500 calories a day distributed to 3 to 4 meals a day. It is enough to get me through the day. And after a while a habit started to form and it got so much easier sticking to my diet especially after I started to see results.\nSo I think it's just literally forcing yourself to control yourself (by picturing the consequences) and trying to establish a solid habit (breakfast at 8, lunch at 12, dinner at 5) by repeating the pattern over a longer period of time.",
          "created_utc": 1586854570.0
        }
      ]
    }
  ]
}