{
  "id": "g15kll",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586871097.0,
  "title": "Request: I’m Slowly Killing Myself",
  "selftext": "I’ve lost control. All I do is eat. Eat the pain, the happiness, the boredom, or just eat. I’ve gainer a sugar addiction. This all has resulted in serious self harm. I’m slowly killing myself and ending my life. I wanna gain control. I wanna stop it before I become overweight and literally kill myself. I’m not good with humans. I’m just suffering.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g15kll/request_im_slowly_killing_myself/",
  "score": 58,
  "num_comments": 10,
  "comments": [
    {
      "id": "fndyvth",
      "author": "lemon_vampire",
      "body": "What has helped me was redefining what \"healthy\" food meant to me.\n\nMy biggest discovery recently was 'slow food'.  Foods that take time and in return provide more nutrients, are more satisfying, and taste better.\n\nFermented foods are some of the most sought after food throughout humanity.  Most people will say their favorite foods are chocolate, tea, coffee, cheese, sourdough, pickles, wine, soy sauce, kimchi, hot sauce, vanilla, prosciutto, dry aged steak, etc.  \n\nFor the first time in over half a decade, I have real sugar and flour in my house, things I used to be terrified of but coveted.  Not to eat, but to age.  These foods are precious because if I want them again I have to wait, which forces me to eat smaller portions.\n\nHealthy food is not restricting, it's enlightening. You have to start by cooking all your cravings.  You want pizza? Cook it.  Cake? Cook it. All from scratch, no pre packaged mixes or heat-and-serve frozen pre made pizza dough. All from single ingredient items.  Flour, sugar, eggs, baking powder, milk, butter.  Ingredients that you really can't just pull out of the bag and binge on.  I mean you could but it wouldn't be very easy.  \n\nYou can't cook?  No one was born knowing how to cook.  Your first time making something might not even come out as eatable.  My first ever batch of chocolate chip cookies ended up in the trash.  But I learned what I did wrong and the second batch was tasty!  A success after re trying a previously failed recipe always tastes a little bit better to the chef than it actually does.\n\nCook, fail, repeat, succeed, repeat, improve, repeat. \n\n&#x200B;\n\nDM me if you have any questions.",
      "created_utc": 1586880041.0,
      "score": 26,
      "context": []
    },
    {
      "id": "fndzprm",
      "author": "None",
      "body": "Hi, I'm sorry you are feeling this way. If I can offer a different perspective, maybe it might help... Usually when we are feeling out of control around food- or drawn to it like a magnet, it's because we are trying to control it too much. We are restricting foods and nutrients that our bodies need for fuel, like sugar and carbohydrates. Our bodies are hardwired to keep us alive at all costs, so we become clouded with food thoughts and obsessions. This leads to bingeing and grazing non-stop. Please consider the idea that there is no such thing as sugar or food addiction. You FEEL out of control around food because you restrict it. The more you restrict, the more your body craves it. When you give in, your brain floods your body with feel-good hormones as a reward for giving it fuel. It's a good idea to eat a variety of nourishing and nutritionally dense foods to let your body understand and trust that you won't deprive it of fuel. I promise your life, your body, your sleeping patterns, your outlook will change for the better. Please read \"The F It Diet\" by Caroline Dooner for more support with this. Give yourself grace. This is hard stuff. Best wishes.",
      "created_utc": 1586880478.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fnduhve",
      "author": "reddituserjpg",
      "body": "i wish i could offer you advice but i don’t have any. all i can say is that i have experienced something similar to what you’re going through. eating was and still is probably the most difficult task in my life at the moment. i hope you get the help you need and start feeling better soon. you deserve to live a happy life <3",
      "created_utc": 1586877729.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnecpbz",
      "author": "pleasantway",
      "body": "I can only speak for what's helped me. I have a drinking problem I'm in recovery for. I also have a food and sugar problem, I'll binge on anything. I've been seeing a therapist. Right away she found I have a strong pattern of invalidating my emotions, as well as trouble regulating my emotions which leads me to use and eat out of desperation to control them\n\nI found this site which explained invalidation and gave me the first tools to change how I saw my thinking\nhttp://eqi.org/invalid.htm\n\nI'm also looking into how to manage my feelings when it feels like too much. Talking to another actual human helps the most, one that isnt going to give me advice right back and who will listen first, as I find I carry around a lot of shame about the addiction and also my perception that I \"should\" be able to solve it alone",
      "created_utc": 1586887008.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnelko8",
      "author": "hellobelloooo",
      "body": "Hey!! I'm in the same boat. I started a discord chat with people that are going through the same binging stuff as I am.. would love for you to join. Maybe we can help each other [https://discord.gg/7yE4E8U](https://discord.gg/7yE4E8U)",
      "created_utc": 1586891536.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fne8sqh",
      "author": "None",
      "body": "I'm in the same situation.",
      "created_utc": 1586885064.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fndj0dx",
      "author": "hotlinehelpbot",
      "body": "\nIf you or someone you know is contemplating suicide, please reach out. You can find help at a National Suicide Prevention Lifeline\n\nUSA: 18002738255\nUS Crisis textline: 741741 text HOME\n\nUnited Kingdom: 116 123\n\nTrans Lifeline (877-565-8860)\n\nOthers: https://en.wikipedia.org/wiki/List_of_suicide_crisis_lines\n\nhttps://suicidepreventionlifeline.org",
      "created_utc": 1586871108.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fne90pf",
      "author": "Belly_Laugher",
      "body": "I couldn't help but respond even though I have no useful advice.  I joined this subreddit because I personally realized how scary eating disorders are.  Off the top of my head, I feel like eating fruit could assist with curbing a sugar addiction.  But the main reason I wanted to respond was to simply say feel free to DM me.  If you'd like to chat about anything, being isolated right now I welcome any human interaction.",
      "created_utc": 1586885171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnedcii",
      "author": "oliviared52",
      "body": "Something similar to this idea, the book The Dorito Effect: The Surprising New Truth about Food and Flavor, by Mark Schatzker really kicked off my recovery. I am in the science field so you think I would have understood the science of food and our bodies but for some reason this book really explained it in a great a way and motivated me to want to use food to fuel my body instead of harm it. Sorry you’re suffering. We are all here for you.",
      "created_utc": 1586887333.0,
      "score": 3,
      "context": [
        {
          "id": "fndyvth",
          "author": "lemon_vampire",
          "body": "What has helped me was redefining what \"healthy\" food meant to me.\n\nMy biggest discovery recently was 'slow food'.  Foods that take time and in return provide more nutrients, are more satisfying, and taste better.\n\nFermented foods are some of the most sought after food throughout humanity.  Most people will say their favorite foods are chocolate, tea, coffee, cheese, sourdough, pickles, wine, soy sauce, kimchi, hot sauce, vanilla, prosciutto, dry aged steak, etc.  \n\nFor the first time in over half a decade, I have real sugar and flour in my house, things I used to be terrified of but coveted.  Not to eat, but to age.  These foods are precious because if I want them again I have to wait, which forces me to eat smaller portions.\n\nHealthy food is not restricting, it's enlightening. You have to start by cooking all your cravings.  You want pizza? Cook it.  Cake? Cook it. All from scratch, no pre packaged mixes or heat-and-serve frozen pre made pizza dough. All from single ingredient items.  Flour, sugar, eggs, baking powder, milk, butter.  Ingredients that you really can't just pull out of the bag and binge on.  I mean you could but it wouldn't be very easy.  \n\nYou can't cook?  No one was born knowing how to cook.  Your first time making something might not even come out as eatable.  My first ever batch of chocolate chip cookies ended up in the trash.  But I learned what I did wrong and the second batch was tasty!  A success after re trying a previously failed recipe always tastes a little bit better to the chef than it actually does.\n\nCook, fail, repeat, succeed, repeat, improve, repeat. \n\n&#x200B;\n\nDM me if you have any questions.",
          "created_utc": 1586880041.0
        }
      ]
    },
    {
      "id": "fne3v2q",
      "author": "None",
      "body": "This is such good advice. I had to learn it for myself but cooking has helped me focus more on what I was putting in my body.",
      "created_utc": 1586882587.0,
      "score": 1,
      "context": [
        {
          "id": "fndyvth",
          "author": "lemon_vampire",
          "body": "What has helped me was redefining what \"healthy\" food meant to me.\n\nMy biggest discovery recently was 'slow food'.  Foods that take time and in return provide more nutrients, are more satisfying, and taste better.\n\nFermented foods are some of the most sought after food throughout humanity.  Most people will say their favorite foods are chocolate, tea, coffee, cheese, sourdough, pickles, wine, soy sauce, kimchi, hot sauce, vanilla, prosciutto, dry aged steak, etc.  \n\nFor the first time in over half a decade, I have real sugar and flour in my house, things I used to be terrified of but coveted.  Not to eat, but to age.  These foods are precious because if I want them again I have to wait, which forces me to eat smaller portions.\n\nHealthy food is not restricting, it's enlightening. You have to start by cooking all your cravings.  You want pizza? Cook it.  Cake? Cook it. All from scratch, no pre packaged mixes or heat-and-serve frozen pre made pizza dough. All from single ingredient items.  Flour, sugar, eggs, baking powder, milk, butter.  Ingredients that you really can't just pull out of the bag and binge on.  I mean you could but it wouldn't be very easy.  \n\nYou can't cook?  No one was born knowing how to cook.  Your first time making something might not even come out as eatable.  My first ever batch of chocolate chip cookies ended up in the trash.  But I learned what I did wrong and the second batch was tasty!  A success after re trying a previously failed recipe always tastes a little bit better to the chef than it actually does.\n\nCook, fail, repeat, succeed, repeat, improve, repeat. \n\n&#x200B;\n\nDM me if you have any questions.",
          "created_utc": 1586880041.0
        }
      ]
    }
  ]
}