{
  "id": "g1jg8x",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1586918432.0,
  "title": "Request: i found my boyfriend's pro-ed/pro-bed twitter and don't know what to do",
  "selftext": "i'm freaking out a little bit, and i'm extremely worried about him. he's told me he has bed, and i'm doing all i can to support him. i'm not upset at him for hiding stuff in the slightest, i'm just worried. \n\nhe bought a scale, laxatives, teas, caffeine pills—all without me knowing. his account is the usual twitter kpop thinspo stuff, and his gw and date is very very alarming.\n\ni don't know what to do. i don't know how to proceed. do i tell him i know about it? do i let him do his own thing? something else? i don't wanna trigger him, or make him feel like he has to hide, i just wanna be here for him",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g1jg8x/request_i_found_my_boyfriends_proedprobed_twitter/",
  "score": 41,
  "num_comments": 11,
  "comments": [
    {
      "id": "fngdfvs",
      "author": "ambxvalence",
      "body": "be supportive, be there for him to talk about his eating issues, ask general questions about it and express the fact that youre there for him and want to help him and learn - he will eventually trust you enough to open up about it himself.  \n\nconfronting him about it when he isnt ready to talk, if not with the goal of undertaking serious action because he is in a critical state, will only lead to him hiding more, possibly changing his username and/or starting a new account",
      "created_utc": 1586928898.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fng8beq",
      "author": "nodaybuttoday__",
      "body": "If you tell him you know about it, it might send him into a shame spiral and make his behaviors even worse. And then he won’t trust you because you “found him out”.\n\nI’d say just ask questions and offer support. If they are ready for recovery, they will get there and hit that bottom and seek a way up. Just show up for them and worry about your own stuff and the recovery support process for you as a partner.",
      "created_utc": 1586924824.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fngeba1",
      "author": "WaterIsMyLife2",
      "body": "Absolutely do not make him feel like he's been caught or outed, mostly just let him know you're here for him no matter what. As far as coaxing him into opening up about recent activities, you could let on to what you know without telling the whole story. What I mean by that, is you could say something like \"hey I noticed you bought laxatives so I just wanted to ask if everything is ok. I just want you to know I love and accept you no matter what, and I'm always here for you if you want to talk about it\". If/when he's ready to open up, hopefully he'll tell you about everything else. The most important part is it has to be on his terms, you can't make him feel at all pressured or threatened. An unfortunate part of eating disorders is we can find ourselves feeling protective of the disorder and can get really defensive if we feel like someone wants to hurt it. Letting him know that you're worried about him and that you just want him to be healthy might help nudge him in the right direction, but you want to be extremely careful, gentle, and wait for the right time/place. I don't think treatment/recovery can even be approached until a sufferer decides they want to recover or their health deteriorates to the point where recovery is the only option. Recovery doesn't just happen, you have to want it and fight for it. Eating disorders are tricky because they can get so deep in our heads that we stop even wanting to feel or get better. So for now just try to make him feel like it's safe to open up to you. What people suffering from eating disorders need most is just an ally, someone who makes you feel completely safe and comfortable.",
      "created_utc": 1586929616.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fng1ufs",
      "author": "updown27",
      "body": "You have to confront him about it. Obviously to be done in the most gentle and caring way possible and at a time that he isn’t actively engaging in behaviors (for example don’t wait to catch him in the act of something). If he’s putting it on the internet there is a part of him that wants to get caught. And you don’t really have any other option if you care about his safety. The discussion of treatment needs to take place. It’s not going to go away by itself.",
      "created_utc": 1586920358.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fnhcagx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1586959633.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fnhdzp7",
      "author": "houston_veronica",
      "body": "I think the thing to keep in mind is, if a person gets to an extremely low weight due to anorexia nervosa, there is NO WAY they will ever \"decide\" to get help, because the fact that your mind believes there's nothing wrong is a \\*key hallmark\\* of the disorder. \n\nFor now, if he is at a normal weight, I think it is best that you support him as others have said below - and save a confrontation for a real intervention if and when the need arises (he gets to a severely low weight - it is unmistakable to see this when it happens, you will know - which I pray is not ever the case).   \n\nConsider getting support for just you alone - this is NOT your fault nor is it your responsibility to fix him.  Just like if he were an alcoholic, you cannot change him - but you can make yourself that soft place for him to land and be supported. (not enabled, but supported.) Hugs - hang in there.",
      "created_utc": 1586960582.0,
      "score": -1,
      "context": []
    },
    {
      "id": "fnipfqk",
      "author": "whatshouldidoidk_",
      "body": "thank you tons for this reply, it was really helpful. i always let him know that he's 100% safe and he can be open with me, i've never judged him for the things he does. i'll always continue to do that. i didn't let him know i know about the account, but i did say i noticed the scale and asked if he was alright. he's talking about tossing it now\n\nwhat made it more worrisome is that he does this thing called \"meanspo\" and \"sweetspo\". basically, its sending insulting and triggering messages to another person with an ed to encourage starving and keeping a low caloric intake. he gives and receives. is this something i should bring up with him?",
      "created_utc": 1586984037.0,
      "score": 1,
      "context": [
        {
          "id": "fngeba1",
          "author": "WaterIsMyLife2",
          "body": "Absolutely do not make him feel like he's been caught or outed, mostly just let him know you're here for him no matter what. As far as coaxing him into opening up about recent activities, you could let on to what you know without telling the whole story. What I mean by that, is you could say something like \"hey I noticed you bought laxatives so I just wanted to ask if everything is ok. I just want you to know I love and accept you no matter what, and I'm always here for you if you want to talk about it\". If/when he's ready to open up, hopefully he'll tell you about everything else. The most important part is it has to be on his terms, you can't make him feel at all pressured or threatened. An unfortunate part of eating disorders is we can find ourselves feeling protective of the disorder and can get really defensive if we feel like someone wants to hurt it. Letting him know that you're worried about him and that you just want him to be healthy might help nudge him in the right direction, but you want to be extremely careful, gentle, and wait for the right time/place. I don't think treatment/recovery can even be approached until a sufferer decides they want to recover or their health deteriorates to the point where recovery is the only option. Recovery doesn't just happen, you have to want it and fight for it. Eating disorders are tricky because they can get so deep in our heads that we stop even wanting to feel or get better. So for now just try to make him feel like it's safe to open up to you. What people suffering from eating disorders need most is just an ally, someone who makes you feel completely safe and comfortable.",
          "created_utc": 1586929616.0
        }
      ]
    },
    {
      "id": "fng4hj5",
      "author": "emptybutcoping",
      "body": "i agree with everything except 'if its online there is a part of him that wants to get caught'. i share my eating disorder and i would be mortified if somekne i knew in real life found out. it is a way of venting and sharing",
      "created_utc": 1586922114.0,
      "score": 7,
      "context": [
        {
          "id": "fng1ufs",
          "author": "updown27",
          "body": "You have to confront him about it. Obviously to be done in the most gentle and caring way possible and at a time that he isn’t actively engaging in behaviors (for example don’t wait to catch him in the act of something). If he’s putting it on the internet there is a part of him that wants to get caught. And you don’t really have any other option if you care about his safety. The discussion of treatment needs to take place. It’s not going to go away by itself.",
          "created_utc": 1586920358.0
        }
      ]
    },
    {
      "id": "fng8mgv",
      "author": "nodaybuttoday__",
      "body": "This is going to make it far worse. Trust me.",
      "created_utc": 1586925059.0,
      "score": 2,
      "context": [
        {
          "id": "fng1ufs",
          "author": "updown27",
          "body": "You have to confront him about it. Obviously to be done in the most gentle and caring way possible and at a time that he isn’t actively engaging in behaviors (for example don’t wait to catch him in the act of something). If he’s putting it on the internet there is a part of him that wants to get caught. And you don’t really have any other option if you care about his safety. The discussion of treatment needs to take place. It’s not going to go away by itself.",
          "created_utc": 1586920358.0
        }
      ]
    },
    {
      "id": "fniomrj",
      "author": "whatshouldidoidk_",
      "body": "nah, that's not a stupid question. \"gw\" on ed-twitter stands for \"goal weight\". his goal is to lose a lot of weight in a very short amount of time",
      "created_utc": 1586983630.0,
      "score": 2,
      "context": [
        {
          "id": "fnhcagx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1586959633.0
        }
      ]
    },
    {
      "id": "fnhm3ib",
      "author": "updown27",
      "body": "This is just sickeningly false. People with eating disorders of any kind can absolutely decide to get help.",
      "created_utc": 1586964894.0,
      "score": 3,
      "context": [
        {
          "id": "fnhdzp7",
          "author": "houston_veronica",
          "body": "I think the thing to keep in mind is, if a person gets to an extremely low weight due to anorexia nervosa, there is NO WAY they will ever \"decide\" to get help, because the fact that your mind believes there's nothing wrong is a \\*key hallmark\\* of the disorder. \n\nFor now, if he is at a normal weight, I think it is best that you support him as others have said below - and save a confrontation for a real intervention if and when the need arises (he gets to a severely low weight - it is unmistakable to see this when it happens, you will know - which I pray is not ever the case).   \n\nConsider getting support for just you alone - this is NOT your fault nor is it your responsibility to fix him.  Just like if he were an alcoholic, you cannot change him - but you can make yourself that soft place for him to land and be supported. (not enabled, but supported.) Hugs - hang in there.",
          "created_utc": 1586960582.0
        }
      ]
    },
    {
      "id": "fnllgpg",
      "author": "WaterIsMyLife2",
      "body": "No problem, I was just thinking of advise I'd want someone to give my boyfriend if he made a post on here. \n\nMeanspo and sweetso are pretty common and normal in ed communities. Sure it's messed up, but to him I doubt it even registers in his mind as something that might not be ok. Eds really mess up your brain, you end up basically doing mental gymnastics to justify your actions and convince yourself that what you're doing is alright. With sharing tips, thinspo, meanspo, Etc. I used to find me convincing myself that it was about personal freedom and that if someone wanted it, who was I to say no? I told myself that they were going to do what they were going to do either way and find what they needed somewhere else if I didn't supply/share it, so why not? The truth is, sharing that kind of stuff in enabling and helping someone hurt themself like buying rum chocolates for an unrecovered alcoholic. I'm just explaining this to help you get a better idea of what he's doing and why. I hope it helps. \n\nI wouldn't bring it up, as he likely doesn't currently see a problem with it and might actually lash out to defend his actions. When you're doing something you know is wrong but don't want to accept and/or admit it, having someone call you out on it just makes you feel 10× worse. Also bringing it up would involve letting him know you found his account, which you're going to have to be careful with and be sure he's ready to be confronted about it. \n\nHim getting rid of the scale might just be something he said/did just so you won't worry, especially if he's still actively using his ed account. If that's the case, don't take it personally. He's not trying to lie to you or decieve you, he's probably just scared. When we're secretive about our eds, it isn't just about protecting the ed. Sometimes we feel like we're protecting our loved ones from the truth, shielding them from the painful knowledge of what's really going on. We don't want to stop suffering, and we don't want to make our loved ones watch us willingfully suffer. Sometimes we think that as long as we're only really hurting ourselves, it's somehow ok. If he's currently pretty deep down the rabbit hole, further confrontation might just lead to him pretending to quit only to continue in deeper secrecy. Removing things from his phone, hiding things where they're harder to spot, deleting accounts just to make ones that you won't be able to see/reach, stashing laxatives where you'd never think to look, Etc. I'm not saying that will happen, just know it's a possibility and not to take it at all personally. It's not about lying to you, it's about contrived ideas of person freedom and protecting you from the truth. \n\nEds aren't demons that hang over our heads and control us like puppets, they're deeply weaved into our minds and personalities. They're a deeply ingrained part of our psychys. We can fight them, but we can just as easily find ourselves giving into them and fueling them, because in certain ways they feel like a valid part of who we are.",
      "created_utc": 1587055561.0,
      "score": 1,
      "context": [
        {
          "id": "fngeba1",
          "author": "WaterIsMyLife2",
          "body": "Absolutely do not make him feel like he's been caught or outed, mostly just let him know you're here for him no matter what. As far as coaxing him into opening up about recent activities, you could let on to what you know without telling the whole story. What I mean by that, is you could say something like \"hey I noticed you bought laxatives so I just wanted to ask if everything is ok. I just want you to know I love and accept you no matter what, and I'm always here for you if you want to talk about it\". If/when he's ready to open up, hopefully he'll tell you about everything else. The most important part is it has to be on his terms, you can't make him feel at all pressured or threatened. An unfortunate part of eating disorders is we can find ourselves feeling protective of the disorder and can get really defensive if we feel like someone wants to hurt it. Letting him know that you're worried about him and that you just want him to be healthy might help nudge him in the right direction, but you want to be extremely careful, gentle, and wait for the right time/place. I don't think treatment/recovery can even be approached until a sufferer decides they want to recover or their health deteriorates to the point where recovery is the only option. Recovery doesn't just happen, you have to want it and fight for it. Eating disorders are tricky because they can get so deep in our heads that we stop even wanting to feel or get better. So for now just try to make him feel like it's safe to open up to you. What people suffering from eating disorders need most is just an ally, someone who makes you feel completely safe and comfortable.",
          "created_utc": 1586929616.0
        },
        {
          "id": "fnipfqk",
          "author": "whatshouldidoidk_",
          "body": "thank you tons for this reply, it was really helpful. i always let him know that he's 100% safe and he can be open with me, i've never judged him for the things he does. i'll always continue to do that. i didn't let him know i know about the account, but i did say i noticed the scale and asked if he was alright. he's talking about tossing it now\n\nwhat made it more worrisome is that he does this thing called \"meanspo\" and \"sweetspo\". basically, its sending insulting and triggering messages to another person with an ed to encourage starving and keeping a low caloric intake. he gives and receives. is this something i should bring up with him?",
          "created_utc": 1586984037.0
        }
      ]
    }
  ]
}