{
  "id": "g2pyz5",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587078508.0,
  "title": "Request: scared of dentist",
  "selftext": "I haven’t gone to the dentist in a few years now. Probably like 3. But since my last visit, my bulimia definitely worsened and I can definitely feel the affects it’s doing on my teeth. I feel like the back of my teeth have holes. I can see cavities. I’m in pain a lot too. I’m horrified of what I’ve done to myself because of my ED and i’m even more scared about going to the dentist. What will they say? I’m only 21 and on my parents health insurance so what will i tell them if I need a lot of work done to my teeth? I’m so so scared",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g2pyz5/request_scared_of_dentist/",
  "score": 48,
  "num_comments": 12,
  "comments": [
    {
      "id": "fnmwl7q",
      "author": "None",
      "body": "Please don't be scared of getting help. Take advantage of the fact that you have health insurance and get the help that you need. I wish the best for you. You can beat your bulimia.",
      "created_utc": 1587079566.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fnmx6gl",
      "author": "nobodyinparticul4r",
      "body": "Go to the dentist! There is NOTHING to be ashamed of, love! You deserve to not be in pain. You deserve to have functional teeth. Goooo to the dentist!!!",
      "created_utc": 1587079901.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fnmyhi4",
      "author": "maryjean0524",
      "body": "The last time I went to the dentist, they were very professional, no judgment. I would say most of my experience with dentists has been they are so sweet and nice. I would definitely go and get it checked out!  We are here to support you!",
      "created_utc": 1587080653.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fnn6bf6",
      "author": "dmmge",
      "body": "My dentist was very nice about it, they didn’t ask questions or bring up EDs at all. It was just kind of like “ok this is the current state of your teeth” not anything about how they got there. Then we talked about a plan to get my teeth healthy again.\n\nI had the same fears, but don’t worry. They see this more often than you think.",
      "created_utc": 1587085354.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fnn1dtv",
      "author": "coldlick",
      "body": "A dentist will be able to help you with your teeth before it gets too bad. If a tooth has a hole in it there's always the possibility of infection and that can lead to tooth loss. Don't be scared to go, they won't lecture you about and you don't have to explain yourself. I'm sure dentists know how to handle it",
      "created_utc": 1587082352.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fnn8rex",
      "author": "aLoftufi1Df",
      "body": "I'm 33 and finally went to see a dentist after a decade of not going. I've been struggling with ED pretty much constantly since adolescence. I received zero judgement or ridicule, and was treated like any normal patient. A professional will always be professional. Take care of your teeth now while you still can.",
      "created_utc": 1587086896.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnnec7b",
      "author": "fencedinside",
      "body": "I was afraid of going to the dentist, too. When I finally went to the dentist, they were nothing but professional and talked about treating my dental problems.\n\nI chose to bring up my history of ED myself, thinking it might help in planning my dental treatment. I was really nervous and shaky the whole time, but the staff were super sweet, non-judgmental, and calmed me down by explaining everything they were doing this session and going forth.\n\nAs for the health insurance? When you put off the visit, it's going be way more expensive and possibly complicated if you wait. No better time than NOW to care for yourself. Good luck!",
      "created_utc": 1587090413.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnnori4",
      "author": "denababy",
      "body": "My mother is a dental assistant and my father in law is a dentist - they have seen it all and your case will not be the worst thing they have seen. They won’t judge you, they will just tell you what needs to be done to remedy the situation. They want you to feel better and be out of pain! Take care, it will be okay.",
      "created_utc": 1587097536.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnnh3qd",
      "author": "rottenvomit",
      "body": "i’ve gone three times since developing bulimia and all they say is that they think i grind my teeth. they haven’t told my parents. they won’t say anything",
      "created_utc": 1587092232.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnny36v",
      "author": "Booboogetbigger",
      "body": "It only gets worse if you don’t go to the dentist.  Just go.  They have seen it all and dont care.  They just wondering what they want for dinner and who is going to be kicked off “Survivor”.   \n\nGo to the dentist.  This disease requires maintenance.",
      "created_utc": 1587105378.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fno2uhi",
      "author": "imgoodwithfaces",
      "body": "Definitely go. While it is hard to talk about, the longer you wait, the more work will need to be done. I was terrified of the dentist too because of my bulimia, but since I started going last year they have been great, rarely mentioning the cause, and focusing on the work that needed to be done.",
      "created_utc": 1587110033.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnpph6v",
      "author": "Whatthedarknessdoes",
      "body": "You really need to go! It will be okay. If your parents ask just tell them you have bad teeth...some people just do...but of course you could always tell your parents the truth. Maybe they can support you?",
      "created_utc": 1587149612.0,
      "score": 1,
      "context": []
    }
  ]
}