{
  "id": "g2z40o",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587117782.0,
  "title": "Request: Embarrassed to say I’m hungry or need breakfast.",
  "selftext": "Please post?\n\nI’m hungry when I wake up. I can’t start the work day without breakfast or else I can’t concentrate and feel dizzy or lightheaded and distracted by hunger. I’m not one of those people who can just have a coffee and be fine until lunch. \n\nMy boyfriend, who I live with, is the opposite. He can just have some coffee, lie in bed and look at his phone, and not need food for hours. If he does have something it’ll be like a handful of nuts or a protein bar while I cook a whole breakfast with eggs and stuff. He’s over a foot taller than me and never worries about gaining weight no matter how much he eats so already it’s hard to not compare myself to him. \n\nI feel so embarrassed when I wake up in the morning feeling hungry and wanting breakfast. I can’t bring myself to say “I’m hungry” and I feel like if I make breakfast I have to hide it. I feel ashamed that I need food when I wake up but someone so much bigger than me doesn’t. Sometimes I’ll make myself wait several hours until he’s hungry and wants to eat with me. If he wants to go to the store or something first I’ll go with him, feeling lightheaded the whole time. \n\nCan anyone relate? I hate this.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g2z40o/request_embarrassed_to_say_im_hungry_or_need/",
  "score": 151,
  "num_comments": 29,
  "comments": [
    {
      "id": "fnoc8m0",
      "author": "Refinnej-",
      "body": "Hi, are you me? Because this is exactly what I’m going through. I HATE eating without my bf, I feel so embarrassed if it’s only me eating. But I wake up starving and he doesn’t eat until lunch generally. I’m used to eating lots of small meals throughout the day whereas he’s used to eating one big meal which I can’t do",
      "created_utc": 1587120142.0,
      "score": 34,
      "context": []
    },
    {
      "id": "fnok8pv",
      "author": "Sourpeasalty",
      "body": "Your boyfriend doesn’t have an eating disorder I’m assuming. He’s not looking at you eating through the same lens as you may think he is. He’s not thinking “omg she’s so fat for eating in the morning.” He’s probably thinking nothing about it; and if he’s isn’t thinking nothing about it he should be because there’s nothing wrong with it. Your body is telling you when it needs food, that doesn’t make you a bad or weak person. Your body is saying “hey I need food right now.” If a baby or child told you they were hungry in the morning you wouldn’t judge them; don’t be so hard on yourself. Everyone is different, wanting to eat in the morning depends on your body. Your body is always trying it’s best for you and all it’s asking is for you to give it what it needs and it lets you know when it needs it. I 100% understand where you’re coming from, I hate eating when other people aren’t, but it’s just your ED trying to keep hold of you. It is 100000% okay to eat when someone else isn’t. Don’t think of it as a weakness, think of it as you taking care and listening to what your body needs. In the morning your body is telling you that you need food.\n\nEdit: I just wanted to fix some punctuation.",
      "created_utc": 1587127377.0,
      "score": 35,
      "context": []
    },
    {
      "id": "fnozx39",
      "author": "None",
      "body": "I never admit that I’m hungry. If I say anything, it’s “my stomach hurts.” I’m guilty about my body’s signals, because we’re in total control of our body’s right? Wrong. People have different metabolisms, eating patterns, etc. When your body is sending signals to eat, listen and act. Your boyfriend probably has these body cues too! Just at a different time. When you get hungry, he might not be, and when he’s hungry, you may not be. Listen to your body not comparing yourself to someone who is the opposite. Early birds and night owls are analogous to eating breakfast or skipping it. Just depends on the person.\n\nFor me, I’m like you. “My stomach hurts” in the morning so I make myself eat and it helps. I usually go for a walk after, which also helps with the guilt.\n\nIn no means am I a medical professional, these are just thoughts I have regarding your concern.",
      "created_utc": 1587136758.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fnq8dlk",
      "author": "bonnieandclydebunnys",
      "body": "I honestly read this and started crying because I have felt the same way for so long but never had like the words to like actually say it I guess? But.....I can relate to say the least 😭😭 good to know I'm not alone at least 😔😔",
      "created_utc": 1587159650.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fnoleka",
      "author": "maryjean0524",
      "body": "I think everybody is different regarding this. For me, it was influenced by how I grew up. My mom used to just give me like a couple crackers or a protein bar growing up in the morning until we had a bigger meal later in the day so I feel like that is just what I was used to. When I moved in with my husband, when he woke up he liked to eat a big breakfast right away so I started cooking a big breakfast for him. All different people who I've woken up with kind of do this differently. But I know this for certain, in the same way you don't judge your boyfriend for eating just a protein bar he won't judge you for eating breakfast!!! Eat when you're hungry if that is what you need. Listen to your body!!",
      "created_utc": 1587128228.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnp9ej2",
      "author": "houston_veronica",
      "body": "I am going to tell you right now: hunger is a key feeling that your body gives you in order to survive. It's not normal to feel light-headed, and it definitely is not something to feel awkward about..especially around your SO.  I'm not sure why EDs manifest this way, but I completely understand why you feel this way. I even felt this way with my own mom, and she would love seeing me eat more and more.\n\nYour mind isn't in a rational place, because it is hungry.\n\nThings that we don't even realize are happening within our mind ARE happening when you are under-nourished.  If you don't believe me, please check out this Link: [https://www.apa.org/monitor/2013/10/hunger](https://www.apa.org/monitor/2013/10/hunger)\n\nDon't even worry about WHY he is not hungry - who cares? it has nothing to do with you or your level of hunger. Keep repeating this in your mind, write it down, put it on a sticky, write it on your hand.  If he says \"wow, are you hungry? hmm.\" -- just say \"yes, and I'm going to eat because my body needs food.\".  Do not listen to that embarrassed voice - it's there, I realize it, but it's not real and it's NOT accurate.",
      "created_utc": 1587141538.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnpqe1x",
      "author": "KingCorvid",
      "body": "I'm the same way. I just don't function at my best when I haven't had breakfast. Even if I'm not outright dizzy I'll still be sluggish.\n\nI know lots of people who never eat breakfast and I've noticed no correlation between when they eat their first meal and their weight  No need to be ashamed.",
      "created_utc": 1587150081.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnooa88",
      "author": "reney11poe",
      "body": "I understand this completely, it is quite interesting when it is me (a lesbian) comparing myself to my gf that’s always a fun one 🤡🤡",
      "created_utc": 1587130161.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fnor00e",
      "author": "stopitma",
      "body": "I get really hungry right when I wake up, too. Some people don't. Both are normal and okay. All bodies are different and have different ways of metabolizing energy. I know the way my body is most happy is when I have small meals and snacks all throughout the day (I eat like five times a day usually).\n\nDo you ever notice times when your boyfriend is hungry, and you're not? It probably happens sometimes because he's a different person with different hunger cues.\n\nI agree with other posters that you shouldn't feel guilty, but I understand feeling that way because I've also had an ED and it can make you feel guilty about completely natural things. Instead of going to the store and being lightheaded, what if you compromised by taking a snack to go or having a glass of milk before you go? That way you wouldn't necessarily have to bring it up that you're hungry, but you can also be kind to your body and get some fuel. Then you could work from there as you feel more comfortable about it.",
      "created_utc": 1587131844.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnp0jj1",
      "author": "Wen-D-Torrence",
      "body": "We are all SOOO different! Like different cars/vehicles that run on different fuel. You wouldn't expect a tractor to run on the same fuel as a motorboat, right?...and if it tried, same kind/same amount, neither would run right. I, too, wake up hungry and have to eat within an hour (ok...30 min) of being up. So what! We're awesome.",
      "created_utc": 1587137082.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnp4171",
      "author": "bathtubsarentreal",
      "body": "Can you help yourself find a loophole maybe, like think about refueling more than eating? Make a smoothie so you feel like you're just drinking something too while also giving yourself proper nutrients?",
      "created_utc": 1587138831.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnp4jkd",
      "author": "nourished-soul",
      "body": "I wake up hungry every morning! It's totally normal it's how your body functions, it's telling you it needs fuel and that's okay! Every single person is different, every single body is different; we all have different needs and that can even fluctuate day to day. It's important to honor your body and serve it in the ways that it needs, aka eating breakfast when you need to. Just because your boyfriend isn't hungry that doesn't mean you're in the wrong for needing breakfast.",
      "created_utc": 1587139086.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnpgtz7",
      "author": "makeupyourworld",
      "body": "I totally get this! I think you should try and talk to your boyfriend about this. I totally understand that he isnt hungry but maybe he can sit with you and support you during your breakfast. I always eat my first meal pretty early where as my mom tends to be nauseous in the morning and needs to wait a bit, but I know I wouldn’t feel well if I did that! 💕",
      "created_utc": 1587145263.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnr1srz",
      "author": "holland1999",
      "body": "yep i’m in the exact same boat wow. like exactly.",
      "created_utc": 1587177250.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fnoi819",
      "author": "how2dresswell",
      "body": "stop comparing!  males and females are very different. it isn't unusual for males to be able to fast until lunchtime, while females start to get symptoms of hunger a lot earlier/quicker. listen to YOUR body, it's telling you something!",
      "created_utc": 1587125801.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fnon6zx",
      "author": "bitesizeolly",
      "body": "I felt this so hard. When I spend the night at his, he has like a light breakfast but I can’t bring myself to prepare food in someone else’s kitchen. For other meals like lunch or dinner he will actually cook rather than like toast for breakfast, so he just cooks for both of us, but grrrr it’s hard.",
      "created_utc": 1587129463.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnyuxsa",
      "author": "nervous-pangolin",
      "body": "you should make breakfast your thing, your alone time in the morning to focus on your thoughts. so many people eat breakfast. why? because the world loves breakfast. your bf is the strange one, the breakfast hater, destroyer of breakfast pride. you could become the ruler of breakfast, make crepes, make omelettes, keep it chill with cereal and fruit. breakfast is a great way to wake up, your mornings are hindered by your dismissal of the joy of breakfast, think of all the cool thinking you could do in the morning if you fed your brain breakfast, the odyssey was written over breakfast (probably). you are simply a breakfast person, and breakfast people are the best. i've discovered i'm a 2am bagel person... it is much cooler to be a breakfast person than a 2am bagel person. (and if you're also a 2am bagel person then don't worry, The Republic was written over a 2am bagel)",
      "created_utc": 1587376624.0,
      "score": 1,
      "context": []
    },
    {
      "id": "foepcbd",
      "author": "thusthrow",
      "body": "My boyfriend is somewhat like this too, he does like to actually eat breakfast but can go hours before he does. I don't feel like my body even starts until I at least have a piece of toast with some coffee. \n\nMaybe, while you're preparing breakfast for yourself you can offer him something small? Or ask him if you can make his coffee? And you can bring him his coffee with a little piece of fruit , and you eat your normal breakfast. If that's the way you guys do breakfast, that is absolutely fine. I'm assuming he wants you to be comfortable anyways, and if eating will make you more comfortable and energetic he would want you to do that.  You needing a decent meal to start your day is just as acceptable and normal as having only a cup of coffee.\n\nLike, are you a morning showering person or a nighttime ? Why should you be embarrassed about either of those options? You got to get clean, and look good, and have fun doing it! Do what works best for you and makes you comfortable.",
      "created_utc": 1587710300.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzpi11o",
      "author": "None",
      "body": "this",
      "created_utc": 1596094449.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnoqxqz",
      "author": "None",
      "body": "I understand. I feel this way in the morning and I’m a person who struggles with actual eating so I’m in a hunger state a lot. The hardest is in the morning and it almost makes me angry. I understand having a hard time talking about it. \n\nCould you try some fruit in the morning?Small and easy, just something to put in your tummy to get you a little further. A couple of bites a yogurt can really help me. Maybe drink some good orange or apple juice.? You could be getting faint from low blood sugar. Any boost or any small amount of food is better than nothing. You’re not alone in this.",
      "created_utc": 1587131807.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnost6h",
      "author": "brattywhittles",
      "body": "Personally, the thought of food when I wake up is repulsive. Your bf probably has similar feelings and it just takes him longer to get hungry in the morning. It's just a physiological difference that I think a lot of people experience. I'm sure he doesn't think twice about it. If you can bring yourself to talk to him about it, getting it off your chest with him might alleviate some of your embarrassment. Good luck :)",
      "created_utc": 1587132901.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fnpiv16",
      "author": "mlkgppy",
      "body": "The same happened with me and my ex, but I kept in mind that he loved me and he definitely wasn't paying attention to my breakfast. If anything, id make a portion for him and a smaller one for myself, even if he rejected it, I'd still feel like I was eating under control",
      "created_utc": 1587146267.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fnoxh9f",
      "author": "updown27",
      "body": "It is best to eat breakfast for everyone. Your partner is doing himself a disservice to skip breakfast every morning. Of course he doesn’t have to worry about gaining weight when he skips a whole meal every day.",
      "created_utc": 1587135450.0,
      "score": -5,
      "context": []
    },
    {
      "id": "hueqci0",
      "author": "GummieSteve",
      "body": "I can definitely relate. I'm really hungry right now, but don't want to eat because my partner makes a joke or comment about my eating habits every time a put food in my mouth. He's not try to shame me, but I just wish he'd ignore me and let me eat in peace. \n\nWhy?\n\nWell, we used to work together, and before we got into a relationship, we only saw each others in the lunch room before and after work (we are crane operators).\nI am average height, get called skinny a lot, but I eat like an animal when I'm hungry.\nEvery morning I'd get to work around 5am and cook myself a full cooked breakfast; eggs, bacon/tuna on toast. I'd sit there and eat at the back of the room, but this didn't stop every one of my male colleges (I was the only female operator) commenting on my breakfast eating habits.\nOnce we were together, he admitted that he would watch me eat my meals in horrified astonishment like the rest of the guys. I was never trying to be elegant, but he confirmed that it was... unattractive.\n\nI dont understand how the rest of them, including my partner, run on nothing but a coffee until lunch or dinner. I'm starting to feel dizzy and hangry again within a couple of hours of my big breakfast.\n\nI got so tired of being harassed and shamed I'd try to get to work even earlier to make breakfast, but eventually I gave up and just took food with me to eat on the way to the job. \n\nPeople think its OK to comment, especially if you don't appear to have a problem in their eyes. Because I'm currently a \"healthy weight\", apparently it's fair game to shame me for eating \"like a man\". \n\nI actually used to be bulimic as a late teen, I have serious concerns about any weight I put on... thanks Mum.\n\nIt's been over 10 years since I purged for the reason of shame and body image, but I'm still extremely emotionally sensitive about my body and people's opinion of it and what I eat.\n\nIt's not abnormal for me to eat two steak and cheese pies in a sitting, three on occasion, and I used to laugh about the shit my partner would give me. \nBut today, I'm emotionally spent in all other areas, food hasn't come close to my lips in over 12hrs because of other issues. But now I'm really really hungry, and there are two pies just waiting meters away from me.\n\nYet somehow, the chance that my boyfriend makes a comment is so high, and I feel so fragile, I just can't risk eating the pie. Somehow writing this seems a lot easier than facing my fear and just eating the bloody pie.\n\nIn summary, your body works in its own way, you can't compare yourself to one male, one female or all of them combined. \n\nI'm pretty sure my brain chemistry is a major player in keeping my weight down and my appetite high. I'm a major overthinker and that brain in your head is the most energetically expensive organ you own. \nIf im too stressed I can't eat, but once it drops to a manageable level, the hungry beast awakens and needs feeding ASAP. \nAlso, a physical job makes a big difference, I tend to fuel up then run at full revs until my body screams at me to stop and eat or ill fall over. Unlike so many of my colleagues, I also need constant refueling to avoid the nausea, crash and burn.\nBest thing I can do is listen to my body... still got plenty of work to do in that area, but it beats any dietary rules I've heard from any other source.\n\nYou do you, good luck.",
      "created_utc": 1643265737.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fnp9aim",
      "author": "HotMathStar",
      "body": "This.  So, so much this.\n\nI think once you break the ice and just make yourself something to eat (don't hide it!), you'll see that he will barely notice.  Even if he does notice, I can promise you that it won't be judgmental.  People with a healthy relationship with food just don't think about it in the same terms as we do.\n\nTake care of yourself, OP.  Feed yourself so that you can be the strong and phenomenal person you are!",
      "created_utc": 1587141481.0,
      "score": 6,
      "context": [
        {
          "id": "fnok8pv",
          "author": "Sourpeasalty",
          "body": "Your boyfriend doesn’t have an eating disorder I’m assuming. He’s not looking at you eating through the same lens as you may think he is. He’s not thinking “omg she’s so fat for eating in the morning.” He’s probably thinking nothing about it; and if he’s isn’t thinking nothing about it he should be because there’s nothing wrong with it. Your body is telling you when it needs food, that doesn’t make you a bad or weak person. Your body is saying “hey I need food right now.” If a baby or child told you they were hungry in the morning you wouldn’t judge them; don’t be so hard on yourself. Everyone is different, wanting to eat in the morning depends on your body. Your body is always trying it’s best for you and all it’s asking is for you to give it what it needs and it lets you know when it needs it. I 100% understand where you’re coming from, I hate eating when other people aren’t, but it’s just your ED trying to keep hold of you. It is 100000% okay to eat when someone else isn’t. Don’t think of it as a weakness, think of it as you taking care and listening to what your body needs. In the morning your body is telling you that you need food.\n\nEdit: I just wanted to fix some punctuation.",
          "created_utc": 1587127377.0
        }
      ]
    },
    {
      "id": "fnp9hy5",
      "author": "houston_veronica",
      "body": ">it’s just your ED trying to keep hold of you.\n\nthis!!!! \\^\\^",
      "created_utc": 1587141584.0,
      "score": 4,
      "context": [
        {
          "id": "fnok8pv",
          "author": "Sourpeasalty",
          "body": "Your boyfriend doesn’t have an eating disorder I’m assuming. He’s not looking at you eating through the same lens as you may think he is. He’s not thinking “omg she’s so fat for eating in the morning.” He’s probably thinking nothing about it; and if he’s isn’t thinking nothing about it he should be because there’s nothing wrong with it. Your body is telling you when it needs food, that doesn’t make you a bad or weak person. Your body is saying “hey I need food right now.” If a baby or child told you they were hungry in the morning you wouldn’t judge them; don’t be so hard on yourself. Everyone is different, wanting to eat in the morning depends on your body. Your body is always trying it’s best for you and all it’s asking is for you to give it what it needs and it lets you know when it needs it. I 100% understand where you’re coming from, I hate eating when other people aren’t, but it’s just your ED trying to keep hold of you. It is 100000% okay to eat when someone else isn’t. Don’t think of it as a weakness, think of it as you taking care and listening to what your body needs. In the morning your body is telling you that you need food.\n\nEdit: I just wanted to fix some punctuation.",
          "created_utc": 1587127377.0
        }
      ]
    },
    {
      "id": "fnpgn9m",
      "author": "makeupyourworld",
      "body": "not a helpful comment to OP.",
      "created_utc": 1587145170.0,
      "score": 2,
      "context": [
        {
          "id": "fnoxh9f",
          "author": "updown27",
          "body": "It is best to eat breakfast for everyone. Your partner is doing himself a disservice to skip breakfast every morning. Of course he doesn’t have to worry about gaining weight when he skips a whole meal every day.",
          "created_utc": 1587135450.0
        }
      ]
    },
    {
      "id": "fnpwirh",
      "author": "updown27",
      "body": "I don’t understand why it’s considered not helpful. Why should she base her meal choices off someone who not eating?",
      "created_utc": 1587153285.0,
      "score": 0,
      "context": [
        {
          "id": "fnoxh9f",
          "author": "updown27",
          "body": "It is best to eat breakfast for everyone. Your partner is doing himself a disservice to skip breakfast every morning. Of course he doesn’t have to worry about gaining weight when he skips a whole meal every day.",
          "created_utc": 1587135450.0
        },
        {
          "id": "fnpgn9m",
          "author": "makeupyourworld",
          "body": "not a helpful comment to OP.",
          "created_utc": 1587145170.0
        }
      ]
    },
    {
      "id": "fnr1uic",
      "author": "makeupyourworld",
      "body": "because saying her boyfriend is bad isn’t helpful. for a person in ed recovery, eating frequently is vital. our bodies are in a different place and need reminders for fuel! however, her boyfriend not eating breakfast isn’t something she should be taught to resent him for. my mother for example, is extremely nauseous upon waking and can not physically eat for a few hours because she will feel so ill. where as me? if i don’t eat i’ll begin to feel ill! our metabolisms just work differently and thats ok. hunger = time to fuel!",
      "created_utc": 1587177281.0,
      "score": 1,
      "context": [
        {
          "id": "fnoxh9f",
          "author": "updown27",
          "body": "It is best to eat breakfast for everyone. Your partner is doing himself a disservice to skip breakfast every morning. Of course he doesn’t have to worry about gaining weight when he skips a whole meal every day.",
          "created_utc": 1587135450.0
        },
        {
          "id": "fnpgn9m",
          "author": "makeupyourworld",
          "body": "not a helpful comment to OP.",
          "created_utc": 1587145170.0
        },
        {
          "id": "fnpwirh",
          "author": "updown27",
          "body": "I don’t understand why it’s considered not helpful. Why should she base her meal choices off someone who not eating?",
          "created_utc": 1587153285.0
        }
      ]
    }
  ]
}