{
  "id": "g47kus",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587302548.0,
  "title": "Request: I can’t stop thinking about my moms eating disorder",
  "selftext": "I’m 21 and my mom would’ve been 49 but she passed away 2 years ago. \n\nMy mom’s passing was unrelated to her ed, I was just thinking about it and wanted to get it off my chest. When she was much younger she struggled with bulimia and I didn’t know how bad her fight with this was until I was about 16. She posted a blog about how she would throw up multiple times a day and that she would take boxes and boxes of laxatives. When I found this out it just totally broke my heart that she struggled with that at one point in her life. I remember as a kid occasionally I would hear my mom throw up in the bathroom, and it didn’t happen a lot, but I still remember those moments and now realizing why she was doing that is mind blowing to me. \n\nAnyways, fast forward to a few months before she passed away. I was walking by her bathroom and we had just eaten together and I had to do a double take. I could hear her throwing up in the bathroom and I was shocked. I had no idea she began struggling with this again. After she got out of the bathroom I asked her about it and she said that she just gets nauseous because she was taking anti-depressants and that’s the only reason she was doing that, but I didn’t buy it. My brother and I tried to help her feel like she didn’t need to do that, but I don’t think we made any sort of impact on her whatsoever. Anyways, it just hurts me to know that I was unable to help my mom, and I think about it a lot, and everything that she went through.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g47kus/request_i_cant_stop_thinking_about_my_moms_eating/",
  "score": 87,
  "num_comments": 4,
  "comments": [
    {
      "id": "fnw1ila",
      "author": "sleepwalker8",
      "body": "It’s not your fault. I’m really sorry for your loss.",
      "created_utc": 1587309517.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fnxwb1i",
      "author": "SnakePlant7000",
      "body": "I am sorry for your loss.\n\nI pray my mom, in her 60s, finally geta better.\n\nIt's heartbreaking to watch them slowly kill themselves. I",
      "created_utc": 1587347724.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fny0csv",
      "author": "teriyakigirl",
      "body": "What an awful thing to go through. Sending love ❤",
      "created_utc": 1587350380.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fny356l",
      "author": "Billie_Eilish_Fan_14",
      "body": "I’m so sorry. My mom went through bulimia when she was around 15-16, and she is now 45 and fully recovered. I’m sorry your mom had to go through that. Don’t blame yourself. You did everything you could. I’m sorry for your loss, sending my condolences 💙",
      "created_utc": 1587352261.0,
      "score": 2,
      "context": []
    }
  ]
}