{
  "id": "g59ymb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587449887.0,
  "title": "Request: feeling fake",
  "selftext": "Does anyone else feel like their ED isn’t real (enough) because they got themselves into it?\n\nI almost did it on purpose. I just wanted to be skinnier. I thought throwing up would be easier. I knew that was theoretically bulimia (technically purge disorder, because I never had binges), but if I just did it a little bit, or only when I overate, and stayed healthy otherwise then it wouldn’t count!\n\nI feel like the idea of an ED in my head is someone who didn’t know what was happening as they developed it, or maybe someone who became this way because of a traumatic event, or even only people who do it to extremes.\n\nI guess I’m just wondering if there are other people out there who knew that their behavior would lead to an ED and did it anyway.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g59ymb/request_feeling_fake/",
  "score": 181,
  "num_comments": 27,
  "comments": [
    {
      "id": "fo26onc",
      "author": "None",
      "body": "I mean... one thing to ask is, could someone who doesn't have disordered eating habits actually want to force themselves to throw up to be skinny? Would they commit these actions knowing it could become a life-threatening habit, if they were really doing okay?\n\nTo me, it makes the most sense to see everything as on a spectrum of some sort. I think the  desire to prioritize being skinny over basic needs in and of itself indicates a pattern of thought that reflects disordered eating. And of course, there's extremes on the other end.",
      "created_utc": 1587451448.0,
      "score": 48,
      "context": []
    },
    {
      "id": "fo267er",
      "author": "the_scientist52",
      "body": "I mean, I was in a similar position.  I knew when I started restricting that what I was doing wasn't healthy, but aren't all diets a little unhealthy?  I just wanted to lose a little weight.  I didn't plan to develop a full-blown ED and it sounds like you didn't either.  A lot of people fall into the trap of \"I can use these unhealthy behaviors just a little bit, or until I reach my goal weight\" and then end up not being able to stop.  It's way more common to happen that way than to just not be aware at all, so don't feel bad about that.\n\nAnd for what it's worth, for the longest time I thought my ED was only because of bad body image.  Only about my weight.  It wasn't until later when I realized that even though I started restricting because of body image, there was a lot going on underneath the surface that contributed to my ED too.  Control, trauma, etc.  I promise that there's something underneath the surface for you too, and you just haven't found it yet.  It might not be one of the conventional things but it's there.  So you aren't that different from the \"other ED sufferers\" after all.",
      "created_utc": 1587451013.0,
      "score": 24,
      "context": []
    },
    {
      "id": "fo25l3v",
      "author": "onlythebitterest",
      "body": "I do understand, it was a similar thing for me... I thought if I just ate less I'd be skinnier. That led to me eating less sure, but then eating huge amounts every so often and then binging more and more and then feeling guilty and eating less and etc etc. But I felt like I knew what was happening, I knew what I was doing, and I still did it. And now I want it to stop and I feel like I have no control over it..",
      "created_utc": 1587450440.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fo2bsa3",
      "author": "indig0sun",
      "body": "i think the whole point of an eating disorder is that you get yourself into it, in some way or other. I remember the first times i purged i told myself “this is the only time this will happen” but two years later i’m telling myself the same thing. My eating disorder morphed into some weird disgusting love child of anorexia and bulimia and at the end of the day nobody shoved my fingers down my throat except myself, but that doesn’t mean the struggle that I have with eating and myself is my fault. \nI’m sure there is more to your eating disorder than just wanting to be skinny, whether it is some childhood trauma or other emotional barrier that you have learned to cope with by purging. Honestly, EDs are basically one giant fucked up coping mechanism. It’s solving one problem while giving you a million other problems that are hugely life threatening. \ngotta love the ED life tho right :’)",
      "created_utc": 1587456438.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fo2i898",
      "author": "-jiangshi-",
      "body": "I pretty much did this too, in the beginning due to bullying as a child, and also I was curious to the tags on Tumblr - then unfortunately, I got sucked in before I knew it. You aren't alone! Xx",
      "created_utc": 1587463424.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fo2u6xg",
      "author": "None",
      "body": "I spoke with my therapist recently about these feelings. We identified it as Imposter Syndrome. I felt as though maybe I was being overdramatic, or maybe my doctors just didn't get that I wanted to be skinnier. \n\nThe reality is that I knew what I was doing. Even once I knew it in my head it didn't stop me. That doesn't invalidate the disorder, because for many of us, that *is* the disorder. \n\nEDs are not cookie cutter. We are all in this together but the way we got here doesn't always align, and the ways that we feel better and get healthier are not going to match, either. Your ED is your own. You can take advice and listen to the experiences of the others, but you shouldn't write it off as \"well theirs was worse so mine can't be real\" or \"they went inpatient when I didn't, so I should be quiet\". As cliche as it is, you are on your own journey!",
      "created_utc": 1587474186.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fo61tga",
      "author": "Spelarolll",
      "body": "I've been extremely aware of what I was doing all throughout what could be interpreted as my relapse but felt like I was choosing this behavior and because I'm aware of my unhealthy habits, it can't be that bad right? I went through my first purge a couple of weeks ago and since then I've been doing better because I don't want this. But as I get better I start questioning whether or not I just made it up because I want to be the victim and since I'm doing overall better even though I have my bad days too I feel like this getting better isn't really recovery, but simply me not being silly. \n\nI'm starting to question whether or not this is just the \"monster\" in my mind yet again trying to take control but it feels like I can't ask for help because I really haven't gotten far enough to deserve it.\n\nAt the same time, I'm now aware that if I COULD \"just get over it\" I wouldn't even be here and compulsory thinking my problems aren't bad enough, if I was fine I wouldn't WANT to get worse in the first place.",
      "created_utc": 1587543334.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fo2uqli",
      "author": "fudgemonkies",
      "body": "I mean, I think at its core, what makes an ED is the thoughts and behaviors around food. There are a lot of different environments, internal processes, and events that can lead to those thoughts and behaviors.\n\nI had a similar experience. I learned about EDs online in my teens; before that, I didn't know you could make yourself throw up. I have some stomach conditions that were uncontrolled at that time, and was regularly throwing up. I remember thinking clearly \"What if I make myself throw up more? No one will know the difference and I can lose more weight.\" It was a very deliberate decision. But that decision was made on a foundation of: a lifetime of negative messaging about being slightly overweight, untreated dysphoria (I'm transmasculine), and usage of food to self-medicate depressive symptoms. I wouldn't have made that conscious decision without those factors.",
      "created_utc": 1587474569.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fo4n0oy",
      "author": "dicklessfifties",
      "body": "I feel fake sometimes too. With all my behaviors and thoughts and dysmorphia, I was overweight and am not underweight but constantly complimented on how “skinny I got” which only feeds my mentality that that sort of behavior is ok and good. \nA friend of mine  has diagnosed anorexia and had to go to a treatment facility for it. It’s hard being around her and talking about it to her because while I do all the same thing she does, hers is more intensive than mine. It makes me wonder if I’m wrong for self diagnosing. \nI have to fight myself on this. All I can really focus on is that that behavior is UNHEALTHY. And no matter to what degree you do it it will always be unhealthy. Just because one person is drowning in an ocean and the other in a pool, it doesn’t mean they both aren’t struggling to keep moving. You can’t compare your battle, you just have to keep fighting it.",
      "created_utc": 1587507393.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fo992jh",
      "author": "missamericanas",
      "body": "I feel this. For a good amount of people, disordered eating is part of a larger body image issue. For me, it's not that, or at least I don't think it is. For me, purging was a way to relieve stress. I always do it during periods of high stress- when I get a bad grade or have an exam coming up- things like that. I can't say for sure what was going on in my brain when I decided \"hey, let's try making myself throw up\" but I did it once and I've been hooked for months. \n\nBody image has never been a huge part of it for me. Because of that, I've felt that it can't be an actual eating disorder.",
      "created_utc": 1587613407.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fo37zvb",
      "author": "diiiiiiiizzzzzy",
      "body": "I did that too, and spent a long time thinking that my ed’s fake. But i think the fact that you’re questioning it, and yet still can’t get out of it makes a very much real. ED’s fucks with your head and your body. Feeling that it’s not real is very much a part of it. It’s really hard, and it may be hard to believe. But coming from someone who thought the same things... it does get better. And props to you for trying :)",
      "created_utc": 1587482249.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo38lbb",
      "author": "-JustTrash-",
      "body": "I’m in the same boat... but no matter what, an eating disorder is an eating disorder. Doesn’t matter how it developed but it matters how we take care of ourselves.",
      "created_utc": 1587482558.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo3bior",
      "author": "LetMeNotEatCake",
      "body": "I have been battling EDs since I was a teen but I was never as self-aware as many people seem to be online - until now. I'm almost 30-years-old. I was in deep denial. If I came across ED communities or posts or whatever that I could relate to at the time, I'd make up excuses as to why I'm \"not like them,\" or it's \"just that one thing,\" or the classic, \"well I'm not skinny so everything I do is justified.\" The first time I purged was on purpose and I was very aware it was \"a thing that bulimics do\" but again - I was so convinced that that wasn't me. Nope! It was just that one time - then it was just occasionally - then it was a few times per week. But I still did not feel like I had bulimia or disordered eating because \"it's not every day and I knew what I was doing and I genuinely need to lose weight.\"\n\nThe point is - some of us are really hyper-aware of our situations. Some of us aren't. And I think for those who aren't, a lot of it is steeped in denial and \"I feel fake because mine isn't as severe\" or \"mine started a completely different way,\" it is the way our brains try to distance ourselves from the reality. At the end of the day, disordered eating is disordered eating.  \nMy opinion only, I'm not a doctor.",
      "created_utc": 1587484051.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo3tqis",
      "author": "None",
      "body": "yes! you are not alone! id never thought me just “not feeling hungry” and reducing and restricting my appetite would led to me struggling so much when i became self aware, im still kind of denying it, but i know we are all trying our best",
      "created_utc": 1587492796.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo3xarc",
      "author": "WaterIsMyLife2",
      "body": "Same, I feel like I'm an imposter because part of me wants this. Sometimes it feels like I could stop any time I want to, I just don't want to. But really I know that I couldn't stop, even if I tried. If I try to eat normally for a day, there's still that voice in the back of my head tallying the calories and a rising tide of anxiety that won't let me calm down until I write the calorie count down. Any attempt to release control of my intake makes me feel like I'm just spiralling out of control and if I blink, I'll open my eyes and find myself morbidly obese. Sure maybe a part of us chose/wanted this life, but I don't think that makes our disorders fake. I think just wanting/choosing it to begin with is disordered thinking. From the moment you think \"I don't care if it's fucked up, I just want to be skinny\" the disorder is already taking hold of you and eating away at your mental health. \n\nOur brains love to try to convince us that it's our fault, we're making all this up, it's all in our heads, Etc. If I eat more than 500 calories in a day I start thinking \"You don't have a disorder, you're fat. You don't have a disorder, you're just an extreme dieter with a victim complex. It's all your fault, and if you tell your family, they're just going to hate your for letting this happen. You did this to yourself, just grow up and eat like a regular fucking person.\" But it's hard to deny the disorder when so much hair comes off my head in the shower and I don't even care, or my vision goes fuzzy when I stand up quick and it feels like a victory. \n\nI think the traces of imposter syndrome and guilt are just another part of the disorder. Just another method the disorder uses to protect itself. Because if it's all fake or your fault, why even get help? If you chose this, why can't you just unchoose it? Eating disorders are more mental rather than physical for good reason. If the problem was just your intake, you could just start eating more. The physical symptoms are something you are tecnically in control of, the problems are the thoughts and feelings that drive your actions. The feels of \"wanting/choosing\" this are just part of the disorder, tricking you into thinking you're more in control of things than you really are. Really deep down no one wants to think/admit that they have a disorder. The thoughts are a protective measure to make you feel like you're still in control.",
      "created_utc": 1587494517.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo4lv64",
      "author": "MadamPotpourri",
      "body": "I had no idea what I was doing was disordered until I had time to reflect. \n\nI exercised obsessively, to the point where when I allowed my one “rest” day per week I’d feel anxiety about it for pretty much the whole day. I calorie counted and if I had so much of a bite of apple I’d write it in my notepad.\n\nThis all seemed perfectly reasonable to me until someone pointed out I was getting extremely skinny and I realized it has been months since I’d allowed myself to go out to dinner with friends (for fear of blowing my daily limit.) \n\nSo I don’t personally feel that your mindset going in is the determining factor. It’s more is this attitude and lifestyle bordering into the mentally and physically toxic. It can be very subjective. While some cases are arguably quite obvious and undeniable, there’s gray area where what’s harmful for one is healthful for another.",
      "created_utc": 1587506776.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpgb5fh",
      "author": "None",
      "body": "I mean for me it is also similar. Like I KNOW that eating and then restricting or over exercising isnt good but I do it anyway. Why? Because I cant seem to stop. I just feel horrible about myself and disgusting if I eat and dont do anything about it. So I go out for 3+ hour runs and they usually dont end well. Like I just ran 12 km yesterday and now my knees are dead. I can barely walk. But what am I thinking about? If I can run tomorrow since I couldnt exercise and burn off the calories I took today. I know these thoughts arent healthy but the fact that I know that doesnt change the fact that my realtionship with food is fucked up. Of course no one really knows I do this and tbh I dont feel like I have a disorder. I just feel like I dont have the best relationship with food but it isn’t extreme or anything like I am not severly underweight actually I am very fat so I guess it’s fine.",
      "created_utc": 1588598951.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqb00vd",
      "author": "mysterous_snail444",
      "body": "I totally get you. i’m recovering from ana rn and sometimes I feel like I faked all of it. was it for attention? did it to make me feel special? \n\nshort answer: you didn’t fake it. I promise. if you faked it you wouldn’t be struggling like you are.\n\nstay safe and sending good health your way \n\n~mysterious snail 🐌",
      "created_utc": 1589228217.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqgod77",
      "author": "Just_Yeet_Yourself",
      "body": "At first I'm like, I'm a go on a diet and it didn't work so I'm like I honestly don't care about my health at this point I'ma just starve, and idk how I found out eating disorders existed I think at that point I thought people starve, it's called fasting... A diet, fasting is a diet not a disorder... People eat low calories to loose weight and that is a flipping diet... Chill out it will only be temporary.... 2 years later, nope not temporary... And I don't want to recover, my parents haven't found out sooooooo... Let's just keep going I'll quit at sone point, a year later, I'm not in the mood to quit, 3 seconds later, yeah I have a disorder... ._. I kinda went into it with self doubt I said it wasn't a disorder because I was gonna only restrict a little and I thought why would I restrict a little when I can restrict a lot, so I knew I had a disorder it was just like and idc thing, but I do care now because it sucks and I hate it but I'm not gonna stop because, idk I don't want to idk why I don't want to because I hate every second of it but I dont. Like that self doubt went away the second I realized normal people don't stop eating for a couple of days and weigh everyday and check the calories on everything and are absolutely obsessed with being skinny and really don't care that the effects will last forever blah blah blah ed stuff... Sooooo....... Yeah",
      "created_utc": 1589351957.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g07d6fy",
      "author": "None",
      "body": "Yes! Especially because when I was at the peak of my ED I wasn’t clinically underweight so no PCP would take anything I said seriously. It was even to the point where I would faint from laxative abuse but my parents at the time didn’t connect the dots between my weight loss and sudden health issues. I think feeling like you’re “faking” having an ED is common for those of us who don’t “look like” we have/had one. Looking back at pictures of myself from that time I look relatively “normal” but the way I was eating was far from it. But even at that time when I was restricting heavily I would never have said I had an ED, just that I was watching my weight",
      "created_utc": 1596460772.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1xs3qg",
      "author": "gayshouldbecanon",
      "body": "I get this.",
      "created_utc": 1597715796.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fo5gotv",
      "author": "imadeafucky-wucky",
      "body": "Yeah, exactly! Anyone who can rationalize these actions has at least somewhat disordered thinking.",
      "created_utc": 1587525211.0,
      "score": 2,
      "context": [
        {
          "id": "fo26onc",
          "author": "None",
          "body": "I mean... one thing to ask is, could someone who doesn't have disordered eating habits actually want to force themselves to throw up to be skinny? Would they commit these actions knowing it could become a life-threatening habit, if they were really doing okay?\n\nTo me, it makes the most sense to see everything as on a spectrum of some sort. I think the  desire to prioritize being skinny over basic needs in and of itself indicates a pattern of thought that reflects disordered eating. And of course, there's extremes on the other end.",
          "created_utc": 1587451448.0
        }
      ]
    },
    {
      "id": "fo7zzq0",
      "author": "imadeafucky-wucky",
      "body": "It feels weird to know that you have an eating disorder. Because then it’s like, why are you doing it? And the answer is I don’t know!",
      "created_utc": 1587587475.0,
      "score": 3,
      "context": [
        {
          "id": "fo25l3v",
          "author": "onlythebitterest",
          "body": "I do understand, it was a similar thing for me... I thought if I just ate less I'd be skinnier. That led to me eating less sure, but then eating huge amounts every so often and then binging more and more and then feeling guilty and eating less and etc etc. But I felt like I knew what was happening, I knew what I was doing, and I still did it. And now I want it to stop and I feel like I have no control over it..",
          "created_utc": 1587450440.0
        }
      ]
    },
    {
      "id": "fo806bf",
      "author": "imadeafucky-wucky",
      "body": "The last paragraph hits home for me! If I could/would stop then I would be fine. But I don’t want to.",
      "created_utc": 1587587566.0,
      "score": 1,
      "context": [
        {
          "id": "fo61tga",
          "author": "Spelarolll",
          "body": "I've been extremely aware of what I was doing all throughout what could be interpreted as my relapse but felt like I was choosing this behavior and because I'm aware of my unhealthy habits, it can't be that bad right? I went through my first purge a couple of weeks ago and since then I've been doing better because I don't want this. But as I get better I start questioning whether or not I just made it up because I want to be the victim and since I'm doing overall better even though I have my bad days too I feel like this getting better isn't really recovery, but simply me not being silly. \n\nI'm starting to question whether or not this is just the \"monster\" in my mind yet again trying to take control but it feels like I can't ask for help because I really haven't gotten far enough to deserve it.\n\nAt the same time, I'm now aware that if I COULD \"just get over it\" I wouldn't even be here and compulsory thinking my problems aren't bad enough, if I was fine I wouldn't WANT to get worse in the first place.",
          "created_utc": 1587543334.0
        }
      ]
    },
    {
      "id": "fo5guol",
      "author": "imadeafucky-wucky",
      "body": "You’re so right. This is incredibly insightful.\n\nI wish I could unchoose it. But like you said at the beginning, I’ve never really tried because I don’t want to (but I probably actually couldn’t if I tried).",
      "created_utc": 1587525319.0,
      "score": 2,
      "context": [
        {
          "id": "fo3xarc",
          "author": "WaterIsMyLife2",
          "body": "Same, I feel like I'm an imposter because part of me wants this. Sometimes it feels like I could stop any time I want to, I just don't want to. But really I know that I couldn't stop, even if I tried. If I try to eat normally for a day, there's still that voice in the back of my head tallying the calories and a rising tide of anxiety that won't let me calm down until I write the calorie count down. Any attempt to release control of my intake makes me feel like I'm just spiralling out of control and if I blink, I'll open my eyes and find myself morbidly obese. Sure maybe a part of us chose/wanted this life, but I don't think that makes our disorders fake. I think just wanting/choosing it to begin with is disordered thinking. From the moment you think \"I don't care if it's fucked up, I just want to be skinny\" the disorder is already taking hold of you and eating away at your mental health. \n\nOur brains love to try to convince us that it's our fault, we're making all this up, it's all in our heads, Etc. If I eat more than 500 calories in a day I start thinking \"You don't have a disorder, you're fat. You don't have a disorder, you're just an extreme dieter with a victim complex. It's all your fault, and if you tell your family, they're just going to hate your for letting this happen. You did this to yourself, just grow up and eat like a regular fucking person.\" But it's hard to deny the disorder when so much hair comes off my head in the shower and I don't even care, or my vision goes fuzzy when I stand up quick and it feels like a victory. \n\nI think the traces of imposter syndrome and guilt are just another part of the disorder. Just another method the disorder uses to protect itself. Because if it's all fake or your fault, why even get help? If you chose this, why can't you just unchoose it? Eating disorders are more mental rather than physical for good reason. If the problem was just your intake, you could just start eating more. The physical symptoms are something you are tecnically in control of, the problems are the thoughts and feelings that drive your actions. The feels of \"wanting/choosing\" this are just part of the disorder, tricking you into thinking you're more in control of things than you really are. Really deep down no one wants to think/admit that they have a disorder. The thoughts are a protective measure to make you feel like you're still in control.",
          "created_utc": 1587494517.0
        }
      ]
    },
    {
      "id": "fo5j52m",
      "author": "None",
      "body": "Yes exactly! Also @OP I empathize with feeling like your eating disorder is fake, a very dangerous (and common) part of ED’s in general is thinking they’re fake because a lot of people let themselves do more dangerous behavior if they think their previous mindset was healthy. Feel free to DM me if you ever need someone to talk to!",
      "created_utc": 1587526913.0,
      "score": 2,
      "context": [
        {
          "id": "fo26onc",
          "author": "None",
          "body": "I mean... one thing to ask is, could someone who doesn't have disordered eating habits actually want to force themselves to throw up to be skinny? Would they commit these actions knowing it could become a life-threatening habit, if they were really doing okay?\n\nTo me, it makes the most sense to see everything as on a spectrum of some sort. I think the  desire to prioritize being skinny over basic needs in and of itself indicates a pattern of thought that reflects disordered eating. And of course, there's extremes on the other end.",
          "created_utc": 1587451448.0
        },
        {
          "id": "fo5gotv",
          "author": "imadeafucky-wucky",
          "body": "Yeah, exactly! Anyone who can rationalize these actions has at least somewhat disordered thinking.",
          "created_utc": 1587525211.0
        }
      ]
    },
    {
      "id": "fo80j65",
      "author": "onlythebitterest",
      "body": "Yea that's true, it all gets so confusing in my head because I want to be skinnier but to be skinnier I have to eat less, workout more, but then for normal people that's fine and they can just do that without de one guessing everything you do cuz what if it's my eating disorder telling me to do these things... But then am I never gonna loose weight? And then one thing leads to another and all of a sudden I find myself back in the cycle of binging and restricting that I worked hard to get out of.",
      "created_utc": 1587587746.0,
      "score": 3,
      "context": [
        {
          "id": "fo25l3v",
          "author": "onlythebitterest",
          "body": "I do understand, it was a similar thing for me... I thought if I just ate less I'd be skinnier. That led to me eating less sure, but then eating huge amounts every so often and then binging more and more and then feeling guilty and eating less and etc etc. But I felt like I knew what was happening, I knew what I was doing, and I still did it. And now I want it to stop and I feel like I have no control over it..",
          "created_utc": 1587450440.0
        },
        {
          "id": "fo7zzq0",
          "author": "imadeafucky-wucky",
          "body": "It feels weird to know that you have an eating disorder. Because then it’s like, why are you doing it? And the answer is I don’t know!",
          "created_utc": 1587587475.0
        }
      ]
    }
  ]
}