{
  "id": "g5ym0c",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587550798.0,
  "title": "Request: My post request: nightly binge eating during quarantine",
  "selftext": "This has always been an issue for me. Realistically it is just as possible all day long but I think I have more distractions/people around.\n\nI lost a ton of weight when I moved in with my boyfriend two years ago because I didn’t binge around him. (I was with him for a full year as a heavier human before this) I would never let him see/gain awareness of that part of my life. He used to think I was anorexic because I ended up so thin so rapidly.\n\nWell we are living apart now and I started binging again non stop. Always at night. Usually sweets. I’m never hungry. I make myself so sick that I want to throw up all the way into the next day (and then I do it all over again anyway).\n\nI’ve put on so much weight and am so depressed, ashamed, and unsure of what to do. It’s gotten worse since quarantine because I’m not out doing my social exercise groups around town.\n\nI’m aware of the problem and I’m SO SICK with myself that I can’t fathom wanting to go through it again tomorrow....and yet I know I will.\n\nHow have you all coped with this? I know for a fact that living with my boyfriend again would immediately fix it. But...not really you know? I’d still have the same mindset, I just hide it when others are around. How do I cope with being alone I guess....",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g5ym0c/request_my_post_request_nightly_binge_eating/",
  "score": 69,
  "num_comments": 18,
  "comments": [
    {
      "id": "fo6emks",
      "author": "sapolica",
      "body": "When you feel like binging, you should text your bf that you're thinking of him aha maybe starting a convo will help distract you long enough to forget about it especially since you say you're not hungry",
      "created_utc": 1587556572.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fo6wl5d",
      "author": "nourished-soul",
      "body": "I used to be in a place like this where I struggled with bingeing, I noticed that I would go through these emotional waves (and they would vary from extreme sadness, to anxiety, boredom, confusion/guilt) and I would eat my feelings until my stomach was so full it hurt and was physically hard. I hid my disordered eating for years and would shake it off like nothing was wrong, even though I knew my behavior was abnormal. I think living with you boyfriend is a quick fix, sort of like a band aid, but without properly healing the wound (or emotional aspect that could be related to these patterns) the issue isn't going to go away. \n\nFinding healthy outlets/ connections is great whether you're alone or not, try journaling and just letting the pen flow to the paper without really thinking about what you want to write but let your subconscious free and onto the paper. (Myself and many others have found hidden answers through this practice) Calling a close friend, loved family member or your boyfriend and expressing to them how much you love them, appreciate them etc. Spreading those feelings and expressing them allows those loving feelings to come back to you. \n\nIf you're on the brink of bingeing maybe going to make a cup of tea instead, or finding something productive (journaling, exercising, listening to your favorite music) something to start getting you out of that pattern. Hope this helps!",
      "created_utc": 1587568077.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fo6ks0c",
      "author": "None",
      "body": "The Brain before binge podcast has been immensely helpful for me. Especially when paired with a walk :)",
      "created_utc": 1587561232.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fo73idv",
      "author": "sparkyhiker",
      "body": "Joining a 12 step program has helped me tremendously. Fought the god thing but now have a different vision about the higher power.   I find that my food and exercise compulsions are more about me controlling life (which is impossible), instead of accepting me and others for our humanness and trusting that their is a higher \"thing\" at work.",
      "created_utc": 1587571601.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fo6faei",
      "author": "fudgemonkies",
      "body": "Loneliness is my biggest trigger as well, and I fight with the same pattern of evening onset. I would recommend trying to figure out structured distance social activities in the evenings, especially ones that include a video or audio component (that way you can minimize the chance that you'll be able to eat while you're doing the activity). \n\nWould your boyfriend be up for calls or video calls? Do you have friends you can engage with? If neither of those are currently options, you could look for online groups to join, like support groups, gaming groups, etc. There are chats here on reddit, through discord, and mental heath support websites.",
      "created_utc": 1587557146.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo7njza",
      "author": "paradoxrevel",
      "body": "I am so sorry you are dealing with this. I have similar issues, but here's the thing: I live with my long-term partner. At first, living together was enough to halt the urges to binge, but as I grew more comfortable with him, the bingeing gradually returned. So, I think you're on the right track knowing that living with him would \"fix\" it, but \"not really.\" (You nailed it, there). What has helped for me is to **eat more** throughout the day so I'm not underfed in the evening  (sometimes that alone is enough) and then, if I do find myself eating or wanting to eat more, I have to be really curious about why I want to eat - I'm usually trying to avoid feeling something (tired, bored, lonely, insecure, self-critical, etc). The biggest, most helpful first step is to forgive. I have to forgive myself for those urges and for the times I slip. It's counterintuitive, but that's the only thing that stops me. Be gentle to you <3",
      "created_utc": 1587581382.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo99xzm",
      "author": "zebadiyah",
      "body": "Were you significantly underweight or restricting? When I was recovering from AN, I developed severe bulimia and even after I thought I had gained all the weight I needed to be weight restored, I would still binge epically at night, on sweet things usually that I don’t even like or crave normally. O would purge until early morning, cry, regret it, hate myself, tell myself I would stop, and then do it all again tomorrow.) I tried a million techniques. However, Once I got to my pre-ED weight, I stopped. The need to binge at night went away significantly. By also telling people around me about my struggle and trying to eat three meals a day (regardless how big) I’ve managed to not night binge for months, which I always thought was impossible. If you’ve heard of set-point theory or All In, those theories can help explain or provide comfort about this topic. Stephanie Buttermore is a great person for explaining her earlier YouTube videos on All In explain extreme hunger and her process shows getting back in touch with hunger cues and your body. Amanda Sevilla also was talking about it in her last two YouTube videos.\nNo idea if this helps you or sounds related to what you’re going through, but watching these women talk about food intake and the damage of restricting helped me view my relationship with food and my body better anyway. Stay safe, sending virtual support to you! \n(Disclaimer: This is in no way professional help or diagnosis. Eating disorders are life-threatening and difficult to fight, please seek professional medical help if you are worried about your eating and food relationship.)",
      "created_utc": 1587614016.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo9l21c",
      "author": "princessbailes",
      "body": "I have also started binging again. Always in the middle of the night around 12am-2am. I’m embarrassed and ashamed right after I do it.. yet it happens day after day. Just know you’re not alone.",
      "created_utc": 1587622658.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fo7xmpr",
      "author": "canoe4you",
      "body": "If you can’t resist the urge to binge, would it be possible to binge on healthy foods like carrots or tomatoes? I love blackened asparagus with a little salt on it, then I cut it up into small pieces and chew as long as I can before swallowing, this has worked well for my night time urges to binge eat. Ends up taking me 30 minutes to eat a head of asparagus that’s only 25 calories.... maybe something like that could work At least until you can get in to see a therapist? Relying on someone else to keep you from binge eating isn’t going to be sustainable unfortunately.",
      "created_utc": 1587586298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fo8o589",
      "author": "Atxrecovery",
      "body": "There are so many free support groups right now that might be helpful for you to check-out. It sounds like you have great awareness into your behaviors. Support groups can offer skills to use instead of behaviors. \nhttps://docs.google.com/document/d/11IsP3yKZlUwW_hP4180BFLN8dOFvy6faxiTwCkZ6x4Q/edit",
      "created_utc": 1587600419.0,
      "score": 1,
      "context": []
    },
    {
      "id": "foih027",
      "author": "beatbingeeating",
      "body": "I think you would benefit from this episode of the 'Love yourself healthy' podcast on [How to stop binge eating at night](https://www.barexbrave.com/how-to-stop-binge-eating-at-night-time/).  \n\n\nTheres also a blog post on [Tips for people struggling with an eating disorder during quarantine](https://www.barexbrave.com/tips-for-people-struggling-with-an-eating-disorder-throughout-quarantine/) that you might find helpful.",
      "created_utc": 1587786431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fo7pt1r",
      "author": "LetMeNotEatCake",
      "body": "Have you tried OA meetings? You could find a group at night during your usual binge hours. They have online meetings and also telephone meetings. You are not required to talk for phone meetings, you can just listen. At least for me, it helps not to feel so lonely and that I'm hearing from a group of people who know exactly what I've been through. YMMV, good luck.",
      "created_utc": 1587582462.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fo85tmh",
      "author": "Emyrbl",
      "body": "And the Brain over Binge book too. Very raw words and inspiring, different to a lot of the \"sharing my story blabla\"",
      "created_utc": 1587590424.0,
      "score": 2,
      "context": [
        {
          "id": "fo6ks0c",
          "author": "None",
          "body": "The Brain before binge podcast has been immensely helpful for me. Especially when paired with a walk :)",
          "created_utc": 1587561232.0
        }
      ]
    },
    {
      "id": "fqmcwab",
      "author": "Fitkratomgirl",
      "body": "I agree with the control piece, it's probably the biggest aspect in all the ED's I've struggled with",
      "created_utc": 1589475365.0,
      "score": 1,
      "context": [
        {
          "id": "fo73idv",
          "author": "sparkyhiker",
          "body": "Joining a 12 step program has helped me tremendously. Fought the god thing but now have a different vision about the higher power.   I find that my food and exercise compulsions are more about me controlling life (which is impossible), instead of accepting me and others for our humanness and trusting that their is a higher \"thing\" at work.",
          "created_utc": 1587571601.0
        }
      ]
    },
    {
      "id": "fo8o7wn",
      "author": "Atxrecovery",
      "body": "The link has a list of a lot of free support groups. There are ones specific to binge eating that would be most helpful to you!",
      "created_utc": 1587600461.0,
      "score": 1,
      "context": [
        {
          "id": "fo8o589",
          "author": "Atxrecovery",
          "body": "There are so many free support groups right now that might be helpful for you to check-out. It sounds like you have great awareness into your behaviors. Support groups can offer skills to use instead of behaviors. \nhttps://docs.google.com/document/d/11IsP3yKZlUwW_hP4180BFLN8dOFvy6faxiTwCkZ6x4Q/edit",
          "created_utc": 1587600419.0
        }
      ]
    },
    {
      "id": "fo8o0ew",
      "author": "Atxrecovery",
      "body": "EDA might be more helpful! OA has people restrict bread and sugar which is more diet culture stuff!",
      "created_utc": 1587600344.0,
      "score": 2,
      "context": [
        {
          "id": "fo7pt1r",
          "author": "LetMeNotEatCake",
          "body": "Have you tried OA meetings? You could find a group at night during your usual binge hours. They have online meetings and also telephone meetings. You are not required to talk for phone meetings, you can just listen. At least for me, it helps not to feel so lonely and that I'm hearing from a group of people who know exactly what I've been through. YMMV, good luck.",
          "created_utc": 1587582462.0
        }
      ]
    },
    {
      "id": "fo8qjeh",
      "author": "LetMeNotEatCake",
      "body": "OA HOW I believe is the one the restricts bread and sugar, not plain OA. But nonetheless, I don't work the OA program but I still find attending meetings very helpful. So I agree, there are a lot of things about OA I don't agree with (including thinking their way is the \"only way\" to recovery). You have to try different stuff and see what works for you personally.",
      "created_utc": 1587601786.0,
      "score": 2,
      "context": [
        {
          "id": "fo7pt1r",
          "author": "LetMeNotEatCake",
          "body": "Have you tried OA meetings? You could find a group at night during your usual binge hours. They have online meetings and also telephone meetings. You are not required to talk for phone meetings, you can just listen. At least for me, it helps not to feel so lonely and that I'm hearing from a group of people who know exactly what I've been through. YMMV, good luck.",
          "created_utc": 1587582462.0
        },
        {
          "id": "fo8o0ew",
          "author": "Atxrecovery",
          "body": "EDA might be more helpful! OA has people restrict bread and sugar which is more diet culture stuff!",
          "created_utc": 1587600344.0
        }
      ]
    }
  ]
}