{
  "id": "g6i0u1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587625237.0,
  "title": "Request: COVID causing me to restrict",
  "selftext": "For the past few years I’ve had issues with my body image and restrictive eating, but they’ve never been as bad as this. I’ve been stuck at home for the past month, and I can’t bring myself to stick to a workout routine. I find it easier to restrict rather than eat healthy and exercise. I’m usually involved in year-round sports, and during those time periods I have no desire to cut calories. However, because of quarantine, I can’t stop thinking about food. I’m terrified that I wont be able to control myself in the future, but I don’t want to tell my parents what’s happening. I don’t know what to do, and I’m worried that I’ll end up hurting my body.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g6i0u1/request_covid_causing_me_to_restrict/",
  "score": 49,
  "num_comments": 4,
  "comments": [
    {
      "id": "fo9ousl",
      "author": "reddituserjpg",
      "body": "please tell your parents. it’s better to get help sooner rather than later; nip this problem in the bud to prevent it from getting any worse. my mom called my doctor today and told her what was going on because i had finally become fed up (haha, pun) with my ed. i felt terrified, ashamed, and embarrassed but i’m so excited to get real solutions and potentially get back to living a normal life as soon as possible",
      "created_utc": 1587626085.0,
      "score": 10,
      "context": []
    },
    {
      "id": "foizhii",
      "author": "None",
      "body": "Ugh you are not alone!!!! Purchased a detox kit or pills from vitamin shoppe. Hopefully it helps me feel better and will start working out again, eating better, lay off the alcohol and drink vitamins.  Need to get out of this depression hole. Much luck to you!!!",
      "created_utc": 1587802472.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fobec1z",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1587658933.0,
      "score": -17,
      "context": []
    },
    {
      "id": "fobf2xz",
      "author": "reddituserjpg",
      "body": "a lot of the times eating disorders develop as a coping mechanism to deal with stressful situations. don’t be an ass",
      "created_utc": 1587659142.0,
      "score": 8,
      "context": [
        {
          "id": "fobec1z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1587658933.0
        }
      ]
    }
  ]
}