{
  "id": "g77udt",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587732757.0,
  "title": "Request: Depressed while dealing with restrictive eating.",
  "selftext": "Since the covid started I tried to focus on my eating disorder and bringing myself to have a healthier relationship with food. I thought I was doing pretty good, because my mom was home and she was the one that made meals and pushed me to eat. This week she has gone back to work, and Ive sort of been struggling a lot. I struggle with depression so its just really hard to bring myself to make a meal. Im just asking for advice on how to deal with this and maybe what to do? I feel really bad because I’m 19 and I cant even properly take care of myself\n\nHow do you deal with restrictive eating during a depression cycle?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g77udt/request_depressed_while_dealing_with_restrictive/",
  "score": 50,
  "num_comments": 7,
  "comments": [
    {
      "id": "fofx4t6",
      "author": "updown27",
      "body": "I'm going to submit a request post because I have a ton of suggestions for this as I've been putting in a lot of effort to overcome my urges to restrict during this time. Keep a look out for that but for now I am going to suggest a meal plan. I had my dietitian send me one that tells me how many servings of each food group to eat at each meal and snack. That way, if I can't muster the strength of creating a full meal i can just plug a chunk of food into each food group and still meet my dietary requirements. I've set alarms for each meal and snack as well as night time alarms to get me into bed on a consistent schedule. I also keep tons of food in my room (peanut butter, jelly and bread, yogurt cake and chip did in my mini fridge, tortilla chips, nuts and seeds, dried fruit, granola bars, etc.) and lots of frozen food in the kitchen. I try to cook in large batches when i feel up for it so I can have ready-to-go food when I'm not up for it (mostly soup). Also consider keeping some ensure on hand for those times when food just isn't happening. It's important not to consider that a meal replacement but its better than nothing and helps alleviate my anxiety and guilt over not being able to feed myself the way I know my body needs and deserves. At least I know I am giving my body something. I keep cold drinks and an electrical kettle in my room for tea and hot chocolate, i try to stimulate as many senses as possible with stuff that feels good. I have essential oils and a diffuser to keep my room smelling like a garden and I've started playing ambient environments from fantasy realms on youtube in the background so i feel less lonely. Last but not least, avoid body checking and redirect any thoughts about body shape and weight. Remind yourself that the most important thing right now is to stay healthy by giving your body what it needs to survive both physically, mentally and emotionally. I hope this helps. Ganbatte!\n\nEdit: added some detail because I realized we are only allowed to post questions to this group and not advice, my bad :)",
      "created_utc": 1587744355.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fofdc60",
      "author": "None",
      "body": "Yeahhhh, during the summer I'm relatively okay but as soon as I go back to uni it's like I cant be bothered to eat bc idk I dont really have to and dont see the point if nobody is around  \n\nMeal plan for sure. Have everything you need on hand. Make it a routine. Say \" at 5 pm I'm going to start supper every day\". It becomes a routine. Have alternative meals that you can just throw in the oven or microwave. Make extras, so you can have it for lunch or supper the next day. Or make a big batch of say rice or something and use that as a side or in stir frys or whatever for the next few days.",
      "created_utc": 1587733269.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fogxqop",
      "author": "None",
      "body": "Don't worry I'm 26f with a family and I still get stuck in that cycle way too often. I'm trying to eat toast so I won't fall into a starvation rabbit role which leads to more depression. \nTry eating something quick and easy and nothing unhealthy (?)",
      "created_utc": 1587758183.0,
      "score": 2,
      "context": []
    },
    {
      "id": "foh1s6y",
      "author": "lolisugrr",
      "body": "from my stance, i'm not proud to admit that i just don't eat during times like this... i think it has to do w both the physical discomfort of eating when i don't have an appetite as well as the knowledge that i'm, in a way, in control? but i urge you to maybe eat something light and something that won't trigger guilt, (fruit, veggies?) try to minimize the guilt you feel when you find yourself unable to properly take care of yourself, it's a larger and scarier pit when that happens. be kind to yourself and take small steps to overcome both the depression and eating disorder. you're not in this alone. you got this! you only get one body and one chance, cherish yourself and take care of yourself. <3",
      "created_utc": 1587759545.0,
      "score": 2,
      "context": []
    },
    {
      "id": "foh6ktj",
      "author": "_Tehanu",
      "body": "That’s fantastic that you’ve been trying to take better care of yourself! Honestly, this time has been so difficult that that’s a huge win in and of itself. I certainly wouldn’t beat yourself up for struggling/falling off the bandwagon. Recovery is just a long process and it doesn’t happen in a linear fashion.\n\nOthers have suggested a meal plan and timed eating. That has also been very helpful. I also bought some ensure and soup. For me, drinking something is easier than eating. \n\nIt also helps me to remember that restricting really, really exacerbated the depression. I’ll feel so much worse if I don’t eat- having no energy, volatile mood, feeling like I constantly want to cry. \n\nBut it’s just really hard now that we’re isolated and just stuck inside with no routine. I hope you can be kind to yourself- that’s always been the most important thing for me!",
      "created_utc": 1587761098.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fok0ptj",
      "author": "bluebelugas",
      "body": "Literally exactly the same scenario for me. I just feel bad for my mom at this point she worries because my weight has been going down since covid. When she’s at home I have no problem eating because she alway makes sure I have a meal. But with her at work, I can’t even take care of myself. With this whole quarantine situation I’m falling back into the hole I was once in. I just don’t understand why I’m like this. My restrictive behaviours always get triggered when I’m at home for long periods of time, and with school online I feel as though I have too much control over my eating behaviours. And I feel as though my family doesn’t understand either, they’ll just be like just eat, it’s not that hard. I hope I can overcome this :(",
      "created_utc": 1587833187.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fogw4bp",
      "author": "None",
      "body": "I know it's very hard to cook thinking that you don't need the food- maybe try some legume soup or lean meat or fish or make a salad. These work for me😊",
      "created_utc": 1587757632.0,
      "score": 1,
      "context": []
    }
  ]
}