{
  "id": "g7r4fb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587808951.0,
  "title": "Request: my mom is triggering my eating disorder",
  "selftext": "‪because of shelter in place, i’m out of school and living with my mom. she has expressed a great deal of concern over her body image and has began dieting and exercising a lot. she keeps talking about her weight and food in general. i suffered from disordered eating habits for the entirety of middle and high school and have only recently gained a sense of worth outside of my body image. i never talked to my mom about my eating disorder and recovered independently from her. how do i get her to stop talking about her weight, body, eating habits, exercise, etc. without exposing my past eating disorder? ‬",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g7r4fb/request_my_mom_is_triggering_my_eating_disorder/",
  "score": 90,
  "num_comments": 10,
  "comments": [
    {
      "id": "foj7c65",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1587811267.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fojc8xk",
      "author": "slowlylosingit0416",
      "body": "You either have to find another place to stay or be honest with her. If she truly doesn’t know, she’s not meaning any harm. Maybe start by talking to her about her body image concerns of you think you can handle it?",
      "created_utc": 1587816470.0,
      "score": 7,
      "context": []
    },
    {
      "id": "foj5ts9",
      "author": "None",
      "body": "I am a mother and worry every day my daughter will suffer like I am. What can I do to stop this?",
      "created_utc": 1587809555.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fojul45",
      "author": "tymopa",
      "body": "Check out this resource friends and call the hotline if you want to: https://www.nationaleatingdisorders.org/",
      "created_utc": 1587829704.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fojkjo8",
      "author": "Atxrecovery",
      "body": "Maybe joining a virtual support group would be helpful! There are so many free options right now! https://docs.google.com/document/d/11IsP3yKZlUwW_hP4180BFLN8dOFvy6faxiTwCkZ6x4Q/edit#\nI am not sure if you are familiar with DBT but if you search DBT DEARMAN, it is a skill that helps you effectively communicate to others and it improves your chances of getting your needs met.",
      "created_utc": 1587823312.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fol59fu",
      "author": "BestWesterChester",
      "body": "If you think she’ll be understanding, you could tell her about your ED and experience. I’m my personal life, it didn’t change the way my mother behaved about herself (she had serious eating issues as well), but it did make her more understanding about what I needed.",
      "created_utc": 1587855146.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fojklzc",
      "author": "Atxrecovery",
      "body": "Maybe joining a virtual support group would be helpful! There are so many free options right now! https://docs.google.com/document/d/11IsP3yKZlUwW_hP4180BFLN8dOFvy6faxiTwCkZ6x4Q/edit#\nI am not sure if you are familiar with DBT but if you search DBT DEARMAN, it is a skill that helps you effectively communicate to others and it improves your chances of getting your needs met.",
      "created_utc": 1587823356.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fokolrr",
      "author": "lickingbuttdaily33",
      "body": "Don't blame other ppl for ur own behavior",
      "created_utc": 1587845988.0,
      "score": -9,
      "context": []
    },
    {
      "id": "folid2o",
      "author": "Evahild_flute",
      "body": "Sending all my support to you! \nI had the exact same story, it took me moving 8000km away to solve it (France ->South Korea)",
      "created_utc": 1587862868.0,
      "score": 3,
      "context": [
        {
          "id": "foj7c65",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1587811267.0
        }
      ]
    },
    {
      "id": "fojuemj",
      "author": "tymopa",
      "body": "I am also a mother who suffered from bulimia from 15 off and on until age 46 when I finally got ED therapy. It was the best thing I've ever done. I was with many girls who suffered from EDs largely because their mom's hadn't gotten help themselves so projected their issues onto their kids. EDs are viscious and they are nothing to be ashamed of. They are real and have a hold on more people than we know. If you have access to an ED therapist or clinic  I would go and see what they recommend. The person above you posted a link for free DBT which is awesome. I would also check this out...super helpful info and you could call their hotline: https://www.nationaleatingdisorders.org/\nIt's great that you are asking this question. I wish you the best because I know what a difficult spot you're in.",
      "created_utc": 1587829597.0,
      "score": 7,
      "context": [
        {
          "id": "foj5ts9",
          "author": "None",
          "body": "I am a mother and worry every day my daughter will suffer like I am. What can I do to stop this?",
          "created_utc": 1587809555.0
        }
      ]
    },
    {
      "id": "fojktjx",
      "author": "Atxrecovery",
      "body": "Have you considered seeking help for your eating disorder? There are therapists that specialize in eating disorders and dietitians that can help you! If you need help locating them in your area DM and I can help. I am not a mother but when I was active in my disorder, I was so terrified my niece and nephew would notice my unhealthy coping mechanisms.",
      "created_utc": 1587823500.0,
      "score": 2,
      "context": [
        {
          "id": "foj5ts9",
          "author": "None",
          "body": "I am a mother and worry every day my daughter will suffer like I am. What can I do to stop this?",
          "created_utc": 1587809555.0
        }
      ]
    }
  ]
}