{
  "id": "g8igxf",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587922272.0,
  "title": "Request: I can't exist in this body any longer",
  "selftext": "To say I developed an eating disorder at 13 would be foolish, because I have always had an unhealthy relationship with food and my body. As a young child, I was very overweight . I would hide and eat, so my mother wouldn’t be angry with me. She would send me to school without a meal, so I would binge heavily at my grandma’s at the end of the day. At 13, I was put on a diet and my obsession snowballed from pivotal decision. My lowest weight was severely underweight— I’ve been through multiple admissions to treatment, suicide attempts, ECT treatments, medications, lost opportunities, etc.\n\nI’m now 31 and am no better. I am ashamed.\n\nThere is some good in my life. I have a daughter and stepdaughter. I have a home. I have a job I enjoy.\n\nBut I can’t live with myself. I hate myself so wholly and entirely. It consumes my every day and night. Food is the enemy and I am the enemy—nothing has yet to convince me otherwise. I wish I could shed my skin and be someone else. I wish I could disappear.\n\nThe depression and anxiety are tiresome. I ache, my teeth are damaged, my hair and nails are dry and brittle. I have no interests, hobbies or dreams. I have a degree in art but I can’t even remember when I did so much as doodle. I can’t focus on books or TV. And, to make it worse, the ECT has erased many valuable memories from my mind.\n\nAll that consumes my mind is thoughts of how to lose weight. Or to not gain weight. Thoughts of cutting off fatty pieces of my body or getting surgery. Taking laxatives or diuretics. What I look like in whatever outfit, what my makeup looks like or hair.\n\nI step on and off the scale 100 times a day. I’ve seen nutritionists, I know all of the correct information. I’ve spoken to doctors. But, to me, they are the irrational ones.\n\nI’m so tired of fighting all the time. Obviously, this isn’t the only negative thing that has happened in my life. I’ve had the bullying, the divorced parents, parent dying, etc. But the disorder is destroying me. It’s my coping mechanism, it is my life. I can’t stand my appearance, I can’t stand not being normal. And no one can (or no one knows how) to help.\n\nTW: Suicidial thoughts.\n\n\n>!I just want to die so badly. I have so many plans. It’s not the dying that scares me. It’s the potential of screwing up and ending up a vegetable. I’m tired of people telling me it gets better. I’m tired of people telling me I’m not trying, to try harder, as if I do nothing to protect myself in a daily basis. I just don’t know how to continue.!<",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g8igxf/request_i_cant_exist_in_this_body_any_longer/",
  "score": 72,
  "num_comments": 3,
  "comments": [
    {
      "id": "fonoged",
      "author": "Nashira46",
      "body": "My heart literally aches reading this. Screw everyone who tells you that you aren’t trying hard enough. I used to tell people who said that to me to go and try hard not to think or breath for a few days, that is what it felt like I was being asked to do. It’s likely that the eating disorder is doing something very important for you right now. In my case protecting me from overwhelming anger and sadness over multiple issues I thought I “should” be able to just get over. Please do not let anyone tell you what you should do or how you should feel. \n\nAs long as you have a reason to stick around, whether it’s your daughters or your fears about a plan going wrong, you are giving yourself a chance for a different future. Right now the way there may not be apparent but I have hope for you that it will. After Ed took over my life for 18 years, I didn’t think my feelings about being in my body would ever change, but they have. I’m sad over the pain and suffering I endured and that you are currently continuing to endure, but if there was hope for me I know there is hope for you. \n\nThank you for speaking your truth. The fact you are able to do that tells me you have everything you need to eventually feel better and move out of this place where you are currently stuck 💗",
      "created_utc": 1587923367.0,
      "score": 26,
      "context": []
    },
    {
      "id": "foosw51",
      "author": "MysticalWateryEye",
      "body": "I wish i could help you, you are trying, we can all tell you are trying. Mental illness and Eating disorders working together like this is so devastating on the rest of you. I am so sorry. Even if you are stuck in these feelings, just remember you do have daughters who need you, no matter how you are. You know the pain of things associated with parents, so i know you are trying. I know you know very well the reasons not to go through with any plans, and i am hoping that you see how important you are, and how important it is to stay here.  Please keep writing, this writing you did, right here, took a lot of courage and strength. There is always hope, even if you can't see it right now.",
      "created_utc": 1587945759.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fopauzr",
      "author": "justforthis78934",
      "body": "I feel like this too. </3",
      "created_utc": 1587956979.0,
      "score": 3,
      "context": []
    }
  ]
}