{
  "id": "g8xug0",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1587981241.0,
  "title": "Request: How might one find feelings before a binge eating crisis?",
  "selftext": " \n\nHow might one find feelings before a binge eating crisis? What does it feel like in the body?\n\nI’m bulimic. My therapist suggested that when I have an eating  craving/hijack, I try explore those feelings for a few seconds (3-12s)  before grounding myself using techniques like the butterfly hug. This is  called desensitization. \n\nProblem is I have trouble finding those feelings. \n\nHere are the scenarios that end up in bulimia crisis’: \n\n1. **Gradual:** I’m bored or restless (usually linked to  procrastinating on tasks I don’t want to do, which are most things in  life) so I get a (sweet) snack to distract myself, then have a bit more,  then a bit more, and before I know it it’s: “I’ve eaten too much,  F-this I might as well go all in an purge after.”  \n \n\n2. **Planned:** I’m out an about and a craving starts to  build up but because of people “watching”or because I won’t able to go  purge I’ll resist, however, I’m itching to get home and be alone to  ‘relief’ myself. By the time I do, I go strait into a crisis.  \n\n3. **Hijack:** When I resist a crisis or had multiple  crisis in the day, I get food craving ‘hijacks’ where I feel like an  addict and there’s nothing stopping me. I can’t think and the one and  only mission is to relief myself asap. \n\nBackground: \n\n\\* I’ve been struggling with eating disorders for 20+ years and thanks to  years of psychoanalysis have a good idea about its roots (lack of  self-actualization, attachment to mother, etc.). \n\n\\* Problem is knowing this isn’t helping me deal with my ED.\n\n\\* That’s probably because I’m numb and don’t feel my feelings. \n\n\\* When I do have feelings they are usually negative and extreme (and  related to situations where my ‘ideal’ identity is threatened or fear of  abandonment from a partner, my father wasn’t in my life), in these  situations I go into food deprivation mode (anorexia). \n\n\\* Life feels like a chore. I don’t know what it’s like to do things for  fun or out of love anymore.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g8xug0/request_how_might_one_find_feelings_before_a/",
  "score": 48,
  "num_comments": 13,
  "comments": [
    {
      "id": "foqfeeo",
      "author": "smallgreenalien",
      "body": "Goodness gracious this was enlightening. I'm having the same experience. It's a bit different for me since I have health issues and eating any solids makes my body react badly. Major digestive issues they couldn't diagnose. Even small amounts of healthy foods that look perfectly normal to others make my body react and cause extreme bloating and discomfort. I eat to self harm sometimes bc I am so frustrated with my body, but it doesn't \"look\" like self harm to anyone else. I've realized the core is mother issues and lack of a father as well (ironically this condition has landed me living with her and even sleeping in her bed bc I don't have my own room) Thankfully she's a different person now but I still have to let go of the trauma she caused me in my earlier years. I need to \"parent\" myself and use self control to heal but my mother was super angry and controlling so I resist/rebel against my own self control mechanisms. Your triggers sound like mine, I just hadn't been able to articulate them to that extent. Thank you for this post. Just reading it has helped me understand myself a lot better. Before a \"binge\" I feel frantic. I don't always throw up but I have to take a lot of laxatives to get things to exit. I suspect \"holding onto\" my feelings and not letting myself feel them has caused that. My whole front torso feels rather disconnected feom me and numb, and I have pressure in my solar plexus area that makes breathing odd and difficult. Like lifting a weight, so even breathing causes major anxiety. It's funny how emotional issues manifest in our physical body symptoms. Yoga has helped me a lot. Cold showers. Breathing exercises. Being out in nature and getting sun. Trying to express creativity in whatever way I can, even if I don't \"enjoy\" it or don't feel like it. I can't draw well so I've been making collages. Juicing has helped me stay alive as well. There's something called \"rapé\" (pronounced \"hapay\") which is a tribal medicine and it is very grounding and has saved my life. I'm still working on feeling my feelings. If I can cry I usually feel relief afterward. I feel clarity for a bit instead of being foggy and anxious/irritable/numb. I just want to feel like myself but like you, when I do feel it is usually negative and scary af. I've had panic attacks where I almost passed out. I think my soul is having trouble staying in this body bc I have been so miserable (I'm rather spiritual, hence my language). People report having out of body experiences during particularly traumatic situations and that's what it felt like was going to happen. I somehow held on and hyperventilated until the anxiety meds kicked in. Anxiety meds have helped me TONS to think more clearly and slow my brain down. I have to have a plan though so I don't sabotage myself. They make me feel rather \"normal\" mentally and emotionally so it's easy to just go eat something I immediately regret because my body still reacts the same. My family has to hide food and it has been a huge strain on them in so many ways. I've been watching vids about multiple personality disorder and I don't think I have it, but I kind of identify with the dynamic. It feels like there are two sides of me fighting for control. One is a perfectionist (thanks mom) and the other wants to self sabotage out of pain (it finds comfort in self destruction somehow). Food offers a few minutes of pleasure I can't find elsewhere, bc like you, I don't find joy in anything or \"feel\" love. I'm trying so hard to balance between them and find a middle ground. I miss \"me\". \"Me\" was a cool person.\nIf I think of anything else I will post again. Sorry to be so long winded. Keep going. It's all we can do. \nOh yeah, it also helps me to make gratitude lists and watch videos of people who overcame seemingly impossible situations. People who have lost limbs and shit and still actualized themselves. It makes me feel that if they can do it, so can I. After all, I still have my arms and legs!!!\nAnyway, ❤🙏💪.",
      "created_utc": 1587992257.0,
      "score": 7,
      "context": []
    },
    {
      "id": "for59yw",
      "author": "RosaceousPueblo",
      "body": "I definitely know exactly where you are coming from. I find it tough to pin point my exact feelings when I binge too. Sometimes it’s so random and such a strong impulse that I can’t explain what happened. I think a lot people who struggle with bulimia disassociate while binging, so it’s probably very hard to pinpoint the emotions. Disassociation is a coping mechanism, so there definitely are major emotions lying underneath. I also have issues with my mom that have lead me to cope with my bulimia. A lot of my issues stem from my difficult relationship with my mom and my childhood. It’s hard to accept these things and move on without using self harming behaviors like bulimia to cope. I also have pretty bad anxiety and that plays into my binging sometimes. Then sometimes when I obsess over calories and restrict for too long that also causes me to binge. There’s so many factors, but I know the main one is me not being able to confront my own emotional issues head on. It’s difficult, but I’m going to try to be more present before a binge and possibly try to write my emotions out to deter it. Thank you for sharing your thoughts! It was interesting to read.",
      "created_utc": 1588006409.0,
      "score": 3,
      "context": []
    },
    {
      "id": "forkzp3",
      "author": "indecision-king",
      "body": "I'm so glad you're getting the help you need and working on this! You deserve a life that is fun and doesn't feel like a chore. I know what it's like for life to revolve entirely around bingeing and it's so draining.\n\nSince you said that when you do notice feelings, your feelings are negative and extreme, my guess is you're kinda like me and if feelings are on an intensity scale of 1-10, you don't even notice they're there until an 8, 9, even 10. But they are there wayyyy before that and the way to start noticing them earlier is mindfulness. Mindfulness is something you need to practice, not just something you use when you're about to hit crisis. Could you set aside some time every morning, midday, and night to check in with yourself? Just sitting quietly, no distractions, and really ask yourself: what am I feeling? What am I thinking? What are my body's sensations?\n\nI've also found the app RiseUp very helpful this because when you write down what you ate (its not like mfp or anything, doesn't log calories, it's up to you how detailed you log) it gives you a list of emotions and ED behaviors to check off and a space to journal. I find it helps me be aware of what I am feeling before and after I eat and noticing the urges I have. And the emotion list is nice because it's easier to know what you're feeling if you look at a list.\n\nEdit: it's also nice because sometimes when I write down the urges, they're no longer stuck in my head and they have less power. I think sometimes the feelings just need to get out, and my brain doesn't seem to care much if they get out on paper or in action, as long as they're out.\n\nAnyway, I think in general what you're needing is some mindfulness practice. It's a practice, by the way, it's really hard to get good at. It sounds like you have a lot of awareness about your past, but mindfulness will bring you awareness about your present. Try googling \"mindfulness dbt\" or \"mindfulness cbt\" to find specifics about it.",
      "created_utc": 1588013997.0,
      "score": 3,
      "context": []
    },
    {
      "id": "foqdnfz",
      "author": "abzoni910",
      "body": "So I am not a therapist or anything, but from what I have learned in studying mindfulness, it is totally normal for some people to struggle with feeling feelings inside the body. As you say, there can be numbness that occurs. I might try to clarify with your psych what they mean exactly, but it sounds like they are suggesting to simply “check in” with yourself. To just pause and see what’s there. It sounds like what you are noticing is that there is a numbness. Perhaps you don’t need to find anything else right now? Maybe feelings will be revealed with time. Be well.",
      "created_utc": 1587990993.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fos5js0",
      "author": "pukie-pie",
      "body": "oh my god. i just read this and it resonated so much with me. from the three different types of crises to the difficulties in enjoying life, dominance of negative feelings/emotions spurring starvation etc. \n\ni quite recently came to realise my bulimia is a form of extreme escapism/dissociation from reality, fuelled by small day to day inconveniences (and anorexia a similar but slower, more insidious form usually rearing its head when i have some sort of deep seated dissatisfaction in my life). \n\nsorry i don’t have much else useful to say but as a sufferer of an eating disorder for 14 years now it’s rare that i read such a comprehensive and insightful summary of my own psychological issues.",
      "created_utc": 1588024364.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fos6dw8",
      "author": "None",
      "body": "Im drunk and don't know what to say rn. Bzt your post is 100% me. I hope we'll get through this one day",
      "created_utc": 1588024792.0,
      "score": 2,
      "context": []
    },
    {
      "id": "foscwrx",
      "author": "ACatNamedLuna",
      "body": "I kinda understand what you’re saying because I remember talking about this with my therapist. I couldn’t place ANY feels related to be ED... mostly because I felt like my ED replaced most of my feelings. I was completely distanced from it. All I felt was pure determination. Most of my instances were like your scenario two, so I would have this planned moment where I could finally eat after not eating for so long and I needed exactly the foods I wanted and needed to be alone for a certain amount of time and if it didn’t all go to plan (friends came over unannounced, the food I was planning to get wasn’t available) I would get SO anxious. I never could connect with stress, anger, loneliness, etc. because I was so focused they didn’t register with me. Mostly I just felt pure determination and almost desperation to follow through with the perfectly thought out plan I had somehow gotten into my head. That just describes my experience.",
      "created_utc": 1588028256.0,
      "score": 2,
      "context": []
    },
    {
      "id": "foqceta",
      "author": "happythoughtsnlove",
      "body": "Hi! I have been struggling with this for 5 years now. My therapist says that my ed is also because of issues with my mother. I was wondering if you could tell me a little bit of your experience with that? Sometimes I wonder if it is really because of that",
      "created_utc": 1587990026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "foryubp",
      "author": "updown27",
      "body": "It sounds like you are on the right track. When you are finding your feelings, you don’t necessarily have to be finding the root cause of your feelings - save that for work with your therapist. Just try to put a label on what you are feeling - anxious? Scared? Lonely? Abandoned? Desperate? Unsure? Make a note of these and your therapist can help you trace those feelings back to their cause. Ultimately, understanding the cause your ED behavior doesn’t magically make it go away or even make the urges easier to overcome, but it can help guide you to which methods of self-soothing and prevention might help you more than other.",
      "created_utc": 1588020903.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fot98an",
      "author": "annielovesbacon",
      "body": "I can break my binges up in those same three categories (I’d never seen it spelled out like that before)! Some of it i think is addiction — it’s a rote thing, muscle memory to keep eating once you’ve begun. \n\nI had to begin by identifying my feelings after — I was aware enough to stop the binge, but afterward I tried to reflect on what I was feeling. Sometimes I was completely dissociated and I have to figure out what made me dissociate (which is really hard not gonna lie). But sometimes I can identify it. For example, I often feel shame when eating around others (“am I eating too much/too little? are they judging me? they can all eat ‘normal’ and I can’t”) and i get embarrassed and ashamed. As soon as I’m alone I cope with the shame by bingeing. \n\nIt’s complicated and, as you clearly know, a million times easier said than done. I struggle with it every day but I am seeing progress since my therapist suggested this approach as well :)",
      "created_utc": 1588047626.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fotvugn",
      "author": "None",
      "body": "Thanks everyone for your kind words, useful advice, and touched that it may have helped some of you gain insight (I'm the author of this post).\n\nIf it can help, here’s my current morning routine to try be more in touch with myself:\n\n* **Breathe** (to activate the parasympathetic nervous system, i.e. calm oneself): 4s breath in, 7s hold, 8s out, do this 4 times\n* **Mindful stretching and/or yoga** for 10-30 min\n* **Meditation** 10 min (I use the Waking up app, there’s a great 50 day learning to mediate course plus tons of content)\n* **Cold shower** (Wim Hof method)\n* **Coffee with “morning pages”** where I have a conversation with my brain for 25 min, it generally yields interesting insights (inspired from [this podcast](https://howtofail.podbean.com/e/how-to-fail-m-gawdat-c19/))\n\nSometimes I don’t have time to do it all and that’s ok, will shorten parts and skip the part after the shower. Better done than perfect :).\n\nDue to my lack of progress with classic therapy, I’m currently undergoing psychedelic-assisted therapy (legally). Will continue to report back here what I learn about finding one’s feelings. As for insights, I’m sharing these in a [blog](https://ayanha.substack.com/) as there are just so many!",
      "created_utc": 1588067956.0,
      "score": 1,
      "context": []
    },
    {
      "id": "foqpwie",
      "author": "unicornarealive",
      "body": "Not OP but my therapist said the same. My trigger moment was my mother telling my i got fat (gained a bunch of weight during my gap year.). I felt like i wasn't worth my mother's affection anymore. I wanted to be and look perfect for her. Growing up she would often compliment me on my body. Now that was gone. Since she was constantly dieting and worried about her own weight, being thin has always been important to her.\n  \nAlso growing up my mum struggled with (postpartum) depression and was quite overwhelmed with raising me. Since my dad worked a lot I would spend a lot of time by myself (I'm an only child). I remember feeling lonely and sort of empty since I can think, even though I had plenty of friends in school or in the neighborhood. We never really had a healthy routine/structure at home. I had to play mostly by myself, she couldn't really help me with school, she rarely tried to teach me new skills.\n  \nMy bulimia was something that was always there for me. I love my mom, she's the person I trust most. She tried her best, she loves me and genuinely tried to help me with my ED. But during recovery she would also put a lot of pressure on me and had certain expectations I couldn't fulfill. I think I grew up without my mum being attuned to me and my needs. She hasn't always been a source of comfort when I was stressed or hurt. I never learned how to cope or self-regulate in a healthy matter.",
      "created_utc": 1587998650.0,
      "score": 3,
      "context": [
        {
          "id": "foqceta",
          "author": "happythoughtsnlove",
          "body": "Hi! I have been struggling with this for 5 years now. My therapist says that my ed is also because of issues with my mother. I was wondering if you could tell me a little bit of your experience with that? Sometimes I wonder if it is really because of that",
          "created_utc": 1587990026.0
        }
      ]
    },
    {
      "id": "fotxoi6",
      "author": "None",
      "body": "Everyone's issues are unique to their story so yours will likely differ from mine but here are two books that I found useful:\n\n* [\"Conquering Shame and Codependency: 8 Steps to Freeing the True You\" by Darlene Lancer](https://www.goodreads.com/book/show/18406569-conquering-shame-and-codependency#)\n* [\"The Drama of the Gifted Child: The Search for the True Self\" by Alice Miller](https://www.goodreads.com/book/show/4887.The_Drama_of_the_Gifted_Child?ac=1&from_search=true&qid=AkbAk11yz3&rank=1)\n\nThe TLDR is:\n\n* Codependents have three identities: 1) true self  (usually suppressed or hidden),  2) ideal self, 3) devalued self, which is shaped by their upbringing\n* Parents mirror back to their children what they didn't get in their childhood, the child in return may interpret this through (sometimes suppressed) emotions, which then reflects in their adult life (and which they will also pass to their children leading to inter-generational trauma).\n* Babies learn from their parents facial expressions, it's sort of a \"brain transfer\" from parent to child. So, to a certain extent, we also inherit from a very young age our parents brains.\n* More in [Tim Ferris' podcast interview of Gabor Maté](https://youtu.be/H9B5mYfBPlY).\n\nHow this reflects in my case:\n\n* I have a good (though cold) relationship with mother. She has trouble showing emotions.\n* My mother as a child exhibited many of the same behaviors as I did: thumb sucking, getting bored easily, not having enough loving touch from mother.\n* Because of the latter, my mother tried to give me all the love and touching she could. As a child I was in her arms all the time. Yet I realized the that the only emotion I've ever *felt* from her is anxiety (manifested in her voice).\n* So despite all of my mother's efforts to change things, she wan't able to make me feel  loved.\n* This is also what I saw in my MDMA-assisted therapy session (compassionate use): when I was a baby, my mother loved with all her heart but she couldn't *show* it to me because she didn't know how to.\n* As a result I've had trouble feeling safe and soothed all my life (ref. [this article](https://www.edcatalogue.com/hidden-trauma-eating-disorders/)), which is making it hard for me to have self-confidence and detach from her.",
      "created_utc": 1588069818.0,
      "score": 1,
      "context": [
        {
          "id": "foqceta",
          "author": "happythoughtsnlove",
          "body": "Hi! I have been struggling with this for 5 years now. My therapist says that my ed is also because of issues with my mother. I was wondering if you could tell me a little bit of your experience with that? Sometimes I wonder if it is really because of that",
          "created_utc": 1587990026.0
        }
      ]
    }
  ]
}