{
  "id": "g9jhg2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1588062897.0,
  "title": "Request: How do I stop having \"cheat days\"?",
  "selftext": "I've been calorie counting well for about 1.5 years now until I got inspired by fitness YouTube videos to have \"cheat days\" - absolute WORST idea of my life.\n\nNow, every Saturday is essentially a controlled binge. I would gain kilos, and spend the rest of the week eating EXTREMELY restrictively (sometimes fasting for days) to get rid of this weight, only to do it all again.\n\nI told myself this was fine because people on YouTube did it, and only found the courage recently to admit I had developed some form of an eating disorder.\n\nI've been trying to stop it, but it's difficult to dissociate the feeling of euphoria and freedom with cheat days. The other 6 days of the week I feel depressed, moody, and extremely fatigued. Has anyone experienced this, and how did you overcome it?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/g9jhg2/request_how_do_i_stop_having_cheat_days/",
  "score": 69,
  "num_comments": 17,
  "comments": [
    {
      "id": "fotuk6v",
      "author": "nade683",
      "body": "I really recommend Just Eat It by Laura Thomas, it really helped me break this cycle. Cause unfortunately the only way to stop bingeing is to stop restricting, but thats so scary! But she explains so well about set points and metabolism etc so you can understand why its not scary and why youre not going to gain 600lbs overnight! Feel free to message me if you want to talk about this more! Xx",
      "created_utc": 1588066638.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fou336y",
      "author": "absh_20",
      "body": "Adequate regular meals my friend. I've been there, it takes hard work but it's so very worth it. You'll always remember that pain and look back knowing how far you've come. It gets better",
      "created_utc": 1588074813.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fottk9w",
      "author": "miguyah",
      "body": "Try to eat normally for a good week so no restricting no binging, just 3 normally portioned meals with some treats. I’ve found when I go through phases of restricting and not losing any weight this helps bring my body back to normal and then I start losing weight again. It also stops you thinking you have to eat every “bad” food in less than a day because you have to be super strict the following days. This way you space it out, and can still lose weight in a healthy manner.",
      "created_utc": 1588065627.0,
      "score": 15,
      "context": []
    },
    {
      "id": "foup2xk",
      "author": "nourished-soul",
      "body": "I used to binge and restrict and my moods were EVERYWHERE, it also didn't help that my binges were emotionally triggered in the first place so it was kind of a double whammy. For me creating a healthy relationship with food was one part of it, finding foods that fueled my body and helped balance my hormones and energy levels. Another part was to face my emotions and work through them rather than eat them away. Have you thought of working with someone to help guide you through everything?",
      "created_utc": 1588088034.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fouihth",
      "author": "houston_veronica",
      "body": "The euphoria is truly a high, stemming from the delayed gratification cycle.  The most helpful thing you can do is eat regularly and often, and properly for optimal nutrition. \n\nSeeing an RD - even \"Virtually\"/online - will help you so much. S/he can give you advice as to what is truly appropriate for your activity level and needs.\n\nThen - stick to the plan. Whether you do 3 squares or 6 mini's, or any other iteration - don't deprive yourself any more. This will ruin the high of a \"cheat\" day idea, even if it takes some trial/error.\n\nYour body has a natural set point that it loves to be, and wherever that is, it will become easy to maintain and stay healthy there. That does NOT mean \"overweight\" by any stretch. Bloating and temporary swelling is normal while re-feeding, but that will definitely end.  Stay strong!",
      "created_utc": 1588084681.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fotvjtl",
      "author": "Korean__Princess",
      "body": "> I've been trying to stop it, but it's difficult to dissociate the feeling of euphoria and freedom with cheat days. \n\nYou've pretty much told yourself how to fix it. Be less restrictive and try to work out a long term, healthy lifestyle. \n\nDoing all this restriction is only hurting yourself and causing you a lot of unnecessary stress, which leads to the eating disorder.\n\nDon't think of cheat days, think varied eating instead. \n\nTry to eat whole foods, find healthy alternative snacks. Being on keto my go to snacks are things such as meats, cheese, celery with some healthy dipping etc. \n\nThen from time to time, have that unhealthy snack or whatever, we are humans after all, but don't feel guilty about it, just don't do it all the time!",
      "created_utc": 1588067652.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fovawzl",
      "author": "fudgemonkies",
      "body": "I've found it helpful to restrict less intensely, in general, if I'm trying to get to a healthier weight. I also count calories and try not to cut more than a couple hundred (max 400) a day - it's slower, but the food cravings are less intense. I'll also find foods I can eat in large quantities without gaining weight to satisfy the craving to be full or eat for a long time. For example, very large salads with low calorie dressing and broccoli with sriracha are two of my binge-replacement foods/meals.",
      "created_utc": 1588098270.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fovbzrg",
      "author": "None",
      "body": "I'm stuck in that pattern too): it's terrible I'm sorry. Yup that's an ED behavior",
      "created_utc": 1588098778.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fowsczj",
      "author": "stopitma",
      "body": "Like others have said, you’ve got to stop restricting. You’ll probably eat a lot  the first few days as your body adjusts to having food available, and that’s okay. Try to eat on a schedule with three meals and 2-3 snacks. Eventually your body will adjust to the schedule and you won’t feel the need to binge anymore, and you’ll have so much more energy. That’s what I did when I self recovered from my last relapse.\n\nThis is a source I found that talks more about it: [here](https://www.verywellmind.com/regular-eating-for-eating-disorder-recovery-4109419)",
      "created_utc": 1588126112.0,
      "score": 2,
      "context": []
    },
    {
      "id": "foxxjkz",
      "author": "bigfatgorilla00",
      "body": "Omgggg I can not stress how much I hate the “cheat day” concept!!!! Its SO unhealthy!!!\nI think the first step that you should take is stop the black and white thinking. There are no such thing as bad foods. Food is food. Some are just more nutritional then others but that’s pretty much it. \n\nI had a BED myself and what really helped me is the book “Overcoming Binge Eating” by dr. Christopher G Fairburn and “Potatoes not Prozac” by Kathleen Desmaisons. \n\nThe book overcoming binge eating is one that my therapist uses in her practice. Its a book that explains everything about binge eating disorders and it really helps you to understand your thoughts better. With all the information it gives it contains a 5 or 6 (can’t remember) step plan that will make you stop binge eating.\nThe steps are to start journaling, write down how the time you eat, what you eat, how you feel eating it and where you are eating it. This allows you to see patterns as in why you are binge eating and what triggers you to do it. You will start to notice that some foods, places, thoughts or events trigger a binge. \nThe other step in the book is eating every 2 hours, i know its hard to be eating that much out of no where but it will really help to go your false hunger go away.  Later in the book they will teach you how to stop being afraid of gaining weight, why you’re not gaining weight during this process and how to stop looking at yourself in such negative ways and how to stop “body checking” and they will teach you how to start adding in you “fear” foods again. And last but not least, ones you learned how to feel an upcoming binge, you can start doing other things to replace your binge so the thoughts will go away, such as calling a friend, working out, watch a movie, pick up any activity that you LIKE doing instead of binging. \n\nIts a bit much to explain but I would defenitly recommend it! Potatoes and Prozac is more a about why your body CAN be addictive to sugar. I think if your considering doing this plan it’s best to cut out sugar for a while. When I stopped adding in sugar + eating regularly the bingeing stopped immedenitly. With “no sugar” I don’t mean it in a restrictive way. For me sugar was just a big trigger and I’d rather have lets say a pizza or some chips in my eating.\n\nWith that said, I would also recommend you to go to a therapist so they can help you with your journaling, reflecting and with this plan in general. Eating disorders are hard to overcome by yourself. I told this myself for 4 months until at some point I just gave up, I couldn’t do it. Now I’m at a therapist and I’ve made huge steps! I started with being diagnosed with anorexia, with later lead me on to having a binge eating disorder (some would call it extreme hunger), and now its safe to say that I’m no where near where I was! I still struggle with the black and white thinking sometimes but i barely binge anymore and I’m happy with what I eat.\n\nIf you have any questions or just wanna talk, you’re not alone and you can always message me if you like :) \n\nGoodluck! I’m 100% sure you will overcome this 💞",
      "created_utc": 1588159631.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fotsadp",
      "author": "Nuupperi",
      "body": "Maybe you can try to stop watching those kind of videos. Good luck <3",
      "created_utc": 1588064327.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fou2voe",
      "author": "sapolica",
      "body": "Start by cutting back to a cheat meal, then scale back to a cheat snack, and then take the cheat out of the mentality. Now it's no longer a cheat and it fits into your healthy lifestyle, and you can have it whenever you want! Easier said than done but it might work?",
      "created_utc": 1588074638.0,
      "score": 1,
      "context": []
    },
    {
      "id": "foue6h8",
      "author": "katsnackshackysacks",
      "body": "I really can not think of a worse place to get diet advice than rando fitness influencers on YouTube. Step 1: stop restricting during the week. Step 2: stop binging on Saturday.\n\nTo be sure, you will probably have some extreme urges to binge, even after you stop restricting. It might get worse before it gets better. I struggled with BED for years as a sort of eating disorder fallout after many previous years of restricting. I read “brain over binge” which helped a lot.",
      "created_utc": 1588082343.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fou1bvp",
      "author": "MindGoesBlank69",
      "body": "It's entirely based on what works for you and how disordered your thoughts are. Which can mean a lot of trial and error. For me, eating one meal a day has helped, but while some folks can do this with a healthy mindset, I still can't. All this does is help keep those habits at bay. Which, at it's root seems to be based around having structure. I don't recommend this if you're not in a good place mentally with food. I do say this however because it can sometimes be better to eat on a schedule rather than to eat when hungry (for EDs). I guess that's why meal plans work but I've never been able to follow one or crate one for myself personally. If you can though, it is most ideal when dealing with these thoughts and habits.",
      "created_utc": 1588073299.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fouqeke",
      "author": "catastrophichysteria",
      "body": "This. Everything in moderation, INCLUDING moderation. We are allowed to indulge every once in a while.",
      "created_utc": 1588088671.0,
      "score": 4,
      "context": [
        {
          "id": "fotvjtl",
          "author": "Korean__Princess",
          "body": "> I've been trying to stop it, but it's difficult to dissociate the feeling of euphoria and freedom with cheat days. \n\nYou've pretty much told yourself how to fix it. Be less restrictive and try to work out a long term, healthy lifestyle. \n\nDoing all this restriction is only hurting yourself and causing you a lot of unnecessary stress, which leads to the eating disorder.\n\nDon't think of cheat days, think varied eating instead. \n\nTry to eat whole foods, find healthy alternative snacks. Being on keto my go to snacks are things such as meats, cheese, celery with some healthy dipping etc. \n\nThen from time to time, have that unhealthy snack or whatever, we are humans after all, but don't feel guilty about it, just don't do it all the time!",
          "created_utc": 1588067652.0
        }
      ]
    },
    {
      "id": "fou1p9f",
      "author": "MindGoesBlank69",
      "body": "Tbh this really gets me to thinking I should try again. I feel like taking a couple minuets from each morning of or the evening before a new day to write down when and what you'll eat, but focusing more on portion and energy needs rather than calories, provided feeling okay to do so, is a practical solution towards some normalcy.",
      "created_utc": 1588073626.0,
      "score": 1,
      "context": [
        {
          "id": "fou1bvp",
          "author": "MindGoesBlank69",
          "body": "It's entirely based on what works for you and how disordered your thoughts are. Which can mean a lot of trial and error. For me, eating one meal a day has helped, but while some folks can do this with a healthy mindset, I still can't. All this does is help keep those habits at bay. Which, at it's root seems to be based around having structure. I don't recommend this if you're not in a good place mentally with food. I do say this however because it can sometimes be better to eat on a schedule rather than to eat when hungry (for EDs). I guess that's why meal plans work but I've never been able to follow one or crate one for myself personally. If you can though, it is most ideal when dealing with these thoughts and habits.",
          "created_utc": 1588073299.0
        }
      ]
    }
  ]
}