{
  "id": "gb2dwv",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1588274781.0,
  "title": "Request: Is anyone else struggling with 'positive' posts about eating whilst in quarantine?",
  "selftext": "Sorry if something like this has already been posted.\n\nTDLR: I know how to control my bulimia in quarantine but people posting on social media about 'body positive' things is triggering me.\n\nI've (25F) been suffering with bulimia on and off since I was about 14 years old. I'm able to control it quite well in my normal day-to-day life; I've been vegan for about 6 months which has helped and generally I do a lot of exercise which stops me from feeling guilty about eating. I have been feeling generally good about myself in recent months and haven't felt the need to purge for a while. However, since the UK has been in lockdown and I havent been able to access the gym and play my team sport, so I, like many others I'm sure, have been struggling to prevent myself from binging/purging. \n\nI've tried to manage this by ensuring I do daily exercise, whether that's a run, cycle or just a home work out. I'm also in charge of shopping for myself and my flatmate (who is high risk), so ensure I buy healthy foods and no snacks, I try to eat my meals at specific times so that I don't end up overeating and feeling guilty. Generally speaking, I have my bulimia under control.\n\nHowever, when I'm on social media I keep on seeing people post about how we shouldn't feel guilty for eating or putting on weight whilst we are in lockdown and this just completely triggers me. I know they mean well and are just trying to help, but the thing is no I can't eat what I want and I do feel guilty about putting on weight? They send me into such a spiral of feeling shit and anxious and make me want to eat loads which results in me making myself sick. \n\nHas anyone else experienced anything similar? I know there's not much advice anyone can give, but I just wanted to get it off my chest because I've felt very alone as only my ex knows about my ED and I don't speak to her anymore.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gb2dwv/request_is_anyone_else_struggling_with_positive/",
  "score": 50,
  "num_comments": 10,
  "comments": [
    {
      "id": "fp3pvww",
      "author": "abductions",
      "body": "I'm with you on this. The positivity posts are frustrating to read because my brain translates it to \"permission to binge\" but I Know that I really don't want to do that. I don't need that encouragement or even the excuse of quarantine, you know? I think it's extra frustrating because people without an ED can overeat a little and might indulge here and there but for me I'd become unstoppable.",
      "created_utc": 1588283649.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fp55u58",
      "author": "Lubydub",
      "body": "I have to say, it doesn’t really sound like you have your bulimia ‘under control’. \n\nHaving to exercise everyday to not feel guilt is as much part of the eating disorder as purging. Eating vegan to not feel guilt is as well. \n\nIt sounds like the ED is manifesting in other ways besides purging, and that is why you are triggered and struggling more then you expect to be. \n\nHealing from bulimia is not just about *not purging*. Its not even about having it *under control*. It’s about trusting your body,  \nnot obsessing about food or exercise, truly loving your body regardless of those factors. Its about putting your well being first and taking joy in more fulfilling aspects of life. I know cuz I’m on this journey as well doing this work. \n\nI recommend looking into intuitive eating and really working on self acceptance. I’m not a pro but you probably shouldn’t exercise for a while, and rethink the intention behind being vegan. These are just other methods of control, and damaging authentic recovery. \n\nYou do not need to earn your food and you do not need to live a life with ANY guilt ! No matter what you ate that day or how you worked out.",
      "created_utc": 1588317310.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fp4omop",
      "author": "None",
      "body": "I can totally relate. Ive been struggling with eating disorders since I was 14 and I'm 23 now. I honestly hate seeing those body positive posts too. People on social media make it look like its so easy to eat healthy or eat and not feel guilty. Its important to remember that most people who post stuff like that don't struggle with eating disorders, so things will be easier for them. I see a lot of photos of fit/skinny girls that have a huge pizza or burger, and they try to seem so quirky about it and show how they don't gain any weight no matter what they eat. Its hard not to get triggered when you are on the internet, but just remember that you should do things how you want to do them and don't focus on people trying to spam their positive posts. I know they mean well, but not everyone is able to eat whatever they want without gaining weight. This quarantine is difficult for a lot of people with eating disorders, so don't be too hard on yourself. Good luck!",
      "created_utc": 1588303673.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fp3q55p",
      "author": "samthenotwinchester",
      "body": "Me too, constantly. It’s like they forget that the only eating disorder isn’t anorexia.",
      "created_utc": 1588283781.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fp3n4vc",
      "author": "None",
      "body": "Oh my god I feel the same. Part of me is happy for these people and wanting to participate in the positivity but the other half gets wildly angry. I have been in a bit of a spiral since quarantine is quite triggering and it feels impossible to share in the positivity. I want supportive posts/a support group that is just ANGRY like me. I wish food was the joyful activity it is for me and not something that makes me miserable. \nIdk if that’s what you meant but I think I get it! Anyways good luck <3 !",
      "created_utc": 1588282245.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fp3mb83",
      "author": "lettheworldknow",
      "body": "Same I’m always seeing videos and posts about body positivity and how we should feel OK to eat and nourish our bodies. While I do agree, it just really triggers my bulimia. I feel weird seeing all the comments that are thanking the post and saying that they really needed the message. I just think different people have different triggers",
      "created_utc": 1588281826.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpd054c",
      "author": "None",
      "body": "I can totally relate to how you're feeling. Lockdown is just encouraging people to sit on their sofas all day, snacking on junk with the idea that it's all ok. I am so sick of seeing posts on social media about it too. I can feel myself spiralling into that mindset too, It's hard. I guess the only thing thats comforting at the moment is that this quarantine period won't last forever and that hopefully soon these positivity posts will stop.",
      "created_utc": 1588516947.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fp4510r",
      "author": "None",
      "body": "This. OMG, SO MUCH THIS!  OP, you’re not alone. I relate to this post HARD. \n\nWhenever I see that kind of stuff, my brain does the same thing. It tells me it’s ok to eat what I want, but it’s like as soon as I start eating, I can’t stop and it turns into a binge-tastic free-for-all, and then I feel gross and need to purge. It doesn’t help that right now I’m overweight *because of* my bulimia, so the food guilt is even stronger. \n\nI think the worst for me, though, is the people who talk about body positivity but are super skinny and post “healthy” versions of recipes, like putting tomato sauce on a zucchini and calling it a pizza. It’s like cool, you’re way smaller than me but struggle with thinking YOU look bad and eat an ultra-picky and very low calorie restrictive diet. Nice. How am I supposed to feel about myself when I see that?  \n\nIt’s also so hard not to read the comments where 2/3 of them are people saying that body positivity is promoting an unhealthy weight and lifestyle and criticizing the girl while the rest are people cheering them on.  The conflicting messages get to me. \n\nHonestly, I don’t understand why we can’t just normalize being different shapes and sizes and ethnicities and whatnot without making a big deal about it.  I love it when I see insta accounts of people who do certain sports or hobbies and are just regular looking, regardless of their size. It keeps the focus on the activity instead of on who should or shouldn’t look like what or showing off someone’s body. (Not that “showing off” makes someone a bad person, but we all know it’s triggering.  There’s a huge difference looking at a pic of someone wearing a thong bikini doing a booty pop and sucking in with their hair and makeup all perfect vs. a pic of the same person standing naturally wearing clothing appropriate for the activity with everyday wash and go hair.)",
      "created_utc": 1588291820.0,
      "score": 3,
      "context": [
        {
          "id": "fp3pvww",
          "author": "abductions",
          "body": "I'm with you on this. The positivity posts are frustrating to read because my brain translates it to \"permission to binge\" but I Know that I really don't want to do that. I don't need that encouragement or even the excuse of quarantine, you know? I think it's extra frustrating because people without an ED can overeat a little and might indulge here and there but for me I'd become unstoppable.",
          "created_utc": 1588283649.0
        }
      ]
    },
    {
      "id": "fp5bqpp",
      "author": "apinell",
      "body": "This is exactly right. I hope everyone reads this comment.",
      "created_utc": 1588323418.0,
      "score": 3,
      "context": [
        {
          "id": "fp55u58",
          "author": "Lubydub",
          "body": "I have to say, it doesn’t really sound like you have your bulimia ‘under control’. \n\nHaving to exercise everyday to not feel guilt is as much part of the eating disorder as purging. Eating vegan to not feel guilt is as well. \n\nIt sounds like the ED is manifesting in other ways besides purging, and that is why you are triggered and struggling more then you expect to be. \n\nHealing from bulimia is not just about *not purging*. Its not even about having it *under control*. It’s about trusting your body,  \nnot obsessing about food or exercise, truly loving your body regardless of those factors. Its about putting your well being first and taking joy in more fulfilling aspects of life. I know cuz I’m on this journey as well doing this work. \n\nI recommend looking into intuitive eating and really working on self acceptance. I’m not a pro but you probably shouldn’t exercise for a while, and rethink the intention behind being vegan. These are just other methods of control, and damaging authentic recovery. \n\nYou do not need to earn your food and you do not need to live a life with ANY guilt ! No matter what you ate that day or how you worked out.",
          "created_utc": 1588317310.0
        }
      ]
    },
    {
      "id": "fp3r2rc",
      "author": "not_cinderella",
      "body": "It’s sort of triggering me (still underweight) too because I guess I’m kind of like “well if everyone else is gaining weight I need to PROVE to them it’s still possibly to lose weight while in quarantine and be as healthy as possible!!!” Which is just so so wrong and not what I need right now. People talking about their quarantine weight gain and I’m sort of like “please don’t involve me in this I don’t want to talk about it.”",
      "created_utc": 1588284257.0,
      "score": 8,
      "context": [
        {
          "id": "fp3q55p",
          "author": "samthenotwinchester",
          "body": "Me too, constantly. It’s like they forget that the only eating disorder isn’t anorexia.",
          "created_utc": 1588283781.0
        }
      ]
    }
  ]
}