{
  "id": "gc2i7i",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1588404925.0,
  "title": "Request: I'm struggling and could use some help",
  "selftext": "Hi guys. I’m glad that there is a group like this with people who can relate because sometimes I feel so ashamed and alone. Although I’m sorry that you all are going through this to, it’s comforting to know that there are people in the world that understand.\n\nI’ve had an uncomfortable relationship with my body and food since I was about 12. I then became a vegetarian- I thought vegetarians were skinny. I hid my motivations from my mom. I switched schools when I was 13 and was bullied for having a big nose, but people did comment on how small I was and I guess I clung to that.\n\nAt 13 I started binging and purging. My mom caught me once, and almost physically hurt me, but my brother stopped her and I ran out of the house. The school nurse found out and told my mom that she needed to take me to get help. My mom took me to a center, they said I should do outpatient treatment, and my mom took me to a pizza buffet right after that. And she said to me, you don’t really need help, do you? And I said no, I’ll be fine.\n\nI wish she got me help. I wish she didn’t see it as a stain on her parenting. I struggled in silence for 3 more years and then met a group of people who I felt so comfortable around that I felt like I no longer wanted to be bulimic. I was so happy. I felt accepted. I felt loved. I thought my whole life changed, and it pretty much did.\n\nNow I’m 25. I work in the tattoo industry and from the moment I walked into it, I’ve felt that I needed to be pretty, or hot, or else no one would like me. I feel like everyone in this industry feels the need to act like superstars. I got into this industry because I love art, and wanted to do it forever. I wanted to make art and saw tattooing as the way to go.\n\nBut it has been so hard. I never feel accepted. I always feel too short, to unattractive, to bubbly, to quiet, to soft, not edgy. Too kind.\n\nI’ve been struggling so much lately. I realize that I need help. I need it really really bad. I’m not underweight. I’m just on the border and try to remain there. But it hurts my soul. I have an internal struggle with myself on a weekly basis about whether or not I should just eat what I want, instead of what I think I need.\n\nIt’s a fight. It’s always a fight. And it’s inside of me.\n\nI just wish it was simple. I wish it wasn’t eat something you want and feel guilty, or eat something you think you need, and feel guilty for restricting.\n\nI’ve come to the place where I just feel guilty either way.\n\nI’m tired of feeling like I need to be beautiful. I want to just believe that I am, and have people in my life that love me for me, and don’t care about my outsides. However I fear that most of the people in my life like me for what I look like- who I’ve tried to be. Because I look like them. I even feel like my family would judge me if I gained weight. I feel scared.\n\nIf you read this I appreciate it. I’m just very very lonely right now, and I don’t have anyone who I can truly talk to about this stuff. It’s too heavy I guess.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gc2i7i/request_im_struggling_and_could_use_some_help/",
  "score": 51,
  "num_comments": 9,
  "comments": [
    {
      "id": "fp8wk1l",
      "author": "None",
      "body": "Heey... We have a very similar history.\nI don't work in the tattoo industry, but I still feel like people only like me because of my looks too. Anyway, I can soo imagine your situation tho, because whenever I watch videos about tattoo artists or something, the girls are always tiny with perfect hair and make up. \n\nAnd I'm struggling a lot to hardly stay on the lower range of healthy bmi... Just by gaining 10 pounds I'd be chubby again and lose all the attention from people around me. Still I can't stop binging/purging\n\nNo advice here but you're not alone 😣",
      "created_utc": 1588405488.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fp8wkt3",
      "author": "Takkenwijf87",
      "body": "Huge hug coming your way. You're amazing for telling this and being a tattooartist is hard but you are doing it. Is it possible for you to find a prof to talk to?",
      "created_utc": 1588405509.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fp9h9mn",
      "author": "updown27",
      "body": "I highly recommend getting involved with a local support group, eating disorder program, or eating disorder specialized therapist. It’s very possible you’ve created a world around you that values appearance as much as you do. As you overcome these internalized judgments the world you have created may change and that’s ok. Or maybe you will be able to bring a new age of acceptance and love to your community. Or maybe you will find that you are loved and accepted for your skill, talent, and compassion. Guilt is a major topic of discussion in recovery treatment. That means learning to talk yourself out of guilt no matter what is triggering it. You will learn to recognize your thoughts and counter them in a logical and compassionate way. There’s a lot of disordered thinking that goes into disordered eating and challenging those thoughts can help us make huge strides in caring for ourselves. The more you pay attention to your thoughts the more you’ll be able to recognize how absolutely ridiculous the way you talk to yourself is. Last night I caught a thought - “I can’t do anything right.” And immediately stopped and said “hey! Who TF said that? How dare you talk to me that way.” And then listed all the things I did right that day. Two years ago I wouldn’t even have noticed I thought that and would have just felt shitty and incompetent without knowing why. I hope this helps. A happier healthier life exists within you!",
      "created_utc": 1588426155.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fp9adco",
      "author": "eggomymeggo730",
      "body": "Yo my dude, I feel this. I'm not a tattoo artist, im an engineer but I feel like I have to be thin, smart, on top of everything all the time, but also be cool so people will think I'm alright. It's exhausting and it never ends. \n\nI honestly recommend finding a confidant, whether it's a human in real life, a therapist, a dog, whatever works. You need to get this stuff off your chest. You're of course, always safe to post here as well. \n\nI hope you find some peace and happiness.",
      "created_utc": 1588420252.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fp9c10i",
      "author": "heathbar1318",
      "body": "I’m sorry that you’re struggling right now, but the fact that you’re able to acknowledge that you need help is a great first step. If you need someone to talk through options with, feel free to message me :) work pressure is so hard and the constant internal struggle doesn’t make it easy, but I wish you the best",
      "created_utc": 1588421837.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fp9cjnb",
      "author": "abzoni910",
      "body": "Thank you for sharing your story. It can be so scary and vulnerable to do and I honor that! I don’t have advice really but I was so touched by your story and I just want you to know that I’m thinking of you. \nI’m in my early 30s and just now coming to terms with life long disordered eating and distorted body image. It’s so difficult especially with pressure from family, society, coworkers, spouse, etc. I found a therapist whom I trust and have been working through these issues among others and that has been helpful for me. \nTake care 💜",
      "created_utc": 1588422306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpa1995",
      "author": "schloooooo",
      "body": "Wow, very similar story here as well! I wouldn't beat yourself up about not having sought help earlier; I'm 25 now and I just started getting help for it less than a year ago, despite dealing with severe body dysmorphia and binge-eating disorder. I actually lucked out and found a therapist who helped me through a lot of the pain, and I can assure you, it does get better. That said, not everyone is able to find an affordable therapist, but it truly is worth the money. One of the big things I learned is that for you to have a good relationship with food, you must have a good relationship with yourself, and as cliche as that sounds, it's true. In the meantime, something that really helped is unfollowing social media accounts that use fat-phobic language, praise a certain body type, or advance a need to diet/exercise a certain way. It's a small step, but it goes a long way. It's going to take a long time to get better, and there will be a lot of lows, but the highs (and you especially) are worth fighting for. Rooting for you!!",
      "created_utc": 1588438774.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpah099",
      "author": "None",
      "body": "I’m sorry you’re struggling but am glad you want help. My story is sort of similar, my ED began when I was 12, and no one noticed it until I was 15. The thing is, I didn’t want anyone to notice, let alone help. My parents beat themselves up over not being aware, but in reality it was my ED fighting as hard as it could to remain hidden. I’m “recovering” (really functioning and maintaining at a low weight) from anorexia binge/purge subtype. I relate to the need to be “perfect” or beautiful in your profession. For me, I don’t have one yet so it’s ballet, art, and uni that I strive to be as physically appealing as possible, to attain my impossible standards, while also trying to have a great personality to please others. The physical aspect is for myself, the personality more for others. We all want to be appealing, but often our self perceptions and standards are unrealistic. Having horrible self esteem and body dismorphia might mean while you find yourself unappealing, another person might view you very positively, appearance and personality in all.\n\nIt’s true, birds of a feather flock together most commonly. However, if your friends are actually friends, that is, they support you and love you no matter what you look like, I wouldn’t be afraid of rejection. Put your health, mental and physical, first. Remember change is uncomfortable. Perhaps let them know your struggle only if you feel comfortable. The internet is great for connecting to like minded people, but what we all need is real human connection. Sending hugs <3",
      "created_utc": 1588447986.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpbazjw",
      "author": "None",
      "body": "PM me, I am close to you in age with a VERY similar story. I'd love to be buddies and help you feel less alone :)",
      "created_utc": 1588465934.0,
      "score": 1,
      "context": []
    }
  ]
}