{
  "id": "gco3on",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1588500176.0,
  "title": "Request: I think I’m in denial about having an eating disorder",
  "selftext": "After 3 years of restricting/binging and over a year of calorie counting I’ve finally reached a goal weight and feel my body is better looking and I’m more comfortable with myself...so why can’t i stop restricting myself? \n\nI’m too afraid to “let myself go” and eat very little calories and work out constantly. When I eat too much (or even just a normal amount) I find that I walk or exercise until I burn it off and at the end of the day my calories in are WAY lower than my calories out especially since I told myself I’m in the maintenance stage. Reading the posts here made me realize that an eating disorder dosent just mean purging or very extreme measures but some signals can be undetected.. I just want to be able to get over this so I can stay healthy.. Additionally, I haven’t had my period in 8 months (I know..see a doctor..my mom won’t take me) and I know it’s because of how little I eat.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gco3on/request_i_think_im_in_denial_about_having_an/",
  "score": 53,
  "num_comments": 8,
  "comments": [
    {
      "id": "fpci4qk",
      "author": "DogBreathologist",
      "body": "Unfortunately it’s a very real problem when losing weight, you get so stuck into the pattern of losing and keeping control that when you finally get your “goal” weight it can be almost impossible to let go in fear of returning to your old weight. I’m not sure what country you’re in but in Australia I’m fairly certain you can get at least a few psychiatrists appointments for free through Medicare ect, and this honestly sounds like something that would be good for you to talk to a professional who has experience with eating disorders about. There are even free mobile numbers and online forums and websites like the butterfly foundation that are really good that can help you, especially in the early stages when your not really sure what to do. Even doing some research into it to try and identify what you have can be helpful because sometimes if you have a name for it, it’s not so scary and you can start to understand how to tackle it. Maybe once you’ve done a little research try sitting your mum or dad down again and really explain what’s going on with you and how serious an eating disorder is. Please stay strong and keep going, you’ve already made a massive step in recognising that you might have a problem, and you seem to want to get help which is another massive step, and don’t forget that!",
      "created_utc": 1588501378.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fpcwhm9",
      "author": "VampireDetective",
      "body": "1. Eating disorders are not about the food we eat or don’t eat or what we weigh or look like, it’s about how much mental energy you put thinking about food (what you want to eat, can’t eat, shouldn’t eat but did, when you’re going to eat next, etc) and the anxiety around it\n2. It’s a mental illness and can’t be fixed by something physical, because, again, it’s not about the food or the weight\n3. People without eating disorders stop their dieting when they reach their target weight, we do not. We keep going until we die or get help\n4.  If you could, you would stop restricting and binging (because you know it causes you harm and there are tons of other things you could spend your time and energy on) but you can’t because. you. have. an. eating disorder.\n\nYou deserve to be happy and healthy. You deserve to get help so you can beat this. YOU DESERVE IT.",
      "created_utc": 1588514507.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fpd00pz",
      "author": "kellis744",
      "body": "I am not sure how old you are, but I had this issue in highschool. I was underweight for about 3 years and lost my period. I went to the doctor during this time and all tests came back fine, doctor said I just needed to gain weight. \n\nLong story short, my period did not come back on it's own with the weight gain. I think because i was 16 and still developing i screwed up my hormones. Later, at 28 I was having 0-1 periods per year and needed hormone therapy to get it back and become pregnant. It worked but it was expensive (abt $6000 total).\n\nI'm not trying to scare you, just wanted to share because I would have done things differently if I had known then how difficult it would be.",
      "created_utc": 1588516868.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fpcsbg0",
      "author": "None",
      "body": "You remind me of myself. A few years ago I lost a big amount of weight within a short space of time. Since then I am obsessed with controlling my calorie intake. I've restricted, I've binged and I've purged, in the form of over exercise and vomiting/laxatives. I also lost my period when I was at my lightest weight. I relate to you. Losing weight is great until you hit maintenance and can afford to eat a little bit more. Weight loss is such a mental battle, battling with your thoughts about what you think you can or can't eat. I know it's hard but please look after yourself. Once you begin eating a bit more your period will eventually come back. However please go see a doctor. You mentioned your mum won't take you, is there anyway you have another adult who can? or go alone? Go and talk to somebody professional. Please. Eating disorders can kill you. Yes that's pretty drastic but it's a very slippery slope.",
      "created_utc": 1588511308.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fpcveyy",
      "author": "Friendly-Introvert",
      "body": "I feel the exact same way, i havent lost my period yet and Im trying to slowly let myself eat without counting but i only feel like Im ”allowed to” if Im with friends.",
      "created_utc": 1588513728.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpfjgv3",
      "author": "luxeasfuck",
      "body": "I listen to a podcast by Dr. Stefani Reinold called “It’s Not About Food” and this specific episode was talking about dieting culture and how it is NOT normal for humans to be in this type of culture. Calorie counting, restricting, etc. She mentioned something about how dieting causes us to gain eating disorders- people get obsessive with calorie counting and restricting themselves to the point where it affects and impairs their daily lifestyle.\n\nYou should be proud at your progress and how far you’ve come along. We’re all rooting for you 💛",
      "created_utc": 1588573124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpoyfes",
      "author": "cucumberMELON123",
      "body": "I’m following your post as I have struggled with ED for a long time. Periods of doing totally fine (besides feeling disgusted with myself and guilty about eating) and periods of complete disaster. I did the whole30 diet one time for 6+months and lost about about 20 lbs (I was 135 lbs and went down to 115) until I passed out at school from lack of nutrients.  In college for about 1.5 years I ate laxatives every single day and made myself sick... I eventually knew if I didn’t stop this I would die so I eventually did stop. “Recovered”. I feel like I let myself go this past 1.5 years and I weigh about 150 lbs. I’m trying to lose weight without going overboard as I have in the past and I’m struggling with it. It’s hard because I can fall back right into an ED so fast if I start obsessing. I’m also under so much stress right now. I feel like when I’m stressed one thing I can control is eating. I’d appreciate any advice over here too.",
      "created_utc": 1588792809.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fq544ii",
      "author": "maggiemoo1122",
      "body": "Eating disorders are a slippery slope. Before you know it your way below your goal weight, but you lack the knowledge and healthy relationship with food/exercise to recover as efficiently as possible. \n\n1)The first step is you need to see a doctor especially if you lost your period. The longer you lack a period leads to infertility. You could have other underlying issues that need to be assessed such as low heart rate, freezing, hair loss, weakness. If your family can't afford to go to the doctors, Google free eating disorder resources in your area. I highly recommend the YouTube channel This Girl Audra; she discuss a variety of topics surrounding eating disorders. \n\n2) I recommend getting a dietitian. You will need to put a plan in place. You need to learn how to nourish your body. Not having a period is an indication that you are in a fight or flight state, and you will need to eat according to rebalance your hormones. \n\n\\- one thing I was reluctant to give up in my recovery was exercise. However, it just prolonged my recovery. When I gave up exercising, I got my period 3 months later. \n\n3) Eating disorders are mental. I went to one on one therapy every week. \n\n4) The last thing spiritual. I had a feeling journal, attended church, and hangout with friends & family. Do things that lift your mood. \n\nRemember the only thing constant is change. I'm glad you're taking action before things get worse. <3",
      "created_utc": 1589091909.0,
      "score": 1,
      "context": []
    }
  ]
}