{
  "id": "gd8qdd",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1588586078.0,
  "title": "Request: How do you get healthier without falling into old ED habits?",
  "selftext": "Trigger warning for exercise bulimia and probably more things so maybe don't read this if you're struggling right now\nI've been overweight for most of my life, and I've had an ED for more than 6 years now. Over the past year, I've tried to fix a lot of my dangerous behaviors (binging and purging with exercise, calorie counting, IF, etc.) and I've gotten to a place where I have a much healthier relationship with food and exercise. I was even at the point where I would almost call myself recovered. But since we've been staying home, I can't go to the gym or walk as much as I'd like to, so I decided to do a home workout challenge that would keep me active every day. And I've been losing weight. And even though I know it's in a healthy way (I'm not starving myself now, I'm not restricting, I'm not using exercise as a punishment for eating), it's still really hard not to fall into the same mindsets I used to have.\nI started weighing myself every day, then multiple times a day, and every now and I would take my measurements, and it felt really good when the numbers were down. But sometimes they weren't, and even though I would tell myself that weight fluctuates and the scale saying that I'm a couple pounds higher than I was yesterday morning doesn't matter and what matters is being active and healthy, it would still make me feel terrible and that old part of my mind would tell me to exercise more to make up for it, which I know is wrong. So I decided the scale is not part of my recovery, and I hid it away and haven't looked at it for two days now. However, I still do want to lose weight as I am overweight for my body type. Is there a good way to track this without having to actually look at the numbers as that is apparently a trigger for my ED? I really am afraid of falling back into all of my old habits and I don't want to do that, but I do want to continue getting to a healthier place and feeling confident in my body. Has anyone else experienced this? Is there a good middle ground I'm not thinking of?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gd8qdd/request_how_do_you_get_healthier_without_falling/",
  "score": 47,
  "num_comments": 5,
  "comments": [
    {
      "id": "fpg8282",
      "author": "None",
      "body": "Have you ever worked with a dietitian? After I got diagnosed I went to my dietitian, told them I couldn’t handle the stress of the calorie counting, and they worked with me on just understanding the science of food and how to keep my nutrition levels up. It’s very possibly to do these things in a healthy way, even with an ED, but you don’t have to do it alone! \n\nAlso, I just want to add that the stay-at-home orders are incredibly difficult for many of us, you are not alone in that at all. Try to practice some mindfulness whenever you can, and mindful eating if possible.",
      "created_utc": 1588596794.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fpgp32f",
      "author": "None",
      "body": "I feel your pain. Being locked up at home during this time is incredibly difficult. I have also gone back to old habits. I think it's partly because we've all got so much more time on our hands. In regards to your scale I really think you did the right thing there. I personally find that seeing that number on the scale makes or breaks my entire day and my mood. So putting that away is a very positive move. If you still want to track progress then perhaps just go by how your clothes feel and if you can then try and speak to somebody.",
      "created_utc": 1588606941.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fpgx00o",
      "author": "None",
      "body": "This is a precarious place to be, and in many ways, I'm in a nearly identical situation to yours.\n\nI've struggled with exercise bulimia for quite a while but I'm mostly recovered from it, as well as my anorexia. For me, the lockdown didn't alter much in terms of exercise, but it has really ratcheted up my health anxiety, which in turn affected my perception of body image/idealism. I teetered on the edge of returning to dangerous behaviors much like you – I don't think I've felt this far down into the hole in quite a while. I felt overwhelmed, out of control, angry and depressed more than I have in a long time. I was losing weight and I had 0 appetite.\n\nI'm not sure what your usual exercise routine was like, but definitely make sure you can do something outside. Cycling is my passion – I've loved it for a long time, even through all the eating disorder business. After long deliberations on whether I should ride outside during quarantine, I made the decision and it was absolutely amazing. The wind, sunshine and whirlwind of endorphins were enough to remind me to be grateful for just being alive, healthy and able to climb dozens of massive gravel road hills. It wasn't about punishing myself for food or anything nefarious – all of those miles made the self-hate and loathing completely vanish. I guess that's my advice: exercise outside if you can – try to detach it completely from any negative thoughts about yourself or your body.",
      "created_utc": 1588611018.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fphb9ng",
      "author": "BlumpkinsRule55",
      "body": "This is my story exactly right now, to a T. I felt all of these emotions and tendencies coming back and started cutting calories and over exercising. I immediately got a nutrionist last week who is doing daily check ins with me on how I’m feeling and holding me accountable to only check the scale once a week- as i am still trying to lose a healthy amount of weight too. I think the biggest thing is to realize you don’t have to do this alone, that’s a humongous feat to do alone. I wish I would have told myself that years ago, but now I have a therapist and nutrionist and it makes it so much more manageable. If finances are an issue (which there’s a ton of knowledgeable and affordable people out there) then try to talk to a friend about being your accountability person to do check ins with, it could really help to just have support.",
      "created_utc": 1588618207.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fphjkml",
      "author": "nourished-soul",
      "body": "I think you're on the right track with putting the scale away and focusing on being healthy though there are a lot of things to do with mindset as well as other tactics I'd love to discuss with you. Can you message me and we can chat, if you're open? :)",
      "created_utc": 1588622408.0,
      "score": 2,
      "context": []
    }
  ]
}