{
  "id": "geh0u8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1588758708.0,
  "title": "Request: How much can Body Dysmorphia actually affect you?",
  "selftext": "I'm sure a lot of people here can relate to \"just not seeing\" what other people are talking about with regards to their weight/body. But I REALLY can't. \n\nI'm 23, and I've been bulimic since I was 16, but have slowly curbed it in favour of more restrictive eating when my dentist noticed my teeth enamel was damaged. I used to restrict, binge and purge, but now I don't binge or purge regularly anymore. I've been at home for the past two months, and during that time have been restricting my intake.\n\nMy mom has mentioned my weight a few times, whether she's hugging me and commenting on my bones, or saying that she just thinks I look gaunt in the face. I'm not with my boyfriend, but he's expressed similar concerns over photos and videos I've sent him.\n\nBut I just do NOT see it, and I don't understand how any amount of body dysmorphia could be deluding me this much? I know the concept, but is it possible to physically be unable to see your body for what it is? I just feel like a fraud. My mom or BF will say something to me about my weight loss, but I just feel annoyed and dismissive, and keep looking at photos of other women/celebrities who are obviously thinner than me. I don't think I look remotely like someone who is \"too skinny\", so I feel the need to restrict even harder to live up to their concerns. \n\nWhat is the psychology behind BD? How much can it truly affect you?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/geh0u8/request_how_much_can_body_dysmorphia_actually/",
  "score": 61,
  "num_comments": 15,
  "comments": [
    {
      "id": "fpnp66x",
      "author": "FrankieFried",
      "body": "I remember using the bathroom in my new dentists' office for the first time and being so genuinely shocked- they had a mirror that showed my reflection in an unusual angle, and I couldn't believe it was me. This was after six months of progressive weight loss, and everyone around me would say how small I was, while I was convinced I was just as big/no different than before. After struggling with an ED/BD for years, it was the first time I could actually *see* what people were talking about. \n\nBD is one of the factors that can drive eating disorders, though they're usually a lot more complicated than just wanting to lose weight. Comparing yourself to other people will always, always be unhelpful- ESPECIALLY celebrities/influencers, who have the benefits of personal trainers/Photoshop/dietitians, etc. \n\nAs far as not feeling like you're skinny enough to merit concern, it's important to realize that every body is different, and that a person's healthy weight can't always be measured by how you look. You don't need to have every bone visible before someone decides that you're at the point where you need help or actually have a problem. it's something that is affecting your life now, in a very real way, and you deserve all the support and care available.",
      "created_utc": 1588769430.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fpob4bk",
      "author": "None",
      "body": "My body dysmorphia is literally ruining my life. Some days I can’t leave my house. I feel physically much larger than I am, even though I know that I can’t see what people mean when they tell me I’m small, and even when my clothes fit me I feel like everything’s too small and end up wearing oversized sweaters.",
      "created_utc": 1588781492.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fpngj2u",
      "author": "lattetruffles",
      "body": "I second this questionn",
      "created_utc": 1588762114.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fpntvxq",
      "author": "VampireDetective",
      "body": "I lost A LOT of weight when my ED was at its worst. Everyone commented on it and I didn’t understand what they were talking about, I couldn’t see any difference. Yes, the scale told me I had lost a significant amount of weight but when I looked in the mirror I saw no changes at all. Now that I’ve gained the weight back, and then some, I can see the difference clear as day when I look back at pictures. How thin my upper arms and thighs were, the shallowness in my face, hip and collarbones protruding. But truly, when I looked like that I didn’t see it AT ALL, not even when I tried and thought ‘see through the ED and see how you actually look’. But I just effin couldn’t.\n\nI think perhaps it’s something our dysmorphic minds do. The ED wants you to keep on loosing weight so it won’t ever say ‘yes, you are now thin and we can stop this thing we’re doing’. But when, like me, you gain the weight back and look at a picture of how you used to look the ED is like ‘loooook at how thin we are!! We need to look like that again’. It does whatever it can to convince you to be unhealthy. And that’s why it is never our friend.",
      "created_utc": 1588772498.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fpnh4aq",
      "author": "boktorn",
      "body": "I relate to this so badly\nmy mom comments on how bony I've gotten but literally there is no bones visible! I don't get it, but I wish I did so I could finally be satisfied and see results :/",
      "created_utc": 1588762686.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fpnqxu7",
      "author": "BuniiBoo",
      "body": "I can’t answer the question, however, I started having issues with BD when I was 16 / 17 and still deal with it today; I am 24 now. I’ve gone through MANY body changes, from a little overweight to fairly underweight, and I rarely see myself differently. I’m just....Static? I can’t explain it. I don’t notice the changes in the mirror.",
      "created_utc": 1588770632.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fpo33qd",
      "author": "seatangle",
      "body": "I don't know what the psychology behind it is. Maybe it has something to do with a fixed mental image that we have of ourselves that doesn't change or catch up to what our actual physical appearance is, at least that is what it has felt like to me while in the throes of an ED.\n\nHowever, this is one sort of ammunition I have in my arsenal when I feel horrible about the weight I've gained in recovery: I remind myself that in the past, no matter how much weight I lost, I always felt just as bad if not worse about my body. Losing weight is not the answer to \"fix\" dysmorphic thoughts. It has never gotten me anywhere.\n\nAnother thing I've noticed is that I am kind of afraid to accept my body. I think I may have developed an even more negative way of thinking about my body as a defense. I feared that through accepting my body, I would allow myself to slip - become lazy and gain a lot of weight. However, none of this really explains why my body image was so bad in the first place, or what causes the dysmorphia initially. When I think about the time when m ED was developing, I was very deeply unhappy with my life, and it could be that my body became a convenient scapegoat. \n\nI imagine the psychology behind body dysmorphia (or, more broadly, negative body image) would be different for everyone, based on your experiences, culture, maybe even genetic predisposition. Also important to note that Body Dysmorphic Disorder is its own disorder, not everyone with AN, BN, or other EDs automatically has BDD, but they likely experience dysmorphia.",
      "created_utc": 1588777508.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fpnihf1",
      "author": "None",
      "body": "I can relate to this. Although now i'm a bit overweight so nobody says anything anymore. But i used to get comments from everybody, even colleagues and other people who didn't even know me that well.",
      "created_utc": 1588763991.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpp9uyy",
      "author": "annielovesbacon",
      "body": "I don’t know the psychology behind BDD but it’s in the DSM-V so it’s definitely real. For me it’s terrifying because I literally do not know what I look like. I look in the mirror this afternoon and I look completely different than I did in the morning. When I see pictures of myself, I don’t recognize myself. It’s scary! It freaks me out that people can see me completely differently than I see myself. Sometimes it freaks me out so bad that I don’t leave my house (not that I leave my house these days anyway haha)\n\nAll this to say, you are not a fraud!!! Body dysmorphic disorder is a real thing.\n\nEdit: I also want to add that suffering from an ED doesn’t mean you have to have BDD, and vice versa",
      "created_utc": 1588798454.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpopj6m",
      "author": "None",
      "body": "I'm 26 with a a family and I can't have old pictures of me up because it reminds me of different stages of my ED. I can't stop comparing myself to that old body or think I still might look like that. Needless to say we don't have family pictures anywhere in the house.",
      "created_utc": 1588788445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpp137e",
      "author": "BlackJack613",
      "body": "Been in what I'll call recovery for the last decade or so, still struggle with BD. I'm heavier than I would like but I'm healthy at least.  Some days I can wear a pair of jeans and think they look fine, possibly even flattering - other days i see it as muffin top central and I just can't bare the thought of going out like that, sometimes I even feel like they are suffocating me or that no matter what shirt I wear the tummy will surely droop below the hem - there is no droopage it's just in my head. Those days are rough. I imagine that therapy would help and my old nutritionist has recommended a few specialists in my area, I will likely look them up once my work starts back up and I have benefits again.\n\nI remember that when I was fully engrossed in the restriction I had my arm perched on the window ledge of a car on a sunny day and I could see my reflection in the mirror, the slight indentation of the softness of the bottom of my arm against the ledge looked like droopy bingo wings that day and I obsessed about it.",
      "created_utc": 1588794120.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fppgvzl",
      "author": "loudcyclebangers",
      "body": "Yes this is REAL. I was anorexic for about two years, but thought that I couldn't be because I wasn't \"small enough,\" but looking back at photos now, I can 100% see what everyone else saw and can't believe I even had the capability to shrink back down to that size. I really hope you find help! It's a terrible, terrible captor over your life. I've been going through recovery for a few years, but have only recently started to gain some freedom back. Sending you good vibes and all the strength.",
      "created_utc": 1588802045.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpqcivj",
      "author": "vixissitude",
      "body": "I literally came to this sub to make a post about this. All of this is relatable, although I'm nowhere near underweight and I'm able to manage my bulimia to a degree, I just feel the same as when I was at my heaviest. With a logical mind I can understand I'm not, even from my posture. But it doesn't make sense when my friend calls me slim because I'm at a healthy range, but not even average yet. I'm just trying to not mind the BD and focus on exercise and building lean muscle than losing weight and losing fat. I've been gradually getting leaner for the past six months (after some exercise and diet that turned into a r/b/p cycle that lasted for two years) but in my mind when I look in the mirror I see the same body I had three years ago. It honestly sucks to know that I'm not there anymore but not able to see what others see.",
      "created_utc": 1588819756.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpoqvqn",
      "author": "VaporwaveVampire",
      "body": "Ask your doctor to be sure to find out your BMI. But yes, BDD can make you not be able to see the truth sometimes",
      "created_utc": 1588789101.0,
      "score": -2,
      "context": []
    },
    {
      "id": "fpq3hed",
      "author": "flyleafet9",
      "body": "Been there. I nearly flunked my latest semester of college because I refused to leave my house due to shame",
      "created_utc": 1588814419.0,
      "score": 3,
      "context": [
        {
          "id": "fpob4bk",
          "author": "None",
          "body": "My body dysmorphia is literally ruining my life. Some days I can’t leave my house. I feel physically much larger than I am, even though I know that I can’t see what people mean when they tell me I’m small, and even when my clothes fit me I feel like everything’s too small and end up wearing oversized sweaters.",
          "created_utc": 1588781492.0
        }
      ]
    }
  ]
}