{
  "id": "gexqi5",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1588817028.0,
  "title": "Request: How to stop projecting my feelings onto my SO?",
  "selftext": "I’m not sure if anyone feels the same way or knows what I’m talking about, but I’m hoping I can get some advice. \n\nMy SO is one of the most amazing people I’ve ever met. He is aware of my eating disorder and is very patient and gentle with me. He never gets angry when he doesn’t understand my feelings nor does he belittle me. My SO is slightly overweight and is aware of this. He loves his body and is very comfortable with the way he looks. He has come to me before and stated that when he was much younger, he hated his body and thought he was overweight even when he was at his skinniest. I’m so proud (and envious) of his progression and I’m so glad he loves himself for who he is.\n\nThis brings me to the problem: my ED has made me so many times project how I feel about my body onto him. What I mean by this is that if I see him eating a snack after dinner, or with a big plate, or even just considering eating after we’ve already eaten, I make comments to him about how he shouldn’t eat more, how bad it is to eat dessert, etc. It’s gotten to the point where I know I’m going to say it and I want to stop it but it just comes out anyway. Then I immediately regret it afterword because it’s awful and no one deserves to be talked to like that. In a way, he’s getting a sense of what it’s like to live with my thoughts but I would never want to subject anyone to feel that way so I hate myself for doing it. \n\nHe is very, very patient with me and I’ve communicated to him how sorry I feel when I say things like this. He knows it’s just my ED talking and I can’t exactly help it, but I know I can be better about silencing myself when it’s inappropriate. I just need advice on how to be better at this. These thoughts are always going through my head when it comes to my eating habits, but I hate myself so much for even putting such thoughts in my SO’s head. Especially when he’s been through some difficult times with his self-image.\n\nI’m not sure if any of this made sense but I’m hoping someone has some advice so that I can be better for him.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gexqi5/request_how_to_stop_projecting_my_feelings_onto/",
  "score": 39,
  "num_comments": 7,
  "comments": [
    {
      "id": "fpqhtev",
      "author": "obsessedfoodie",
      "body": "You’ve already engaged in such great self-talk and awareness! You’re on the right track babes! Obviously these comments are coming from your ED brain anxiousness lashing out and not a malicious place intended to hurt him. You need to tackle the root of the problem, which is essentially that pesky ED voice in your head. Bigger picture: focus on your recovery, and the rest will come naturally. You won’t have that built up anger anymore so the comments won’t burst out.\nSmaller picture: apologize when it happens. Acknowledge it. Avoid putting yourself in situations where you know you’ll say those things. Don’t hang around to watch him eat his dessert. (Obviously you want to be able to do these things together but perhaps at this current time they’re too triggering)\nTalk and talk and talk with your SO! Communication is key. Letting him know it makes you upset so perhaps he can also help avoid putting you in those situations.",
      "created_utc": 1588823124.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fpqsfu8",
      "author": "bingumarmar",
      "body": "I'm the same way!! Whenever my husband eats a snack after dinner or eats something really high cal I will feel the urge to comment on it. Sometimes it will even make me upset with him. \n\nI wish I had advice on how to deal with it but I struggle in the same way. It's really important that you are self aware though!",
      "created_utc": 1588830891.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fpri3jp",
      "author": "Stwarrberrymelk",
      "body": "i get this! i feel uncomfortable if my bf doesn't eat, and will act rudely towards him,which i feel awful about and i know he tries to not make me feel awful, but its very uncomfortable. if he doesn't eat, ill get angry at him and i always find myself comparing what ive eaten to him. i think for me at least it comes from a place of envy that he can eat without thinking meanwhile i cant stop thinking.",
      "created_utc": 1588854715.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fprmu6i",
      "author": "absh_20",
      "body": "I'm like this with my housemates who are a couple. I can't stop eating and they eat like 2 meals a day only after 3pm. Their not eating makes me jealous that I had to learn how to eat normally again, and they can be so nonchalant about food and not eat properly. I know there isn't anything I can do because they aren't family they're just friends who I live with...",
      "created_utc": 1588857857.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fpupnay",
      "author": "roshambo-13",
      "body": "I have the exact problem. My SO is a bit overweight, too, and overeats a lot. I literally can’t help but make comments, so I try and make it about “us”, as in WE don’t need seconds and WE don’t need a snack. But I feel so horribly guilty about commenting every time, especially bc be has body image issues of his own & used to be very overweight. \n\nIt’s so horribly triggering to see him overeat that sometimes it gives me anxiety and I shut down. Other times I get angry with him in my mind but I KNOW it’s not his fault so I never let him see those emotions. \n\nI know exactly how you feel, and it’s awful. Best of luck to you in finding answers xx.",
      "created_utc": 1588919598.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fpudehx",
      "author": "metamodernmiss",
      "body": "Practice food/body autonomy. What each of you does with your own food/body is completely your own decision. Food and bodies are neutral and not up for discussion/debate!",
      "created_utc": 1588910178.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fpqsis0",
      "author": "bingumarmar",
      "body": "This is great advice.",
      "created_utc": 1588830958.0,
      "score": 4,
      "context": [
        {
          "id": "fpqhtev",
          "author": "obsessedfoodie",
          "body": "You’ve already engaged in such great self-talk and awareness! You’re on the right track babes! Obviously these comments are coming from your ED brain anxiousness lashing out and not a malicious place intended to hurt him. You need to tackle the root of the problem, which is essentially that pesky ED voice in your head. Bigger picture: focus on your recovery, and the rest will come naturally. You won’t have that built up anger anymore so the comments won’t burst out.\nSmaller picture: apologize when it happens. Acknowledge it. Avoid putting yourself in situations where you know you’ll say those things. Don’t hang around to watch him eat his dessert. (Obviously you want to be able to do these things together but perhaps at this current time they’re too triggering)\nTalk and talk and talk with your SO! Communication is key. Letting him know it makes you upset so perhaps he can also help avoid putting you in those situations.",
          "created_utc": 1588823124.0
        }
      ]
    }
  ]
}