{
  "id": "gi53ke",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1589262317.0,
  "title": "Request: My boyfriend talks about weight gain a lot",
  "selftext": "My bf (28) is about 5’8” and has always been skinny. He has been really open about how he has always been self conscious about this and how he has always wished that he wasn’t so skinny. He is confident in every other way but I know he has never really felt happy with his body. Lately he has been trying to gain weight and it has been really stressful for me. It’s something he talks about A LOT and he knows that I have an ED. He is always really supportive so I’m sure he doesn’t even realize that this is bothering me. I don’t want to say anything bc I know that he is feeling happier with himself since he’s gained a few pounds, but the constant talk just makes me really focus on what I’m eating as well and is making my current relapse happen even faster. Idk the point of this post really I just wondered if anyone else has experienced this or can relate. I really want to be a supportive girlfriend but right now I just avoid the topic.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gi53ke/request_my_boyfriend_talks_about_weight_gain_a_lot/",
  "score": 42,
  "num_comments": 5,
  "comments": [
    {
      "id": "fqcqx02",
      "author": "None",
      "body": "Maybe he also has underlying body issues and its just something that needs to be communicated. He’s voicing his concerns probably as an attempt for support.",
      "created_utc": 1589266024.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fqdeifn",
      "author": "None",
      "body": "My bf is 5'7 and wanted to gain weight because he was skinny. So I thought okay give him more food. Now he has a belly and the weight never dispersed so he wants to lose it. Meanwhile my ED is trying not to make him think the way I do. He is exercising at home to try and fix it and looking at healthy foods to help. Maybe incorporating healthy meals is a good start? \nI also wish he didn't weigh himself right after I do cuz he always says something about my weight smh",
      "created_utc": 1589287869.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fqdrszq",
      "author": "icanhasnoodlez",
      "body": "My husband is at least 25lbs lighter than me and also wants to gain weight. Here's the thing, we don't live in a vacuum. He can still be supportive and talk about his desire to gain weight. You can discuss healthy ways to talk about body image between the two of you. We will always be confronted with things that will trigger us or stress us out. The key is to be aware of those things and those feelings and try not to act on them.",
      "created_utc": 1589295472.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqd9is6",
      "author": "cuteshoes00",
      "body": "I think kindly explaining that this makes you stress out will resolve this issue. He will try to be more sensitive and you can still support him however you want!",
      "created_utc": 1589284083.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqcn81v",
      "author": "None",
      "body": "..that's so hard especially if u dont like confrontation..it could be u need a little healthy chat about what's triggering for u imo💙",
      "created_utc": 1589262827.0,
      "score": 3,
      "context": []
    }
  ]
}