{
  "id": "gi8hf1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1589278444.0,
  "title": "Request: My mom wants me to starve myself again",
  "selftext": "I moved back in with my family after the quarantine started because one of my roommates still goes to work. She has been constantly checking in the fridge and pantry to see what I eat. Asking me if I weighed myself each weekend. I’m usually very active in my job and eat very healthy. I fully recovered from anorexia on my own. It took years. I still struggle with BDD but I’ve been wearing baggy clothes and avoiding mirrors since there’s no reason to focus on looks right now. The stress of her lately has left me binging late at night. After dinner tonight, I said I was so full. She said “You need to go back to starving yourself to shed that weight”. I was mortified. Thankfully my sister wasn’t there. Now the thoughts have been coming back. I feel so ashamed. I need help with the binging because it’s becoming uncontrollable but I also don’t want to fall back into restricting",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gi8hf1/request_my_mom_wants_me_to_starve_myself_again/",
  "score": 167,
  "num_comments": 16,
  "comments": [
    {
      "id": "fqdb5v1",
      "author": "blacknailsandcorsets",
      "body": "Your mother is an absolute, abusive asshole. You don’t deserve this. You wouldn’t even deserve this if you were morbidly obese.",
      "created_utc": 1589285429.0,
      "score": 171,
      "context": []
    },
    {
      "id": "fqdb9dv",
      "author": "purplehazey69",
      "body": "Jesus christ. Did she understand your anorexia in the first place? Is there anyone else you could see right now to support you ??",
      "created_utc": 1589285507.0,
      "score": 51,
      "context": []
    },
    {
      "id": "fqdfnw8",
      "author": "cucumberMELON123",
      "body": "Wow this is beyond horrible. I’d call her out to her face!!!!  Honestly it might be better to just go back to your apartment. This is unacceptable behavior from her. You’re an adult and do not need to tolerate it a minute longer.",
      "created_utc": 1589288616.0,
      "score": 37,
      "context": []
    },
    {
      "id": "fqdgwzr",
      "author": "trylongerthanyoufail",
      "body": "Man this made me extremely sad, how few empathy can you mother have. You have a healthier brain than her, dismiss what she said. What would your sister say ? What would anyone you know is healthy, happy and enjoying life would say ?\n\nWe are all here telling you this is the stupidest comment and your mother is as dangerous for your health as your anorexia was and can be. Run away from both, you want to live and be happy, you don't want to starve, be sad and look sick.",
      "created_utc": 1589289416.0,
      "score": 23,
      "context": []
    },
    {
      "id": "fqdlycw",
      "author": "cuteshoes00",
      "body": "You need to have a talk with your mother. If she doesn't understand your boundries then she will keep on crossing them. Tell her what makes you stress out & warn her not to trigger you. I started binging too tbh like its quarantine there is nothing else to do(or so i've been telling myself) keep yourself entertained read a book, watch a moive and try to ignore your mother its hard to live with toxic people but you know better.",
      "created_utc": 1589292390.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fqec3qg",
      "author": "Sk1no",
      "body": "I think your mum has done this on purpose to hurt you, she can't be that unaware. This is her issue and has nothing to do with your weight or what you eat. Its a shame you can't leave as she will cause a relapse. Maybe look into abusive parents, just to help you separate the two things, if you get me? I hope you're OK xxx",
      "created_utc": 1589305116.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fqdnbjj",
      "author": "Working-Reaction",
      "body": "wow. that is so fucked up I’m so sorry you had to put up with that. i know it’s difficult but do not listen to a WORD she says. i honestly can’t believe someone would say that, let alone your own mother. at the end of the day, you know what is best for you better than ANYONE else. you know what’s best, not just for your physical health, but your mental health. starvation is not going to do you any good, and you know that... i hope you don’t dwell on this too much, you’re stronger than you believe :)\n\nit’s a cliche but there is more to life than weight loss.",
      "created_utc": 1589293138.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fqeem3l",
      "author": "VampireDetective",
      "body": "Fucking unbelievable that a mother would do such a thing. I’d go back the apartment! You could have a talk with your roommate about precautions. Like changing out of office clothes and taking a shower straight after she comes home, I dunno 🤷‍♀️ But you need to get out of there!",
      "created_utc": 1589306275.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fqe96mu",
      "author": "None",
      "body": "Your mother is a disgusting human being. Saying that to her daughter who has suffered so much is totally unacceptable. Nobody deserves to be spoken to like that. It is NOT on. Don't let her get to you. Stand up for yourself.\n\nEdit: I assumed you were female, Apologies, OP.",
      "created_utc": 1589303788.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqgrj44",
      "author": "tymopa",
      "body": "Damn...I love that you posted this because I'm pretty sure you knew we could see through your mom's toxic projection. Saying that, seeing it and not letting it seep into your being must be so hard. Your mom needs so much help and I hope you don't feel like it's your responsibility to make that happen. I have no other words except to say that it's okay to keep yourself at s distance. No wonder you've struggled with anorexia. Love to you!",
      "created_utc": 1589354761.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqe5a5w",
      "author": "vish_the_fish",
      "body": "I would tell her her language is unacceptable, that you decide what you eat, and she can't stop you. Then I'd look her right in the eye and take a big bite out of an apple.\n\nThe point is to make it clear that her abusive language won't keep you from living the way you want to. Dealing with narcissistic parents means neutralizing their abuse by not giving them the reaction they want from you. If she starts to withhold food as some sort of power play, it's time to head back to your own place because that home is not a good place for you to be.",
      "created_utc": 1589301977.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqf7194",
      "author": "jenny_mac_",
      "body": "I’m so sorry this has happened, and that you’re being challenged in your recovery. I know there are a lot of comments about how wrong your mother was and know it probably brings up a lot of anger. Try to remember that she is literally brainwashed by diet culture and her upbringing within a fat-phobic society. Her comment is actually coming from a place of wanting what she thinks is best for you/protecting you OR she hates herself so much she is taking it out on you... So try to have some compassion/forgiveness, as hard as that must be. That said, it is NOT acceptable for her to comment about your weight and eating EVER. You should try to establish boundaries with her so she knows that those topics are completely off limits. You could also try to explain how the comment was really hurtful/how it made you feel and see if she realizes how insensitive it is. If you have a therapist or other friends in recovery, reach out for support! \nListen to the Food Psych and Love Food Podcasts for help with the binging. Practicing Intuitive eating is the only tried and true method to battling ED in my experience. Do you have the Intuitive Eating book by Evelyn Tribole and Rush? Remember that you are loved and worthy no matter what your size/shape and that your body does NOT define you. Sending love and hugs ♥️ You got this!",
      "created_utc": 1589319784.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqfnug4",
      "author": "None",
      "body": "This is exactly the reason I cut my mom off (I'm 23 M for example) you don't deserve this. Even if they're blood they don't deserve to be in your life if they make it worse.",
      "created_utc": 1589328295.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqlk614",
      "author": "Avbitten",
      "body": "Honestly, your health is important in more ways than one. I'd suggest moving back in with your roommate immediately. Does it put you at a higher risk for the virus? Yes. But a lower risk of ED. Both are dangerous, but seems like risk of an ED might be higher than the risk of the virus.",
      "created_utc": 1589460180.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqejkg4",
      "author": "HappilyGia",
      "body": "There has got to be more to this story",
      "created_utc": 1589308617.0,
      "score": -4,
      "context": []
    },
    {
      "id": "fqdgz1d",
      "author": "trylongerthanyoufail",
      "body": "Fuck this makes me so angry seriously",
      "created_utc": 1589289452.0,
      "score": 9,
      "context": [
        {
          "id": "fqdgwzr",
          "author": "trylongerthanyoufail",
          "body": "Man this made me extremely sad, how few empathy can you mother have. You have a healthier brain than her, dismiss what she said. What would your sister say ? What would anyone you know is healthy, happy and enjoying life would say ?\n\nWe are all here telling you this is the stupidest comment and your mother is as dangerous for your health as your anorexia was and can be. Run away from both, you want to live and be happy, you don't want to starve, be sad and look sick.",
          "created_utc": 1589289416.0
        }
      ]
    }
  ]
}