{
  "id": "givuuy",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1589362807.0,
  "title": "Request: Help with my wife's binge eating",
  "selftext": "So my wife 38f is struggling with binge eating and has done so for as long as she remembers.\n\nFor 10 years now I have stood by her side trying to help and support her many diets and plans but since lockdown i have been home all day with her, watching her binge (she trys to hide it).\n\nShe is massively over eating and her weight is ballooning, she will prepare her dinner for example and eat quiches, toast and crisps whilst her huge plate of food is cooking.. 3x a day with no excerise.\n\n I'm scared as a pre diabetic her readings are getting worse, she's always tired, lacks excercise and motivation.\n\nI can't say anything to her else she crys and won't talk to me for days, she has depression and being treated with setraline.\n\nPlease help me how can I support her I'm losing my strength to do so, her binging is killing her slowly her health is nose diving, I'm struggling with watching her abuse herself  and the food is costing a lot of money.\n\nI can't leave her, I love her, we have 2 young kids and a home together she is amazing but the binge .. We and I need help.\n\nThanks.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/givuuy/request_help_with_my_wifes_binge_eating/",
  "score": 69,
  "num_comments": 21,
  "comments": [
    {
      "id": "fqhgpj3",
      "author": "sooosan-",
      "body": "A lot of people struggling with binge eating also struggle with restrictive eating. From what it sounds like, she has a history of dieting. She could start by seeing an eating disorder dietitian and an eating disorder therapist virtually, I want to emphasize the specialty as some providers who do not specifically work with eating disorders may worsen the problem. \n\nFood restriction creates food interest which can turn to food obsession. She can be binging to numb out from emotions as well, but if we address the restrictive dieting piece the binging tends to improve. She should eat every 2-3 hours, including carbohydrates, fats, and proteins. Psychologically, when we know we are able to be fed as often we need to be, and get to include all foods, they start to feel less alluring over time. If you knew you could have cake every day for the next month without shame or guilt, cake on day 30 would just be cake, whereas on day 1 it is more of a commodity that we are not supposed to be enjoying or have to feel guilty about, which is not helpful. Guilt and shame are really big emotions that can make someone struggling with binging actually binge more.",
      "created_utc": 1589376628.0,
      "score": 40,
      "context": []
    },
    {
      "id": "fqhczo0",
      "author": "Neko-Chan-Meow",
      "body": "Does she want help? If the answer is no then honestly I dont think there is much you can do. If its yes then therapy can be very helpful to get behind the feelings causing her to binge. You could take over the cooking and eat meals together, buy her a nice diary to journal feelings (extra bonus if it comes with stickers), try and get fit together by taking dance classes or a martial arts.",
      "created_utc": 1589374300.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fqhxh9d",
      "author": "None",
      "body": "Binge eating is known to come out when a person is seeking comfort and control - in a quarantine/lockdown, everyone is additionally stressed, panicked and paranoid, often times making their coping mechanisms (although unhealthy) worse. Binge eating is also scientifically part of a vicious cycle known as the binge-restrict cycle. A person's brain is wired as if we are all still cavemen; food, shelter, survival. When someone begins restricting their intake in order to lose weight, our brains don't necessarily recognize this as \"a move to be healthy\" and instead sees it as a lack of food (one of the keys to remaining alive) and then when it comes in contact with the availability of food (especially under extremely stressful circumstances) it binges, thinking it needs to store the extra calories (also known to your brain as energy) for later use just in case it doesn't have access to food.\n\nUltimately, your wife probably needs to undergo therapy - alot of eating disorders, especially those that are binge related, stem from traumas that she may or may not be conscious of. Right now she probably feels ashamed, uncomfortable, out of control and so terrified of not only losing herself but also you. One thing I want you to try and remember is that when these binges are happening, your wife feels completely out of control. A few things that have helped others in my past include: grounding exercises when she feels like she's about to binge (this can be anything from taking deep breaths and trying to be more mindful of her surroundings to talking to someone about how she's feeling at the moment), keeping a journal of her feelings and emotions and trying to find triggers, to simply going for a walk or trying to do something nice for herself (bubble bath? painting her nails? watching her favorite shows or playing her favorite board games?). Her health is absolutely a priority, but her mental health needs to be taken into consideration as well :) After a binge, try to encourage her to drink plenty of water (it helps flush a person's system and get rid of excess chemicals), and try some light exercises (walking, yoga, stretching) to keep her endocrine system moving. \n\nFinally, take care of yourself too! Her eating disorder can take a toll on you more than you could ever realize; watch your feelings and thoughts and take some self care time for you as well. Reaching out is always the best option in times like these and I wish you both the best!",
      "created_utc": 1589386300.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fqh2ado",
      "author": "None",
      "body": "First, stop talking to her about. It just brings more guilt and shame.\n\nShe needs to decide to get help. Removing trigger foods is a start.\n\nMaybe you can take over cooking for a bit.",
      "created_utc": 1589365364.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fqhbkj2",
      "author": "Phielaa",
      "body": "My mom helped me. During the lockdown i struggled a lot with it. I overcame this by eating all my meals with her and talking about all the other things there are to talk about. Not sure if this can help you but the sense of structure during a structureless time helped me a lot!",
      "created_utc": 1589373332.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fqj0txu",
      "author": "ilikebananabread",
      "body": "I’d suggest a therapist. There is usually an unhealthy mental process behind eating disorders (not judging nor shaming, it just is what it is).\n\nWhen I struggled with eating disorders, I was at my lowest mentally. I had a lot of control issues due to other abuse going on in my life. Once I learned my self worth was not tied to my image and simultaneously started being more social and had more hobbies in my life, I started to regain control. And I learned to enjoy food as a source of fuel for other fun activities. It’s a long process, but I’d highly highly suggest a therapist!\n\nSorry you guys are going through this, I know how eating disorders can wreak havoc on everyone involved. Wishing all the best xo",
      "created_utc": 1589403507.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqhp73f",
      "author": "None",
      "body": "If you do have a discussion with her be extremely patient and supportive. When I was struggling with disordered eating I displaced a lot of my guilt, shame, and anger at my partner even though I was the one asking for his help. If she’s in a place of denial and you bring it up she can feel totally alone and attacked. If you come from a place of calmness and love she may be that more inclined to try the things others have commented as advice! \n\nIt’s not easy to be on either side of a partnership when someone has an eating disorder but there is a strong community of survivors and your family will get through this.",
      "created_utc": 1589381604.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqi259y",
      "author": "VampireDetective",
      "body": "Remember that it’s not your job to fix or cure her, she needs professional help. If love was enough it would’ve been enough a long time ago. But keep supporting her until she can get the professional help she needs and follow the tips for previous comments.",
      "created_utc": 1589388512.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqiyjbd",
      "author": "moooooopg",
      "body": "Change comes from within. Talk to her about it, don't judge, don't force her to change. Best thing my ex did was let me binge while watching a show with him rather than making me feel like I had to hide it. I then wanted to change for myself.",
      "created_utc": 1589402624.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqkmsma",
      "author": "miau_am",
      "body": "Therapy can help, but I also recommend the book Intuitive Eating, especially because of the  diet component you're talking about. I had anorexia and bulimia for 10 years, and then a generally unhealthy relationship with food for a while longer, where I'd try to restrict in a \"healthy eating\" way and then just think about food constantly and end up overeating (rinse and repeat) and this book completely changed my life and my relationship with food. Like, now I think about food when I'm hungry, or sometimes I'll feel a little bit snacky, but it's no big deal. I don't restrict and I don't binge. I really can't recommend it enough. Also, I'm a therapist now and recommend this book to clients all the time. My own therapist recommended it to everyone when I was in ED treatment when I was a teenager. I didn't read it at the time, and I really wish I had.",
      "created_utc": 1589430852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fql9njz",
      "author": "ruffianpenguin",
      "body": "I was honestly doing the same and just being in complete denial. I used to binge eat and I remember just thinking \"i hate you, I hate you so much\" whilst eating, I felt as though I had no control over it. The only way I could stop the cycle (personally I know it can have the opposite effect for others) was to remove those foods completely. I'm now 5 months on keto and I've lost almost 20kgs so far, I finally feel like I have control around food and although it's still hard and I'm still struggling I can't imagine going back to binge eating ever again. \nIn terms of her, I think she needs to come to a decision herself to stop. Be gentle because she probably isn't her own biggest fan right now, please don't mention how attracted you are to her at all, maybe focus it on showing the kids they can do anything and to use this quarentine time for good.",
      "created_utc": 1589451153.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqhdq7m",
      "author": "canoe4you",
      "body": "Food is an addiction for her, she is using it to cope with deeper issues. Like other types of addicts, she has to want to help herself to get better, she can not be forced into it with success. As for supporting her, do not keep the foods she binges on in your home. Cook healthy meals and portion sizes and eat well yourself. If she’s not in therapy then she needs to be to help her find out why she binges and what she can do differently when she has the urge to eat a bag of chips in between meals. Bringing up your concerns should be done with some tact, maybe try writing a letter to her about how you love her but can’t stand to see her do this to herself. Or show her this post. If she’s still too sensitive to open up at all then she’s not in a place to want help and it’s up to you to not enable her addiction as best as you can.",
      "created_utc": 1589374776.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqhdex6",
      "author": "r8la",
      "body": "Hi! It is really sweet that you're concerned about her health, but let me say the obvious thing: she needs to acknowledge her illness. If she hasn't already, you should have an honest talk with her about it, and make her understand her condition.\n\nHowever, if she is willing to overcome her ED, you being at home with her is a great opportunity. She needs your support, mentally, emotionally and for practical problems. \n\nFirst, every food she could eat in a \"binge episode\" must disappear from the house. I'm talking about snacks, but also bread, ice cream, cheese, frozen foods like pizza. Make it so that every food in you house has to be cooked to be eaten. In this way, it will take more time to start eating and she will have enough time to realize what she is about to do and to stop.\nThis does not mean that you have to stop eating some food, this is not a weight loss diet, just that if you want an ice cream you will have to go to a shop.\n\nSecond, you could help her dominate her impulse on eating. Every time she feels like eating something she need to distract herself. She could make a phone call, chat with you, go out for a walk, dance with you in your livingroom... any activity is allowed, as long as it is not something passive, like watching TV.\n\nLast, but most important, she should start having therapy sessions. Overcoming an ED is like overcoming any other illness, she needs qualified help. \n\nGood luck to both of you, and forgive my (many) mistakes with english",
      "created_utc": 1589374573.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fqig3yu",
      "author": "Lilith-Rising",
      "body": "Let her know it’s taking a toll on the relationship and how watching her hurt herself(this is self-harm) is damaging you too. Obviously if nothing changes, nothing will change. She is the one who is going to have to want to change. Professional help is obviously needed. When I found out my actions affected others, it did help me WANT to seek help. She’s probably depressed, don’t focus on the act of eating but focus on alleviating the depression(which may include daily exercise and healthier foods of course) and the situation will likely improve.",
      "created_utc": 1589395534.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fqhezw0",
      "author": "Boosey0910",
      "body": " Never Binge Again.  I have clients who have benefitted greatly from that methodology.",
      "created_utc": 1589375581.0,
      "score": -4,
      "context": []
    },
    {
      "id": "fqhr862",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1589382778.0,
      "score": -5,
      "context": []
    },
    {
      "id": "fqhyeor",
      "author": "None",
      "body": "Rephrasing the above:\n\nTalking to her from a place of love, support, and curiosity (rather than judgment) is extremely important.  It sounds like she has a lot of shame around eating and her behavior.  If she could have stopped by now she would have.  \n\nCurious Supportive Questions: \n\n* \"I see you're hurting - How can I best support you?\"\n* \"I love you and want to support you, what would be helpful to you?\"\n* \"I was thinking of going on a walk with the kids, would you like to join us?\"\n\nAs the above commenter mentioned it is important she takes ownership of her own health and healing.  If online therapy isn't an option there are excellent books/podcasts/youtube videos on letting go of binging behaviors.  The resources are out there if she wants them.\n\nDeveloping skills to manage mood/anxiety and slowing down prior to binging (even if it's a brief pause) is crucial.  She has been in this cycle for a long time and will need to take it day by day (and at times moment by moment).\n\nIn agreement with the other replies, this work is for her to do.  She needs to want it and commit to it.  She's lucky to have you in her corner but ultimately she's the one in the ring.  \n\nBe kind to yourself during this process, it's hard to see a loved one hurt themselves.",
      "created_utc": 1589386747.0,
      "score": 10,
      "context": [
        {
          "id": "fqh2ado",
          "author": "None",
          "body": "First, stop talking to her about. It just brings more guilt and shame.\n\nShe needs to decide to get help. Removing trigger foods is a start.\n\nMaybe you can take over cooking for a bit.",
          "created_utc": 1589365364.0
        }
      ]
    },
    {
      "id": "fqjwcj1",
      "author": "I-really-need-a-life",
      "body": "i would really reconsider recommending a diet to someone struggling with an eating disorder. that’s incredibly irresponsible and damaging",
      "created_utc": 1589416151.0,
      "score": 4,
      "context": [
        {
          "id": "fqhr862",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1589382778.0
        }
      ]
    },
    {
      "id": "fqm9fm1",
      "author": "adamrogu24",
      "body": "this diet has been scientifically proven to be incredibly unhealthy and recommending a diet to someone with an ED will only further someone’s body shame and food guilt. no one should be on that diet - let alone someone with an ED.",
      "created_utc": 1589473736.0,
      "score": 1,
      "context": [
        {
          "id": "fqhr862",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1589382778.0
        }
      ]
    },
    {
      "id": "fqj50vp",
      "author": "GemIsAHologram",
      "body": "Are there any podcasts or videos you would recommend?",
      "created_utc": 1589405133.0,
      "score": 1,
      "context": [
        {
          "id": "fqh2ado",
          "author": "None",
          "body": "First, stop talking to her about. It just brings more guilt and shame.\n\nShe needs to decide to get help. Removing trigger foods is a start.\n\nMaybe you can take over cooking for a bit.",
          "created_utc": 1589365364.0
        },
        {
          "id": "fqhyeor",
          "author": "None",
          "body": "Rephrasing the above:\n\nTalking to her from a place of love, support, and curiosity (rather than judgment) is extremely important.  It sounds like she has a lot of shame around eating and her behavior.  If she could have stopped by now she would have.  \n\nCurious Supportive Questions: \n\n* \"I see you're hurting - How can I best support you?\"\n* \"I love you and want to support you, what would be helpful to you?\"\n* \"I was thinking of going on a walk with the kids, would you like to join us?\"\n\nAs the above commenter mentioned it is important she takes ownership of her own health and healing.  If online therapy isn't an option there are excellent books/podcasts/youtube videos on letting go of binging behaviors.  The resources are out there if she wants them.\n\nDeveloping skills to manage mood/anxiety and slowing down prior to binging (even if it's a brief pause) is crucial.  She has been in this cycle for a long time and will need to take it day by day (and at times moment by moment).\n\nIn agreement with the other replies, this work is for her to do.  She needs to want it and commit to it.  She's lucky to have you in her corner but ultimately she's the one in the ring.  \n\nBe kind to yourself during this process, it's hard to see a loved one hurt themselves.",
          "created_utc": 1589386747.0
        }
      ]
    },
    {
      "id": "fqk9nqj",
      "author": "None",
      "body": "When looking for resources/media I highly recommend choosing sources that are clinicians or researchers as they're more likely to have evidence-based recommendations.\n\nSome of the videos I'm recommending have a spiritual inclination (none are dogmatic).  Mindfulness has been supported by numerous studies as a means of improving self-regulation.  I've found it very helpful with binging.\n\n**Podcasts:**\n\n[https://christyharrison.com/foodpsych/5/the-truth-about-binge-eating-with-amy-pershing](https://christyharrison.com/foodpsych/5/the-truth-about-binge-eating-with-amy-pershing) (Foodpsych is fantastic)\n\n[https://podtail.com/en/podcast/10-happier-with-dan-harris/-220-the-anti-diet-evelyn-tribole/](https://podtail.com/en/podcast/10-happier-with-dan-harris/-220-the-anti-diet-evelyn-tribole/) (excellent episode on intuitive eating)\n\n**Videos:**\n\n[https://www.youtube.com/watch?v=cf7JbfqiLic](https://www.youtube.com/watch?v=cf7JbfqiLic) (rejecting the diet mentality, intuitive eating)\n\n[https://www.youtube.com/watch?v=AWGnY97wcHY](https://www.youtube.com/watch?v=AWGnY97wcHY) (also leans spiritual but a beautiful 6-minute video about being loving with ourselves)\n\n[https://www.youtube.com/watch?v=eKn4IGY8OH8](https://www.youtube.com/watch?v=eKn4IGY8OH8) (a tender talk on mindfulness, addiction, and being gentle with ourselves)\n\nLet me know if you have any questions!",
      "created_utc": 1589422846.0,
      "score": 2,
      "context": [
        {
          "id": "fqh2ado",
          "author": "None",
          "body": "First, stop talking to her about. It just brings more guilt and shame.\n\nShe needs to decide to get help. Removing trigger foods is a start.\n\nMaybe you can take over cooking for a bit.",
          "created_utc": 1589365364.0
        },
        {
          "id": "fqhyeor",
          "author": "None",
          "body": "Rephrasing the above:\n\nTalking to her from a place of love, support, and curiosity (rather than judgment) is extremely important.  It sounds like she has a lot of shame around eating and her behavior.  If she could have stopped by now she would have.  \n\nCurious Supportive Questions: \n\n* \"I see you're hurting - How can I best support you?\"\n* \"I love you and want to support you, what would be helpful to you?\"\n* \"I was thinking of going on a walk with the kids, would you like to join us?\"\n\nAs the above commenter mentioned it is important she takes ownership of her own health and healing.  If online therapy isn't an option there are excellent books/podcasts/youtube videos on letting go of binging behaviors.  The resources are out there if she wants them.\n\nDeveloping skills to manage mood/anxiety and slowing down prior to binging (even if it's a brief pause) is crucial.  She has been in this cycle for a long time and will need to take it day by day (and at times moment by moment).\n\nIn agreement with the other replies, this work is for her to do.  She needs to want it and commit to it.  She's lucky to have you in her corner but ultimately she's the one in the ring.  \n\nBe kind to yourself during this process, it's hard to see a loved one hurt themselves.",
          "created_utc": 1589386747.0
        },
        {
          "id": "fqj50vp",
          "author": "GemIsAHologram",
          "body": "Are there any podcasts or videos you would recommend?",
          "created_utc": 1589405133.0
        }
      ]
    },
    {
      "id": "fqkb9ym",
      "author": "GemIsAHologram",
      "body": "Thank you so much!",
      "created_utc": 1589423764.0,
      "score": 1,
      "context": [
        {
          "id": "fqh2ado",
          "author": "None",
          "body": "First, stop talking to her about. It just brings more guilt and shame.\n\nShe needs to decide to get help. Removing trigger foods is a start.\n\nMaybe you can take over cooking for a bit.",
          "created_utc": 1589365364.0
        },
        {
          "id": "fqhyeor",
          "author": "None",
          "body": "Rephrasing the above:\n\nTalking to her from a place of love, support, and curiosity (rather than judgment) is extremely important.  It sounds like she has a lot of shame around eating and her behavior.  If she could have stopped by now she would have.  \n\nCurious Supportive Questions: \n\n* \"I see you're hurting - How can I best support you?\"\n* \"I love you and want to support you, what would be helpful to you?\"\n* \"I was thinking of going on a walk with the kids, would you like to join us?\"\n\nAs the above commenter mentioned it is important she takes ownership of her own health and healing.  If online therapy isn't an option there are excellent books/podcasts/youtube videos on letting go of binging behaviors.  The resources are out there if she wants them.\n\nDeveloping skills to manage mood/anxiety and slowing down prior to binging (even if it's a brief pause) is crucial.  She has been in this cycle for a long time and will need to take it day by day (and at times moment by moment).\n\nIn agreement with the other replies, this work is for her to do.  She needs to want it and commit to it.  She's lucky to have you in her corner but ultimately she's the one in the ring.  \n\nBe kind to yourself during this process, it's hard to see a loved one hurt themselves.",
          "created_utc": 1589386747.0
        },
        {
          "id": "fqj50vp",
          "author": "GemIsAHologram",
          "body": "Are there any podcasts or videos you would recommend?",
          "created_utc": 1589405133.0
        },
        {
          "id": "fqk9nqj",
          "author": "None",
          "body": "When looking for resources/media I highly recommend choosing sources that are clinicians or researchers as they're more likely to have evidence-based recommendations.\n\nSome of the videos I'm recommending have a spiritual inclination (none are dogmatic).  Mindfulness has been supported by numerous studies as a means of improving self-regulation.  I've found it very helpful with binging.\n\n**Podcasts:**\n\n[https://christyharrison.com/foodpsych/5/the-truth-about-binge-eating-with-amy-pershing](https://christyharrison.com/foodpsych/5/the-truth-about-binge-eating-with-amy-pershing) (Foodpsych is fantastic)\n\n[https://podtail.com/en/podcast/10-happier-with-dan-harris/-220-the-anti-diet-evelyn-tribole/](https://podtail.com/en/podcast/10-happier-with-dan-harris/-220-the-anti-diet-evelyn-tribole/) (excellent episode on intuitive eating)\n\n**Videos:**\n\n[https://www.youtube.com/watch?v=cf7JbfqiLic](https://www.youtube.com/watch?v=cf7JbfqiLic) (rejecting the diet mentality, intuitive eating)\n\n[https://www.youtube.com/watch?v=AWGnY97wcHY](https://www.youtube.com/watch?v=AWGnY97wcHY) (also leans spiritual but a beautiful 6-minute video about being loving with ourselves)\n\n[https://www.youtube.com/watch?v=eKn4IGY8OH8](https://www.youtube.com/watch?v=eKn4IGY8OH8) (a tender talk on mindfulness, addiction, and being gentle with ourselves)\n\nLet me know if you have any questions!",
          "created_utc": 1589422846.0
        }
      ]
    }
  ]
}