{
  "id": "gjgzgc",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1589438457.0,
  "title": "Request: How to stop Bodychecking",
  "selftext": "Hi, even though my recovery is going well I have this problem with bodychecking. I check my body constantly without really wanting to ,,like I can't wear short sleeved shirts without looking or touching my arms all the time and as soon as I spot a mirror I can't help but looking at it. This is so distracting and annoying!! I also do the same thing the body of others. When I meet a new person/see a picture of a person I can't help but figuring out what body type they have. I feel so toxic doing this but I don't know how to stop. Does anyone has tips on how to stop this behavior?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gjgzgc/request_how_to_stop_bodychecking/",
  "score": 93,
  "num_comments": 13,
  "comments": [
    {
      "id": "fql0380",
      "author": "Pyxxiss",
      "body": "Hey! I’m in recovery too and I’m trying not to body check, wherever I walk by a mirror I always lift my shirt and check my stomach. Every. Single. Time. I find what helps for the time being is wearing hoodies and stuff that I can’t really body check in. From what I have read the only advice from professionals is to catch yourself and stop yourself. Yeah not much help over there :/ Message me if you need anything :)",
      "created_utc": 1589441664.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fql4672",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1589445615.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fql5844",
      "author": "absh_20",
      "body": "It does take practice, I agree with what was said above! Wearing big old t shirts around the house is great. Also the more recovered you get in other ways, like not dieting, the less you will bodycheck yourself and others. I can't believe I rarely do this anymore because when I wasn't yet recovered I did this all the time!!!! Good luck, just try to have hope cause it will eventually go away slowly as you strengthen the other parts of yourself that aren't the ED",
      "created_utc": 1589446675.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fqliegg",
      "author": "MissMisanthropia",
      "body": "I tend to pinch my „problem zones” (legs, stomach) and what helps me is forcing myself into touching less problematic or even likable parts (shoulders) as soon as I notice. I realized that I even like my shoulders :)",
      "created_utc": 1589458916.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fqmjgad",
      "author": "jenny_mac_",
      "body": "Definitely takes time and practice so be patient and forgiving with yourself 💖 I find that using a mental reminder like “my body does not define me” or “it doesn’t matter what my body looks like” when I notice the urge to check helps. You’re creating new neural pathways so that eventually you’ll automatically think those reassuring thoughts instead and won’t feel the urge!",
      "created_utc": 1589478445.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fqmnw3r",
      "author": "camtud",
      "body": "I've struggled with that a lot too. Something that I've found extremely helpful as an immediate solution is just covering my full body mirror with my sheets - tucking it between the mirror and the wall, making it so I'd have to use more effort to undo it. Since it's tucked in so tight, it makes it harder to want to even bodycheck.",
      "created_utc": 1589480574.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fqn00hw",
      "author": "busymcbee",
      "body": "i struggled a lot with this too in the worst of my ED and throughout much of my recovery. something that helped me was removing the full length mirror from my bedroom and replacing with one chest up to do my hair and makeup but not body check. i also take my eye contacts out before i shower lol so that i cant really see my body in the bathroom! \nanother option that my ed treatment center suggested was covering my mirrors. you can even have a fun day of painting and drawing pictures or recovery oriented quotes on paper to use to cover!! \ni have also purged my closet of anything that didnt make me feel confident. a shirt that the fit made me hate my shoulders, a pair of pants i felt gave me weird love handles. its hard but really feeling comfortable in your clothes is so important. and i dont think it has to be all hoodies and sweats!! i now love overalls and loose jumpsuits/rompers, palazzo pants, t shirt dresses. stuff thats comfy and wont make me self conscious but is also cute!!\ni have come a long way but i still struggle. i think a key step and what now and then helped me the most, is interrupting it. practice mindfulness and when you notice yourself doing it, try to redirect that energy or attention to something else. its super hard especially when its such a compulsive thing, but practice makes it (somewhat) easier.\nyou got this!!!💗",
      "created_utc": 1589486371.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fqo8k0q",
      "author": "ecbythesea",
      "body": "I’ve found that a behavioral therapy trick i used to use for OCD behaviors also works for this. Grab a timer and start with 10 seconds. When you feel the urge to look at your body, touch your arm, look at another’s body, acknowledge that you want to do it. But don’t. For 10 seconds. Then look, touch, etc.\nThen the next time it comes up, do the same thing. Etc. repeat this for one day.\nThe next day do 20 seconds, the next day 30, then 45, then a minute etc.\nWork up to 10 minutes and see how you feel. The urge to look/touch most likely will have faded and become less intense. I played around with different versions of this. The key for me was to sit in that massive urge/anxiety feeling and see how long it would take to pass. It can be excruciating, but it gets easier. The strength I felt when getting through an urge was very inspiring. Here for any other questions. (I’m not a professional by any means, just experimented with lots of different types of therapies I’ve learned over the years from amazing people and professionals).",
      "created_utc": 1589509789.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqobm4n",
      "author": "MeccaToast",
      "body": "This may still qualify as bodychecking but one thing that helps me is to switch my focus to something I don't hate or preferably like about my body. I love my high cheekbones and I have worked hard to build my shoulders and acknowledging these has helped me build a good relationship with my body.",
      "created_utc": 1589511643.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqopqkp",
      "author": "cindycindyy",
      "body": "I realized that bodychecking does nothing but put me in a negative mood and drain my energy and time (would catch myself staring at the mirror for hours feeling unhappy). I also realized that no matter how much I look in the mirror, my body will be the same. Nothing changes. It is what it is. So I kind of avoided mirrors, or once I catch myself bodychecking, I would quickly rip my eyes off the mirror and tell myself “No. Bodychecking won’t change anything. It is what it is. I can either stress about what is, or I can choose to not stress about what is.”\n\nI simultaneously adopted a body-neutrality approach as I told myself to stop bodychecking. \n\nTLDR: Bodychecking won’t change anything (it’s kind of pointless). It [your body] is what it is. You can either stress about what is, or you can choose to not stress about what is.",
      "created_utc": 1589521309.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fqm3mi8",
      "author": "MaryContrary26",
      "body": "For me, loosening the attachment to the physical body required strengthening the inner self and higher self. So I would try to shift into my heart (inner self) or practice passively observing (higher self)",
      "created_utc": 1589470930.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fqn6iu1",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1589489504.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqre833",
      "author": "Rosec627",
      "body": "You could try this but instead redirecting your thoughts to something you like about yourself, just a suggestion that may be of some help 😊",
      "created_utc": 1589582631.0,
      "score": 1,
      "context": [
        {
          "id": "fql4672",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1589445615.0
        }
      ]
    },
    {
      "id": "fqlh0so",
      "author": "chloe0120444444",
      "body": "I agree with this!! I’m also recovering, and one thing that has helped me bodycheck less is wearing big tees and loose pants. This not only makes bodychecking less ‘useful’ (since you can’t see your figure as easily), but also makes it more difficult for others to comment on your figure.",
      "created_utc": 1589457865.0,
      "score": 4,
      "context": [
        {
          "id": "fql5844",
          "author": "absh_20",
          "body": "It does take practice, I agree with what was said above! Wearing big old t shirts around the house is great. Also the more recovered you get in other ways, like not dieting, the less you will bodycheck yourself and others. I can't believe I rarely do this anymore because when I wasn't yet recovered I did this all the time!!!! Good luck, just try to have hope cause it will eventually go away slowly as you strengthen the other parts of yourself that aren't the ED",
          "created_utc": 1589446675.0
        }
      ]
    },
    {
      "id": "fqnc9ys",
      "author": "EDPostRequests",
      "body": "What exactly do you need help with? You can make a request by checking out the sidebar and clicking the link. What exactly do you mean \"free for anorexia\"?\n\nBest to you!",
      "created_utc": 1589492313.0,
      "score": 1,
      "context": [
        {
          "id": "fqn6iu1",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1589489504.0
        }
      ]
    }
  ]
}