{
  "id": "gksno8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1589625798.0,
  "title": "Request: Quarantine triggered a relapse and I’m too ashamed to tell anyone",
  "selftext": "i would say i was fully recovered/in remission for about a year before i went into self isolation in mid march. initially it started out as me not having any appetite because of one of the medications i’m on for bipolar and i gradually started skipping meals because of lack of routine/not being hungry/fear of gaining weight because i can’t work out as much. i started losing weight as i started eating less and it’s pretty noticeable but i don’t weigh myself so i’m not sure how much i’ve lost. i’ve gradually eliminated a lot of foods from my diet without even really trying and i’m scared to eat foods i was totally fine eating for a long time and i’m skipping meals everyday. it’s really easy to hide it because i’m alone 6/7 days of the week so no one is around to notice i’m not eating. i know i’m relapsing badly for the first time in a few years and i’m repressing it and lying to my therapist and the guy i’m dating about it so they don’t know anything is wrong. i guess partly out of shame and partly because it’s the only thing i feel in control of anymore. being socially isolated for so long and not knowing what’s going to happen with covid has completely decimated my mental health (i was in the best position i’ve ever been in mental heath wise before march) and i’m scared i’m never going to be able to recover to where i was before. i guess i’m just looking for other people who have been struggling with relapse in quarantine and also need support because i feel so alone in this.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gksno8/request_quarantine_triggered_a_relapse_and_im_too/",
  "score": 101,
  "num_comments": 5,
  "comments": [
    {
      "id": "fqtbsgc",
      "author": "vixissitude",
      "body": "The problem with eating disorders is that they are always there. Kati Morton explains it as they hide somewhere in your brain and when you're under stress, they come back wearing another dress. We may be doing really really well, but we always have to be careful and realise exactly where we stand from those ed thoughts, and if they're getting too close, we need to take precautions.\n\nThere's no reason to feel shame. A pandemic is a serious thing, and we as a species need socialisation so the lack of it makes us feel even worse. Johann Mari has this theory that lack of social contact is a reason why we develop depression and anxiety, because everything aside from our outer brain layer is the same as it was when our species lived in Africa. If you got seperated from your tribe back in the hunter-gatherer times, chances were you were going to die. Either by hunger or thirst, or by some animal hunting you. There's nothing more natural than you feeling depressed and anxious, he says.\n\nMy first advice would be to tell a friend, and your therapist if you're still in contact. Tell them about it. Talk about what's bothering you, what thoughts go through your head. Talk about the lack of control. You will see that pretty much everyone feels that way currently. Sharing your quarantine troubles and hearing how their mental health has been affected might help, but also them showing compassion for you will help.\n\nSecond advice: if you can, stay with a friend or your boyfriend. I don't know the conditions around you or quarantine rules in your country but if possible, stay with someone else until your mental health gets a bit better. This goes back to the idea of being with someone else would feel better, but also if you have to eat in front of someone else, you might feel more compelled to eat properly. Or even just eating your meals when they do would have you eat at least some stuff few times a day.\n\nI'd also advise to have a journal, not to log in food or anything, but to rant your feelings in. I use my journal to write in it as if I'm in a therapy session, since not being able to see my therapist is taking a toll on me. I've seen significant improvement using a journal. Not as good as a therapist, but still pretty good. \n\nJust know that you're not alone. A lot of people feel a lot more stressed and like their mental health deteriorating because of the situation we are in. It's important to realise that a lot of things are out of our control, and it's OKAY. You don't have to be in control of something. It's okay to feel stressed and lonely, because that's what we are. It's okay to have your emotions. You don't have to keep it together or stay strong or anything. Kati Morton has good videos on youtube about Covid anxiety, and even she is really anxious and doesn't know how to process everything despite being a therapist. It's okay to not be in control. Things will be uncertain for a really long time, with a new kind of normal for everyone. The only way out of this is through. Stay safe ♥️",
      "created_utc": 1589635561.0,
      "score": 33,
      "context": []
    },
    {
      "id": "fqtk8jk",
      "author": "griceyrains",
      "body": "I don't have any helpful advice to give you and I'm really not too good with words of comfort but I just want you to know that you are absolutely not alone in this!! I have been going through quite a similar experience and it's nice to know someone can relate even though I wish you weren't going through this of course! I really hope things improve for you soon",
      "created_utc": 1589640635.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fqtybcc",
      "author": "VampireDetective",
      "body": "I think admitting it to us is a great first step. That means you’re at least somewhat aware that you’re going down the wrong path and that you DON’T WANT TO!",
      "created_utc": 1589648452.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fqvnjvj",
      "author": "busymcbee",
      "body": "ah i literally could have written this exact post, also in recovery for a year, new BP meds messing with appetite, gradually meal skipping, lying to therapist and boyfriend, i relate to it all!!! \n\nI am sorry you're struggling right now, and you are most definitely not alone in this struggle! EDs often stem from and reinforce feelings of shame, and EDs are super secretive! if people know, it adds a degree of accountability and means people could check on you, but if its a secret then you can be alone with your ED. its a nasty cycle :(\n\nI commend you for writing this post! Acknowledging the relapse and asking for help is definitely a super important step. As mentioned above I recommend letting someone know. I know its hard, but it might help you feel less alone if its someone supportive. Last week I finally confessed to my therapist that I have been struggling with my food again, and we had a very productive helpful conversation that both acknowledged how difficult things are right now and discussed how I can turn things around before they get worse. Sadly, left alone with your EDs is not an easy place to pull yourself out of all alone. And theres no shame in needing that help, and asking for it. In fact, its the strongest and bravest thing you can do for yourself right now!\n\nBest of luck, and feel free to message me if you need to vent. Sending so much love",
      "created_utc": 1589681054.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fr789cf",
      "author": "Schep7",
      "body": "Wow... Reading this post i feel like this is my girlfriend. Except, my girlfriend broke up with me in early March when covid started and her eating episode began. She is also bipolar, so i can promise you that you are not alone and there are others just like you struggling. She has lost a ton of weight since early march and may even need a pacemaker for her heart. I am so concerned for her, and reading this post gives me insight into how she may be feeling. So, thank you. And i promise you are not alone. Now from someone whose also experiencing the same thing, in your opinion whats the best thing your loved one can do ? I love my girlfriend, but i am not sure what to do. She broke up with me so suddenly when her episode began. Is it best to give her time or is this a common thing for people suffering from eating disorders to push loved ones away ?",
      "created_utc": 1589941622.0,
      "score": 1,
      "context": []
    }
  ]
}