{
  "id": "gln41l",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1589748688.0,
  "title": "Request: getting really sad not letting myself eat. I’m sinking.",
  "selftext": "It’s like part of me is being a mean parent saying, you don’t get any more food. It’s making me so sad. It’s so hard to deal with. I’m not even super thin I just want to lose weight. But this really doesn’t feel good. :(",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gln41l/request_getting_really_sad_not_letting_myself_eat/",
  "score": 58,
  "num_comments": 5,
  "comments": [
    {
      "id": "fqyofcx",
      "author": "makeupyourworld",
      "body": "A mean parent wouldn’t do that. Only an abusive parent would do that and they could get their kids taken away for that. You don’t deserve to abuse yourself. Keep going, we are rooting for you. You deserve as much food as you’d like. You are entitled to it. It is your right to eat food.",
      "created_utc": 1589751903.0,
      "score": 23,
      "context": []
    },
    {
      "id": "fqyzd9o",
      "author": "nerd_girl34",
      "body": "I have been there, trust me!! It’s so hard when you are trying to lose weight for whatever reason... especially because there is such an unhealthy and unrelenting diet culture in our society. \n\nBut PLEASE try to remember that starving yourself IS NOT healthy and will not bring you the validation you are looking for. I know it is hard, but try to think about the food you eat as fuel for your body and soul. Your body needs fuel from greens, lean proteins, veggies, carbs and fats! But your SOUL needs fuel from late night cookies with friends, a slice of cake from celebrations and lots of pizza! You are depriving yourself of so much more than just calories when you don’t eat. \n\nI also definitely recommend talking to a therapist if you feel that you can’t deal with this alone (which most people can’t!!) Therapy is one of the greatest tools we have and I am a HUGE advocate for it. \n\nYou got this... you are SO beautiful",
      "created_utc": 1589757167.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fqz3xm4",
      "author": "imherefurtheanimals",
      "body": "You are worthy. Worthy of eating. Worthy of taking up space. Worthy of love. Worthy of existing. Worthy of happiness. Worthy of thriving! You are worthy of these things no matter what! \nI’m so sorry you are going through this difficult time. You can do this! Don’t forget you are loved <3",
      "created_utc": 1589759474.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fr0nwe4",
      "author": "oliviared52",
      "body": "An abusive voice in your head is exactly what an eating disorder is. I liked to think of it that there were my thoughts then there were my eating disorder thoughts that were like an annoying roommate (but an abusive parent works too). \n\nIt’s good you already recognize your ED thoughts. This took me a while into recovery. My advice is when the thoughts come, think of of them like that. Don’t try to push them out (because the more you try to push them out in my experience the more they came back) but recognize that’s the abusive roommate or boyfriend talking to you. \n\nListen to yourself. The side of you that wants to be healthy and treat your body right. From your question it’s obvious you have that voice in you too. We are only given one body. Treat it right. I know easier said than done, but I think I can speak for everyone on this thread when I say we believe in you ❤️ you deserve food ❤️",
      "created_utc": 1589801949.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fqyur98",
      "author": "somegreat",
      "body": "Thank you so so much for your support ❤️",
      "created_utc": 1589754890.0,
      "score": 2,
      "context": [
        {
          "id": "fqyofcx",
          "author": "makeupyourworld",
          "body": "A mean parent wouldn’t do that. Only an abusive parent would do that and they could get their kids taken away for that. You don’t deserve to abuse yourself. Keep going, we are rooting for you. You deserve as much food as you’d like. You are entitled to it. It is your right to eat food.",
          "created_utc": 1589751903.0
        }
      ]
    }
  ]
}