{
  "id": "gnu0wb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590055145.0,
  "title": "Request: Gaining weight during quarantine & body image issues",
  "selftext": "TW: relapse\n\n\nI have been fighting with my urge to restrict again.\nI have been in recovery for almost a year and I’d stopped weighing myself until a month ago, when I noticed I’d gained weight during this lockdown. \nSince then, I’ve been trying to fast and restrict to get rid of the pounds but I can’t do this anymore.\nIt felt fantastic not continuously worrying about how my body looks. \nI just don’t know how to feel okay when eating again. It feels extremely suffocating. \nAny help would be appreciated; I’m very thankful and proud of every single one of you 🤍",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gnu0wb/request_gaining_weight_during_quarantine_body/",
  "score": 101,
  "num_comments": 11,
  "comments": [
    {
      "id": "frbzmkx",
      "author": "None",
      "body": "You are not alone. Quarantine is really playing on peoples mental health. Try not to feel too guilty about gaining a little bit of weight, the majority of us are all in the same boat. This is just a blip in your recovery and you will get through this. Focus on you and take small steps everyday towards your recovery.",
      "created_utc": 1590060599.0,
      "score": 31,
      "context": []
    },
    {
      "id": "frc4yhn",
      "author": "None",
      "body": "Isolation and self reflection isn't easy, but it can lead to new breakthroughs. I relapsed a bit with binge/purge and my parents (who already knew) are keeping a close watch on me, but it lead to some heart to heart and created new understanding that wasn't there before. I'm discovering new things about how I respond to food and my body, and so far, having a good support system, journaling, and mindfulness practice has helped a lot. I'd say do those, and also work on forgiving yourself (which is a hard one always but it's worth it). I use Headspace to meditate and it brings me peace of mind, sometimes for a few hours, sometimes for a day. Yoga and working out helps the mind fog too. It's a process but I've shifted my perspective on recovery from seeing it as suffering to seeing it as part of a journey.",
      "created_utc": 1590064800.0,
      "score": 8,
      "context": []
    },
    {
      "id": "frc8roj",
      "author": "absh_20",
      "body": "The best thing to do is to try not to focus too much on your weight gain, wear comfy clothes and focus on what is most important right now. Eat regular adequate meals so you build some patterns in and do try meditation it may really help a lot. I've been there, we all have. Would you comment on a friend after quarantine who had gained a kilo/pound? Would you notice? I'm sure it's not as bad as you think!",
      "created_utc": 1590067290.0,
      "score": 7,
      "context": []
    },
    {
      "id": "frc4wkn",
      "author": "chloe0120444444",
      "body": "I’ve also found it really difficult to maintain the progress I’ve made with disordered eating prior to lockdown. One thing I’ve been trying to do is eating things I like. For example, I’ve had the same rice bowl for three meals in a row. It’s also helped me to make sure I eat once during the day and once during the night. This might not help too much, but if you need a friendly someone to share with, PM me :)",
      "created_utc": 1590064763.0,
      "score": 6,
      "context": []
    },
    {
      "id": "frbvs01",
      "author": "tarynjo2",
      "body": "You're way ahead of recovery than I am so I won't be able to provide much help but I just want to say try not to let whatever happens during lock-down make you feel guilty or like everything you worked so hard on is ruined. This is all scary and unknown and my recovery is having set backs as well. Forgive yourself for this is just a really crazy time and things will change and happen and that's 100% okay. None of this is permanent. Just take things one day at a time and keep reaching out and talking to others about what you're feeling because it's all valid! Try to stay strong and I will try with you and love your body before, during, and after all this!",
      "created_utc": 1590056995.0,
      "score": 3,
      "context": []
    },
    {
      "id": "frdhopp",
      "author": "Little_Bear716",
      "body": "I’ve also gained a lot of weight. I noticed that being home allows me access to constant food where at work I only had access on my lunch break or before and after work. So I’m trying to stop snacking so much and try to pay attention to when I’m actually hungry instead of bored or thirsty (I’m awful at staying hydrated anyway so that’s why this applies to me). \n\n\nI’m not reaching a goal weight. I’m reaching for health. I want to stop being winded by a single flight of stairs. I want to be able to clean my home without sitting down every 30 minutes. I want to continue  learning new hobbies to keep my hands busy so I’m not just mindlessly snacking or biting my nails off. I want to work on my mental health and I know improving the health of my body will assist in that process. \n\nDo I love my body right now, not so much but I’m working towards it. And you can too. I’m not restricting. Just watching the mindless snacking and trying to do small things to stay active. \n\n I figure walking from the kitchen to my couch with my water then back again for my phone then sitting down is better than just walking with everything then sitting down.",
      "created_utc": 1590090081.0,
      "score": 3,
      "context": []
    },
    {
      "id": "frfi1f2",
      "author": "hizzilealy",
      "body": "This is probably going to be unwelcome but recovery from caloric deficit will require you to gain weight. It’s definitely the most difficult thing to face and feels uncomfortable and is the main reason people end up in quasi-recovery or don’t ever recover. But is that what you want? Is it worth living in a torturous state constantly thinking about food and your weight and your appearance just to be thin? You and your body deserve nourishment, you deserve to eat. When you’ve restricted what you eat your body will hold onto anything you put in until you have eaten enough consistently and it can trust you again. When your body doesn’t trust you it stores water and fat to prepare for the famine it expects. To build trust you need to eat everything you crave, until you’re fully satisfied. This will mean that you gain weight if you need to, but if you keep eating to satisfaction eventually your cravings will diminish, food will no longer control your life and excess weight will shift. Recovery isn’t easy but you can absolutely do it.\n\nIf you haven’t already I would recommend watching Kayla Rose Kotecki, Elisa Oras and Tabitha Farrar on YouTube. They are all recovery coaches with personal experience of eating disorders and weight gain in recovery. They all have books too: “BrainwashED”, “Damn The Diets” and “Rehabilitate, Rewire, Recover”\n\nI wish you success in your recovery. Lockdown is the perfect time to recover and gain the weight you need because everyone in the world is in a similar position! Listen to your body, eat when you’re hungry or thinking about food and when you’re not eating rest as much as you can, read books that make you happy, do fun things that take your mind off it. Don’t weigh yourself or body-check, wear comfortable clothes. Take it easy on yourself. Much love.",
      "created_utc": 1590135895.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fredmu6",
      "author": "Lilith-Rising",
      "body": "You’re allowed to want to get rid of the pounds, but always be mindful of how that’s going to SERVE YOURSELF and understand that NO MATTER the method, you must learn patience and existing in your current body as is in each moment! Even if you’d starve yourself, it’s not instant, so might as well get success coping methods for any time you need patience and grounding, you’ll do yourself good in the long run and avoid relapse. Meditation, breathing, and yoga can help the distress to get through the day, and focusing on how you FEEL can help distract from what you WEIGH. If your knees hurt from the weight, taking gentle walks or learning strengthening exercises are alternatives to fasting that people can find helps prevent them from focusing on the eating part too much. If it’s simply a number that’s haunting you and you don’t have health concerns, there’s no shame in ditching the scale  all together! There’s always a work around that will work for you, so don’t feel discouraged! :)",
      "created_utc": 1590106875.0,
      "score": 2,
      "context": []
    },
    {
      "id": "freeun4",
      "author": "vulchiegoodness",
      "body": "Quarantine is fucking with everyone. Boredom, stress, and ample time to brood. my BED is off the fucking chain. the one thing i know that works for me is IF. I wish my brain worked properly, and i knew when to stop. i feel like it isnt as hard for other people (without disordered eating) to just stop. I dont have an answer for you, but youre not alone.",
      "created_utc": 1590107581.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frqt38g",
      "author": "saide33",
      "body": "I am so glad you posted this. I was extreme worried until I saw how many people are struggling with this as well. It's so hard being at home with essentially unlimited access to a food stockpile, and almost no motivation to go outside. Exercise is my bad method of purging so I've definitely gained a good 10 pounds during all of this. It's hard, but I'm optimistic that I, and all of you guys, can get through it.",
      "created_utc": 1590387087.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frfec1a",
      "author": "boondoxjr06",
      "body": "I've lost weight",
      "created_utc": 1590132314.0,
      "score": 1,
      "context": []
    }
  ]
}