{
  "id": "gophaw",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590173954.0,
  "title": "Request: worried about my sister, can I post this?",
  "selftext": "I (18F) am worried. First, I apologize if I'm being insensitive in any way, I'm new to the concept of this and it's my first time posting here. My sister is 16, and I have noticed that she's been eating less and less over the past year. At first, I figured she was just doing a slight caloric deficit to lose a little weight, as although she's not fat, she is a little overweight which she had told me before she wanted to do something about. I think she looks beautiful at any weight, but she dismissed me. Over the past few months, since quarantine started, and I've been home from University more and able to see what she eats all day, it's a startlingly low amount! Yesterday I heard her talking with my brother (10), saying \"omg, I ate Soo much today\". He asked what she ate. She said she ate some blueberries, and a protein bar. As a regular gym goer and lifter, I'm used to tracking calories (for weight GAIN so I can build muscle!) So I quickly realized that this was far less than a healthy intake! \nNow, Im athletic, and toned, so naturally I've become slim from exercising so much. But I also eat a LOT because I lift weights. I eat more than 4x the Cal's a day as she does, and I know that she envies my body, because we've talked about it before. And I myself have very good self confidence and I've never had an ED so it's really hard to understand where she's coming from? I don't mean that to sound bragging but that's how it is.\nI've tried talking to her about nutrition, and how she needs to eat  when she's hungry. She says she never feels hungry. I offer to make her food, and I go out of my way to show her that she does not need to next to nothing to lose weight. I try to eat big meals when she's downstairs to show her that food isn't making me overweight, and that you can still enjoy food and be fit and healthy.  Right now, my sister is still \"overweight\", but I know that you don't have to be rail thin to have an ED.  I don't know what to do about helping her...I don't know how to talk to her? I worry about making things worse somehow? Do you guys have any ideas?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gophaw/request_worried_about_my_sister_can_i_post_this/",
  "score": 56,
  "num_comments": 12,
  "comments": [
    {
      "id": "frh6l6b",
      "author": "iwantanorangemouse",
      "body": "First of all, let me just say that you’re an amazing and attentive sibling. Your care and concern for her is rare amongst family members, and just having one supportive person in her life will make all the difference when she recognizes that she’s ill and needs to recover. You’re right that you don’t need to be thin to have an ED; and it definitely sounds like she has one. The restriction, bragging about not being hungry, and trying to get validation of how little she’s eaten from your other sibling all sound very familiar to me. You should sit down with her and talk about the reality of this disorder. If she lets this get worse, it WILL dominate her entire life and rob her teenage years. Believe me, my disorder took away so many of my formative experiences that should have been nothing but happy; now my senior year, high school graduation, birthdays, hanging out with friends, summers, etc. are remembered as incredibly bitter, anxious, and scary times. And the disorder doesn’t just go away; I fight it every single day despite being in recovery. Eating disorders are the #1 fatal mental illness, and she needs to ingrain this in her mind. She needs to get real help before it gets any worse. I would tell your parents as well, honestly. She’s a minor and they should get her in therapy before she turns 18 and can refuse any help. This isn’t something that just “goes away”. Professional help is 100% necessary.",
      "created_utc": 1590174441.0,
      "score": 42,
      "context": []
    },
    {
      "id": "frigsn1",
      "author": "kourtroom",
      "body": "I mainly agree with the other comments here, but I do want to add something that perhaps hasn’t been said yet. This is a personal opinion of mine having gone through diagnosed anorexia before, so I understand if it isn’t applicable to your situation. \n\nWhen you talked about how you are generally much more toned than she is & work out more etc, you were right that she probably/does envy you. However, it is probably to a greater extent than you realize. Further, talking about it (your body) with her is, in my humble opinion, a very bad route to go. When I had my disorder, I hated people who looked how I wanted to. I don’t have a sister so it could be different, but any time the conversation was about somebody else’s seemingly perfect body, it made me even more upset & hate them more. As such, even discussing your own body with her in the sense of “you can get here too if you do this and this!” is just not a good way to go. Comparison is the devil when it comes to eating disorders. Do not even open the door for conversation about your own body, even as inspiration. She will never look like you, so it is simply in vain to even mention that. Encourage her to work to be the best version of herself. You two sound like you’re different body types, & that’s okay, but you both would do well to realize this. \n\nAgain, not that your sister hates you, but you need to understand the thought process behind disorders. Simply eating big meals around her to “show her it won’t make her fat” is something that would have triggered me immensely. The way a disordered mind sees that, they won’t think how you’re thinking about “Oh, look, it’s okay to eat,” they’ll probably envy you even more & restrict even more. I hated eating around people for this reason; how can everyone eat so much & stay skinny, but I can’t? Metabolisms & workout habits vary from person to person. Your sister could work out as much as you do but her metabolism could be slower & thus scientifically she may not be able to eat as much as you without gaining weight. It’s important for you to realize that your body works differently than hers does, & so does her mind. Initially, this may seem obvious, but do some thinking on it. Whatever her internal motivations are, I guarantee you they are far different than your own. \n\nI apologize if this came off as rude at all. That wasn’t my intent. I just tend to find that being blunt is a better way to communicate a point than beating around the bush. Again, this is all from my own experience & my process of thinking. My point in writing this was to perhaps open your eyes to her point of view.",
      "created_utc": 1590200182.0,
      "score": 12,
      "context": []
    },
    {
      "id": "frh7p2k",
      "author": "jazzandcaffeine",
      "body": "So it seems like you have a really healthy diet and exercise regime, I’d really suggest maybe encouraging her to work out with you as she can adopt healthy habits that way, it would really encourage her to think positively about food and her weight and keep her healthy. Plus, you’re a really healthy good role model for her to have, it’ll be good for her to know that she’s got a solid support network of someone who understands eating healthy and exercise as a lifestyle not as a way to lose weight. I really hope she’s okay and if you or her need anyone to talk to then i’m more than happy to help",
      "created_utc": 1590174997.0,
      "score": 7,
      "context": []
    },
    {
      "id": "frhppsp",
      "author": "None",
      "body": "I don’t know if it’s an ED, and nobody else on here is a licensed professional so I don’t think anyone else could tell you either. \nBut, we can share our experiences and guide you to help her. \n\nDo you know if there are drastic changes in her diet? Not in sizes, but she will refuse to eat certain foods under no circumstances. \nWhen I was 12, I went vegetarian and gluten free just so I had an excuse to not eat certain foods. \n\nI know she’s telling you that she’s only eating a little protein bar, but all of us can tell you that with restricting comes bingeing. A lot of it. Does she eat secretly in her bedroom and hide the wrappers? \nDoes she have problems eating in front of others (friends/boyfriends). \nAs you said she’s a little bit overweight, and she could simply be mimicking your habits to strive for what you have (since she looks up to you). Do you talk about eating protein bars and lifting weights? She could just be trying to mimic her older sister who she likes a lot :).\n\nA lot of us on here will say she has an eating disorder. It’s because a lot of us can’t fathom losing weight without an unhealthy relationship with food. I don’t think it’s to the point yet so far where you need to tell your parents or seek outside professional help. But I do think it’s really sweet that you notice and are concerned about her <3\n\nBeing a teenager is weird. Especially as a girl. I don’t really think there’s any girl who hasn’t gone on some diet. Going on a diet doesn’t equal an eating disorder. I just think from your perspective, who is super athletic, eats a lot and never worries about body image, it could be hard for you to grasp that. There are some red flags I would look out for though, but nothing right now scares me.",
      "created_utc": 1590184267.0,
      "score": 5,
      "context": []
    },
    {
      "id": "frhte7h",
      "author": "monalisaselfie",
      "body": "I agree with most of what's been said. I just want to add that if (and you should) you talk to your parents about it and advise them to get her in therapy, please tell her first. I don't know your parents but seeing as you are a very attentive and compassionate sibling, it seems you might be better at communicating with her than your parents. This way she is prepared for when they talk to her. It won't feel like a surprise and may feel like less of an ambush if that makes sense.",
      "created_utc": 1590186261.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frhzhep",
      "author": "rdows365",
      "body": "Getting her to a therapist is probably the best option, but I know it can feel like the nuclear option. If you can, take her to the gym with you. Teach her to lift. A big factor in my eating habits, like you, is my lifting and exercise regimen. If I don’t eat, my lifts and workouts are junk and I don’t feel good overall, and that forces me to stay honest with my intake. Just make sure she doesn’t feel like she has to “earn” her calories. Mention how good it is to eat X food after X workout, that sort of thing. Positive reinforcement. \n\nYou’re a good sibling, OP.",
      "created_utc": 1590189698.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frieouv",
      "author": "None",
      "body": "Everyone in the comments has already given great advice for helping your sister, but another aspect to think about is how this is effecting your younger sibling. You should talk to your sister about making comments such as the ones you mention (about eating “so much” etc) around your little brother because all though eating disorders are rare in boys, they do happen, and hearing that kind of talk will impact his relationship with food. You seem like an extremely caring person and your sister is so lucky to have you.",
      "created_utc": 1590198833.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frh76m9",
      "author": "None",
      "body": "Thank you for this <3 I'll try having a serious talk with her. My mom is also aware of the situation, and has also tried to help. She's a very emotionally closed off person, so she won't open up to us at all. My family isn't well off at all, so I don't know if we could afford therapy..",
      "created_utc": 1590174742.0,
      "score": 8,
      "context": [
        {
          "id": "frh6l6b",
          "author": "iwantanorangemouse",
          "body": "First of all, let me just say that you’re an amazing and attentive sibling. Your care and concern for her is rare amongst family members, and just having one supportive person in her life will make all the difference when she recognizes that she’s ill and needs to recover. You’re right that you don’t need to be thin to have an ED; and it definitely sounds like she has one. The restriction, bragging about not being hungry, and trying to get validation of how little she’s eaten from your other sibling all sound very familiar to me. You should sit down with her and talk about the reality of this disorder. If she lets this get worse, it WILL dominate her entire life and rob her teenage years. Believe me, my disorder took away so many of my formative experiences that should have been nothing but happy; now my senior year, high school graduation, birthdays, hanging out with friends, summers, etc. are remembered as incredibly bitter, anxious, and scary times. And the disorder doesn’t just go away; I fight it every single day despite being in recovery. Eating disorders are the #1 fatal mental illness, and she needs to ingrain this in her mind. She needs to get real help before it gets any worse. I would tell your parents as well, honestly. She’s a minor and they should get her in therapy before she turns 18 and can refuse any help. This isn’t something that just “goes away”. Professional help is 100% necessary.",
          "created_utc": 1590174441.0
        }
      ]
    },
    {
      "id": "frir0lc",
      "author": "DNetherdrake",
      "body": "The issue with this is that working out together could very, very easily turn into a way for her to purge. It may help, for all the reasons you said, but it may also make it worse by providing an easy and discreet way to purge. It's a risk, and it's worth considering.",
      "created_utc": 1590207151.0,
      "score": 5,
      "context": [
        {
          "id": "frh7p2k",
          "author": "jazzandcaffeine",
          "body": "So it seems like you have a really healthy diet and exercise regime, I’d really suggest maybe encouraging her to work out with you as she can adopt healthy habits that way, it would really encourage her to think positively about food and her weight and keep her healthy. Plus, you’re a really healthy good role model for her to have, it’ll be good for her to know that she’s got a solid support network of someone who understands eating healthy and exercise as a lifestyle not as a way to lose weight. I really hope she’s okay and if you or her need anyone to talk to then i’m more than happy to help",
          "created_utc": 1590174997.0
        }
      ]
    },
    {
      "id": "fseqfeu",
      "author": "DebbyRyansCrossEyed",
      "body": "Thats a bad idea. She'll probably start comparing herself to her sister and just fuel her own self-hatred even more. Its her own journey and unfortunately, she needs to just learn to form healthy relationships with her food and herself BY herself. But my heart goes out to her and the sister because it is a disorder that can put wedges between family members. Id say the best thing older sis can do is just listen to younger sis if she decides to rant about her frustrations and not make any off hand comments about weight, food, exercise or comparisons.",
      "created_utc": 1590918376.0,
      "score": 0,
      "context": [
        {
          "id": "frh7p2k",
          "author": "jazzandcaffeine",
          "body": "So it seems like you have a really healthy diet and exercise regime, I’d really suggest maybe encouraging her to work out with you as she can adopt healthy habits that way, it would really encourage her to think positively about food and her weight and keep her healthy. Plus, you’re a really healthy good role model for her to have, it’ll be good for her to know that she’s got a solid support network of someone who understands eating healthy and exercise as a lifestyle not as a way to lose weight. I really hope she’s okay and if you or her need anyone to talk to then i’m more than happy to help",
          "created_utc": 1590174997.0
        }
      ]
    },
    {
      "id": "frh7dbu",
      "author": "iwantanorangemouse",
      "body": "I’m not well-off (broke college student), but sometimes therapists offer rates on a sliding scale depending on income so def try to research into that!",
      "created_utc": 1590174835.0,
      "score": 5,
      "context": [
        {
          "id": "frh6l6b",
          "author": "iwantanorangemouse",
          "body": "First of all, let me just say that you’re an amazing and attentive sibling. Your care and concern for her is rare amongst family members, and just having one supportive person in her life will make all the difference when she recognizes that she’s ill and needs to recover. You’re right that you don’t need to be thin to have an ED; and it definitely sounds like she has one. The restriction, bragging about not being hungry, and trying to get validation of how little she’s eaten from your other sibling all sound very familiar to me. You should sit down with her and talk about the reality of this disorder. If she lets this get worse, it WILL dominate her entire life and rob her teenage years. Believe me, my disorder took away so many of my formative experiences that should have been nothing but happy; now my senior year, high school graduation, birthdays, hanging out with friends, summers, etc. are remembered as incredibly bitter, anxious, and scary times. And the disorder doesn’t just go away; I fight it every single day despite being in recovery. Eating disorders are the #1 fatal mental illness, and she needs to ingrain this in her mind. She needs to get real help before it gets any worse. I would tell your parents as well, honestly. She’s a minor and they should get her in therapy before she turns 18 and can refuse any help. This isn’t something that just “goes away”. Professional help is 100% necessary.",
          "created_utc": 1590174441.0
        },
        {
          "id": "frh76m9",
          "author": "None",
          "body": "Thank you for this <3 I'll try having a serious talk with her. My mom is also aware of the situation, and has also tried to help. She's a very emotionally closed off person, so she won't open up to us at all. My family isn't well off at all, so I don't know if we could afford therapy..",
          "created_utc": 1590174742.0
        }
      ]
    },
    {
      "id": "frh7jig",
      "author": "None",
      "body": "I will, thank you so much!",
      "created_utc": 1590174921.0,
      "score": 3,
      "context": [
        {
          "id": "frh6l6b",
          "author": "iwantanorangemouse",
          "body": "First of all, let me just say that you’re an amazing and attentive sibling. Your care and concern for her is rare amongst family members, and just having one supportive person in her life will make all the difference when she recognizes that she’s ill and needs to recover. You’re right that you don’t need to be thin to have an ED; and it definitely sounds like she has one. The restriction, bragging about not being hungry, and trying to get validation of how little she’s eaten from your other sibling all sound very familiar to me. You should sit down with her and talk about the reality of this disorder. If she lets this get worse, it WILL dominate her entire life and rob her teenage years. Believe me, my disorder took away so many of my formative experiences that should have been nothing but happy; now my senior year, high school graduation, birthdays, hanging out with friends, summers, etc. are remembered as incredibly bitter, anxious, and scary times. And the disorder doesn’t just go away; I fight it every single day despite being in recovery. Eating disorders are the #1 fatal mental illness, and she needs to ingrain this in her mind. She needs to get real help before it gets any worse. I would tell your parents as well, honestly. She’s a minor and they should get her in therapy before she turns 18 and can refuse any help. This isn’t something that just “goes away”. Professional help is 100% necessary.",
          "created_utc": 1590174441.0
        },
        {
          "id": "frh76m9",
          "author": "None",
          "body": "Thank you for this <3 I'll try having a serious talk with her. My mom is also aware of the situation, and has also tried to help. She's a very emotionally closed off person, so she won't open up to us at all. My family isn't well off at all, so I don't know if we could afford therapy..",
          "created_utc": 1590174742.0
        },
        {
          "id": "frh7dbu",
          "author": "iwantanorangemouse",
          "body": "I’m not well-off (broke college student), but sometimes therapists offer rates on a sliding scale depending on income so def try to research into that!",
          "created_utc": 1590174835.0
        }
      ]
    }
  ]
}