{
  "id": "gp2r1v",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590230152.0,
  "title": "Request: Eating Disorder and relationship question",
  "selftext": " \n\nI've had anorexia since I was 14. There was a brief period in high school where I was a healthy weight, but other than that, I've been underweight. When I met my current boyfriend, I was probably about 10 pounds heavier than I am now. My boyfriend usually doesn't talk about my weight or eating disorder because he knows it upsets me. He also doesn't believe in marriage because he thinks it's outdated and has a negative experience with it (his parents and a lot of his friends' marriages have ended in divorce). I've always wanted to be married, but I love my boyfriend and want to be with him, so I've put the topic aside. Recently, I brought up my eating disorder (I forget the specific context), and he said, \"What if you got to and maintained a healthy weight, I would marry you? Would you do it then?\" I honestly am not sure because we have some communication issues that we're currently working on in couples' therapy. Any advice or input would be greatly appreciated!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gp2r1v/request_eating_disorder_and_relationship_question/",
  "score": 51,
  "num_comments": 15,
  "comments": [
    {
      "id": "frjgwgu",
      "author": "bigfatgorilla00",
      "body": "One side of me thinks it’s a sweet thing to say, another part of me finds it an odd thing to say. An eating disorder is not something you can change just like that, lets say he marries you, an eating disorder is not that simple and wont just disappear (that’s how I experience it atleast). He should respect that. I don’t think he means it like that though, I bet he really cares about you but marriage shouldn’t be about “if you do this, I’ll do this” it should be an mutual feeling that you both wanna do for yourselves out of love, not out of a compromise.",
      "created_utc": 1590232200.0,
      "score": 39,
      "context": []
    },
    {
      "id": "frjhawe",
      "author": "f-f-fuckit",
      "body": "It’s hard to have any meaningful input because I don’t know anything about your relationship but my gut interpretation of what you’ve said is that he wants the best for you and is willing to compromise on something he feels fairly strongly about if it will help you achieve a healthier weight. Reading between the lines he loves and cares about you a hell of a lot. \n\nThat being said I don’t think that his approach is necessarily the best idea even with the best intention. I tried to do something similar once and it just blew up in my face. I was like when I’m a healthy weight we can have our third baby and then got caught pregnant and it was frankly a disaster that has set me back a long way. \n\nPeople who have not personally struggled with eating disorders tend to really struggle to grasp how they work. Maybe if you’re opening dialogue about your eating disorder it might be helpful to provide him with some resources he can read through in his own time to aid his understanding? Also with respect to the offer I think it’s something best discussed again in your relationship counselling because you would be completely reasonable to say “that’s not what I want or why I want you to marry me” etc and if you guys sometimes struggle to communicate it might be difficult to get the across in the way you intend and he may have a hard time hearing what you’re actually communicating even if you do. At the end of the day we are all only human. \n\nLike I say this is my gut reaction based off limited information and no knowledge about you/your bf/your relationship so take it with a pinch of salt and wishing you all the best.",
      "created_utc": 1590232618.0,
      "score": 10,
      "context": []
    },
    {
      "id": "frjh3vu",
      "author": "AnotherAurora",
      "body": "While he is not forced to marry anyone, he most certainly shouldn’t put that kind of pressure on you, especially that one-sided. He wants to support your journey but is insecure about his role in this and turn desperate and throws out any words to motivate you he can find.",
      "created_utc": 1590232413.0,
      "score": 4,
      "context": []
    },
    {
      "id": "frkgm1d",
      "author": "timeforbedplease",
      "body": "You should bring this up in your next counseling session. He  may not understand why what he said was innaproriate. Having a partner with an ED or a history of one can be tricky, and being educated on how to support someone recovering is very important. This might also be an opportunity for you to bring up your different views on marriage. It sounds like he was trying to help, I'm glad that you have a support system!",
      "created_utc": 1590256051.0,
      "score": 3,
      "context": []
    },
    {
      "id": "frjgpqb",
      "author": "None",
      "body": "To be honest I think it’s a lot of pressure from his side. It’s not fair. \nI mean I don’t know you and I don’t know him and I hope your happy in your relationship, that’s the most important part. \nBut I think that has nothing to do with love. I guess he’s desperate and just want the best for you and wants you to be healthy and happy but you won’t get healthy when you just put on some weight because he promised you to marry you then. \nI mean he said he don’t believe in marriage?! Will this change with a different weight? \nYes in relationships you always need to find reasonable compromises but compromises who put a lot of pressure to one person and not to the other aren’t fair, are they? \nYou should never put such pressure on your significant other, specially when it comes to mental health. \nMaybe I’m all wrong but I think he should try another way of supporting you in your recovery. \nIf he really loves you he will marry you no matter what weight you have.",
      "created_utc": 1590232004.0,
      "score": 3,
      "context": []
    },
    {
      "id": "frjltev",
      "author": "hungerkunstler_",
      "body": "How did you feel about it?",
      "created_utc": 1590236899.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frjm7pl",
      "author": "amandalucia009",
      "body": "maybe you both ought to look at some of those issues before thinking about marriage: perhaps because of his background he’s somehow recreating pain by being in a relationship with someone with an ED & i’d guess as the one with the disorder there are a lot of underlying reasons why you cope in a disordered way\n\ni guess what i’m saying is: healing isn’t about the weight as much as it is about healing & recovering the reasons why we have unhealthy coping mechanisms. are there any ways he copes in an unhealthy way? is he working on improving them, too?",
      "created_utc": 1590237242.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frkn22v",
      "author": "mysterous_snail444",
      "body": "you need to recover regardless. it’s worth it :) if you aren’t sure about marrying him... DONT! your reason for recovery is to survive and becomes better.\n\n~mysterious snail 🐌",
      "created_utc": 1590259555.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frl37q7",
      "author": "cjx888x",
      "body": "Sounds like he wants to help/see you recover and he cares about you. It’s also clear that he doesn’t understand that this approach is unhealthy for both of you. \n\nTalk to your therapist about it! Your bf may just want to help, and if that is the case the two of you can work on figuring out what that could look like while being healthy for both of you (assuming you want him to participate in your recovery on that level). Or, he may not feel comfortable being involved, and just wishes he could do something that would help get you where you need to be while keeping a boundary for himself.",
      "created_utc": 1590268695.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frlbug1",
      "author": "Lily_Le_Narwhal",
      "body": "I struggle with that as well ever since I was 11 and now I am 13. I am not really experienced in that realm but I do know he cares. He really must love you if he went out of his way to do something he knows you love and he doesn’t. That’s a good man. You should try telling him or explaining how you feel and what it is like to suffer with this disorder and make sure he understands. Then set up little rules for yourself like eat 2 meals and a snack at least every day. Or tell yourself one good thing every day. I am not a professional but I think you should also go to a therapist. I wish you luck on your journey!",
      "created_utc": 1590273535.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frmhvmc",
      "author": "Separate-Time",
      "body": "He is wrong.\n\nim not the type of person, normally who likes to give strangers relationship advice, because of how complex it may be in real life and not virtual\n\nBut he is wrong, because marriage is an eternal bond. One mustn't say \"if you become a healthy weight, then ill marry you\", since that implies he will leave you if you relapse back to an unhealthy weight... So you need to explain that.\n\nMaybe that's why there are so many divorces in his family.",
      "created_utc": 1590301532.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frjfp40",
      "author": "None",
      "body": "He’s cute",
      "created_utc": 1590230916.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frlzrel",
      "author": "knittorney",
      "body": "OK this guy is a keeper. Here’s why:\n\nHe’s asking you to do this because he loves you. He doesn’t know how else to ask. He needs to be sure you love yourself before he commits to you.\n\nThink about it this way. Your boyfriend has watched you try and starve yourself to death. That is fucking terrifying. I have watched a person I love very dearly almost drink himself to death, and it is the WORST feeling to be so completely helpless while he self-destructs. It also makes me so angry that he cannot see the beauty in him that I see, so he tries to destroy everything. I am so afraid to lose him and so afraid I will be powerless to stop it. \n\nHe’s asking you to prove to him that you are serious about caring for yourself. The number on the scale is just one way to show that, but it means something. It’s something he can see and verify and trust, because, look: you have lied to him. He has seen you check a calorie label and then cheerfully tell him you don’t care, when both of you know that damn well isn’t true. It’s the equivalent of you asking him, if he were an alcoholic, if he never drank again would you marry him. \n\nMarriage, especially to people whose parents have been through it (and trust me—divorce is usually good for the kids, it’s just the lead-up that’s the problem, and sometimes the aftermath), means fucking everything. He tells you he doesn’t believe in it because he believes the opposite. Marriage is the most fucking important thing in the world to this guy because he means it and he won’t do it lightly and he needs to know that if you’re in, you’re fucking IN.\n\nYou don’t need to prove anything to him—he’s already convinced. You need to prove it to yourself.",
      "created_utc": 1590288040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frjxeyn",
      "author": "houston_veronica",
      "body": "I super back up this response entirely - I have had AN for 14+ years, but am in recovery thank God - it's still very much in my world, but I am stronger. I would highly recommend (for your SO, but also for anyone on this thread) the book \"The Golden Cage\" - it's written by the \"pioneer\" of Anorexia understanding/research, Hilde Bruch.  It's from the 70s, but when I read it, I was like \"this. This is everything I feel.\" -",
      "created_utc": 1590245208.0,
      "score": 3,
      "context": [
        {
          "id": "frjhawe",
          "author": "f-f-fuckit",
          "body": "It’s hard to have any meaningful input because I don’t know anything about your relationship but my gut interpretation of what you’ve said is that he wants the best for you and is willing to compromise on something he feels fairly strongly about if it will help you achieve a healthier weight. Reading between the lines he loves and cares about you a hell of a lot. \n\nThat being said I don’t think that his approach is necessarily the best idea even with the best intention. I tried to do something similar once and it just blew up in my face. I was like when I’m a healthy weight we can have our third baby and then got caught pregnant and it was frankly a disaster that has set me back a long way. \n\nPeople who have not personally struggled with eating disorders tend to really struggle to grasp how they work. Maybe if you’re opening dialogue about your eating disorder it might be helpful to provide him with some resources he can read through in his own time to aid his understanding? Also with respect to the offer I think it’s something best discussed again in your relationship counselling because you would be completely reasonable to say “that’s not what I want or why I want you to marry me” etc and if you guys sometimes struggle to communicate it might be difficult to get the across in the way you intend and he may have a hard time hearing what you’re actually communicating even if you do. At the end of the day we are all only human. \n\nLike I say this is my gut reaction based off limited information and no knowledge about you/your bf/your relationship so take it with a pinch of salt and wishing you all the best.",
          "created_utc": 1590232618.0
        }
      ]
    },
    {
      "id": "frll7gi",
      "author": "mceb16",
      "body": "I feel like it’s not a good foundation to base a marriage on. I want him to marry me because he loves me and wants to spend the rest of his life with me (cheesy, I know), not as a bargain or trade-off.",
      "created_utc": 1590279007.0,
      "score": 2,
      "context": [
        {
          "id": "frjltev",
          "author": "hungerkunstler_",
          "body": "How did you feel about it?",
          "created_utc": 1590236899.0
        }
      ]
    }
  ]
}