{
  "id": "gqf512",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590427516.0,
  "title": "Request: How to healthily lose weight without spiralling into binge/restrict cylce",
  "selftext": "request: binge restrict cycle\n\nI am at a normal (higher end of normal) weight. I used to be overweight, but I restricted calories to lose weight. I was quite strict with this restriction and lost my period for 2 months.\n\nI was afraid of all the negative effects dieting has had on my life. I was also under a lot of stress due to adapting to online school and other projects. So I let myself eat a little more and I kindof freaked out because I gained back some of the weight I lost and tried to lose it again.\n\nNow I am in a weird binge restrict cycle where I am just compelled to eat anything and everything at night until I am uncomfortably full, then going back into diet mode and running, and I hate myself through all of it. \n\nTried intuitive eating, did not work because I have completely fucked up my hunger signals. I hate how I feel so out of control, like I'm spiralling\n\nThe messed up part of it is that I am so afraid of gaining back weight and I still want to lose weight because I still feel fat. I know I could lose weight, I just don't know how to do it healthily and not spiral like I always do and end up eating it back\n\nHelp would be much appreciated",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gqf512/request_how_to_healthily_lose_weight_without/",
  "score": 65,
  "num_comments": 15,
  "comments": [
    {
      "id": "frt0wkh",
      "author": "None",
      "body": "The main concern I hear from anyone with an eating disorder is “I don’t want to gain weight.”  \n\n1st, start watching Eating disorder RECOVERY videos and practice mindful eating (I also suggest YouTubing SUPER SKINNY ME.  It’s about two journalists EXPERIMENT to achieve size 0 and they do as they descend into this crash diet, one journalist with a past history of insecurities to begin with goes off the deep end and ends up going into a refeeding clinic, but the other stronger journalist will take a vacation and ends up pigging out to get back to her set weight/size, gets a bit bigger but goes back to normal.  Keywords: start-preparing-yourself-if-you-want-to-be-healthy).  Google/YouTube mindful eating.  Practice that.  By doing this will you begin to listen to your body.  Takes 15-20 minutes of slow eating to register your tummy is full.  Unlike that fast eating because you body has starved itself and desperately fighting back.  You slowly eat, your body won’t fight back.  Very important to find a dietitian.\n\n2nd, your stomach is used to being rid of food once you start eating and digesting will make your stomach appear bigger but it will go back to being normal.\n\n3rd, VERY IMPORTANT** call a free mental helpline (suicide helplines always help or psychiatrist, psychologist, therapist) when things go tough and you’re experiencing these changes- know one day you are steadily recovering but your body wants to pig out and if you do, start again DO NOT revert back to “if it’s not perfect, I will ruin my day.”  You have choices, you can restart your day again.  It forces you to activate your feelings that you have hidden with your addiction.  Talk out your fears.  Talk out what has hurt you but also talk about the great things that will happen too.  With all this talking you might even be your best SELF-DETECTIVE and slueth out why you started controlling your body.  Biggest question why have you used an addiction to replace talking out your feelings?\n\n4th, you have a set weight.  Like dog breeds, if you’re meant to be a set weight.  If you’re a lab don’t expect to be a greyhound.  If you’re a corgi, love yourself for being a corgi!  If you’re a Newfie, stand strong and proud!  You gotta love the breed you are.  All body types depend On different fuel.  If you slip up and eat junk food for one day, that’s ok.  All healthy people pig out and the best part of having HAD an eating disorder you’re more aware and you go back to routine.  Love you are different and that is what makes you, you!\n\n5th, after you’ve done steps 1-4, know nothing is perfect and stop comparing yourself to people.  WHO. ARE. YOU?  It will help you to just sit in a park and people watch and see people come in all shapes and sizes and people come with their own personalities, what-is-your-personality?  Who are you?  We all age.  Start planning to be older, start planning for life.  Understand your past but you have to forgive it to enjoy your future.  Start getting to know who you are and FIND who you are.  \n\nPlease know you can’t depend on anyone, this is your own road to battle.  The biggest love you can give to another human being is encouraging them to be “self sufficient”.  That goal is worth more than any money and will help you aim for a rich and successful life.  Being self sufficient is a very appetizing and achievable goal.  \n\nThe biggest question for you, are you ready to give up your unrealistic demands on your warped body image and are you willing/wanting to be healthy?  Good luck!j",
      "created_utc": 1590441153.0,
      "score": 18,
      "context": []
    },
    {
      "id": "frsrdgu",
      "author": "poltergeistjpg",
      "body": "Hey there! I have the exact same problem. I’m overweight and fell into a bad binge/restrict cycle when trying to lose weight. \n\nFor right now, instead of focusing on losing weight, it might be better to solely focus on helping your hunger signals and disordered eating habits. By focusing on losing weight, it helps feed those disordered thoughts and can only contribute to a binge/restrict cycle. \n\nMaybe seek a therapist and dietitian who can safely get you back on the right track of eating well. If you feel comfortable and confident enough, possibly discuss the idea of losing weight with them, but your mental health and physical health is way more important than losing a few pounds. You deserve to be happy and healthy no matter what. Stay strong! 💙",
      "created_utc": 1590436128.0,
      "score": 14,
      "context": []
    },
    {
      "id": "frsrzxv",
      "author": "None",
      "body": "You have to break the cycle. Even if you binge, and I know it will be tough, don’t restrict the next day. Eat a normal balanced diet during the day regardless of the binges. You should eventually feel satisfied at the end of the day that you won’t feel compelled to binge. Once the binges stop completely, THEN you can restrict calories a normal amount (500 less than your TDEE, don’t go below 1200). You will need to accept that by doing this, you will at first gain weight because you aren’t compensating for overeating but in the long run this is the only way to get out of the cycle. \n\nI say all of this but I’m stuck in the same cycle so I  know how hard it is. I wish you the best.",
      "created_utc": 1590436456.0,
      "score": 10,
      "context": []
    },
    {
      "id": "frsyc24",
      "author": "2jz93",
      "body": "Hey there. I’m not over weight but fear that I may be if I continue this. I feel like it’s an anxiety/control issue ?",
      "created_utc": 1590439795.0,
      "score": 5,
      "context": []
    },
    {
      "id": "frulmzq",
      "author": "Cedrys",
      "body": "This gonna be a bit long, but I  can relate on so many levels...\n\nI first went on diet when I was 15, was around 70 kg (I am 164 cm, 5'4), went down to 51 in half a year, with rigorous cardio exercise and telling myself I was eating like 1000 calories a day (probably it was more like 700  or less and also hiding food around my cupboards so mum wont know I didn't eat my school lunch). Of course, I gained the weight back (like 13 kg in 4 months) crying while eating. What ensued was a never-ending circle of going of superbly restricted diets (like 500 kcal) for a period of time and then gaining it all back due to binge eating (usually plus some but never got back to 70). Sometimes I would manage to eat normally for like a month or so. When I first went on diet, lost my period and would sometimes get very dizzy; later I was lucky and my health didn't deteriorate too much - apart from bad skin and broken blood vessels in my eyes) Now I am 21. For the past two years, I've been struggling with mild bulimia, coming, going and intensifying in a cycle. But yeah. At the end of March, I've said \"enough\", freaking tired of never-ending yoyoing, binging, purging and feeling like shite. My job has closed and uni went ahead with online teaching, so I went back to my parents' house with loads of free time to cook and more energy to do things (I work in a fast food 4 days a week and I'll tell u its like super tiring both physically and mentally).  Stopped counting calories because it triggers me.  It took 6 years and a global pandemic, but for the first time ever, I think I am on the right track (or at least better than I was).\n\nAnyway,  the way I am doing it is (it might not work for you, just saying) - I eat protein and carbs at every meal - 3 meals a day at more or less set times (its 8am, 1 pm and 6 - 7 pm but I would fit them into ur own day plan), sometimes a small snack - like fruit or yoghurt if i feel supper hungry in between them), most of my meals are plant-based (not restricting, I just don't like meat that much, but I eat it when I feel a need) but occasionally I eat fish or chicken. Breakfast is usually porridge or yoghurt with muesli or chia pudding sth like that. Then salads or soups for lunch - loooots, with some bread or sth. My evening meal is the biggest - stews, tofu fried rice, tofu bolognese pasta - u name it, I am experimenting a lot and searching for new recipes. I exercise 6 days a week - some strength training and like an hour of walking or cycling or sth. I have one cheat day a week for now because I am scared that if eliminate sweets and unhealthy stuff completely I will relapse and that if i allow myself to eat them more often I will lose control. So, once a week, I let myself eat chocolate for breakfast, pizza for dinner or muffins for lunch... However,  it's nowhere near the amount of food I was eating while bingeing. Just because that urge to stuff my face with everything i can see in the shop lessened? Like fine, I want to eat a whole bar of chocolate and fries for dinner from time to time, it's not gonna kill me. Lost like 2kg in a month, which is much less then I was severely restricting but a healthy pace.  (This time starting weight was like 61 so I would attribute the weight loss, to like... fewer sweets and no free junk food from work plus not starving for half a day, just to eat the whole shop in the evening).\n\nI know I am still not in an ideal place. I obsess over my body too much, cheat days re not an ideal thing to do, either. I weight myself every week. But at least I am not bingeing anymore and my skin and hair got so much better... Also feel more stable mentally.\n\nLast but not least... Tell someone. I would be suffering in silence for years or joking about always gaining and losing. Finally told my sister and my best friend (who also struggles with an ED), it's just... Makes it a bit easier. Because maybe sb will notice that you are spilarring and even if they can't do much you have sb to complain to.  Maybe you could try looking for help with a specialist, I heard it helps a lot (never went to therapy myself, cause I was too embarrassed and scared, and I wish some much I have done it - probably would spare me a lot of nerves and self - hate).",
      "created_utc": 1590478258.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frsatgq",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1590427516.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frtarsk",
      "author": "itsevvynotevie",
      "body": "I would suggest waiting a couple months before trying to continue to loose weight. Until you have gin a month without relapsing, try to avoid closely monitoring your weight",
      "created_utc": 1590446538.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frthhc7",
      "author": "brittanica_7",
      "body": "Something I’m trying is to eat food based on how it makes my body FEEL rather thank attatching ‘healthy’ or ‘unhealthy’ labels\n\nThings that make me feel good are generally lots of veggies, fruit, legumes, rice and spicy foods (it’ll be different for everyone) , but every time I eat things like lots of dairy, gluten or sugar, it makes my body feel sluggish and overall yucky... so I’m trying to zone in on that and eat more intuitively which is helping my health and well-being generally \n\nGood luck! And remember body is valid and good enough no matter what number is on the scale",
      "created_utc": 1590450432.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frtgo52",
      "author": "waterchick13",
      "body": "Wow thank you for writing all that!",
      "created_utc": 1590449957.0,
      "score": 7,
      "context": [
        {
          "id": "frt0wkh",
          "author": "None",
          "body": "The main concern I hear from anyone with an eating disorder is “I don’t want to gain weight.”  \n\n1st, start watching Eating disorder RECOVERY videos and practice mindful eating (I also suggest YouTubing SUPER SKINNY ME.  It’s about two journalists EXPERIMENT to achieve size 0 and they do as they descend into this crash diet, one journalist with a past history of insecurities to begin with goes off the deep end and ends up going into a refeeding clinic, but the other stronger journalist will take a vacation and ends up pigging out to get back to her set weight/size, gets a bit bigger but goes back to normal.  Keywords: start-preparing-yourself-if-you-want-to-be-healthy).  Google/YouTube mindful eating.  Practice that.  By doing this will you begin to listen to your body.  Takes 15-20 minutes of slow eating to register your tummy is full.  Unlike that fast eating because you body has starved itself and desperately fighting back.  You slowly eat, your body won’t fight back.  Very important to find a dietitian.\n\n2nd, your stomach is used to being rid of food once you start eating and digesting will make your stomach appear bigger but it will go back to being normal.\n\n3rd, VERY IMPORTANT** call a free mental helpline (suicide helplines always help or psychiatrist, psychologist, therapist) when things go tough and you’re experiencing these changes- know one day you are steadily recovering but your body wants to pig out and if you do, start again DO NOT revert back to “if it’s not perfect, I will ruin my day.”  You have choices, you can restart your day again.  It forces you to activate your feelings that you have hidden with your addiction.  Talk out your fears.  Talk out what has hurt you but also talk about the great things that will happen too.  With all this talking you might even be your best SELF-DETECTIVE and slueth out why you started controlling your body.  Biggest question why have you used an addiction to replace talking out your feelings?\n\n4th, you have a set weight.  Like dog breeds, if you’re meant to be a set weight.  If you’re a lab don’t expect to be a greyhound.  If you’re a corgi, love yourself for being a corgi!  If you’re a Newfie, stand strong and proud!  You gotta love the breed you are.  All body types depend On different fuel.  If you slip up and eat junk food for one day, that’s ok.  All healthy people pig out and the best part of having HAD an eating disorder you’re more aware and you go back to routine.  Love you are different and that is what makes you, you!\n\n5th, after you’ve done steps 1-4, know nothing is perfect and stop comparing yourself to people.  WHO. ARE. YOU?  It will help you to just sit in a park and people watch and see people come in all shapes and sizes and people come with their own personalities, what-is-your-personality?  Who are you?  We all age.  Start planning to be older, start planning for life.  Understand your past but you have to forgive it to enjoy your future.  Start getting to know who you are and FIND who you are.  \n\nPlease know you can’t depend on anyone, this is your own road to battle.  The biggest love you can give to another human being is encouraging them to be “self sufficient”.  That goal is worth more than any money and will help you aim for a rich and successful life.  Being self sufficient is a very appetizing and achievable goal.  \n\nThe biggest question for you, are you ready to give up your unrealistic demands on your warped body image and are you willing/wanting to be healthy?  Good luck!j",
          "created_utc": 1590441153.0
        }
      ]
    },
    {
      "id": "frvtclo",
      "author": "icanhasnoodlez",
      "body": "second this!",
      "created_utc": 1590509930.0,
      "score": 1,
      "context": [
        {
          "id": "frsrdgu",
          "author": "poltergeistjpg",
          "body": "Hey there! I have the exact same problem. I’m overweight and fell into a bad binge/restrict cycle when trying to lose weight. \n\nFor right now, instead of focusing on losing weight, it might be better to solely focus on helping your hunger signals and disordered eating habits. By focusing on losing weight, it helps feed those disordered thoughts and can only contribute to a binge/restrict cycle. \n\nMaybe seek a therapist and dietitian who can safely get you back on the right track of eating well. If you feel comfortable and confident enough, possibly discuss the idea of losing weight with them, but your mental health and physical health is way more important than losing a few pounds. You deserve to be happy and healthy no matter what. Stay strong! 💙",
          "created_utc": 1590436128.0
        }
      ]
    },
    {
      "id": "frt126m",
      "author": "None",
      "body": "You’re almost there!\n\nThe binges will stop because by then you will have reached your OWN set weight, with mindful eating and eating the right fuel according to your genetics.  \n\nI suggest looking at dog breeds.  You can’t force a lab to be a corgi, right.",
      "created_utc": 1590441238.0,
      "score": 3,
      "context": [
        {
          "id": "frsrzxv",
          "author": "None",
          "body": "You have to break the cycle. Even if you binge, and I know it will be tough, don’t restrict the next day. Eat a normal balanced diet during the day regardless of the binges. You should eventually feel satisfied at the end of the day that you won’t feel compelled to binge. Once the binges stop completely, THEN you can restrict calories a normal amount (500 less than your TDEE, don’t go below 1200). You will need to accept that by doing this, you will at first gain weight because you aren’t compensating for overeating but in the long run this is the only way to get out of the cycle. \n\nI say all of this but I’m stuck in the same cycle so I  know how hard it is. I wish you the best.",
          "created_utc": 1590436456.0
        }
      ]
    },
    {
      "id": "fruqwg7",
      "author": "None",
      "body": "Everyone is different.  I work the best on a full meat and fat diet with very little carbs but if I want junk food, I will have it and be happy and go back to my usually fuel.  \n\nOP has yet to figure out what foods fuel her body, but if she’s under her set genetic weight or she’s going to junk food because of severe restriction, she going to keep binging.",
      "created_utc": 1590483410.0,
      "score": 2,
      "context": [
        {
          "id": "frthhc7",
          "author": "brittanica_7",
          "body": "Something I’m trying is to eat food based on how it makes my body FEEL rather thank attatching ‘healthy’ or ‘unhealthy’ labels\n\nThings that make me feel good are generally lots of veggies, fruit, legumes, rice and spicy foods (it’ll be different for everyone) , but every time I eat things like lots of dairy, gluten or sugar, it makes my body feel sluggish and overall yucky... so I’m trying to zone in on that and eat more intuitively which is helping my health and well-being generally \n\nGood luck! And remember body is valid and good enough no matter what number is on the scale",
          "created_utc": 1590450432.0
        }
      ]
    },
    {
      "id": "frv1cvb",
      "author": "brittanica_7",
      "body": "That’s definitely a great approach to have, I didn’t mean to underplay the importance of eating what you like even if it’s thought of as junk food - maybe my advice isn’t appropriate and I apologise if it’s not, it’s just a way I try to eat mindfully without restricting",
      "created_utc": 1590493525.0,
      "score": 1,
      "context": [
        {
          "id": "frthhc7",
          "author": "brittanica_7",
          "body": "Something I’m trying is to eat food based on how it makes my body FEEL rather thank attatching ‘healthy’ or ‘unhealthy’ labels\n\nThings that make me feel good are generally lots of veggies, fruit, legumes, rice and spicy foods (it’ll be different for everyone) , but every time I eat things like lots of dairy, gluten or sugar, it makes my body feel sluggish and overall yucky... so I’m trying to zone in on that and eat more intuitively which is helping my health and well-being generally \n\nGood luck! And remember body is valid and good enough no matter what number is on the scale",
          "created_utc": 1590450432.0
        },
        {
          "id": "fruqwg7",
          "author": "None",
          "body": "Everyone is different.  I work the best on a full meat and fat diet with very little carbs but if I want junk food, I will have it and be happy and go back to my usually fuel.  \n\nOP has yet to figure out what foods fuel her body, but if she’s under her set genetic weight or she’s going to junk food because of severe restriction, she going to keep binging.",
          "created_utc": 1590483410.0
        }
      ]
    },
    {
      "id": "frw19xh",
      "author": "None",
      "body": "You have a great point and always listen to your voice and voice them.  I am just noise.  Your thoughts belong to you that is how you find you.  Every time, you feel someone isn’t giving you opportunity to talk, you do the opposite that is how you get connected to your feelings, your identity.",
      "created_utc": 1590513716.0,
      "score": 2,
      "context": [
        {
          "id": "frthhc7",
          "author": "brittanica_7",
          "body": "Something I’m trying is to eat food based on how it makes my body FEEL rather thank attatching ‘healthy’ or ‘unhealthy’ labels\n\nThings that make me feel good are generally lots of veggies, fruit, legumes, rice and spicy foods (it’ll be different for everyone) , but every time I eat things like lots of dairy, gluten or sugar, it makes my body feel sluggish and overall yucky... so I’m trying to zone in on that and eat more intuitively which is helping my health and well-being generally \n\nGood luck! And remember body is valid and good enough no matter what number is on the scale",
          "created_utc": 1590450432.0
        },
        {
          "id": "fruqwg7",
          "author": "None",
          "body": "Everyone is different.  I work the best on a full meat and fat diet with very little carbs but if I want junk food, I will have it and be happy and go back to my usually fuel.  \n\nOP has yet to figure out what foods fuel her body, but if she’s under her set genetic weight or she’s going to junk food because of severe restriction, she going to keep binging.",
          "created_utc": 1590483410.0
        },
        {
          "id": "frv1cvb",
          "author": "brittanica_7",
          "body": "That’s definitely a great approach to have, I didn’t mean to underplay the importance of eating what you like even if it’s thought of as junk food - maybe my advice isn’t appropriate and I apologise if it’s not, it’s just a way I try to eat mindfully without restricting",
          "created_utc": 1590493525.0
        }
      ]
    },
    {
      "id": "frxjrck",
      "author": "brittanica_7",
      "body": "❤️",
      "created_utc": 1590541329.0,
      "score": 1,
      "context": [
        {
          "id": "frthhc7",
          "author": "brittanica_7",
          "body": "Something I’m trying is to eat food based on how it makes my body FEEL rather thank attatching ‘healthy’ or ‘unhealthy’ labels\n\nThings that make me feel good are generally lots of veggies, fruit, legumes, rice and spicy foods (it’ll be different for everyone) , but every time I eat things like lots of dairy, gluten or sugar, it makes my body feel sluggish and overall yucky... so I’m trying to zone in on that and eat more intuitively which is helping my health and well-being generally \n\nGood luck! And remember body is valid and good enough no matter what number is on the scale",
          "created_utc": 1590450432.0
        },
        {
          "id": "fruqwg7",
          "author": "None",
          "body": "Everyone is different.  I work the best on a full meat and fat diet with very little carbs but if I want junk food, I will have it and be happy and go back to my usually fuel.  \n\nOP has yet to figure out what foods fuel her body, but if she’s under her set genetic weight or she’s going to junk food because of severe restriction, she going to keep binging.",
          "created_utc": 1590483410.0
        },
        {
          "id": "frv1cvb",
          "author": "brittanica_7",
          "body": "That’s definitely a great approach to have, I didn’t mean to underplay the importance of eating what you like even if it’s thought of as junk food - maybe my advice isn’t appropriate and I apologise if it’s not, it’s just a way I try to eat mindfully without restricting",
          "created_utc": 1590493525.0
        },
        {
          "id": "frw19xh",
          "author": "None",
          "body": "You have a great point and always listen to your voice and voice them.  I am just noise.  Your thoughts belong to you that is how you find you.  Every time, you feel someone isn’t giving you opportunity to talk, you do the opposite that is how you get connected to your feelings, your identity.",
          "created_utc": 1590513716.0
        }
      ]
    }
  ]
}