{
  "id": "gqhgyu",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590434774.0,
  "title": "Request: I feel like my eating disorder makes me ungrateful for my privilege",
  "selftext": "i’ve always has access to food, a full pantry, and i’ve never had to skip a meal because my family couldn’t afford it. people everywhere are starving because they don’t have the money for a meal but here i am sobbing over a bowl of ramen until i can’t take it anymore and throw it down the garbage disposal. i feel so greedy. i have so much guilt because of it and i don’t want to reach out to anyone because i feel like they’ll think i’m ungrateful for my privilege to be able to eat and it will just make me feel worse.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gqhgyu/request_i_feel_like_my_eating_disorder_makes_me/",
  "score": 134,
  "num_comments": 17,
  "comments": [
    {
      "id": "frsqzqa",
      "author": "MysticalWateryEye",
      "body": "It's a mental illness, you aren't a bad person. You didn't wake up one day and go \"today would be a great day to get an eating disorder and throw out food\". So you have to let that go, and focus on working on recovery from it. \n\nI know recovery is hard, and the guilt is just adding to the stress, but just take a few bites, then take a few more. You tried, and that's important. But i encourage you to speak to a doctor/ therapist about this, because recovery is possible.",
      "created_utc": 1590435922.0,
      "score": 47,
      "context": []
    },
    {
      "id": "frt0pq9",
      "author": "MaryContrary26",
      "body": "The eating disorder (voice) is a master manipulator.\"Oh, you shouldn't reach out for help because you don't deserve it, you ungrateful, privileged person\" Ooh, that's a good one. 2 points for the eating disorder..... (Psst..Your move.What would be a good comeback?)",
      "created_utc": 1590441053.0,
      "score": 27,
      "context": []
    },
    {
      "id": "frsyizt",
      "author": "None",
      "body": "I told my therapist that Tartine smelled like anguish. She made me explain that one.",
      "created_utc": 1590439899.0,
      "score": 6,
      "context": []
    },
    {
      "id": "frsw3x7",
      "author": "moliviak-01",
      "body": "This is a common feeling, and just know that it isn’t your fault! You shouldn’t feel guilty for things that your eating disorder makes you do. That is not you. That is not a decision you made. The guilt is not going to help you. I hope you get professional help and feel better soon!",
      "created_utc": 1590438627.0,
      "score": 3,
      "context": []
    },
    {
      "id": "frulmlc",
      "author": "ellysaria",
      "body": "You're not greedy. Clearly if it were up to you you wouldn't be throwing out food that could be eaten, that's why you're feeling guilty in the first place. Eating disorders and other mental illness have a way of making you feel terrible about things that you can't immediately control, and this is just that. It's a way for it to fester and make you feel worse about how you feel in the first place and cause more distress, making you feel worse and continuing the cycle. It's not your fault that you're dealing with this though, it's not your fault that eating causes so much distress that you have to throw food out, and it's not your fault you have to throw that food out because of it. You're also not causing harm to someone through your actions, and that counts for a lot. It's not like your intention is to make people without food security feel shitty, or to waste food to spite them. It's just an unfortunate combination of two issues that mental illness is trying to twist to make you feel worse. I don't know if it counts for much but as someone who didn't always have food available as a kid, wasting food is the last thing I would want you to be concerned about. It's not your fault other people don't have food and throwing some food out isn't gonna hurt anyone. \n\nThere's nothing you should feel guilty over here, and that guilt is only making things worse for you as well. All I would ask as someone who has been there, is for you to do your best not to feel too bad about it and focus on moving forward and getting better, and when you do feel guilty over it, remember that it's okay and you haven't done anything you should feel guilty for. You haven't done anything wrong.\n\nAs others have said, if you have a therapist it would be good to go through this with them as well, and if you don't, it'd be really great if you could get to talking with one. I wish you all the best. If you ever need to talk to someone, you're welcome to message me although I don't have first hand experience with ED.",
      "created_utc": 1590478248.0,
      "score": 3,
      "context": []
    },
    {
      "id": "frv5mbu",
      "author": "themillennialbard",
      "body": "I’m in the same boat, so I’m trying to listen to all the voices of LOGIC–not ED, which is hard, given the nature of a disorder–who are reassuring you (or have reassured me in the past) that it is in fact a mental illness, and has no bearing on who you are on a personal level, and it in no way makes you ungrateful for your privilege. It may or may not help to hear that same type of thing over again in so many words (others have state it far more eloquently than I’ve been able to with this comment), but I believe in speaking the truth to ED’s lies, even when we don’t necessarily feel or believe it 100% (yet).",
      "created_utc": 1590496825.0,
      "score": 3,
      "context": []
    },
    {
      "id": "frv5smk",
      "author": "oliviared52",
      "body": "This same thought of “there are people in the world who don’t even have food” helped me a lot through recovery to feel blessed I am able to nourish my body when others can’t. It’s good you recognize it. And you can use that to help drive you through recovery. But just because there are people in the world with worse problems doesn’t make yours less real. Reach out to someone. \n\nIf a friend reached out to you about having an ED would you call them a privileged b for having access to food and still developing this eating disorder when people are starving? No. You wouldn’t. And if anyone does that’s not someone you need in your life. You sound like a really kind empathetic person. Good luck OP!",
      "created_utc": 1590496950.0,
      "score": 3,
      "context": []
    },
    {
      "id": "frurvfy",
      "author": "tymopa",
      "body": "Yes to all of these lovely and knowing souls. It's part of this viscious beast. It's okay. Hugs and best of luck to you in your recovery. It's a long, long road but so worth the journey.",
      "created_utc": 1590484407.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frus1g7",
      "author": "whereismymind--",
      "body": "İts a mental illnes and your experience is valid regardless of your familys privledge. Please dont feel like a bad/ungrateful person bc of it. Love you dude, stay strong there",
      "created_utc": 1590484579.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frvepwj",
      "author": "None",
      "body": "It's amazing how people with EDs find ways to beat ourselves up - not just through disordered eating behaviours and body-shaming thoughts, but we really have a general lack of compassion for ourselves sometimes! \n\nYou're not selfish, I don't think a selfish person would show such a concern for other people when they're struggling themselves. That's not a justification of your current thoughts, just perhaps a way to spin it into a positive when it arises and a way to reduce the intensity of the feeling. Yes, some people have privileges and access to food is one of them, but we can also struggle - even with the best head starts. It's ok to recognise that and it doesn't make you a bad person.",
      "created_utc": 1590502448.0,
      "score": 2,
      "context": []
    },
    {
      "id": "frsotn1",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1590434775.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fss6vrc",
      "author": "scaryhairyberryfairy",
      "body": "i very much feel this. however, remember that an eating disorder is not rational. it is a mental illness and you shouldn't feel guilty. it is just a different kind of suffering than what someone who cannot afford a healthy or quality diet. everyone deserves help when they need it, including you.",
      "created_utc": 1591214421.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftrb4g8",
      "author": "dietdrpepperer",
      "body": "I think it's a reasonable concern. It's not a mental illness like other mental illnesses like schizophrenia that are more severe and genetic, at some point it becomes a choice. I mean, how long has it even really been in the DSM",
      "created_utc": 1591924422.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frv5yto",
      "author": "oliviared52",
      "body": "Omg this. I had to give my eating disorder voice a name to know when it’s the ED talking vs me talking. It can be hard to tell at first but once you get the hang of it it becomes more obvious when it’s the ED",
      "created_utc": 1590497070.0,
      "score": 3,
      "context": [
        {
          "id": "frt0pq9",
          "author": "MaryContrary26",
          "body": "The eating disorder (voice) is a master manipulator.\"Oh, you shouldn't reach out for help because you don't deserve it, you ungrateful, privileged person\" Ooh, that's a good one. 2 points for the eating disorder..... (Psst..Your move.What would be a good comeback?)",
          "created_utc": 1590441053.0
        }
      ]
    },
    {
      "id": "frvb8hv",
      "author": "I-really-need-a-life",
      "body": "Happy cake day!",
      "created_utc": 1590500461.0,
      "score": 2,
      "context": [
        {
          "id": "frt0pq9",
          "author": "MaryContrary26",
          "body": "The eating disorder (voice) is a master manipulator.\"Oh, you shouldn't reach out for help because you don't deserve it, you ungrateful, privileged person\" Ooh, that's a good one. 2 points for the eating disorder..... (Psst..Your move.What would be a good comeback?)",
          "created_utc": 1590441053.0
        },
        {
          "id": "frv5yto",
          "author": "oliviared52",
          "body": "Omg this. I had to give my eating disorder voice a name to know when it’s the ED talking vs me talking. It can be hard to tell at first but once you get the hang of it it becomes more obvious when it’s the ED",
          "created_utc": 1590497070.0
        }
      ]
    },
    {
      "id": "frv6w73",
      "author": "MaryContrary26",
      "body": "Great that you can see that!",
      "created_utc": 1590497708.0,
      "score": 1,
      "context": [
        {
          "id": "frt0pq9",
          "author": "MaryContrary26",
          "body": "The eating disorder (voice) is a master manipulator.\"Oh, you shouldn't reach out for help because you don't deserve it, you ungrateful, privileged person\" Ooh, that's a good one. 2 points for the eating disorder..... (Psst..Your move.What would be a good comeback?)",
          "created_utc": 1590441053.0
        },
        {
          "id": "frv5yto",
          "author": "oliviared52",
          "body": "Omg this. I had to give my eating disorder voice a name to know when it’s the ED talking vs me talking. It can be hard to tell at first but once you get the hang of it it becomes more obvious when it’s the ED",
          "created_utc": 1590497070.0
        }
      ]
    }
  ]
}