{
  "id": "grf9p3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590565444.0,
  "title": "Request: Post request: Disordered eating vs eating disorders",
  "selftext": "Hi there, \ndisclaimer: *(1) this might be an unpopular opinion post. (2)I'm speaking from a perspective of ED survivor.*\n\nI have noticed a considerable amount of *\"Do I have an eating disorder?\"* posts on this sub and could not figure out what makes me feel so uncomfortable about them. These posts seem innocent, advice seeking and the members of community can reassure each other and help validate experiences and emotions. And then I realized that it was the lack of differentiation between disordered eating and eating disorders that left me feeling uneasy.\n\n**Disordered eating** is an epidemic in our culture. It is easy to develop an unhealthy relationship with food when it is made out to be the enemy. Food then turns into something to be feared or develops the allure of the forbidden fruit, paving the way for disordered food behaviours. [1] So lets face it - it is difficult to find a woman nowadays who has never tried dieting or some sort of other restrictive eating (from keto and veganism, to raw-plant based and paleo diets). \n> 53% of American girls age 13 are “unhappy with their bodies.”  This grows to 78% by the time girls reach seventeen. [2]\nLow self-esteem, pressure to match unrealistic body types and connection of self-worth to ones perceived beauty -  are issues known almost universally by all woman.\n\nYes, disordered eating patterns should be taken seriously and it’s important to reach out to a professional team to help you find balanced ways and nourish your body. > While studies show that up to 50% of the population in the USA demonstrate problematic or disordered relationships with food, body, and exercise; the rates of clinical eating disorders are much lower, estimated from 1% to 3% percent of the general population. [3] \n\nSo where do we draw the line between disordered eating and full-blown eating disorder? It is all about degree. An individual with disordered eating is often engaged in the same behaviours as those with eating disorders but at a lesser frequency or lower level of severity. [3] As with other mental health issues, it is important to explore how and to what extent disordered eating is affecting an individual’s daily functioning. Issues to consider include the following [3]:\n\n* Concentration and ability to focus — Do thoughts about food, body, and exercise prevent concentration or impede performance at work or school?\n* Social life — Is socializing restricted because it might require eating in a restaurant, consumption of foods that are scary or uncomfortable, or disruption of exercise routine?\n* Coping skills — Is food consumption and/or restriction used as a way to manage life’s problems or cope with stressors?\n* Discomfort or anxiety — How much discomfort do thoughts of food and body cause? Are these thoughts hard to shake and anxiety-provoking?\n\nIn treatment, I remember visualizing my eating disorder as a dark, beautiful angel. It was my best friend, my only friend. It understood me and provided comfort, **but only when I complied with the rules**. Eds are similar to abusive relationships - they hurt you but you love them… I guess I’m writing this paragraph to show that EDs in clinical representation are not solely about food and body; Eds became a strong and prevalent coping-strategy (you can almost parallel it to addiction - addicts know that what they do is wrong, would lead to destroyed relationships, financial problems and possible death, but the high is sooo good that they can’t resist it).\n\nThank you for taking time to read this post. I hope it was informative. \n\n*P.S.1 If you recognize the eating disorder patterns in yourself, if you consider them abnormal or unhealthy, then you are in a good shape!  From my own experience (and from talking to multiple people while inpatient/outpatient) people with full-blown EDs usually refuse to accept that they have a problem: they assume their eating/exercise patterns are normal, their weight doesn’t have a bottomline, they attribute multiple skin, hair, menstruation problems to lack of vitamins or poor genetics.\nSo if you notice the problem and feel the desire to change, you have already accomplished a great milestone. Congratulations!*\n\n*P.S.2 Finally, if you are reading this and if you are concerned for your loved one, it is possible that they don’t “see” what you “see”. People with full-blown Eds prior to treatment would have a hard time admitting to having a problem and this is the stage where your help is crucial.* \n\n*References*\n[1] https://www.eatingdisorderhope.com/blog/eating-disorders-disordered-eating \n[2] https://heartofleadership.org/statistics/\n[3] https://www.psychologytoday.com/ca/blog/contemporary-psychoanalysis-in-action/201402/disordered-eating-or-eating-disorder-what-s-the",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/grf9p3/request_post_request_disordered_eating_vs_eating/",
  "score": 102,
  "num_comments": 25,
  "comments": [
    {
      "id": "fryzu2j",
      "author": "None",
      "body": "Yeah, I’ve noticed the insane amount of these posts too. Reading through them, I find myself becoming frustrated. Yes, I know that disordered eating can become an eating disorder if left unchecked but an eating disorder is far beyond the scope “I ate a little bit less for a month or two and lost some weight, I don’t want to gain it back.”\n\nI’m sure my opinion is going to be fairly unpopular too but I don’t think seeking validation from people with eating disorders for dieting is right. In any way. As someone who has been in and out of treatment for most of their life, this is an incredibly complex illness. I spend every day wishing for death, tearing myself to shreds, vomiting and fasting, shaking and dizzy. I’ve been on more medication than I care to admit, been psychoanalyzed countless times and can spew the caloric information of thousands of foods. I wish I didn’t feel this way and I would hate for some of these people to learn unhealthy coping methods from one of us. An eating disorder isn’t cool or trendy and many current diet fads normalize bad behaviour. It can be hard for people with eating disorders to seek out/receive proper medical attention when everyone feels as if they have one.",
      "created_utc": 1590582011.0,
      "score": 31,
      "context": []
    },
    {
      "id": "frzmz9a",
      "author": "Ghordrin",
      "body": "Hello, guys, I am one of the mods that approves requests and handles the subreddit. I will be speaking from my own point of view and not of all mods when I refer to myself.\n\nA post like this has been long overdue. The thing is that while this post is extremely well written and informative it could also push the idea that those who post \"Do I have an ED\" most likely don't have an eating disorder but a disordered eating pattern. The problem is that we don't know and that none of us can confirm if you have an eating disorder. This post is certainly one that comes from a very good place and has no intentions of nullifying anyone's ED or disordered eating pattern. But if we were to deflect all requests from people who haven't been diagnosed then this sub would have way less participants. Less participants means less answers, less support, etc ...\n\nRequests like \"Do I have an ED\" happen a lot. I'd say about 60% of all requests are questions if they could have their post because they are concerned they might be developing an eating disorder or that they suspect they have an eating disorder and are seeking validation of some kind.  A common thought with anyone who struggles with any disorder is:  *Am I hurting bad enough to seek help? Am I \"sick enough\"*. This is one of the reasons as to why we allow these posts to come through. We never know which post might \"save a life\".\n\nThe majority of the time I reply with the same kind of response - I even have a prefab reply that I copy and paste for those posts - and while that blocks a whole bunch of the requests I can't help but think... There has to be a reason as to why we are getting so many requests about this. What I have been told regularly is that some people do not have the ability to seek help. Regardless of money, some requests talk about the OP not being able to speak to their doctor or legal guardians about this. Others seek help for beloved ones. \n\n\nWe, the mods, know that allowing these posts wont fix anyone's (possible) ED. None of us, mods or readers, can actually help diagnose an eating disorder. Even if some of us were licensed professionals. \n\nThat being said, I think this post definitely brings up a great point. The original intent of this sub was for people to have questions about eating disorders like:\n\n* How to deal with the common struggles about eating disorders\n\n* How to deal with certain situations. (Public eating, how to tell someone you trust about your struggles)\n\n* How to seek help\n\n* etc...\n\nThe sub has changed from mostly asking questions about eating disorders to people mainly venting and people who seek validation. This is due to lack of moderation on certain aspects and the fact that we've grown a whole lot. The lack of moderation is something we have to speak about internally. \n\nHow we will move forward, I don't know. I am however open for ANYONE to openly DM me how to improve things or share their experiences. I really want this sub to be a safe, informative place with a clear purpose. Cause now it is somewhat all over the place.\n\nI am also available on our Discord server. You can find the link in each auto moderator reply, by checking the sidebar or clicking on this link: https://discord.gg/ShRD55t\n\nI wish you all the best.",
      "created_utc": 1590595022.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fs02ikw",
      "author": "None",
      "body": "I agree with this post, but I do think that we should never underestimate these posts. I started out with disordered eating, just like you described. That lead to an actual eating disorder.",
      "created_utc": 1590602510.0,
      "score": 10,
      "context": []
    },
    {
      "id": "frzri1s",
      "author": "the_scientist52",
      "body": "I've been struggling a lot with the extreme uptick in \"do I have an ED?\" posts here in the sub.  This may be an unfair assumption to make, but I suspect that many of the posters are completely aware that something is wrong with their eating/exercise patterns but are just seeking validation.  As a general rule, needing reassurance isn't a bad thing, but I think that with EDs it can get really tricky.  These disorders get really competitive and can often feed off of other people's concern/attention, so I feel like responding to these types of posts can just fuel that person's ED.  Again, I know this is a generalization, but it's just hard for me to imagine that someone typing \"I skip x number of meals every day and purge x days a week and use x other extreme behavior\" is *truly* in the dark about something being wrong.  I know that denial is a thing (I've struggled with it myself) and that information about EDs isn't widely taught, but it just seems like someone could use google and find resources about warning signs.  Going into a lot of details on a page like this doesn't feel necessary to me, and I think that even without numbers it can fuel a lot of comparison or an unhealthy need for validation.\n\nAnd I think the other piece is that, at least for me, being inundated with these posts gets mentally exhausting.  I am not a professional and most of the posters here aren't either, but I think there's an expectation that we take the role of a professional when being asked to judge someone's behavior patterns.  It's hard to describe, but I feel like there's this pressure put on me that just feels uncomfortable.  And it's hard to know how to respond to the posts.  If I say that it sounds like the person does have an ED, am I just feeding into the disorder they already know they have?  Or what if I'm wrong and I'm setting them up to feel invalidated later?  Or what if I don't think they have an ED--how do I say that gently and not trigger them?  And really, how can I truly tell if someone has an ED or it's just disordered eating, without knowing the extent to which the thoughts take up their headspace and the behaviors take over their day to day lives?  It can get really complicated really quickly regardless of whether the person presents as having an ED or not. I try not to respond to those posts anymore and just skip reading them when I can, but that underlying discomfort surrounding the whole thing somehow stays there.\n\nI guess it just feels like a lot of people are using this sub as a diagnostic tool of sorts.  I know that the intent of the sub was to be a place for people with EDs to get support about common struggles, like how to respond to triggering family members. But lately it's just felt like it's mostly turned into a place where people come in to ask those with EDs to make a judgment about whether their behaviors \"count,\" which isn't something we really have the capacity to do.",
      "created_utc": 1590597219.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fs16p4u",
      "author": "DisorderlyHum",
      "body": "I don't like the ps1 part of this post. I already have a running commentary in my head that's constantly telling my that my eating disorder is fake along with every other mental illness I struggle with. Like. I have been diagnosed with an eating disorder. I know my daily calorie intake is too low, I know that my anemia is caused by restriction and cutting, I know that what I'm doing is unsustainable. That's not stopping me. But being told that I'm fine because I know it's bad makes it so much more impossible to seek treatment because clearly I don't really need it and makes me wanna push myself further down instead. I know you weren't meaning to invalidate people with this post but it hit a nerve with me apparently. Idk.",
      "created_utc": 1590622374.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fs0ubin",
      "author": "SlutForMarx",
      "body": "I feel both the OP and a lot of commenters have made great points! I only have one thing to add:\nI believe it's a generalisation that the \"worst of the worst\" all believe that they're fine. \n\nI can only speak from my own experience, but when my ED started really picking up speed, I knew what I was doing. Health, life, love  - everything was horrifying and dull anyway, and I just wanted to know, for once in my life, what it was like to be thin. And I was ready to risk it all, because the idea of having to live to 50 seemed daunting anyway. I was ready to live hard and dying young, so to speak. \n\nAnyway, so my two cents. \n\n(And btw, I don't actually believe I've got it the worst. I'm really just using myself as an example here to counter that one argument OP made)",
      "created_utc": 1590615902.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fryi2k5",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1590565445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frzc4lr",
      "author": "None",
      "body": "100% agree with this post and I think this sub definitely needed this post to be made. Thank you for sharing all this information, and hopefully it can help others as well",
      "created_utc": 1590589532.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fs4awq4",
      "author": "odetosleee",
      "body": "I have an unhealthy relationship with food and I am underweight, but I live at home with my parents so I eat the meals they make so they don't  realize anything is wrong. As soon as I move out, I know things are going to get really bad. which I'm kind of scared of because I know how bad not eating is for my heart and everything. Its like I'm rapidly switching between my logical brain and my brain that wants me to not eat.",
      "created_utc": 1590692879.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frzyyze",
      "author": "sleepy58",
      "body": "I believe that the intent of this post was to **help educate** and **spread awareness**, not to complain about the \"Do I have an ED?\" posts. Any sub, any space, any company can become triggering and/or unsafe for people with EDs and we should learn to navigate the triggers and our surroundings to keep our sanity. \"Do I have an ED?\" is a valid post - and I support the idea of adding a flair to it, so that people can avoid them if they choose to.\n\nI also feel that this kind of posts are necessary on this sub, lets say under the flair of \"psycho-education\". Yes there are a lot of great helpful resources tagged on this sub, but not everyone goes through those links and maybe sharing some of that info on this sub (from time to time) can help bring back a bit more of the \"original intent or this sub\"",
      "created_utc": 1590600807.0,
      "score": 1,
      "context": []
    },
    {
      "id": "frz6unh",
      "author": "None",
      "body": "I agree with you and this post, thank you for vocalising your feelings! As much as I know many people come to this page for advice, I find it quite triggering when (as someone with a diagnosed ED) I come to this page for refuge. Thanks again :)",
      "created_utc": 1590586593.0,
      "score": 5,
      "context": [
        {
          "id": "fryzu2j",
          "author": "None",
          "body": "Yeah, I’ve noticed the insane amount of these posts too. Reading through them, I find myself becoming frustrated. Yes, I know that disordered eating can become an eating disorder if left unchecked but an eating disorder is far beyond the scope “I ate a little bit less for a month or two and lost some weight, I don’t want to gain it back.”\n\nI’m sure my opinion is going to be fairly unpopular too but I don’t think seeking validation from people with eating disorders for dieting is right. In any way. As someone who has been in and out of treatment for most of their life, this is an incredibly complex illness. I spend every day wishing for death, tearing myself to shreds, vomiting and fasting, shaking and dizzy. I’ve been on more medication than I care to admit, been psychoanalyzed countless times and can spew the caloric information of thousands of foods. I wish I didn’t feel this way and I would hate for some of these people to learn unhealthy coping methods from one of us. An eating disorder isn’t cool or trendy and many current diet fads normalize bad behaviour. It can be hard for people with eating disorders to seek out/receive proper medical attention when everyone feels as if they have one.",
          "created_utc": 1590582011.0
        }
      ]
    },
    {
      "id": "frzf0wo",
      "author": "gobluebabyyy",
      "body": "I agree with you but what’s the solution? I know my ED started as “just” disordered eating that then became something that, like this post says, controlled my life. Should we tell those people not to post here or not to be worried about their disordered eating because it’s not yet an ED?",
      "created_utc": 1590591049.0,
      "score": 3,
      "context": [
        {
          "id": "fryzu2j",
          "author": "None",
          "body": "Yeah, I’ve noticed the insane amount of these posts too. Reading through them, I find myself becoming frustrated. Yes, I know that disordered eating can become an eating disorder if left unchecked but an eating disorder is far beyond the scope “I ate a little bit less for a month or two and lost some weight, I don’t want to gain it back.”\n\nI’m sure my opinion is going to be fairly unpopular too but I don’t think seeking validation from people with eating disorders for dieting is right. In any way. As someone who has been in and out of treatment for most of their life, this is an incredibly complex illness. I spend every day wishing for death, tearing myself to shreds, vomiting and fasting, shaking and dizzy. I’ve been on more medication than I care to admit, been psychoanalyzed countless times and can spew the caloric information of thousands of foods. I wish I didn’t feel this way and I would hate for some of these people to learn unhealthy coping methods from one of us. An eating disorder isn’t cool or trendy and many current diet fads normalize bad behaviour. It can be hard for people with eating disorders to seek out/receive proper medical attention when everyone feels as if they have one.",
          "created_utc": 1590582011.0
        }
      ]
    },
    {
      "id": "fs09jdv",
      "author": "None",
      "body": "The idea of someone like me at age 13/14/15 when all of the body image hate was coming to a head and I was learning how to act on it coming into subs like this and walking away with tips makes me shiver. When I was a young teenager, I thought none of the bad stuff from an ED could happen to me. I wouldn’t take it too far, I would be thin and happy and that’s all. Instead it ruined my life for a good 15 years and I still find myself wishing I could go back in time and change it because I literally WASTED my 20’s on that stupid disease. \n\nBut when you’re young and full of self hatred, you just don’t think you’ll be the 31 yr old who got fat anyways and fucked their entire life up. Some, like me, read the horror stories, discard all of the horror parts, turn the parts they like into a scrapbook, and think they’ll be fine. \n\nI’m not saying I want to gatekeep EDs or ED subs/groups/websites, it just worries me. Idk this may sound awful :(\n\nE: words",
      "created_utc": 1590605869.0,
      "score": 0,
      "context": [
        {
          "id": "fryzu2j",
          "author": "None",
          "body": "Yeah, I’ve noticed the insane amount of these posts too. Reading through them, I find myself becoming frustrated. Yes, I know that disordered eating can become an eating disorder if left unchecked but an eating disorder is far beyond the scope “I ate a little bit less for a month or two and lost some weight, I don’t want to gain it back.”\n\nI’m sure my opinion is going to be fairly unpopular too but I don’t think seeking validation from people with eating disorders for dieting is right. In any way. As someone who has been in and out of treatment for most of their life, this is an incredibly complex illness. I spend every day wishing for death, tearing myself to shreds, vomiting and fasting, shaking and dizzy. I’ve been on more medication than I care to admit, been psychoanalyzed countless times and can spew the caloric information of thousands of foods. I wish I didn’t feel this way and I would hate for some of these people to learn unhealthy coping methods from one of us. An eating disorder isn’t cool or trendy and many current diet fads normalize bad behaviour. It can be hard for people with eating disorders to seek out/receive proper medical attention when everyone feels as if they have one.",
          "created_utc": 1590582011.0
        }
      ]
    },
    {
      "id": "frzowc6",
      "author": "MysticalWateryEye",
      "body": "THANK YOU! this is my fear too. Because a lot of people with eating disorders might come off as disordered eating, because a lot of people with eating disorders downplay it. \n\nYou could always just make a \"flair\" for the \"do i have....\" posts so that people can avoid those posts.  I personally come here to make sure these people seek treatment, regardless of what they might have, because getting in contact with a doctor can and will save lives.",
      "created_utc": 1590595962.0,
      "score": 5,
      "context": [
        {
          "id": "frzmz9a",
          "author": "Ghordrin",
          "body": "Hello, guys, I am one of the mods that approves requests and handles the subreddit. I will be speaking from my own point of view and not of all mods when I refer to myself.\n\nA post like this has been long overdue. The thing is that while this post is extremely well written and informative it could also push the idea that those who post \"Do I have an ED\" most likely don't have an eating disorder but a disordered eating pattern. The problem is that we don't know and that none of us can confirm if you have an eating disorder. This post is certainly one that comes from a very good place and has no intentions of nullifying anyone's ED or disordered eating pattern. But if we were to deflect all requests from people who haven't been diagnosed then this sub would have way less participants. Less participants means less answers, less support, etc ...\n\nRequests like \"Do I have an ED\" happen a lot. I'd say about 60% of all requests are questions if they could have their post because they are concerned they might be developing an eating disorder or that they suspect they have an eating disorder and are seeking validation of some kind.  A common thought with anyone who struggles with any disorder is:  *Am I hurting bad enough to seek help? Am I \"sick enough\"*. This is one of the reasons as to why we allow these posts to come through. We never know which post might \"save a life\".\n\nThe majority of the time I reply with the same kind of response - I even have a prefab reply that I copy and paste for those posts - and while that blocks a whole bunch of the requests I can't help but think... There has to be a reason as to why we are getting so many requests about this. What I have been told regularly is that some people do not have the ability to seek help. Regardless of money, some requests talk about the OP not being able to speak to their doctor or legal guardians about this. Others seek help for beloved ones. \n\n\nWe, the mods, know that allowing these posts wont fix anyone's (possible) ED. None of us, mods or readers, can actually help diagnose an eating disorder. Even if some of us were licensed professionals. \n\nThat being said, I think this post definitely brings up a great point. The original intent of this sub was for people to have questions about eating disorders like:\n\n* How to deal with the common struggles about eating disorders\n\n* How to deal with certain situations. (Public eating, how to tell someone you trust about your struggles)\n\n* How to seek help\n\n* etc...\n\nThe sub has changed from mostly asking questions about eating disorders to people mainly venting and people who seek validation. This is due to lack of moderation on certain aspects and the fact that we've grown a whole lot. The lack of moderation is something we have to speak about internally. \n\nHow we will move forward, I don't know. I am however open for ANYONE to openly DM me how to improve things or share their experiences. I really want this sub to be a safe, informative place with a clear purpose. Cause now it is somewhat all over the place.\n\nI am also available on our Discord server. You can find the link in each auto moderator reply, by checking the sidebar or clicking on this link: https://discord.gg/ShRD55t\n\nI wish you all the best.",
          "created_utc": 1590595022.0
        }
      ]
    },
    {
      "id": "frzsf2l",
      "author": "Ghordrin",
      "body": "Thanks for being transparent about the issues you have with these posts. As I've stated before, there are issues currently and something has to be done so we satisfy both sides. \n\nThe posts you talk about are posts that, in my opinion, shouldn't have been up like that. They should've either been heavily censored or given proper context. However, not having them at all seems a bit extreme. A suggestion has been made about giving the ability to filter out those posts by using flairs and filtering. We might look into that.",
      "created_utc": 1590597660.0,
      "score": 1,
      "context": [
        {
          "id": "frzri1s",
          "author": "the_scientist52",
          "body": "I've been struggling a lot with the extreme uptick in \"do I have an ED?\" posts here in the sub.  This may be an unfair assumption to make, but I suspect that many of the posters are completely aware that something is wrong with their eating/exercise patterns but are just seeking validation.  As a general rule, needing reassurance isn't a bad thing, but I think that with EDs it can get really tricky.  These disorders get really competitive and can often feed off of other people's concern/attention, so I feel like responding to these types of posts can just fuel that person's ED.  Again, I know this is a generalization, but it's just hard for me to imagine that someone typing \"I skip x number of meals every day and purge x days a week and use x other extreme behavior\" is *truly* in the dark about something being wrong.  I know that denial is a thing (I've struggled with it myself) and that information about EDs isn't widely taught, but it just seems like someone could use google and find resources about warning signs.  Going into a lot of details on a page like this doesn't feel necessary to me, and I think that even without numbers it can fuel a lot of comparison or an unhealthy need for validation.\n\nAnd I think the other piece is that, at least for me, being inundated with these posts gets mentally exhausting.  I am not a professional and most of the posters here aren't either, but I think there's an expectation that we take the role of a professional when being asked to judge someone's behavior patterns.  It's hard to describe, but I feel like there's this pressure put on me that just feels uncomfortable.  And it's hard to know how to respond to the posts.  If I say that it sounds like the person does have an ED, am I just feeding into the disorder they already know they have?  Or what if I'm wrong and I'm setting them up to feel invalidated later?  Or what if I don't think they have an ED--how do I say that gently and not trigger them?  And really, how can I truly tell if someone has an ED or it's just disordered eating, without knowing the extent to which the thoughts take up their headspace and the behaviors take over their day to day lives?  It can get really complicated really quickly regardless of whether the person presents as having an ED or not. I try not to respond to those posts anymore and just skip reading them when I can, but that underlying discomfort surrounding the whole thing somehow stays there.\n\nI guess it just feels like a lot of people are using this sub as a diagnostic tool of sorts.  I know that the intent of the sub was to be a place for people with EDs to get support about common struggles, like how to respond to triggering family members. But lately it's just felt like it's mostly turned into a place where people come in to ask those with EDs to make a judgment about whether their behaviors \"count,\" which isn't something we really have the capacity to do.",
          "created_utc": 1590597219.0
        }
      ]
    },
    {
      "id": "fs24u1w",
      "author": "sleepy58",
      "body": "Hey! Thanks for shinning light on your perspective! I agree that recognizing a problematic pattern is not enough. Just like the ps1 part says - if you recognize it AND want to change it, then you’ve accomplished something. The AND part is really important because true desire to change is one of the key elements for successful recovery. \n\nEds are competitive in their nature. Not “sick enough” is a struggle and is hard to challenge in emotion mind... I see how this post could trigger such perspective! The writer did mention that disordered eating is dangerous and that a struggling person should address their concerns with a professional team. It’s important to seek and ask for help. \n\nKeep fighting & and don’t let this post upset or invalidate you - you know yourself best!",
      "created_utc": 1590642915.0,
      "score": 1,
      "context": [
        {
          "id": "fs16p4u",
          "author": "DisorderlyHum",
          "body": "I don't like the ps1 part of this post. I already have a running commentary in my head that's constantly telling my that my eating disorder is fake along with every other mental illness I struggle with. Like. I have been diagnosed with an eating disorder. I know my daily calorie intake is too low, I know that my anemia is caused by restriction and cutting, I know that what I'm doing is unsustainable. That's not stopping me. But being told that I'm fine because I know it's bad makes it so much more impossible to seek treatment because clearly I don't really need it and makes me wanna push myself further down instead. I know you weren't meaning to invalidate people with this post but it hit a nerve with me apparently. Idk.",
          "created_utc": 1590622374.0
        }
      ]
    },
    {
      "id": "frzifut",
      "author": "None",
      "body": "Personal research needs to be done, like you would do if you feel like you have any problem—medical or non-medical. And then find the correct avenue to address those problems(nutritionist, therapy, etc). Don’t just lump it into being an ED and go around telling that to anyone who will listen. Yes, I get this is a safe space and there’s no way to vet whether or not someone is ill... \n\n...I just worry some people might be coming here in hopes of getting an ED/making their ED worse.\n\nEdit—\n\nI’ve been in programs that DO NOT accept patients with disordered eating but have accepted patients due to the pushing of the parents. It never ends well for those who are predisposed to having an ED, which is why I think they need to remain as separate entities.",
      "created_utc": 1590592779.0,
      "score": 6,
      "context": [
        {
          "id": "fryzu2j",
          "author": "None",
          "body": "Yeah, I’ve noticed the insane amount of these posts too. Reading through them, I find myself becoming frustrated. Yes, I know that disordered eating can become an eating disorder if left unchecked but an eating disorder is far beyond the scope “I ate a little bit less for a month or two and lost some weight, I don’t want to gain it back.”\n\nI’m sure my opinion is going to be fairly unpopular too but I don’t think seeking validation from people with eating disorders for dieting is right. In any way. As someone who has been in and out of treatment for most of their life, this is an incredibly complex illness. I spend every day wishing for death, tearing myself to shreds, vomiting and fasting, shaking and dizzy. I’ve been on more medication than I care to admit, been psychoanalyzed countless times and can spew the caloric information of thousands of foods. I wish I didn’t feel this way and I would hate for some of these people to learn unhealthy coping methods from one of us. An eating disorder isn’t cool or trendy and many current diet fads normalize bad behaviour. It can be hard for people with eating disorders to seek out/receive proper medical attention when everyone feels as if they have one.",
          "created_utc": 1590582011.0
        },
        {
          "id": "frzf0wo",
          "author": "gobluebabyyy",
          "body": "I agree with you but what’s the solution? I know my ED started as “just” disordered eating that then became something that, like this post says, controlled my life. Should we tell those people not to post here or not to be worried about their disordered eating because it’s not yet an ED?",
          "created_utc": 1590591049.0
        }
      ]
    },
    {
      "id": "frzofv0",
      "author": "MysticalWateryEye",
      "body": "Adding to this, because i agree with you. \n\nWe cannot diagnose whether it's disordered eating vs. an eating disorder online, a lot of people downplay what they are doing because some people don't want to come to terms with having an eating disorder. Plus, eating disorders as a mental health problem can be varied, and that also changes how people present their problems online. \n\nThere is no solution, it's an eating disorder sub, some people don't know if they have it or don't. Helping people seek treatment even if it is actually \"disordered eating\" instead of a full blown ED, is still a good thing to encourage treatment for. \n\nI understand it's triggering feeling like one thing or another about eating disorders vs. disordered eating. But i'd feel worse if this sub would start blocking out those posts, because regardless of whether it's either, they still need some treatment. of some form.",
      "created_utc": 1590595738.0,
      "score": 3,
      "context": [
        {
          "id": "fryzu2j",
          "author": "None",
          "body": "Yeah, I’ve noticed the insane amount of these posts too. Reading through them, I find myself becoming frustrated. Yes, I know that disordered eating can become an eating disorder if left unchecked but an eating disorder is far beyond the scope “I ate a little bit less for a month or two and lost some weight, I don’t want to gain it back.”\n\nI’m sure my opinion is going to be fairly unpopular too but I don’t think seeking validation from people with eating disorders for dieting is right. In any way. As someone who has been in and out of treatment for most of their life, this is an incredibly complex illness. I spend every day wishing for death, tearing myself to shreds, vomiting and fasting, shaking and dizzy. I’ve been on more medication than I care to admit, been psychoanalyzed countless times and can spew the caloric information of thousands of foods. I wish I didn’t feel this way and I would hate for some of these people to learn unhealthy coping methods from one of us. An eating disorder isn’t cool or trendy and many current diet fads normalize bad behaviour. It can be hard for people with eating disorders to seek out/receive proper medical attention when everyone feels as if they have one.",
          "created_utc": 1590582011.0
        },
        {
          "id": "frzf0wo",
          "author": "gobluebabyyy",
          "body": "I agree with you but what’s the solution? I know my ED started as “just” disordered eating that then became something that, like this post says, controlled my life. Should we tell those people not to post here or not to be worried about their disordered eating because it’s not yet an ED?",
          "created_utc": 1590591049.0
        }
      ]
    },
    {
      "id": "frzp4lt",
      "author": "Ghordrin",
      "body": "A flair wouldn't be a bad idea at all. I'll write it down. Thanks for the feedback. :)",
      "created_utc": 1590596074.0,
      "score": 3,
      "context": [
        {
          "id": "frzmz9a",
          "author": "Ghordrin",
          "body": "Hello, guys, I am one of the mods that approves requests and handles the subreddit. I will be speaking from my own point of view and not of all mods when I refer to myself.\n\nA post like this has been long overdue. The thing is that while this post is extremely well written and informative it could also push the idea that those who post \"Do I have an ED\" most likely don't have an eating disorder but a disordered eating pattern. The problem is that we don't know and that none of us can confirm if you have an eating disorder. This post is certainly one that comes from a very good place and has no intentions of nullifying anyone's ED or disordered eating pattern. But if we were to deflect all requests from people who haven't been diagnosed then this sub would have way less participants. Less participants means less answers, less support, etc ...\n\nRequests like \"Do I have an ED\" happen a lot. I'd say about 60% of all requests are questions if they could have their post because they are concerned they might be developing an eating disorder or that they suspect they have an eating disorder and are seeking validation of some kind.  A common thought with anyone who struggles with any disorder is:  *Am I hurting bad enough to seek help? Am I \"sick enough\"*. This is one of the reasons as to why we allow these posts to come through. We never know which post might \"save a life\".\n\nThe majority of the time I reply with the same kind of response - I even have a prefab reply that I copy and paste for those posts - and while that blocks a whole bunch of the requests I can't help but think... There has to be a reason as to why we are getting so many requests about this. What I have been told regularly is that some people do not have the ability to seek help. Regardless of money, some requests talk about the OP not being able to speak to their doctor or legal guardians about this. Others seek help for beloved ones. \n\n\nWe, the mods, know that allowing these posts wont fix anyone's (possible) ED. None of us, mods or readers, can actually help diagnose an eating disorder. Even if some of us were licensed professionals. \n\nThat being said, I think this post definitely brings up a great point. The original intent of this sub was for people to have questions about eating disorders like:\n\n* How to deal with the common struggles about eating disorders\n\n* How to deal with certain situations. (Public eating, how to tell someone you trust about your struggles)\n\n* How to seek help\n\n* etc...\n\nThe sub has changed from mostly asking questions about eating disorders to people mainly venting and people who seek validation. This is due to lack of moderation on certain aspects and the fact that we've grown a whole lot. The lack of moderation is something we have to speak about internally. \n\nHow we will move forward, I don't know. I am however open for ANYONE to openly DM me how to improve things or share their experiences. I really want this sub to be a safe, informative place with a clear purpose. Cause now it is somewhat all over the place.\n\nI am also available on our Discord server. You can find the link in each auto moderator reply, by checking the sidebar or clicking on this link: https://discord.gg/ShRD55t\n\nI wish you all the best.",
          "created_utc": 1590595022.0
        },
        {
          "id": "frzowc6",
          "author": "MysticalWateryEye",
          "body": "THANK YOU! this is my fear too. Because a lot of people with eating disorders might come off as disordered eating, because a lot of people with eating disorders downplay it. \n\nYou could always just make a \"flair\" for the \"do i have....\" posts so that people can avoid those posts.  I personally come here to make sure these people seek treatment, regardless of what they might have, because getting in contact with a doctor can and will save lives.",
          "created_utc": 1590595962.0
        }
      ]
    },
    {
      "id": "frzt3em",
      "author": "the_scientist52",
      "body": "Thank you!  I know my comment was long, but this post brought up an issue that I've been thinking about a lot lately and I was curious to see if others could relate at all (or if my thoughts just make absolutely no sense lol).\n\nI really appreciate you all putting in the effort for deciding how to best move forward!  It's obvious that you really care about this community.  And I know it must be difficult to find a balance that feels okay for everyone!  I agree that not having those types of posts at all wouldn't be the solution, but perhaps an idea like what you suggested with the filtering could be good.",
      "created_utc": 1590597981.0,
      "score": 1,
      "context": [
        {
          "id": "frzri1s",
          "author": "the_scientist52",
          "body": "I've been struggling a lot with the extreme uptick in \"do I have an ED?\" posts here in the sub.  This may be an unfair assumption to make, but I suspect that many of the posters are completely aware that something is wrong with their eating/exercise patterns but are just seeking validation.  As a general rule, needing reassurance isn't a bad thing, but I think that with EDs it can get really tricky.  These disorders get really competitive and can often feed off of other people's concern/attention, so I feel like responding to these types of posts can just fuel that person's ED.  Again, I know this is a generalization, but it's just hard for me to imagine that someone typing \"I skip x number of meals every day and purge x days a week and use x other extreme behavior\" is *truly* in the dark about something being wrong.  I know that denial is a thing (I've struggled with it myself) and that information about EDs isn't widely taught, but it just seems like someone could use google and find resources about warning signs.  Going into a lot of details on a page like this doesn't feel necessary to me, and I think that even without numbers it can fuel a lot of comparison or an unhealthy need for validation.\n\nAnd I think the other piece is that, at least for me, being inundated with these posts gets mentally exhausting.  I am not a professional and most of the posters here aren't either, but I think there's an expectation that we take the role of a professional when being asked to judge someone's behavior patterns.  It's hard to describe, but I feel like there's this pressure put on me that just feels uncomfortable.  And it's hard to know how to respond to the posts.  If I say that it sounds like the person does have an ED, am I just feeding into the disorder they already know they have?  Or what if I'm wrong and I'm setting them up to feel invalidated later?  Or what if I don't think they have an ED--how do I say that gently and not trigger them?  And really, how can I truly tell if someone has an ED or it's just disordered eating, without knowing the extent to which the thoughts take up their headspace and the behaviors take over their day to day lives?  It can get really complicated really quickly regardless of whether the person presents as having an ED or not. I try not to respond to those posts anymore and just skip reading them when I can, but that underlying discomfort surrounding the whole thing somehow stays there.\n\nI guess it just feels like a lot of people are using this sub as a diagnostic tool of sorts.  I know that the intent of the sub was to be a place for people with EDs to get support about common struggles, like how to respond to triggering family members. But lately it's just felt like it's mostly turned into a place where people come in to ask those with EDs to make a judgment about whether their behaviors \"count,\" which isn't something we really have the capacity to do.",
          "created_utc": 1590597219.0
        },
        {
          "id": "frzsf2l",
          "author": "Ghordrin",
          "body": "Thanks for being transparent about the issues you have with these posts. As I've stated before, there are issues currently and something has to be done so we satisfy both sides. \n\nThe posts you talk about are posts that, in my opinion, shouldn't have been up like that. They should've either been heavily censored or given proper context. However, not having them at all seems a bit extreme. A suggestion has been made about giving the ability to filter out those posts by using flairs and filtering. We might look into that.",
          "created_utc": 1590597660.0
        }
      ]
    },
    {
      "id": "fs02lef",
      "author": "whinywino89",
      "body": ">Don’t just lump it into being an ED and go around telling that to anyone who will listen.\n\nThis is a BIG one, especially on Instagram. I've seen a lot of \"recovery\" pages that are basically just Fitspos in disguise who say they recovered from an eating disorder, but when pressed on it, say they were never actually diagnosed but they fit the criteria found online. \n\nI know everyone is different and everyone handles their ED differently, but I remember thinking that I may have an ED and going to seek help and still being gutted when medical professionals confirmed what I thought to be true. I wanted so badly for them to say, nope! you're good! So I could remain in that torturous-yet-comfortable way of life. Yes, disordered eating, if gone unchecked, can develop into an eating disorder, but I often feel like the types of people I mentioned above downplay just how difficult recovery can be because they didn't actually have an eating disorder in the first place. They were simply engaged in disordered eating habits.",
      "created_utc": 1590602546.0,
      "score": 5,
      "context": [
        {
          "id": "fryzu2j",
          "author": "None",
          "body": "Yeah, I’ve noticed the insane amount of these posts too. Reading through them, I find myself becoming frustrated. Yes, I know that disordered eating can become an eating disorder if left unchecked but an eating disorder is far beyond the scope “I ate a little bit less for a month or two and lost some weight, I don’t want to gain it back.”\n\nI’m sure my opinion is going to be fairly unpopular too but I don’t think seeking validation from people with eating disorders for dieting is right. In any way. As someone who has been in and out of treatment for most of their life, this is an incredibly complex illness. I spend every day wishing for death, tearing myself to shreds, vomiting and fasting, shaking and dizzy. I’ve been on more medication than I care to admit, been psychoanalyzed countless times and can spew the caloric information of thousands of foods. I wish I didn’t feel this way and I would hate for some of these people to learn unhealthy coping methods from one of us. An eating disorder isn’t cool or trendy and many current diet fads normalize bad behaviour. It can be hard for people with eating disorders to seek out/receive proper medical attention when everyone feels as if they have one.",
          "created_utc": 1590582011.0
        },
        {
          "id": "frzf0wo",
          "author": "gobluebabyyy",
          "body": "I agree with you but what’s the solution? I know my ED started as “just” disordered eating that then became something that, like this post says, controlled my life. Should we tell those people not to post here or not to be worried about their disordered eating because it’s not yet an ED?",
          "created_utc": 1590591049.0
        },
        {
          "id": "frzifut",
          "author": "None",
          "body": "Personal research needs to be done, like you would do if you feel like you have any problem—medical or non-medical. And then find the correct avenue to address those problems(nutritionist, therapy, etc). Don’t just lump it into being an ED and go around telling that to anyone who will listen. Yes, I get this is a safe space and there’s no way to vet whether or not someone is ill... \n\n...I just worry some people might be coming here in hopes of getting an ED/making their ED worse.\n\nEdit—\n\nI’ve been in programs that DO NOT accept patients with disordered eating but have accepted patients due to the pushing of the parents. It never ends well for those who are predisposed to having an ED, which is why I think they need to remain as separate entities.",
          "created_utc": 1590592779.0
        }
      ]
    },
    {
      "id": "fs009ee",
      "author": "gobluebabyyy",
      "body": "Sure. But I know a lot of people - ED or not - who benefit from counseling with a dietician and/or therapist. Most of the advice here usually boils down to “see a dietician and therapist”, not “you need to check in to inpatient right away.” I just don’t see the need for gatekeeping. I also haven’t seen a ton of posts I would characterize as people looking to make their ED worse, it mostly seems like genuine advice seeking to me. But I don’t read all the posts here so I don’t know.",
      "created_utc": 1590601430.0,
      "score": 1,
      "context": [
        {
          "id": "fryzu2j",
          "author": "None",
          "body": "Yeah, I’ve noticed the insane amount of these posts too. Reading through them, I find myself becoming frustrated. Yes, I know that disordered eating can become an eating disorder if left unchecked but an eating disorder is far beyond the scope “I ate a little bit less for a month or two and lost some weight, I don’t want to gain it back.”\n\nI’m sure my opinion is going to be fairly unpopular too but I don’t think seeking validation from people with eating disorders for dieting is right. In any way. As someone who has been in and out of treatment for most of their life, this is an incredibly complex illness. I spend every day wishing for death, tearing myself to shreds, vomiting and fasting, shaking and dizzy. I’ve been on more medication than I care to admit, been psychoanalyzed countless times and can spew the caloric information of thousands of foods. I wish I didn’t feel this way and I would hate for some of these people to learn unhealthy coping methods from one of us. An eating disorder isn’t cool or trendy and many current diet fads normalize bad behaviour. It can be hard for people with eating disorders to seek out/receive proper medical attention when everyone feels as if they have one.",
          "created_utc": 1590582011.0
        },
        {
          "id": "frzf0wo",
          "author": "gobluebabyyy",
          "body": "I agree with you but what’s the solution? I know my ED started as “just” disordered eating that then became something that, like this post says, controlled my life. Should we tell those people not to post here or not to be worried about their disordered eating because it’s not yet an ED?",
          "created_utc": 1590591049.0
        },
        {
          "id": "frzifut",
          "author": "None",
          "body": "Personal research needs to be done, like you would do if you feel like you have any problem—medical or non-medical. And then find the correct avenue to address those problems(nutritionist, therapy, etc). Don’t just lump it into being an ED and go around telling that to anyone who will listen. Yes, I get this is a safe space and there’s no way to vet whether or not someone is ill... \n\n...I just worry some people might be coming here in hopes of getting an ED/making their ED worse.\n\nEdit—\n\nI’ve been in programs that DO NOT accept patients with disordered eating but have accepted patients due to the pushing of the parents. It never ends well for those who are predisposed to having an ED, which is why I think they need to remain as separate entities.",
          "created_utc": 1590592779.0
        }
      ]
    },
    {
      "id": "frzpidx",
      "author": "MysticalWateryEye",
      "body": "Of course! i really appreciate all you do on these subs!",
      "created_utc": 1590596261.0,
      "score": 2,
      "context": [
        {
          "id": "frzmz9a",
          "author": "Ghordrin",
          "body": "Hello, guys, I am one of the mods that approves requests and handles the subreddit. I will be speaking from my own point of view and not of all mods when I refer to myself.\n\nA post like this has been long overdue. The thing is that while this post is extremely well written and informative it could also push the idea that those who post \"Do I have an ED\" most likely don't have an eating disorder but a disordered eating pattern. The problem is that we don't know and that none of us can confirm if you have an eating disorder. This post is certainly one that comes from a very good place and has no intentions of nullifying anyone's ED or disordered eating pattern. But if we were to deflect all requests from people who haven't been diagnosed then this sub would have way less participants. Less participants means less answers, less support, etc ...\n\nRequests like \"Do I have an ED\" happen a lot. I'd say about 60% of all requests are questions if they could have their post because they are concerned they might be developing an eating disorder or that they suspect they have an eating disorder and are seeking validation of some kind.  A common thought with anyone who struggles with any disorder is:  *Am I hurting bad enough to seek help? Am I \"sick enough\"*. This is one of the reasons as to why we allow these posts to come through. We never know which post might \"save a life\".\n\nThe majority of the time I reply with the same kind of response - I even have a prefab reply that I copy and paste for those posts - and while that blocks a whole bunch of the requests I can't help but think... There has to be a reason as to why we are getting so many requests about this. What I have been told regularly is that some people do not have the ability to seek help. Regardless of money, some requests talk about the OP not being able to speak to their doctor or legal guardians about this. Others seek help for beloved ones. \n\n\nWe, the mods, know that allowing these posts wont fix anyone's (possible) ED. None of us, mods or readers, can actually help diagnose an eating disorder. Even if some of us were licensed professionals. \n\nThat being said, I think this post definitely brings up a great point. The original intent of this sub was for people to have questions about eating disorders like:\n\n* How to deal with the common struggles about eating disorders\n\n* How to deal with certain situations. (Public eating, how to tell someone you trust about your struggles)\n\n* How to seek help\n\n* etc...\n\nThe sub has changed from mostly asking questions about eating disorders to people mainly venting and people who seek validation. This is due to lack of moderation on certain aspects and the fact that we've grown a whole lot. The lack of moderation is something we have to speak about internally. \n\nHow we will move forward, I don't know. I am however open for ANYONE to openly DM me how to improve things or share their experiences. I really want this sub to be a safe, informative place with a clear purpose. Cause now it is somewhat all over the place.\n\nI am also available on our Discord server. You can find the link in each auto moderator reply, by checking the sidebar or clicking on this link: https://discord.gg/ShRD55t\n\nI wish you all the best.",
          "created_utc": 1590595022.0
        },
        {
          "id": "frzowc6",
          "author": "MysticalWateryEye",
          "body": "THANK YOU! this is my fear too. Because a lot of people with eating disorders might come off as disordered eating, because a lot of people with eating disorders downplay it. \n\nYou could always just make a \"flair\" for the \"do i have....\" posts so that people can avoid those posts.  I personally come here to make sure these people seek treatment, regardless of what they might have, because getting in contact with a doctor can and will save lives.",
          "created_utc": 1590595962.0
        },
        {
          "id": "frzp4lt",
          "author": "Ghordrin",
          "body": "A flair wouldn't be a bad idea at all. I'll write it down. Thanks for the feedback. :)",
          "created_utc": 1590596074.0
        }
      ]
    },
    {
      "id": "frztfot",
      "author": "Ghordrin",
      "body": "Most of the credit goes to you, the community. We rarely have to remove bad comments, harassment or have to deal with trolls.\n\nThe general feedback to posts is thoughtful and caring and never dismissive. So if anything, you guys deserve a thank you for keeping this sub afloat.",
      "created_utc": 1590598141.0,
      "score": 2,
      "context": [
        {
          "id": "frzri1s",
          "author": "the_scientist52",
          "body": "I've been struggling a lot with the extreme uptick in \"do I have an ED?\" posts here in the sub.  This may be an unfair assumption to make, but I suspect that many of the posters are completely aware that something is wrong with their eating/exercise patterns but are just seeking validation.  As a general rule, needing reassurance isn't a bad thing, but I think that with EDs it can get really tricky.  These disorders get really competitive and can often feed off of other people's concern/attention, so I feel like responding to these types of posts can just fuel that person's ED.  Again, I know this is a generalization, but it's just hard for me to imagine that someone typing \"I skip x number of meals every day and purge x days a week and use x other extreme behavior\" is *truly* in the dark about something being wrong.  I know that denial is a thing (I've struggled with it myself) and that information about EDs isn't widely taught, but it just seems like someone could use google and find resources about warning signs.  Going into a lot of details on a page like this doesn't feel necessary to me, and I think that even without numbers it can fuel a lot of comparison or an unhealthy need for validation.\n\nAnd I think the other piece is that, at least for me, being inundated with these posts gets mentally exhausting.  I am not a professional and most of the posters here aren't either, but I think there's an expectation that we take the role of a professional when being asked to judge someone's behavior patterns.  It's hard to describe, but I feel like there's this pressure put on me that just feels uncomfortable.  And it's hard to know how to respond to the posts.  If I say that it sounds like the person does have an ED, am I just feeding into the disorder they already know they have?  Or what if I'm wrong and I'm setting them up to feel invalidated later?  Or what if I don't think they have an ED--how do I say that gently and not trigger them?  And really, how can I truly tell if someone has an ED or it's just disordered eating, without knowing the extent to which the thoughts take up their headspace and the behaviors take over their day to day lives?  It can get really complicated really quickly regardless of whether the person presents as having an ED or not. I try not to respond to those posts anymore and just skip reading them when I can, but that underlying discomfort surrounding the whole thing somehow stays there.\n\nI guess it just feels like a lot of people are using this sub as a diagnostic tool of sorts.  I know that the intent of the sub was to be a place for people with EDs to get support about common struggles, like how to respond to triggering family members. But lately it's just felt like it's mostly turned into a place where people come in to ask those with EDs to make a judgment about whether their behaviors \"count,\" which isn't something we really have the capacity to do.",
          "created_utc": 1590597219.0
        },
        {
          "id": "frzsf2l",
          "author": "Ghordrin",
          "body": "Thanks for being transparent about the issues you have with these posts. As I've stated before, there are issues currently and something has to be done so we satisfy both sides. \n\nThe posts you talk about are posts that, in my opinion, shouldn't have been up like that. They should've either been heavily censored or given proper context. However, not having them at all seems a bit extreme. A suggestion has been made about giving the ability to filter out those posts by using flairs and filtering. We might look into that.",
          "created_utc": 1590597660.0
        },
        {
          "id": "frzt3em",
          "author": "the_scientist52",
          "body": "Thank you!  I know my comment was long, but this post brought up an issue that I've been thinking about a lot lately and I was curious to see if others could relate at all (or if my thoughts just make absolutely no sense lol).\n\nI really appreciate you all putting in the effort for deciding how to best move forward!  It's obvious that you really care about this community.  And I know it must be difficult to find a balance that feels okay for everyone!  I agree that not having those types of posts at all wouldn't be the solution, but perhaps an idea like what you suggested with the filtering could be good.",
          "created_utc": 1590597981.0
        }
      ]
    },
    {
      "id": "frzstd8",
      "author": "Ghordrin",
      "body": "In all honesty, the community is what's keeping this sub afloat. The overwhelming help and feedback that has been given is amazing and that makes our job easier. \n\nWe rarely have pro-ED comments or hateful comments so I am grateful that these subs aren't brigaded by trolls. But as I have said before, there are some problems in terms of moderation that should be looked at.",
      "created_utc": 1590597849.0,
      "score": 2,
      "context": [
        {
          "id": "frzmz9a",
          "author": "Ghordrin",
          "body": "Hello, guys, I am one of the mods that approves requests and handles the subreddit. I will be speaking from my own point of view and not of all mods when I refer to myself.\n\nA post like this has been long overdue. The thing is that while this post is extremely well written and informative it could also push the idea that those who post \"Do I have an ED\" most likely don't have an eating disorder but a disordered eating pattern. The problem is that we don't know and that none of us can confirm if you have an eating disorder. This post is certainly one that comes from a very good place and has no intentions of nullifying anyone's ED or disordered eating pattern. But if we were to deflect all requests from people who haven't been diagnosed then this sub would have way less participants. Less participants means less answers, less support, etc ...\n\nRequests like \"Do I have an ED\" happen a lot. I'd say about 60% of all requests are questions if they could have their post because they are concerned they might be developing an eating disorder or that they suspect they have an eating disorder and are seeking validation of some kind.  A common thought with anyone who struggles with any disorder is:  *Am I hurting bad enough to seek help? Am I \"sick enough\"*. This is one of the reasons as to why we allow these posts to come through. We never know which post might \"save a life\".\n\nThe majority of the time I reply with the same kind of response - I even have a prefab reply that I copy and paste for those posts - and while that blocks a whole bunch of the requests I can't help but think... There has to be a reason as to why we are getting so many requests about this. What I have been told regularly is that some people do not have the ability to seek help. Regardless of money, some requests talk about the OP not being able to speak to their doctor or legal guardians about this. Others seek help for beloved ones. \n\n\nWe, the mods, know that allowing these posts wont fix anyone's (possible) ED. None of us, mods or readers, can actually help diagnose an eating disorder. Even if some of us were licensed professionals. \n\nThat being said, I think this post definitely brings up a great point. The original intent of this sub was for people to have questions about eating disorders like:\n\n* How to deal with the common struggles about eating disorders\n\n* How to deal with certain situations. (Public eating, how to tell someone you trust about your struggles)\n\n* How to seek help\n\n* etc...\n\nThe sub has changed from mostly asking questions about eating disorders to people mainly venting and people who seek validation. This is due to lack of moderation on certain aspects and the fact that we've grown a whole lot. The lack of moderation is something we have to speak about internally. \n\nHow we will move forward, I don't know. I am however open for ANYONE to openly DM me how to improve things or share their experiences. I really want this sub to be a safe, informative place with a clear purpose. Cause now it is somewhat all over the place.\n\nI am also available on our Discord server. You can find the link in each auto moderator reply, by checking the sidebar or clicking on this link: https://discord.gg/ShRD55t\n\nI wish you all the best.",
          "created_utc": 1590595022.0
        },
        {
          "id": "frzowc6",
          "author": "MysticalWateryEye",
          "body": "THANK YOU! this is my fear too. Because a lot of people with eating disorders might come off as disordered eating, because a lot of people with eating disorders downplay it. \n\nYou could always just make a \"flair\" for the \"do i have....\" posts so that people can avoid those posts.  I personally come here to make sure these people seek treatment, regardless of what they might have, because getting in contact with a doctor can and will save lives.",
          "created_utc": 1590595962.0
        },
        {
          "id": "frzp4lt",
          "author": "Ghordrin",
          "body": "A flair wouldn't be a bad idea at all. I'll write it down. Thanks for the feedback. :)",
          "created_utc": 1590596074.0
        },
        {
          "id": "frzpidx",
          "author": "MysticalWateryEye",
          "body": "Of course! i really appreciate all you do on these subs!",
          "created_utc": 1590596261.0
        }
      ]
    }
  ]
}