{
  "id": "grqkwg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590607986.0,
  "title": "Request: Is it useful to tell someone you have an ED or even just body image issues?",
  "selftext": "Is it useful to tell someone you have an ED or even just body image issues? \n\nI have been actively trying to combat my mental health and openness about it over the past 4 years. I want to be as open as possible because I think we should be able to be honest about this darker side of our lives as a society - so I try to practice what I preach. Having said that, I find it extremely difficult to do this with my eating disorder history. None of the friends I have made in the past 4 years are at all aware of me struggling.\n\nI find it difficult for a number of reasons. I find ED's are not talked about in the same way as other mental health problems - ED's are a long way behind other mental health problems in the discussion. No one talks about the true pain of putting your body and mind through so much trauma and it's really hard to help someone understand. Every time I have tried I have ended up in a puddle of tears. They're still glamorised but only when it's restricting which is fucked up. \n && I don't want people paying more attention to what I eat and how I look. I am trying to avoid that at all costs because it triggers me. I can just about have conversations about exercise and meals but it has taken a long time. How do I forget about my ED when I know people around me are going to be thinking about my weight etc?\n\na new friend has asked to go swimming in the lake next week. I really want to because it would be so much fun ... If I didn't care about my body so much. I have put on so much weight over lockdown - which has been a battle itself - and there's absolutely no way I will enjoy swimming or be good company in that scenario with how I look now. \n\n(I haven't relapsed yet although I can feel it coming and this swimming invitation feels the first major trigger. I really don't want to eat for at least the rest of today. I haven't felt this strongly compelled to restrict in a long time.) \n\nI feel so confused about whether to tell my friend I can't go swimming because of my ED, make up another excuse (but what?) Or just try and do it (which makes me feel sick).\nI really don't want to tell her about my ED and become even more defined by food and my body. I'm trying to leave it in the past as much as possible, & I feel like once someone knows, you can't really escape that. I've felt sick and upset since she sent the message and what to reply.\n\nI think as a society we should be able to have a lot more transparency around body image and all mental health & I want to play my part in that.. but I can't bring myself to do it with my own ED !!!! Urgh.\n\nHow do you guys cope with talking about your ED and similar scenarios with friends? \n\nI hate this shit. \n\nLove to everyone going through this long as fuck battle 💜",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/grqkwg/request_is_it_useful_to_tell_someone_you_have_an/",
  "score": 50,
  "num_comments": 12,
  "comments": [
    {
      "id": "fs0isqk",
      "author": "nastrals",
      "body": "Is it useful. Yes. But only if you trust that person and feel they will be supportive rather than critical. \nI told my best friend and another really good friend (who has since become my boyfriend) about my issues 2 years ago. They were both really supportive. Not critical. Tried to help boost my confidence. Monitor me for warning signs of serious health issues (I have an underlying condition made worse with poor diet) or dangerous habits . My best friend also involved my childhood friend. Yes this was a sort of breach of trust in some people’s eyes but it was actually really good as I found it really hard to open up and she kind of did that for me. \nMy now boyfriend would invite me round to his for food and he always did us sharing plates. He said he thought I might feel better if I didn’t have my own plate of food that I felt I was being judged for eating. It worked. I always ate more with him that way. \nI never feel either of them judged me or that they said things they didn’t mean just so as not to trigger anything. They were both honest and caring.\nOnly you know your friend and if they are typically judgemental or perhaps oblivious to ED’s in general. If they don’t know anything about them be prepared to explain perhaps in general details then more about your specifically. \nI would say try to go but can you make an excuse not to swim if that’s possible? If it’s going to trigger things you don’t want maybe Make an excuse but try not to outright lie. \nHaving people I can say to “I’m really struggling right now” then have discussions with has helped me to stop relapsing. I hope you can find the same.",
      "created_utc": 1590610326.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fs0tjoa",
      "author": "the_scientist52",
      "body": "I relate so much to all of this!  Personally I haven't shared anything about my ED with my friends (aside from ones I met in treatment) for the reasons you mentioned.  Something I struggle a lot with is whether they'll take my ED seriously or think I \"look\" the part, and even if they aren't judgmental, my ED will say otherwise and it can get triggering.  So I've felt it best for me to not share that part of my life because I know it would make the negative thoughts louder.  However, I do have friends from treatment who I can discuss ED stuff with in more detail, so I'm lucky to have some support even if my school friends aren't aware.  Being able to talk about it can be super useful, to answer your main question!\n\nI can see how this situation is challenging, though.  It sounds like you have a lot of reservations about sharing the ED stuff, which I totally understand.  While I think that being open with people is important, it sounds like your ED could jump on this opportunity to make you feel worse about yourself.  It could lead to mind-reading thoughts about what this friend is thinking about you, which the ED could easily use to fuel a relapse.  And since you seem like you're really struggling with relapse thoughts already, I think right now it would be best not to push it.  Out of your three options, I'd probably recommend not going this time and just giving a general excuse.  There's a chance she'll ask you to go again, but maybe by then you'll either feel more comfortable going or would feel more comfortable giving more of the reason.  Even a \"I'm just having a really hard time with body image right now\" would suffice, without having to go into all of the ED details if you don't want.  But for now it sounds like even that would be a challenge so it's fine to not go there yet.  I really applaud your desire to be open but I think it's important to watch out for yourself as best as you can when relapse thoughts are high, and if now just isn't the best time to share, that's perfectly okay.\n\nMy only other idea is, could there be a way you could go to the lake but not swim?  Like wear regular summer clothes and just lay by the water or something?  You could tell your friend that you just aren't feeling well and would rather not actually swim, but would love the chance to go spend some time outside with her.",
      "created_utc": 1590615524.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fs1t4bs",
      "author": "DogBreathologist",
      "body": "I think sometimes talking about it, takes away some of its power, and if it’s with someone who you can fully trust you should, especially if you’re in a really sensitive phase, as they can be there for you and support you. Please, please, please consider talking to your parents and a counsellor and looking up some online help guides, because it sounds like your ED is starting to control your life, not the other way around, and the more power it gets, the more power it has over you. And while you certainly don’t want to trigger anything sometimes safely pushing boundaries can be helpful, like still going and having a good time and not isolating yourself (which can be a really big thing with any ED/mental health issue), but not swimming, or maybe finding a swimsuit that’s not to revealing if you want to swim. And I know you don’t want to be watched while eating or feel like your every action is being judged but if you haven’t already please consider telling your parents so they can get you help, I know it’s stressful and scary but the more you do now to get a handle on your ED now, the less control it will have on you when you’re older.",
      "created_utc": 1590635085.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fs0dy83",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1590607986.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fs2wpie",
      "author": "assassin-mythic",
      "body": "I told two of my best friends a while ago and I have to say it must have been one of the best decisions I've made surrounding my ED. I'm not sure if I just have really really supportive friends or if telling people helps regardless of their reaction, but them knowing has not changed our dynamic even slightly. In fact, it came out that my friends had/have struggles in similar ways as well and it drew us so much closer together. Also, telling my friends has helped hold me really accountable for this damn  ED and made me want to recover to be there for them and for all of the fun we can have together when I am not thinking about hurting my body, food, body image, etc. Of course telling your friends is no easy thing to do but when you are ready, it can really help you in recovery.\n\nmuch love <3",
      "created_utc": 1590667183.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fs2ylsf",
      "author": "abisexualqueen",
      "body": "I've never related to a post more! everything- the friends for 4 years, the swimming in a lake,  and being conflicted about telling them! I have an Instagram for general health advice and shit like that, and there are some posts about my ed. I was thinking about sharing the account with my friends, but when I'm ready. I want them to know, but I don't want to risk them potentially trying to help and getting my parents/ the school involved. I know that would benefit me in the long run, but I don't think I can do that. i think you should tell your friends, so they can support you! I would also recommend you wear a t-shirt and shorts/ leggings swimming, to have fun but not feel self conscious. if they ask why, you can just say you don't like wearing a bikini:) good luck!",
      "created_utc": 1590668560.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fs3cxz4",
      "author": "None",
      "body": "Yes. I’m fairly open about it and it helps a lot. People are quite sympathetic even if they don’t really understand it.",
      "created_utc": 1590676875.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fs3kuu6",
      "author": "2jz93",
      "body": "Hey ! Someone with an eating disorder here :) I think it’s useful to tell the people in your life when you’re comfortable enough. It will explain mood changes and everything else the disease comes with as well. I don’t really like when people meddle in “too much” that’s why I’ve held back before but it does help. The people in my life will order me food without me saying yes and they won’t get mad if I don’t eat it, they’ll set at least a small plate for me so I eat a little bit. Eating disorders are so complicated so I understand. It’s the a HUGE part of who I’ve become and I’m trying to fix it as well.",
      "created_utc": 1590680728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fs3utlk",
      "author": "whinywino89",
      "body": "I'm definitely in the minority, but I'm very open about mine. I actually came out with a long blog post about it when I initially realized I was anorexic and blasted it out on my social media. I continue to be very open about it, even now that I've gone through recovery. My employer knows, my acquaintances know, even my landlord knows. \n\nI certainly don't blab about it but if the topic comes up, I make sure I mention it in a way that advocates for anyone who has struggled with an ED or body image issues. I've actually had a lot of people decide to get help because of my openness. Again, being super open is NOT for everyone and I don't recommend forcing it as it's a very personal thing; but I've always been very open about my mental health issues, even as a teenager.",
      "created_utc": 1590685326.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fs45zo0",
      "author": "oliviared52",
      "body": "If it’s a friend you trust, then I’d say to tell her. For a long time my ED was a secret and then slowly I got more comfortable telling people. Now I’m pretty open about it. Not like I bring it up to everyone, but if someone tells me they’ve struggled with something similar or knows someone who is I tell them I struggled with it too. \n\nYou’ll be amazed how many women have struggled with an ED once you are more open to talking about it. Men too but it seems to be more common in women. \n\nThat’s the one reason I don’t regret my eating disorder. Because I’ve found so many people who have gone through the same thing and now that I’m recovered it’s nice to be able to offer advice or an ear to listen and be able to understand. I have also found that the thought process of friends who struggled with drug addiction is very similar to an ED brain. So there’s lots of people in the world who will get what you’ve gone through. \n\nHonestly chances are good friends already suspect it. Once I got more comfortable talking about it, I found out all my friends knew and wanted to talk to me about it but didn’t know how. Even my guy friends which surprised me. Only one friend and my family ever said something when I was in the thick of it. But to be honest I wasn’t in a place to have a full on conversation about it. It’s pretty freeing getting to that place. Now I can even laugh about all the F’ed up stuff my ED brain used to tell me. \n\nKinda went on a rant but hope something in there helps 🤷🏼‍♀️ May I ask how old you are? Rooting for ya",
      "created_utc": 1590690558.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fs46fcw",
      "author": "oliviared52",
      "body": "Oh my gosh the ED brain telling you you can’t talk to friends because you don’t look the part. I relate to this so much. Which is so stupid because now that I’m out of ED brain most of the time, it’s obvious anyone at any weight can have an eating disorder. And I would never in a million years think someone who is overweight or a healthy weight doesn’t have an eating disorder, but your ED brain loves to tell you that other people will think that about you. \n\nBtw the 52 in your name, any chance your bday is May 2? \n\nGlad you got some good friends out of recovery 😊 always helps to have people who get it to talk to. That’s why this subreddit is so awesome.",
      "created_utc": 1590690762.0,
      "score": 1,
      "context": [
        {
          "id": "fs0tjoa",
          "author": "the_scientist52",
          "body": "I relate so much to all of this!  Personally I haven't shared anything about my ED with my friends (aside from ones I met in treatment) for the reasons you mentioned.  Something I struggle a lot with is whether they'll take my ED seriously or think I \"look\" the part, and even if they aren't judgmental, my ED will say otherwise and it can get triggering.  So I've felt it best for me to not share that part of my life because I know it would make the negative thoughts louder.  However, I do have friends from treatment who I can discuss ED stuff with in more detail, so I'm lucky to have some support even if my school friends aren't aware.  Being able to talk about it can be super useful, to answer your main question!\n\nI can see how this situation is challenging, though.  It sounds like you have a lot of reservations about sharing the ED stuff, which I totally understand.  While I think that being open with people is important, it sounds like your ED could jump on this opportunity to make you feel worse about yourself.  It could lead to mind-reading thoughts about what this friend is thinking about you, which the ED could easily use to fuel a relapse.  And since you seem like you're really struggling with relapse thoughts already, I think right now it would be best not to push it.  Out of your three options, I'd probably recommend not going this time and just giving a general excuse.  There's a chance she'll ask you to go again, but maybe by then you'll either feel more comfortable going or would feel more comfortable giving more of the reason.  Even a \"I'm just having a really hard time with body image right now\" would suffice, without having to go into all of the ED details if you don't want.  But for now it sounds like even that would be a challenge so it's fine to not go there yet.  I really applaud your desire to be open but I think it's important to watch out for yourself as best as you can when relapse thoughts are high, and if now just isn't the best time to share, that's perfectly okay.\n\nMy only other idea is, could there be a way you could go to the lake but not swim?  Like wear regular summer clothes and just lay by the water or something?  You could tell your friend that you just aren't feeling well and would rather not actually swim, but would love the chance to go spend some time outside with her.",
          "created_utc": 1590615524.0
        }
      ]
    },
    {
      "id": "fs46p43",
      "author": "oliviared52",
      "body": "Also I know when I was in the thick of it I would have never even thought to tell my friends why I don’t want to go swimming. I think it’s really awesome you have come to a place you want to 🙏🏼",
      "created_utc": 1590690888.0,
      "score": 1,
      "context": [
        {
          "id": "fs45zo0",
          "author": "oliviared52",
          "body": "If it’s a friend you trust, then I’d say to tell her. For a long time my ED was a secret and then slowly I got more comfortable telling people. Now I’m pretty open about it. Not like I bring it up to everyone, but if someone tells me they’ve struggled with something similar or knows someone who is I tell them I struggled with it too. \n\nYou’ll be amazed how many women have struggled with an ED once you are more open to talking about it. Men too but it seems to be more common in women. \n\nThat’s the one reason I don’t regret my eating disorder. Because I’ve found so many people who have gone through the same thing and now that I’m recovered it’s nice to be able to offer advice or an ear to listen and be able to understand. I have also found that the thought process of friends who struggled with drug addiction is very similar to an ED brain. So there’s lots of people in the world who will get what you’ve gone through. \n\nHonestly chances are good friends already suspect it. Once I got more comfortable talking about it, I found out all my friends knew and wanted to talk to me about it but didn’t know how. Even my guy friends which surprised me. Only one friend and my family ever said something when I was in the thick of it. But to be honest I wasn’t in a place to have a full on conversation about it. It’s pretty freeing getting to that place. Now I can even laugh about all the F’ed up stuff my ED brain used to tell me. \n\nKinda went on a rant but hope something in there helps 🤷🏼‍♀️ May I ask how old you are? Rooting for ya",
          "created_utc": 1590690558.0
        }
      ]
    }
  ]
}