{
  "id": "gspwmj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590745494.0,
  "title": "Request: How long did it take for you to stop having obsessive thoughts about food?",
  "selftext": "I’m currently in recovery, and although it’s much better than when I was at my most restrictive, my mind is always focused on food. It’s at the forefront of my mind all day every day, and I’m so tired of waking up thinking about food and going to bed with the same thoughts and stresses on my mind. How long did it take you to recover from these obsessive compulsory thoughts? \nI’ve been in recovery for around four months at this point, and although I’m still not weight restored, I would’ve expected this to have lessened. It consumes my mind most of the day... :(",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gspwmj/request_how_long_did_it_take_for_you_to_stop/",
  "score": 53,
  "num_comments": 11,
  "comments": [
    {
      "id": "fs70wod",
      "author": "updown27",
      "body": "It took about two years of consistent recovery for my thought patterns to change to the point that they don’t bother me any more. This does not include the three years prior to that during which I kind of gave up on recovery and wasn’t getting the help I needed. I still have thoughts once in a while but my brain has learned to redirect them right away so they are no longer troublesome. It’s a long haul game but it’s worth it.",
      "created_utc": 1590756448.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fs83n62",
      "author": "miguyah",
      "body": "I really don’t think it ever stops, I’m recovered and I still think about the calories, the amount, the possible weight gain. The thoughts are still there I just don’t act on them, I don’t restrict or constantly check my weights",
      "created_utc": 1590775967.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fs6v2si",
      "author": "alsmagicbeans",
      "body": "I have been in recovery for the same amount of time!  Something that helped me was thinking back to when I was little & what brought me joy then. Also just thinking about things I’ve always wanted to try doing and giving them a go. I started surfing over the last year and challenging myself with a different activity has really helped the ED voice calm down. My dietician doesn’t love all the physical activity but it’s so important to me because I find the whole experience therapeutic. Plus seeing myself progress in something other than restricting intake and weight loss makes me motivated to keep listening  to my body & eating enough to help fuel time in the water. Think about activities you’ve always wanted to do or things you used to love! Really try to do them. I know with the pandemic some things aren’t possible right now but find something that is & do it regularly. It takes time to find something that you love that’s more important than ED but it’s so worth it.",
      "created_utc": 1590752135.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fs80dhc",
      "author": "kourtroom",
      "body": "For me, it’s been 7 years and I’m rather disheartened to report that it really never exactly goes away. That isn’t to say that they don’t get better, they get much better, but it’s unrealistic unfortunately to hope they go away all together. That’s my understanding anyway, that to an extent it’s a life long battle. Again, not as much as during the heart of your disorder, but something present enough to I have to make a conscious effort to ignore.",
      "created_utc": 1590774426.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fs6oimu",
      "author": "anaa_s",
      "body": "I think you should go into self exploration of yourself. What are your hobbies ? Do you like cinema, music, painting, any sport in particular ? What are your values ? What causes are near to your heart (activism) ? Dig deep ... How do you want to impact this world. What are the talents that you can offer the world. \n\nFood wise it's hard to tell because we've been conditioned since we were born by diet culture directly and indirectly. One fun mindset is rebellion. Rebellion against a billion dollar industry that profits of our insecurities. Who are they to tell us portion sizes ? How to eat and how much ? We are ALL so different and our bodies are miracle machines that cannot be reproduced. It is so wonderful that it keeps us alive every second of everyday sending us signals and symptoms to indicate it's state.\n\nShow grace and mercy to your body. Your body is your home. 💗",
      "created_utc": 1590746104.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fs85xa2",
      "author": "lottie6310",
      "body": "I’ve had AN for 6 years and ‘recovered’ then relapsed multiple times but I’ve been in full active recovery since the beginning of the year. The thoughts have definitely decreased since I was at my lowest mentally (4/5 months ago). But when I think about it in comparison with people who don’t have an ED it’s pretty demoralising. What I find helps me is perspective. I compare where I am now from where I was. I am so much better to then. Each day I will incrementally get better and by the end of this year it will be even more noticeable and continue in the years to come if I remain in full active recovery. If I slip and go for ‘one last time’ it will make it harder and longer to get to where I want to be. As ‘normal’ as possible and symptom free from my ED. \n\nIt does get better but it takes patience and continued commitment. Don’t give up. You’ll get there.",
      "created_utc": 1590777047.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fs6nw4j",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1590745494.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsdbuwv",
      "author": "Visneko",
      "body": "I’ve been in recovery for 9 months. At some point I was like, “screw it”, and ate whatever I wanted. I’ve gained weight, but gradually my obsession over food went away once I was a few months in maintaining my restored weight. Not only that, but I don’t receive that many cravings anymore either. I heard that we end up obsessing over food in periods of starvation because the body lowers metabolism and plays with our hormones to put us back in homeostasis (or set point weight in this case). The body is smart and funny like that...\n\nI’d say it’s probably the idea of allowing yourself to eat whatever you want, whenever you want. When I allowed myself to eat cookies, for example, I definitely feasted on them at first. As time went on, I was able to eat just 1 or 2 cookies (3 at most if I’m feeling like a real cookie) and feel satisfied.",
      "created_utc": 1590882396.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fs8zb6f",
      "author": "None",
      "body": "Ditto.  About two years.",
      "created_utc": 1590791748.0,
      "score": 3,
      "context": [
        {
          "id": "fs70wod",
          "author": "updown27",
          "body": "It took about two years of consistent recovery for my thought patterns to change to the point that they don’t bother me any more. This does not include the three years prior to that during which I kind of gave up on recovery and wasn’t getting the help I needed. I still have thoughts once in a while but my brain has learned to redirect them right away so they are no longer troublesome. It’s a long haul game but it’s worth it.",
          "created_utc": 1590756448.0
        }
      ]
    },
    {
      "id": "fs94469",
      "author": "kourtroom",
      "body": "This, this, this. The calorie counting is practically like breathing for me since I know the calories in everything & it’s a little impossible to ignore. That said, how you react to the thoughts & whether or not you choose to restrict makes all the difference & separates the disordered thinking from recovery thinking",
      "created_utc": 1590794408.0,
      "score": 4,
      "context": [
        {
          "id": "fs83n62",
          "author": "miguyah",
          "body": "I really don’t think it ever stops, I’m recovered and I still think about the calories, the amount, the possible weight gain. The thoughts are still there I just don’t act on them, I don’t restrict or constantly check my weights",
          "created_utc": 1590775967.0
        }
      ]
    },
    {
      "id": "fs8mef0",
      "author": "ahobo_",
      "body": "I have a similar recovery time under my belt and  the way you explain it in this comment is SPOT ON for me as well.",
      "created_utc": 1590785076.0,
      "score": 3,
      "context": [
        {
          "id": "fs80dhc",
          "author": "kourtroom",
          "body": "For me, it’s been 7 years and I’m rather disheartened to report that it really never exactly goes away. That isn’t to say that they don’t get better, they get much better, but it’s unrealistic unfortunately to hope they go away all together. That’s my understanding anyway, that to an extent it’s a life long battle. Again, not as much as during the heart of your disorder, but something present enough to I have to make a conscious effort to ignore.",
          "created_utc": 1590774426.0
        }
      ]
    }
  ]
}