{
  "id": "gta1dk",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590822782.0,
  "title": "Request: asian culture and eating disorders",
  "selftext": "here's my post request: \n\nhi everyone, seeking support. i'm asian american and i don't really see culturally-specific help for people who grew up with family dynamics like mine. also don't see as much representation in general. my asian parents don't know how to respond to the problem. they seem to want to help but whenever this topic gets brought up, they say something hurtful. i feel like i'm being too sensitive when it happens, but it feels bad enough that i just avoid the topic all together. it's also an Asian thing for relatives and family friends to greet you with a \"oh hello ____ you look so good! you lost weight!!\" or \"oh hello ____ you gained weight!! omg stop eating so much\" and then proceed to shovel your plate high with party food. additionally i don't have a habit of being emotionally honest with my parents so trying to explain my feelings feels massively embarrassing. these are 2 people who lived through the communist revolution in china, where the government was disappearing dissidents, sending off droves of young people into the countryside for useless \"reeducation,\" and food rationing/crop failures created a generation of underweight children. basically they've been through some shit and in light of all that, i feel like my problems ain't shit. but they're still problems because they're my problems. i have a hard time reconciling this generational/historical guilt and feeling like my problems are real. idk if anyone can relate, but give a shout out if you do.\n\nsort of related-- i found a related facebook group a few days ago for asians with eating disorders. it's pretty new but it's a start. basically a group for asians everywhere to vent and find support about their ED experience. i've just been lurking but a couple of posters have shared things that really hit me hard. hope this helps. https://www.facebook.com/groups/subtleasianeatingdisordersupport/",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gta1dk/request_asian_culture_and_eating_disorders/",
  "score": 96,
  "num_comments": 15,
  "comments": [
    {
      "id": "fsacn3h",
      "author": "dby1014",
      "body": "I feel you. I’m also As-Am and am constantly reminded of my size. When I came home from college, the first comments I always got were from my mom — “you got skinner” or “you got fatter.” After quarantining recently, I saw my grandpa for the first time in many months. His first words to me were “did you get fatter?” I’ve found it extremely difficult to open up to my mom about any emotional issues I may be going through. What has helped me the most is talking to my Asian-American friends. Even though not all of them suffer from EDs, many of them have had disordered eating due to our culture’s opinions about how our bodies should look. You’re not alone :)",
      "created_utc": 1590824495.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fsatld3",
      "author": "timeforbedplease",
      "body": "Yes! It's so normal for my Asian family members to blurt out changes in my weight when I see them, it's almost always the first thing they do.",
      "created_utc": 1590840983.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fsavpuz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1590842700.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fsaqz4z",
      "author": "None",
      "body": "As an Asian-Australian, it's important to recognize that family members probably don't see what they're doing is unhealthy. Praising weight loss isn't glorifying over-exercising. Piling large amounts of food on a plate is probably because they don't want you to starve. You can tell your parents to stop certain behaviors, if they are triggering to you -but I don't know what your dynamic with them is like.",
      "created_utc": 1590838642.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsaxyb4",
      "author": "ilikekneesandbees",
      "body": "I’m also an Asian American and all of this is so relatable. My parents had so many more struggles than I ever had and it’s hard to open up to them. It took 7 years, but my mom is finally more open to discussing my issues and being receptive of how she triggers me. She isn’t perfect, but it’s definitely progress. Wishing you the best! And you can always dm me!",
      "created_utc": 1590844401.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsb0vmo",
      "author": "None",
      "body": "I am not asian at all, a European male from Vienna, so I doubt that I will have to say much insightful here, but my first thought when I read this was: My broad idea about Asian cultures in general is that they tend to suppress emotions in general, a bit more than others maybe, which of course is a very fruitful starting point to develop an intense eating disorder, since eating disorders are almost always about dealing with some complex emotional issues, and suppressing, controlling those issues. Your personal description of family affairs do not seem to be that different from things I know from my own family or from friend's families, from the middle eastern spectrum, Muslim, or not, Afghan, Turk, whatever. So, maybe an open and honest conversation with your parents from time to time would help to dissolve much of the tension. That 's the obvious advice, but of course that is easier said than done, especially when things are as they usually are with your own parents, especially when you are a teenager or a young adolescent; complicated. Well, that 's my dribble of \"help\". Take care.",
      "created_utc": 1590846442.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsbjzrg",
      "author": "redditer511",
      "body": "Oh wow, I’m really happy you wrote this post. Both my sister and I have had eating disorders (she has repaired her relationship with food whereas I’m still struggling) and i had NO idea how prevalent it was in our community. I can ABSOLUTELY relate to the fact that relatives/family think it’s totally ok to comment about me looking fatter or me losing weight and how I should always finish the food on my plate (also grew up in communist decade where everything was scarce). Also I’ve been trying to lift weights and my mom constantly tells me I’m gonna start looking ugly if I put in muscles and because I’ll start to “look bulkier.” Which, is super discouraging/just her wanting me to look like the typical slender asian female. \n\nReally, really opened my eyes since you wrote this post. Thank you so much. I would join the Facebook page, but I’m taking a break from all social media.",
      "created_utc": 1590857476.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsmnuhb",
      "author": "Comfortable-Falcon",
      "body": "Indian here. At this point, I'm scared to go visit my relatives for fear of relapsing because they love pointing out weight changes and then proceeding to give out unsolicited weight-loss advice or just saying \"Screw it, you've gained weight, let's finish that tub of ice cream!\".",
      "created_utc": 1591101150.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsaasbr",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1590822782.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsbx2n3",
      "author": "isi02",
      "body": "I am Asian American and well, let’s just say that my particular culture has a lot of intergenerational trauma as well. I also struggle with thinking of my mental health issues including ED as legitimate. But all I can do is just try to accept the reality that I do have them and pain isn’t a competition. Happiness isn’t a competition so why should pain be too? Or something like that. I’ve also been learning a bit about epigenetics and how things our ancestors experienced do get passed down and make us more susceptible to developing certain conditions. I mean, that’s a massive simplification but it is kinda comforting in that maybe I’m like this because I’m carrying the stress from my past ancestors too in a way so it doesnt feel so much that I’m personally just weak and stupid. It does kinda help me to be a bit more compassionate to myself. \n\nBut yeah, my parents know I have an ED but don’t think it’s a real thing because “American doctors don’t understand our culture” and keep saying things that try to encourage disordered behaviors. It has made me feel frustrated but also like I’m the over sensitive problem but I’ve come to accept I’m still allowed to be upset about anything I want if it’s an infringement of boundaries and my needs even if it’s culturally normalized or whatever. So all I can do is just try to not take it personally and ignore what they say because I don’t think I can change them and their attitudes towards food/weight. I basically just emotionally tap out in those situations.",
      "created_utc": 1590862176.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsct8g6",
      "author": "cynthia_2901",
      "body": "Hey! I'm so sorry you're going through this, I definitely relate to this growing up in Asia.  It sucks and it feels as though nothing you do will ever be appropriate.  When you lose weight or get dangerously unhealthy, they either encourage it or feign concern with stuff like \"are you eating enough? eat more\" then talk about you behind your back about how you're not taking care of yourself.\n\nSomething that I've come to realized in the past few years that may be helpful to you and others reading this: relatives, even your parents, have no criteria for what is acceptably thin or plump.  When I was going through the roughest period of my life, I lost 6 kg and when my mother visited me after not seeing me for a few months she sent a picture of me to my father.  He commented that it was good I lost weight and she commented that she thought I had gained.  This was when I realized they have no metric for weight gain or health.  Don't let your family tell you you're not enough, your struggles are valid and as far as I'm concerned, relatives are strangers if they're not involved personally with you.",
      "created_utc": 1590873611.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsbkfko",
      "author": "redditer511",
      "body": "Man I’m literally in the same position as you and I can relate to you so much as an asian American. I’m currently struggling with binge eating after going through cycles of weight gain and weight loss. Im here for you and together let’s get through this ❤️",
      "created_utc": 1590857650.0,
      "score": 5,
      "context": [
        {
          "id": "fsavpuz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1590842700.0
        }
      ]
    },
    {
      "id": "fswup0s",
      "author": "lw5636",
      "body": "that’s amazing, wishing you the best",
      "created_utc": 1591311001.0,
      "score": 2,
      "context": [
        {
          "id": "fsaxyb4",
          "author": "ilikekneesandbees",
          "body": "I’m also an Asian American and all of this is so relatable. My parents had so many more struggles than I ever had and it’s hard to open up to them. It took 7 years, but my mom is finally more open to discussing my issues and being receptive of how she triggers me. She isn’t perfect, but it’s definitely progress. Wishing you the best! And you can always dm me!",
          "created_utc": 1590844401.0
        }
      ]
    },
    {
      "id": "fsbogjq",
      "author": "steamricecake",
      "body": "❤️❤️",
      "created_utc": 1590859212.0,
      "score": 2,
      "context": [
        {
          "id": "fsavpuz",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1590842700.0
        },
        {
          "id": "fsbkfko",
          "author": "redditer511",
          "body": "Man I’m literally in the same position as you and I can relate to you so much as an asian American. I’m currently struggling with binge eating after going through cycles of weight gain and weight loss. Im here for you and together let’s get through this ❤️",
          "created_utc": 1590857650.0
        }
      ]
    },
    {
      "id": "fsx1j8x",
      "author": "ilikekneesandbees",
      "body": "Thank you! Wishing you well too!",
      "created_utc": 1591314628.0,
      "score": 1,
      "context": [
        {
          "id": "fsaxyb4",
          "author": "ilikekneesandbees",
          "body": "I’m also an Asian American and all of this is so relatable. My parents had so many more struggles than I ever had and it’s hard to open up to them. It took 7 years, but my mom is finally more open to discussing my issues and being receptive of how she triggers me. She isn’t perfect, but it’s definitely progress. Wishing you the best! And you can always dm me!",
          "created_utc": 1590844401.0
        },
        {
          "id": "fswup0s",
          "author": "lw5636",
          "body": "that’s amazing, wishing you the best",
          "created_utc": 1591311001.0
        }
      ]
    }
  ]
}