{
  "id": "gtp1d8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590884102.0,
  "title": "Request: Request for advice; husband got laid off and I'm slipping into a relapse",
  "selftext": "I've been living off of a protein shake a day and giving my food to our daughter. The problem life is rewarding me for this...the less food I eat the more money is saved.\n\nIt makes me feel like a hero for my family. \n\nAfter weighing myself today I realized I've lost a double digit number (as per group rules I am not saying what it is) but it was a horrifying amount to lose a little over a week.  \n\nI'm not underweight at the moment but I may be in a week at the rate it is coming off of me. \n\nSince I'm associating not eating with saving my family I've noticed today I'm starting to get very anxious about eating. \n\nFood Bank isn't an option and he'd know if I got food from there because of joint bank accounts (how could I justify why food was free without telling him?) and his pride. \n\nI have been in remission for over a year. I don't know what to do",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gtp1d8/request_request_for_advice_husband_got_laid_off/",
  "score": 46,
  "num_comments": 7,
  "comments": [
    {
      "id": "fsdisas",
      "author": "bluebandicute",
      "body": "Have you talked to your husband at all about this? He’s your husband, and he married you because be loves you. If he knew that you were starving in order to save your family from getting government assistance it would probably hurt him. \n\nJust guessing, but it seems like the problem actually lies in your want to control what you can, which is your eating. But living off a protein shake a day isn’t actually helping your impressionable daughter or your husband who loves and cares about you. \n\nHaving this awkward conversation that you guy’s can’t afford food and need government assistance OR that you are seeking control by severely limiting your intake more than anyone but yourself would expect would be easier in the long run than avoiding it. \n\nYou’ve worked so hard in the year you’ve been in remission. Your family is part of your support system, please don’t leave them out.",
      "created_utc": 1590886514.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fsdiyf3",
      "author": "moooooopg",
      "body": "I'm just reaching out to say that you sound like your doing your best to cope with the situation. You are a good mother and wife whether or not you eat. You have the right to nourish yourself.",
      "created_utc": 1590886614.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fseabdm",
      "author": "houston_veronica",
      "body": "There are many options right now; your need to survive is not only your own right to live, but the fact that you have a dependent child: what if something were to happen to you because you are sacrificing your own health? She would be far worse off than almost any other outcome. Please don't allow ED to wear this mask of sacrifice; it will do anything it can to mask itself as something noble, disciplined, righteous, sacrificial...all for the end result that no one wants to admit. I just observed a woman with a longstanding ED pass away after many years of struggle, and I myself also nearly did get to that point. It's the worst when not only do your loved ones feel exasperated, but they feel burdened beyond description. It's not necessarily a reason to recover, but I'm not going to lie - it is the only reason I took the treatment. \n\nLife is so much better without ed. You can still care for your family responsibly and within your means. Also, pride or not, food banks are being utilized by the most unlikely families...people who earned much more than \"middle class\" prior to Corona. You have nothing to be ashamed of.\n\nDo the next right thing - please eat well starting now.  Blessings are being wished your way right now, OP.",
      "created_utc": 1590904277.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fsderw5",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1590884102.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsg8ee8",
      "author": "icanhasnoodlez",
      "body": "Maybe your husband would be willing to pick the lesser that hurts his ego, receiving food from a food pantry or his wife consumed with anxiety and seriously compromising her health. I'm sure he'd be alright with the former.",
      "created_utc": 1590953317.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsgfixn",
      "author": "tomhall44",
      "body": "You need to say something.",
      "created_utc": 1590957005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsfwdbr",
      "author": "bitchbiathlon",
      "body": "Seconded!!",
      "created_utc": 1590947129.0,
      "score": 1,
      "context": [
        {
          "id": "fsdiyf3",
          "author": "moooooopg",
          "body": "I'm just reaching out to say that you sound like your doing your best to cope with the situation. You are a good mother and wife whether or not you eat. You have the right to nourish yourself.",
          "created_utc": 1590886614.0
        }
      ]
    }
  ]
}