{
  "id": "gu6plj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1590958197.0,
  "title": "Request: Who else gets triggerd by other people talking ablut their eating habits?",
  "selftext": "so i‘m at the beginning of coming to terms with me having an eating disorder/ distorted eating habits. \ni really try to reflect on my actions and my thought processes when i‘m starting to feel like the topic of weight/ eating/ self-hate is taking over my train of thoughts. \n\ntoday i realized i get triggered when somebody (sadly mostly women) talk about their eating - especially when they mention that they didn‘t eat alot or at all that day.\n\nso i was spending time with my boyfriend at his place when his flatmate came home from work.\nshe mentioned that she had a hard working day and then paused for a moment until she said kinda suprised that she didn‘t eat all day.\nshe is skinny and i feel really bad about my weight and looks when i‘m around her. \n\nshe talked about her not eating all day before and i have to admit i got jealous that she was able to not eat all day while i feel like i‘m binging all day.\ni also tried to talk to her about my strange eating or my worries about my eating habits and she answered: „if you‘re really unhappy with your weight you would just start working out more and just eat healthier.“\n\nThis hurt me a lot because i didn‘t feel like taken seriously and also felt like that - she as a skinny person with a figure that‘s in line with our society‘s body standard - doesn‘t really know how i feel with all my struggles.\nso when she mentions that she didn‘t eat i feel disgusted by myself that i ate.\n\n in my mind it goes like: oh, if you would just stop eating you would look better too. she looks great and didn‘t eat. you did it. you look so disgusting. you‘re weak. just stop eating and you‘ll feel better.\n\nmy boyfriend and her were expecting guests later (also friends of mine) and i said before that i‘d eat dinner with them. but after her comments i told my boyfriend that i needed some time alone and that i‘d eat at my place and would come over later. \nat home i had a binge eating episode and now i‘m crying and looking for some kind of comfort...\n\ni also feel like my boyfriends flatmate doesn‘t really think about the fact that her comments on her eating habits is affecting me. on the other side i don‘t think i really was able to tell her what‘s going on in my mind when i‘m struggeling with my eating habits/ my weight/ my look so i‘m not angry at her.\n\nanybody else having those difficulties?\nhow have you dealt with it?\nand what thought has helped you to cope with situations like these?\n\n\ntake care! and thanks for reading",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gu6plj/request_who_else_gets_triggerd_by_other_people/",
  "score": 183,
  "num_comments": 19,
  "comments": [
    {
      "id": "fsgyqlh",
      "author": "lostinvisions",
      "body": "Totally, everytime I read or hear like \"I haven't had breakfast/ eaten a thing all day\" my desire to do the same comes back and also jealousy towards those people who see it as a positive or quirky thing to do. For me is just an addiction to skip meals and hurt myself. Take care of yourself.",
      "created_utc": 1590967168.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fsgpkxd",
      "author": "LeylaBA",
      "body": "You need to ask yourself why validation from a skinny  stranger is important to you. If what she says triggers you, you have to ask your self why, and address what’s in your heart and mind - whether that’s through self care or therapy. People with Eating disorders have low self esteem. It sounds like that’s also what you are suffering from. There are tonnes of resources online on on low self esteem and how to overcome it. It’s not easy to admit that you have a problem, but if you want to feel comfortable what ever shape or size you are, you need to value yourself first. Because even if you reach your “ideal” body type, those feelings of shame won’t go away. You will still constantly compare yourself to others.",
      "created_utc": 1590962271.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fsgsc2t",
      "author": "HappilyGia",
      "body": "I feel that way too and I’m ashamed to say I feel some sort of competitiveness like “oh yeah? I was 77 pounds so...you’re fine honey.”  It’s twisted and I can’t believe I’m even sharing this :(",
      "created_utc": 1590963734.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fshw4vd",
      "author": "Lily_Le_Narwhal",
      "body": "I feel the same. But hypocritically do the same thing. I am not skinny I am underweight but not skinny. It’s just been really hard on me. Eating mostly in front of people. I have had these problems for 2 years. Since I was 11 and my goal is to be able to eat something and not worry. It is really hard when people talk about food. Or when my friends comment on how little I ate. I totally agree with you. But, you need to know that not everyone knows what this feels like or what is going on. I hope everything gets better.",
      "created_utc": 1590987147.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fsgmi4f",
      "author": "peanutbutterandjoe",
      "body": "100%! I’ve been recovering for a while now and honestly it still triggers me, I’ve just found and practiced coping mechanisms to deal with the triggers. It can be as small as my mom saying “I only ever eat one plate at dinner” and honestly pretty much includes anything about something being too sugary or too many calories, and the classic people seem to use “I haven’t eaten all day, I just eat one meal a day.”\n\nI know these things can be hard but it can help to recognize that these obsessions with talking about how much/what we eat is an unhealthy habit in other people too, and they just aren’t aware of it. Sometimes that helps to break it down into a positive that you recognize these harmful behaviors and can place the fault on other people, lessening your own reaction. If you need any other tips or just want to talk let me know! Good luck!",
      "created_utc": 1590960648.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fsiacu0",
      "author": "keysrose",
      "body": "I binge really bad especially if I’ve not eaten in a few days... today my (skinny as a stick) cousin who’s my age was talking about how I ate a whole box of macaroni (900 Cal) and I felt the worst urge to defend myself (I had been working in the yard all day with no food) I don’t know why but it just pissed me off and I had to go to my room for a minute to cool off",
      "created_utc": 1590999096.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsijugo",
      "author": "lifeismeaningless23",
      "body": "I totally understand this because I have gone through this. I’m the fattest in my friends group and colleagues. So every woman I know (of all sizes, including the skinny ones) are talking about their diet or exercise regime. It did trigger me a lot. \n\nWhenever I feel like this I think, \nEveryone is different, this other person is lucky enough to have good genes and a great metabolism and a lucky enough to not have my eating disorder. There are other things where I’m luckier (in my case it’s my career). So I should not compare her life and journey with myself because our lives and experiences are extremely different.\n\nAlso regarding her lack of empathy, \nMy husband is also one those tall skinny people. Also his family has this genetic disorder where they have trouble storing fat, it’s bad to the extent his whole family is either underweight or in the verge becoming underweight. Because of this reason obviously he was never judged for his eating which resulted in him developing a very healthy relationship with food. So he also often forgets to eat (because no one controlled his eating so consequently his brain doesn’t rebel and eat). In the beginning of our relationship even I thought he was indirectly mocking me when he said things like “I forgot to eat”, “I felt lazy to eat” or “I’m full for dessert”. But he never made my weight an issue so eventually I understood that he genuinely meant those things about forgetting to eat. This was one of the reasons that prompted me to realize that I have a eating disorder. So in case of your boyfriend’s flat mate, it’s highly likely she actually forgot to eat and for someone who never had to lose weight in life it may look like something that can be solved by just eating less and exercising (which is not true at all). \n\nSo don’t beat yourself comparing with other people. Focus on your journey. You have got this.",
      "created_utc": 1591008561.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fshf0hs",
      "author": "HatsuneHatsune1",
      "body": "THIS KEEPS FUCKING HAPPENING TO ME TOO.",
      "created_utc": 1590976411.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsghssb",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1590958197.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsh5d8d",
      "author": "UndeadMonkeySkull",
      "body": "I get triggered. I'm recovering from a 20 year bout of severe anorexia, and still get very jealous when I see someone I perceive as skinnier than me who says they havent eaten all day. In those moments I have to remind myself of how much progress I've made and that what I was doing was self harm, which is never a positive thing.\n\nMaybe one thing you can do is work out what triggers you, then look into why. Also maybe approaching a doctor to find out if your eating habits are actually damaging your health or if its all psychological. If it's not actually causing any physical issues then it's your mindset that needs to be changed (can be done via therapy), if there are concerns about physical health, then the diet would need to be addressed (can be done via a dietitian). \n\nEither way, please remember that eating disorders can be seen almost like an addiction, and recovery can be a slow process. Due to this, there is no need to feel guilty, apologise or explain yourself when you have slip ups, just take some time to recognise when they happen, events that lead up to the slip (so you can see if there's a pattern that can be avoided), and how you will get back on track in a healthy way.\n\nGood luck to you. We are always here to help if you need it.",
      "created_utc": 1590970878.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsivlsn",
      "author": "holland1999",
      "body": "i feel this. my boyfriend is naturally very skinny and doesn’t think about food the same way i do, some days he’ll just casually mention that he hasn’t eaten breakfast and it’ll make me upset.",
      "created_utc": 1591017848.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsmluph",
      "author": "julezthetallgirl",
      "body": "I totally do. In my head I'm always making up a competition... like, they haven't had breakfast? Ok, that means I can't have lunch and dinner/eat less than then for these meals so I will eat less than them all together. Or when I'm eating with someone else, I need them to eat more than I do or else I'll feel bad. Or might aswell binge. So many people just talk about them skipping meals or just forgetting to eat like it's funny and nothing special, when I can't think of anything else than food all day long. It sucks.",
      "created_utc": 1591099674.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbo9ucb",
      "author": "None",
      "body": "My mom and her friend were talking in front of me about losing weight and I'm not even recovered",
      "created_utc": 1604884321.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsgkffk",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1590959566.0,
      "score": -5,
      "context": []
    },
    {
      "id": "fsifyyx",
      "author": "Korean__Princess",
      "body": ">Because even if you reach your “ideal” body type, those feelings of shame won’t go away. You will still constantly compare yourself to others.\n\nPart reason I've been hardcore into studies about nutrition and such for a while.  \nNow I look at what I can do to optimize my health and performance, and my comparisons are my previous blood tests and how I feel! ✌🏻",
      "created_utc": 1591004696.0,
      "score": 1,
      "context": [
        {
          "id": "fsgpkxd",
          "author": "LeylaBA",
          "body": "You need to ask yourself why validation from a skinny  stranger is important to you. If what she says triggers you, you have to ask your self why, and address what’s in your heart and mind - whether that’s through self care or therapy. People with Eating disorders have low self esteem. It sounds like that’s also what you are suffering from. There are tonnes of resources online on on low self esteem and how to overcome it. It’s not easy to admit that you have a problem, but if you want to feel comfortable what ever shape or size you are, you need to value yourself first. Because even if you reach your “ideal” body type, those feelings of shame won’t go away. You will still constantly compare yourself to others.",
          "created_utc": 1590962271.0
        }
      ]
    },
    {
      "id": "fsgmqm9",
      "author": "peanutbutterandjoe",
      "body": "I also just remembered that I used to do this thing called ‘dinner time bingo’ with my family where I’d write in a journal the classic things I think people were going to say at dinner that we’re typically triggers. This helped me make a kind of game out of it and also analyze exactly why these things bothered me and why I think the other person might feel so inclined to say it, it can help unpack a lot.",
      "created_utc": 1590960770.0,
      "score": 8,
      "context": [
        {
          "id": "fsgmi4f",
          "author": "peanutbutterandjoe",
          "body": "100%! I’ve been recovering for a while now and honestly it still triggers me, I’ve just found and practiced coping mechanisms to deal with the triggers. It can be as small as my mom saying “I only ever eat one plate at dinner” and honestly pretty much includes anything about something being too sugary or too many calories, and the classic people seem to use “I haven’t eaten all day, I just eat one meal a day.”\n\nI know these things can be hard but it can help to recognize that these obsessions with talking about how much/what we eat is an unhealthy habit in other people too, and they just aren’t aware of it. Sometimes that helps to break it down into a positive that you recognize these harmful behaviors and can place the fault on other people, lessening your own reaction. If you need any other tips or just want to talk let me know! Good luck!",
          "created_utc": 1590960648.0
        }
      ]
    },
    {
      "id": "fsgq4rs",
      "author": "LeylaBA",
      "body": "The flat mate isn’t a therapist, dietician or counsellor. It isn’t her job to address OP’s body image issues or give her validation. She is clearly not equipped to give advice on weight management or mental health. What’s important is that OP gets the right type of support so that she isn’t triggered by other people’s eating habits (whether they are normal or disordered).",
      "created_utc": 1590962564.0,
      "score": 12,
      "context": [
        {
          "id": "fsgkffk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1590959566.0
        }
      ]
    },
    {
      "id": "fsii1e8",
      "author": "None",
      "body": "She's in her own home and is entitled to speak freely. Especially when all she's stating is that she hasn't eaten all day.\nEating disorders are tough, but that doesn't give us the right to call a woman dense for speaking about her day in her own home. \nOP should just try to gently avoid her, not tell her how to exist. The key for not getting triggered is to avoid the triggers.",
      "created_utc": 1591006786.0,
      "score": 3,
      "context": [
        {
          "id": "fsgkffk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1590959566.0
        }
      ]
    },
    {
      "id": "fsh9edr",
      "author": "moooooopg",
      "body": "I agree with this.  OP  I find that it helps to think \"they don't have an ED so it's different for them\" or something along those lines. Like my dad uses a certain dieting technique, and I like to think that he can use it because he does not have an ED and it does not rule his life. If he doesn't do the diet one day it's not the end of the world and he doesn't have any negative health consequences from his behaviours ..\n\nEdit: it sucks that we live in diet culturey world, but coping with it sometimes is the easiest way to just move on. We can't change the world (yet... at least) but we can change the way we think about the world",
      "created_utc": 1590973180.0,
      "score": 2,
      "context": [
        {
          "id": "fsgkffk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1590959566.0
        },
        {
          "id": "fsgq4rs",
          "author": "LeylaBA",
          "body": "The flat mate isn’t a therapist, dietician or counsellor. It isn’t her job to address OP’s body image issues or give her validation. She is clearly not equipped to give advice on weight management or mental health. What’s important is that OP gets the right type of support so that she isn’t triggered by other people’s eating habits (whether they are normal or disordered).",
          "created_utc": 1590962564.0
        }
      ]
    },
    {
      "id": "fsjex5u",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1591028600.0,
      "score": 2,
      "context": [
        {
          "id": "fsgkffk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1590959566.0
        },
        {
          "id": "fsii1e8",
          "author": "None",
          "body": "She's in her own home and is entitled to speak freely. Especially when all she's stating is that she hasn't eaten all day.\nEating disorders are tough, but that doesn't give us the right to call a woman dense for speaking about her day in her own home. \nOP should just try to gently avoid her, not tell her how to exist. The key for not getting triggered is to avoid the triggers.",
          "created_utc": 1591006786.0
        }
      ]
    },
    {
      "id": "fslfj3o",
      "author": "None",
      "body": "OP you've done nothing wrong! 😊 My comment may have come off badly, sorry about that. \nIf she's been your friend for ages that certainly changes things. I think you've got the right idea about sitting her down and having another gentle conversation, then. \n If she reacts badly to you explaining your situation I'd think very seriously about moving in with her.",
      "created_utc": 1591065911.0,
      "score": 2,
      "context": [
        {
          "id": "fsgkffk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1590959566.0
        },
        {
          "id": "fsii1e8",
          "author": "None",
          "body": "She's in her own home and is entitled to speak freely. Especially when all she's stating is that she hasn't eaten all day.\nEating disorders are tough, but that doesn't give us the right to call a woman dense for speaking about her day in her own home. \nOP should just try to gently avoid her, not tell her how to exist. The key for not getting triggered is to avoid the triggers.",
          "created_utc": 1591006786.0
        },
        {
          "id": "fsjex5u",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591028600.0
        }
      ]
    }
  ]
}