{
  "id": "gv4mbh",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591092538.0,
  "title": "Request: No interest in food, has anyone gone through that?",
  "selftext": "Hello all, maybe this isn't the \"perfect\" subreddit for this, but knowing my history with EDs and eating, I thought that this would be the appropriate place to ask.\n\nSo, I have been having problems with EDs since I was around 14 (now I'm almost 21) because my mother kept saying I had to lose X amount of weight before people could consider me pretty or date-able and other things not so nice.\n\nI have been battling with over eating and under eating, going from binging to starving to binging again, never really settling for normal eating habits, gaining and losing weight like a yo-yo even if I'm supposed to be an adult now and have found my \"adult weight\".\n\nThe problem is that I \"knew\" those phases: I knew that while starving myself I would keep on thinking about what food I would be allowed the following day, and I knew that when I was binging I would obsess over the food I could not eat while starving. Even if I was completely out of control, it felt like I had control over what I was eating. I was eating because I wanted, I wasn't eating because I didn't want, even if the reasons behind it were completely nonsensical and related to something I could not control. It was familiar, going from one phase to the other.\n\nHowever, as things are now, I just have no interest in food. I eat what mother cooks for dinner and even then it's difficult to chew and swallow, and I leave most of the meal in my plate. I recognize it doesn't taste bad, but I have absolutely no interest in it. Even things I would eat when I was on campus for college because I loved them, now don't seem appealing in the least.\n\nWhen I get hungry, I still go to the kitchen to look at what is in the fridge and pantry, but there's nothing that seems to be interesting enough for me to eat, so I go back to doing whatever I was doing before.\n\nHas this happened to anybody else? It's just so weird I don't know what to do with it.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gv4mbh/request_no_interest_in_food_has_anyone_gone/",
  "score": 49,
  "num_comments": 8,
  "comments": [
    {
      "id": "fsmizj2",
      "author": "AlexandraLouise119",
      "body": "Yes, this happened to me. For a while I lost interest in food - no obsessing over what I would eat next, food wasn’t hitting the spot in my brain that makes me feel good. I was suddenly eating for sustenance and stopping when I was satiated, and just didn’t feel as hungry.\n\nI spoke to my therapist and actually wondered if this is how people without eating disorders feel all the time, that food is tasty but not obsessing over it, no compulsion to binge and being able to stop eating when they want. \n\nI went back to normal (my normal) after a few weeks, I think it was probably just a chemical thing in my brain that shifted. I miss it sometimes but not always.",
      "created_utc": 1591097334.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fsmqy55",
      "author": "lettheworldknow",
      "body": "SAME! The exact same thing is going on with me. Maybe because I’m grieving a death, but food just doesn’t taste like how I remember it and I can’t be bothered to eat anymore. The weird thing is, even though the idea of eating makes me sick, I’ve still binged/purged unnecessarily.",
      "created_utc": 1591103248.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsn95sz",
      "author": "24hrbakery",
      "body": "This is how my ED is almost always. I rarely find food appetizing no matter what it is. It feels like a chore to eat. Smoothies have helped me a lot because sucking something with protein (I use honey peanut butter) down through a straw is a lot easier imo",
      "created_utc": 1591112967.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsnq8c0",
      "author": "oliviared52",
      "body": "Yes I’m definitely like this. Once I stopped obsessing over food and thinking about it all the time, it almost never crossed my mind. I try to not force myself to eat unless I start dropping weight because forcing myself to finish meals brings me back to my old binge purge or restrict thoughts. I will give you the advice my doctor gave me when this happened below!\n\nI’m guessing with quarantine you’re not moving around as much. This could be a huge reason. During recovery I got into lifting and would eat a lot because I was hungry. When my work schedule got crazy and I didn’t have time to lift, my appetite totally fell off. But I tried not to freak because I knew my body needed less. If you’re cooped up in the house all day you won’t be as hungry because your body won’t need as much vs when you’re out and about. \n\nI would say to listen to your body. As long as you know it’s your body telling you youre not as hungry and not your brain. The advice my doctor gave when I started losing weight from not eating enough was to try and sneak in more protein, like add some protein to a morning smoothie. And to shoot for at least 2 meals per day. I have found that eating breakfast regulates my eating better. \n\nSo my advice would be to try and eat something for breakfast, try to sneak in more protein, and to try and get at least two meals per day. If you’re full you don’t need to force yourself to finish it. In my personal experience, forcing myself to finish meals would lead me back into my binging and restricting mind set.",
      "created_utc": 1591121104.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsndkqz",
      "author": "LocalMercy",
      "body": "It sucks but you just have to eat anyway. I'm recovered(ish) but still struggle sometimes with just not wanting to eat anything. For me what worked is starting with either something small, and once you have that small thing you realize how hungry you are, or have something rather packed. I recommend single serve peanut butter cups and then some crackers or something (personally a sucker for Cheez-Its). If you have any more questions or need clarification just ask!!",
      "created_utc": 1591115102.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsnzadd",
      "author": "None",
      "body": "Yeah..idk it's wierd but I used to over eat so much but I have a fast metabolism so it didn't really make me gain weight. I did that for like a year and then this year I never feel like eating. I don't even feel hungry at all. I could go a week without eating any big meals and I'm fine",
      "created_utc": 1591125348.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fso0vqw",
      "author": "AurelieOrifiel",
      "body": "I have a history of anorexia and bulimia, but consider myself recovered, have maintained a healthy weight, and haven’t had disordered thoughts about food for approximately 4 years. \n\nThe same thing has been happening to me the last couple of weeks. No interest in food and rarely hungry. When I do feel hungry, I’ll make something that looks delicious, but start to feel full and uncomfortable after a couple of bites and lose interest in eating. I’m not sure why. \n\nEdit: Just to mention this is a stark contrast to when I was eating disordered. At that time I would fixate on food and what I would be able to eat. I was fascinated and terrified by it. \n\nI’ve been stuck out of my country of residence for the last couple of months due to coronavirus border closures. Maybe it has to do with stress or generally being bored without my routine or friends. I try to be happy during the days, but I think it has to do with underlying unhappiness. \n\nI hope you find interest in food again quickly! Perhaps try changing up your routine, exercise has been helping me keep up my mood because I know it’s easy for myself to fall into depression. We’re going through a stressful time now and while you might not realize you’re stressed, there’s a good chance you might be more burdened than you think.",
      "created_utc": 1591126102.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsmdtdz",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591092538.0,
      "score": 1,
      "context": []
    }
  ]
}