{
  "id": "gvi3b1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591139134.0,
  "title": "Request: I think my binge eating is turning into restrictive eating",
  "selftext": "So ever since i turned 13 i have suffered from binge eating. This is the first time in months that i have been able to control myself around food and i am honestly so proud of myself. I managed to lose some weight and finally get the body i used to have. The only problem is that i think i might be starving myself now. I never really noticed until my sister pointed out that i only eat one meal a day or have completely stopped eating food that i love. I am so terrified to eat more because im afraid i will start binging out of nowhere again or that i will gain back all the weight. For me it feels like i am eating a lot, but i know im not and i dont know how to get rid of this mindset. I just want to be healthy without having to worry about or being afraid of food all the time, someone please give me advice.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gvi3b1/request_i_think_my_binge_eating_is_turning_into/",
  "score": 52,
  "num_comments": 4,
  "comments": [
    {
      "id": "fspcqzq",
      "author": "jellyfishraspberry",
      "body": "Hey, you definitely aren’t alone here. I went through something similar but flipped, restrictive at first, and then full blown binge. Having a disordered relationship with food can do that; even when your circumstances or your body changes, your mind still doesn’t know how to deal with food in a healthy, sustainable way. With an ED that goes both ways like this, it’s like your brain doesn’t know how to stay in the middle of the road, and instead you find yourself on the shoulder, and you try to fix it, but you can easily over-correct and swerve hard into the shoulder on the other side. I would definitely reach out for help, and talk through this with an ED-specialized therapist if you have access to one and have the means to get therapy. If you don’t have the means, there are resources online for more afforadable therapy options, or you can also look on NEDA, they have a bunch of resources and info that can help you process and work towards healing. Therapy (years of talk therapy with ED specialized therapist, some Yoga therapy, and some work with an ED-specializing nutritional therapist) is what got me through to recovery-ish (ED doesn’t just disappear, it’s something we deal with for life, but there is a healthy middle ground, don’t fear) after years of struggling and being miserable, so show yourself the love you deserve and get the help you need. I promise you won’t regret it. Cheering for you and sending you love and strength. You can do this.",
      "created_utc": 1591150890.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fsp58km",
      "author": "tssclay",
      "body": "same thing happened to me but i started by forcing myself to not eat. please try to eat atleast 1800 calories a day if you’re at a healthy weight and active that will keep you at a stable weight or might help you lose some but please try eating normal again before it evolves into something worse.",
      "created_utc": 1591146606.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fspizxl",
      "author": "strawnanaberry33",
      "body": "hi !! first off, i wanna say congratulations on feeling that you’ve overcome your binge eating disorder !! growth is growth, and no matter what that should be celebrated. that’s proof that you are stronger than these diseases. but sadly, as i have experienced, there are many other bumps on the road of recovery. i have over-eaten and undereaten at different times in my past. and while that is 200% not healthy and not condonable, i don’t want you to feel like a failure or a fool or anything like that. recovery is not linear.\n\nthe biggest thing i have discovered is this: eating should not be stressful. hearing that you eat one meal a day, but feel you are eating lot, can be a little concerning. with eating disorders, our self-perceptions become skewed and it’s hard to know if we’re being healthy. so to ensure you’re healthy, these are my top 2 recommendations:\n\n1) follow what the dietitians say and make sure you’re eating balanced foods (that means fruit& veggies AND protein AND fats) with enough calories (you don’t have to be super strict on your tracking bc i know that can be stressful. even a ballpark is good, bc if you’re one meal isn’t falling into that category then it can definitely be concerning). I’m a nutrition major, and while I don’t track my calories daily because it stresses me out, I sometimes do when I start to feel I’m over/undereating. I use this calculator (https://www.leighpeele.com/mifflin-st-jeor-calculator) as the mifflin st jeor calorie equation has proven to be the most accurate for health\n\n2) if food/eating is stressful, talk to a professional about it! seriously, these are diseases and have special doctors. you would never try to treat corona virus by yourself. i really recommend going through your school for helpful mental health resources. but if you’re not comfortable with that, then there are a lot of places online and through insurance ! there are support groups and therapists and specialists galore — all here to help you if you want to seek it\n\nyou deserve to have a body you feel confident in, no matter what it looks like. and you shouldn’t have to question your health constantly. i hope this helps 💗",
      "created_utc": 1591154545.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fsorv2z",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591139134.0,
      "score": 1,
      "context": []
    }
  ]
}