{
  "id": "gvr03n",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591177793.0,
  "title": "Request: I recently relapsed and boyfriend’s family is having me over for dinner tomorrow",
  "selftext": "i’ve struggled with anorexia for years and i was doing better for a while but recently relapsed. my boyfriend is aware of everything going on and has been incredibly supportive. his family invited me for dinner tomorrow for the first time and i’m very anxious about it.  my mind has been plagued with all of these concerns since they invited me. “what if i get too anxious about eating and i don’t talk enough and they think i’m stuck up ?” “what if they get offended when i don’t eat a lot of their food ?” the countless what-ifs are killing me. i want to be able to get through this one night as smooth as possible and i don’t know how. does anyone have any advice on how to get through this ?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gvr03n/request_i_recently_relapsed_and_boyfriends_family/",
  "score": 73,
  "num_comments": 14,
  "comments": [
    {
      "id": "fsqmz29",
      "author": "nastrals",
      "body": "I would suggest asking your BF to talk to his family.  If that’s something you feel comfortable with. An ED is nothing to be ashamed of. Perhaps ask your BF to find out what will be served so you are prepared and not surprised by what’s served and then you can plan a way to manage your worries in advance if giving them a heads up isnt something you feel comfortable with. My BF is great with mine and when we are in social situations involving food and knows how to help me and can spot when I’m getting stressed out.",
      "created_utc": 1591186732.0,
      "score": 24,
      "context": []
    },
    {
      "id": "fsqh149",
      "author": "youungratefultwat",
      "body": "I think you should allow yourself to eat like you want to! Not like your ED wants. I know it’s a hard thing to do but have fun! Don’t let that stupid fucking ED stop you. I had so many evenings ruined by my eating disorder but the key is to say to yourself that it’s okay to have a copious meal once in a while, your body needs it. So just go on and have fun, try not to think about the calories too much and stop when you’re feeling full. Hope you have a great time :))",
      "created_utc": 1591181939.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fsqlnsw",
      "author": "Margkam",
      "body": "I’ve been in the same situation and always just try to eat as much as I can and if they say anything, say that you ate a big snack earlier and are still quite full from that, but it’s delicious. As for getting quiet, I know that struggle too. All you can try to do is remain distracted from the task at hand. I know it’s such an anxiety provoking situation, I wish you luck with it!",
      "created_utc": 1591185749.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fsqxakm",
      "author": "marinavtaylor",
      "body": "Have you talked to him about your anxiety regarding this dinner? I would let him know all your concerns/thoughts/hesitations with it and that might give you a clear mind going into it. He knows his parents and if they’re good people they’ll be understanding and empathetic (most people actually are). I think for their sake he should 100% mention that you’re recovering from an ED, so they don’t think they’re feeding into a destructive, harmful pattern but understand if maybe don’t finish everything on your plate.\n\nThis all of course depends on how comfortable YOU feel about it, if it’s too much pressure, too soon consider alternatives like watching a movie together after dinner or something. I do think it could be a very healthy step though to confront your anxiety as long as it’s in a welcoming, friendly setting.",
      "created_utc": 1591192942.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsqdko3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1591178780.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fsra8q1",
      "author": "ball-of-fury-NY",
      "body": "If u have ur own place, perhaps have ur bfs parents over instead. That way ur in an environment thats more comfortable for u and u can cook dinner. U can still feel comfortable with how big ur portions are without feeling like ur offending his parents. \nIf this is not possible definitely talk to ur bf and tell him ur concerns, if he is as understanding and supportive he will be able to come up with solutions with u and a game plan to make u feel more comfortable. It always helps to have someone in ur corner during uncomfortable situations.",
      "created_utc": 1591199327.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsrf2sb",
      "author": "houston_veronica",
      "body": "I totally get this, OP. If you are in a relapse, remember not to be down on yourself, first of all. It's not linear (recovery) and these \"hills\" are what make recovery so valuable in the end. You will overcome this.\n\nCan you reframe it as a challenge to your ED? As maybe a chance to show yourself that nothing - not one bad thing - will happen if you eat the meal?  It's one meal, so thankfully you aren't asked to live there and join them at every meal! :-)  \n\nImagine how proud you could be of yourself once this is over; you would have this experience to show that you defied that stupid, hideous voice that tries to talk you out of life.  \n\nWhatever happens: Your SO will still love you, your SO's parents WILL understand. I truly have the feeling they will. If you are kind, that is what matters. If they judge you for your eating, then that says a lot about them, and I seriously doubt they will do that. <3",
      "created_utc": 1591201615.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fssw3s9",
      "author": "canyonlands2",
      "body": "I agree with the comment about asking your bf to ask about the menu so you can feel prepared. I would definitely ask him to tell his parents that you’re struggling (don’t have to say “hey she’s anorexic so she’s not gonna want to eat”) right now and feeling overwhelmed so don’t be offended if you are quiet and not devouring food,\n\nI’ve never had ED conversation with my bf because it makes me super anxious and I’ve been lucky to have been in recovery since we met. Eating in front of his family is exceedingly stressful. I get so scared and stressed over comments that may come because I eat little food that must = lower body weight. I just don’t want to hear comments on my body, but I’ve found that parent-age people are more likely to do so. I’m glad your bf will be there to be your ally and that you’ve already made progress just by reaching out to talk about how you feel to this community.",
      "created_utc": 1591226680.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsqcj1x",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591177793.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsqqpgm",
      "author": "updown27",
      "body": "I personally would not attend if I felt like my options were staying meal plan compliant at home or putting myself in an anxiety inducing situation that will likely cause restriction. It all depends on whether or not you feel comfortable enough in your recovery to handle this situation. If you aren’t it could trigger additional restriction over the coming days as you wrestle with guilt and shame related to the event. At some point you are going to have to practice public eating but this may not be the time. You could be open with your struggle or not but it might be better if you can suggest a time to spend with his family that doesn’t involve food. Maybe afternoon or after dinner walk at the park or games?",
      "created_utc": 1591189214.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsqy438",
      "author": "None",
      "body": "im not trying to encourage your ED, but maybe it will be easier to get through it if you didnt eat anything else before the dinner? You will be satisfied and get a nutritious meal out of it. Maybe eating more nutritious meals can even help you with an ED, at least it’s kinda helping me with mine a little",
      "created_utc": 1591193373.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fsrkeu9",
      "author": "bingumarmar",
      "body": "Have your boyfriend tell his family you're not feeling well stomach wise. That's what I've done in the past :)",
      "created_utc": 1591204120.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fsqpiph",
      "author": "None",
      "body": "I really hope you're not encouraging her to keep dropping weight. I liked everything else in your post except this sentence: \" And if you’re in a plateau it can actually help you drop weight afterwards.\" She said she was in a relapse. That doesn't seem productive.",
      "created_utc": 1591188471.0,
      "score": 13,
      "context": [
        {
          "id": "fsqh149",
          "author": "youungratefultwat",
          "body": "I think you should allow yourself to eat like you want to! Not like your ED wants. I know it’s a hard thing to do but have fun! Don’t let that stupid fucking ED stop you. I had so many evenings ruined by my eating disorder but the key is to say to yourself that it’s okay to have a copious meal once in a while, your body needs it. So just go on and have fun, try not to think about the calories too much and stop when you’re feeling full. Hope you have a great time :))",
          "created_utc": 1591181939.0
        }
      ]
    },
    {
      "id": "fsqlep6",
      "author": "hannu30",
      "body": "Would be my same advice,but depends on your situation off course. If he is supportive, perhaps his parents will be too, discuss it with your BF, seems step 1.",
      "created_utc": 1591185559.0,
      "score": 7,
      "context": [
        {
          "id": "fsqdko3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591178780.0
        }
      ]
    },
    {
      "id": "fsqqxfo",
      "author": "youungratefultwat",
      "body": "Yeah no I’m not it was not my intention sorry. You’re right it’s not very productive. I’m gonna delete this sentence I’m bad at this.",
      "created_utc": 1591189356.0,
      "score": 13,
      "context": [
        {
          "id": "fsqh149",
          "author": "youungratefultwat",
          "body": "I think you should allow yourself to eat like you want to! Not like your ED wants. I know it’s a hard thing to do but have fun! Don’t let that stupid fucking ED stop you. I had so many evenings ruined by my eating disorder but the key is to say to yourself that it’s okay to have a copious meal once in a while, your body needs it. So just go on and have fun, try not to think about the calories too much and stop when you’re feeling full. Hope you have a great time :))",
          "created_utc": 1591181939.0
        },
        {
          "id": "fsqpiph",
          "author": "None",
          "body": "I really hope you're not encouraging her to keep dropping weight. I liked everything else in your post except this sentence: \" And if you’re in a plateau it can actually help you drop weight afterwards.\" She said she was in a relapse. That doesn't seem productive.",
          "created_utc": 1591188471.0
        }
      ]
    }
  ]
}