{
  "id": "gw4y5z",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591225443.0,
  "title": "Request: Sad bf",
  "selftext": "Hi! I’m very new to this sort of thing. I have a girlfriend for almost 6 months, we r juniors in hs. We r super close and she is the love of my life. A few days ago she told me she has an eating disorder and that she has been going to treatment and that she is doing better. It’s very hard to talk about and it is crushing me inside. Everytime I think about it I get so sad. Does anyone have advice for how to help, what to not do, ways to be strong for her?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gw4y5z/request_sad_bf/",
  "score": 65,
  "num_comments": 18,
  "comments": [
    {
      "id": "fssuq9q",
      "author": "None",
      "body": "It’s sweet of you to ask and try to be there for her, good on you for being such a kind boyfriend. :) \n\nI would say try to not call her out on behaviors that seem unusual, but show her you care by asking/focusing on how she feels rather than the actions itself. \n\nFor example, if she doesn’t want to eat something don’t bring it up or make her feel embarrassed or called out for it.",
      "created_utc": 1591225960.0,
      "score": 37,
      "context": []
    },
    {
      "id": "fst1lf8",
      "author": "oliviared52",
      "body": "Just being there for her really helps. I had an ex when I was really really bad and when he would witness my super messed up patterns he would say “I don’t condone what you’re doing but you will not go through it alone” and that would surprisingly help. It was a way to call me out on my bad behaviors but in a really supportive way. \nSometimes when I was deep in the ED I didn’t even realize some of my actions were weird. But if I was lectured to about it I just would have shut down. He didn’t try to change me, but calling me out while supporting me did wonders for my road to recovery.\n\nAnd if she ever wants to talk, listen. Tell her shes beautiful whenever you think it but also know eating disorders go so much deeper than looks. \n\nVery sweet of you to come on here asking for advice. If you need any more on the topic let me know! And at the end of the day know that a good support system helps a lot but not totally. If she slips again please do not take it personally. It is not because of you she developed this. All you can do now is support her the best you can.",
      "created_utc": 1591229572.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fstgh34",
      "author": "kourtroom",
      "body": "I’ll second what everyone else is saying- you even thinking to reach out to others and try to be helpful however you can is a wonderful thing & a great place to start. I’ve had different EDs off and on for 7 years, so I’ll try and cover what would & would not have helped me in her position. I can’t speak for her & what her motivations are of course, but I’ll do what I can. \n\nIn no order:\n\n1. Obviously, do not critique her body in any way, but *understand* that when you give positive encouragement such as calling her beautiful, it may not resonate with her. For me, the disorder convinced me the only way I would be pretty is if I did XY&Z. Don’t stop saying these encouragements, but try not to be angered if she disagrees. \n\n2.  Be mindful when eating out or in front of others with her. At my worst, I ate barely 100 calories a day, meaning essentially no meal out or get together involved any eating for me. This caused huge arguments with my family when I refused to go out to eat or to gatherings where I’d be expected to eat. Try to understand if she doesn’t want to go somewhere for this reason, & what’s more, if it does come up, defend her if someone brings it up. “Hey (gfs name) why aren’t you eating the chicken? It’s great!” Rather than put her in this position, perhaps step in before she responds & cover about her having eaten earlier or having an upset stomach or something. I know I would have appreciated the cover. \n\n3. Understand that when it comes down to it, change for the better regarding her disorder will ultimately only come from her and her own decisions. Obviously your support will also do wonders, but (for me anyway) I had to make a very hard & very conscious decision to choose to get better, & to want to get better. It sounds as though she may have done this if she’s getting treatment, but recognize it is a constant personal internal battle. \n\nOn that note, \n\n4. Recognize that it will not ever fully go away. From my experience, EDs are a forever thing. That is, the thinking associated with them & the obsessive thoughts never *fully* go away. Yes, they can get worlds upon worlds better, but relapses are common and the internal battle is nearly daily. It can be draining. Some days are better than others. In my case, I had anorexia first, then ended up with binge eating disorder, then back again. It can take a lot out of am SO to go through all of this, should it occur, so be prepared for the mental strain on yourself as well. For the record, I’m not trying to sound depressing, I just want you to be aware that no matter what you do or how hard you try, you can’t take out the part of her brain causing all of this. \n\n5. Use tact when addressing disordered behaviors. This can go a few different ways depending on the person. For me, my parents tended to call out any disordered behaviors I had, and it got old. They were only trying to help, but being yelled at every time we went out for barely eating really hurt. I know you wouldn’t yell at her, that’s just an example. Point being, be very careful about any addressing you do of her disordered behaviors. If possible, let HER do the bringing up of the discussion. She’ll talk when she’s ready. Most likely, part of her knows her behaviors are disordered, and most likely, the disorder prevents her from changing them. \n\nThat’s all I can think of for now, if I think of more I’ll edit them in. Feel free to message me with specific questions or just reply to this. Best of luck to you & her.\n\nSide note- depending on how clearly she has the disorder, school/social activities may be hard for her. At your age, kids can be really cruel. As her bf, do what you can to watch for any bullying she may go through, but don’t cause too much of a public scene when calling anyone out. The last thing I would want is an entire classroom hearing my bf yelling about my ED.",
      "created_utc": 1591237884.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fstfqcv",
      "author": "peafowlenthusiast",
      "body": "I was in the same boat in HS, but on the other end. I have to say that my BF has been the best support I’ve ever had (both 23 now, been dating since junior year). The most important thing is to just be there. Be present. Be patient. Try not to put too much pressure on yourself to say or do “the right thing” in the moment or offer solutions. She may not always want to talk about what is on her mind, but when she does, make sure to open your heart and ears to listen. Know that she’s there for you too. The NEDA website has great info on how to support loved ones dealing with ED. You don’t have to implement all of these things, just try to take in the gist of it. It sounds like you really do love her, and while I’m so happy for both of you, I’m sorry that you both have to carry this on your shoulders. It’s a lot but you’re doing great and you have a wonderful attitude about it. All the best to both of you 💗",
      "created_utc": 1591237462.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsu3k0l",
      "author": "elvischair",
      "body": "when you compliment her, try not to focus on physical appearance (you’re so beautiful, you look great, i love your eyes, etc). these are great things but it’s helpful not to place value and worth on physical appearance. and PLEASE do not comment on weight AT ALL. even “compliments” like you’re so skinny, your body looks great, you look healthy can be taken in such a twisted way when you have an ED. try focusing on the things you love most about her, like: you’re so thoughtful to do this for me, i really love your passion for _____, i admire your bravery, or you’re so talented at art/sports/academics/etc. \n\ndon’t try to be a therapist for her, that’s not your job, remember to take care of yourself or the relationship will not be sustainable. of course listening and support is important but set healthy boundaries and adhere to them.\n\neducate yourself!! you are already taking steps towards this and are clearly on the right track! know the signs and symptoms of eating disorders and do research to learn more and better understand. Kati Morton is an incredible youtuber with many educational videos on eating disorders i encourage you to watch. some( not conclusive list!!) signs and symptoms/ eating disorder behaviors include:\nnot eating/eating very little\nskipping meals\npicking at food\ncutting food into small pieces\nspitting food into napkin\nchewing and spitting\ngoing to the bathroom/taking showers directly after eating\nrussell’s sign (callous on knuckles caused by inducing vomiting)\nlaxative abuse\nexcessive exercise \nexercise at odd times of the day (common one is doing sit ups in the middle of the night, or walking laps during lunch\nhiding  food\nlarge amounts of food going missing\nbody checking (looking at body in the mirror/ feeling parts of your body(such as putting fingers around wrist, feeling collarbones))\nfatigue \nREMEMBER: WEIGHT IS NOT AN INDICATION OF THE SEVERITY OF AN EATING DISORDER\n\nit seems like you are both still young as juniors in high school (please be careful abt putting your age online!!💙) if you think it is necessary PLEASE tell a TRUSTED adult about the situation. because she is in treatment, it sounds to me like her family is aware so if you notice eating disorder behaviors increasing, telling her parents could really help her out, but please be careful with this and make sure the family is involved in her treatment, if they are abusive it can make situations worse.\n\nmost importantly, be present. listen. as i said you aren’t her therapist but be her friend. let her know she has a support system that loves and cares about her. you are doing an incredible job by taking these steps and asking questions. praying for your girlfriend and for your relationship. i hope for the best for both of you.",
      "created_utc": 1591253695.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fsstqi2",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591225443.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsuiwd1",
      "author": "marthacaitlin",
      "body": "I find it really hard when people find out and they say ‘well I won’t buy you food then’ or ‘we just won’t eat then’ so try and stay being kind and sensitive. If she’s having difficulty eating a particular food maybe go for a healthier option something that she might feel less guilty eating. It’s wonderful to see someone care so much.",
      "created_utc": 1591267836.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fsvx3w5",
      "author": "houston_veronica",
      "body": "aww, you are so sweet - hang in there, sweet guy. She will be in GREAT hands and is going to get better. All I can say is be sure to share your own feelings with people who care about you -- so that you're not stressing about her on your own/by yourself.\n\nLots of good advice is already provided, I just wanted to say that you are an awesome young man.  And, she is very, very brave.",
      "created_utc": 1591295093.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fstoeo3",
      "author": "angieestfanee",
      "body": "i like this response! in addition to not making it a big deal if she doesn't wanna eat a particular thing, maybe u can ask if she wants something different instead? an easier food or a favorite beverage, perhaps? but still make it clear that it's alright if she doesn't want anything<3 if she's feeling bad maybe she'd rather have a distracting activity like a movie or cuddling?",
      "created_utc": 1591242642.0,
      "score": 11,
      "context": [
        {
          "id": "fssuq9q",
          "author": "None",
          "body": "It’s sweet of you to ask and try to be there for her, good on you for being such a kind boyfriend. :) \n\nI would say try to not call her out on behaviors that seem unusual, but show her you care by asking/focusing on how she feels rather than the actions itself. \n\nFor example, if she doesn’t want to eat something don’t bring it up or make her feel embarrassed or called out for it.",
          "created_utc": 1591225960.0
        }
      ]
    },
    {
      "id": "fsumbrt",
      "author": "MissRiss918",
      "body": "I love that he said, “I don’t condone what you are doing but you will not go through it alone.” That seems so powerful, and if my partner said that to me, I would feel very supported! \n\nPersonally, what has helped for me, is seeing my partner eat in normal patterns. It is a silent nudge, if you will. When he is not around, I tend to just listen to my own body, which has been unreliable! \n\nHe also will gently encourage me, by asking “what’s for breakfast/lunch/dinner” which reminds me it is time to eat. If I am not feeling up to it, he doesn’t press the subject. He also is very good at talking with me about my feelings. \n\nWhen we first started dating (8yrs ago), he wanted to fix the problem for me. This caused a great deal of frustration for both of us. He realized that he was unable to solve the issue, leaving him to feel defeated. When he realized he needed to hold my hand as we walked through it together, so much changed for us!\n\nI can imagine that it is challenging to love/support someone with an eating disorder and (often times) other mental health diagnoses. Great job coming here and asking for advice! That shows your compassion and speaks volumes to who you are! \n\nI know, from my boyfriend’s perspective, doing research about eating disorders was also very helpful. Good luck, OP, and feel free to come back and ask for support anytime!",
      "created_utc": 1591270698.0,
      "score": 2,
      "context": [
        {
          "id": "fst1lf8",
          "author": "oliviared52",
          "body": "Just being there for her really helps. I had an ex when I was really really bad and when he would witness my super messed up patterns he would say “I don’t condone what you’re doing but you will not go through it alone” and that would surprisingly help. It was a way to call me out on my bad behaviors but in a really supportive way. \nSometimes when I was deep in the ED I didn’t even realize some of my actions were weird. But if I was lectured to about it I just would have shut down. He didn’t try to change me, but calling me out while supporting me did wonders for my road to recovery.\n\nAnd if she ever wants to talk, listen. Tell her shes beautiful whenever you think it but also know eating disorders go so much deeper than looks. \n\nVery sweet of you to come on here asking for advice. If you need any more on the topic let me know! And at the end of the day know that a good support system helps a lot but not totally. If she slips again please do not take it personally. It is not because of you she developed this. All you can do now is support her the best you can.",
          "created_utc": 1591229572.0
        }
      ]
    },
    {
      "id": "fswppat",
      "author": "plasticcap1",
      "body": "Just to add, I think compliments about physical appearance can be helpful for some people. My girlfriend has an eating disorder is also insecure about body image, and actually really appreciates compliments about her appearance (but not about weight, like you said). Sometimes for people it can reenforce that they do actually have positive physical features and reminds them that some people do appreciate the way they look. Just a thought, of course everyone isn’t the same.",
      "created_utc": 1591308486.0,
      "score": 2,
      "context": [
        {
          "id": "fsu3k0l",
          "author": "elvischair",
          "body": "when you compliment her, try not to focus on physical appearance (you’re so beautiful, you look great, i love your eyes, etc). these are great things but it’s helpful not to place value and worth on physical appearance. and PLEASE do not comment on weight AT ALL. even “compliments” like you’re so skinny, your body looks great, you look healthy can be taken in such a twisted way when you have an ED. try focusing on the things you love most about her, like: you’re so thoughtful to do this for me, i really love your passion for _____, i admire your bravery, or you’re so talented at art/sports/academics/etc. \n\ndon’t try to be a therapist for her, that’s not your job, remember to take care of yourself or the relationship will not be sustainable. of course listening and support is important but set healthy boundaries and adhere to them.\n\neducate yourself!! you are already taking steps towards this and are clearly on the right track! know the signs and symptoms of eating disorders and do research to learn more and better understand. Kati Morton is an incredible youtuber with many educational videos on eating disorders i encourage you to watch. some( not conclusive list!!) signs and symptoms/ eating disorder behaviors include:\nnot eating/eating very little\nskipping meals\npicking at food\ncutting food into small pieces\nspitting food into napkin\nchewing and spitting\ngoing to the bathroom/taking showers directly after eating\nrussell’s sign (callous on knuckles caused by inducing vomiting)\nlaxative abuse\nexcessive exercise \nexercise at odd times of the day (common one is doing sit ups in the middle of the night, or walking laps during lunch\nhiding  food\nlarge amounts of food going missing\nbody checking (looking at body in the mirror/ feeling parts of your body(such as putting fingers around wrist, feeling collarbones))\nfatigue \nREMEMBER: WEIGHT IS NOT AN INDICATION OF THE SEVERITY OF AN EATING DISORDER\n\nit seems like you are both still young as juniors in high school (please be careful abt putting your age online!!💙) if you think it is necessary PLEASE tell a TRUSTED adult about the situation. because she is in treatment, it sounds to me like her family is aware so if you notice eating disorder behaviors increasing, telling her parents could really help her out, but please be careful with this and make sure the family is involved in her treatment, if they are abusive it can make situations worse.\n\nmost importantly, be present. listen. as i said you aren’t her therapist but be her friend. let her know she has a support system that loves and cares about her. you are doing an incredible job by taking these steps and asking questions. praying for your girlfriend and for your relationship. i hope for the best for both of you.",
          "created_utc": 1591253695.0
        }
      ]
    },
    {
      "id": "fsu40yz",
      "author": "elvischair",
      "body": "the list of eating disorder signs and symptoms was formatted weirdly so i’m gonna put it here to make it easier to read:\n-not eating/eating very little,\n-skipping meals,\n-picking at food,\n-cutting food into small pieces,\n-spitting food into napkin,\n-chewing and spitting,\n-going to the bathroom/taking showers directly after eating,\n-russell’s sign (callous on knuckles caused by inducing vomiting),\n-laxative abuse,\n-excessive exercise,\n-exercise at odd times of the day (common one is doing sit ups in the middle of the night, or walking laps during lunch,\n-weighing themselves obsessively,\n-hiding  food,\n-large amounts of food going missing,\n-body checking (looking at body in the mirror/ feeling parts of your body(such as putting fingers around wrist, feeling collarbones)),\n-fatigue,\n-REMEMBER: WEIGHT IS NOT AN INDICATION OF THE SEVERITY OF AN EATING DISORDER",
      "created_utc": 1591254102.0,
      "score": 1,
      "context": [
        {
          "id": "fsu3k0l",
          "author": "elvischair",
          "body": "when you compliment her, try not to focus on physical appearance (you’re so beautiful, you look great, i love your eyes, etc). these are great things but it’s helpful not to place value and worth on physical appearance. and PLEASE do not comment on weight AT ALL. even “compliments” like you’re so skinny, your body looks great, you look healthy can be taken in such a twisted way when you have an ED. try focusing on the things you love most about her, like: you’re so thoughtful to do this for me, i really love your passion for _____, i admire your bravery, or you’re so talented at art/sports/academics/etc. \n\ndon’t try to be a therapist for her, that’s not your job, remember to take care of yourself or the relationship will not be sustainable. of course listening and support is important but set healthy boundaries and adhere to them.\n\neducate yourself!! you are already taking steps towards this and are clearly on the right track! know the signs and symptoms of eating disorders and do research to learn more and better understand. Kati Morton is an incredible youtuber with many educational videos on eating disorders i encourage you to watch. some( not conclusive list!!) signs and symptoms/ eating disorder behaviors include:\nnot eating/eating very little\nskipping meals\npicking at food\ncutting food into small pieces\nspitting food into napkin\nchewing and spitting\ngoing to the bathroom/taking showers directly after eating\nrussell’s sign (callous on knuckles caused by inducing vomiting)\nlaxative abuse\nexcessive exercise \nexercise at odd times of the day (common one is doing sit ups in the middle of the night, or walking laps during lunch\nhiding  food\nlarge amounts of food going missing\nbody checking (looking at body in the mirror/ feeling parts of your body(such as putting fingers around wrist, feeling collarbones))\nfatigue \nREMEMBER: WEIGHT IS NOT AN INDICATION OF THE SEVERITY OF AN EATING DISORDER\n\nit seems like you are both still young as juniors in high school (please be careful abt putting your age online!!💙) if you think it is necessary PLEASE tell a TRUSTED adult about the situation. because she is in treatment, it sounds to me like her family is aware so if you notice eating disorder behaviors increasing, telling her parents could really help her out, but please be careful with this and make sure the family is involved in her treatment, if they are abusive it can make situations worse.\n\nmost importantly, be present. listen. as i said you aren’t her therapist but be her friend. let her know she has a support system that loves and cares about her. you are doing an incredible job by taking these steps and asking questions. praying for your girlfriend and for your relationship. i hope for the best for both of you.",
          "created_utc": 1591253695.0
        }
      ]
    },
    {
      "id": "fstws6z",
      "author": "None",
      "body": "Great suggestions!",
      "created_utc": 1591248345.0,
      "score": 3,
      "context": [
        {
          "id": "fssuq9q",
          "author": "None",
          "body": "It’s sweet of you to ask and try to be there for her, good on you for being such a kind boyfriend. :) \n\nI would say try to not call her out on behaviors that seem unusual, but show her you care by asking/focusing on how she feels rather than the actions itself. \n\nFor example, if she doesn’t want to eat something don’t bring it up or make her feel embarrassed or called out for it.",
          "created_utc": 1591225960.0
        },
        {
          "id": "fstoeo3",
          "author": "angieestfanee",
          "body": "i like this response! in addition to not making it a big deal if she doesn't wanna eat a particular thing, maybe u can ask if she wants something different instead? an easier food or a favorite beverage, perhaps? but still make it clear that it's alright if she doesn't want anything<3 if she's feeling bad maybe she'd rather have a distracting activity like a movie or cuddling?",
          "created_utc": 1591242642.0
        }
      ]
    },
    {
      "id": "fsu0vew",
      "author": "catarina_miguealla",
      "body": "So it’s okay not to want to eat and starve? I’d say at least tell her to at least eat some fruit. Even if it’s an apple or something",
      "created_utc": 1591251464.0,
      "score": -5,
      "context": [
        {
          "id": "fssuq9q",
          "author": "None",
          "body": "It’s sweet of you to ask and try to be there for her, good on you for being such a kind boyfriend. :) \n\nI would say try to not call her out on behaviors that seem unusual, but show her you care by asking/focusing on how she feels rather than the actions itself. \n\nFor example, if she doesn’t want to eat something don’t bring it up or make her feel embarrassed or called out for it.",
          "created_utc": 1591225960.0
        },
        {
          "id": "fstoeo3",
          "author": "angieestfanee",
          "body": "i like this response! in addition to not making it a big deal if she doesn't wanna eat a particular thing, maybe u can ask if she wants something different instead? an easier food or a favorite beverage, perhaps? but still make it clear that it's alright if she doesn't want anything<3 if she's feeling bad maybe she'd rather have a distracting activity like a movie or cuddling?",
          "created_utc": 1591242642.0
        }
      ]
    },
    {
      "id": "fsvi3cx",
      "author": "oliviared52",
      "body": "Glad you found someone to push you to be better too! I couldn’t imagine what its like loving someone with an eating disorder. Now that I’m recovered, I can finally see the hell I put my friends and family through. \n\nI will still lose weight if I’m stressed. Not because of ED stuff but because when I’m super busy I will forget to eat. When my friends and family used to question my weight loss, it was this sick mixed feeling of anger and it’s none of their business mixed with being sort of happy they noticed. I used to get really defensive. \n\nNow when I get stressed and lose weight and they say something, I totally get it. I just think about the hell I put them through and how im lucky they care. But when you’re talking to someone deep in the ED, it’s a hard topic to navigate. \n\nIt’s interesting because my boyfriend now (who is also the love of my life and the “one”) used to suffer from alcoholism and has been sober for almost 10 years. It’s really interesting how the thinking pattern of a drug or alcohol addict and someone with an eating disorder are really similar in my experience.\n\nSorry just kind of went on a rant there lol.",
      "created_utc": 1591288172.0,
      "score": 2,
      "context": [
        {
          "id": "fst1lf8",
          "author": "oliviared52",
          "body": "Just being there for her really helps. I had an ex when I was really really bad and when he would witness my super messed up patterns he would say “I don’t condone what you’re doing but you will not go through it alone” and that would surprisingly help. It was a way to call me out on my bad behaviors but in a really supportive way. \nSometimes when I was deep in the ED I didn’t even realize some of my actions were weird. But if I was lectured to about it I just would have shut down. He didn’t try to change me, but calling me out while supporting me did wonders for my road to recovery.\n\nAnd if she ever wants to talk, listen. Tell her shes beautiful whenever you think it but also know eating disorders go so much deeper than looks. \n\nVery sweet of you to come on here asking for advice. If you need any more on the topic let me know! And at the end of the day know that a good support system helps a lot but not totally. If she slips again please do not take it personally. It is not because of you she developed this. All you can do now is support her the best you can.",
          "created_utc": 1591229572.0
        },
        {
          "id": "fsumbrt",
          "author": "MissRiss918",
          "body": "I love that he said, “I don’t condone what you are doing but you will not go through it alone.” That seems so powerful, and if my partner said that to me, I would feel very supported! \n\nPersonally, what has helped for me, is seeing my partner eat in normal patterns. It is a silent nudge, if you will. When he is not around, I tend to just listen to my own body, which has been unreliable! \n\nHe also will gently encourage me, by asking “what’s for breakfast/lunch/dinner” which reminds me it is time to eat. If I am not feeling up to it, he doesn’t press the subject. He also is very good at talking with me about my feelings. \n\nWhen we first started dating (8yrs ago), he wanted to fix the problem for me. This caused a great deal of frustration for both of us. He realized that he was unable to solve the issue, leaving him to feel defeated. When he realized he needed to hold my hand as we walked through it together, so much changed for us!\n\nI can imagine that it is challenging to love/support someone with an eating disorder and (often times) other mental health diagnoses. Great job coming here and asking for advice! That shows your compassion and speaks volumes to who you are! \n\nI know, from my boyfriend’s perspective, doing research about eating disorders was also very helpful. Good luck, OP, and feel free to come back and ask for support anytime!",
          "created_utc": 1591270698.0
        }
      ]
    },
    {
      "id": "fsy42v7",
      "author": "elvischair",
      "body": "for sure! everyone is different! :)",
      "created_utc": 1591338649.0,
      "score": 1,
      "context": [
        {
          "id": "fsu3k0l",
          "author": "elvischair",
          "body": "when you compliment her, try not to focus on physical appearance (you’re so beautiful, you look great, i love your eyes, etc). these are great things but it’s helpful not to place value and worth on physical appearance. and PLEASE do not comment on weight AT ALL. even “compliments” like you’re so skinny, your body looks great, you look healthy can be taken in such a twisted way when you have an ED. try focusing on the things you love most about her, like: you’re so thoughtful to do this for me, i really love your passion for _____, i admire your bravery, or you’re so talented at art/sports/academics/etc. \n\ndon’t try to be a therapist for her, that’s not your job, remember to take care of yourself or the relationship will not be sustainable. of course listening and support is important but set healthy boundaries and adhere to them.\n\neducate yourself!! you are already taking steps towards this and are clearly on the right track! know the signs and symptoms of eating disorders and do research to learn more and better understand. Kati Morton is an incredible youtuber with many educational videos on eating disorders i encourage you to watch. some( not conclusive list!!) signs and symptoms/ eating disorder behaviors include:\nnot eating/eating very little\nskipping meals\npicking at food\ncutting food into small pieces\nspitting food into napkin\nchewing and spitting\ngoing to the bathroom/taking showers directly after eating\nrussell’s sign (callous on knuckles caused by inducing vomiting)\nlaxative abuse\nexcessive exercise \nexercise at odd times of the day (common one is doing sit ups in the middle of the night, or walking laps during lunch\nhiding  food\nlarge amounts of food going missing\nbody checking (looking at body in the mirror/ feeling parts of your body(such as putting fingers around wrist, feeling collarbones))\nfatigue \nREMEMBER: WEIGHT IS NOT AN INDICATION OF THE SEVERITY OF AN EATING DISORDER\n\nit seems like you are both still young as juniors in high school (please be careful abt putting your age online!!💙) if you think it is necessary PLEASE tell a TRUSTED adult about the situation. because she is in treatment, it sounds to me like her family is aware so if you notice eating disorder behaviors increasing, telling her parents could really help her out, but please be careful with this and make sure the family is involved in her treatment, if they are abusive it can make situations worse.\n\nmost importantly, be present. listen. as i said you aren’t her therapist but be her friend. let her know she has a support system that loves and cares about her. you are doing an incredible job by taking these steps and asking questions. praying for your girlfriend and for your relationship. i hope for the best for both of you.",
          "created_utc": 1591253695.0
        },
        {
          "id": "fswppat",
          "author": "plasticcap1",
          "body": "Just to add, I think compliments about physical appearance can be helpful for some people. My girlfriend has an eating disorder is also insecure about body image, and actually really appreciates compliments about her appearance (but not about weight, like you said). Sometimes for people it can reenforce that they do actually have positive physical features and reminds them that some people do appreciate the way they look. Just a thought, of course everyone isn’t the same.",
          "created_utc": 1591308486.0
        }
      ]
    },
    {
      "id": "fsu1c1e",
      "author": "angieestfanee",
      "body": "for those of us who have or had eating disorders, it may be incredibly difficult to eat and being forced will definately take trust away from the bf. it's better to encourage eating but accept it won't always happen, then reassure them that they can try again at the next meal time. taking things slow may be the best approach for some ppl and ultimately it's up to the recovering gf to decide wht works best for her and put forward the effort to stick w it. some days are better than others. this isn't a \"just eat\" scenario. recovery takes trust, support, and time",
      "created_utc": 1591251837.0,
      "score": 9,
      "context": [
        {
          "id": "fssuq9q",
          "author": "None",
          "body": "It’s sweet of you to ask and try to be there for her, good on you for being such a kind boyfriend. :) \n\nI would say try to not call her out on behaviors that seem unusual, but show her you care by asking/focusing on how she feels rather than the actions itself. \n\nFor example, if she doesn’t want to eat something don’t bring it up or make her feel embarrassed or called out for it.",
          "created_utc": 1591225960.0
        },
        {
          "id": "fstoeo3",
          "author": "angieestfanee",
          "body": "i like this response! in addition to not making it a big deal if she doesn't wanna eat a particular thing, maybe u can ask if she wants something different instead? an easier food or a favorite beverage, perhaps? but still make it clear that it's alright if she doesn't want anything<3 if she's feeling bad maybe she'd rather have a distracting activity like a movie or cuddling?",
          "created_utc": 1591242642.0
        },
        {
          "id": "fsu0vew",
          "author": "catarina_miguealla",
          "body": "So it’s okay not to want to eat and starve? I’d say at least tell her to at least eat some fruit. Even if it’s an apple or something",
          "created_utc": 1591251464.0
        }
      ]
    },
    {
      "id": "fsu1ks5",
      "author": "catarina_miguealla",
      "body": "I understand. I also had an Ed, but I was probably more in control than most ppl. Since it didn’t go so far before I decided I wanted to stop",
      "created_utc": 1591252034.0,
      "score": 2,
      "context": [
        {
          "id": "fssuq9q",
          "author": "None",
          "body": "It’s sweet of you to ask and try to be there for her, good on you for being such a kind boyfriend. :) \n\nI would say try to not call her out on behaviors that seem unusual, but show her you care by asking/focusing on how she feels rather than the actions itself. \n\nFor example, if she doesn’t want to eat something don’t bring it up or make her feel embarrassed or called out for it.",
          "created_utc": 1591225960.0
        },
        {
          "id": "fstoeo3",
          "author": "angieestfanee",
          "body": "i like this response! in addition to not making it a big deal if she doesn't wanna eat a particular thing, maybe u can ask if she wants something different instead? an easier food or a favorite beverage, perhaps? but still make it clear that it's alright if she doesn't want anything<3 if she's feeling bad maybe she'd rather have a distracting activity like a movie or cuddling?",
          "created_utc": 1591242642.0
        },
        {
          "id": "fsu0vew",
          "author": "catarina_miguealla",
          "body": "So it’s okay not to want to eat and starve? I’d say at least tell her to at least eat some fruit. Even if it’s an apple or something",
          "created_utc": 1591251464.0
        },
        {
          "id": "fsu1c1e",
          "author": "angieestfanee",
          "body": "for those of us who have or had eating disorders, it may be incredibly difficult to eat and being forced will definately take trust away from the bf. it's better to encourage eating but accept it won't always happen, then reassure them that they can try again at the next meal time. taking things slow may be the best approach for some ppl and ultimately it's up to the recovering gf to decide wht works best for her and put forward the effort to stick w it. some days are better than others. this isn't a \"just eat\" scenario. recovery takes trust, support, and time",
          "created_utc": 1591251837.0
        }
      ]
    }
  ]
}