{
  "id": "gwh3q8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591276037.0,
  "title": "Request: triggered by wedding photos",
  "selftext": "hi, I hope this works! here's my question: I got married this last Saturday and even though I felt beautiful during the ceremony, we just got the professional photos back and I'm feeling so triggered. all the disordered thoughts I was convinced I'd pushed past came rushing back, and I feel almost physically sick looking at the photos. I want to look at them and just think about how beautiful our day was and how in love we are, not about how I should've done my hair differently, or worn a different dress, or just \"looked better.\" it's been a really long time since I felt like this and it's so distressing :( does anyone have advice on how to work through this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gwh3q8/request_triggered_by_wedding_photos/",
  "score": 65,
  "num_comments": 6,
  "comments": [
    {
      "id": "fsuzvqs",
      "author": "tymopa",
      "body": "Photos are so triggering and it sucks this is hijacking your wedding bliss. I know it's not something one can snap out of easily and it can throw you into the depths of despair. Honestly, I would get an ED therapist asap. This is so common and you deserve not to be tortured. I might suggest just setting the wedding photos aside for now until you can calibrate. That's the only thing I can do when I look at photos if myself otherwise I'm a goner. Much love to you. So sorry you are having to deal with this.",
      "created_utc": 1591279281.0,
      "score": 26,
      "context": []
    },
    {
      "id": "fsv9m31",
      "author": "ashley_at_clubmates",
      "body": "Hey I’m so sorry. If you felt beautiful and loved and happy day of, its because you WERE and ARE. I was triggered by my wedding photos too, but committed to not poring over them, but using them to glance and remember the memories. Try to put them down, let it go, and enjoy your SPOUSE! Congratulations :)",
      "created_utc": 1591284170.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fsvn43g",
      "author": "houston_veronica",
      "body": "I have struggled with AN for so long, but it didn't begin until after I married (5 years in).  But here's what I would try to keep in mind!\n\n\\- I cannot think of one person who was totally happy with how they looked on their big day! this is truly so common, so don't necessarily allow it to be credited to ED - \n\n\\- you said some powerful things: you ARE so in love, you FELT beautiful, the day was amazing! Those things are treasures that honestly are not true for every couple, or possibly a huge percentage. (So many get married for the wrong reasons, or want to back out but \"The invites were sent\" etc) -- you are so very fortunate to have your hubby, and that is the biggest win of all!  \n\n\\- Ed is trying to worm his way back - don't allow it. If you need to put the photos away, that is a small price to pay to stop allowing this to hurt you. I agree with the other person posting: focus on your amazing husband, your marriage, and live to the fullest.  \n\nHugs and CONGRATULATIONS!!!",
      "created_utc": 1591290504.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fsxzsjh",
      "author": "dumpsterfirechaos",
      "body": "first: amazing u reached out! sometimes it can be so hard to talk about those struggles but always be proud of yourself if you can manage to talk about those toughts...\ni exactly know what you mean. \nfull body photos can be so hard to process but remember, it‘s a momentum of a body pose and angle and never what the body truly looks like and how others percive it - because your perception of your own body is probably distorted -\nand it‘s not reality.\nyour ED is trying to hurt you with this perception and the self-loathing.\nhow have u felt during your wedding? have u looked in the mirror and liked what you saw? \ni wasn‘t there but i haven‘t seen a single bride who wasn‘t absolute stunning and beautiful in her own way while being in love with the person she‘s married to, surrounded by her loved ones, looking like a goddess. \ndon‘t let the ED creep up on you and take away something u didn‘t to because u wanted to look pretty on a daily basis but because u did out of deep love and affection to what you and your partner share, wanna built in the future and to celebrate what u feel for each other. get a piece of that love for your partner and give it back to you! be kind with yourself.",
      "created_utc": 1591335364.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ft00vvg",
      "author": "AlliSpottsDeLazzer",
      "body": "Eating disorders, even long after recovery starts, make your own eyeballs untrustworthy. I'm so sorry that ED is trying to mess with a beYOUtiful day. Focus on the emotions of it and the actions, your community, and the moments. You eyes see a purple sky, and it doesn't make sense that it's blue. I know.....",
      "created_utc": 1591382816.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fsuu2kp",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591276037.0,
      "score": 1,
      "context": []
    }
  ]
}