{
  "id": "gxx71r",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591471216.0,
  "title": "Request: What to do when someone you have confided in tells others about your eating disorder?",
  "selftext": "I apologized for the length of this post. For some background, I am 27f, and have struggled with an eating disorder for 11 years. When I switched doctors a few years ago, from my childhood doctor to the doctor that I have now, I received a formal diagnosis of anorexia and did see an intern for therapy for six months. Otherwise, I've not had any other treatment. \n\nAbout four years ago, I started a new job, alongside a few other new hires. One of the other new hires, 50f, and I instantly clicked. She was very kind and seemed so wise. I felt like she had my back at work and I trusted her. We did things outside of work all of the time, and it felt nice to have a friend, as eating disorders can be very isolating. \n\nAfter some time, this coworker expressed concern about my eating habits and wanted to know if I was okay.  I decided that it would be okay to let her in. I shared everything with her, and I mean everything. She encouraged me to switch to a doctor who could help me, and she even went with me to my first appointment. For the first time in a while, I really felt like I was in control of my eating disorder and that I could get better. \n\nA few months later, an extra leadership position opened up at work and I really wanted to apply for it. It wasn't much, and the raise it offered was very small, but I wanted to do it. I was transparent in that I let my coworker know that I planned on applying. When it was known to everyone that I did get the position, that was when everything changed. My coworker cornered me alone and was very upset that I had gotten the position over her. She said that I didn't deserve it, and she threw back everything I had ever confided in with her as the reasons why I shouldn't have gotten it. I apologized because I didn't know she wanted it too. I was devastated. I didn't know what to do, so I just avoided her for a while in the hopes that she would cool off and that things would go back to normal. \n\nAfter that incident, many people at work confronted me with accusations of an eating disorder, saying that they had heard things. My coworker had told anybody who would listen about all of the things I had told her about my eating disorder. Some people were concerned when confronting me, but a lot of them were angry too, like I had purposefully kept it a secret from them. I just denied everything until people finally stopped asking. It was and has been extremely embarrassing. Though I have an eating disorder, I believe I'm a hard worker, and I always get my work done. \n\nHowever, it has really made work a painful place to be. I still have to work with this coworker, and she just acts like nothing ever happened. She still tries to talk about personal things, but I shut it down and do not discuss anything but work related things. I feel like I am completely isolated. I just try to do my job and go home, but I dread going back each day. Absolutely dread it. I stopped seeing the intern for therapy sessions shortly after and have been avoiding my doctor, because I just feel so stupid and I feel like I can't tell anyone else anything more about myself. I was wondering if anyone could offer any advice on what to do or how to make things bearable moving forward?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gxx71r/request_what_to_do_when_someone_you_have_confided/",
  "score": 67,
  "num_comments": 5,
  "comments": [
    {
      "id": "ft6b3cs",
      "author": "birdkey26",
      "body": "You need to keep written track of all this and go to HR. This is harassment. This is also why people are so terrified to confide anything to anyone. That’s horrible and I’m sorry you’re going through this. Also-do not stop going to you’re therapist and doctor-especially if you liked them and they were helping you. That’s a rare find.",
      "created_utc": 1591473179.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ft67h82",
      "author": "chai_latte_and_chill",
      "body": "Your situation seems very difficult and I am sorry your coworker acted in such a childish manner. You did nothing to wrong her, you are at no fault here. I believe your therapist or a new therapist could give you help for conflict resolution; just because a conflict occurred does not mean you need to cut off your supports, such as doctors or therapists. In fact, if you state that the doctor helps you and you are letting this incident stop your visits to the doctor, then you are giving more power to this awful coworker. I myself have had an eating disorder so I understand the feeling of isolation. I think you should try to go to your doctor, because they are your first support for your ED. \n\nPeople show their ugly side when they are jealous. You still have so much good to give, and the right friend will come along.",
      "created_utc": 1591472266.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ft6bpn4",
      "author": "ImMrsH",
      "body": "I am so sorry that you are going through this, I can't imagine how difficult this is. Unfortunately, this woman was not a true friend to you. If she was she would have congratulated you on your achievements whether she wanted the position or not. In addition, she would not have told others about things you told her in confidence. Some people can be in your life to try and \"fix\" you, and if they see that you are achieving anything positive, they try to knock you down. \n\nHave you thought about speaking with HR?  You should not be made to feel uncomfortable at your workplace. HR's job is to investigate and put a stop to this.\n\nI do not think speaking to this \"friend\" would be a good option, she has shown that she can not be trusted with private information. So, if you talk to her about it she may even go behind your back and say something about it, again painting in you a bad light. \n\nPlease, keep us updated on what you decide to do. Best of luck!",
      "created_utc": 1591473348.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ft8p2hu",
      "author": "depressedfatbitch",
      "body": "Document all of this and go to HR. Anorexia is an illness and you are protected from harassment. Nothing about your eating disorder is their business! I am so sorry!",
      "created_utc": 1591506641.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ft639ml",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591471216.0,
      "score": 1,
      "context": []
    }
  ]
}