{
  "id": "gyb41q",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591531383.0,
  "title": "Request: Keep looking at medical chart",
  "selftext": "I’ve posted here a couple of times. But during quarantine and this pandemic it’s been hard. I haven’t been able to see my therapist since March. I find myself going to my medical chart and seeing the weight that I was at last year compared to this year. And it makes me feel super shitty. I always CONSTANTLY feel my stomach/look at it so much people probably think that I’m pregnant. I’ve been told that you ships the be gaining this much weight in recovery. My bf thinks I’m fine. My gym has just reopened so I hope that helps. But I always find myself feeling my stomach, comparing, and ALWAYS ask my mom/bf “am I gross for eating this? Is it bad that I just ate this? I drink diet soda every day is that bad?” My mom doesn’t know that I have an ED, but she might have a clue. I don’t know. I wish I had this under control. We’re not allowed to discuss numbers in this thread which is fine but...I don’t know. I’m just at a loss.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gyb41q/request_keep_looking_at_medical_chart/",
  "score": 40,
  "num_comments": 4,
  "comments": [
    {
      "id": "ftad1cz",
      "author": "StraightOutBee",
      "body": "Weight gain for me was really hard to accept, and I still struggle with it. I've found that trying to appreciate what gaining weight has done for me (like having more energy) helps me accept the fact my waistline is a bit bigger now :)",
      "created_utc": 1591552235.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ftb8sr8",
      "author": "jenny_mac_",
      "body": "Hi there, everything you’re experiencing is super normal and challenging so be patient  and kind with yourself. I highly recommend the food psych podcast and the book called Intuitive Eating by Evelyn Tribole and Elise Resch. Intuitive eating is the only way to make peace with food and your body. I would set a personal goal to stop weighting yourself, stop checking your chart, and body checking. When you feel the urge, remind yourself that you’re worthy regardless of your size and you’re committed to your recovery! \nI follow a bunch of fat positive models and influencers on Instagram and it really helps with the fear of weight gain. You do not need to weight yourself, I literally haven’t weighed myself in years since starting recovery and ask the Drs to not tell me/show me when I get weighed. \nDo you think your mom would be compassionate, understanding, supportive if she knew? If so, Maybe try telling her. Openly discussing being in recovery and expressing your emotions can really help. Sending love and support!!!🥰",
      "created_utc": 1591569518.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ft9ezjo",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591531383.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftaom33",
      "author": "bheilo23",
      "body": "Hi, I was diagnosed with an eating disorder in 2015, I did groups, therapy, inpatient and outpatient. For the time that I was inpatient, I had a nutritionist at the hospital who made our meal plans based on our weights and BMI, etc. And gaining weight is normal, it’s usually more water weight than anything else and it will go to your stomach first! It’s also bloating, so I get it might feel big or stiff but don’t worry it’s mostly water and because your body isn’t too used to eating a lot/ or holding onto food! I still struggle everyday some worse than others, but will get better:) your stomach tends to hold on to the most because it has to protect internal organs :) so it uses fat to cushion all those areas to keep us safe, I’m still myself trying to grasp that fat is good and not always bad and we keep a good healthy amount to protect our bodies and everything inside. So if that helps to look at it in a better light. I don’t want to name what eating disorders I’ve had/ have because I’m new to the sub and don’t want to trigger anyone, but adjusting to a healthy body and seeing it change after we’ve deprived it is the hardest, it’s usually the last thing we have to tackle mentally after going into recovery because it can be the hardest and longest battle. It’s normal to be scared and feel like a failure for gaining weight I sure as heck did. I still have days we’re I feel “big” even though I am not at all it’s just my body dysmorphia, that’s probably what you feel also and why you can’t stop feeling your stomach, try and do some things that keep your mind and hands busy and maybe that will help a bit! My dms are open ❤️",
      "created_utc": 1591558533.0,
      "score": 1,
      "context": []
    }
  ]
}