{
  "id": "gyud0m",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591600365.0,
  "title": "Request: Struggling with binging and restriction. Advice on balance?",
  "selftext": "So I used to struggle with restriction with eating. I've never had a normal eating pattern in my life. My dad says starving reminds you you're alive and my mom was a yoyo dieter. So I ended up restricting and malnourished. I started eating a bit more and gaining some weight.\n\nThen I lost my sister in law. She was my best friend. I didn't realize until yesterday that that triggered me to binge eat. I've been struggling with binging since then. \n\nNow I'm working on the three meals three snacks routine. A problem I've noticed is if I feel like I'm not eating enough again I panic because of how weak I felt when I did restrict. Then I panic if I binge. I dont know how to find a calm approach. I'm tired of my stomach being bloated from over eating and tired of feeling like I have to starve.\nAny advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/gyud0m/request_struggling_with_binging_and_restriction/",
  "score": 60,
  "num_comments": 5,
  "comments": [
    {
      "id": "ftdttab",
      "author": "jenny_mac_",
      "body": "I would caution tracking everything you eat. It can become and obsession and it takes away from your ability to trust your body. \nI’d recommend the book Intuitive Eating by Evelyn Tribole. There’s an accompanying workbook to help learn the practice. It’s the only way in my option, to break free of the binge restrict cycle. Sending love and support!",
      "created_utc": 1591634378.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ftd6f6k",
      "author": "boqueteazul",
      "body": "First of all, I am very sorry for your loss. It's difficult to lose someone you've held dearly in your heart.\n\n\nSecond of all, and most importantly, seek professional help if you can. It's important to talk to someone that knows what they're doing about your traumatic experience. I know it's not easy, especially when you loved her so much. So, please find someone that can help you guide through what you feel. Before you even think about food, think about seeking help for what you've experienced. This is more than just food now, this is about you feeling hurt, ok? So please go seek help.\n\nRegarding your eating, are you ok with tracking everything that you've ate? There's an app that helps you track your macros, and also tells you if you ate too much or you're missing something. It's not perfect, but it's the best way to let yourself know whether you ate enough or not. If you don't want to work so much on numbers, just check marking what you ate would suffice (like, noting down if you ate protein, carbs, fruits, calcium, and vegetables during a meal). Also, if you feel like you didn't receive enough nutrients, why not take some supplements? They're *not* there to substitute your meals, but to make you feel a bit better if you feel like you haven't eaten enough vitamins or calcium or anything. You can drink protein shakes if necessary, too. \n\nKeep in mind that just because you forgot to eat something today, doesn't mean your body will instantly be \"ruined\". You are never ruined and never will. The fruit you ate yesterday? Your body could still be using the nutrients of that fruit today. Your body knows how to regulate its system, trust it. If you ever feel like you're missing something, check your notes. Prep some meals for the week so that you know what you're getting the next day. The average person should be eating about 400 grams of fruit a day, it's literally just about a cup of fruit. That's it. You are not missing anything, and it's ok if you feel like you do. It's hard. But know that you are probably eating enough. Many foods already contain things other food groups have. Spinach, for example, despite being a literal leaf,  contains protein, calcium, iron, vitamins, etc. You won't be needing to eat fruit or drink milk because your body was able to receive those nutrients through spinach. And that is just ONE food. \n\nSo, know that you won't return from what you used to be. And know that it is ok that your stomach doesn't feel so full to the point it hurts, your body already has what it needs. And please look for professional help to help you guide through what you feel. Best of luck to you ❤",
      "created_utc": 1591621627.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ftcj3lq",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591600365.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftfa63o",
      "author": "yellowfaerie",
      "body": "I would suggest mechanical eating! Its what keeps me in check ever since i lost my brother i’ve binged my whole heart out. I still slip every so often and binge/restrict but its not as bad as it was. It helps me not to be in constant thoughts of what im eating or ill end up binging or restricting, depending on how my emotions override that day. Mechanical eating has helped me get my hunger cues back by eating at the same time everyday. Its not the exact same bc sometimes im in the middle of something but its within that hour for sure, if im pushing myself to walk that middle ground thats talked so heavily about with recovery. Also try to release any guilt you put on yourself, because guilt keeps you in the cycle longer. Lots of love dear!!!! Stay safe",
      "created_utc": 1591660839.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fthauo8",
      "author": "None",
      "body": "I had/have that issue. Restrict, binge, restrict, binge. It was awful for two years just binging like a maniac after I low restricted for three months straight. All the junk food you can imagine, id buy ice cream, cakes, cookies, chocolate, etc. anyways what helped me was finally just giving in to eating. I started eating about 1600-1800 calories a day, and stopped eating sugar, ate whole foods, nothing processed. I’m not trying to advocate for any diet here or start anything like that, it’s just what worked for me. I’ll restrict now to about 1500 calories on work days (I work 4 days a week) and about 1800-2000 when I’m home bc otherwise I’ll just binge if I get too hungry, and I always have an eating “plan” for the next day. I also have a little variety, like switching up fruits and stuff, but I’m still super controlled about everything. It has helped my binging like 90%, and I walk 6 miles 4 times a week to get exercise in. I’m losing about 2 pounds per week (for now). Which is so slow, and somewhat discouraging bc back with low restricting i would lose like 5 pounds a week! But everyone always says, to stop binging you just have to eat. I didn’t even gain weight doing it. It’s so hard bc who doesn’t love the control of restricting. But binging is miserable and I’d rather have this honestly. But I totally understand the struggle. 💔",
      "created_utc": 1591713806.0,
      "score": 1,
      "context": []
    }
  ]
}