{
  "id": "h07m94",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591782180.0,
  "title": "Request: Scared to go back into work after gaining weight during quarantine",
  "selftext": "Hi guys. I’ve been recovering from anorexia for a few months now, and I’ve gained some weight, but it’s a fairly healthy weight for me. A decent amount of that gain has occurred in quarantine though, so the last time people at my work saw me, I was underweight. I’m supposed to go back to work late next week, and all I can think about is how they’ll all notice that I’ve gained weight and judge me or think less of me for it. \n\nI can’t stand the thought of them noticing, even if I am in a much better place all around. The thought of going back makes me really anxious, and I can feel myself starting to regress back to old behaviors. Any advice or personal stories would be much appreciated :)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/h07m94/request_scared_to_go_back_into_work_after_gaining/",
  "score": 50,
  "num_comments": 7,
  "comments": [
    {
      "id": "ftksozv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1591790649.0,
      "score": 27,
      "context": []
    },
    {
      "id": "ftkzvbr",
      "author": "None",
      "body": "The good news is, *almost everyone* gained weight during quarantine. A few people leaned heavily into home fitness and maybe got back in shape / in better shape, but most people succumbed to the lure of snacks. My guess is no one will comment on your weight because no one wants to invite comment on their own weight. If anyone says anything, you can easily say \"quarantine, man\" and everyone will laugh and move on. They don't need to know the truth unless you want to talk about it.",
      "created_utc": 1591795316.0,
      "score": 20,
      "context": []
    },
    {
      "id": "ftm92bl",
      "author": "Banished_Peasant",
      "body": "I was slightly overweight before quarantine, and I've gained weight during it too. I was embarrassed to meet my friends again, surely they would notice I thought, and they will laugh at me.\nFact is, no one cared. No one said anything, and when I brought it up a friend of mine said that he didn't noticed.\n\nAs usual people aren't focused on us as we think. I can understand what you say, even if I didn't have the same problem of yours. But you are making this worse then it will be. It will be fine, your colleagues won't think less of you for your weight, if they'll notice at all.\nYou should be celebrated for your fight against anorexia, if anything.",
      "created_utc": 1591818309.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ftlw4k4",
      "author": "None",
      "body": "Oh boy I can relate. I was a full-time bartender during recovery, and having such a public-facing job during that transition was tough. Luckily, people generally know better than to comment on weight gain (I wish I could say the same for weight loss). Nobody ever mentioned it. My only advice is, if you have the means, to go shopping for some new clothes, get your haircut, or do whatever else you can think of to boost your self-esteem. If you feel like you look good, you will exude that attitude, and it will influence others. But honestly one of the more important things about recovering for me was to stop caring about the opinions of others. All I care about is how I feel now.",
      "created_utc": 1591812248.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ftm6de4",
      "author": "Kaleidosun",
      "body": "I'm so worried about this too! So just know you're not alone. Something I like to remind myself is that my life has changed significantly, which means that my body also has every right to change and grow with me.\n\nI also second what other people said, it's likely people won't notice, and even more likely that they'll adjust quickly and stop noticing even if they did initially.",
      "created_utc": 1591817034.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ftmxmbl",
      "author": "tomhall44",
      "body": "It’s none of their business. If you like the way you look then their opinions don’t matter.",
      "created_utc": 1591830249.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ftkjbte",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591782180.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftlb644",
      "author": "biologeeeee",
      "body": "Thank you! That last point especially.. I needed that reminder :)",
      "created_utc": 1591801347.0,
      "score": 1,
      "context": [
        {
          "id": "ftksozv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591790649.0
        }
      ]
    },
    {
      "id": "ftlb7sp",
      "author": "biologeeeee",
      "body": "Thank you! That last point especially.. I needed that reminder :)",
      "created_utc": 1591801360.0,
      "score": 1,
      "context": [
        {
          "id": "ftksozv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591790649.0
        }
      ]
    }
  ]
}