{
  "id": "h07nud",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591782413.0,
  "title": "Request: Girlfriend not eating enough",
  "selftext": " \n\nMy girlfriend (15F) stopped eating full portion meals 3 1/2 years ago because she's a very very sensitive person. She takes everything said to her pr even others to heart and let's if get to her. So her parents always comment on her size (shes very underweight) and they say stuff like \"oh wow you're finally eating?\" Or \"I've never seen you eat that much, are you sure you'll finish it?\"\n\nAnd those words get to her causing her to eat like really really small sized meals and if she eats too much she feels sick to her stomach and ashamed for eating so much so she'll throw it all back up. Is there any way I can convince her to start eating normally again and to stop listening to her parents comments?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/h07nud/request_girlfriend_not_eating_enough/",
  "score": 81,
  "num_comments": 12,
  "comments": [
    {
      "id": "ftkkcpa",
      "author": "None",
      "body": "gaze hobbies merciful ad hoc ludicrous lush cagey political wrench slim\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1591783207.0,
      "score": 59,
      "context": []
    },
    {
      "id": "ftlm37w",
      "author": "updown27",
      "body": "You definitely cannot fix this. This is anorexia AND bulimia and she needs professional help ASAP.",
      "created_utc": 1591807700.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ftkl451",
      "author": "AbenaGhUkBoom",
      "body": "I agree with one user she needs therapy. It’s a problem in her mind and family affect her so bad too. Unfortunately I have been dealing with binge eating and throwing up in the past, family has a big impact on your mental health. Still to this day my mum keeps saying I need to lose weight as I am fat. I’m on post part Um as well and it’s been hard Life . So please help her in any way but mostly advice her to seek theraphy or consuelling . You two can go together as well",
      "created_utc": 1591783963.0,
      "score": 15,
      "context": []
    },
    {
      "id": "ftkxa9d",
      "author": "None",
      "body": "It may not help all the time, but are you able to eat together more often just the two of you? It doesnt have to be anything expensive, even just something like a picnic or making food together and coming to your room would help imo. I think that way, you can encourage and support her (note: do not force or pressure her though) so that she feels less anxious when eating and feels 'safe', so to speak. Many times, people with eating disorders are actually enjoy prepping food, so it may be a fun idea to choose a recipe together to follow too. \nI agree with the other commenters though, she will definitely require therapy but this may help a little with harm reduction if it works. Good luck & I wish you both the best ♡",
      "created_utc": 1591793741.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ftlbhe4",
      "author": "tymopa",
      "body": "Ugh...you are in a tough spot. I was bulimic for 49 years off and on....mostly on until I finally realized I couldn't control the beast on my own. Therapy was paramount...a life and relationship saver. Here's one thing I learned. No one, and I mean No One should focus on anyone else's eating or bodies (compliments or put downs). Essentially by trying to talk to her about eating will be absorbed into the same category as what her parents do which is \"people keep focusing on my eating.\" It makes you crawl in a hole, retreat, and hide. Also, just as a side note in case this comes up, don't verbalize about yours or anyone else's eating or bodies either. She needs an ED therapist to get out of this. People who do this on their own (and I realize this is the only option for some) miss a huge element that makes staying ED free much easier because it is not easy. It lingers and waits for the right moment to trap you, even years later, and then your a goner....again. Check out the National eating disorder association website and if you feel comfortable share this with your girlfriend and her parents. There are lots of resources for all of you.",
      "created_utc": 1591801533.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ftkjk8t",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591782413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftkjyj6",
      "author": "jesuskriz",
      "body": "I’m not so sure but maybe try to distract her with any other thing except food, her parents. You can make her see there are things she can enjoy without worrying about her weight,",
      "created_utc": 1591782810.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftm7e5v",
      "author": "AlliSpottsDeLazzer",
      "body": "Answering your question: 99%, not a chance on your own. But you might be able to help her agree to get some help. FYI, any therapist can SAY they treat eating disorders (EDs), but they may not be competent. Feel free to ask if you need more info on how to vet specialists. Generalists can harm if not WELL-trained in EDs.",
      "created_utc": 1591817515.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftmiw4e",
      "author": "kolibri22",
      "body": "It seems like you are school aged. Is this something you can bring to a counselor without upsetting her? It doesn't seem like her parents will be very understanding...",
      "created_utc": 1591822995.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftmn97y",
      "author": "anibs",
      "body": "If she does eat around you, make her feel safe. Don’t force her to eat ever, it will probably just lead to more restriction. Like others have said, she probably needs professional help, be there for her. She will be resistant and not want to do it. If she starts eating better and gaining weight NEVER comment on her body even if it seems positive things like “You look healthier” can be so damaging and seen as failure, when she does eat say things like “you look so much happier” and NOTHING to do with appearance. Hope this helped, I’m sorry she’s going though that :(",
      "created_utc": 1591825033.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftnnm3f",
      "author": "ssaaddddlleerr",
      "body": "Don’t bring this burden on you. You can’t change this. Continue to care about her and be there for her (like it seems that you are), and encourage her to seek help!",
      "created_utc": 1591844397.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftnyoek",
      "author": "zebra223",
      "body": "Many girls have body image issues, they might be underweight already, but if they think that \"skinny\" is more beautiful, then they cannot stop comparing themselves to girls that are skinnier than them. Many girls would choose not to tell people that they struggle with their weight, because they know that other people will scold them for having that mentality. And since your girlfriend is only 15, she should look skinner than a full-on adult. Chances are, once she goes through these transitional teenage years, she will most likely put on weight naturally.",
      "created_utc": 1591851555.0,
      "score": 1,
      "context": []
    }
  ]
}