{
  "id": "h0p52x",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1591838423.0,
  "title": "Request: [Request for Advice] Triggered by a photo of myself",
  "selftext": "I deleted social media over a year ago and since then I have not really taken selfies or had photos taken of me. Yesterday a family friend took a beautiful picture of my husband and I in front of our new home (a rainbow somehow formed over us in the photo, it was really amazing) but I feel like I looked awful in it. I have not engaged in ED behaviors for over a year and have actually thought that I look good sometimes at my healthy weight but that picture ruined everything. My face and body looked fat and distorted especially next to my husband who looks great. I ended up having a meltdown over the photo and my husband is mad that how I look upsets me so much because the photo means a lot to him. I am trying to fight the negative thoughts and reframe how I think about myself but I keep having invasive thoughts telling me how fat and ugly I am. Seeing that photo has trigged the urge to restrict and abuse exercise again and I really do not want to fall back in that cycle. Please help!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/h0p52x/request_request_for_advice_triggered_by_a_photo/",
  "score": 60,
  "num_comments": 14,
  "comments": [
    {
      "id": "ftnersy",
      "author": "AlliSpottsDeLazzer",
      "body": "Sounds so scary to experience! Reminder that body image distortions are the last to go. So can you really trust your own eyeballs? With eating disorders, NO, you cannot trust your own eyeballs.",
      "created_utc": 1591839474.0,
      "score": 34,
      "context": []
    },
    {
      "id": "ftnfwk8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1591840085.0,
      "score": 14,
      "context": []
    },
    {
      "id": "ftngim5",
      "author": "BlumpkinsRule55",
      "body": "I just tell myself how healthy I look and feel. That it doesn’t matter what I look like if I don’t feel good. I want to enjoy life, not just spend the entire thing worrying about what I look like. I really have forced myself to invest in other things like reading and writing and educating myself so I feel confident with those things and care less and less about looks",
      "created_utc": 1591840413.0,
      "score": 11,
      "context": []
    },
    {
      "id": "ftngsmd",
      "author": "Mamajo131",
      "body": "This happens to me all the time. You are not alone ! I don’t have any advice, Just hugs !",
      "created_utc": 1591840554.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ftnhh7b",
      "author": "None",
      "body": "I’ve struggled with my self image and EDs for a very long time and hardly have any full body pictures of myself. I too prefer being behind the lens than in front of it. There is only one photo I like and I’m mostly covered by my jacket. The only thing I can tell myself is that it is my mind trying to play tricks on me. I am strong and I am powerful. My body is not the grotesque mass my mind portrays it to be and neither is yours. Stay strong, love. I send you as many positive vibes and hugs that I can.",
      "created_utc": 1591840923.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ftorj2a",
      "author": "Boosey0910",
      "body": "This is normal. Please know you are not alone.  Also, photos never really show us how we look.",
      "created_utc": 1591877148.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ftpsv8q",
      "author": "youareinmybubble",
      "body": "Hello I understand what you are saying and how you are feeling.  First take a deep breath let your mind settle those negative thoughts are like trying to drive in a snow storm you can't make out anything clearly you become disoriented its all around you and the only thing you can see is snow.  The good news is that the snow dose calm and things become clear again. Breath until you start to see come calm.  Props to you knowing that you are triggered and asking for help.  Seeing yourself can be triggering expacally when you are in recovery think about it we spent years picking ourselves apart and that was when we were sick now that we are \"healthy\" we are looking at a new foreign body we are still getting use to. You are beautiful.  I do this thing that sounds stupid but maybe it will help you.  I look in the mirror and have at it but for every negative thing I say about myself I force myself to say two positive things. I will talk to myself in the mirror and its uncomfortable and weird but it helps me it reminds me that I can be my worst critic but I can also be my best cheerleader. You are not crazy, you are not a failure you are a human trying there beat and you are enough you are entitled to love and happiness.  If you want to talk message me. I am here for you.",
      "created_utc": 1591896938.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ftncs7j",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1591838424.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftp3wyd",
      "author": "tomhall44",
      "body": "Your husband got mad because you were upset? What a git.",
      "created_utc": 1591884659.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ftojv6x",
      "author": "lenaville",
      "body": "It is so relatable for me. I had my fair share of after-photo breakdowns.\n\nBut it might be a controversial opinion but recently I started to think that why should I be pretty? Why beauty defines me?\n\nI am not saying that you are ugly. I have no idea how you look. And I am pretty sure you underestimate yourself just as most of us here are doing. \nBut I am saying that it wouldnt matter if you would be ugly. You are you. And the aim of life -at least for me - is maximizing joy and happiness. What matters is not our appearance. Even if we achieve the perfect body, it would decay in 50 years. But memories we collect is immortal.\n\nI kind of managed to change why I want to lose weight. I want to lose weight not because all this pretty/skinny stuff but because I want to live a healthy life. I just want to maximize my life experience.\n\nI hope my way of thinking is helpful for you.\n\nFighting !!",
      "created_utc": 1591870661.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ftoi3dn",
      "author": "ecbythesea",
      "body": "Great reminder!",
      "created_utc": 1591868917.0,
      "score": 3,
      "context": [
        {
          "id": "ftnersy",
          "author": "AlliSpottsDeLazzer",
          "body": "Sounds so scary to experience! Reminder that body image distortions are the last to go. So can you really trust your own eyeballs? With eating disorders, NO, you cannot trust your own eyeballs.",
          "created_utc": 1591839474.0
        }
      ]
    },
    {
      "id": "ftrc86v",
      "author": "None",
      "body": "Thank you for your response! I just checked this post and read the comments. I really appreciate you validating how scary it was, sometimes my husband doesn’t understand how overwhelming feelings associated with my eating disorder can be so it’s reassuring to hear that how I feel is ok. This is an excellent reminder, I have had my ED for so long I forget I can’t trust how I see myself sometimes.",
      "created_utc": 1591925090.0,
      "score": 2,
      "context": [
        {
          "id": "ftnersy",
          "author": "AlliSpottsDeLazzer",
          "body": "Sounds so scary to experience! Reminder that body image distortions are the last to go. So can you really trust your own eyeballs? With eating disorders, NO, you cannot trust your own eyeballs.",
          "created_utc": 1591839474.0
        }
      ]
    },
    {
      "id": "ftrc1fk",
      "author": "None",
      "body": "Thank you so much! I’m sorry I just checked this post and saw this. I just started seeing a new therapist and let her know what happened so we can discuss it in our next session. I love the photo and the meaning behind it, I just wish I could change how I see myself because then it would be perfect.",
      "created_utc": 1591924976.0,
      "score": 1,
      "context": [
        {
          "id": "ftnfwk8",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1591840085.0
        }
      ]
    },
    {
      "id": "ftrcbu0",
      "author": "None",
      "body": "Thank you so much! It’s reassuring to hear that I am not alone tbh.",
      "created_utc": 1591925151.0,
      "score": 1,
      "context": [
        {
          "id": "ftngsmd",
          "author": "Mamajo131",
          "body": "This happens to me all the time. You are not alone ! I don’t have any advice, Just hugs !",
          "created_utc": 1591840554.0
        }
      ]
    },
    {
      "id": "ftrch31",
      "author": "None",
      "body": "Thank you so much. I’m the same way, I HATE having photos taken. I’ll occasionally try to take a selfie and then immediately delete it or take like 25 more until I think I look decent. Sending you positive vibes and hugs as well, stay strong ❤️",
      "created_utc": 1591925238.0,
      "score": 2,
      "context": [
        {
          "id": "ftnhh7b",
          "author": "None",
          "body": "I’ve struggled with my self image and EDs for a very long time and hardly have any full body pictures of myself. I too prefer being behind the lens than in front of it. There is only one photo I like and I’m mostly covered by my jacket. The only thing I can tell myself is that it is my mind trying to play tricks on me. I am strong and I am powerful. My body is not the grotesque mass my mind portrays it to be and neither is yours. Stay strong, love. I send you as many positive vibes and hugs that I can.",
          "created_utc": 1591840923.0
        }
      ]
    }
  ]
}