{
  "id": "h7xtdk",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1592011852.0,
  "title": "Request: Feeling lost",
  "selftext": "Does anyone feel like this disorder has taken their whole personality away from them? In the last 2 years I’ve been progressively getting worse and after speaking with my boyfriend tonight he highlighted (and I’ve thought this myself) I’ve lost my carefree and fun side of me. Now I’m just in constant stress or anxiety mode. Won’t do anything won’t go anywhere. Is anyone else like this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/h7xtdk/request_feeling_lost/",
  "score": 55,
  "num_comments": 9,
  "comments": [
    {
      "id": "funtvi8",
      "author": "MysticalWateryEye",
      "body": "Sometimes this is the point when there's that clarity of \"i need a higher level of care\" . If you can, i encourage you if you already aren't under the care of doctors for this etc, to try going to a doctor and seeing a therapist. It's extremely helpful.\n\nBut yeah, eating disorders take and take and take and take, and that's why realizing this is so important. It just takes a lot of time to chip away at the ED voice in your head, giving up some of that power. But it could be BDD kicking you extra hard, which complicates things, because it's so exhausting.",
      "created_utc": 1592012265.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fuo0grn",
      "author": "tomatopotatotomato",
      "body": "Yes I felt this way. Therapy really helped me. ❤️❤️❤️",
      "created_utc": 1592016381.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fup890i",
      "author": "RatEnabler",
      "body": "This shit is monstrous at worst and takes so much from a person, I'm a work in progress and have good and bad days. It's so much harder of an addiction to break when you have to confront food every day and live with making choices for the rest of your life. I forever feel lost.",
      "created_utc": 1592054639.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fupbdyj",
      "author": "tomasoregan",
      "body": "Yes, I’ve been there in a couple of different ways over my illness and recovery. Prior to my eating disorder I was carefree, easy going and down to earth but the constant striving for perfection and achievement turned me into a very highly strung person, I was also extremely judgemental of others for what my disordered mind perceived as weakness, I developed a hateful competitive nature and had a constant drive to push my successes into peoples faces particularly if I knew it would hurt them. This part lingered on in me for years and actually became more intense as my recovery progressed, I suppose this filled a void in me that was being left behind as I moved away from disordered behaviours. I dealt with this in therapy over the last year and a half and I’ve really found my way back to myself, I feel I’ve been able to truly connect with myself and be who I really am for the first time since I was a teenager.\nThere was also a stage during my disorder that I realised I was a blank person. I had nothing to say, nothing to do or think about. I would wake up in the morning eat what I was allowed to that day then I could have spent the remainder of the day staring into space thinking about when I could eat again, nothing else even registered as slightly interesting. During that period of my life I don’t think I ever cried or felt any type of emotion, it was one of the most unsettling times for me.\n\nAre you engaging in therapy or taking steps toward recovery? For me personally I really needed that professional help to get through and it’s changed my life for the better",
      "created_utc": 1592056823.0,
      "score": 3,
      "context": []
    },
    {
      "id": "funt79c",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1592011852.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fuq10g9",
      "author": "AlliSpottsDeLazzer",
      "body": "Yep--for YEARS. Finally had to dump my frenemy, the eating disorder, and recover. She was a jerk who took my joy and memories...",
      "created_utc": 1592071555.0,
      "score": 2,
      "context": []
    },
    {
      "id": "funvxci",
      "author": "bumblej13",
      "body": "Thank you for this, I agree I’ve contacted a therapist I had previously agreed to seen (been avoiding it but hit breaking point today) my partner wants me to go to the drs but I’ve been before and was told ‘ED services won’t touch you your bmi is fine’. It was so embarrassing and Ive never wanted to go back since! \nBig thank you again, I feel like ED/BDD has become my whole being. I feel so tired and hopefully things will get better soon.",
      "created_utc": 1592013518.0,
      "score": 7,
      "context": [
        {
          "id": "funtvi8",
          "author": "MysticalWateryEye",
          "body": "Sometimes this is the point when there's that clarity of \"i need a higher level of care\" . If you can, i encourage you if you already aren't under the care of doctors for this etc, to try going to a doctor and seeing a therapist. It's extremely helpful.\n\nBut yeah, eating disorders take and take and take and take, and that's why realizing this is so important. It just takes a lot of time to chip away at the ED voice in your head, giving up some of that power. But it could be BDD kicking you extra hard, which complicates things, because it's so exhausting.",
          "created_utc": 1592012265.0
        }
      ]
    },
    {
      "id": "fuo63mc",
      "author": "Kaleidosun",
      "body": "Seeing a therapist is such a brave thing! Its the first step to living a life you deserve. \n\nAs for seeing a doctor, maybe ask this therapist for a doctor recommendation. It's likely he/she/they has other clients who see ED doctors. You'll want a doctor who is specially trained in eating disorders, as doctors outside of that area tend to only rely on bmi rather than actual health.",
      "created_utc": 1592020127.0,
      "score": 2,
      "context": [
        {
          "id": "funtvi8",
          "author": "MysticalWateryEye",
          "body": "Sometimes this is the point when there's that clarity of \"i need a higher level of care\" . If you can, i encourage you if you already aren't under the care of doctors for this etc, to try going to a doctor and seeing a therapist. It's extremely helpful.\n\nBut yeah, eating disorders take and take and take and take, and that's why realizing this is so important. It just takes a lot of time to chip away at the ED voice in your head, giving up some of that power. But it could be BDD kicking you extra hard, which complicates things, because it's so exhausting.",
          "created_utc": 1592012265.0
        },
        {
          "id": "funvxci",
          "author": "bumblej13",
          "body": "Thank you for this, I agree I’ve contacted a therapist I had previously agreed to seen (been avoiding it but hit breaking point today) my partner wants me to go to the drs but I’ve been before and was told ‘ED services won’t touch you your bmi is fine’. It was so embarrassing and Ive never wanted to go back since! \nBig thank you again, I feel like ED/BDD has become my whole being. I feel so tired and hopefully things will get better soon.",
          "created_utc": 1592013518.0
        }
      ]
    },
    {
      "id": "fupkfvz",
      "author": "MysticalWateryEye",
      "body": "Some doctors are still so shitty and triggering about that. If they bothered to look at diagnosing guidelines now, then they'd know bmi has nothing to do with diagnosing and ED, well i mean depending on case, BUT it's not a valid diagnostic ED tool anymore, nor should it have ever been. \n\nI'm so glad you are looking into seeing a therapist again, just having someone to vent it out too that is trained for it can make such a difference. I'm really proud of you.",
      "created_utc": 1592062439.0,
      "score": 2,
      "context": [
        {
          "id": "funtvi8",
          "author": "MysticalWateryEye",
          "body": "Sometimes this is the point when there's that clarity of \"i need a higher level of care\" . If you can, i encourage you if you already aren't under the care of doctors for this etc, to try going to a doctor and seeing a therapist. It's extremely helpful.\n\nBut yeah, eating disorders take and take and take and take, and that's why realizing this is so important. It just takes a lot of time to chip away at the ED voice in your head, giving up some of that power. But it could be BDD kicking you extra hard, which complicates things, because it's so exhausting.",
          "created_utc": 1592012265.0
        },
        {
          "id": "funvxci",
          "author": "bumblej13",
          "body": "Thank you for this, I agree I’ve contacted a therapist I had previously agreed to seen (been avoiding it but hit breaking point today) my partner wants me to go to the drs but I’ve been before and was told ‘ED services won’t touch you your bmi is fine’. It was so embarrassing and Ive never wanted to go back since! \nBig thank you again, I feel like ED/BDD has become my whole being. I feel so tired and hopefully things will get better soon.",
          "created_utc": 1592013518.0
        }
      ]
    }
  ]
}