{
  "id": "haghj1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1592354109.0,
  "title": "Request: How do I get into fitness without relapsing",
  "selftext": "So I(24F) have been mostly recovered with spurts of binging, purging, and restricting over the past couple years but it doesn’t consume my entire life like it used to. Instead of dieting I’ve found that just trying to eat whole natural foods, I only eat a few processed things, and that’s been working really well for me. I want to incorporate exercise so I can gain muscle and get stronger but it’s like when I do that I in turn want to restrict my food so I see results faster, then I get really hungry and binge thus starting the cycle, instead of being able to eat my normal healthy diet. I can’t seem to get both of those things in line together without obsessing over food again. If anyone has advice on getting over this hurdle I would so appreciate it! Thanks",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/haghj1/request_how_do_i_get_into_fitness_without/",
  "score": 81,
  "num_comments": 13,
  "comments": [
    {
      "id": "fv2pg6f",
      "author": "blondeoctopus",
      "body": "First of all, I STILL struggle with this, so take my advice with a grain of salt. I like to make a protein shake with full fat milk about twenty minutes before I work out. So I make it and drink it on the way to the gym, while I’m changing, and then I usually finish it when I start working out. I usually make it worth about 300 calories, which is how many my workouts usually report being on my watch. Then I’m not super hungry after. This is usually about three hours after lunch though, so a few hours before dinner. If it was closer to a meal, I’d probably do that after. I mostly do this to pace my calories and hunger, but also because it makes me not think about either too deeply. Obviously, I’m thinking about it now, but it takes the stress off in the moment, you know?",
      "created_utc": 1592355256.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fv2qeth",
      "author": "SweetBarista3",
      "body": "Hi! I have also struggled with this. Over the past year or so (after struggling with eating disorders from 12 yrs old to now 26), I’ve been slowly learning how to balance the both: eating enough and working out a normal amount. I spent many years starving myself, binging, and working out until I would pass out or be in a huge calorie deficit. Now, I eat a healthy, balanced, whole foods type diet w/out counting calories (not intentionally counting them at least) but sometimes I’ll retreat back to my old “need to workout more/harder/longer to punish myself and lose weight” mindset if I eat a little too much or something that’s not super healthy. I try to quickly stop myself the second I start having those thoughts and remind myself that I’m working out to stay healthy and to reward my body, not to punish or hurt myself. It’s a constant mental struggle, but I just practice positive affirmations and remind myself that I’m worth the health and happiness, and it’s getting easier every day. You are worth it, too!! \n\nI think the best way to start incorporating exercise is by setting a schedule up. Start with exercising 3-4 times a week and see how your body handles it, and then add another day if you need to. Make sure your schedule and exercises are manageable and appropriate for the amount you are eating and your daily lifestyle activities. Maybe like an hour hike or walk, or a couple mile run a few times a week. Incorporate weights and toning exercises to tone and keep your muscles strong. Stick to the schedule as best as you can but allow yourself all the grace and patience you need. If you miss a day or don’t feel up to working out, just skip it. Don’t eat less or punish yourself in other ways when you do need a break. Tomorrow will come and you’ll find the strength you need then to start again. \n\nGood luck!! 💜",
      "created_utc": 1592355818.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fv2z87c",
      "author": "None",
      "body": "So it took me forever to get back into exercise, every time I tried I would get obsessive again, burn myself out, and then stop going. It was a whole cycle. I want to say that having a good recovery foundation and support REALLY helped, above everything else. I was in recovery for almost 2 years before I started working out regularly again. \nWhat helped me was 1) finding a form of exercise that truly gives me joy- I started swimming early this year, and while I haven’t been able to swim in months bc Miss Rona stuck her head in, I remembered why I loved it so much as a kid and it’s probably the first form of exercise since I was a ballet dancer that just makes me HAPPY. \n\nThe second thing I did was start an actual program. I’ve NEVER been a runner, but last month I decided to sign up for a 5K. It isn’t until the fall and I’m following the None 2 Run program, which paces you SUPER well. The urge to do more and compete with myself more does rise up, but I’ve found it’s a lot easier to combat when I have a program telling me how much I should be progressing every time. \n\nThe idea behind the 5K for me was being proud of myself for something that is *entirely* good for me. Outside of recovery, I haven’t committed to anything in a hot minute. Over the years my mental and physical health declined so much that I turned into the biggest flake. I’m not a big fan of running while I’m doing it, but the endorphins and the joy I feel afterwards is amazing and really encourage me to keep doing it. Swimming was of course like that even more so, bc I never want to get out of the water.  This is something I’m doing for myself and not for my eating disorder. \n\nAnd I think that’s where the important bit lies- if you’re exercising for your ED, chances of it ever being healthy are slim. If you start exercising for yourself and because it gives you joy, it’s a positive reinforcement- in the long run it’s a lot more likely to influence you and cause change. So IMO finding something that rewards you beyond the ED voice saying you need to compensate or look a certain way- that’s the way to go!",
      "created_utc": 1592361075.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fv313gi",
      "author": "updown27",
      "body": "Awesome question!! Personally, I have a deal with myself. I ONLY work out AFTER all my meals are done for the day. My preferred exercise is indoor rock climbing so I will make a quick stop at home or bring a sandwich to work with me so I can eat early before I head to the gym. I am usually quite hungry after working out which is fine because I still have snack on the to do list but I don’t have to have a full meal. If I want to outdoor rock climb on my day off I just try my best to have my food prepared or at least a meal or go with people who will want to eat after so that I’m “peer pressured” into also eating lol. Best of luck!! So happy for how far you’ve come!\n\nEdit: after reading some comments I wanted to add that I only work out 2-4 times a week. I still see a dietician and therapist which keeps me honest. Setting boundaries for myself has really worked well.",
      "created_utc": 1592362192.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fv3rau6",
      "author": "fakeplasticturnips",
      "body": "Find something you really enjoy doing it was cycling for me. The fun of getting on my bike and wizzing along, focussing not on how my body was burning calories but on my technique. \nI found the same thing practicing yoga.",
      "created_utc": 1592382407.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fv44tba",
      "author": "zariaskoll",
      "body": "I struggle with this question to. I find that I only know how to motivate myself is to enter into a restrictive mindset then I have to stop exercising altogether to get my head straight",
      "created_utc": 1592395305.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fv2ngf9",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1592354109.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fv4g8qe",
      "author": "eviltatortot",
      "body": "if you still have a therapist or nutritionist or doctor you should talk to them first about working out. They can help you choose what intensity and duration you should focus on and is right for you. If you genuinely enjoy you should be able to if you are healthy to. Because exercise is still overall good for your health. (Obviously when done correctly and not taken to extreme) \n\nWhat I do is I let someone know that I am at the gym, or working out and if I don’t text back that I am done and if I don’t (within an hour or hour and a half) then I give them permission to blow up my phone. Usually letting someone know keeps more accountable that I don’t take it to an extreme because it causes a semi awkward conversation. My one friend from treatment and I do this all the time and we find it helpful. \n\nAlso I switch my focus about I want to work out because it helps me to be smaller (or other ED Thought) and focus more on I enjoy the activity, I feel better about myself, or i want to focus on my health.",
      "created_utc": 1592402658.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fv6k2h8",
      "author": "whateveridontcareeeo",
      "body": "So much easier said than done but finding a workout that’s like more fun and functional than doing monotonous reps and miles. I feel like In mindless workouts, my mind wanders to thinking about how many calories I’m burning etc etc but when I took up boxing, my goals weren’t calorie oriented but rather “how am I going to improve on this?” Or “how am I going to get better at the sport?” Instead of “how am I gonna get skinnier”. Find what makes you feel happy and have fun with that:)",
      "created_utc": 1592439531.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fvao7g1",
      "author": "oliviared52",
      "body": "Have you tried weight lifting? A few months into recovery I got into weight lifting and found that didn’t trigger my ED. It took me years to be able to start running again. \n\nBut weight lifting was awesome for my recovery because you have to be eating to see any improvement, it’s nice to know my food was going to muscles and that encouraged me to eat, and it’s really hard to know how many calories you’re burning. Triple win for me lol",
      "created_utc": 1592532445.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fv4cu3m",
      "author": "cone_hat_crown_crow",
      "body": "Me, too! A schedule has really been key. And I want to second making sure that the schedule and exercise are \"manageable and appropriate.\" I made the mistake of overdoing it when I initially came back to exercising and really hurt myself. For some context, I was focused on running and, even though I've never been a runner, I quickly increased my mileage from 0 miles per week to between 4-6 miles per day. My hips and shins did not like that! I hurt myself to the point where it was painful to walk for months. So! Go slowly! With anything you start.\n\nI've been able to start back running and, after about a month of getting back into it, I'm just now doing 2 miles every other day. My body feels great! I'm a little frustrated with the slowness of it all, but I try to focus on how well I'm doing this time around. I've also mixed my routine with yoga and icing (my shins, specifically). On top of that, I've tried to focus my attention on small exercise-related goals and how I feel, rather than on my general level of fitness or how my body looks. For example, I went from running 1 mile every other day to 2. My next goal is to start to incorporate 3 miles into my schedule - starting with one day per week and then slowly building. Another goal I had was around boat pose, for yoga (i.e., can I do it without having to hold my legs? This took about two weeks). And one last goal was around plank - can I hold myself up for 30 seconds? I had super weak wrists / lots of wrist pain when I started, but, after a month, I can plank without pain.\n\nAnd don't worry about missing exercise days! I take a day off when I'm not into it. It took me 20-something days to do 15 days of yoga lol Good luck!\n\nEdit: Oh, yeah, as far as eating - I have found that I get hungrier one days I exercise more, like when I run + yoga, rather than just yoga or rather than my off days. I'm trying to get more in tune with my body around eating, but that can be hard. I do have a new bowl that I like eating with.  If I want a snack, or want to eat a meal, I'll often start with this bowl. Once I've finished one bowl of whatever, I evaluate, \"Am I still hungry?\" And, when I'm still. hungry, I get seconds! For me, at least, this has helped avoid restricting - since I'm letting myself eat, if I feel hungry - and bingeing - since I just start with the bowl and then reevaluate from there.",
      "created_utc": 1592400697.0,
      "score": 3,
      "context": [
        {
          "id": "fv2qeth",
          "author": "SweetBarista3",
          "body": "Hi! I have also struggled with this. Over the past year or so (after struggling with eating disorders from 12 yrs old to now 26), I’ve been slowly learning how to balance the both: eating enough and working out a normal amount. I spent many years starving myself, binging, and working out until I would pass out or be in a huge calorie deficit. Now, I eat a healthy, balanced, whole foods type diet w/out counting calories (not intentionally counting them at least) but sometimes I’ll retreat back to my old “need to workout more/harder/longer to punish myself and lose weight” mindset if I eat a little too much or something that’s not super healthy. I try to quickly stop myself the second I start having those thoughts and remind myself that I’m working out to stay healthy and to reward my body, not to punish or hurt myself. It’s a constant mental struggle, but I just practice positive affirmations and remind myself that I’m worth the health and happiness, and it’s getting easier every day. You are worth it, too!! \n\nI think the best way to start incorporating exercise is by setting a schedule up. Start with exercising 3-4 times a week and see how your body handles it, and then add another day if you need to. Make sure your schedule and exercises are manageable and appropriate for the amount you are eating and your daily lifestyle activities. Maybe like an hour hike or walk, or a couple mile run a few times a week. Incorporate weights and toning exercises to tone and keep your muscles strong. Stick to the schedule as best as you can but allow yourself all the grace and patience you need. If you miss a day or don’t feel up to working out, just skip it. Don’t eat less or punish yourself in other ways when you do need a break. Tomorrow will come and you’ll find the strength you need then to start again. \n\nGood luck!! 💜",
          "created_utc": 1592355818.0
        }
      ]
    },
    {
      "id": "fv3hjmy",
      "author": "brittanica_7",
      "body": "I second this!! I found it really helpful myself to find an activity that didn’t feel like exercise for the sake of it! You could try a dance class or learn a martial art, there’s so many resources online to find something you’re interested in! \nThis way you can kind of separate yourself from fitness culture that can be quite triggering for EDs, but still grow stronger. You can do it because you love it, and honor yourself with movement. \nGood luck, you’ve got this!",
      "created_utc": 1592373527.0,
      "score": 3,
      "context": [
        {
          "id": "fv2z87c",
          "author": "None",
          "body": "So it took me forever to get back into exercise, every time I tried I would get obsessive again, burn myself out, and then stop going. It was a whole cycle. I want to say that having a good recovery foundation and support REALLY helped, above everything else. I was in recovery for almost 2 years before I started working out regularly again. \nWhat helped me was 1) finding a form of exercise that truly gives me joy- I started swimming early this year, and while I haven’t been able to swim in months bc Miss Rona stuck her head in, I remembered why I loved it so much as a kid and it’s probably the first form of exercise since I was a ballet dancer that just makes me HAPPY. \n\nThe second thing I did was start an actual program. I’ve NEVER been a runner, but last month I decided to sign up for a 5K. It isn’t until the fall and I’m following the None 2 Run program, which paces you SUPER well. The urge to do more and compete with myself more does rise up, but I’ve found it’s a lot easier to combat when I have a program telling me how much I should be progressing every time. \n\nThe idea behind the 5K for me was being proud of myself for something that is *entirely* good for me. Outside of recovery, I haven’t committed to anything in a hot minute. Over the years my mental and physical health declined so much that I turned into the biggest flake. I’m not a big fan of running while I’m doing it, but the endorphins and the joy I feel afterwards is amazing and really encourage me to keep doing it. Swimming was of course like that even more so, bc I never want to get out of the water.  This is something I’m doing for myself and not for my eating disorder. \n\nAnd I think that’s where the important bit lies- if you’re exercising for your ED, chances of it ever being healthy are slim. If you start exercising for yourself and because it gives you joy, it’s a positive reinforcement- in the long run it’s a lot more likely to influence you and cause change. So IMO finding something that rewards you beyond the ED voice saying you need to compensate or look a certain way- that’s the way to go!",
          "created_utc": 1592361075.0
        }
      ]
    },
    {
      "id": "fvjq7s1",
      "author": "None",
      "body": "I totally agree with this! Yoga has helped to change my relationship with exercise completely. The shift in mindset definitely took a while, but in time I found that I had gone from focusing solely on calorie burn, to more of a focus on physical and mental strength and doing things that bring me happiness. The first time I was able to hold crow pose was surreal- I had spent years doing mostly cardio 4-5 times a week and never would have even dreamed of having an upper body and core that were strong enough to support me. The supportive, calming, and accepting atmosphere of a yoga class make it even better.\n\nThis shift carried over to running for me as well- I also started focusing more on mileage goals and making a schedule/routine to help in achieving them. Though you can't really do it now because of Coronavirus- signing up for races is great motivation, and passing that finish line makes it all the more exciting.\n\nAs much as I can (and yes, I still occasionally struggle with this), I try to remind myself that my body is strong and awesome for being able to power through a flow yoga class and achieve new poses, or to carry me \"x\" amount of miles- and that food is fuel to help in achieving these things.",
      "created_utc": 1592755377.0,
      "score": 3,
      "context": [
        {
          "id": "fv2qeth",
          "author": "SweetBarista3",
          "body": "Hi! I have also struggled with this. Over the past year or so (after struggling with eating disorders from 12 yrs old to now 26), I’ve been slowly learning how to balance the both: eating enough and working out a normal amount. I spent many years starving myself, binging, and working out until I would pass out or be in a huge calorie deficit. Now, I eat a healthy, balanced, whole foods type diet w/out counting calories (not intentionally counting them at least) but sometimes I’ll retreat back to my old “need to workout more/harder/longer to punish myself and lose weight” mindset if I eat a little too much or something that’s not super healthy. I try to quickly stop myself the second I start having those thoughts and remind myself that I’m working out to stay healthy and to reward my body, not to punish or hurt myself. It’s a constant mental struggle, but I just practice positive affirmations and remind myself that I’m worth the health and happiness, and it’s getting easier every day. You are worth it, too!! \n\nI think the best way to start incorporating exercise is by setting a schedule up. Start with exercising 3-4 times a week and see how your body handles it, and then add another day if you need to. Make sure your schedule and exercises are manageable and appropriate for the amount you are eating and your daily lifestyle activities. Maybe like an hour hike or walk, or a couple mile run a few times a week. Incorporate weights and toning exercises to tone and keep your muscles strong. Stick to the schedule as best as you can but allow yourself all the grace and patience you need. If you miss a day or don’t feel up to working out, just skip it. Don’t eat less or punish yourself in other ways when you do need a break. Tomorrow will come and you’ll find the strength you need then to start again. \n\nGood luck!! 💜",
          "created_utc": 1592355818.0
        },
        {
          "id": "fv4cu3m",
          "author": "cone_hat_crown_crow",
          "body": "Me, too! A schedule has really been key. And I want to second making sure that the schedule and exercise are \"manageable and appropriate.\" I made the mistake of overdoing it when I initially came back to exercising and really hurt myself. For some context, I was focused on running and, even though I've never been a runner, I quickly increased my mileage from 0 miles per week to between 4-6 miles per day. My hips and shins did not like that! I hurt myself to the point where it was painful to walk for months. So! Go slowly! With anything you start.\n\nI've been able to start back running and, after about a month of getting back into it, I'm just now doing 2 miles every other day. My body feels great! I'm a little frustrated with the slowness of it all, but I try to focus on how well I'm doing this time around. I've also mixed my routine with yoga and icing (my shins, specifically). On top of that, I've tried to focus my attention on small exercise-related goals and how I feel, rather than on my general level of fitness or how my body looks. For example, I went from running 1 mile every other day to 2. My next goal is to start to incorporate 3 miles into my schedule - starting with one day per week and then slowly building. Another goal I had was around boat pose, for yoga (i.e., can I do it without having to hold my legs? This took about two weeks). And one last goal was around plank - can I hold myself up for 30 seconds? I had super weak wrists / lots of wrist pain when I started, but, after a month, I can plank without pain.\n\nAnd don't worry about missing exercise days! I take a day off when I'm not into it. It took me 20-something days to do 15 days of yoga lol Good luck!\n\nEdit: Oh, yeah, as far as eating - I have found that I get hungrier one days I exercise more, like when I run + yoga, rather than just yoga or rather than my off days. I'm trying to get more in tune with my body around eating, but that can be hard. I do have a new bowl that I like eating with.  If I want a snack, or want to eat a meal, I'll often start with this bowl. Once I've finished one bowl of whatever, I evaluate, \"Am I still hungry?\" And, when I'm still. hungry, I get seconds! For me, at least, this has helped avoid restricting - since I'm letting myself eat, if I feel hungry - and bingeing - since I just start with the bowl and then reevaluate from there.",
          "created_utc": 1592400697.0
        }
      ]
    }
  ]
}