{
  "id": "hbya3w",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1592562410.0,
  "title": "Request: Advice on two daughters with ED",
  "selftext": "I have a 16f recovering from ED, and 13f with new ED.  The 16 yo is backsliding because the younger one is always screaming about how she can’t eat things that will make her fat.  We need to take the younger one for residential in NC, but are unsure if it helps or hurts to take the older one with us.  My wife would stay with the 13f in NC, but I have to stay in OH for work\n\nTLDR: should the 16f stay with me in OH for next 6 weeks, or go with mom and 13f to NC?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hbya3w/request_advice_on_two_daughters_with_ed/",
  "score": 62,
  "num_comments": 11,
  "comments": [
    {
      "id": "fvbsz46",
      "author": "f-f-fuckit",
      "body": "Honestly think you should ask her and talk it through with her. She’s 16 and absolutely old enough to have some input.",
      "created_utc": 1592565867.0,
      "score": 62,
      "context": []
    },
    {
      "id": "fvc50o0",
      "author": "None",
      "body": "I would talk to the 16F and her current therapist.",
      "created_utc": 1592574317.0,
      "score": 23,
      "context": []
    },
    {
      "id": "fvcsz1l",
      "author": "hemphighness",
      "body": "I was only trying to help. As 30F it took me years to overcome the mental and only so much love helps. It starts with loving yourself I never loved myself enough until I saw my own life and mind as a beautiful thing and I did this through learning nutrition and brain health. Forcing yourself to eat berries in the morning when you’d rather not eat at all simply because they are crazy good for the brain is harder than it looks for some of us. But yeah you know better than I do clearly.",
      "created_utc": 1592586711.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fvdcea0",
      "author": "the_scientist52",
      "body": "As someone who struggles **so much** with comparisons and feeling competitive with other ED sufferers, I'd definitely recommend keeping the older one home.  Give her time to focus on herself in an environment that doesn't revolve around her sister's treatment.  Allow her to have your attention, and focus on building her life and her identity without her sister's ED pulling her back into a dark place.  Being separate from everything that's going on with her sister could do her wonders.",
      "created_utc": 1592596284.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fvdhnxg",
      "author": "zebra223",
      "body": "I'm so happy to see a parent trying to help their children with this kind of issue. I'm sure there are a lot of parents who don't even notice their children's eating disorder. \n\nI think the 16f should stay with you. I don't think to remind her of the journey she had once gone through is good for her.",
      "created_utc": 1592598907.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fveixzp",
      "author": "None",
      "body": "As a 16 y/o with an ed, if I was backsliding because of my sister I would not want to be kept near her in case I fully relapse. I would want to be kept in the loop and have my opinion heard as well as my own options taken into consideration. Talk to her and let her decide what to do and what she and her therapist thinks will be best for her recovery process.",
      "created_utc": 1592620616.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fve6233",
      "author": "anonymouseds",
      "body": "Is there a reason the younger one has to do residential out of state? There are several ED programs in Ohio, including the Emily Program. Is the 16 year old in treatment? Because she should be getting some sort of treatment/therapy. I know the Emily Program does inpatient, residential, as well as outpatient treatment depending on the level of care needed.",
      "created_utc": 1592612623.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fvbp9jh",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1592562411.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fvdk2sz",
      "author": "eviltatortot",
      "body": "Some backsliding is normal in recovery because in my experience it is far from a linear straight line. If I was 16 it would be really triggering to hear and see something like that. \n\nI don’t want to give you advice on what to do with your daughter but you should have some in-depth discussion with your 16 year old. I think it is best to remind her you care about her recovery and her health just as much as your other daughter. If she has a therapist it is a good idea to call he or she to be more aware of the situation if he or she isn’t already aware and can help look out for your 16 year old. \n\nSome separation from the two may be better or it may not. It kinda depends on your 16 year old. I’m happy that they both have received help now compared to later. Everyone in recovery find different things helpful and non helpful so what helps your 16 year old may not help your 13 year old and vice versa. I am glad that you are a supportive parent in their recovery and not taking it as a phase or something of that sort. I wish the best the luck for your two daughters and you too because it can be exhausting.\n\nAlso take care of yourself because they look up to you. Idk if you do this, but it is a good idea to  reframe from saying things like “oh I look fat” or “I need to watch my weight”, etc. idk if you do or not.  Practice self care and that such because they look up to you as a parent. Also it is very mentally exhausting for your situation. In the end, you can’t care for them if you can’t care for yourself kinda thing. \n\nTLDR: talk to their treatment team, talk to your daughter about it, and get her a therapist if she doesn’t have one, also take care of yourself because it is a difficult situation for any parent.",
      "created_utc": 1592600142.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fvcii8l",
      "author": "hemphighness",
      "body": "How much do they know about nutrition? Do they know the 3 main macro nutrients? As someone who has struggled with ED for most of my life I have found education on nutrition to be extremely beneficial. I recommend the book the neurogenesis diet and lifestyle by brant cortright phd - it discusses the brain and how to keep a healthy brain and body. Everything they are experiencing is mental first. Change the mind and you can better change the body. \nHope this helps. Best of luck. Sending strength your way.",
      "created_utc": 1592581511.0,
      "score": -4,
      "context": []
    },
    {
      "id": "fvclxgq",
      "author": "None",
      "body": "I know you mean well but EDs are not really rational. I’m not saying nutritional info can’t help, but right now they need less general info and more personal attention. They can worry about nutrition once they’re in a better mental state.",
      "created_utc": 1592583227.0,
      "score": 14,
      "context": [
        {
          "id": "fvcii8l",
          "author": "hemphighness",
          "body": "How much do they know about nutrition? Do they know the 3 main macro nutrients? As someone who has struggled with ED for most of my life I have found education on nutrition to be extremely beneficial. I recommend the book the neurogenesis diet and lifestyle by brant cortright phd - it discusses the brain and how to keep a healthy brain and body. Everything they are experiencing is mental first. Change the mind and you can better change the body. \nHope this helps. Best of luck. Sending strength your way.",
          "created_utc": 1592581511.0
        }
      ]
    }
  ]
}