{
  "id": "hd89uk",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1592751473.0,
  "title": "Request: My success story",
  "selftext": " \n\nQuickly recapping over the past 2 years now, I went through a really hard time starving myself then it reversed last summer and I binge ate every day just to fall asleep so I wouldn’t be awake because the feeling was so terrible. I was not only in a hard battle with my eating and finding balance but I was mourning my mother (still am), along with a breakup. So it was terror to say the least it went straight to suicidal thoughts.\n\nI am now a month away from my goal weight and I’m in a MUCH better place. But you NEED to know I’m doing it healthily. Once you maybe meditate in your own way and let go of what you think needs to be and just jump into practicing balance it becomes SO much easier. Maybe even book a trip or something of the sort and use that as motivation to start (because I know that motivation is very hard to conjure up when battling an eating disorder). One of the hardest things in my eyes with an eating disorder is finding balance, coincidentally I struggle with balance in all areas of my life. The change starts with you but you must first push yourself through everything. I do have my bad days but I usually notice my bad days the second I wake up In the morning and if I’m not working, I’ll make some plans and be sure to eat something before and keep my mind busy through out the day.\n\nBe well and healthy all if I’m still here I’m proof you can do it too! :)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hd89uk/request_my_success_story/",
  "score": 41,
  "num_comments": 4,
  "comments": [
    {
      "id": "fvjq6kd",
      "author": "oliviared52",
      "body": "Proud of you!!! I suffered from anorexia and bulimia for years. I never thought I would get over it. I thought it would be with me forever and even got to the point if I died from it then so be it. It’s interesting how starving yourself makes you feel good at first then way more depressed than you were before. After trying to recover many time, finally my senior year of college I was done. I was done wasting my life and my time on this disease. I felt I could have accomplished so much if I had spent the time I spent on my disorder on anything else. At first I gained a decent amount of weight as my body held on to everything, but then I started weight lifting and it came right off. I genuinely love my body today. I eat what I want when I want just make sure to not stuff myself. \n\nSometimes I get sad thinking of all the time I wasted on my disorder. People say college was the best time of their life but for me it was my worse because it’s when my disorder was at it’s worse. But I don’t regret it. I’m happy it shaped me into who I am today. Sometimes eating disorder thoughts will creep back in but I can recognize those thoughts are not mine they are the ED. \n\nThank you for sharing your story. Hope it’s ok I added mine! Thought it might be nice to have a thread with a few success stories? \n\nI think going through and recovering from an ED has made me a more empathetic and understanding person.",
      "created_utc": 1592755358.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fvjjj5o",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1592751474.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fvkmw8y",
      "author": "caponsigrayina",
      "body": "This post was like looking in a mirror for me. Really helpful. Thank you! I am so happy you are doing well!",
      "created_utc": 1592773167.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fvkq2tp",
      "author": "Fufala",
      "body": "Yes, I think the same. I became more gentle and understanding towards myself and others too. \n\nFor me, it took ten years on and off and a lot of work on myself that now I don't mind at all. Looking back, I can accept it as part of my past and feel empathy towards myself. It was a malicious coping mechanism with problems and emotions I couldn't process better.",
      "created_utc": 1592774928.0,
      "score": 2,
      "context": [
        {
          "id": "fvjq6kd",
          "author": "oliviared52",
          "body": "Proud of you!!! I suffered from anorexia and bulimia for years. I never thought I would get over it. I thought it would be with me forever and even got to the point if I died from it then so be it. It’s interesting how starving yourself makes you feel good at first then way more depressed than you were before. After trying to recover many time, finally my senior year of college I was done. I was done wasting my life and my time on this disease. I felt I could have accomplished so much if I had spent the time I spent on my disorder on anything else. At first I gained a decent amount of weight as my body held on to everything, but then I started weight lifting and it came right off. I genuinely love my body today. I eat what I want when I want just make sure to not stuff myself. \n\nSometimes I get sad thinking of all the time I wasted on my disorder. People say college was the best time of their life but for me it was my worse because it’s when my disorder was at it’s worse. But I don’t regret it. I’m happy it shaped me into who I am today. Sometimes eating disorder thoughts will creep back in but I can recognize those thoughts are not mine they are the ED. \n\nThank you for sharing your story. Hope it’s ok I added mine! Thought it might be nice to have a thread with a few success stories? \n\nI think going through and recovering from an ED has made me a more empathetic and understanding person.",
          "created_utc": 1592755358.0
        }
      ]
    }
  ]
}