{
  "id": "hfy40k",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1593133493.0,
  "title": "Request: Need help for my son (M15)",
  "selftext": "Need help for my son (M15)\n\nMy son came home recently from a socially distanced (UK) outing with his girlfriend.  She shared with him she may have ED tendencies including 1) vomiting after meals, 2) anxiety when too much food is served to her on her plate.  I’m looking for guidance to share with him.\n\n1) how to respond to GF?\n2) what resources there are for her in the UK (we are recent immigrants)\n3) how long before we adults intervene?  He says the relationship will be over if we raise with her parents (which I am ready to do when needed?\n4) what support should we offer him?\n\nShe shared COVID isolation has made her situation more challenging.  Any thoughts welcome.\n\nTLDR: son’s girlfriend may have ED, seeking help.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hfy40k/request_need_help_for_my_son_m15/",
  "score": 50,
  "num_comments": 18,
  "comments": [
    {
      "id": "fw10k9h",
      "author": "timeforbedplease",
      "body": "The idea of someone telling my parent that I have an ED is somewhat difficult for me to be okay with, that being said support and intervention are necessary. Her opening up to your son about this is a big step. Being able to confide in him about this could be a sign that she wants help, or at least recognizes these behaviors as detrimental. I am not in the UK so I can't speak to specific resources, but I will say that there is a lot of information available as to how to support someone with an ED. \n\nThe most helpful thing that my partner has done to help support me is to simply ask \"how involved do you want me to be?\" and \"what can I do to help you get better?\" It might seem like the right move is for you to intervene because she is a minor, but I do have concerns that this would take away her control and privacy. Recovery is most successful when the person seeks it for themselves. Another thing to keep in mind is not everyone is as understanding when it comes to ED, and many people aren't educated wl on the topic, enough to approach the discussion in a healthy and meaningful way. I've attached some links that may be a good place to start. You and your son sound like awesome people, I wish I had someone looking out for me the way you are when I was her age!\n\nLinks:\nhttps://www.nhs.uk/live-well/healthy-weight/supporting-someone-with-an-eating-disorder/\n\nhttps://anad.org/education-and-awareness/about-eating-disorders/how-to-help-a-loved-one/\n\nhttps://www.beateatingdisorders.org.uk/supporting-someone/supporting-somebody",
      "created_utc": 1593143527.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fw1d2rf",
      "author": "None",
      "body": "1: Accept her as she is, “I don’t know exactly what you’re going through but I’m willing to stick with you as you go through it. I don’t think less of you for struggling. I hope you can seek help but if that’s not possible, know that I’m in your corner”\n\n2: idk I don’t live in the UK. I’ve heard of BEAT before\n\n3Intervene pretty much if she’s suicidal, shares that she’s vomiting blood, having seizures, etc. often times parents are more harm than help and you don’t know what her home life is like. My mom was the main reason I became bulimjc\n\n4: if he seems stressed, support him and encourage him to open up. Make sure he’s not giving too much to this girl to the point where there’s nothing left.",
      "created_utc": 1593152798.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fw10qkz",
      "author": "badgerhoneyy",
      "body": "Heya, that sounds like quite difficult situation for everyone. Obviously your son and you both want to do the right thing by her. I would suggest against going straight to her parents, and depending on the relationships with everyone (and social distancing ofc) maybe try to chat to her about it and see if she is currently getting any help. \n\nShe can raise this with anyone at her school / college if shes goes to school, or she can chat to her GP.  [https://www.beateatingdisorders.org.uk/recovery-information/going-to-the-doctor](https://www.beateatingdisorders.org.uk/recovery-information/going-to-the-doctor) has some great resources for these types of conversations if you think they're appropriate. \n\nDon't break her trust without first encouraging her to reach out for herself, but know that at the end of the day you cannot be responsible for her. I hope this helps.",
      "created_utc": 1593143643.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fw1ty6s",
      "author": "GrandVizierofAgrabar",
      "body": "The NHS services for eating disorders varies massively by area but the first step to accessing them is a referral to CAMHS (Children’s mental health) either through her GP or through a self referral.  They will do an initial assessment within days, if she is judged high risk then she will be accepted for treatment within five days, otherwise it can take longer but shouldn’t be more than two weeks but no more than four weeks.\n\nI would encourage you to gently persuade her to ask for treatment as I know how damaging Eating Disorders are, her being truthful with your son is a good indication that she herself is worried.  Bare in mind that if her medical team believe her to be at risk, they may have to inform her parents or her school.",
      "created_utc": 1593168816.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fw1z3e7",
      "author": "nastrals",
      "body": "I think firstly your son deserves some credit for her willingness to open up to him. It’s not an easy thing to do so she must trust him. \nIn the U.K. there is https://www.beateatingdisorders.org.uk who I have had experience with. Assuming she is a similar age to your son it’s important he encourages her to speak to her GP as support as you get older is hard to access however he needs to do that in a supportive encouraging way not in an accusatory way. \nI would check it the BEAT website as it has lots of useful information.",
      "created_utc": 1593173084.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fw0rvfl",
      "author": "JazzMoneyyy",
      "body": "I would honestly suggest taking the time to reach out to her and ask her about what’s going on, tell her you want to help. Encourage her to see a dietician, and just try to be there for her because she may not have anyone else who cares. That’s what my boyfriend’s mom did for me, and it helped me start my recovery. Thanks for reaching out ❤️",
      "created_utc": 1593138073.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fw0kb2c",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1593133493.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fw1r5ek",
      "author": "Ari3n3tt3",
      "body": "if she has a good relationship with her family I would talk to them about it in a casual way just to say you noticed those things and would want to know if it had been your son acting like that.\n\nIf she doesn't have a good relationship with her family and you would be comfortable supporting her through it if she does have an issue then I would try to sit her down and ask about it.. although.. eating disorders come with a lot of deceptive behavior and if you scare her with the confrontation/she isn't ready for it she might just get better at hiding it\n\nWhat you can do for sure is talk to your son and make sure he's doing ok. 15 is young and things can be really intense during that time.. I'd be worried about him taking on a caretaker role and would just want to make sure he has boundaries and understands that you can't help people who won't help themselves and that doesn't make either of the people involved bad",
      "created_utc": 1593166116.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fw2vslh",
      "author": "liddig",
      "body": "I live in the UK and have been involved in ED services, sadly there is a long wait for help but as she is under 18 it is better! My first advice would be for your son to help persuade her to talk to her GP and parents if possible. The GP will do blood tests and measure her vitals, I was very ill from purging and it can affect your heart and everything.\nThe GP will then refer her to CAMHS and the ED service to monitor her and it will be good for her to get on the system. I have had help for four years now in the uk and depending on where you are in the country the help can be great!\nBEAT is also great and there are a lot of charities online",
      "created_utc": 1593190922.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fw0yli5",
      "author": "AlliSpottsDeLazzer",
      "body": "I wonder why she shared it if not maybe a cry for help. Not sure if she's a minor from this, but if so, what would YOU want if you were the mother? UK organization is BEAT. Maybe start there.",
      "created_utc": 1593142242.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fw171tm",
      "author": "None",
      "body": "It definitely sounds like she sufferers from anorexia with bulimic tendencies - as I do. I would recommend talking with her parents as a first point of call. Or perhaps, first suggest to your son to encourage her to do so herself.   \n\n\nUnfortunately I don't live in the UK so don't have any idea in regards to the health system over there - but I wish you the best of luck! You're doing the right thing.   \n\n\nEmma x",
      "created_utc": 1593148035.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fw4byq0",
      "author": "None",
      "body": "Tell her parents. Please. This is a life ruining disease. I wish I’d been outed years ago",
      "created_utc": 1593217747.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fw4u4c9",
      "author": "None",
      "body": "First off, sounds like your son really likes this girl.  I’m guessing your son talked to you. \n\nThis reality, an eating disorder is an addiction.  To some  people they were predisposed genetically to have an eating disorder, but those cases are very few.  Most cases come from a poor upbringing, poor boundaries and the person with an eating disorder like any addiction has no who they are and how they got into that mess of trying to control their body.\n\nI feel bad for you son because he sounds like he feels responsible to rescue her.  You really want to be observant and ask your son why he’s focusing on other people instead of himself.  \n\nPlease know it is not your job to help someone even doctors don’t save, they can’t they give enough information so the patient does all the work on their own.  \n\nYou have to make a tough call and focus on your boundaries, if you already have enough on your plate what are you willing to prioritize.  Addicts are self destructive and addicts should not be focusing on relationships instead get as much help, be self sufficient so they can be strong for any relationship.  \n\nThese are some tough decisions.  You help her, she becomes dependent and you guys will end up resenting each other because you have poor boundaries.  What are your boundaries?  Figure that out first and then talk to your son about them and figure out a plan for you and your son first and then research helplines and suggest them to the person with the eating disorder.  \n\nThe only way you can address the elephant in the room, the addict is confronting kindly, sitting them down and listing your boundaries and being firm on them.\n\nLet’s be real here, your son has pretty poor boundaries and he learned them from you otherwise you would be blindsided coming to reddit asking questions.",
      "created_utc": 1593229226.0,
      "score": -1,
      "context": []
    },
    {
      "id": "fw4ujfe",
      "author": "None",
      "body": "Please know I know you mean well but if you still have you eating disorder, you are in no healthy head space to provide anything but the addiction you feel right now.  Your educated on the addiction of your eating disorder and you’ve made this addiction your identity.  The day you want to recovery will you focus on eating disorder recovery.  \n\nFrom your perspective you’re needy because you don’t know how to get over your addiction, this advice is not helpful for the mom and son.  You want an addict to learn how to be self sufficient.  I hope you have your team psychiatrist, dietitian most importantly therapist to unpack what got you into an eating disorder and hopefully end goal to find YOUR identity and not the eating disorder.\n\nBtw, great links but focus on you.  You deserve it.",
      "created_utc": 1593229520.0,
      "score": -2,
      "context": [
        {
          "id": "fw10k9h",
          "author": "timeforbedplease",
          "body": "The idea of someone telling my parent that I have an ED is somewhat difficult for me to be okay with, that being said support and intervention are necessary. Her opening up to your son about this is a big step. Being able to confide in him about this could be a sign that she wants help, or at least recognizes these behaviors as detrimental. I am not in the UK so I can't speak to specific resources, but I will say that there is a lot of information available as to how to support someone with an ED. \n\nThe most helpful thing that my partner has done to help support me is to simply ask \"how involved do you want me to be?\" and \"what can I do to help you get better?\" It might seem like the right move is for you to intervene because she is a minor, but I do have concerns that this would take away her control and privacy. Recovery is most successful when the person seeks it for themselves. Another thing to keep in mind is not everyone is as understanding when it comes to ED, and many people aren't educated wl on the topic, enough to approach the discussion in a healthy and meaningful way. I've attached some links that may be a good place to start. You and your son sound like awesome people, I wish I had someone looking out for me the way you are when I was her age!\n\nLinks:\nhttps://www.nhs.uk/live-well/healthy-weight/supporting-someone-with-an-eating-disorder/\n\nhttps://anad.org/education-and-awareness/about-eating-disorders/how-to-help-a-loved-one/\n\nhttps://www.beateatingdisorders.org.uk/supporting-someone/supporting-somebody",
          "created_utc": 1593143527.0
        }
      ]
    },
    {
      "id": "fw4un0h",
      "author": "None",
      "body": "She has an addiction, that is self destruction.  That is very dangerous to be around someone self destructive.\n\nI know you mean well, but how does someone accept someone who has no idea who they are?  That is how toxic relationships are made because they are lost.",
      "created_utc": 1593229590.0,
      "score": -1,
      "context": [
        {
          "id": "fw1d2rf",
          "author": "None",
          "body": "1: Accept her as she is, “I don’t know exactly what you’re going through but I’m willing to stick with you as you go through it. I don’t think less of you for struggling. I hope you can seek help but if that’s not possible, know that I’m in your corner”\n\n2: idk I don’t live in the UK. I’ve heard of BEAT before\n\n3Intervene pretty much if she’s suicidal, shares that she’s vomiting blood, having seizures, etc. often times parents are more harm than help and you don’t know what her home life is like. My mom was the main reason I became bulimjc\n\n4: if he seems stressed, support him and encourage him to open up. Make sure he’s not giving too much to this girl to the point where there’s nothing left.",
          "created_utc": 1593152798.0
        }
      ]
    },
    {
      "id": "fw50wxc",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1593234237.0,
      "score": 1,
      "context": [
        {
          "id": "fw10k9h",
          "author": "timeforbedplease",
          "body": "The idea of someone telling my parent that I have an ED is somewhat difficult for me to be okay with, that being said support and intervention are necessary. Her opening up to your son about this is a big step. Being able to confide in him about this could be a sign that she wants help, or at least recognizes these behaviors as detrimental. I am not in the UK so I can't speak to specific resources, but I will say that there is a lot of information available as to how to support someone with an ED. \n\nThe most helpful thing that my partner has done to help support me is to simply ask \"how involved do you want me to be?\" and \"what can I do to help you get better?\" It might seem like the right move is for you to intervene because she is a minor, but I do have concerns that this would take away her control and privacy. Recovery is most successful when the person seeks it for themselves. Another thing to keep in mind is not everyone is as understanding when it comes to ED, and many people aren't educated wl on the topic, enough to approach the discussion in a healthy and meaningful way. I've attached some links that may be a good place to start. You and your son sound like awesome people, I wish I had someone looking out for me the way you are when I was her age!\n\nLinks:\nhttps://www.nhs.uk/live-well/healthy-weight/supporting-someone-with-an-eating-disorder/\n\nhttps://anad.org/education-and-awareness/about-eating-disorders/how-to-help-a-loved-one/\n\nhttps://www.beateatingdisorders.org.uk/supporting-someone/supporting-somebody",
          "created_utc": 1593143527.0
        },
        {
          "id": "fw4ujfe",
          "author": "None",
          "body": "Please know I know you mean well but if you still have you eating disorder, you are in no healthy head space to provide anything but the addiction you feel right now.  Your educated on the addiction of your eating disorder and you’ve made this addiction your identity.  The day you want to recovery will you focus on eating disorder recovery.  \n\nFrom your perspective you’re needy because you don’t know how to get over your addiction, this advice is not helpful for the mom and son.  You want an addict to learn how to be self sufficient.  I hope you have your team psychiatrist, dietitian most importantly therapist to unpack what got you into an eating disorder and hopefully end goal to find YOUR identity and not the eating disorder.\n\nBtw, great links but focus on you.  You deserve it.",
          "created_utc": 1593229520.0
        }
      ]
    },
    {
      "id": "fw51ul6",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1593234990.0,
      "score": 1,
      "context": [
        {
          "id": "fw10k9h",
          "author": "timeforbedplease",
          "body": "The idea of someone telling my parent that I have an ED is somewhat difficult for me to be okay with, that being said support and intervention are necessary. Her opening up to your son about this is a big step. Being able to confide in him about this could be a sign that she wants help, or at least recognizes these behaviors as detrimental. I am not in the UK so I can't speak to specific resources, but I will say that there is a lot of information available as to how to support someone with an ED. \n\nThe most helpful thing that my partner has done to help support me is to simply ask \"how involved do you want me to be?\" and \"what can I do to help you get better?\" It might seem like the right move is for you to intervene because she is a minor, but I do have concerns that this would take away her control and privacy. Recovery is most successful when the person seeks it for themselves. Another thing to keep in mind is not everyone is as understanding when it comes to ED, and many people aren't educated wl on the topic, enough to approach the discussion in a healthy and meaningful way. I've attached some links that may be a good place to start. You and your son sound like awesome people, I wish I had someone looking out for me the way you are when I was her age!\n\nLinks:\nhttps://www.nhs.uk/live-well/healthy-weight/supporting-someone-with-an-eating-disorder/\n\nhttps://anad.org/education-and-awareness/about-eating-disorders/how-to-help-a-loved-one/\n\nhttps://www.beateatingdisorders.org.uk/supporting-someone/supporting-somebody",
          "created_utc": 1593143527.0
        },
        {
          "id": "fw4ujfe",
          "author": "None",
          "body": "Please know I know you mean well but if you still have you eating disorder, you are in no healthy head space to provide anything but the addiction you feel right now.  Your educated on the addiction of your eating disorder and you’ve made this addiction your identity.  The day you want to recovery will you focus on eating disorder recovery.  \n\nFrom your perspective you’re needy because you don’t know how to get over your addiction, this advice is not helpful for the mom and son.  You want an addict to learn how to be self sufficient.  I hope you have your team psychiatrist, dietitian most importantly therapist to unpack what got you into an eating disorder and hopefully end goal to find YOUR identity and not the eating disorder.\n\nBtw, great links but focus on you.  You deserve it.",
          "created_utc": 1593229520.0
        }
      ]
    },
    {
      "id": "fw57y8j",
      "author": "None",
      "body": "It’s not even that difficult, tbh, unless it’s 2 people with an eating disorder. Those couples are usually doomed to fail",
      "created_utc": 1593240281.0,
      "score": 1,
      "context": [
        {
          "id": "fw1d2rf",
          "author": "None",
          "body": "1: Accept her as she is, “I don’t know exactly what you’re going through but I’m willing to stick with you as you go through it. I don’t think less of you for struggling. I hope you can seek help but if that’s not possible, know that I’m in your corner”\n\n2: idk I don’t live in the UK. I’ve heard of BEAT before\n\n3Intervene pretty much if she’s suicidal, shares that she’s vomiting blood, having seizures, etc. often times parents are more harm than help and you don’t know what her home life is like. My mom was the main reason I became bulimjc\n\n4: if he seems stressed, support him and encourage him to open up. Make sure he’s not giving too much to this girl to the point where there’s nothing left.",
          "created_utc": 1593152798.0
        },
        {
          "id": "fw4un0h",
          "author": "None",
          "body": "She has an addiction, that is self destruction.  That is very dangerous to be around someone self destructive.\n\nI know you mean well, but how does someone accept someone who has no idea who they are?  That is how toxic relationships are made because they are lost.",
          "created_utc": 1593229590.0
        }
      ]
    },
    {
      "id": "fw6n843",
      "author": "None",
      "body": "I would not listen to unless you have an MD, fellowship in psychiatry specializing in Eating Disorders.  Your BA means nothing to me, but it means everything to you and I know you worked hard and I congratulate you for that.  \n\nYou have that right to not know me, I respect that.  You, willing put yourself on the internet, on a public forum where everyone is allowed their perspective, I am exercising my right.  I don’t find your information healthy.  You still have your addiction because you don’t know who you are.  Why should I follow someone who is still trying to find who they are?  It’s blind leading the blind.\n\nWhether you are offended, that’s on you.  That’s your problem.  Do I still consider you needy, yes.  The fact you feel so entitled, convinced your bragging of a useless BA degree, which no one can hire you right now with already shows you lack self awareness.  Your lack of self awareness is a liability to any employer.  I still believe you will recover and that will be in your own time.  May your journey continue.\n\nI guarantee you’re going to look at your eating disorder as an addiction.  Anorexic, being underweight, under your genetic set weight, you’re drunk constantly. Bulimic when you puke, you release endorphins makes throwing up addictive and the high you get from the attention you get from forcing yourself to be tiny rinse and repeat.  But again, congrats you got over the worst.  You realized re-feeding yourself to your genetic set weight does not mean you will be obese.  Now all you have to learn is who you are and coping skills, like insults from the internet.",
      "created_utc": 1593279088.0,
      "score": 1,
      "context": [
        {
          "id": "fw10k9h",
          "author": "timeforbedplease",
          "body": "The idea of someone telling my parent that I have an ED is somewhat difficult for me to be okay with, that being said support and intervention are necessary. Her opening up to your son about this is a big step. Being able to confide in him about this could be a sign that she wants help, or at least recognizes these behaviors as detrimental. I am not in the UK so I can't speak to specific resources, but I will say that there is a lot of information available as to how to support someone with an ED. \n\nThe most helpful thing that my partner has done to help support me is to simply ask \"how involved do you want me to be?\" and \"what can I do to help you get better?\" It might seem like the right move is for you to intervene because she is a minor, but I do have concerns that this would take away her control and privacy. Recovery is most successful when the person seeks it for themselves. Another thing to keep in mind is not everyone is as understanding when it comes to ED, and many people aren't educated wl on the topic, enough to approach the discussion in a healthy and meaningful way. I've attached some links that may be a good place to start. You and your son sound like awesome people, I wish I had someone looking out for me the way you are when I was her age!\n\nLinks:\nhttps://www.nhs.uk/live-well/healthy-weight/supporting-someone-with-an-eating-disorder/\n\nhttps://anad.org/education-and-awareness/about-eating-disorders/how-to-help-a-loved-one/\n\nhttps://www.beateatingdisorders.org.uk/supporting-someone/supporting-somebody",
          "created_utc": 1593143527.0
        },
        {
          "id": "fw4ujfe",
          "author": "None",
          "body": "Please know I know you mean well but if you still have you eating disorder, you are in no healthy head space to provide anything but the addiction you feel right now.  Your educated on the addiction of your eating disorder and you’ve made this addiction your identity.  The day you want to recovery will you focus on eating disorder recovery.  \n\nFrom your perspective you’re needy because you don’t know how to get over your addiction, this advice is not helpful for the mom and son.  You want an addict to learn how to be self sufficient.  I hope you have your team psychiatrist, dietitian most importantly therapist to unpack what got you into an eating disorder and hopefully end goal to find YOUR identity and not the eating disorder.\n\nBtw, great links but focus on you.  You deserve it.",
          "created_utc": 1593229520.0
        },
        {
          "id": "fw50wxc",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1593234237.0
        }
      ]
    },
    {
      "id": "fw6om6b",
      "author": "None",
      "body": "Again, that‘s your perspective.  You are projecting your feelings and I don’t have to engage in them.  I never said I was better than you but you are not capable of giving advice right now till you’re strong enough to accept criticism in any form.  Does not mean I don’t believe in you.  In fact in this whole thread, you’re the one I believed in the most.",
      "created_utc": 1593279830.0,
      "score": 1,
      "context": [
        {
          "id": "fw10k9h",
          "author": "timeforbedplease",
          "body": "The idea of someone telling my parent that I have an ED is somewhat difficult for me to be okay with, that being said support and intervention are necessary. Her opening up to your son about this is a big step. Being able to confide in him about this could be a sign that she wants help, or at least recognizes these behaviors as detrimental. I am not in the UK so I can't speak to specific resources, but I will say that there is a lot of information available as to how to support someone with an ED. \n\nThe most helpful thing that my partner has done to help support me is to simply ask \"how involved do you want me to be?\" and \"what can I do to help you get better?\" It might seem like the right move is for you to intervene because she is a minor, but I do have concerns that this would take away her control and privacy. Recovery is most successful when the person seeks it for themselves. Another thing to keep in mind is not everyone is as understanding when it comes to ED, and many people aren't educated wl on the topic, enough to approach the discussion in a healthy and meaningful way. I've attached some links that may be a good place to start. You and your son sound like awesome people, I wish I had someone looking out for me the way you are when I was her age!\n\nLinks:\nhttps://www.nhs.uk/live-well/healthy-weight/supporting-someone-with-an-eating-disorder/\n\nhttps://anad.org/education-and-awareness/about-eating-disorders/how-to-help-a-loved-one/\n\nhttps://www.beateatingdisorders.org.uk/supporting-someone/supporting-somebody",
          "created_utc": 1593143527.0
        },
        {
          "id": "fw4ujfe",
          "author": "None",
          "body": "Please know I know you mean well but if you still have you eating disorder, you are in no healthy head space to provide anything but the addiction you feel right now.  Your educated on the addiction of your eating disorder and you’ve made this addiction your identity.  The day you want to recovery will you focus on eating disorder recovery.  \n\nFrom your perspective you’re needy because you don’t know how to get over your addiction, this advice is not helpful for the mom and son.  You want an addict to learn how to be self sufficient.  I hope you have your team psychiatrist, dietitian most importantly therapist to unpack what got you into an eating disorder and hopefully end goal to find YOUR identity and not the eating disorder.\n\nBtw, great links but focus on you.  You deserve it.",
          "created_utc": 1593229520.0
        },
        {
          "id": "fw51ul6",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1593234990.0
        }
      ]
    }
  ]
}