{
  "id": "hgut6d",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1593269334.0,
  "title": "Request: Finally starting to NOT count calories and amount of food I consume.",
  "selftext": "This has been such a long road I have had this disorder for about 10 years off and on. I have been eating healthy (and of course eat what I crave too) but restricted myself so much on how much food I ate. And I finally decided to let my body eat until it was full and content. I still maintain my work outs and have been actually seeing myself go harder on work outs. \n\nRight now it’s getting to me mentally because I get anxiety about “oh no I definitely over ate that meal” and want to so bad go work it off during a work out but that is not good either. I have been working on that too. In general I am proud of making this decision for myself and my health. It’s gonna be hard but I can do it.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hgut6d/request_finally_starting_to_not_count_calories/",
  "score": 93,
  "num_comments": 3,
  "comments": [
    {
      "id": "fw85lmd",
      "author": "jeabgrenouille",
      "body": "Good for you!!! My greatest discovery has been just how well my body can take care of itself and how it doesn't need me to control it and control my calories. I exercise more? I am hungrier. I exercise less? My appetite goes down. I ate too much? My appetite the next day or throughout the day is less, and often I have more energy and motivation to do more. I eat less one day? I have less energy to move and I need a nap. It takes time to have hunger signals and to know how to listen to them, but once you reach that point, your body takes care of itself and defends it's weight range easily. (All that being said, people with extreme hunger or who need to gain weight will get signals to eat a lot and rest a lot for as long as needed, and won't likely have a smaller appetite or a desire to move more at any time, and that is right for them since the body doesn't want to use calories for movement, and needs to use them to heal and have more weight).\n\nI weighed myself for the first time in 10 years a few years ago, and I didn't change any of my habits, but I would weigh myself again from time to time, and I would notice that the number was terribly uninteresting (unlike when I used to be obsessed with it) because my weight was always the same or close to the same. Even when I just got back from a trip or increased my activity or after the holidays, I maintained my weight (within a 3 pound range... But some people say a 10 pound range is typical for them) without actively trying to or making any kind of special effort. \n\nA great reason to let go of calorie counting. I think, for a lot of people, some practice and neural rewiring is needed first though, I would think. For me, my journey involved restriction, a strict meal plan, a relapse, restriction and extreme hunger, compulsive exercise, weight gain, more weight gain, neural rewiring (challenging my food fears and exercise compulsion), less interest in food and less urgent hunger, natural weight loss of overshoot weight, and then finally trust in my body and an increasingly normal relationship with food and weight (no fear). I do NOT think this is a required progression or anything!!! I knew NOTHING about how bodies work when I was unwell and therefore I thought I needed to control my body and I had so much fear because I thought any false move would cause my body to \"blow up\". The more I learn about how bodies work, the most I trust mine",
      "created_utc": 1593309689.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fw7qvkl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1593300381.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fw65dn4",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1593269334.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fw7ru7m",
      "author": "None",
      "body": "Thank you so much. Good luck to you too ❤️",
      "created_utc": 1593300947.0,
      "score": 2,
      "context": [
        {
          "id": "fw7qvkl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1593300381.0
        }
      ]
    }
  ]
}