{
  "id": "hguwzr",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1593269712.0,
  "title": "Request: Unhappy with my legs",
  "selftext": " \n\nI have a very long history of anorexia and body dysmorphia, that has always centred around my legs. Recently lost some weight and actually started to like my thighs but went on the pill and felt like my legs have just blown up to twice the size they used to be, despite the fact that the number on the scale is still going down. I feel them jiggling with every step I take and it’s gotten so bad I’ve convinced myself I have lipoedema and need liposuction. I don’t know what to do to get past this I had a day a week ago where I thought they looked okay but the next day huge again. Does anyone have advice for me?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hguwzr/request_unhappy_with_my_legs/",
  "score": 37,
  "num_comments": 8,
  "comments": [
    {
      "id": "fw6dnay",
      "author": "updown27",
      "body": "Stop body checking. Cover your mirrors. Don’t touch your legs. Don’t look at them. When we gain weight we will naturally notice the changes at first (jiggly legs, rubbing thighs, or being able to see your cheeks, etc.) this is normal and these sensations will subside with time, you have to trust that. Also ask yourself, if your legs are as big as you think what does that mean? How does that affect who you are as a person and how others perceive you? Then challenge those ideas. It’s helpful if you have a therapist or support group to walk you through this part. When we are preoccupied with our appearance even “good” days are not helpful because it reinforces our idea that if we fit a certain mold we are more valuable. So stop analyzing - good or bad. Any thoughts regarding your legs should be replaced with thoughts such as “I can walk” “I can run” “I can climb” etc. It takes vigilance and persistence to change the intrusive thoughts but I have done it and you can to. I therapist would really help if you don’t have one already.",
      "created_utc": 1593274003.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fw6v9fs",
      "author": "jeabgrenouille",
      "body": "(I also have a history with anorexia and body dismorphia. I have been weight restored for over a decade, but I'm always still working on improving my health and relationship with my body, food, and exercise. Just adding this so you know where I'm coming from)\nI think it could be helpful to find other people whose body looks like yours to follow on social media. For me, finding athletes on Instagram (I am really into sports so athletes makes sense for me. You might want to find other kinds of people if you aren't sporty) with a similar shape to mine made me start to appreciate my shape more. \nI also desensitized myself to my insecurity (my stomach) by wearing a bikini every day (we were going to the pool every day before coronavirus) no matter how I felt about it.\nThe last thing that I think is important is, when you are ready, find things that make you feel passionate and that you are proud of. I eat enough every day because I need energy to carry out the things that I enjoy and that I want to improve upon. I could NEVER do that while I was in the beginning of recovery because I was so food focussed and in the trenches of extreme hunger, that I couldn't focus on anything else, but once my focus came back and I started doing other things, my mind became occupied on other things and I had less space to think about my body. That is also hard to do for a lot of people during this corona time, but I have really made it a focus to have some structure and do things every day so that I keep my mind occupied and keep myself feeling proud and productive so I have less space to get focussed on my body (I definitely became super body aware and stressed about my body when I was first spending more time at home and not working!!).",
      "created_utc": 1593283412.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fw79sx2",
      "author": "TravelbugRunner",
      "body": "Oh my god same here! \n\nI always hated my legs; they always looked so big to me. I went through a period of time where I would cut my upper legs with razor blades. I eventually moved on to kitchen knives and would stab my legs. I had cut my self so bad that I couldn't get the bleeding to stop. My kitchen floor looked like someone had been murdered; blood was everywhere. \n\nI had to get myself to the emergency room for stitches. \n\nThat was the last time I self harmed (in 2012). \n\nI finally got meds I needed for my mental health issues and I went to an inpatient eating disorders facility to stabilize me and help break my eating disorder behaviors. It didn't cure me but it has helped me not feel so horrible about eating. \n\nI can allow myself food because I'm physically active and it's ok. ☺\n\nIt gets better with time. You will have days where you still hate your legs but then there are days where you will be at peace with it. \n\nYou legs are big because they are strong. They help you run and carry you through your day. Love the strength of your legs and focus less on their size. 💜",
      "created_utc": 1593290978.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fw660gj",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1593269712.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fw6x3w1",
      "author": "AzerothVarrock",
      "body": "I have body dysmorphia too. Revolved around my face and neck a lot but grew around to my body in my young teen and young adult life. \n\nWhen I feel this way, it is best to stay away from the scale, avoid mirrors, avoid taking pictures and videos to compare and check yourself. \n\nI also would recommend a therapist talk about this too if you can. \n\nIf you CANT I recommend a worksheet on cognitive distortions and work on mindfullness techniques as well. \n\nBut it is so easy to get caught up in this stuff and in your head and project that on what you think you see. \n\nYou gotta acknowledge this as a severe problem cus the obsession, cognitive distortions, and worry is debilitating and can cause isolation and severe anxiety and depression. That's why I recommend therapy so much.",
      "created_utc": 1593284406.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fw78czy",
      "author": "AlliSpottsDeLazzer",
      "body": "Yes, the eating disorder is a beeotch who tries to be a your frenemy. For every one poisonous thought the ED/BDD does, give back four positive or thankful ones (sat 200 times today, thanks, thighs!). Eventually, neuroplasticity should start to work. 1 to 4! That ED, even when in recovery, is a terrrrrrrrible friend who rudely drops in....",
      "created_utc": 1593290232.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fw7jzum",
      "author": "Blame_15",
      "body": "I'm bulimic and i really feel that",
      "created_utc": 1593296452.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fw6sgbi",
      "author": "None",
      "body": "Why did you recently lost some weight?",
      "created_utc": 1593281889.0,
      "score": -2,
      "context": []
    }
  ]
}