{
  "id": "hheb6t",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1593350712.0,
  "title": "Request: How to have healthy relationship with food",
  "selftext": " \n\nHello I'm 18 and I've struggled with anorexia and bulimia my entire teenage years. I finally have seemed to get over that but now I have the issue of binge eating to counteract those urges and its caused me to gain a large amount of weight. Can I please have some suggestions on how to have healthy relationship with food and lose weight the right way",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hheb6t/request_how_to_have_healthy_relationship_with_food/",
  "score": 56,
  "num_comments": 20,
  "comments": [
    {
      "id": "fw9nb9u",
      "author": "DrScottEilers",
      "body": "For many people it relates a lot to changing your view of the role of food and your body.\n\nIf they see the purpose of food as something to be managed or manipulated to modify your appearance, it will be hard to have a healthy relationship with food.\n\nIf they see the purpose of their bodies as being aesthetically pleasing to themselves or others, it will be hard for them to have a healthy relationship with their bodies.",
      "created_utc": 1593354193.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fwa6b96",
      "author": "jeabgrenouille",
      "body": "I also had anorexia, and then struggled with eating large amounts of food and gaining weight. My understanding is that the worst thing you can do is try to balance out a \"binge\" with restriction or exercise. That's how you can get stuck \"bingeing\" and restricting and gaining weight indefinitely. \n \nI put bingeing in quotations because I am skeptical that this is the problem for most people. Restriction and purging is the problem and after a while, it causes the body to take control and give unignorable impulses to eat. After a famine, you gotta feast. This can cause weight gain, but if you commit to not restricting, the weight gain will stop and it can even come down naturally if the body deems some of the weight gain as unnecessary (it will often need some extra weight gain at first for survival because the body thinks that food has been scarce for a long time and it does not trust that food is abundant until you eat consistently without restriction for a prolonged period of time.)\n\nThis is my perspective because I have seen many people quit restricting, gain weight, and then lose weight naturally, still eating unrestricted, and became happier and freer. I am included in this. I never had bulimia, but I had anorexia, I recovered in the hospital, I relapsed, I got extreme hunger and ate and ate and ate and ate and ate and thought of nothing but food, I tried to restrict, I kept being so food focused so I kept eating and I gained some weight, and then I challenged my food fears and exercise compulsions and finally, my body let go of some weight and I feel pretty normal nowadays (though still very vigilant and always working on improving my relationship with my body, food, and exercise).",
      "created_utc": 1593364746.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fw9l6in",
      "author": "None",
      "body": "i find that when i am getting back to my bad binging habits it helps me to binge on fruit rather than on chips or something. Try to not buy any unhealthy foods at all, if you want a treat now and then you should have it so your cravings dont get bad. Also it is okay if you binge for one day, just get back on track the next :)",
      "created_utc": 1593352818.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fw9no96",
      "author": "v_kaydubz",
      "body": "First of all, thank you for posting - I am going through the same thing and it is comforting to know that I am not alone in this.\n\nWhen I went to therapy she said to plan my meals - every single meal. Have set times to eat and do not deviate from the plan. However, if you do end up eating something that is not on your plan, or you overeat, treat yourself with compassion. Forgive yourself and move on - don't dwell on the fact that you ate too much. Just try again and thank yourself for your efforts.\n\nI hope this helps you and don't give up. To quote Sarah Wilson: \"Do the work.\"",
      "created_utc": 1593354418.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fw9vu61",
      "author": "AlliSpottsDeLazzer",
      "body": "Something called a CEDRD (Certified Eating Disorder Registered Dietitian) would probably help a lot. You'd THINK RDs would be trained in exactly these issues, right? Nope. A CEDRD should be well-trained in this and other pieces that come with recovery. Been recovered for many years now, KEEP GOING!",
      "created_utc": 1593359172.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fw9i5hn",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1593350712.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fw9ld42",
      "author": "KaatjePlaatje",
      "body": "Sooo, I’m not fully out of the woods yet... also a recovering boulimic.\n\nWhat has helped me so far are:\n1 treatment with a psychologist and ED group therapy with a dietitian!\n2 Making up a schedule of when I binge, why, how I feel at that specific moment and what I’ve eaten.\n3. Trying new things in trying to (first) postpone the binge. And if I found some strategies, trying to use them to not binge that day.\n4. Realizing that sometimes, yeah, I’ll eat to much.... and planning a head for how to handle it when this happens.\n5. And with my fear of gaining weight, I learned that treating myself on something else than food related stuff helps me to love my body (not for its looks, but it’s health, function and otherwise important qualities)\n\nI don’t know where you are from and where your options are... but if you can, try to get help, so you can do this properly! Trying and failing is painful and tiring!",
      "created_utc": 1593352937.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fw9na77",
      "author": "BlackJack613",
      "body": "Nutritionists are relatively easy to find, make an appointment for a consult. They will likely have contacts for therapists that specialize in or have experience with eating disorders. \n\nOnce you have a good rhythm and habits established you can start paying more attention to working out and treating your body well - running has always been there for me, training for big runs has made eating a lot more natural and easy for me since I have been naturally gravitating towards protein and healthier food as my body craves it and I know it makes the next days runs easier.\n\nDon't push through on your own, have a support system of friends and loved ones as well as professionals that you can get trusted advise from",
      "created_utc": 1593354173.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwacq8w",
      "author": "bobakittens",
      "body": "Snacking is okay. But snack healthy. I'm currently in relapse but was 3 years in a solid recovery (like 3-5 episodes a year) and maintained my healthy weight even during quarantine and COVID. Eat what you know will fill you up in healthy amounts. Remember to drink water throughout the day as hunger cravings can be dehydration in disguise. Fruits are high in sugar and while low calorie can cause insulin spikes which can cause those same hungry lows as candy and soda. Speaking of soda, do not drink calories. Unless you are having a fully loaded smoothie or other liquid meal, dont drink calories. Dont restrict heavily on these, throw in that yogurt and protein powder and milk/milk substitute/juice. But realize that drink is upwards of an actual plate of food in calories. So it is better early on to cut out liquid calories entirely.\n\nAnd I am in relapse so I am trying to keep my advice as moderate as possible, but i do realize i mention calories which can be rather triggering. I dont think you should be actively counting calories, but actively cutting unnecessary calories.",
      "created_utc": 1593368068.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwbcyow",
      "author": "youareinmybubble",
      "body": "The best thing I did was find a really great nutritionist. I can be honest with her and she helps me with meal planning. Its helpful she gives me lots of really good ideas. I have also been really into yoga. Having a strong body and mind helps me feed it correctly. Its a challenge everyday but when you can think back and say wow its been x number of days since I purged or look in the mirror and like what you see its worth it. In here if you ever want to talk",
      "created_utc": 1593387333.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwanbhq",
      "author": "TravelbugRunner",
      "body": "The best thing that has helped me so far is to view food as fuel for exercise. I can eat that salad and have an actual ice cream cone because I know I will bike or run it off. It will help my physical performance if I eat a little bit (and be cool with it). \n\nI've been battling Anorexia Purging Subtype for 12 years and it has taken me 3 years to get healthy and better about food. I still have my issues it's just not as bad as it was. ☺",
      "created_utc": 1593373691.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwcfhih",
      "author": "wxshii",
      "body": "I think it's important to remember there's so such things as 'good food' and 'bad food' all food is made up of carbs, protein and fat and we need all of those to have a healthy balanced diet. Obviously some foods are going to be more nutritional but its important to have a balance. I found that restricting myself too much and not letting myself have treats caused me to binge like crazy whereas now I put aside 200-300 calories every day for a treat (chocolate/dessert/ice cream etc) and its helped a lot and I'm still losing weight albeit slowly but its a much more manageable approach :)",
      "created_utc": 1593413655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwe1jp2",
      "author": "None",
      "body": "Hi friend! I've struggled with similar issues in the past, and here's what I've learned. \n\nSome of the reasons for why we struggle with eating disorders go much deeper than the food and the urges themselves. For some, it stems from a lack of self-confidence, self-esteem: for me, it came from a misunderstanding of my worth and value as a person in my own right. Maybe some have been hurt in the past and turned to food as a savior: still others may just like to eat too much, then got heavier, and thus their fight with food began. I don't now about you, but I encourage you to start thinking about the deeper issues and struggles that might be going on under the surface, and focus on resolving those struggles. (If you want someone to talk to on more along these lines, feel free to PM me.)\n\nThen, also be sure to do some research on healthy eating, start doing exercises, and find a friend to support and encourage you as you strive to live a better lifestyle! Blessings, and I hope some of this is helpful!",
      "created_utc": 1593453826.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwad4ge",
      "author": "bobakittens",
      "body": "My brain refused to let me restrict for years after I partook in severe calorie restriction. If I ate even a little less than while I was gaining weight, my brain went into panic mode and I would find myself eating more than if I had just eaten a normal amount of food in the first place. Like my body would be like, \"Yo, I'm still hungry.\" And immediately brain would go to hunter gatherer mode and just cramp everything into my face. Like \"Naw bitch, we are NOT going through that again.\"",
      "created_utc": 1593368270.0,
      "score": 2,
      "context": [
        {
          "id": "fwa6b96",
          "author": "jeabgrenouille",
          "body": "I also had anorexia, and then struggled with eating large amounts of food and gaining weight. My understanding is that the worst thing you can do is try to balance out a \"binge\" with restriction or exercise. That's how you can get stuck \"bingeing\" and restricting and gaining weight indefinitely. \n \nI put bingeing in quotations because I am skeptical that this is the problem for most people. Restriction and purging is the problem and after a while, it causes the body to take control and give unignorable impulses to eat. After a famine, you gotta feast. This can cause weight gain, but if you commit to not restricting, the weight gain will stop and it can even come down naturally if the body deems some of the weight gain as unnecessary (it will often need some extra weight gain at first for survival because the body thinks that food has been scarce for a long time and it does not trust that food is abundant until you eat consistently without restriction for a prolonged period of time.)\n\nThis is my perspective because I have seen many people quit restricting, gain weight, and then lose weight naturally, still eating unrestricted, and became happier and freer. I am included in this. I never had bulimia, but I had anorexia, I recovered in the hospital, I relapsed, I got extreme hunger and ate and ate and ate and ate and ate and thought of nothing but food, I tried to restrict, I kept being so food focused so I kept eating and I gained some weight, and then I challenged my food fears and exercise compulsions and finally, my body let go of some weight and I feel pretty normal nowadays (though still very vigilant and always working on improving my relationship with my body, food, and exercise).",
          "created_utc": 1593364746.0
        }
      ]
    },
    {
      "id": "fwasxnz",
      "author": "jeabgrenouille",
      "body": "Yes!!! Hunger was not the same!! It was like an urgent, unignorable hunger!! I just randomly noticed one day after not restricting for many years that like, hey, hunger is not a big deal anymore. If I am hungry, and I have to wait to eat, like in a restaurant, fine, no worries. Yesterday, actually, I was going to shoot some hoops and I realized, oh wait, wasn't I hungry before? I was going to grab a snack and I just completely forgot to do that before I went out. That would have NEVER happened before. I remember before when I needed to wait even under five minutes for food was absolutely unbearable.",
      "created_utc": 1593376604.0,
      "score": 3,
      "context": [
        {
          "id": "fwa6b96",
          "author": "jeabgrenouille",
          "body": "I also had anorexia, and then struggled with eating large amounts of food and gaining weight. My understanding is that the worst thing you can do is try to balance out a \"binge\" with restriction or exercise. That's how you can get stuck \"bingeing\" and restricting and gaining weight indefinitely. \n \nI put bingeing in quotations because I am skeptical that this is the problem for most people. Restriction and purging is the problem and after a while, it causes the body to take control and give unignorable impulses to eat. After a famine, you gotta feast. This can cause weight gain, but if you commit to not restricting, the weight gain will stop and it can even come down naturally if the body deems some of the weight gain as unnecessary (it will often need some extra weight gain at first for survival because the body thinks that food has been scarce for a long time and it does not trust that food is abundant until you eat consistently without restriction for a prolonged period of time.)\n\nThis is my perspective because I have seen many people quit restricting, gain weight, and then lose weight naturally, still eating unrestricted, and became happier and freer. I am included in this. I never had bulimia, but I had anorexia, I recovered in the hospital, I relapsed, I got extreme hunger and ate and ate and ate and ate and ate and thought of nothing but food, I tried to restrict, I kept being so food focused so I kept eating and I gained some weight, and then I challenged my food fears and exercise compulsions and finally, my body let go of some weight and I feel pretty normal nowadays (though still very vigilant and always working on improving my relationship with my body, food, and exercise).",
          "created_utc": 1593364746.0
        },
        {
          "id": "fwad4ge",
          "author": "bobakittens",
          "body": "My brain refused to let me restrict for years after I partook in severe calorie restriction. If I ate even a little less than while I was gaining weight, my brain went into panic mode and I would find myself eating more than if I had just eaten a normal amount of food in the first place. Like my body would be like, \"Yo, I'm still hungry.\" And immediately brain would go to hunter gatherer mode and just cramp everything into my face. Like \"Naw bitch, we are NOT going through that again.\"",
          "created_utc": 1593368270.0
        }
      ]
    },
    {
      "id": "fwewcfk",
      "author": "seravivi",
      "body": "Oh my gosh thank you for this comment! After being malnourished for a few years I slowly started building up to eating normal. \nNow I'm trying to lose some weight and avoid overeating, but anytime I think of not feeling completely full I get panicky. \nAny tips to get over it?",
      "created_utc": 1593468582.0,
      "score": 1,
      "context": [
        {
          "id": "fwa6b96",
          "author": "jeabgrenouille",
          "body": "I also had anorexia, and then struggled with eating large amounts of food and gaining weight. My understanding is that the worst thing you can do is try to balance out a \"binge\" with restriction or exercise. That's how you can get stuck \"bingeing\" and restricting and gaining weight indefinitely. \n \nI put bingeing in quotations because I am skeptical that this is the problem for most people. Restriction and purging is the problem and after a while, it causes the body to take control and give unignorable impulses to eat. After a famine, you gotta feast. This can cause weight gain, but if you commit to not restricting, the weight gain will stop and it can even come down naturally if the body deems some of the weight gain as unnecessary (it will often need some extra weight gain at first for survival because the body thinks that food has been scarce for a long time and it does not trust that food is abundant until you eat consistently without restriction for a prolonged period of time.)\n\nThis is my perspective because I have seen many people quit restricting, gain weight, and then lose weight naturally, still eating unrestricted, and became happier and freer. I am included in this. I never had bulimia, but I had anorexia, I recovered in the hospital, I relapsed, I got extreme hunger and ate and ate and ate and ate and ate and thought of nothing but food, I tried to restrict, I kept being so food focused so I kept eating and I gained some weight, and then I challenged my food fears and exercise compulsions and finally, my body let go of some weight and I feel pretty normal nowadays (though still very vigilant and always working on improving my relationship with my body, food, and exercise).",
          "created_utc": 1593364746.0
        },
        {
          "id": "fwad4ge",
          "author": "bobakittens",
          "body": "My brain refused to let me restrict for years after I partook in severe calorie restriction. If I ate even a little less than while I was gaining weight, my brain went into panic mode and I would find myself eating more than if I had just eaten a normal amount of food in the first place. Like my body would be like, \"Yo, I'm still hungry.\" And immediately brain would go to hunter gatherer mode and just cramp everything into my face. Like \"Naw bitch, we are NOT going through that again.\"",
          "created_utc": 1593368270.0
        }
      ]
    },
    {
      "id": "fwb7kth",
      "author": "bobakittens",
      "body": "YES!! Just the thought that in some way you were being denied food was enough to trigger a rage fit. I am just now reaching that place where I can be hungry and it doesnt hurt me. I can take it or leave it. I can be picky about my food, if i dont like the selection available, i can wait longer. Before i would literally spread peanut butter on tortillas and cram that in my face. I felt like a weird pregnant person. I will say I havent eaten peanut butter since the start of my recovery because I always triggered a binge without fail. It was the one food I craved while restricting.",
      "created_utc": 1593384381.0,
      "score": 2,
      "context": [
        {
          "id": "fwa6b96",
          "author": "jeabgrenouille",
          "body": "I also had anorexia, and then struggled with eating large amounts of food and gaining weight. My understanding is that the worst thing you can do is try to balance out a \"binge\" with restriction or exercise. That's how you can get stuck \"bingeing\" and restricting and gaining weight indefinitely. \n \nI put bingeing in quotations because I am skeptical that this is the problem for most people. Restriction and purging is the problem and after a while, it causes the body to take control and give unignorable impulses to eat. After a famine, you gotta feast. This can cause weight gain, but if you commit to not restricting, the weight gain will stop and it can even come down naturally if the body deems some of the weight gain as unnecessary (it will often need some extra weight gain at first for survival because the body thinks that food has been scarce for a long time and it does not trust that food is abundant until you eat consistently without restriction for a prolonged period of time.)\n\nThis is my perspective because I have seen many people quit restricting, gain weight, and then lose weight naturally, still eating unrestricted, and became happier and freer. I am included in this. I never had bulimia, but I had anorexia, I recovered in the hospital, I relapsed, I got extreme hunger and ate and ate and ate and ate and ate and thought of nothing but food, I tried to restrict, I kept being so food focused so I kept eating and I gained some weight, and then I challenged my food fears and exercise compulsions and finally, my body let go of some weight and I feel pretty normal nowadays (though still very vigilant and always working on improving my relationship with my body, food, and exercise).",
          "created_utc": 1593364746.0
        },
        {
          "id": "fwad4ge",
          "author": "bobakittens",
          "body": "My brain refused to let me restrict for years after I partook in severe calorie restriction. If I ate even a little less than while I was gaining weight, my brain went into panic mode and I would find myself eating more than if I had just eaten a normal amount of food in the first place. Like my body would be like, \"Yo, I'm still hungry.\" And immediately brain would go to hunter gatherer mode and just cramp everything into my face. Like \"Naw bitch, we are NOT going through that again.\"",
          "created_utc": 1593368270.0
        },
        {
          "id": "fwasxnz",
          "author": "jeabgrenouille",
          "body": "Yes!!! Hunger was not the same!! It was like an urgent, unignorable hunger!! I just randomly noticed one day after not restricting for many years that like, hey, hunger is not a big deal anymore. If I am hungry, and I have to wait to eat, like in a restaurant, fine, no worries. Yesterday, actually, I was going to shoot some hoops and I realized, oh wait, wasn't I hungry before? I was going to grab a snack and I just completely forgot to do that before I went out. That would have NEVER happened before. I remember before when I needed to wait even under five minutes for food was absolutely unbearable.",
          "created_utc": 1593376604.0
        }
      ]
    },
    {
      "id": "fwfd5az",
      "author": "bobakittens",
      "body": "Just leave it. Your brain will not forget for a while. Look instead to the quality of food you are eating. More home cooking, more fresh ingredients. You will find that the calories cut naturally that way and your body still feels full. It took years for my body to be okay with hunger. Almost 7 years. Starvation leaves a strong impact on the brain.",
      "created_utc": 1593477638.0,
      "score": 1,
      "context": [
        {
          "id": "fwa6b96",
          "author": "jeabgrenouille",
          "body": "I also had anorexia, and then struggled with eating large amounts of food and gaining weight. My understanding is that the worst thing you can do is try to balance out a \"binge\" with restriction or exercise. That's how you can get stuck \"bingeing\" and restricting and gaining weight indefinitely. \n \nI put bingeing in quotations because I am skeptical that this is the problem for most people. Restriction and purging is the problem and after a while, it causes the body to take control and give unignorable impulses to eat. After a famine, you gotta feast. This can cause weight gain, but if you commit to not restricting, the weight gain will stop and it can even come down naturally if the body deems some of the weight gain as unnecessary (it will often need some extra weight gain at first for survival because the body thinks that food has been scarce for a long time and it does not trust that food is abundant until you eat consistently without restriction for a prolonged period of time.)\n\nThis is my perspective because I have seen many people quit restricting, gain weight, and then lose weight naturally, still eating unrestricted, and became happier and freer. I am included in this. I never had bulimia, but I had anorexia, I recovered in the hospital, I relapsed, I got extreme hunger and ate and ate and ate and ate and ate and thought of nothing but food, I tried to restrict, I kept being so food focused so I kept eating and I gained some weight, and then I challenged my food fears and exercise compulsions and finally, my body let go of some weight and I feel pretty normal nowadays (though still very vigilant and always working on improving my relationship with my body, food, and exercise).",
          "created_utc": 1593364746.0
        },
        {
          "id": "fwad4ge",
          "author": "bobakittens",
          "body": "My brain refused to let me restrict for years after I partook in severe calorie restriction. If I ate even a little less than while I was gaining weight, my brain went into panic mode and I would find myself eating more than if I had just eaten a normal amount of food in the first place. Like my body would be like, \"Yo, I'm still hungry.\" And immediately brain would go to hunter gatherer mode and just cramp everything into my face. Like \"Naw bitch, we are NOT going through that again.\"",
          "created_utc": 1593368270.0
        },
        {
          "id": "fwewcfk",
          "author": "seravivi",
          "body": "Oh my gosh thank you for this comment! After being malnourished for a few years I slowly started building up to eating normal. \nNow I'm trying to lose some weight and avoid overeating, but anytime I think of not feeling completely full I get panicky. \nAny tips to get over it?",
          "created_utc": 1593468582.0
        }
      ]
    },
    {
      "id": "fwbejaw",
      "author": "jeabgrenouille",
      "body": "So true. Also, sharing food just was never a thing. If I had food, it was MINE. I could not comprehend how people could be willing to let someone taste their food. Like I could cry if someone asked for some of my meal and I would let them take some, gritting my teeth, and I'd be watching them taking a bite, horrified at how much they might take like it physically hurt me.",
      "created_utc": 1593388255.0,
      "score": 1,
      "context": [
        {
          "id": "fwa6b96",
          "author": "jeabgrenouille",
          "body": "I also had anorexia, and then struggled with eating large amounts of food and gaining weight. My understanding is that the worst thing you can do is try to balance out a \"binge\" with restriction or exercise. That's how you can get stuck \"bingeing\" and restricting and gaining weight indefinitely. \n \nI put bingeing in quotations because I am skeptical that this is the problem for most people. Restriction and purging is the problem and after a while, it causes the body to take control and give unignorable impulses to eat. After a famine, you gotta feast. This can cause weight gain, but if you commit to not restricting, the weight gain will stop and it can even come down naturally if the body deems some of the weight gain as unnecessary (it will often need some extra weight gain at first for survival because the body thinks that food has been scarce for a long time and it does not trust that food is abundant until you eat consistently without restriction for a prolonged period of time.)\n\nThis is my perspective because I have seen many people quit restricting, gain weight, and then lose weight naturally, still eating unrestricted, and became happier and freer. I am included in this. I never had bulimia, but I had anorexia, I recovered in the hospital, I relapsed, I got extreme hunger and ate and ate and ate and ate and ate and thought of nothing but food, I tried to restrict, I kept being so food focused so I kept eating and I gained some weight, and then I challenged my food fears and exercise compulsions and finally, my body let go of some weight and I feel pretty normal nowadays (though still very vigilant and always working on improving my relationship with my body, food, and exercise).",
          "created_utc": 1593364746.0
        },
        {
          "id": "fwad4ge",
          "author": "bobakittens",
          "body": "My brain refused to let me restrict for years after I partook in severe calorie restriction. If I ate even a little less than while I was gaining weight, my brain went into panic mode and I would find myself eating more than if I had just eaten a normal amount of food in the first place. Like my body would be like, \"Yo, I'm still hungry.\" And immediately brain would go to hunter gatherer mode and just cramp everything into my face. Like \"Naw bitch, we are NOT going through that again.\"",
          "created_utc": 1593368270.0
        },
        {
          "id": "fwasxnz",
          "author": "jeabgrenouille",
          "body": "Yes!!! Hunger was not the same!! It was like an urgent, unignorable hunger!! I just randomly noticed one day after not restricting for many years that like, hey, hunger is not a big deal anymore. If I am hungry, and I have to wait to eat, like in a restaurant, fine, no worries. Yesterday, actually, I was going to shoot some hoops and I realized, oh wait, wasn't I hungry before? I was going to grab a snack and I just completely forgot to do that before I went out. That would have NEVER happened before. I remember before when I needed to wait even under five minutes for food was absolutely unbearable.",
          "created_utc": 1593376604.0
        },
        {
          "id": "fwb7kth",
          "author": "bobakittens",
          "body": "YES!! Just the thought that in some way you were being denied food was enough to trigger a rage fit. I am just now reaching that place where I can be hungry and it doesnt hurt me. I can take it or leave it. I can be picky about my food, if i dont like the selection available, i can wait longer. Before i would literally spread peanut butter on tortillas and cram that in my face. I felt like a weird pregnant person. I will say I havent eaten peanut butter since the start of my recovery because I always triggered a binge without fail. It was the one food I craved while restricting.",
          "created_utc": 1593384381.0
        }
      ]
    },
    {
      "id": "fwffx04",
      "author": "seravivi",
      "body": "Oh gosh I'm only two years in. Thank you for the advice. I really appreciate it.",
      "created_utc": 1593479231.0,
      "score": 1,
      "context": [
        {
          "id": "fwa6b96",
          "author": "jeabgrenouille",
          "body": "I also had anorexia, and then struggled with eating large amounts of food and gaining weight. My understanding is that the worst thing you can do is try to balance out a \"binge\" with restriction or exercise. That's how you can get stuck \"bingeing\" and restricting and gaining weight indefinitely. \n \nI put bingeing in quotations because I am skeptical that this is the problem for most people. Restriction and purging is the problem and after a while, it causes the body to take control and give unignorable impulses to eat. After a famine, you gotta feast. This can cause weight gain, but if you commit to not restricting, the weight gain will stop and it can even come down naturally if the body deems some of the weight gain as unnecessary (it will often need some extra weight gain at first for survival because the body thinks that food has been scarce for a long time and it does not trust that food is abundant until you eat consistently without restriction for a prolonged period of time.)\n\nThis is my perspective because I have seen many people quit restricting, gain weight, and then lose weight naturally, still eating unrestricted, and became happier and freer. I am included in this. I never had bulimia, but I had anorexia, I recovered in the hospital, I relapsed, I got extreme hunger and ate and ate and ate and ate and ate and thought of nothing but food, I tried to restrict, I kept being so food focused so I kept eating and I gained some weight, and then I challenged my food fears and exercise compulsions and finally, my body let go of some weight and I feel pretty normal nowadays (though still very vigilant and always working on improving my relationship with my body, food, and exercise).",
          "created_utc": 1593364746.0
        },
        {
          "id": "fwad4ge",
          "author": "bobakittens",
          "body": "My brain refused to let me restrict for years after I partook in severe calorie restriction. If I ate even a little less than while I was gaining weight, my brain went into panic mode and I would find myself eating more than if I had just eaten a normal amount of food in the first place. Like my body would be like, \"Yo, I'm still hungry.\" And immediately brain would go to hunter gatherer mode and just cramp everything into my face. Like \"Naw bitch, we are NOT going through that again.\"",
          "created_utc": 1593368270.0
        },
        {
          "id": "fwewcfk",
          "author": "seravivi",
          "body": "Oh my gosh thank you for this comment! After being malnourished for a few years I slowly started building up to eating normal. \nNow I'm trying to lose some weight and avoid overeating, but anytime I think of not feeling completely full I get panicky. \nAny tips to get over it?",
          "created_utc": 1593468582.0
        },
        {
          "id": "fwfd5az",
          "author": "bobakittens",
          "body": "Just leave it. Your brain will not forget for a while. Look instead to the quality of food you are eating. More home cooking, more fresh ingredients. You will find that the calories cut naturally that way and your body still feels full. It took years for my body to be okay with hunger. Almost 7 years. Starvation leaves a strong impact on the brain.",
          "created_utc": 1593477638.0
        }
      ]
    }
  ]
}