{
  "id": "hik9io",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1593510470.0,
  "title": "Request: question: could i be developing an eating disorder?",
  "selftext": "I just want somebody's opinion cause im to scared to tell anybody about this in real life. The reason why im worried is my self-esteem about my looks and body image has plummeted and even if I'm hungry I'm starting to restrict food and make myself go a day or two with out eating. I'm proud if i make it a day or two and every time i eat i feel fat and guilty. I've also began exercising after every time i eat and before bed and when i wake up in the morning. Talking to a doctor is not an option im a minor and don't want to tell anybody do that's not an option for me. What do you guys think?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hik9io/request_question_could_i_be_developing_an_eating/",
  "score": 45,
  "num_comments": 14,
  "comments": [
    {
      "id": "fwgr49g",
      "author": "lottaleo42",
      "body": "Hi there love. I know this is a very scary experience. This definitely sounds like an eating disorder, and is very similar to the way mine started. I know that telling people is a very scary thing to do. The sooner you do tell someone though, the sooner you can get help and the easier recovery will be. Admitting that I was struggling with my eating was sooo hard, yet it was the best thing I’ve done for myself. Please please please feel free to reach out to me with questions or for support. I wish you all the best <3",
      "created_utc": 1593516310.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fwh2eac",
      "author": "taylorsayle",
      "body": "Yes. Very common signs of an ed. And skipping meals is nothing to be 'proud' of, but I don't think that's really the word you're looking for. It's what the ed wants you to think. Restricting will only make you feel worse about yourself, and further ingrain the idea that you aren't worthy of food. You are. \n\nWhen you skip meals it is going to end up making you want to skip more and more until your body cant take it anymore, and forces you to eat. Then you get that 'guilty' feeling. The only way to stop it is to try to stop engaging in ed behavior. You'll never starve yourself to confidence. Nor will overexercising. I would recommend stopping the exercise altogether for now and not starting again until you are doing it for health reasons. Trust me when I say, it's healthier for you not to exercise right now.  \n\nYou have to find another way to cope with your negative feelings. Try to find another distraction after eating. This is when it's easier to have someone help you distract yourself because ik it can be hard. You should really consider telling someone you're close to. Eds thrive in solitude! But it's great you came on here. I'm happy you did.",
      "created_utc": 1593524334.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fwgr8uh",
      "author": "scaryhairyberryfairy",
      "body": "it definitely sounds like you are suffering from disordered eating. i don't really understand how hard it would be to tell someone, but telling someone this early in the disorder's progression can stop years of therapy and trauma. you do not want to have years of your life taken away by this cruel disorder (or your entire life taken away).",
      "created_utc": 1593516429.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fwgqmar",
      "author": "okletsdothis111",
      "body": "That sounds like a eating disorder",
      "created_utc": 1593515868.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwgl09t",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1593510470.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwh85sf",
      "author": "anyaburno8",
      "body": "I do the EXACT same thing, I’m a minor too and I can’t tell my parents about it.",
      "created_utc": 1593527484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwiskwg",
      "author": "AlliSpottsDeLazzer",
      "body": "You are in the scary zone for sure. Tricky thing is that secrecy helps the eating disorder grow stronger. As someone who has no idea why she's still alive after many years of EDs, I can say wholeheartedly: tell someone you're scared. I recovered, but I needed to have reached out for help sooner than I did. You can....",
      "created_utc": 1593554384.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwj4piq",
      "author": "Lsmitty2",
      "body": "I was an eating disorders specialist for a few years and I worked with some amazing young adults and teens. I'm concerned that you are afraid to talk to someone about this, because outside support and accountability would really help. I'm so glad that you reached out here. I encourage you to find a trusted friend, teacher, counselor at school, cousin, aunt/uncle, etc. to talk to. One of the characteristics of an ED is body distortion, as well as thought distortion. The more that you deny your body the nutrition that it needs, the more distorted your thinking will become. Another feature of ED, is feeling out of control in many areas of your life. Could that be the case with you? What people do, is to try to control at least one thing, which is the food. One of the things that we encouraged people to do was to journal their food intake and at the same time, journal how they feel. Try to make sure that you are eating a healthy and balanced diet, in small portions. It is very likely that you will experience some anxiety during and following a meal or snack, and one of the things you can do is to introduce relaxation right after you eat. You can play music, listen to progressive relaxation exercises, or listen to one of the calming apps. If you are going to exercise, do your best to at least limit it to once a day for only 10-15 minutes. I want you to know that you are fearfully and wonderfully made and that God has a plan for your life. Extreme diet restriction and weight loss, takes a real toll on your body. You really need to get to the root of this and that may require counseling. Perhaps, you can reach out to a local church, that may be able to provide support for free. I pray that you will have courage and strength to get the help that you need.",
      "created_utc": 1593560817.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwjaekv",
      "author": "m0usseline",
      "body": "You make me think of me when it all started..... 14 years ago. I'm still struggling every day.\n\nPlease, for the love of yourself, seek help ❤️",
      "created_utc": 1593564141.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwhqplw",
      "author": "ae_and_iou",
      "body": "compare languid agonizing saw instinctive rob history party judicious fanatical\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1593536525.0,
      "score": 3,
      "context": [
        {
          "id": "fwgr8uh",
          "author": "scaryhairyberryfairy",
          "body": "it definitely sounds like you are suffering from disordered eating. i don't really understand how hard it would be to tell someone, but telling someone this early in the disorder's progression can stop years of therapy and trauma. you do not want to have years of your life taken away by this cruel disorder (or your entire life taken away).",
          "created_utc": 1593516429.0
        }
      ]
    },
    {
      "id": "fwhrrlj",
      "author": "ae_and_iou",
      "body": "shy light wide touch roll expansion frighten cooperative outgoing vegetable\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1593537032.0,
      "score": 2,
      "context": [
        {
          "id": "fwh85sf",
          "author": "anyaburno8",
          "body": "I do the EXACT same thing, I’m a minor too and I can’t tell my parents about it.",
          "created_utc": 1593527484.0
        }
      ]
    },
    {
      "id": "fwmikwl",
      "author": "anyaburno8",
      "body": "No there’s literally no one I could talk to comfortably,",
      "created_utc": 1593637237.0,
      "score": 1,
      "context": [
        {
          "id": "fwh85sf",
          "author": "anyaburno8",
          "body": "I do the EXACT same thing, I’m a minor too and I can’t tell my parents about it.",
          "created_utc": 1593527484.0
        },
        {
          "id": "fwhrrlj",
          "author": "ae_and_iou",
          "body": "shy light wide touch roll expansion frighten cooperative outgoing vegetable\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1593537032.0
        }
      ]
    },
    {
      "id": "fwmnykq",
      "author": "ae_and_iou",
      "body": "overconfident spoon party flag modern slim faulty edge boast scale\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1593639651.0,
      "score": 2,
      "context": [
        {
          "id": "fwh85sf",
          "author": "anyaburno8",
          "body": "I do the EXACT same thing, I’m a minor too and I can’t tell my parents about it.",
          "created_utc": 1593527484.0
        },
        {
          "id": "fwhrrlj",
          "author": "ae_and_iou",
          "body": "shy light wide touch roll expansion frighten cooperative outgoing vegetable\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1593537032.0
        },
        {
          "id": "fwmikwl",
          "author": "anyaburno8",
          "body": "No there’s literally no one I could talk to comfortably,",
          "created_utc": 1593637237.0
        }
      ]
    },
    {
      "id": "fwolsio",
      "author": "anyaburno8",
      "body": "Thank you for trying ❤️",
      "created_utc": 1593687715.0,
      "score": 1,
      "context": [
        {
          "id": "fwh85sf",
          "author": "anyaburno8",
          "body": "I do the EXACT same thing, I’m a minor too and I can’t tell my parents about it.",
          "created_utc": 1593527484.0
        },
        {
          "id": "fwhrrlj",
          "author": "ae_and_iou",
          "body": "shy light wide touch roll expansion frighten cooperative outgoing vegetable\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1593537032.0
        },
        {
          "id": "fwmikwl",
          "author": "anyaburno8",
          "body": "No there’s literally no one I could talk to comfortably,",
          "created_utc": 1593637237.0
        },
        {
          "id": "fwmnykq",
          "author": "ae_and_iou",
          "body": "overconfident spoon party flag modern slim faulty edge boast scale\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
          "created_utc": 1593639651.0
        }
      ]
    }
  ]
}