{
  "id": "hkgn0b",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1593771737.0,
  "title": "Request: Eating after everyone else",
  "selftext": "Does anyone else hate eating before the other people in your house eat? I always postpone eating dinner until my boyfriend eats, even when I’m super hungry. He comes home from work and either naps or plays video games and doesn’t eat dinner until 8 or later. I usually get frustrated and end up drinking to quench the hunger, and then wait to eat until he does or until he goes to bed. I don’t know how to get the strength up to eat when he’s not eating =\\",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hkgn0b/request_eating_after_everyone_else/",
  "score": 59,
  "num_comments": 11,
  "comments": [
    {
      "id": "fwsq4bl",
      "author": "caponsigrayina",
      "body": "I used to have phases where I didn’t want people seeing me eat. I can definitely understand this.",
      "created_utc": 1593777875.0,
      "score": 22,
      "context": []
    },
    {
      "id": "fwsrxqs",
      "author": "spaghettitime365",
      "body": "yes! sometimes my boyfriend will come home from work and he wont be hungry at all, and I have to convince him to eat something because I feel too weird to be the only one eating dinner.",
      "created_utc": 1593779293.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fwtfu4p",
      "author": "I-really-need-a-life",
      "body": "i can definitely relate. it was just another one of those weird food rules i had to get over 🤷‍♀️ for me i challenged it in stages:\n\n- eat at the same time, but take the first bite at the same time as his first bite\n\n- take one bite right before his first bite\n\n- take one bite before he sits down at the table\n\n- take take 3 bites before he sits down\n\n- eat a snack before he gets home\n\netc.\n\ndoing it in stages helped with the mental weight of it, and the small victories helped with motivation!!",
      "created_utc": 1593793421.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fwtgv5x",
      "author": "eviltatortot",
      "body": "Yes I use to and it was one of the last things I could overcome in my recovery. (Besides ordering food by myself when I was in college and eating it alone in a public place) all I can say it is weird, but it does become somewhat normal for me anyways. I like the one to do it in stages that I read in this thread. Maybe eat half by yourself (like on a patio or living room while your boyfriend is eating but still technically eating by yourself). Or one day make an appetizer for like half of your meal then eat the other half when your boyfriend gets home. \n\nAlso I would recommend talking to your boyfriend about this struggle. Then maybe you guys can form some sort of game plan. I hope all goes well for you (:",
      "created_utc": 1593793956.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwtna48",
      "author": "jeabgrenouille",
      "body": "I really relate to your feelings of frustration. I don't think you need to fight this in stages. I think you fight it by deciding that you supper is at a certain time, and you eat, knowing you will have to sit with the anxiety during and after, and knowing that you will not enjoy your meal and you will have to push through it anyway. I would even say to my boyfriend if he is supportive that I will be in a bad mood, and I would share my needs as well (I will be in a bad mood tonight because I'm going to do something that provokes my anxiety. Please leave me alone and know that it's not about you. Or please give me some extra hugs and cheer me on. Etc).\n\nThe first few times, it will be very hard, but it gets easier and easier as you continue to do it. It also helps to have a mantra of sorts. Megsy recovery often says something like \"My body does not gain weight based on what other people do.\" Your boyfriend could fast for a month and run a marathon every day, and you being near him, but not joining him will not change your body. I really needed this mantra when I went on a trip with my sister, who was not eating really at all. I was so hungry, and I got frustrated with her, but then I remembered that no matter how little she eats, my body will not be affected by her choices. I knew I would feel better if I just did my own thing and ate normally, and I did. The more I tried to compete with her, the worse I felt, the more frustrated I got, and the less I enjoyed the trip. I stopped competing with her and just focussed on trying to make good choices for myself and my happiness and I let her make her own choices.\n\nAlso, \"different bodies, different paths\". At this point, it is probably inconceivable that someone would wait to eat and not prioritize it, especially when you are so hungry. Someday, maybe you'll feel that way too, but in recovery, eating is, and should be your highest priority. Keep eating and challenging your fears, and the food focus goes away, bit by bit.",
      "created_utc": 1593797276.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwvgaki",
      "author": "moliviak-01",
      "body": "This is me too! I often won’t let myself eat until I know that my gf has eaten. It’s difficult because we don’t live together, and she sleeps until like 2pm everyday. Normally my parents force me to eat by then, which makes me feel really guilty. And if we eat together, I’ll only let myself eat as much as she does. I’m constantly trying to match her eating, which is very unhealthy because she has an ed too :(",
      "created_utc": 1593835955.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwsjboz",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1593771737.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwu1ps8",
      "author": "baileygrayson",
      "body": "I do this a lot. Not with my boyfriend but with my household.",
      "created_utc": 1593804912.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwu2rj6",
      "author": "strawbeemocha",
      "body": "yeah but even when it’s not in my house. my bf wakes up around noon and will eat breakfast around 1 or 2 and my lame competitive side wants to wait until he eats :’)",
      "created_utc": 1593805486.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwvl03c",
      "author": "SprinkleOfCynicism",
      "body": "I straight up hate eating in front of people if they’re not eating, makes me feel really uncomfortable and self-conscious. If the food is a messy food, even worse",
      "created_utc": 1593839553.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwtqu7s",
      "author": "mceb16",
      "body": "Thanks! I love the megsy recovery account! She has the same name as me =)",
      "created_utc": 1593799105.0,
      "score": 3,
      "context": [
        {
          "id": "fwtna48",
          "author": "jeabgrenouille",
          "body": "I really relate to your feelings of frustration. I don't think you need to fight this in stages. I think you fight it by deciding that you supper is at a certain time, and you eat, knowing you will have to sit with the anxiety during and after, and knowing that you will not enjoy your meal and you will have to push through it anyway. I would even say to my boyfriend if he is supportive that I will be in a bad mood, and I would share my needs as well (I will be in a bad mood tonight because I'm going to do something that provokes my anxiety. Please leave me alone and know that it's not about you. Or please give me some extra hugs and cheer me on. Etc).\n\nThe first few times, it will be very hard, but it gets easier and easier as you continue to do it. It also helps to have a mantra of sorts. Megsy recovery often says something like \"My body does not gain weight based on what other people do.\" Your boyfriend could fast for a month and run a marathon every day, and you being near him, but not joining him will not change your body. I really needed this mantra when I went on a trip with my sister, who was not eating really at all. I was so hungry, and I got frustrated with her, but then I remembered that no matter how little she eats, my body will not be affected by her choices. I knew I would feel better if I just did my own thing and ate normally, and I did. The more I tried to compete with her, the worse I felt, the more frustrated I got, and the less I enjoyed the trip. I stopped competing with her and just focussed on trying to make good choices for myself and my happiness and I let her make her own choices.\n\nAlso, \"different bodies, different paths\". At this point, it is probably inconceivable that someone would wait to eat and not prioritize it, especially when you are so hungry. Someday, maybe you'll feel that way too, but in recovery, eating is, and should be your highest priority. Keep eating and challenging your fears, and the food focus goes away, bit by bit.",
          "created_utc": 1593797276.0
        }
      ]
    }
  ]
}