{
  "id": "hkgrri",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1593772436.0,
  "title": "Request: I think it's time to accept I've developed bulimia",
  "selftext": " \n\nI think it's time to accept I've developed bulimia\n\nI'm starting to get a sore throat from it. I've been losing weight by working out and doing OMAD but I really like candy. I find that when I eat it I throw up. I dont stick my finger down my throat or anything, I can literally just summon it.\n\nI'm scared that I'll develop throat cancer or bust my esophagus.\n\nHas anyone gotten a sore throat, stopped for awhile and it went away?\n\nDoes anyone have other advice for me?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hkgrri/request_i_think_its_time_to_accept_ive_developed/",
  "score": 41,
  "num_comments": 11,
  "comments": [
    {
      "id": "fwt1zu6",
      "author": "CoolClementine",
      "body": "I would try not buying any trigger foods. And avoid going shopping when you're hungry! Choose foods that are easy to digest and low in sugar and higher in fat and protein. Like a small dish of pasta with fish or chicken. Even something like fish sticks or baked chicken nuggets can be satisfying and because you baked them the total fats will be less than 20grams usually. Try to have meals instead of snacks! Its hard to stop binges, especially on delicious candy and junk. Try to give yourself more substantial options that you will feel good about.",
      "created_utc": 1593785854.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwu283x",
      "author": "taylorsayle",
      "body": "My advice; don't do diets (including fasting). They leave you with cravings (or even more cravings if you already had them) which is bad for bulimia. But that's just what my personal dietitian thought was best for me.\n\nI can also summon it, so you're not alone on that one. It almost makes it feel less bad knowing you didn't have to use like, a finger. And the sore throat does stop if you stop. It's the acid in your stomach coming up when you purge that irritates your throat, which can lead to damage. Some faster than others.\n\nIt also doesn't help with weight loss. You absorb most of the calories, but none of the nutrients. Esp with sugars, they absorb fast. \n\nIf you feel like binge-eating, or purging, try doing something with your hands to occupy yourself.",
      "created_utc": 1593805190.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwve5r8",
      "author": "TravelbugRunner",
      "body": "I've had Anorexia purging subtype for 12 years.\n So I know this feels. \n\nThe best thing to do is try to limit the triggering foods. \nIf you find yourself still needing to have them then try to try to switch over to chewing and spitting out the food. Do everything you can to avoid binging or purging because even though chewing/spitting is gross it's still less damaging than full on Bulimia. \n\nI have lost teeth, damaged my digestive track, and lacerated my esophagus and had blood coming out of my nose and mouth. There were times where I felt like i was going to die and at other times i was so miserable i wanted to die. \n\nIt's scary as hell. \n\nAlso please seek out some therapy for further insight ,support, and help. There are lots of support groups online and in person you can go to. \n\nBe safe and know you are worth it.",
      "created_utc": 1593834416.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwsn33b",
      "author": "None",
      "body": "I think you can only develop throat cancer ( because of bulimia) only if you suffer throat rupture( throw up blood)",
      "created_utc": 1593775298.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwsk0ug",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1593772436.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwt4ez9",
      "author": "None",
      "body": "I can relate so much to this. I purge a lot and I have developed a sore throat and my voice is all raspy. It got to the point where I couldn’t even laugh without feeling the pressure in my throat. After a while of not purging my throat healed up and I’m currently trying not to vomit. Of course I failed a couple of times and purged. But whenever I do I gargle water with baking soda and even swallow it. It calms down the acid in my throat and I don’t have discomfort the next day.",
      "created_utc": 1593787247.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwtd2ql",
      "author": "None",
      "body": "I feel bad that I'm jealous of your ability to just throw up...you don't want to know how many times I've accidentally thrown up on my hand....\n\nMy throat has started hurting recently, and my idiot self is like \"yeah, all those side effects won't happen to *me*\" but now they're starting. My teeth are sensitive, too, and I'm scared they'll start to decay.\n\nI stopped purging for, like, a week or two, and it went away, but as soon as I started again, it came back. Plus, I've only had bulimia since mid-April, so damage to my esophagus is probably lesser than most people on this sub.\n\nSeek out help!! Don't fall down this hole!!",
      "created_utc": 1593791982.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwto0lf",
      "author": "Jinxycanflush",
      "body": "Bulimia is a slippery slope. Allow yourself some candy and then mentally move on. You can do this! This is your fork in the road. You pick the path to respect yourself, not punish yourself, and your future won’t be ruled by an ED.",
      "created_utc": 1593797646.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwuabpz",
      "author": "supermandy42",
      "body": "Changes associated with Barrett's esophagus can happen strictly from repeated vomiting. You don't have to have a rupture or bleeding to develop cancer from the exposure to stomach acid.",
      "created_utc": 1593809675.0,
      "score": 3,
      "context": [
        {
          "id": "fwsn33b",
          "author": "None",
          "body": "I think you can only develop throat cancer ( because of bulimia) only if you suffer throat rupture( throw up blood)",
          "created_utc": 1593775298.0
        }
      ]
    },
    {
      "id": "fwugys3",
      "author": "voldemortthe-sceptic",
      "body": "thats not correct, it's actually quite unlikely to have both at the same time.\none would be a chronic complication after long term exposure to stomach acid causing metaplasia to the regular squamous epithelium which can result in cancer, the other would be an acute emergency that has a lethality of nearly 100% since people with eds usually have these at home in their bathrooms unsupervised.",
      "created_utc": 1593813404.0,
      "score": 2,
      "context": [
        {
          "id": "fwsn33b",
          "author": "None",
          "body": "I think you can only develop throat cancer ( because of bulimia) only if you suffer throat rupture( throw up blood)",
          "created_utc": 1593775298.0
        }
      ]
    },
    {
      "id": "fwubfkt",
      "author": "None",
      "body": "But the chance is very low",
      "created_utc": 1593810301.0,
      "score": 1,
      "context": [
        {
          "id": "fwsn33b",
          "author": "None",
          "body": "I think you can only develop throat cancer ( because of bulimia) only if you suffer throat rupture( throw up blood)",
          "created_utc": 1593775298.0
        },
        {
          "id": "fwuabpz",
          "author": "supermandy42",
          "body": "Changes associated with Barrett's esophagus can happen strictly from repeated vomiting. You don't have to have a rupture or bleeding to develop cancer from the exposure to stomach acid.",
          "created_utc": 1593809675.0
        }
      ]
    }
  ]
}