{
  "id": "hkrmi3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1593812744.0,
  "title": "Request: Boyfriend made a comment about my weight gain forgetting I’m a recovering bulimic",
  "selftext": "I was complaining about having big thighs this morning and my boyfriend said, “I mean you do have big thighs, but I love them!” It seems harmless and I’m sure he does love my big thighs, but it sent me into a sobbing mess. I’ve gained weight in quarantine, and it‘s brought back some very terrible feelings from my bulimia; that comment obviously made it worse. He immediately realized what he’d done and felt awful.\n\nI know he didn’t mean it in a bad way, but it’s HARD right now. I feel so gross. How do you cope with your significant other acknowledging your weight gain?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hkrmi3/request_boyfriend_made_a_comment_about_my_weight/",
  "score": 166,
  "num_comments": 22,
  "comments": [
    {
      "id": "fwuhtj3",
      "author": "ginaaa22",
      "body": "Hey! Im sorry, that must be so hard for you. Hopefully he will be more mindful now. If it helps, sometimes men just repeat things. Ive noticed they don't tend to notice little details, so it may be less that he *noticed* and more that he just *beleived you* when you said you had big thighs. \n\nDo you have anything lined up for when you get triggered? I have a box full of things that take me into a different head space. I call it my anxiety box. Mine is mostly filled with kidish things to send me back into that place before the eating disorder (I know that sounds really DD/LGish but its just something I've found helps me personally) and I also have extra green tea in there (which Is a comfort/calm drink for me), phrases that help me, like \"it is not your job to be a pretty thing to look at.\", and lastly, things that remind me of accomplishments I've made. \n\nHaving a box full of things that you find help when you get triggered can be very convinent in the moment. I know its not very helpful right now though. Im sorry that you are hurting. <3",
      "created_utc": 1593813883.0,
      "score": 58,
      "context": []
    },
    {
      "id": "fwulnz0",
      "author": "AngelMeatPie",
      "body": "Ask for compliments when you need them! It seems silly if you’ve never done it, but when I’m feeling really shitty about my self image, I ask my fiancé to tell me why he loves me and he always obliges. It makes me feel great. It also has the benefit of him picking up my self-shaming vibes so he’s gotten better at intervening when I’m down.",
      "created_utc": 1593816066.0,
      "score": 26,
      "context": []
    },
    {
      "id": "fwukef1",
      "author": "None",
      "body": "One thing I never do, is fish for compliments by negatively putting myself down in front of other people. It's not good for your self esteem, it puts the other person in an awkward position, and it can start to make the other person realize what could be seen a flaw, when they otherwise would never had noticed it. Sorry, I know I'm being all tough love on you, but I'd really try to stop putting yourself down to other people. You are what you think, say, and do. :) otherwise, I'm sorry and I hope you feel better soon. If my SO notices weight gain, I can spiral a bit. But it helps if I take some self-care measures, take a bath, read a book, go for a walk. Do something that makes you happy",
      "created_utc": 1593815337.0,
      "score": 29,
      "context": []
    },
    {
      "id": "fwvfl8v",
      "author": "mceb16",
      "body": "Yeah I hear ya. My boyfriend once said I have “meaty” calves. Like wtf?",
      "created_utc": 1593835440.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fwufslc",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1593812745.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fwv649g",
      "author": "Jinxycanflush",
      "body": "Bulimia is a mental battle with yourself. You can love those thighs just as much as your boyfriend. You have to train your thoughts constantly. It’s exhausting but it works. Remember he loves you and you have to convince yourself daily to love yourself. You are worth it!",
      "created_utc": 1593828892.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fww340e",
      "author": "None",
      "body": "This might not help but as a guy I must say sorry. Sometimes we are not very good at making compliments.",
      "created_utc": 1593857134.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fww6kg3",
      "author": "None",
      "body": "Oh noo...hope you're feeling better🥺 For me it was my friend. She said I looked better and  congratulated  me on finally having  actual boobies- which I'm grateful for but it got me thinking that boobs are just fat ... it triggered me none the less. It's silly that I cant  even take a compliment without having these thoughts",
      "created_utc": 1593860818.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwwcml7",
      "author": "vixissitude",
      "body": "I'm in a similar situation! I try to understand that my boyfriend tells me these things because he adores them. He is actively lifting my confidence up.\n\nThe key is communication! Tell him when something he says bothers you, and tell him when you're feeling bad if you can. I always try to tell my boyfriend when I have trouble with eating or I have disordered thoughts. I'm sure your boyfriend would be glad to help when he can.",
      "created_utc": 1593866435.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwwulmq",
      "author": "VampireDetective",
      "body": "Honestly, for me, there’s no right answer. Whatever answer I get, I’m going to be upset (didn’t mean for that to rhyme, haha). If I ask “do you think I’m fat?” and he answers yes, I’ll be upset, if he answers no I’ll accuse him for lying. Asking those types of question do neither of us any good, and it’s really unfair of me to put him in that position where he knows he will make me upset no matter what he says. It makes him the bad guy when really, the eating disorder is.",
      "created_utc": 1593877848.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwxpomr",
      "author": "extremecaffeination",
      "body": "Yo that sucks I’m sorry he was so insensitive. I have a really cool chart that is an “eating disorder” translator that you can share with loved ones — it shows what a loved one might say and how the brain of someone with an eating disorder might interpret it  (e.g. hearing  “you look so much healthier!” may lead to the thought *I’ve clearly gained a noticeable amount of weight.* Let me know if you want me to share this with you. \n\nIt’s really frustrating when you’ve communicated your needs around your health and body and he failed to live up to them this time, if he is supportive, he will take the time to understand why what he said is a BIG no no for you.",
      "created_utc": 1593894662.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzcy3rf",
      "author": "The_tired_doodler___",
      "body": "Im sorry about how that must of hurt. I might not be able to understand your pain but i can try give a lil advice for when it feels dark from my personal experiences. what I found help me feel a little better about my appearance was taking photos of my body that I felt looked \"unattractive\" and put some affirmations i wish to hear on the photo, for me it feels appreciating and i keep a collection hidden in my gallery so it's only for me to see.\n\nOr if i don't feel ready to take photos of myself, i take nice photographs of things that give me comfort like my bed, or the sun through my window, or something that reminds me of childhood when things were good. I'll take photos of it and either do the same thing like write affirmations or start with bridge statements which has also helped flipping my negative self talk, (a therapist named Kati Mortan on youtube made a whole video explaining this if you wanna watch it someday just type \"bridge statements\" and then her name) \n\nSorry for the long comment just hope this can at least help you or anyone else who's struggling.  Love you all !",
      "created_utc": 1595812509.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fwwuca5",
      "author": "TastySalt12",
      "body": "You've got a good one. \n\nSource: Mine does the same and he's a literal saint.",
      "created_utc": 1593877705.0,
      "score": 7,
      "context": [
        {
          "id": "fwulnz0",
          "author": "AngelMeatPie",
          "body": "Ask for compliments when you need them! It seems silly if you’ve never done it, but when I’m feeling really shitty about my self image, I ask my fiancé to tell me why he loves me and he always obliges. It makes me feel great. It also has the benefit of him picking up my self-shaming vibes so he’s gotten better at intervening when I’m down.",
          "created_utc": 1593816066.0
        }
      ]
    },
    {
      "id": "fwx6otj",
      "author": "0_surge",
      "body": "that’s just a bit harsh mate. \nthink of the situation yeah?",
      "created_utc": 1593884240.0,
      "score": 0,
      "context": [
        {
          "id": "fwukef1",
          "author": "None",
          "body": "One thing I never do, is fish for compliments by negatively putting myself down in front of other people. It's not good for your self esteem, it puts the other person in an awkward position, and it can start to make the other person realize what could be seen a flaw, when they otherwise would never had noticed it. Sorry, I know I'm being all tough love on you, but I'd really try to stop putting yourself down to other people. You are what you think, say, and do. :) otherwise, I'm sorry and I hope you feel better soon. If my SO notices weight gain, I can spiral a bit. But it helps if I take some self-care measures, take a bath, read a book, go for a walk. Do something that makes you happy",
          "created_utc": 1593815337.0
        }
      ]
    },
    {
      "id": "fwwmvnl",
      "author": "gnawtydog",
      "body": "He didn't also call you corn fed, did he? 🤣\n\nbtw- As the owner of meaty calves (hey, I was a gymnast!), I can relate!!",
      "created_utc": 1593873457.0,
      "score": 4,
      "context": [
        {
          "id": "fwvfl8v",
          "author": "mceb16",
          "body": "Yeah I hear ya. My boyfriend once said I have “meaty” calves. Like wtf?",
          "created_utc": 1593835440.0
        }
      ]
    },
    {
      "id": "fwxpqha",
      "author": "extremecaffeination",
      "body": "Lol yes I am made out of meat",
      "created_utc": 1593894692.0,
      "score": 1,
      "context": [
        {
          "id": "fwvfl8v",
          "author": "mceb16",
          "body": "Yeah I hear ya. My boyfriend once said I have “meaty” calves. Like wtf?",
          "created_utc": 1593835440.0
        }
      ]
    },
    {
      "id": "fwxq9vh",
      "author": "extremecaffeination",
      "body": "Literally me this week — also i no longer own bras that fit which has coincided conveniently with lockdown. For a number of reasons, I don’t love this new curvy feminine vibe I’m dealing with in recovery. I’ve started growing taller again and I’m 22 so I’m hoping this latent “development” doesn’t continue for too long but we don’t choose certain aspects of our bodies.",
      "created_utc": 1593895002.0,
      "score": 1,
      "context": [
        {
          "id": "fww6kg3",
          "author": "None",
          "body": "Oh noo...hope you're feeling better🥺 For me it was my friend. She said I looked better and  congratulated  me on finally having  actual boobies- which I'm grateful for but it got me thinking that boobs are just fat ... it triggered me none the less. It's silly that I cant  even take a compliment without having these thoughts",
          "created_utc": 1593860818.0
        }
      ]
    },
    {
      "id": "fwwzzh7",
      "author": "AngelMeatPie",
      "body": "We’re lucky girls! But I also think it’s part of a mature relationship - understanding your own needs and that of your SO’s and communicating them :)",
      "created_utc": 1593880729.0,
      "score": 2,
      "context": [
        {
          "id": "fwulnz0",
          "author": "AngelMeatPie",
          "body": "Ask for compliments when you need them! It seems silly if you’ve never done it, but when I’m feeling really shitty about my self image, I ask my fiancé to tell me why he loves me and he always obliges. It makes me feel great. It also has the benefit of him picking up my self-shaming vibes so he’s gotten better at intervening when I’m down.",
          "created_utc": 1593816066.0
        },
        {
          "id": "fwwuca5",
          "author": "TastySalt12",
          "body": "You've got a good one. \n\nSource: Mine does the same and he's a literal saint.",
          "created_utc": 1593877705.0
        }
      ]
    },
    {
      "id": "fwxh2mc",
      "author": "None",
      "body": "Hence why I said it's tough love, fam. Sometimes in order to make real change in an unhealthy situation, we need to change ourselves and what we do.",
      "created_utc": 1593889775.0,
      "score": 3,
      "context": [
        {
          "id": "fwukef1",
          "author": "None",
          "body": "One thing I never do, is fish for compliments by negatively putting myself down in front of other people. It's not good for your self esteem, it puts the other person in an awkward position, and it can start to make the other person realize what could be seen a flaw, when they otherwise would never had noticed it. Sorry, I know I'm being all tough love on you, but I'd really try to stop putting yourself down to other people. You are what you think, say, and do. :) otherwise, I'm sorry and I hope you feel better soon. If my SO notices weight gain, I can spiral a bit. But it helps if I take some self-care measures, take a bath, read a book, go for a walk. Do something that makes you happy",
          "created_utc": 1593815337.0
        },
        {
          "id": "fwx6otj",
          "author": "0_surge",
          "body": "that’s just a bit harsh mate. \nthink of the situation yeah?",
          "created_utc": 1593884240.0
        }
      ]
    },
    {
      "id": "fwwuomb",
      "author": "TastySalt12",
      "body": "One time on Minecraft my husband thought I was sneaking up on him but it was a cow. \"Is that you? Oh nevermind, it's just a cow.\" I was so triggered.",
      "created_utc": 1593877895.0,
      "score": 4,
      "context": [
        {
          "id": "fwvfl8v",
          "author": "mceb16",
          "body": "Yeah I hear ya. My boyfriend once said I have “meaty” calves. Like wtf?",
          "created_utc": 1593835440.0
        },
        {
          "id": "fwwmvnl",
          "author": "gnawtydog",
          "body": "He didn't also call you corn fed, did he? 🤣\n\nbtw- As the owner of meaty calves (hey, I was a gymnast!), I can relate!!",
          "created_utc": 1593873457.0
        }
      ]
    },
    {
      "id": "fwwxots",
      "author": "gnawtydog",
      "body": "🤣  Aww, hopefully it's funnier now in retrospect! In the moment, it's definitely not so humorous...I've been there more than once:)",
      "created_utc": 1593879506.0,
      "score": 2,
      "context": [
        {
          "id": "fwvfl8v",
          "author": "mceb16",
          "body": "Yeah I hear ya. My boyfriend once said I have “meaty” calves. Like wtf?",
          "created_utc": 1593835440.0
        },
        {
          "id": "fwwmvnl",
          "author": "gnawtydog",
          "body": "He didn't also call you corn fed, did he? 🤣\n\nbtw- As the owner of meaty calves (hey, I was a gymnast!), I can relate!!",
          "created_utc": 1593873457.0
        },
        {
          "id": "fwwuomb",
          "author": "TastySalt12",
          "body": "One time on Minecraft my husband thought I was sneaking up on him but it was a cow. \"Is that you? Oh nevermind, it's just a cow.\" I was so triggered.",
          "created_utc": 1593877895.0
        }
      ]
    }
  ]
}