{
  "id": "hmavrk",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594053067.0,
  "title": "Request: How to support girlfriend who has an ED?",
  "selftext": "My girlfriend told me she has an eating disorder and I never know how to correctly respond to her. She’s such a beautiful woman and I love her so much and there’s nothing I wouldn’t do to make her happy. She tells me the things she does and I try to give advice but she says “she’s not ready to be forced into recovery.” At this point I’m pretty lost on how I should handle the situation. Can anyone give me some advice on this? What I should say and do to try and help with along with what’s happening? Any advice is greatly appreciated. Hope you all have a good day.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hmavrk/request_how_to_support_girlfriend_who_has_an_ed/",
  "score": 85,
  "num_comments": 13,
  "comments": [
    {
      "id": "fx47pqm",
      "author": "BungalowBootieBitch",
      "body": "I think it's wonderful you are so supportive. I don't know how long y'all have been dating but this sounds like a new-ish relationship. I would say be prepared to be very patient. ED is tricky. Some days will be better than others. Empower her to feel confident in herself. I used to depend on people to make myself feel better and, of course, I would never feel better. I had to be my own cheerleader and be confident in my decisions.\n \n\nI think it's very important to say that her ED isn't your responsibility. I say that because as someone who has/had ED (I'm figuring things out in therapy) no one is responsible for making me better but me. Don't get me wrong there are people in my life who, I would say, are \"responsible\" for my ED, but that's in the past. Now I'm in therapy dealing with my mental health and feelings. Also, make sure she's always hydrated. Nothing to do with ED. Just general, good advice.",
      "created_utc": 1594055672.0,
      "score": 34,
      "context": []
    },
    {
      "id": "fx4d98m",
      "author": "FoxiiFighter",
      "body": "I respect you so much for wanting to support her. My boyfriend did so much research when we first started dating to try and cope with my eating disorder...and even after 2 years trying to recover it can still be a struggle. \n\nAnecdotally, the things that my boyfriend has done that has helped me the most is the research he did to try and learn, which meant the world to me, as well as his level of compassion. He's a very easy going guy and keeps a very cool temperament if he does witness me having an episode or engaging in negative behavior. This is really huge. If we think you are going to get mad at us, we aren't going to be as open with you. We communicate A LOT because he wants to understand what triggers I have and what drives my behavior. \n\nAnother thing that my boyfriend did, which I think is crucial, is setting a hard limit on medical intervention -  meaning that we have an understand that as long as I am not passing out or putting myself in immediate danger, he pretty much needs to take a backseat in most situations. However, if I pass out or require emergency medical attention,  I've given him the leeway to intervene and make necessary choices in order for us to remain together. (i.e. - I need to meet certain nutrition requirements, maintain a certain level of intake, etc.)\n\nOne thing YOU need to do is decide how much responsibility you want to take with this. Eating disorders are no joke, and depending on where your girlfriend is, you are going to spend a lot of time watching someone slowly kill themselves. In a way, its kind of like that addiction mentality. And there are so many times where I chose my eating disorder over my loved ones. This will happen to you, and you need to realize that she is very sick. If you are not in a position in life where you want this kind of responsibility, you need to man up and end the relationship. I know that's probably what you do not want to hear, but its a harsh reality. And there is nothing wrong with you acknowledging and deciding that this is or is not something you want in your life. \n\nIf you are willing to stick it out, there are a few things you can do ....If she won't recover in general, you could at least suggest her talking to a therapist. Maybe shift the focus off of food and just on what's going on in her head? Even a few sessions might be enough to flip some switches on how she's thinking. \n\nAvoid equating her \"Beauty\" with anything to do with her size. Focus on dates and activities that don't involve food so that you two can still spend good quality time together without the stress of food being involved. \n\nReach out to  [https://www.nationaleatingdisorders.org/](https://www.nationaleatingdisorders.org/)  and their helplines. They might be able to better direct you.",
      "created_utc": 1594058317.0,
      "score": 21,
      "context": []
    },
    {
      "id": "fx4yjxd",
      "author": "ae_and_iou",
      "body": "It’s very kind of you to want to support her any way that you can. My husband (at the time boyfriend) was in the same situation as you, so I’ll try to document some tips that I wish we would’ve known from the get go. \n\nIf she wants to talk about her struggles, be there to listen. She may vent about how difficult it is to manage her food (to eat/stop eating/stop purging/whatever), and for you it might feel like it’s really simple to just change. But to her, it isn’t. Unless she specifically wants advice, try not to tell her what to do. You can’t fix her problem. She has to do that herself. My husband would try to give advice, and it felt patronizing, even though it wasn’t.\n\nListen to her and empathize with her to the best of your ability - “that’s really difficult. I’m sorry you’re feeling that way. It sucks. I know it’s really hard. I’m here for you and I love you regardless of what size you are, how much you weigh, etc. You’ll always be beautiful to me.” \n\nIf she’s open to going to therapy, encourage her to go. You probably aren’t equipped to help her get healthy on her own. Even if she doesn’t want to commit to recovery, an ED focused therapist can break down WHY she feels the way she feels. Therapy has been the most helpful for my recovery.  \n\nDon’t shame her or judge her about her eating habits. If she eats more/less than you’re accustomed to, try not to call it out. I felt a lot of shame about my eating, and comments just compelled me to eat in private instead.\n\nFinally, remember to take care of YOURSELF! It is very difficult supporting someone through an ED. It’s emotionally exhausting. Remember to recharge and respect your own capacity. If you aren’t taking care of yourself, you won’t be able to support her. Talk to her about how you feel as things progress. Keep an open dialogue, and you’ll grow together. Good luck.",
      "created_utc": 1594068862.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fx4ikxx",
      "author": "almondslutt",
      "body": "Be supportive but don’t put pressure on her. This is her thing and something she needs to work on by herself. Talk about it as little or as much as she feels comfortable and do not judge her. In the end just be there for her and make her feel pretty :)) so great that you’re this concerned and wanting to do what’s right! We need more ppl like you :) xoxo",
      "created_utc": 1594061050.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fx56r36",
      "author": "Belly_Laugher",
      "body": "I feel for you friend.  I too used to be in your shoes and it is an alien landscape to navigate.  Eventually the relationship with my ex came to an end, not due to her ED, but it definitely puts a challenging spin on the relationship.  My GF was in denial and thought that the last 16 years of her ED was perfectly normal and that she had it under control so she didn’t need treatment.  The best piece of advice that I received was to simply tell her how it makes you feel.  I found those conversations were the easiest for her to stomach and not clam up from discussing her secret because she hated the light of the conversation being focused on her.  There’s a lot of good advice that you’ll find in this sub and I wish you the best of luck.  It might be a little cliche, but you’re also partially a victim of her ED.  It really tore at my heart strings.  Such a sensitive subject.  One thing I did was reach out to one of her friends that she told me was also aware of her ED, it just helped me by having someone to talk to about the issue.  Feel free to DM me.",
      "created_utc": 1594072926.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fx5v2nb",
      "author": "HikeSkiHiphop",
      "body": "I’ve been supporting my girlfriend with her ED for about two years. One year as a friend and one year dating. My best advice is get really good at apologizing. You’re gonna do or say things that are triggering. You’re not going to mean anything bad by it but EDs are enigmatic and some times you’re just gonna say the wrong thing. When you do, dont try to justify yourself. Don’t try to explain away your mistake. Just own it and say “I’m sorry, I will try my best to not do it again. How can I support you?”\n\nThen from there the only thing to do is listen and act accordingly. If something really bothers you to the point that it needs to be addressed, try to find a time when there is flexible time and have support strategies in place.",
      "created_utc": 1594086488.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fx5qhd6",
      "author": "claudiacetto",
      "body": "First and foremost: don’t judge !!!! \nOften, people will try to reason wilt people who have eating disorders by saying , “ you are not that big ! “ or , “ don’t throw up . Just move more and don’t eat junk food “ \n\nWhile these are very useful pieces of advice , eating disorders have little to do with food and a lot to do with emotions like anxiety, anger and frustration. \nSi just be a good listener and let your friend know she can trust you",
      "created_utc": 1594083781.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fx4wtys",
      "author": "Rachcake93",
      "body": "Thank you for caring and loving her in this way. So many men love their s/o but don’t even try and dive into helping with their ed.",
      "created_utc": 1594068028.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fx7716f",
      "author": "None",
      "body": "An eating disorder is an addiction.  The best way for you to help her is to help yourself.  People suffering from addiction are very hard to date but you have to ask yourself how do you become attracted to someone with an addiction?  \n\nNot to say your gf is an Awful person but you have to separate what is an addiction and the person.  Seek help for yourself first and you will know how to deal with your gf.  If you have no idea who you re as a person, you will be dragged down her rabbit hole. \n\nGood luck.",
      "created_utc": 1594125595.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fx42f6g",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594053068.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fx5gb6n",
      "author": "bobakittens",
      "body": "I feel the need to repeat what someone else said: IT IS NOT YOUR RESPONSIBILITY. I'm not saying dont be supportive or dont do research. I'm not saying that at all. But you need to remember her ED is not your responsibility. No one can fix it but her and it sounds like she doesnt want to. When I was deep in restricting, to the point I was awake for only 3 hours a day because i had such little energy, the part of my brain that regulated my ED thoughts would talk about how frail I was and incapable of caring for myself and how people would bend over backwards for me and take care of my needs. A lot of the good feelings from my ED came from being coddled by people. You walk a fine like between being supportive of the person and being supportive of the ED.\n\nSo I really want you to remember to take care of you first. EDs can make the person seem like someone else. It can be hard to separate who is the human and who is the ED. It can be emotionally exhausting and straight up, we can be outright abusive. If it ever gets to the point where you find yourself getting lost in trying to help, take a big step back and take care of yourself. You cannot help someone who doesnt want it.",
      "created_utc": 1594077933.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxr6i33",
      "author": "_Jachob",
      "body": "Hi everyone. I’m the one who wrote this post. I just wanted to say thank you to everyone who was responding. My girlfriend and I have been together for a couple months now (officially). We’re very happy together as well and we constantly talk about our future together, something neither of us really did before we found each other.\n\nWe have had a couple conversations about the ED. You should all be happy to know I’ve been taking the advice you’ve all shared. Empowering her, showing her no matter what she tells me nothing will change, spending quality time together, it’s going well. She still gets choked up when talking about certain things, and I’m working on trying to be a better listener so I know her triggers and what I must avoid. It was a tough journey to get there, but I did cook dinner for her this week, which I considered a win since she usually never lets me. Any other advice is greatly appreciated, and all of your kind words about me are helping me with my own personal issues. I hope you all are staying safe and well, and you have an amazing day. Thanks again.",
      "created_utc": 1594502837.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fx4i3qv",
      "author": "None",
      "body": "Completely agree with all these points, and especially wanted to emphasize researching and learning. Knowing that someone has made that extra effort to learn more about the things I struggle with means the world to me, and it also makes it easier to talk to them about my personal struggles or specific triggers because they already have some background info.",
      "created_utc": 1594060789.0,
      "score": 8,
      "context": [
        {
          "id": "fx4d98m",
          "author": "FoxiiFighter",
          "body": "I respect you so much for wanting to support her. My boyfriend did so much research when we first started dating to try and cope with my eating disorder...and even after 2 years trying to recover it can still be a struggle. \n\nAnecdotally, the things that my boyfriend has done that has helped me the most is the research he did to try and learn, which meant the world to me, as well as his level of compassion. He's a very easy going guy and keeps a very cool temperament if he does witness me having an episode or engaging in negative behavior. This is really huge. If we think you are going to get mad at us, we aren't going to be as open with you. We communicate A LOT because he wants to understand what triggers I have and what drives my behavior. \n\nAnother thing that my boyfriend did, which I think is crucial, is setting a hard limit on medical intervention -  meaning that we have an understand that as long as I am not passing out or putting myself in immediate danger, he pretty much needs to take a backseat in most situations. However, if I pass out or require emergency medical attention,  I've given him the leeway to intervene and make necessary choices in order for us to remain together. (i.e. - I need to meet certain nutrition requirements, maintain a certain level of intake, etc.)\n\nOne thing YOU need to do is decide how much responsibility you want to take with this. Eating disorders are no joke, and depending on where your girlfriend is, you are going to spend a lot of time watching someone slowly kill themselves. In a way, its kind of like that addiction mentality. And there are so many times where I chose my eating disorder over my loved ones. This will happen to you, and you need to realize that she is very sick. If you are not in a position in life where you want this kind of responsibility, you need to man up and end the relationship. I know that's probably what you do not want to hear, but its a harsh reality. And there is nothing wrong with you acknowledging and deciding that this is or is not something you want in your life. \n\nIf you are willing to stick it out, there are a few things you can do ....If she won't recover in general, you could at least suggest her talking to a therapist. Maybe shift the focus off of food and just on what's going on in her head? Even a few sessions might be enough to flip some switches on how she's thinking. \n\nAvoid equating her \"Beauty\" with anything to do with her size. Focus on dates and activities that don't involve food so that you two can still spend good quality time together without the stress of food being involved. \n\nReach out to  [https://www.nationaleatingdisorders.org/](https://www.nationaleatingdisorders.org/)  and their helplines. They might be able to better direct you.",
          "created_utc": 1594058317.0
        }
      ]
    }
  ]
}