{
  "id": "hmrq97",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594116080.0,
  "title": "Request: terrified of gaining back the weight i’ve lost after being overweight for several years, but sometimes i cannot control how much i eat",
  "selftext": " \n\ni’m 20f and i have been  binging, purging, and restricting for a few months. i’m terrified of  gaining back the weight i’ve lost after being overweight for several  years, but sometimes i cannot control how much i eat, and the next day  i’m so full i have to throw up. i also have a lot of medical issues that  have led to me gaining weight and being in a lot of physical pain, and  it’s easy to look to food for comfort. my mom and therapist have both  suggested inpatient treatment because i have panic attacks thinking of  food sometimes. i do not want to go to inpatient treatment. i haven’t  been since i was a minor and i’m scared of being in a unit with adults,  and i don’t want to be away from my life. i really don’t know how to  help myself, because i don’t want the help i’m being offered. i know  that i’m not doing well but i think my desire to continue losing weight  is too strong.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hmrq97/request_terrified_of_gaining_back_the_weight_ive/",
  "score": 82,
  "num_comments": 10,
  "comments": [
    {
      "id": "fx78arn",
      "author": "tobias0426",
      "body": "\nI'm 44 year old woman, who waited until I was 38 to finally get help with my Bulimia. It started when I was 15. It's a progressive disease. Don't waste your life because that's exactly what will happen. It controls EVERY decision you make, from what jobs you take, what holidays you go on (or should I say don't go on... It's robs you of real happiness. \n\nI am 6 years into my recovery and my only regret is that I didn't get help sooner. I missed out on so many experiences in life because  the disease controlled every aspect of my life. I'm happy, living my life and it's amazing to wake up everyday NOT hating myself. \n\nTrust me, you don't want to be 60 years old still fighting these demons and hating yourself. Take the step to recovery girl...you ARE worth it 😘",
      "created_utc": 1594126469.0,
      "score": 27,
      "context": []
    },
    {
      "id": "fx8jm60",
      "author": "jannellopez",
      "body": "I used to have an eating disorder in 2017 I was also overweight and I lost 30 pounds in such a short time. Everyone treated me differently yes but I was wasting my whole life thinking about food. There wasn’t one time my life didn’t revolve around food. 3 years later I probably gained back the weight slowly but I’m happy I don’t have to care, I’m happy I can just go out with my friends and eat without caring. There’s more to life then how much you weigh.",
      "created_utc": 1594150531.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fx8ivcf",
      "author": "FitLotus",
      "body": "I'm not sure what kind of therapy you're in now, but maybe look into outpatient treatment? I used to work for a clinic where the patients would spend the day at the clinic and then go home in the evenings to be with family and sleep in their own bed. I don't know the severity of your ED but maybe outpatient treatment could be part of your care plan!\n\nI have done inpatient treatment before and it was definitely scary but it was the best thing I've ever done for myself. It really jumpstarted my recovery.",
      "created_utc": 1594150178.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fx6w7q9",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594116080.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fx7lusi",
      "author": "dumpsterfirechaos",
      "body": "Good you reached out! \n\nyou‘re doing therapy for sm that has an influence on your life. this is a big step and really strong imo. nice to read that you‘re trying to take care od yourself in some way! you‘re worth it! \n\nyour therapist suggested sm you‘re not comfortable with because (i think what i got from your text) is changing your daily life and i totally get that. such a change is scary and maybe your friends and family give you comfort and you can talk with sb outside of therapy about how you feel. this is important. some place to feel good.\n\nmaybe concider changing your therapist if they insist on something you don‘t want to or if you feel like they are not fully understanding you. a therapist should help you with things that are troubling for you.\ntogheter you find a way to handle and process your coping mechanisms so they can change to sm that‘s healthy for you.\n\nyour relationship with food is distorted and you get that but your desire to weight a certain amount is stronger. this is what an eating disorder does to you. it changes prefrences. and that‘s okay in terms of accepting that that‘s what your brain does.\nit wants you to be „safe“ from the experience of gaining weight...\n\nif you feel comfortable with your therapist, talk with them about your fear of gaining weight if you have not yet. it‘s nothing to be ashamed of because it effects your thinking and your behavior - so it‘s something that‘s a part of you at the moment.\n\nand be sure: your mental health is as important as your physical health. so if loosing weight helps you being healthier in some way, i personally see no problem. but don’t hurt yourself to be a weight you want to be.\nmaybe your goal could be to be as healthy as possible. you deserve to be healthy and happy.\n\nmaybe your therapist has an idea how you can schedule your day to eat in a healthy way without restrictions or binging. it is a hard journey and it‘s okay to struggle. \nbut you started sm important to you and that‘s really good! take care of yourself, be gentle with your body and mind and a kilo more or less is - even tho our brains want us to believe this - not the fence that keeps you from happiness and self-confidence. \n\nbe proud of what you‘ve already achived - being conscious about how your mind works and how you want to be affected by it. \n\nevery small step is a step more. you can do this!",
      "created_utc": 1594134335.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fx7aw80",
      "author": "gnawtydog",
      "body": "Congratulations on your recovery and best wishes for continuing good health! I cannot give you enough upvotes on this golden advice!! 💜",
      "created_utc": 1594128166.0,
      "score": 5,
      "context": [
        {
          "id": "fx78arn",
          "author": "tobias0426",
          "body": "\nI'm 44 year old woman, who waited until I was 38 to finally get help with my Bulimia. It started when I was 15. It's a progressive disease. Don't waste your life because that's exactly what will happen. It controls EVERY decision you make, from what jobs you take, what holidays you go on (or should I say don't go on... It's robs you of real happiness. \n\nI am 6 years into my recovery and my only regret is that I didn't get help sooner. I missed out on so many experiences in life because  the disease controlled every aspect of my life. I'm happy, living my life and it's amazing to wake up everyday NOT hating myself. \n\nTrust me, you don't want to be 60 years old still fighting these demons and hating yourself. Take the step to recovery girl...you ARE worth it 😘",
          "created_utc": 1594126469.0
        }
      ]
    },
    {
      "id": "fx8o200",
      "author": "HIITBunny",
      "body": "Congratulations! I'm 32 and I just started therapy, recovery and working with a dietician a few months ago. Some days are still hard. With you being years into recovery is it hard some days or do you feel like \"normal \" eating is second nature now?",
      "created_utc": 1594152654.0,
      "score": 2,
      "context": [
        {
          "id": "fx78arn",
          "author": "tobias0426",
          "body": "\nI'm 44 year old woman, who waited until I was 38 to finally get help with my Bulimia. It started when I was 15. It's a progressive disease. Don't waste your life because that's exactly what will happen. It controls EVERY decision you make, from what jobs you take, what holidays you go on (or should I say don't go on... It's robs you of real happiness. \n\nI am 6 years into my recovery and my only regret is that I didn't get help sooner. I missed out on so many experiences in life because  the disease controlled every aspect of my life. I'm happy, living my life and it's amazing to wake up everyday NOT hating myself. \n\nTrust me, you don't want to be 60 years old still fighting these demons and hating yourself. Take the step to recovery girl...you ARE worth it 😘",
          "created_utc": 1594126469.0
        }
      ]
    },
    {
      "id": "fx8qmy0",
      "author": "jeabgrenouille",
      "body": "Yes!!! It doesn't matter if you are overweight or not!! Restriction and rapid weight loss can trigger extreme hunger and food focus. It's not a happy life.",
      "created_utc": 1594153919.0,
      "score": 2,
      "context": [
        {
          "id": "fx8jm60",
          "author": "jannellopez",
          "body": "I used to have an eating disorder in 2017 I was also overweight and I lost 30 pounds in such a short time. Everyone treated me differently yes but I was wasting my whole life thinking about food. There wasn’t one time my life didn’t revolve around food. 3 years later I probably gained back the weight slowly but I’m happy I don’t have to care, I’m happy I can just go out with my friends and eat without caring. There’s more to life then how much you weigh.",
          "created_utc": 1594150531.0
        }
      ]
    },
    {
      "id": "fx8rcdc",
      "author": "tobias0426",
      "body": "The first year was a struggle but I just had to keep reminding myself why I was doing it. I promise you, it does get easier and most days, weeks and months you forget you have ED. There are still the occasional moment where it tries to sneak up on you but you will have the tools you need to work through it. Be proud of yourself no matter what because it's the scariest journey to start at first. Kudos to you for having the courage to want more for yourself 👏",
      "created_utc": 1594154269.0,
      "score": 3,
      "context": [
        {
          "id": "fx78arn",
          "author": "tobias0426",
          "body": "\nI'm 44 year old woman, who waited until I was 38 to finally get help with my Bulimia. It started when I was 15. It's a progressive disease. Don't waste your life because that's exactly what will happen. It controls EVERY decision you make, from what jobs you take, what holidays you go on (or should I say don't go on... It's robs you of real happiness. \n\nI am 6 years into my recovery and my only regret is that I didn't get help sooner. I missed out on so many experiences in life because  the disease controlled every aspect of my life. I'm happy, living my life and it's amazing to wake up everyday NOT hating myself. \n\nTrust me, you don't want to be 60 years old still fighting these demons and hating yourself. Take the step to recovery girl...you ARE worth it 😘",
          "created_utc": 1594126469.0
        },
        {
          "id": "fx8o200",
          "author": "HIITBunny",
          "body": "Congratulations! I'm 32 and I just started therapy, recovery and working with a dietician a few months ago. Some days are still hard. With you being years into recovery is it hard some days or do you feel like \"normal \" eating is second nature now?",
          "created_utc": 1594152654.0
        }
      ]
    }
  ]
}