{
  "id": "ho076r",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594287379.0,
  "title": "Request: Lost ability to “feel hungry”",
  "selftext": "I’m not sure anyone else has this issue or not. I’ve been in recovery for about 3 years after an over 10 year battle with anorexia. I am guessing the constant suppression of hunger for so long has put me where I don’t recognize hunger at all even after being in recovery. I’ve managed so far by having an eating schedule. However, now having a baby, I find myself inadvertently skipping meals. The main reason being I never “feel hungry”.  I do recognize I’m on a slippery slope since I very much hate how I look post baby. Does anyone have advice to relearn it or how to not keep slipping into a relapse?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ho076r/request_lost_ability_to_feel_hungry/",
  "score": 87,
  "num_comments": 12,
  "comments": [
    {
      "id": "fxeo3wo",
      "author": "None",
      "body": "It ussually happens to me too. What I ussually try to do is identify whether I'm feeling dizzy or angry. It ussually happens within 4 hours of having eaten something, and I guide my eating habits by that many hours.",
      "created_utc": 1594287630.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fxep376",
      "author": "babie_nami",
      "body": "I would love it if your can share how you overcame and prepped your body for the baby. Like how long did it take and how much did you eat etc. I’m not sure if these are too private to ask but I suffered for the same thing and I lost my baby at 7 weeks, doctors say it’s chromosome abnormality but I can’t help but to wonder if it’s Cus my body just isn’t fit for pregnancy. \n\nBut go back to your post, I think it happens a lot.. never feel hungry or can’t tell when we are full.. it’s a real struggle. My therapist told me to set times to eat, develop a regular eating schedule would help. That sounded easy enough til I start to feel I’m eating too much (even if it’s just healthy clean 3 meals a day). Have you tried the schedule tactic?",
      "created_utc": 1594288611.0,
      "score": 10,
      "context": []
    },
    {
      "id": "fxeydju",
      "author": "None",
      "body": "i find if i force myself to eat tiny things throughout the day, the next day my hunger cues are stronger. and if i eat a lot of carbs for dinner (a sandwich or pasta or something) then im usually hungry in the morning. you may just have to retrain your body\n\n&#x200B;\n\nedit: recommendations for food to snack on if you really just dont wanna eat: pickles, olives, celery dipped in guacamole, a handful of crackers dipped in pesto. basically anything that is very \"savory\" and has a strong flavor but light profile so your *body* enjoys it but you dont really feel like you ate anything",
      "created_utc": 1594296854.0,
      "score": 11,
      "context": []
    },
    {
      "id": "fxetlqi",
      "author": "iceomint365",
      "body": "I find rough scheduling helps as in if i haven't had breakfast by 11 then I make time eat something. Lunch by 3 and dinner by 9. Obviously I try and have these meals at more normal time or if i feel hungry but have reminders set on your phone to the latest times you want to have certain meals by.",
      "created_utc": 1594292944.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fxhi93j",
      "author": "teaspidey",
      "body": "Keep on the eating schedule, but I look for other cues. Set more alarms for food maybe? Like if you keep turning off a 4 o'clock alarm set another one for 4:05. Then 4.07. Then 4:11. I use times like this cause they feel more jarring and urgent. For other cues I look for stuff that isnt just the \"feeling of hunger\". For example, I get really quiet and stuff when I'm hungry. Noises feel louder and I get more overwhelmed and snappy. Meal prepping kinda helps cause then it's there and prepared and I dont even have to think about it, which is nice. I would also look over your current schedule and see if theres any way you could adjust it so that it fits in with your life now. \n\nAlso, weird one but carrying snacks helps me. That way I feel prepared to react to the alternative hunger cues.",
      "created_utc": 1594344418.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fxeyuy6",
      "author": "tearsunderskin",
      "body": "What i found works for me is strength training or just being outside and breathing fresh air or also i think it will work with brain games, sudoku, crosswords or something like that. \n\nShare if it will help you!",
      "created_utc": 1594297211.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxi08ep",
      "author": "ellysaria",
      "body": "Eating something small very regularly should help. Once you are used to not eating for extended periods of time your body produces less hormones that induce hunger. If you eat something small, like a couple of grapes, nuts, olives, a bit of bread, etc. every hour or so your body should get used to eating again and start giving you hunger cues.",
      "created_utc": 1594355651.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxenurl",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594287379.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxst111",
      "author": "abo0486",
      "body": "It took me many years to have hunger signals- I could only feel starved or stuffed. It takes a long time of noticing how you feel before/sharing/after a snack or meal to get to where I could feel again. I’m a mommy to a toddler and honestly, having a snack basket at my breastfeeding spot helped me. Packing snacks in your purse, and even if the nursery helps. Eating meals with your partner or family helps too.",
      "created_utc": 1594529094.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxfd3d3",
      "author": "None",
      "body": "This has helped bring back my hunger cues as well! Definitely recommend this to OP",
      "created_utc": 1594305732.0,
      "score": 7,
      "context": [
        {
          "id": "fxeydju",
          "author": "None",
          "body": "i find if i force myself to eat tiny things throughout the day, the next day my hunger cues are stronger. and if i eat a lot of carbs for dinner (a sandwich or pasta or something) then im usually hungry in the morning. you may just have to retrain your body\n\n&#x200B;\n\nedit: recommendations for food to snack on if you really just dont wanna eat: pickles, olives, celery dipped in guacamole, a handful of crackers dipped in pesto. basically anything that is very \"savory\" and has a strong flavor but light profile so your *body* enjoys it but you dont really feel like you ate anything",
          "created_utc": 1594296854.0
        }
      ]
    },
    {
      "id": "fxjo2ne",
      "author": "barnlit",
      "body": "This is also what helped me!! Really listening to my body and sticking to that schedule of eating every 2-3 hours has helped so much. I used to get famished and my stomach would hurt so bad it was almost impossible to eat anything. Now my stomach even growls sometimes and I know it’s time to eat!! \n\nOther cues I watch out for are if my hands are shaking or I’m getting irritable. It can be hard retraining the body, I’m still working on learning and listening to “fullness” cues because I don’t really feel full. \n\nThose snacks sound awesome I’ll give them a try too, thank you!",
      "created_utc": 1594399375.0,
      "score": 2,
      "context": [
        {
          "id": "fxeydju",
          "author": "None",
          "body": "i find if i force myself to eat tiny things throughout the day, the next day my hunger cues are stronger. and if i eat a lot of carbs for dinner (a sandwich or pasta or something) then im usually hungry in the morning. you may just have to retrain your body\n\n&#x200B;\n\nedit: recommendations for food to snack on if you really just dont wanna eat: pickles, olives, celery dipped in guacamole, a handful of crackers dipped in pesto. basically anything that is very \"savory\" and has a strong flavor but light profile so your *body* enjoys it but you dont really feel like you ate anything",
          "created_utc": 1594296854.0
        }
      ]
    }
  ]
}