{
  "id": "hom4rb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594374475.0,
  "title": "Request: I want to feel normal again",
  "selftext": "I can't eat the food I used to because I've become sick of it I try eating it again but my body doesn't allow it just the thought of it makes me feel sick and it's really annoying me because I just feel sick all the time because I can't eat like most of the basic food that's at my bfs house it makes being at his house so hard because my family is used to me and what I eat. I've been on and off with starving myself which might have something to do with it idk. \nSomeone just help me please.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hom4rb/request_i_want_to_feel_normal_again/",
  "score": 40,
  "num_comments": 6,
  "comments": [
    {
      "id": "fxjbq1o",
      "author": "jeabgrenouille",
      "body": "With respect, this may not just pass as someone suggested below. People can starve themselves for many years until they die or get into binge/purge cycles until they die or need medical attention. Some things don't just go away on their own. \n\nI don't feel you've really given us enough information for us to be able to give a meaningful response. I will say that when I was first unwell, I told everyone that I wasn't eating because eating made me feel sick. It was not exactly the truth... I knew there was nothing physically wrong with me, but eating did make me feel so much anxiety and terror, and that was a simple way to say it. I used to always complain that my stomach hurt, though I didn't really have a stomach ache. Again, I had anxiety.\n\nIs your feeling physically sick related to anxiety? If so, it may be time to reach out for help. For me, I was hospitalized for a few months and put on some anxiety medication short-term (a year or two). Both of those things just unlocked my life and freed me and made me feel like myself again. It wasn't perfect. I relapsed a few times, sadly, but at least I got a break from the dreary life that starvation had created.\n\nIf any of this rings true, don't just wait and see if it blows over. Don't just take a vitamin. Ask yourself some questions about what is really happening here and seek help.",
      "created_utc": 1594393236.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fxitow1",
      "author": "ant_society",
      "body": "That sounds really difficult, i get myself into similar situations! If you’re starving yourself it makes it very hard when you actually come to sit down and eat a meal, I find I get so nauseous and my appetite is gone! To help this I make sure to snack on fruits, hummus and veg dips, things that aren’t so heavy on the stomach so that when it’s meal time I don’t feel totally destroyed! \n\nIf you haven’t already, and you feel comfortable enough, have a chat with your boyfriend. It’s hard to think about what to eat when you don’t want to think about it at all! He may be able to take some pressure away and cater to your needs, remember; the people around you can help, it’s hard to communicate such a complex thing and it can hurt to do so, but you will be building up a positive and safe environment by establishing what you need! You’re allowed to struggle and you don’t need to hide that from the people around you. <3",
      "created_utc": 1594382282.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fxil6yk",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594374476.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxjmxnb",
      "author": "baileybrocket",
      "body": "I’m sorry and I hope you find peace soon. You are not alone !",
      "created_utc": 1594398822.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxkehsp",
      "author": "rbateson",
      "body": "It may be a long time before you feel normal again around food and that is okay. If you can bring snacks you like to your bfs house maybe they will help? I’m sorry this is causing you lots of anxiety. Maybe let you parents know what is going on and see if they can get you in with a counselor or a dietitian. It’ll all be okay!",
      "created_utc": 1594412261.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxiwu36",
      "author": "taylorsayle",
      "body": "Everyone has and deserves to eat. Even if they dont want to. \n\nTake a multivitamin in the meantime. Do your best to take care of yourself. This will probably pass soon. Hold on.",
      "created_utc": 1594384608.0,
      "score": -1,
      "context": []
    }
  ]
}