{
  "id": "hoo5e4",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594384495.0,
  "title": "Request: I told my friends Mother I’m worried she might have an eating disorder",
  "selftext": "I just went behind my friends back and told her mother that I am extremely worried that her daughter might be developing and eating disorder and I feel SOO guilty about it. It feels like I just betrayed my friend but I know it’s for the best for her. Did I do the right thing?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hoo5e4/request_i_told_my_friends_mother_im_worried_she/",
  "score": 48,
  "num_comments": 15,
  "comments": [
    {
      "id": "fxiyqap",
      "author": "None",
      "body": "If you know for sure that her mother is going to take over in a supportive manner and that you know it’s for the best then you did the right thing!",
      "created_utc": 1594385862.0,
      "score": 33,
      "context": []
    },
    {
      "id": "fxjalkm",
      "author": "bearthedog3",
      "body": "Have you asked/talked to your friend about it already? I would always suggest speaking to your friend first, and depending on her response, could make a huge difference to know if this was the right thing to do or not.",
      "created_utc": 1594392660.0,
      "score": 18,
      "context": []
    },
    {
      "id": "fxjgcpq",
      "author": "MathyMama",
      "body": "Please do not feel guilty. It sounds like you did the right thing. There aren’t many great options when you see someone you think is suffering. Often family support is the first and most important. I hope things go well.",
      "created_utc": 1594395594.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fxk0ims",
      "author": "quantumshrarry",
      "body": "Well many things to consider..do her parents really understand eating disorders? If they do then you did the absolute correct thing but if they don’t understand it completely then, I’m really sorry to say this, but it’ll be a pain in the ass for her. Ed just becomes soooo much harder when living with parents who don’t understand..I hope you’ll look further into this and take the right decision..do tell your friend about this tho..she should not learn it from her mother that you let her know..it should come from you..also I completely believe in your intentions and there’s no wrong in being worried,I believe you would’ve assessed the situation and then taken the correct decision but if you see anything wrong with her mom, please take immediate action",
      "created_utc": 1594405357.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fxjbsiu",
      "author": "the_scientist52",
      "body": "There's no way for us to know if it was the right thing without knowing more details.  Why do you think this friend might have a problem?  Is her family likely to be supportive and help her find treatment?  Or will they be angry, deny the issue, be triggering, etc.?  Sometimes telling someone's family is the best thing to do, and sometimes it isn't.  It sounds like your heart is in the right place, though.",
      "created_utc": 1594393273.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fxl1gva",
      "author": "jeabgrenouille",
      "body": "When you have an eating disorder, anyone who is an enemy to your disorder feels like your enemy. I felt like I hated my family for making me eat at the time. I think you did the right thing to raise your concerns to her mom. Your friend might be angry with you for a while, but I do not believe for a second that you betrayed her. I think, when you care about someone and know they need help, you tell someone who you believe will help them. When I was sick, other adults would notice my behaviour and pull my mom aside to tell her their concerns. Moms can miss noticing an eating disorder in their child because they are in denial. That's what happened with my parents, anyway. I personally never felt any negativity towards the people who told my mom their concerns, but every situation is different. \n\nI would be prepared that your friend could be upset, but know that sometimes loving someone requires you to do and say things that they don't want you to.",
      "created_utc": 1594424582.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxkzrgr",
      "author": "therathrowaway2",
      "body": "I think you did the absolute right thing and you should feel proud of yourself. How I wish a friend told my parents when I was a teenager! It is not your secret to bear... even if your friend is upset with you for now, one day they will look back and feel grateful that you led them on the path to help.",
      "created_utc": 1594423588.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxl6ls6",
      "author": "None",
      "body": "As a bulimic I wish one of my friends would’ve told my mom and got me the help I needed sooner. Bulimia is life ruining",
      "created_utc": 1594427634.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxl84jl",
      "author": "Shorse_rider",
      "body": "It's worse to sit back and not do anything",
      "created_utc": 1594428569.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxlc31e",
      "author": "AlliSpottsDeLazzer",
      "body": "You did a strong thing, and you felt it was right when you decided to do it. We can always second guess, but your intention was care. So right there, it came from a good, \"right\" place....",
      "created_utc": 1594430968.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxm2xmo",
      "author": "anime_alexander",
      "body": "This is all based on my experiences and opinions but, it really depends on what her parents are like. If you know for an absolute fact that they are good people and care about their daughter, then yes, I believe you did the right thing. However, if that’s not the case you could make things worse. \n\nI personally have struggled with disordered eating for quite a while, and the actions of my family have only made it worse. My parents believe that I’m fat, they make fun of me, they encourage my “dieting,” and are happy when I lose weight through unhealthy means. If they were to find out I actually had an eating disorder they wouldn’t care, and that would only send me spiraling even further. \n\nI hope for her sake that she does have good parents who love her but that’s not the case for everyone. Not all parents are understanding of mental health issues.",
      "created_utc": 1594446707.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxkq6vm",
      "author": "None",
      "body": "Not to make you feel bad, but I would suggest not doing this. I was in the same situation as your friend once, and I felt so humiliated and paranoid when I found out that my friends, boyfriend, and parents had all been discussing my eating disorder without my knowing, all because a friend had told my mom. For me, this resulted in me being confronted in an intervention. I had panic attacks and relived that intervention for years to come, triggering me every time and snowballing me into substance abuse. I’m responsible for my actions but just saying...I 100% would not do this to a friend. If you’re her friend, BE her friend through this. By telling her mom, you’re basically saying “here, someone else deal with this. I don’t want to”. Good luck. I know you mean well",
      "created_utc": 1594418316.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxiwo8e",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594384496.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxl478w",
      "author": "jeabgrenouille",
      "body": "I think it depends. If the people in question are quite young, telling an adult can just be asking for help because you don't know how to help yourself or you know that you cannot help.\n\nI'm really so sorry that you did not feel like maybe others did not have your best interests at heart or were passing your problems off to someone else. I agree with you with your distaste for interventions. My family had one for me after I relapsed, and it made me very angry and uncomfortable and upset and it didn't work... You can't pressure someone out of an eating disorder usually.\n\nThat being said, when I was first sick, and my mom was unaware that it was anorexia, people who did not talk to me about it (I would most certainly have denied it and it would have done no good for them to talk to me first), but rather went straight to her and told her that they were concerned about me made a kind choice in my estimation, and they made a difference in my life... I got the help I needed. Before they told her, my mom was in denial and tried to justify my behaviour, but when other people confirmed her fears to her, she took it more seriously and took me back to the doctor, who started seeing me frequently, and ultimately, admitted me to treatment at the hospital, which I needed and I am very grateful for. I was a kid so I was not getting any kind of help without my parents knowing what was up.",
      "created_utc": 1594426198.0,
      "score": 1,
      "context": [
        {
          "id": "fxkq6vm",
          "author": "None",
          "body": "Not to make you feel bad, but I would suggest not doing this. I was in the same situation as your friend once, and I felt so humiliated and paranoid when I found out that my friends, boyfriend, and parents had all been discussing my eating disorder without my knowing, all because a friend had told my mom. For me, this resulted in me being confronted in an intervention. I had panic attacks and relived that intervention for years to come, triggering me every time and snowballing me into substance abuse. I’m responsible for my actions but just saying...I 100% would not do this to a friend. If you’re her friend, BE her friend through this. By telling her mom, you’re basically saying “here, someone else deal with this. I don’t want to”. Good luck. I know you mean well",
          "created_utc": 1594418316.0
        }
      ]
    },
    {
      "id": "fxo0772",
      "author": "None",
      "body": "Thank you for you thoughtful and kind words! You mage a great point that age (amongst many other factors) plays a factor. In my situation, I was 22, and the way it was handled felt inappropriate. For a child, I think it would make sense. My eating disorder was also bulimia, which I think inherently has a more secretive and shameful stigma. So, thats a factor too, when trying to find ways to best help a loved one with an ED. \n\nI’m so glad to hear that you got help and we’re able to get better!",
      "created_utc": 1594474020.0,
      "score": 2,
      "context": [
        {
          "id": "fxkq6vm",
          "author": "None",
          "body": "Not to make you feel bad, but I would suggest not doing this. I was in the same situation as your friend once, and I felt so humiliated and paranoid when I found out that my friends, boyfriend, and parents had all been discussing my eating disorder without my knowing, all because a friend had told my mom. For me, this resulted in me being confronted in an intervention. I had panic attacks and relived that intervention for years to come, triggering me every time and snowballing me into substance abuse. I’m responsible for my actions but just saying...I 100% would not do this to a friend. If you’re her friend, BE her friend through this. By telling her mom, you’re basically saying “here, someone else deal with this. I don’t want to”. Good luck. I know you mean well",
          "created_utc": 1594418316.0
        },
        {
          "id": "fxl478w",
          "author": "jeabgrenouille",
          "body": "I think it depends. If the people in question are quite young, telling an adult can just be asking for help because you don't know how to help yourself or you know that you cannot help.\n\nI'm really so sorry that you did not feel like maybe others did not have your best interests at heart or were passing your problems off to someone else. I agree with you with your distaste for interventions. My family had one for me after I relapsed, and it made me very angry and uncomfortable and upset and it didn't work... You can't pressure someone out of an eating disorder usually.\n\nThat being said, when I was first sick, and my mom was unaware that it was anorexia, people who did not talk to me about it (I would most certainly have denied it and it would have done no good for them to talk to me first), but rather went straight to her and told her that they were concerned about me made a kind choice in my estimation, and they made a difference in my life... I got the help I needed. Before they told her, my mom was in denial and tried to justify my behaviour, but when other people confirmed her fears to her, she took it more seriously and took me back to the doctor, who started seeing me frequently, and ultimately, admitted me to treatment at the hospital, which I needed and I am very grateful for. I was a kid so I was not getting any kind of help without my parents knowing what was up.",
          "created_utc": 1594426198.0
        }
      ]
    }
  ]
}