{
  "id": "hp7ibb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594461366.0,
  "title": "Request: My partner’s anorexia has come back full force and it’s destroying us. Please, please help.",
  "selftext": "Hey everyone. As I type this, I just got into yet another horrible argument with my boyfriend. My boyfriend was diagnosed with anorexia several years ago. When we met, he had just finished inpatient treatment and it seems like he did pretty good for a long time. But the last six months or so...it’s gotten bad again. Like BAD. He is a shell of a person. I don’t even recognize him most of the time. We argue constantly. I get so angry and in my helplessness and confusion and inadequacy and rage at anorexia I lash out and then comes the deep, horrible shame of knowing how unfair and cruel my words can be. I should know better. I do know better. And yet the anger I feel at this entity I see as literally having taken over the man I love is consuming. \n\n\nI don’t know what the fuck to do. It seems like everywhere I look for help as far as how to cope as the partner of someone with an ED is aimed at men whose partners are women, when our situation is the opposite. I know that doesn’t matter, or it shouldn’t...but the approaches or advice I find appear to be super specific and gendered. I don’t know what to do anymore. I have no idea. I am so afraid of losing him. I watched him die right in front of me several different times already due to an opiate addiction (though that’s no longer an issue) and im so so so afraid of watching him die slowly again because this is even worse. I never thought it could be worse than it was back then but it is. It’s eviscerating.\n\n\nHe is going to treatment next week. Inpatient. How the hell do I hang on and be supportive without losing my mind in the meantime? I hate who I’ve become. I feel so horribly guilty. All the time.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hp7ibb/request_my_partners_anorexia_has_come_back_full/",
  "score": 75,
  "num_comments": 8,
  "comments": [
    {
      "id": "fxnpadn",
      "author": "VoikukkaTaraxacum",
      "body": "I probably don't have the best advice as I haven't been in this situation (I'm the one with the ED in my relationship). But I would strongly recommend you reach out for support from your friends/family, if it's possible. You don't have to tell them what's going on if it's not appropriate but you need someone to talk to. A therapist would definitely be useful. \n\nIf you are in the UK the charity Beat has an online support group specifically for those who are supporting people with ED's, it's called the Aviary, and it runs Monday and Sunday evenings. If you're not in the UK then I would recommend something like that. \n\nPlease do what you can to take care of yourself, be kind to yourself. You are only human, you can't beat yourself up for not being perfect all the time. It's not plausible for you to stay strong for someone else all the time. Like the saying goes, you can't pour from an empty glass. \n\nI can understand the anger, I know it might sound lame but have you tried meditation or other mindfulness techniques? I get angry when I'm upset and maybe you are the same? Maybe writing in a journal and giving yourself a chance to process these emotions could help? \n\nAnd it's understandable that you guys are arguing a lot. I'm currently struggling with my ED, and I am soo irritable and defensive at the moment, I think this is common, but it definitely leads to more arguing. \n\nThe way me and my boyfriend are managing our conflicts due to my ED is we sat down and had a long discussion, that highlighted the triggers for my outbursts, what wound me up and how we can prevent escalation into an argument. Maybe when your partner is more physically stable, you could have a discussion about the things that start the arguments and work out together how to manage these things. I personally found that we argue because of anxiety and stress, not because we are actually angry with each other. \n\nI'm wishing all the best for you and your partner! It's absolutely a horrible thing to go through for BOTH of you, and I really hope you can get some support.",
      "created_utc": 1594468726.0,
      "score": 28,
      "context": []
    },
    {
      "id": "fxnpqk1",
      "author": "xxtatgirl93xx",
      "body": "My ED is currently at its worst and I can say it’s putting a strain on all my relationships. Somewhere inside of him he knows his is too and I’m sure that is hurting him. But right now it’s taking over everything. Cause that’s what it does. Everything we do is to give in to our ED. \nSo don’t feel like he doesn’t love you or care that he’s hurting you with his ED. Cause he probably knows but ED is stronger atm\nThat being said, It isn’t easy trying to support someone and be there for someone who can’t help themselves. It’s understandable to be frustrated and feel angry at times. My advice would be to take care of yourself. Perhaps find a therapist to talk things out. And maybe find a support group. Find others like you who can understand what you and he are going through. Gender doesn’t matter. ED is ED. It’s harder to be there for him if you aren’t also taking care of you. I hope my advice helps, and I wish you and him the very best",
      "created_utc": 1594469135.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fxnt1b1",
      "author": "annieo6008",
      "body": "Also you can join a support group or group therapy for people whose partners are struggling with an ed. Even though you feel guilty about it, your feelings of helplessness and rage are valid; you just need a place to process them outside of the relationship. Supporting someone alone is so so hard. Most people need help. Best of luck",
      "created_utc": 1594471483.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fxqhl11",
      "author": "rottenvomit",
      "body": "me and my partner are going through the same exact thing. except i’m your bf. and i’m so sorry. we didn’t mean for this to ever happen. we didn’t mean to destroy the relationship. be there for him when he goes in. if you can visit him, please do. please.",
      "created_utc": 1594496949.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fxolsjw",
      "author": "MysticalWateryEye",
      "body": "Honestly, take the time while they are inpatient to try and do your own therapy sessions, there are some support groups for people with partners/family members with EDs. \n\nWhenever you feel angry, instead of saying hurtful things, just say that you love them but don't love their behavior, and i know that sounds so childish, but it's a mental illness, yelling hasn't fixed it before and it won't in the future. Expressing how it makes you feel is important, but is also important to remember that just as you are struggling helping them, they are fighting with themselves and loathing every moment they are awake. There's nothing you can say that will be on the same level of what they are thinking themselves, but here's the problem, some words people without an ED don't realize that some words validate their issues, validate what they are doing.\n\nIf your partner will allow it, try going to a therapy session with them as well, helping with mental illness is hard, but i'd never want my partner to feel like they are absolutely out of control in this either. I feel that leads to resentment, but i've been on only the ED side, but since i have an ED a lot of my friends i've made struggle with it as well. Validation is key, but therapy will help a lot. \n\nJust like you hate who've you have become with all of this, they also hate who they are, they just might not have the enegry to voice it. Remind them that they fought addiction before, and they can do it again, but it takes time and energy.",
      "created_utc": 1594479929.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxtv04c",
      "author": "eviltatortot",
      "body": "Eds are still exhausting for people who supporting the one who suffers from it. I was the one with the ED and I said things and yelled at my ex multiple times  and I was toxic all around with people who knew me. I’m not proud of it but it is normal to argue and stuff. One thing to ALWAYS remember is that it is his eating disorder and it is not him. \n\nIn the mean time, do a lot of self care and in my experience if I know I’m going to impatient my behaviors/symptoms go haywire because it’s that last chance kinda thing and it may be a really hard week for both of you. Just support and be a listening ear until them. Push him to eat meals, but I know you can’t force him. My best advice is to be mindful (avoid saying stuff about calories, weight, appearance or anything else about that nature even if it is about yourself or other people) and also ask if he needs anything from you. \n\nMake sure you take care of yourself. Do some things you enjoy and take time for yourself. There is nothing wrong with that. The inpatient I went to had friends and family night or a support group for those types of people. which may be still a good thing to go to. It’s not necessarily direct for partners, but it can give out good advice for loved ones in general. I hope the best goes for you and your boyfriend.",
      "created_utc": 1594562494.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxnq5tk",
      "author": "taylorsayle",
      "body": "The best thing you can do is try to understand, and maybe do some research on EDs! I recommend this website because it resonated with me like no other:  [https://eating-disorders.org.uk/information/why-people-get-eating-disorders/](https://eating-disorders.org.uk/information/why-people-get-eating-disorders/) \n\nThe worst thing you can do is get mad at him. He really needs your compassion rn. And remember, it is not your responsibility to cure him. If you need a break, it is best to say it, before you both get hurt.",
      "created_utc": 1594469515.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxn8m21",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594461366.0,
      "score": 1,
      "context": []
    }
  ]
}