{
  "id": "hps05e",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594548025.0,
  "title": "Request: how to answer the question \"How did you lose weight?\"",
  "selftext": "It looks like I will soon be going back to the office after working from home for a few months due to lockdown. I've lost a lot of weight in that time, and knowing how diet-focused the women in my office are, I'm worried about their comments and questions. I don't think that the answer of, \"Healthy diet\" is going to convince anyone.\n\nPlease help me out - how do you answer when people ask you how you lost weight?\n\nWhen I used to cut myself and people would ask what my scars were from I had a really outlandish story that involved me being attacked by a lion. People never questioned it and it was hilarious to see reactions. I'm almost tempted to come up with something similarly odd about the weight loss. I'm just so nervous though.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hps05e/request_how_to_answer_the_question_how_did_you/",
  "score": 77,
  "num_comments": 32,
  "comments": [
    {
      "id": "fxtn3mn",
      "author": "VampireDetective",
      "body": "‘I did it an unhealthy way and really don’t want to get into it’\n‘My cat gave me such a fright the other night and it shocked some kilos of my body’\n‘Have I? I haven’t noticed, so I can’t really say what I’ve done differently’\n‘I don’t know, I’m not really interested in it either. What are your plans for the weekend?’",
      "created_utc": 1594556762.0,
      "score": 57,
      "context": []
    },
    {
      "id": "fxu4u03",
      "author": "Ev_Do_",
      "body": "Honestly you should just tell them that you don’t want to have that conversation and that you think asking questions and making commentary on peoples bodies is inappropriate.\n\nYou don’t owe anyone an explanation. And you certainly shouldn’t lie. You’re stating your boundaries, and by being honest, you’re disrupting the company culture of women commenting on each others bodies.",
      "created_utc": 1594568259.0,
      "score": 23,
      "context": []
    },
    {
      "id": "fxtivwj",
      "author": "None",
      "body": "I always was blunt about it. Usually I'd say something like \"Oh I don't think so\" but if they kept pushing im just like look I have an eating disorder and its literally killing me. I think part of that came from just being too tired to think of a lie, but honestly being blunt is needed sometimes. I wish commenting on someone losing weight wasnt so common place where I am, and I feel like by just telling people I have an eating disorder they can feel just as awkward as i felt when they brought it up :P",
      "created_utc": 1594552867.0,
      "score": 43,
      "context": []
    },
    {
      "id": "fxu16g2",
      "author": "jiji_r",
      "body": "If they don’t accept the answer of “oh I just walk a lot at work” or “I switched to water instead of soda” then I just get awkward and kinda rude about it cause they’re asking awkward and rude questions. “I drink enough whiskey to blind a horse and pass out every night to avoid eating. Thank you come again 🙏”\n\nI do the same thing with my scars! I tell people my cat did it and was an asshole and then they’re like oh wow did you get rid of it? And I’m like no it’s nicer to me now. Like fuck off you know exactly where they’re from stop acting obtuse.",
      "created_utc": 1594566170.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fxtf1uh",
      "author": "StopmeowingPaul",
      "body": "Your lion comment made me laugh, I used to say I jerked off a hedgehog about my scars to get people to drop it😅\n\nI usually address weight comments saying I've been stressed, or act shocked and say \"I wish\", but sometimes if I think they're straight up not going to drop it I just say I have an ED really bluntly or redirect it:  \"I doubt it, but you definitely look slimmer/toned, what type of exercise do you do?\"\n\nIdk you could say you got stuck in a drier and shrunk, you took a massive dump and ended up smaller, that you ate a funny sandwich and got worms, ...etc",
      "created_utc": 1594548906.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fxtndbq",
      "author": "wsc1983",
      "body": "I usually just tell people bluntly that I lost weight in a very unhealthy way that I don't think anybody should emulate, and if they continue pushing the subject I suggest that they prioritize physical activity over restricting their food intake.  It's probably not the answer you're looking for, but that's my way of dealing with it.  I'm not going to teach anyone how to harm their bodies.\n\nYou could also redirect the conversation by asking if they've ever heard about intuitive eating, and if they have, what they think about it.  Basically indirectly telling them that their mentality is toxic and they should do something about it.",
      "created_utc": 1594556994.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fxtpr8z",
      "author": "Kaleidosun",
      "body": "You can say you have a thyroid problem or something or that you got really ill. That's what I did! Just to let people know I didn't lose the weight in a natural or healthy way so they don't ask for diet tips",
      "created_utc": 1594558887.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fxtq005",
      "author": "tomhall44",
      "body": "“I start my day with lemon water, but now my teeth are f*cked up“\n\n“Intermittent Fasting changed my life 😊🙌🏻 Try it ☺️”\n\n“Just got into meal prepping and also eating less junk food”\n\n“I dumped my bf and got depression. Do not ask me anything more”\n\n“I have disordered eating habits and you should not look to me for inspiration”",
      "created_utc": 1594559070.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fxtv1zx",
      "author": "barnlit",
      "body": "After dealing w these comments for so long and other inappropriate comments I’ve just started being blunt about it. Telling people straight up that I have ED and it’s not healthy, and it’s not something to try. People get embarrassed sometimes, but it doesn’t make me feel so bad anymore, because it’s really not okay to comment on people’s weight. We have no idea what someone may be dealing with, and comments like that can be very detrimental to a person w ED. \n\nI’m not sure if that makes sense but when I was in the pits of my ED people asking me about my weight and commenting on my body made it ten times harder to recover bc in my mind I was able \nto rationalize it and made me feel justified in what I was doing. \n\nI understand and empathize with your anxiety, I used to also be afraid to say anything and felt a lot of shame around my ED. I feel being blunt and honest helps give me some of my power back. If you don’t feel comfortable going into detail or discussing it, here’s a few different options:\n-redirect the conversation to something else\n-“I don’t want to talk about it” \n-I got sick with a stomach virus/food poisoning\n-I’m not comfortable discussing this\nAnd the other lovely tips posted by other users. \n\nMy heart goes out to you and I hope that everything goes smoothly. :)",
      "created_utc": 1594562527.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fxtltei",
      "author": "Boosey0910",
      "body": "I'd just say \"oh this and that, you know?\"   Be vague. Let them wonder and hopefully mind their own business after that.",
      "created_utc": 1594555625.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fxuc3i3",
      "author": "user_han001",
      "body": "I usually just answer with “it’s probably just from stress” lol idk if they buy it but they don’t really ask follow-up questions",
      "created_utc": 1594572122.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fxtsjhh",
      "author": "teenytinylittleant",
      "body": "I used to work at a place like that and I started to wonder why so many women who barely know me felt so free to comment on my body. \n\nI would mumble something about vegetables and then complement something the person has on.",
      "created_utc": 1594560855.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxtjwtw",
      "author": "MTADO",
      "body": "“Love” is what i always say as a joke",
      "created_utc": 1594553863.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxv41kp",
      "author": "hhouseofballoons",
      "body": "my go to is saying i’ve cut back on sugar and am eating all food in moderation now. i’ve lost 50-60 pounds since last summer and it’s draining hearing ppl comment/question my weight loss all the time. especially when they’re congratulating you. one time after posting a full body photo a few months ago i had nearly 10 ppl message me asking how i lost so much weight. by the tenth person the only thing i could bring myself to say was “i have an eating disorder.” i was shocked when i realized i typed it out and sent those words :/",
      "created_utc": 1594586839.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxwvcsv",
      "author": "ThrowRA_photog1267",
      "body": "You don’t need to acknowledge it. You can just say “oh, have I?” And change the subject. Just because they ask the question doesn’t mean you need to share everything.",
      "created_utc": 1594630562.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxte81a",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594548026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxtkluv",
      "author": "None",
      "body": "When I got asked that after excessive bulimia periods in my life I always said I swapped my dinner for fruit, because that's what I usually do to lose excess weight after Christmas etc.",
      "created_utc": 1594554520.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxuxtpk",
      "author": "DirtyAngelToes",
      "body": "Due to lockdown, I wasn't able to eat out as much as I used to. That's pretty much all you have to say and people will sympathize with you.",
      "created_utc": 1594583469.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxvbmae",
      "author": "iwasntlucid",
      "body": "Lying about it only means it's a bigger problem and will draw more attention to it- trust me...been there. \n\nAre you seeing a counselor or anything? You need a support system. You can always just respond that you're trying your best to be well.",
      "created_utc": 1594590953.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxvus74",
      "author": "None",
      "body": "I usually just say \"I have an eating disorder\" because idgaf but if I'm really in a setting where I don't feel like I can say that, I just fudge it a bit with \"I get nauseated when I'm stressed.\"",
      "created_utc": 1594602215.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxw149u",
      "author": "hazelnut_mylk",
      "body": "i’ll say i have gastro issue (gastroparesis) or autoimmune problem (celiac) that cause intestinal damage and cause me to lose weight rapidly because my body can’t absorb anything. \nor say something about type 1 diabetes - that way it’s undesirable condition and no one would probe on.\n\nthat way it’s believable and no one would be able to verify that since your medical records are a very personal things that’s not shared with anyone except your attending doctor!",
      "created_utc": 1594606110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxwml4d",
      "author": "extremecaffeination",
      "body": "Maybe “I got treatment for a chronic health issue” ? Weight fluctuation can happen in a lot of different medical treatment. If they press on, tell them you don’t want to talk about it bc it’s none of their business? Comments about weight/body are really never okay in the workplace and I’m tired of people (mainly women) bonding over this crap.",
      "created_utc": 1594621911.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxun8l3",
      "author": "birdkey26",
      "body": "I wish I could upvote this more than once.",
      "created_utc": 1594577856.0,
      "score": 4,
      "context": [
        {
          "id": "fxu4u03",
          "author": "Ev_Do_",
          "body": "Honestly you should just tell them that you don’t want to have that conversation and that you think asking questions and making commentary on peoples bodies is inappropriate.\n\nYou don’t owe anyone an explanation. And you certainly shouldn’t lie. You’re stating your boundaries, and by being honest, you’re disrupting the company culture of women commenting on each others bodies.",
          "created_utc": 1594568259.0
        }
      ]
    },
    {
      "id": "fxtx6ze",
      "author": "updown27",
      "body": "This is my method also. I think it’s really inappropriate to ask people about their bodies and I avoid food talk because it’s triggering so I make sure the people around me know I’m not going to have those conversations. My reaction to “how did you lose so much weight?” would be “this pandemic has been really triggering to my eating disorder. I’ve been struggling to eat properly at home but I’m getting support and I’m ok”. OR if they talk about how they couldn’t stop eating during quarantine and compare themselves I could keep it simple with “everyone has been coping in their own way”. And when they compliment my weight loss or body or say they wish they had that problem I would end the conversation with “I’d rather not discuss it” and maybe even “it’s a very painful condition, I’d rather not discuss it”. To me it’s important to remind people that if you ask personal questions you might get very awkward, personal answers. Hopefully it will make people think twice in the future.",
      "created_utc": 1594563864.0,
      "score": 21,
      "context": [
        {
          "id": "fxtivwj",
          "author": "None",
          "body": "I always was blunt about it. Usually I'd say something like \"Oh I don't think so\" but if they kept pushing im just like look I have an eating disorder and its literally killing me. I think part of that came from just being too tired to think of a lie, but honestly being blunt is needed sometimes. I wish commenting on someone losing weight wasnt so common place where I am, and I feel like by just telling people I have an eating disorder they can feel just as awkward as i felt when they brought it up :P",
          "created_utc": 1594552867.0
        }
      ]
    },
    {
      "id": "fxw17wc",
      "author": "hazelnut_mylk",
      "body": "i tried this. except then they ask me... how to get an eating disorder so that backfired. diet culture really get some of these people really twisted because they think eating disorder is glamourous.",
      "created_utc": 1594606171.0,
      "score": 3,
      "context": [
        {
          "id": "fxtivwj",
          "author": "None",
          "body": "I always was blunt about it. Usually I'd say something like \"Oh I don't think so\" but if they kept pushing im just like look I have an eating disorder and its literally killing me. I think part of that came from just being too tired to think of a lie, but honestly being blunt is needed sometimes. I wish commenting on someone losing weight wasnt so common place where I am, and I feel like by just telling people I have an eating disorder they can feel just as awkward as i felt when they brought it up :P",
          "created_utc": 1594552867.0
        }
      ]
    },
    {
      "id": "fxvrqts",
      "author": "None",
      "body": "I told people I got in a fight with my cat when they were first healing and more noticeable years ago. And fuck every person for asking those questions. They do know exactly what it is from.",
      "created_utc": 1594600355.0,
      "score": 5,
      "context": [
        {
          "id": "fxu16g2",
          "author": "jiji_r",
          "body": "If they don’t accept the answer of “oh I just walk a lot at work” or “I switched to water instead of soda” then I just get awkward and kinda rude about it cause they’re asking awkward and rude questions. “I drink enough whiskey to blind a horse and pass out every night to avoid eating. Thank you come again 🙏”\n\nI do the same thing with my scars! I tell people my cat did it and was an asshole and then they’re like oh wow did you get rid of it? And I’m like no it’s nicer to me now. Like fuck off you know exactly where they’re from stop acting obtuse.",
          "created_utc": 1594566170.0
        }
      ]
    },
    {
      "id": "fxtgst5",
      "author": "peafowlenthusiast",
      "body": "my grandma once got a rental car and told my sister that her mini van went through a shrinky dink machine. She believed it for years. This comment reminded me of that lol. \n\nLove the redirection strategy by the way!! And for OP, this is the link to the workplace bullying institute. They have some good info on exit strategies: https://workplacebullying.org",
      "created_utc": 1594550755.0,
      "score": 10,
      "context": [
        {
          "id": "fxtf1uh",
          "author": "StopmeowingPaul",
          "body": "Your lion comment made me laugh, I used to say I jerked off a hedgehog about my scars to get people to drop it😅\n\nI usually address weight comments saying I've been stressed, or act shocked and say \"I wish\", but sometimes if I think they're straight up not going to drop it I just say I have an ED really bluntly or redirect it:  \"I doubt it, but you definitely look slimmer/toned, what type of exercise do you do?\"\n\nIdk you could say you got stuck in a drier and shrunk, you took a massive dump and ended up smaller, that you ate a funny sandwich and got worms, ...etc",
          "created_utc": 1594548906.0
        }
      ]
    },
    {
      "id": "fxwpbon",
      "author": "Millenial__Falcon",
      "body": "I go with \"meth\"",
      "created_utc": 1594624453.0,
      "score": 2,
      "context": [
        {
          "id": "fxtjwtw",
          "author": "MTADO",
          "body": "“Love” is what i always say as a joke",
          "created_utc": 1594553863.0
        }
      ]
    },
    {
      "id": "fxwrubv",
      "author": "MTADO",
      "body": "Too dark for the kind of people that will ask about this",
      "created_utc": 1594626957.0,
      "score": 1,
      "context": [
        {
          "id": "fxtjwtw",
          "author": "MTADO",
          "body": "“Love” is what i always say as a joke",
          "created_utc": 1594553863.0
        },
        {
          "id": "fxwpbon",
          "author": "Millenial__Falcon",
          "body": "I go with \"meth\"",
          "created_utc": 1594624453.0
        }
      ]
    },
    {
      "id": "fxxctq2",
      "author": "Millenial__Falcon",
      "body": "In my opinion, asking about it is jarringly rude and overly personal. I dont see an issue with responding in kind.",
      "created_utc": 1594646138.0,
      "score": 2,
      "context": [
        {
          "id": "fxtjwtw",
          "author": "MTADO",
          "body": "“Love” is what i always say as a joke",
          "created_utc": 1594553863.0
        },
        {
          "id": "fxwpbon",
          "author": "Millenial__Falcon",
          "body": "I go with \"meth\"",
          "created_utc": 1594624453.0
        },
        {
          "id": "fxwrubv",
          "author": "MTADO",
          "body": "Too dark for the kind of people that will ask about this",
          "created_utc": 1594626957.0
        }
      ]
    }
  ]
}