{
  "id": "hqcnga",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594634839.0,
  "title": "Request: Help: Years of ED has left shadows in my brain",
  "selftext": "I have been diagnosed with EDs (anorexia, BED, orthorexia) multiple times in my life and was able to “work” through it with professional help.\n\nMy last bout was with BED and I never felt more unattractive, more unwanted and shittier in my life. I haven’t binged as much, but lately I’ve been trying to work out and trying to eat mindfully to lose the weight I’ve gained. (Since BED I am a little overweight.)\n\nIt’s difficult. I count calories but I’m always scared I might go back to my anorexic ways, because even if I try not to, inside I know I have an encyclopedia of calorie counts in the back of mt mind.\n\nI’ve been eating mindfully for the majority of the last six weeks but I’ve had three binges that were all emotional and not hungry at all. I hate myself for it, I think I’m betraying myself and all the progress I’ve made. It was triggered because I wasn’t losing weight anymore, and I just felt like it was useless, but binging didn’t help.\n\nMy period has been fluctuating and I’ve been hating my period because of the cravings it brings that I sometimes have thoughts of a hysterectomy, but I know that removing the uterus other than not being able to give birth can also cause weight gain.\n\nI do have a counselor, but I’m not scheduled until a few weeks from now. I don’t know how dangerous I’ve gotten, because this is all I’ve known.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hqcnga/request_help_years_of_ed_has_left_shadows_in_my/",
  "score": 59,
  "num_comments": 8,
  "comments": [
    {
      "id": "fxybb4c",
      "author": "cmavepine",
      "body": "Hi. I'm 30, been dealing with bulimia for about 11 years, still is.\n\nYou are doing the right thing, eating mindfully. Also think of it as you taking care of your body by giving it nutritious food, rather than trying to lose weight. I too want to watch out for my weight, since I know that gaining weight/being unhealthy/binging will make me feel shitty both mentally and physically.\n\nI'm on my 2nd year, trying to recover. You always have to be on your guard against old habits. Please don't be too harsh on yourself if you B/P, just get on with your recovery right away.\n\nI think that the shadows you mentions will always be there. I for example, almost know the exact calorie amount in most foods. Think of it as you knowing a lot about healthy food, healthy weight and healthy habits.. and try to use all that knowledge in a healthy manner. \n\nKeep up the good work 💚",
      "created_utc": 1594664010.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fxzydky",
      "author": "oliviared52",
      "body": "I have another tip for anyone struggling with recovering. This sounds really stupid but I think it works lol. Whenever I would catch myself thinking something negative when I looked in the mirror I would take that opportunity to thank my body. \n\nLike when I would think my legs looked fat, I would say out loud “thank you legs for carrying me through the day”. Whenever I thought my arms looked fat I would say “thank you arms for being able to hang my curtains yesterday or pull me up rock climbing last week” or whatever it is. \n\nIt sounds dumb but I think it got me into the mindset of using food to fuel my body instead of punishment and reward. What made me think to do this was senior year of college I became good friends with a guy who is blind. This dude is one of the most positive, most funny people I know. He went blind when he was 18 and would share old Facebook posts that were super depressing from when he first went blind and he would say how he wished he could go back and talk to himself then. Because he thought his life was over but it was just beginning. He even started a non profit to help newly disabled people adjust to life and get jobs. And I realized how bratty I was being. I was over here hating my body when everything worked. I was over here hating how fat my legs are when there are people out there who don’t even have legs. It really put things into perspective for me. I hope that helps 😊 we gotta be thankful for our bodies. We only get one!",
      "created_utc": 1594694863.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fxwzfqw",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594634839.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxy2xt1",
      "author": "skinnylegendv",
      "body": "I’m in the exact same situation right now. To a T. I’m still looking for the answer myself",
      "created_utc": 1594660032.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxzs1rv",
      "author": "floppycatears",
      "body": "Hi I’m in recovery from all 3 of those eating disorders and well and all I can say is I see you. Recovery is so so hard. Sending my love. I’m kinda still unfamiliar with Reddit and rarely leave comments but my dream is to be an Ed therapist and spread awareness about orthorexia so if it’s possible to connect id like to offer my support. Anyhoo id recommend trying to forget about calories and counting and instead replace that energy into paying attention to your soul. What do you want? - to eat? Intuitive, mindful eating. Keep on fighting this grave fight.",
      "created_utc": 1594691111.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fxyqz87",
      "author": "clumsycouture",
      "body": "I’m 30 and suffered from BED for 5 years. I haven’t purged in almost 8 years now but it’s always in the back of my head. I know the feeling of betraying yourself and the self-hating that goes along with it. I used to think I could never eat food normally again but I am, and do. It gets better, don’t beat yourself up if you relapse tomorrow’s another day.",
      "created_utc": 1594671431.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fxzwvwz",
      "author": "oliviared52",
      "body": "I’d recommend to stop counting calories. A little into recovery I started an 80/20 rule where 80% of my food was primarily whole foods and 20% was whatever. I didn’t follow this super strictly but would think in my head to have about 4 meals at home (usually id make rice a veggie and a meat and put butter in the rice) and one meal out of I wanted. \n\nI totally know what you mean that your head is an encyclopedia for calories. Every plate I looked at I knew about how many calories and I couldn’t help it. But after a while it went away! \n\nMy last ED was bulimia and I had gained a lot of weight. At first in recovery I gained some because my body was craving anything calorie dense. Then once my body knew I wasn’t going to starve it again or throw up again those cravings went away. And I ended up losing a lot of weight in recovery without trying. I never thought that’d be possible. I just add the weight loss part because I think a lot of people are scared to recover because of the fear of gaining weight. But our bodies want to be healthy. its way easier to work with our biology to get there instead of against it. \n\nI still eat a toon of chocolate during my period. I always know my period is coming because I’m a bottomless pit for a day then have no appetite the next day. Even when I was poor I set aside money for chocolate during my period lol. Clearly our bodies need it. Chocolate has a ton of magnesium and other nutrients that are helpful during our period. But it’s not like you can just eat something else with magnesium in it once you’re craving chocolate. Once you’re craving chocolate, nothing else is gonna taste like chocolate. \n\nOnce you don’t feel guilty the binges will go away. You can stop eating chocolate once you’re satisfied because you know you can eat the rest tomorrow instead of feeling guilty and needing it all right now. I’m here if you need to chat. Good luck! You’ve got this!!!",
      "created_utc": 1594693961.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fy151es",
      "author": "Rachcake93",
      "body": "Sending you love and light. I relate to this and wish I could give you more advice but I’m struggling at the moment in secrecy. The only advice I can give you is you’re only as sick as your secrets & it’s the advice I should take too! Reach out and continue to meet w your therapist. DM me if you ever wanna chat",
      "created_utc": 1594730929.0,
      "score": 1,
      "context": []
    }
  ]
}