{
  "id": "hrfgh5",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594780670.0,
  "title": "Request: My Best Friend Has an ED",
  "selftext": "My best friend told me last night that she has an eating disorder and body dysmorphia. She didn't specify which one, just \"not anorexia\". She counts calories obsessively and always talks about and worries about being fat. She is on the lower end of healthy weight, toeing underweight. She asks me occasionally if I think she's fat. I don't know what to do because I know she isn't fat but also don't want to feed into her preoccupation with food and appearance. She knows she has an ED, I'm not asking how to get her into rehab. I just don't know what to say to her to not be problematic for her ED but also make her feel ok. I get so annoyed with the constant \"no I shouldn't eat that\". I hear her out and try to sort of balance her views on it but I feel like I enable her by acting like talking obsessively about calories is normal or ok (she knows it's not though). I need advice on how to act and talk about this sort of thing. I've never had to deal with it until now. When she says \"I'm so fat\" \"I shouldn't eat that\" \"I hate myself for eating this\" what should I say?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hrfgh5/request_my_best_friend_has_an_ed/",
  "score": 47,
  "num_comments": 11,
  "comments": [
    {
      "id": "fy41mr6",
      "author": "Shorse_rider",
      "body": "I think you need to try to advise her to get the right help and go see someone. Admitting she has a problem is huge so she knows deep down she needs to see someone about it. These things spiral without help early on and it's a LONG way back to normal eating",
      "created_utc": 1594786619.0,
      "score": 13,
      "context": []
    },
    {
      "id": "fy5bjel",
      "author": "jckofallmasterofnone",
      "body": "Its a difficult path to navigate because you need to be supportive but not pushy or judgmental. This disorder largely involves self hatred and one ounce of judgment could make someone feel worse. I think you need to let them know you care about them for who they are, not what they look like but do worry about how they process feelings about themselves and offer to help find resources to treat. I told only 3 people in my circle about my ED and oddly, none of them ever asked or acknowledged it again after I finally told them. It hurts that it took a lot for me to tell my 10 year secret looking for support and at the moment they were great, but am really on my own. I dont blame them, people dont understand and are scared to say the wrong thing.",
      "created_utc": 1594823711.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fy4s3dh",
      "author": "oliviared52",
      "body": "I agree with other people who are saying to talk to her about getting help. But I also want to add the fact that she’s telling you is a huge step. Even though all my friends knew I had an ED (I didn’t realize they all knew. I thought I was doing a good job at hiding it).... I didn’t tell anyone for years. When I did finally become open to talk about it that was a huge step toward recovery for me. I think it’s ok to tell her she’s not fat or that she can eat something. \n“I’m fat” “not at all, your beautiful” \n“I can’t eat that” “yes you can”",
      "created_utc": 1594810622.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fy6l22i",
      "author": "curlytheatregremlin",
      "body": "Don’t try to be her therapist. Be there for her, support her and try to make her feel better- you understand what she’s going through so that can be a huge benefit to her feeling understood. But don’t try to fix this all on your own",
      "created_utc": 1594845437.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fy6obps",
      "author": "MadamPotpourri",
      "body": "What my husband does, and I find very helpful, is that he never makes any comments at all about my weight or my eating habits. He lets me vent (to a point, he offers alternatives like distractions when I start to ruminate) when I am frustrated, and he supports me when I brag about accomplishing something that makes me happy and healthfully achieved. He voices neutral concern when I relapse into unhealthy or negative habits, but doesn’t police me. Never peer pressures me into eating or not eating. \n\nHe also spontaneously praises me for other, non-weight related attributes and accomplishments.\n\nIt should be noted I have had therapy before. It should also be noted you can’t force someone into treatment before their ready. You can keep the option open, offer resources when they ask, but you can’t steamroll and expect success.",
      "created_utc": 1594847034.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fy3saxf",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594780671.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fyhi43f",
      "author": "fidgetspinnster",
      "body": "OP here - thank you for the advice! She has a therapist that she loves and the therapist knows, and she knows she has a problem. Idk what other help she could be getting. I feel like her therapy should help but she doesn't seem to talk like someone who's trying to recover. I have no frame of reference though. Idk if I should do more?",
      "created_utc": 1595097988.0,
      "score": 2,
      "context": [
        {
          "id": "fy41mr6",
          "author": "Shorse_rider",
          "body": "I think you need to try to advise her to get the right help and go see someone. Admitting she has a problem is huge so she knows deep down she needs to see someone about it. These things spiral without help early on and it's a LONG way back to normal eating",
          "created_utc": 1594786619.0
        }
      ]
    },
    {
      "id": "fy4kfi0",
      "author": "None",
      "body": "Agreed, a friend of mine said they would help if it only got worse and I’m underweight and they never said anything because I’m barely underweight",
      "created_utc": 1594802928.0,
      "score": 1,
      "context": [
        {
          "id": "fy41mr6",
          "author": "Shorse_rider",
          "body": "I think you need to try to advise her to get the right help and go see someone. Admitting she has a problem is huge so she knows deep down she needs to see someone about it. These things spiral without help early on and it's a LONG way back to normal eating",
          "created_utc": 1594786619.0
        }
      ]
    },
    {
      "id": "fyez7u1",
      "author": "wintergrl1308",
      "body": "I have a friend who sounds similar to you, she admitted to me that she has an ED, and I don’t think she’s told anyone else. I don’t want to leave her alone in this, but I also don’t know how to bring up her ED and ask if she’s doing ok. I’m torn between being scared of triggering her and making sure she’s doing ok. What should I do?",
      "created_utc": 1595031142.0,
      "score": 2,
      "context": [
        {
          "id": "fy5bjel",
          "author": "jckofallmasterofnone",
          "body": "Its a difficult path to navigate because you need to be supportive but not pushy or judgmental. This disorder largely involves self hatred and one ounce of judgment could make someone feel worse. I think you need to let them know you care about them for who they are, not what they look like but do worry about how they process feelings about themselves and offer to help find resources to treat. I told only 3 people in my circle about my ED and oddly, none of them ever asked or acknowledged it again after I finally told them. It hurts that it took a lot for me to tell my 10 year secret looking for support and at the moment they were great, but am really on my own. I dont blame them, people dont understand and are scared to say the wrong thing.",
          "created_utc": 1594823711.0
        }
      ]
    },
    {
      "id": "fyi3dqh",
      "author": "Shorse_rider",
      "body": "Eds are so tough to crack. There's a lot of self deception and secrecy involved. It can take a very long time. I think one of the best things you can do in your case is to not allow her to normalise ED behaviours. And often ppl with Eds ask questions to other people to make them feel better - like reassurance that they are too thin/not fat. I think it's better for you to explain bluntly in those situations that it's not healthy for you to have those convos with her because it doesn't help with recovery.",
      "created_utc": 1595109888.0,
      "score": 1,
      "context": [
        {
          "id": "fy41mr6",
          "author": "Shorse_rider",
          "body": "I think you need to try to advise her to get the right help and go see someone. Admitting she has a problem is huge so she knows deep down she needs to see someone about it. These things spiral without help early on and it's a LONG way back to normal eating",
          "created_utc": 1594786619.0
        },
        {
          "id": "fyhi43f",
          "author": "fidgetspinnster",
          "body": "OP here - thank you for the advice! She has a therapist that she loves and the therapist knows, and she knows she has a problem. Idk what other help she could be getting. I feel like her therapy should help but she doesn't seem to talk like someone who's trying to recover. I have no frame of reference though. Idk if I should do more?",
          "created_utc": 1595097988.0
        }
      ]
    },
    {
      "id": "fy5eqrt",
      "author": "Shorse_rider",
      "body": "this is what I   hate about the system  - it's not about numbers on a  scale, it's about he disordered thinking. In  order to reach a dangerous weight, you still have the same mentality. My mom took me to the dr when I was 110lbs.. and kept going back until I was 35Kg. Only then, they said they'd help. Then when  I relapsed I was too heavy for help, which  led to another massive spiral. But this was 17 years ago so  I'm hoping things have changed. She  needs  to go and be 100% honest about the extent  of the issue or they'll be  super dismissive. She needs to  make it clear that although her weight isn't dangerously low, her mindset is in  need of help. Culture has become much better/removing the stigma of mental health issues but sometimes I feel like eating disorders are the very last are to see progress",
      "created_utc": 1594825342.0,
      "score": 3,
      "context": [
        {
          "id": "fy41mr6",
          "author": "Shorse_rider",
          "body": "I think you need to try to advise her to get the right help and go see someone. Admitting she has a problem is huge so she knows deep down she needs to see someone about it. These things spiral without help early on and it's a LONG way back to normal eating",
          "created_utc": 1594786619.0
        },
        {
          "id": "fy4kfi0",
          "author": "None",
          "body": "Agreed, a friend of mine said they would help if it only got worse and I’m underweight and they never said anything because I’m barely underweight",
          "created_utc": 1594802928.0
        }
      ]
    }
  ]
}