{
  "id": "hrxe40",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594851336.0,
  "title": "Request: I fear staying at home with my parents will reignite my disordered eating habits",
  "selftext": "So this is something I'm planning on bringing up in therapy during my next session but that isn't for a while so I was hoping that someone here could give me advice in the meanwhile. \n\nMoving back home with my parents and younger sister during lockdown has in some ways been really helpful - university (which I've now graduated from) was definitely the driver of a lot of my neuroses and mental illnesses. I'm slowly getter better and having a better relationship with food and exercise. \n\nHowever, my parents are quite severely overweight and have really bad eating habits. While this hasn't really been an issue during lockdown, my thinking has been 'once lockdown's over and I can move out, I will have complete control over what food is around me'. However, my parents are really strongly against me moving out especially because I have a job lined up (which I don't want to take) which is super close to our house. In the current climate, I don't know if I'll be able to find another job further away or be able to tell them the true reason why I want to leave the house so much, as I understand it's super insulting. \n\nNow I'm faced with the possibility of living with my parents for the next two years and I hate to admit it but it's getting me really worried. It's both the fact that I don't want to become an overeater like them and end up gaining loads of weight again (chubby kid). But there's only so much control I can have with myself around foods that they stock. I don't want to have to place rules and restrictions around the types of food I can eat in the house as I know that will lead me down a very slippery slope. \n\nI have tried to make the house eat a little healthier but their eating habits and wilful ignorance around nutrition and exercise makes me so bummed out and worried I will end up gaining loads of weight or super restricting myself. \n\nMore of a rant than I expected, but any advice greatly appreciated! xx",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hrxe40/request_i_fear_staying_at_home_with_my_parents/",
  "score": 53,
  "num_comments": 3,
  "comments": [
    {
      "id": "fy7favn",
      "author": "softneedle",
      "body": "I just wanted to say I relate to this and struggled with something similar when I moved back in with my family. My family loooooves snacks and it’s really hard not to grab for the nutty bars when thats what pantry is full of. The fact that you’re aware of your patterns will probably help you keep them in control. Doing some of your own grocery shopping might help and maybe you can find some healthier alternatives to the foods you gravitate towards the most. Best of luck!",
      "created_utc": 1594861376.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fy6x24l",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594851337.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fy8y978",
      "author": "somegenerichandle",
      "body": "Maybe you can think about setting up a shelf that is yours. You could pretend they're like some roommates and that their food is off limits to you. Just one idea, I hope you and your therapist find some decent strategies.",
      "created_utc": 1594904275.0,
      "score": 1,
      "context": []
    }
  ]
}