{
  "id": "hs6oth",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594892434.0,
  "title": "Request: Mom won't let me get help",
  "selftext": " \n\nI had a little bit of a rock bottom situation a few weeks ago so I decided it was finally time to get a therapist but when I asked my mom she told me therapy is for the weak and that all girls have bad eating habits for a little while, it’s not a big deal.\n\nI now really don’t know what to do cause on one hand my ED brain is like “she’s right, you’re still fat keep going” but my actual brain just wants help and for this to start to be over\n\nSo yeah I just wanted to ask wtf anyone thinks I should do, if you guys decide to not post this I would really appreciate any tips you have cause I am not in a good place\n\n(I also tried getting an online therapist but everyone I reached out to said I needed parental consent)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hs6oth/request_mom_wont_let_me_get_help/",
  "score": 86,
  "num_comments": 16,
  "comments": [
    {
      "id": "fy8rrlz",
      "author": "None",
      "body": "If you’re in the US, you can contact CPS as your mom is denying you medical care. If you’re nervous about doing that, talk to your family doctor about your concerns. Make up an excuse/illness to your mom in order to get an appointment.",
      "created_utc": 1594899538.0,
      "score": 38,
      "context": []
    },
    {
      "id": "fy8rvdf",
      "author": "sorryIlikeTrashyTV",
      "body": "I’m so sorry your mom is not supportive of your very brave desire to get help! How old are you if you don’t mind me asking? If you’re in the US sometimes you can go through a school psychologist, counselor, or social worker without parental consent and they can connect you to ED resources. They could also advocate for you and try to get your moms support so that you can get an ED therapist",
      "created_utc": 1594899626.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fy8rt19",
      "author": "None",
      "body": "Go to a therapist. Believe me. I used to see a therapist when I was younger and it helped SO MUCH. If you ask me - every damn person in this world is weak. People just don't show it. I think everyone should see a therapist at some point in their lives. It is unnatural to have 100% self-esteem or to be 100% perfect. The real strenght someone can have is keeping it real, trusting and loving yourself. I can see from your comment that you realize that you need help and that you also want it. Trust yourself. It is your life and you only have one. I wish you all the best!",
      "created_utc": 1594899571.0,
      "score": 20,
      "context": []
    },
    {
      "id": "fy97u8d",
      "author": "metempsychosis99",
      "body": "Ah, the old stereotype that only \"crazy\" people seek therapy. If you ask me, everyone should engage in some form of therapy once in their life. We all have issues/toxic traits/ a distorted perception over something we are not aware of, it can't hurt getting a fresh specialised perspective. Now the cost is another story.",
      "created_utc": 1594909840.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fy8xwgx",
      "author": "jlgettingmarried",
      "body": "How old are you? I ask this because I was in the same spot. I’m 28 now and only getting help because my fiancé is supportive and sees how much it’s wrecked me mentally, even after recovery. I was never thin, and my mom never saw it as a real issue. She offered to get me a gym membership instead. \nAll I can say is, please don’t blame it “not being real” to others on your appearance. It is real, and it is so hard, and everyday you don’t get treatment is more trauma you are going to have to unwind when you’re finally independent. Keep pressing your mom for help, don’t be embarrassed, your feelings are absolutely valid and real. And until you’re able to get help, as hard as it is, keep trying to do that work internally. Try to get access to self help resources online, read books that inspire body positivity, do whatever the f*** you have to try to do to reroute your mind.",
      "created_utc": 1594904061.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fy9pvew",
      "author": "waluigioppa",
      "body": "I would definitely say that if you're in school you can go to your guidance counselor and they can connect you to the school psychologist. when you talk to them you can say you want therapy and think it's a necessity and they can talk to your mom because legally she must take you if it's needed. I wish you the best of luck!",
      "created_utc": 1594918766.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fy92d8b",
      "author": "Crumblypudding",
      "body": "There are online resources for help.  Google “in the rooms eating disorder anonymous”.",
      "created_utc": 1594906768.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fyalwij",
      "author": "throwawayay000111",
      "body": "I don’t have much advice beyond what everyone else has already said, but I just wanted to say I’m sorry and I feel your pain because I was in your shoes when I was younger. I tried to tell my mom I had an eating disorder and she said it was bad self esteem and a phase all girls go through (which is 100% not true). Don’t let your eating disorder convince you “you’re not sick enough” or any of that BS. Keep advocating for yourself. You’re worth it and recovery is worth it! Keep fighting",
      "created_utc": 1594934155.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fy8zp47",
      "author": "0_surge",
      "body": "she’s legally obligated to take you to a doctors appointment while you’re under her care",
      "created_utc": 1594905144.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyc1pe4",
      "author": "Psychosparkles",
      "body": "I would be completely honest and very forward that you NEED this, say as many strong words you need to “ I’m dying; my heart is failing,I’m passing out everyday) such things to make her realize it’s important.. and if she still thinks it’s no big deal than stand up for yourself and make your own appointment, write a list of your symptoms and your thoughts and what ED wants you to do and think.. the first step in recovery is to tell on Ed Because that pisses him off so much because he thinks he’s in control of you, the more you can tell on him and disobey his thoughts and recognize you’re OWN thoughts recovery will be a lot easier, with or without your mum... remember you can get support a million other ways.. my mum is completely unsupportive because she just doesn’t understand, I\n Am 30 years old now and have had my disorder; for 20 years so she has no patience for it “it’s something I chose and I can stop any day” she just found out about it last year because I had to explain to her I was going away for inpatient therapy. She still didn’t get it, came home 5 months later and she thought I was “cured” which clearly 20 years of disordered eating does not go away in a few months.. so she was awful any time of slipped up or anything, but I was lucky cuz I live in canada so my therapists and dietitian are all free so Ii meet with them 3 times a week.\n\nThey constantly tell me how well I’m doing and how much I’ve changed from even a year ago, and they have tried to meet with my mum but even they were like I’m sorry but there’s no changing her, which I’ve come to accept, she’s 67 years old like you can’t tell her anything lol she thinks she knows what’s best for me and tells me my therapists,counsellors, dieticians are full of shit... apparently mom knows everything lol.. I’ve learned that it’s best to keeep her out of the loop with my recovery, and if asks just always say “I’m doing good, I’m seeing my therapist tomorrow”(even if I’m not lol) and then that just ends the convo right there .good luck with everything and just remember you’re mom doesn’t need to know every detail, especially if it’s going to make things worse for you!(one of the biggest lessons I learned in inpatient, she doesn’t have to know every single thing, and if you think her response will harm your recovery it’s best not to say anything at all about it to her!!) stay strong, you are worth it and I know you can beat this!! Msg me anytime if ever want advice or to talk,, I’ve been through it alll more than once so I know how difficult it can be💕",
      "created_utc": 1594965942.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fy8kayq",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594892434.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyg2pcd",
      "author": "peachypaws_",
      "body": "I feel for you! I hope you’re able to get the help you need asap. I also feel I’ve been struggling with an ED for years now. I’m lucky that when I told my mom she didn’t necessarily just shut me down like that. But, my mom just plays it off as “Me too.” and “I don’t have money for that.” She doesn’t mean to be rude or anything but, she just doesn’t seem to care very much. Now, I’m an adult and I’ll have to figure it out for myself. Something that’s honestly helped me with my ED is research! I’ve been doing a lot of research in what it is I have exactly and what can cause it. It’s been super helpful to just to be knowledgeable about my situation.",
      "created_utc": 1595061022.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fycbdqd",
      "author": "tymopa",
      "body": "She wants to see a therapist....this is about how to navigate her mom mainly.",
      "created_utc": 1594975308.0,
      "score": 1,
      "context": [
        {
          "id": "fy8rt19",
          "author": "None",
          "body": "Go to a therapist. Believe me. I used to see a therapist when I was younger and it helped SO MUCH. If you ask me - every damn person in this world is weak. People just don't show it. I think everyone should see a therapist at some point in their lives. It is unnatural to have 100% self-esteem or to be 100% perfect. The real strenght someone can have is keeping it real, trusting and loving yourself. I can see from your comment that you realize that you need help and that you also want it. Trust yourself. It is your life and you only have one. I wish you all the best!",
          "created_utc": 1594899571.0
        }
      ]
    },
    {
      "id": "fyihvsd",
      "author": "dylnchrissy",
      "body": "I’m 16 :)\nAlso woah that’s crazy about the gym membership thing that exact thing happened to me (except add going to the Bernstein diet clinics) \nI hate confrontation so I think my end solution is to focus on my internal issues, I think my mom’s biggest issue is she thinks I’m just going to badmouth her with a therapist lmao \n\nThank you for the reply it actually brought me to tears knowing that such a similar situation happened to someone else, I really appreciate it♥️",
      "created_utc": 1595118498.0,
      "score": 1,
      "context": [
        {
          "id": "fy8xwgx",
          "author": "jlgettingmarried",
          "body": "How old are you? I ask this because I was in the same spot. I’m 28 now and only getting help because my fiancé is supportive and sees how much it’s wrecked me mentally, even after recovery. I was never thin, and my mom never saw it as a real issue. She offered to get me a gym membership instead. \nAll I can say is, please don’t blame it “not being real” to others on your appearance. It is real, and it is so hard, and everyday you don’t get treatment is more trauma you are going to have to unwind when you’re finally independent. Keep pressing your mom for help, don’t be embarrassed, your feelings are absolutely valid and real. And until you’re able to get help, as hard as it is, keep trying to do that work internally. Try to get access to self help resources online, read books that inspire body positivity, do whatever the f*** you have to try to do to reroute your mind.",
          "created_utc": 1594904061.0
        }
      ]
    },
    {
      "id": "fycjttk",
      "author": "Daisy_W",
      "body": "Schools are closed, it’s summer",
      "created_utc": 1594983965.0,
      "score": 1,
      "context": [
        {
          "id": "fy9pvew",
          "author": "waluigioppa",
          "body": "I would definitely say that if you're in school you can go to your guidance counselor and they can connect you to the school psychologist. when you talk to them you can say you want therapy and think it's a necessity and they can talk to your mom because legally she must take you if it's needed. I wish you the best of luck!",
          "created_utc": 1594918766.0
        }
      ]
    },
    {
      "id": "fyippxz",
      "author": "jlgettingmarried",
      "body": "Absolutely ❤️❤️❤️❤️ idk if you follow Matilda Djerf online but she has posted a lot on Instagram that has inspired me based on her own struggle ❤️",
      "created_utc": 1595123555.0,
      "score": 1,
      "context": [
        {
          "id": "fy8xwgx",
          "author": "jlgettingmarried",
          "body": "How old are you? I ask this because I was in the same spot. I’m 28 now and only getting help because my fiancé is supportive and sees how much it’s wrecked me mentally, even after recovery. I was never thin, and my mom never saw it as a real issue. She offered to get me a gym membership instead. \nAll I can say is, please don’t blame it “not being real” to others on your appearance. It is real, and it is so hard, and everyday you don’t get treatment is more trauma you are going to have to unwind when you’re finally independent. Keep pressing your mom for help, don’t be embarrassed, your feelings are absolutely valid and real. And until you’re able to get help, as hard as it is, keep trying to do that work internally. Try to get access to self help resources online, read books that inspire body positivity, do whatever the f*** you have to try to do to reroute your mind.",
          "created_utc": 1594904061.0
        },
        {
          "id": "fyihvsd",
          "author": "dylnchrissy",
          "body": "I’m 16 :)\nAlso woah that’s crazy about the gym membership thing that exact thing happened to me (except add going to the Bernstein diet clinics) \nI hate confrontation so I think my end solution is to focus on my internal issues, I think my mom’s biggest issue is she thinks I’m just going to badmouth her with a therapist lmao \n\nThank you for the reply it actually brought me to tears knowing that such a similar situation happened to someone else, I really appreciate it♥️",
          "created_utc": 1595118498.0
        }
      ]
    }
  ]
}