{
  "id": "hstiuf",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1594982699.0,
  "title": "Request: How can I be a better friend to someone with an ED?",
  "selftext": "(I hope this is the right way to make a post! If not sorry!) \nSo in high school one of my friends became unwell with an eating disorder, and went into an inpatient facility soon after. \nShe has been in and out of hospitals for the past 4 years, not really being out for longer than a couple of months.\nObviously our high school friend group are in university now, and I can tell she’s feeling left behind and it’s making her feel like recovery is even harder as she’s so far behind. She doesn’t share much about her ED with anyone but her best friend which is fine, but I find it hard to keep in touch without worrying I am triggering her or making her upset.\nI know I should be a better friend as besides from inpatient facilities she hasn’t made any friends since high school that didn’t also have EDs, and I want her to know I still love her lots.\nWhat can I do to help her? She’s quite far away so visiting is hard, and I have quite bad anxiety with one on one visits so that’s hard, if I check in she just says she’s doing fine and that’s it, which doesn’t really start a conversation. \nI have suggested to her that if she would like I could send letters to her- is that a good idea?\nThank you for any help in advance!!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hstiuf/request_how_can_i_be_a_better_friend_to_someone/",
  "score": 53,
  "num_comments": 15,
  "comments": [
    {
      "id": "fydcg5e",
      "author": "wsc1983",
      "body": "You can use whatever means of communication you're most comfortable with.  It doesn't even need to be verbal/written.  Something like sending her a small gift could be enough to get the message across.  I imagine what she needs to hear is \"I care about you.\"  Depending on how bad she's off, it may take a few tries before the message goes through, so don't give up if she doesn't respond how you'd like.  Let her have her space, too.  Make sure she knows you'll be there for her and she'll open up when she's ready.",
      "created_utc": 1595001361.0,
      "score": 14,
      "context": []
    },
    {
      "id": "fydoja2",
      "author": "None",
      "body": "It's already amazing that you want to find ways to be there for her more, that's already a beautiful gesture. \nIt can be really difficult to keep a strong friendship when someone is struggling so much. This isn't because you're not doing enough, or that she doesn't want to open up to you. She's fighting every single day against her illness and therefore it can become really difficult to maintain friendships. When you have an eating disorder you don't want the contact the be about your eating disorder or struggles all the time. Because it's very frustrating to know you worry your friends and to know you're holding yourself back, but the illness is too strong to fight against and overcome. \n\nThat's why little gestures are very important. Just randomly remind her that you care about here deeply. Remind her that she can talk to you or come to you about anything, but don't push her to open up. She will with time when she's ready and feel safe enough to do so. \n\nYou mentioned sending letters, I think that's a great idea. Those are gestures that she can look back on and read over and over again. Little things she can take with her when she is going inpatient again. Letters can mean a lot. Or sometimes send a random card to her. Doesn't even have to be a good luck, or I'm thinking of you. It can also be a random funny or cute card you came across in the store. \nYou said you asked her if she would like to send letters, but sometimes it can be difficult to say for someone struggling like her that you would like that. Because they don't want to be a burden. So just send her a card or letter, even when she didn't directly ask you to do so. \n\nYou also mentioned the friends group, if you're all still close with her. Maybe send a card with all your names. Letting her know you're all thinking of her. \n\nDon't be afraid to talk to her and maybe triggering her. It's good to talk to her, and it doesn't have to be about her illness. She's her beautiful self, her illness doesn't define her. So remind her of that. You're around her for her, not because you feel bad for her or because of her illness. \n\nConclusion, just show through contact and through little gestures that you care about her deeply. And don't be hard on yourself, you're a good friend. You're still here despite everything, and willing to put more energy in your friendship with her. \n\nBest of luck!!!",
      "created_utc": 1595007200.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fydsipd",
      "author": "hobototto",
      "body": "Be sure you don't talk to her as if you want to cure her, and don't give her advice. I hate it when I actually open up to someone and they say \"you should get help\" or \"you shouldn't do that\". Also, just don't bring up food, no calories, no new restaurants, nothing about how you want to lose weight. It is VERY triggering. \nAs for trying to communicate with her, just say how you miss her in your life and you want to talk more because she is such a dope person. Not in those exact words ofcourse, but something like it. Best of luck! \nAlso, don't take it hard if she doesn't want to talk, I know I will often seclude myself while I am restricting, and I get rather irritable sometimes. Just be patient and understanding.",
      "created_utc": 1595009101.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fye7pnl",
      "author": "HubbyHasBlueBalls",
      "body": "If she is inpatient letters and care packages are HIGHLY appreciated.  Be careful to find out what she can and can't have.  Every place is different, and you'd be shocked at how restrictive these places are and what isn't allowed. Even just messages of \"hey, I was thinking of you.\" type stuff is helpful.  ED come with very high anxiety disorders attached (most of the time) and crippling depression.  So, sometimes her inability to respond is simply her being in an unwell mental space.  In my experience inpatient was traumatic, dehumanizing, and humiliating.  The experience itself and the trauma that occurs in these places is a very isolating experience. Others don't have any frame of reference to even understand what a day in the life of treatment genuinely looks like.  So, you isolate more, connect more closely with other patients, and honestly bind more closely with the ED identity.  Keep encouraging her, let her know you think of her, send packages or letters if possible.  It will be a huge self-worth boost for sure.  I'm not sure how much say she actually has (or believes she has) in her treatment, so she could be stuck in a really difficult place.  What you are reaching out and asking for is really admirable and heartwarming.",
      "created_utc": 1595016510.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyfp2bh",
      "author": "aranide",
      "body": "I think its a fantastic idea, trully. I used to have penpal, and the whole \"making letter\" process is really soothing. You do something with your hands, but gotta use your hands too. She will be free to talk to you about anything. I have a relative that went in detox. While he was there i sent him a letter to chear him up. In his answer he said he recwived my letter on a day he needed it the most. Small gesture goes a long way. So go to that paper store, choose you some nice paper and enveloppe(or better do it yourself, i strongly suggest to go see /penpal ) maybe add some cute sticker and a tea bag, write her a nice letter and POST IT!",
      "created_utc": 1595048159.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyz9fyd",
      "author": "Olivia_Hanger",
      "body": "Those are great questions! It looks some other people already gave some good answers. I'd like to highlight a few of them after what I've learned through my interactions with my friend who has an ED and after taking some sessions myself from her medical center on how to best be a friend for someone who is fighting an ED. \n\nYour friend just knowing that you care about them, but aren't going to push your way into getting them to tell you everything they're going through, will mean a lot. \n\nSounds like writing letters could be a great way especially during Covid, to give them a boost and help them know that they aren't forgotten.\n\nAlso, just remembering that you don't have to help fix her ED issues, but can simply let the Doctors help her with that and just be a friend to her, could help you feel more relaxed when with her or interacting with her.\n\nAlso, not bringing up the subject of food, weight, appearance that has anything to do with the body (even if you're talking about yourself and your goals or someone else even. That can be a real trigger for them.)\n\nI'm glad you're wanting to reach out more and it sounds like you've already been there for your friend. I'm sure that has blessed them already.",
      "created_utc": 1595511969.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fycii0j",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1594982699.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyfq1uh",
      "author": "Alexandria_Eiley",
      "body": "Hey, this is so amazing of you. Like others said, don’t mention food, “good” or “bad” food, or her body (even positive stuff like, “you look so healthy!” Or “you look so much better”) because it can be very triggering and the ED twists those words. Just because someone has gained weight, doesn’t mean their ED is gone, and they may have more weight to restore. Don’t try to analyze her body to see how she is doing (I’ve had friends do this and it is SO uncomfortable). Try not to bring up the ED unless she does, and don’t talk about others weight/bodies either. Don’t treat her like she fragile and will break if you touch her, treat her like a normal person, not pity.\nDo ask her how she is! Just talk to her about life! Let her know you won’t judge her and she can tell you anything. Maybe research eating disorders a little and know it’s not all about weight and food, because it can be hard to open up to someone who doesn’t understand all of the little agonizing things an ED does, and what recovery entails. It’s not just getting to the bare minimum healthy weight, it’s getting to YOUR BODYS healthy weight, and challenging difficult foods, as well as fixing the mental side.\nI think you’re an amazing friend :)\n\nThere is a possibility",
      "created_utc": 1595048944.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyfqv1v",
      "author": "kegglegg",
      "body": "Going through an ED is really tough, and I know from personal experience that having a friend who is supportive and tried to understand as best as they can was always super helpful because it made me feel like I had someone in my corner while I was going through this really difficult time. The NEDA has a forum on how better to help friends with an eating disorder, and they also have a lot of information on how to support people who are suffering from it without seeming like you’re being pressuring. My best advice would be just to listen to what they have to say and let them know you’re here for them. Feel free to shoot me a message if you have any more questions ❤️🥰",
      "created_utc": 1595049613.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyg15fa",
      "author": "None",
      "body": "It is wonderful that you are looking to stay a friend, despite the circumstances. I am a friend to someone with an ED aswell so I know how difficult it can be.\n\nOne of the things that helps friendship with people with serious mental problems is a change of focus. While it is natural and very well meant to try and help them, they have to recover themselves. As a friend you play a different role than a therapist. Friends cheer you up and listen to you, but most importantly they make you feel accepted.\n\nLarge parts of their life are dominated by the ED. Don't let your friendship be one of them. He/she is an cool and nice person, because of many attributes. Focus on affirming those attributes, not only by word, but also by action.\n\nFor example: your friend might be a great organizer of parties. Ask your friend if she/he can help you with organizing one. In that way, you are both doing something together, which strenghtens your friendship and your friend is doing something he/she is good at, strengthening her/his focus on other attributes.\n\nThis is just an example. Think about what she/he really enjoys and try to do this together. And ofcourse don't forget to do things you like to do aswell (except food related).\n\nWhen the party is organized and it was a blast: let her/him know that you are thankful.\nThis enforces the belief that she/he is valuable, capable and so much more as the problems she/he is facing. This empowerment gives control to the hopeless and depressed and spreads out to other parts of their lives.\n\nKeep being a friend. Hope depends not on the strength of one, but the bond between all. Time and time again, you can strengthen that bond and keep the flame imperishable burning.\n\"Yet hope remains, while the company is true.\" - Galadriel, the lord of the rings.",
      "created_utc": 1595059347.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyga2aw",
      "author": "None",
      "body": "Something besides letters and gifts that made me happy as an inpatient was (1) FaceTiming to watch a movie together (if you press play at the same time it works quite well!) and (2) having things to do, such as knitting and origami. I had a friend who gave me an origami set which I really loved! Also, dropping her messages regularly whether she replies or not will go a long way. You sound like a great friend!\n\nEdit: also avoiding any talk about food and exercise (even if it refers to you and not her - eating disorders thrive through competitiveness) will go a long way, and once you’ve got the hand of avoiding those subjects it’ll come naturally to you.",
      "created_utc": 1595069153.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyfjrk4",
      "author": "None",
      "body": "If you have their address send them hand written postcards if you enjoy writing them, my sister does that and it makes me feel cared for",
      "created_utc": 1595044280.0,
      "score": 2,
      "context": [
        {
          "id": "fydcg5e",
          "author": "wsc1983",
          "body": "You can use whatever means of communication you're most comfortable with.  It doesn't even need to be verbal/written.  Something like sending her a small gift could be enough to get the message across.  I imagine what she needs to hear is \"I care about you.\"  Depending on how bad she's off, it may take a few tries before the message goes through, so don't give up if she doesn't respond how you'd like.  Let her have her space, too.  Make sure she knows you'll be there for her and she'll open up when she's ready.",
          "created_utc": 1595001361.0
        }
      ]
    },
    {
      "id": "fydz6mb",
      "author": "anotherfantasy",
      "body": "thank you!!",
      "created_utc": 1595012294.0,
      "score": 2,
      "context": [
        {
          "id": "fydoja2",
          "author": "None",
          "body": "It's already amazing that you want to find ways to be there for her more, that's already a beautiful gesture. \nIt can be really difficult to keep a strong friendship when someone is struggling so much. This isn't because you're not doing enough, or that she doesn't want to open up to you. She's fighting every single day against her illness and therefore it can become really difficult to maintain friendships. When you have an eating disorder you don't want the contact the be about your eating disorder or struggles all the time. Because it's very frustrating to know you worry your friends and to know you're holding yourself back, but the illness is too strong to fight against and overcome. \n\nThat's why little gestures are very important. Just randomly remind her that you care about here deeply. Remind her that she can talk to you or come to you about anything, but don't push her to open up. She will with time when she's ready and feel safe enough to do so. \n\nYou mentioned sending letters, I think that's a great idea. Those are gestures that she can look back on and read over and over again. Little things she can take with her when she is going inpatient again. Letters can mean a lot. Or sometimes send a random card to her. Doesn't even have to be a good luck, or I'm thinking of you. It can also be a random funny or cute card you came across in the store. \nYou said you asked her if she would like to send letters, but sometimes it can be difficult to say for someone struggling like her that you would like that. Because they don't want to be a burden. So just send her a card or letter, even when she didn't directly ask you to do so. \n\nYou also mentioned the friends group, if you're all still close with her. Maybe send a card with all your names. Letting her know you're all thinking of her. \n\nDon't be afraid to talk to her and maybe triggering her. It's good to talk to her, and it doesn't have to be about her illness. She's her beautiful self, her illness doesn't define her. So remind her of that. You're around her for her, not because you feel bad for her or because of her illness. \n\nConclusion, just show through contact and through little gestures that you care about her deeply. And don't be hard on yourself, you're a good friend. You're still here despite everything, and willing to put more energy in your friendship with her. \n\nBest of luck!!!",
          "created_utc": 1595007200.0
        }
      ]
    },
    {
      "id": "fye9mnc",
      "author": "anotherfantasy",
      "body": "she’s sent me her address for letters, she’s actually in a general hospital at the moment so i’m not sure what she can have, i’m going to stick to letters, maybe some pressed flowers or a scrunchie or something! thank you for your advice!",
      "created_utc": 1595017474.0,
      "score": 2,
      "context": [
        {
          "id": "fye7pnl",
          "author": "HubbyHasBlueBalls",
          "body": "If she is inpatient letters and care packages are HIGHLY appreciated.  Be careful to find out what she can and can't have.  Every place is different, and you'd be shocked at how restrictive these places are and what isn't allowed. Even just messages of \"hey, I was thinking of you.\" type stuff is helpful.  ED come with very high anxiety disorders attached (most of the time) and crippling depression.  So, sometimes her inability to respond is simply her being in an unwell mental space.  In my experience inpatient was traumatic, dehumanizing, and humiliating.  The experience itself and the trauma that occurs in these places is a very isolating experience. Others don't have any frame of reference to even understand what a day in the life of treatment genuinely looks like.  So, you isolate more, connect more closely with other patients, and honestly bind more closely with the ED identity.  Keep encouraging her, let her know you think of her, send packages or letters if possible.  It will be a huge self-worth boost for sure.  I'm not sure how much say she actually has (or believes she has) in her treatment, so she could be stuck in a really difficult place.  What you are reaching out and asking for is really admirable and heartwarming.",
          "created_utc": 1595016510.0
        }
      ]
    }
  ]
}