{
  "id": "htymz1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1595155965.0,
  "title": "Request: Is anyone else afraid of not knowing their weight?",
  "selftext": "I’m a teenager and I’m not professionally diagnosed but I can tell that my eating habits and mindset are not healthy or normal. Just recently I started aggressively counting calories, feeling nothing but guilt when i eat anything, being obsessed with my weight, and a few other things. \n\nFor the past few days my mom has been in my parents room almost 24/7. Their bedroom is where the scale is located and I usually sneak in and out just to check my weight. On normal nights, my parents are watching tv in the living room but my dad has been doing renovations there so they can’t do that for the time being. It also means I can’t weight myself at night. \n\nI know I shouldn’t be obsessed with my weight and it’s not healthy but when I can’t see it I feel like I don’t deserve to eat anything. If I wanted even the tiniest snack, it feels like I’m going crazy because I don’t know what weight I’m at. The past few days I get super stressed and frustrated and end up crying in bed. My thoughts start wandering to places they shouldn’t and my body falls asleep around 9 or 10. I was just wondering if anyone else has similar experiences/feelings.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/htymz1/request_is_anyone_else_afraid_of_not_knowing/",
  "score": 113,
  "num_comments": 13,
  "comments": [
    {
      "id": "fyk3flk",
      "author": "None",
      "body": "Hi, I’m also on the road to recovery and I used to weigh myself at least 3 times a day. What helped was getting rid of the scale completely. It’s hard to do since weighing yourself feels so obsessive and needed, but I had to work my mind up to doing it. I also replaced the scale with measuring my waist. It’s still not healthy, but it’s better than the scale, since you waist measurement will fluctuate a lot less than the numbers on the scale (and remind yourself that it’s totally normal for the numbers to fluctuate). Now, I don’t do either. I’m not sure if it’s the best advice, but it did work for me.",
      "created_utc": 1595166630.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fyjwzz4",
      "author": "None",
      "body": "I can relate to this. I’m on the road to recovery but it’s still very tough. Some days I don’t care much or if at all, but some days I’m actually neurotic it’s crazy. It’s so paralyzing. I have a scale but make myself only weigh in once a week, and from then if I get better maybe every two weeks, and every month. It’s tough.",
      "created_utc": 1595161791.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fykwz4a",
      "author": "oceanneli",
      "body": "hey, i'm a teenager too and i also only recently started obsessing over food, calories, and weight, I'm sorry you're struggling with this too and I think its common to feel upset not knowing you weight, especially if you were checking it so frequently before. maybe this break from checking will help though? since if you cant weigh yourself then you can take baby steps to not feeling like you need to weigh yourself at all! you're not alone in this, stay safe :)",
      "created_utc": 1595183055.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fylv6kw",
      "author": "None",
      "body": "I’m in the same boat love. The comments about not having a scale are accurate. I moved away from home and had not a clue how much i weighed ever on purpose. But now my roomate brought home a scale and I’ve been weighing myself twice a day. It’s always better to just not have things that trigger you around",
      "created_utc": 1595201703.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fykr7yu",
      "author": "_anonymous_bitch_",
      "body": "yeah I don't know if my scale is accurate and it makes me crazy",
      "created_utc": 1595180080.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fym8428",
      "author": "scubachip7",
      "body": "As someone who spent all of her teens with an ED, I strongly recommend you seek help immediately. You know you have an issue, which is a huge positive sign that you’re able to recognize that, so getting the help you need right now is the best chance for you to not let the next years, maybe decades, of your life be ruled by this disease. It will only get worse if you let it, and ED recovery is a long, difficult path.",
      "created_utc": 1595209459.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyjqvvf",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1595155965.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyqdn7q",
      "author": "soggysheep",
      "body": "Thank you for sharing you beautiful amazing warrior.\n\nI know it’s hard, but if you can, use this time as a way to learn to be okay not knowing your weight. Even if you’re going to go back to weighing yourself, just be curious about what it’s like to go without. Think about how weighing yourself makes you feel. Without the scale you no longer have to meet some sort of numerical standard— you are just you and you are good enough. I have found that choosing not to weigh myself is very powerful and has helped me along recovery tremendously. \n\nStay strong— sending you good vibes!!",
      "created_utc": 1595303622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyjuday",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1595159367.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fyl8vjz",
      "author": "None",
      "body": "Btw, I just want to add — I wouldn’t want to encourage another unhealthy thing as I realize that waist measuring isn’t good either. But I found it helped me gain a healthier mindset than the scale. It helped me “get off the scale” if that makes sense. Just wanted to add that :)",
      "created_utc": 1595189402.0,
      "score": 2,
      "context": [
        {
          "id": "fyk3flk",
          "author": "None",
          "body": "Hi, I’m also on the road to recovery and I used to weigh myself at least 3 times a day. What helped was getting rid of the scale completely. It’s hard to do since weighing yourself feels so obsessive and needed, but I had to work my mind up to doing it. I also replaced the scale with measuring my waist. It’s still not healthy, but it’s better than the scale, since you waist measurement will fluctuate a lot less than the numbers on the scale (and remind yourself that it’s totally normal for the numbers to fluctuate). Now, I don’t do either. I’m not sure if it’s the best advice, but it did work for me.",
          "created_utc": 1595166630.0
        }
      ]
    },
    {
      "id": "fyk0epl",
      "author": "Tigrella17",
      "body": "Why are you encouraging ED behaviors? I’m sorry if that’s not your intention, but that’s the way it comes off.",
      "created_utc": 1595164502.0,
      "score": 8,
      "context": [
        {
          "id": "fyjuday",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1595159367.0
        }
      ]
    },
    {
      "id": "fyk3ey2",
      "author": "None",
      "body": "I agree. Body checking was really damaging for me and I spent a lot of time doing DBT therapy to stop.",
      "created_utc": 1595166617.0,
      "score": 7,
      "context": [
        {
          "id": "fyjuday",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1595159367.0
        },
        {
          "id": "fyk0epl",
          "author": "Tigrella17",
          "body": "Why are you encouraging ED behaviors? I’m sorry if that’s not your intention, but that’s the way it comes off.",
          "created_utc": 1595164502.0
        }
      ]
    }
  ]
}