{
  "id": "hubk2u",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1595205294.0,
  "title": "Request: Being heavier than both my boyfriend and his brother is taking a horrible toll on my recovery",
  "selftext": "My boyfriend is 5'9 he goes to the gym daily and (as far as I know) has never dealt with an eating disorder. I found out today that my boyfriend's brother, someone who he often regards as \"chubby,\" \"fat,\" and \"bigger,\" is actually smaller than me. His height to weight ratio is in the healthy range, but his family is hyper-critical of weight gain and weight loss. This is apparent as my boyfriends mother ridicules him everyday about being \"fat.\" I don't if others will understand, but after hearing my boyfriend call his brother fat, knowing he is actually average, makes me feel awful about my 5'6, overweight self. I have struggled in the past with bulimia and BED. Although I consider myself recovered, i've been starting to struggle horribly with my self image and my bulimic habits are coming back. The news about his brother has not made me feel any better. I know that it may seem idiotic to some, but it has really affected my self-esteem knowing that his brother wears a size medium while I wear an extra large. I am having a hard time because it makes me feel lesser than everybody else. I feel hopeless about it and I don't know how to recover after my relapse this morning. My boyfriend is aware of my past eating disorders and he supports me to an extent, but he has also threatened to leave me if  I relapse. I'm not sure how to go on; this past week feels like my own self-image pity party.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hubk2u/request_being_heavier_than_both_my_boyfriend_and/",
  "score": 86,
  "num_comments": 8,
  "comments": [
    {
      "id": "fym79yu",
      "author": "scubachip7",
      "body": "If your boyfriend is only willing to support you through the “easy” times and has let you know he’ll dump you if things get difficult, he’s not supporting you. And from what you’ve said, him and his family do not have healthy relationships and views around weight, which is a horrible environment for a person with an ED in recovery. So you really need to think about your health and your recovery moving forward and if you really believe this is the best situation to keep yourself in.",
      "created_utc": 1595208954.0,
      "score": 64,
      "context": []
    },
    {
      "id": "fymf64k",
      "author": "NarcolepticLemon",
      "body": "> he supports me to an extent, but he has also threatened to leave me if  I relapse.\n\nThreatening to leave if you relapse is not support. That’s like telling someone you’re there for them but warning that if they falter you’ll give up on them. I don’t have any other info on your situation or relationship but this aspect does not sound healthy. It would be worth bringing it up with him. I understand that may not be emotionally easy for you, but take time to think about how you might discuss your feelings about his and his family’s opinions about weight and body image.\n\nEdit to add: \nIf he’s not willing to listen and truly support you, then I’d recommend reconsidering your relationship. You deserve someone who loves you for you and will support you even when life is difficult (in any way, not just relating to mental health and eating disorders).",
      "created_utc": 1595213888.0,
      "score": 17,
      "context": []
    },
    {
      "id": "fymhu41",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1595215647.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fynks2l",
      "author": "FluffyPancakinator",
      "body": "Lose the boyfriend. Trust me on this. Recovering from an ED is hard enough as it is. You need solid support around you, a toxic environment will only bring you down and make things worse. My SO exercises and eats healthy every day and that's very triggering for me as it is - but he is super helpful and supportive with my ED. I couldn't imagine how bad I'd be if he wasn't.",
      "created_utc": 1595249887.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fyngkdi",
      "author": "tomhall44",
      "body": "Dump this toxic asshole and heal ~",
      "created_utc": 1595246716.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyqcy02",
      "author": "soggysheep",
      "body": "I would write everything you want to say to your boyfriend out— what he doesn’t understand about eating disorders, how you feel about the word “fat,” not just referring to you but other people, etc. You can give it to him or just discuss the things you wrote that you want to say to him. If you express to him the ways in which you want him to be supportive— and he’s a good guy— he will make changes. \n\nSending you good vibes!!",
      "created_utc": 1595303154.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fym17p7",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1595205295.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fymj712",
      "author": "None",
      "body": "*If your boyfriend is only willing to support you through the “easy\" *\nI think she should lose the boyfriend because this is exactly what he's doing. I know it's not another person's responsibility to handle our mental illnesses, but them threatening to leave is an absolute shitty move. My boyfriend is so supportive of my past mental illnesses (depression and anxiety) and he's motivating on the days I feel like I have relapsed. Everyone deserves to have someone who loves you and doesn't make you feel shitty for things you aren't able to control OP.",
      "created_utc": 1595216556.0,
      "score": 9,
      "context": [
        {
          "id": "fym79yu",
          "author": "scubachip7",
          "body": "If your boyfriend is only willing to support you through the “easy” times and has let you know he’ll dump you if things get difficult, he’s not supporting you. And from what you’ve said, him and his family do not have healthy relationships and views around weight, which is a horrible environment for a person with an ED in recovery. So you really need to think about your health and your recovery moving forward and if you really believe this is the best situation to keep yourself in.",
          "created_utc": 1595208954.0
        }
      ]
    },
    {
      "id": "fynjb9a",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1595248836.0,
      "score": 2,
      "context": [
        {
          "id": "fym79yu",
          "author": "scubachip7",
          "body": "If your boyfriend is only willing to support you through the “easy” times and has let you know he’ll dump you if things get difficult, he’s not supporting you. And from what you’ve said, him and his family do not have healthy relationships and views around weight, which is a horrible environment for a person with an ED in recovery. So you really need to think about your health and your recovery moving forward and if you really believe this is the best situation to keep yourself in.",
          "created_utc": 1595208954.0
        }
      ]
    },
    {
      "id": "fynjxq2",
      "author": "scubachip7",
      "body": "“He’s not really the problem.” And as far as I can tell, he’s not part of the solution. Do you really want to be in a relationship for the rest of your life that makes your recovery difficult and that constantly hangs the risk of relapse over your head? His family isn’t going anywhere. Are you ready to possibly be judged by them for the rest of your life? You deserve better. Four years in, you need to have some serious conversations with him if he really is the man you see spending your life with, particularly one about if you ever relapse because he’s already told you he’s unwilling to support you if that happens. Are you prepared to go through that alone if it happens? I truly hope you have a support system in your life outside of him that you can lean on.",
      "created_utc": 1595249290.0,
      "score": 5,
      "context": [
        {
          "id": "fym79yu",
          "author": "scubachip7",
          "body": "If your boyfriend is only willing to support you through the “easy” times and has let you know he’ll dump you if things get difficult, he’s not supporting you. And from what you’ve said, him and his family do not have healthy relationships and views around weight, which is a horrible environment for a person with an ED in recovery. So you really need to think about your health and your recovery moving forward and if you really believe this is the best situation to keep yourself in.",
          "created_utc": 1595208954.0
        },
        {
          "id": "fynjb9a",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1595248836.0
        }
      ]
    }
  ]
}