{
  "id": "hvr1f4",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1595411863.0,
  "title": "Request: Conquering the problem with \"feeling your body fat\"",
  "selftext": " \n\nI've never had excessive belly fat, but since I remember I've always been unable to sit down or lay without what I call a \"tummy projection\". That means a HUGE blanket, huge pillows and such that I MUST literally squish against my tummy as to not feel it touch anything (a desk if I'm sitting by a computer, anything solid that will stick into my belly fat). I also cannot wear anything that isn't skin tight and no jeans that aren't high waisted as I feel my body fat less with tight waist covering my belly.\n\nDoes anyone recognize this behaviour? Did you conquer it? I feel so alone in this and although it doesn't sound like it, it affects my life very much...",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hvr1f4/request_conquering_the_problem_with_feeling_your/",
  "score": 147,
  "num_comments": 16,
  "comments": [
    {
      "id": "fyv2a1m",
      "author": "witchyroses3",
      "body": "I thought I was the only one who felt like this. Everything you described i experience on a daily basis, and I cannot even stand myself because I feel the fat on my body and it makes me soooo uncomfortable. Im glad im not the only one.",
      "created_utc": 1595417547.0,
      "score": 41,
      "context": []
    },
    {
      "id": "fyv31ei",
      "author": "None",
      "body": "As a bulimia sufferer, I have problems with this too! Although I haven’t found a way to completely tackle it yet, I’ve identified one of my triggers for this is certain clothes (usually one particular pair of jeans, certain underwear, maybe a tight vest top) and have found that getting rid of the triggering clothes and replacing them with something new has really helped me!",
      "created_utc": 1595418192.0,
      "score": 19,
      "context": []
    },
    {
      "id": "fyv28sg",
      "author": "BlueKnives03",
      "body": "I feel the same, haven't figured out a solution yet, but you aren't alone",
      "created_utc": 1595417518.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fyvjzuh",
      "author": "jeabgrenouille",
      "body": "I also had this experience. Past tense woo! \n\nI used to feel this way when I had extreme hunger. I would always need a pillow over my stomach when sitting and I would only wear like two outfits because they were the only ones that made me feel comfortable.\n\nI just felt gross all the time. Do you deal with extreme hunger? For me, I always felt bloated when I had extreme hunger so I think when the extreme hunger ended, the bloating was less, and that's why I felt less belly conscious when the extreme hunger phase passed. \n\nWhen the extreme hunger phase passed, my body started seeming more normal. If I eat more one day, my belly doesn't get super bloated like it used to. It is way more subtle, and I don't feel insecure about it like I used to.\n\nIf this sounds relateable at all, I would say to be patient and continue to eat unrestricted. At some point, the bloating will go away. In the meantime, I think just find clothing that makes you feel as good as possible and buy multiples. I used to really like hoodies and jackets that were tight at the bottom and loose elsewhere. Kind of bomber-style. I thought they looked nice and I felt hidden. \n\nThe other thing I can think of is when I was still very underweight and restrictive, I thought I could feel myself gaining weight if I did anything to break my safe routine, and sometimes later I would learn that I lost weight... The point is, it was just a feeling, and I was not actually able to \"feel\" myself getting fatter. It was just a fear. If this sounds like you, then the next step is to rewire your fear of weight gain by eating unrestricted and teaching your brain that nothing catastrophic will happen if you gain weight in the process. \n\nI hope any aspect of that may be helpful. If anything, I will reiterate that the more recovered I have become, the less I feel my fat in that way. Even now, though, if I notice I'm becoming a little extra focussed on my body and how much body fat I have, I consider whether I've eaten enough that day. Usually, I have not. I know now that if I eat enough, those thoughts go away.",
      "created_utc": 1595428961.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fyvfacz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1595426422.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fyvs1tw",
      "author": "WaterIsMyLife2",
      "body": "I'm super anxious and panic-y in clothing that doesn't put pressure on my stomach. All I own is workout pants and high-waited jeans. It's similar to not being able to go out without a bra on, I need the structure to feel safe. Just the thought of trying on low-rise jeans or a structure-less dress makes me anxious. I'm most comfortable in underwear that has an elastic back that can go up to my belly button. And I'm uncomfortable sitting on a couch without a blanket or pillow or something. Some kind of barrier between my projecting stomach and the world. It feels like an absolute necessity, not just a brain thing I can talk myself out of. I've always just assumed it's part of my dysmorphia, because my stomach is the main subject of my body issues. I'm most comfy in a waist trainer, the pressure around my stomach is just comforting.",
      "created_utc": 1595433014.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fyvqke4",
      "author": "jenny_mac_",
      "body": "Hi there, I'm sorry to hear you're struggling with this. I can certainly relate and I fully agree that you should work to curate your closet with clothes that really feel good to wear. However, you can also work to overcome the negative thoughts/emotions associated with \"feeling\" your belly.  Whenever I have a body conscious/bad body image thought, I try to recognize it as a \"negative body image thought\" and respond with something like \"I am not my body\" or \"my body does not define me\" or \"my body is my vessel\" or \"the shape of my body does not matter\" or \"all bodies are worthy of love\"... find some little mantras that resonate with you. I'd recommend following fat-positive social media accounts (models, athletes, influencers,  etc.) that are actively celebrating fat and people in larger bodies. This will help with restructuring your mindset to be less fat-phobic. In addition, I have found journaling about my feelings to be super helpful as I remind myself where our fat phobia/body dissatisfaction comes from in the first place. We live in a society/economy that glorifies a body type that only a small fraction of the female population naturally has. Capitalism media/marketing has insidious psychological tactics to make you hate your body and fear being \"fat\" in order to SELL YOU THINGS (diets, exercise products, beauty products, clothes, the list goes on)! They profit off of  self hatred they instill within us- It's truly evil. We must remember that \"modern\" times are only glimpse of human history. Women in larger bodies have been worshiped for millennia by other cultures since they saw the full feminine form is a sign of fertility, beauty, and prosperity. See these [prehistoric goddess statues](https://images.app.goo.gl/9U8vEFZfcvUwwHqZ6) for example. Try to remember that we have all been subconsciously programmed by social construction, media, and marketing to fear the fat on our bodies. There is truly NOTHING wrong with your body.  Journaling down these reminders and self affirmations to encourage body acceptance will help restructure your mindset. It is totally possible to create new neural networks (brain connections = thought patterns) and overcome the root cause of your struggles! \n\nSending all the best and feel free to DM me if you want more support/resources!",
      "created_utc": 1595432286.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fyvqtyf",
      "author": "daddysunwantedsoup",
      "body": "I was only able to tackle this after extreme weight loss, I ended up losing a lot of my tummy and I found it uncomfortable to lay down, I missed it so much that when I gained weight I learned to love it and found it rather comforting. I recommend professional help, it makes the process a lot easier",
      "created_utc": 1595432416.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyvvf0c",
      "author": "annaeatk",
      "body": "Yea I remember the first time I went into recovery and gained weight back and started noticing how my stomach jiggled in the car...that was really hard to deal with for me. I definitely always wear high waisted jeans to kinda suck in my stomach. I can definitely relate.",
      "created_utc": 1595434658.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fywpjtu",
      "author": "klydsp",
      "body": "Yeah the seat belt strap always makes me feel that way. I notice it immediately and think about it the whole time in the car. On trips I bring a blanket to hold against me. I haven't been able to break the negative thinking and am hoping someone here can help with that. I'll be looking at responses. Thank you for posting this.",
      "created_utc": 1595448775.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1tz1d3",
      "author": "vent247",
      "body": "I feel this. I remember at one of my lowest weights (I was probably a size sm/medium) I was buying 2XL hoodies just so I could hide my stomach at school. The gym teachers allotted us PE shirts and gave me the right size (couldn't exchange)... so I ran in my hoodie, inside, every day. I still don't think I have any clothes that actually \"fit\" me.\n\nAnother thing I remember is from age 6ish onwards, sucking in my stomach all day until bedtime and then having horrible nightmares that somehow I would kick my covers off in the night and \"everyone\" would see how fat I really am. \n\nThe only thing that has helped me overcome this, just a little bit, is remembering that everyone has insecurities. My beautiful little cousin, a couple years ago, was so upset at her own birthday party because she didn't want to wear a swimsuit and wanted to go swimming fully clothed (wasn't allowed at that pool.) Talking to her and helping her get through that really did change my perspective on self-confidence. But I'll admit it didn't cure my own anxiety.",
      "created_utc": 1597660686.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyuwbo3",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1595411863.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyv72j3",
      "author": "maryminton",
      "body": "I tried to wear this pair of undies the other day but they felt so uncomfortable I just threw them away. Then I just went commando and shopped on Amazon for some granny panties and those actually are great. I like to wear modest and non-form-fitting skirts and dresses (around the house only) since you don't have to wear underwear or a bra or show off your stomach. Best tip is to identify what you hate about the clothing then find something that fixes the problem to replace it with. Too tight at waist? Get flowy pants in a larger size with a drawstring so you can adjust them",
      "created_utc": 1595421298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyy1duj",
      "author": "cr1116",
      "body": "Same. It happens 24/7 for me. Even while trying to go to sleep. I have to be on my back or stomach so I can’t feel my fat curl up when I’m on my side. If I want to sleep on my side I use blankets or stuffed animals to squeeze next to my stomach. \nI’m the same with the high waisted things. I have to have something squeezing against my stomach so I suck in or feel as though my stomach is flat and has no rolls.\nThank you for sharing this. I don’t have any advice but you made me feel less alone in this, I didn’t realize anyone else dealt with this.",
      "created_utc": 1595475014.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyyq85f",
      "author": "None",
      "body": "Yup. Might be a combination of my autism and ed tho. Haven't conquered it yet 😞",
      "created_utc": 1595496463.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fyyo842",
      "author": "Veganchiggennugget",
      "body": "Get yourself some spanx girllll they save lives",
      "created_utc": 1595494405.0,
      "score": 1,
      "context": [
        {
          "id": "fyvfacz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1595426422.0
        }
      ]
    },
    {
      "id": "fyy1nc7",
      "author": "cr1116",
      "body": "I often pull the seatbelt higher on my stomach and pull it tighter. \nThis is not a recommendation just something I do",
      "created_utc": 1595475184.0,
      "score": 2,
      "context": [
        {
          "id": "fywpjtu",
          "author": "klydsp",
          "body": "Yeah the seat belt strap always makes me feel that way. I notice it immediately and think about it the whole time in the car. On trips I bring a blanket to hold against me. I haven't been able to break the negative thinking and am hoping someone here can help with that. I'll be looking at responses. Thank you for posting this.",
          "created_utc": 1595448775.0
        }
      ]
    }
  ]
}