{
  "id": "hwcu8g",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1595497398.0,
  "title": "Request: Replacing my bulimia with another ED??",
  "selftext": "I've had bulimia for 4 years on and off and it got to my worst now during lockdown, where I purge everyday.\nI've been working on my recovery and I'm scared I'm replacing my bulimia with another ED.\nI've been restricting (a lot) for about 5 months now and from this week on I've stopped restricting, but the only food im comfortable \"keeping down\" is fruits and veggies, so I've been eating a vegetarian diet for a while and haven't binged or purged yet. I also eat eggs to get my proteins and fats.\nIs this a good or bad thing? It's good I haven't purged, but I'm too scared to eat anything else because I'm scared it will trigger a binge and purge.\nIve also stopped exercising because I'm scared I will start over exercising again or burn too many calories and it will lead me to a binge/ restriction cycle again. I have no clue if this is actually helping in my recovery but I haven't b/p since starting my new diet?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hwcu8g/request_replacing_my_bulimia_with_another_ed/",
  "score": 39,
  "num_comments": 8,
  "comments": [
    {
      "id": "fyz03ug",
      "author": "DogBreathologist",
      "body": "This is a step forward I think but it’s dangerous to replace one eating disorder with another. I would absolutely recommend you look up some online resources and consider some therapy if you haven’t already. Food really isn’t the enemy and anything can be eaten in moderation, maybe also see a nutritionist who can tell you how many calories a day you should be having and give you an idea of how much of each type of food you can have and stay in a healthy range of calories.",
      "created_utc": 1595505626.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fyysmue",
      "author": "None",
      "body": "It is a step forward to not b/p for sure. Yeah, your new diet/habits may be on the restrictive side and not suuuper healthy mentally, but bulimia (or b/p in general) is probably the most dangerous thing you can do to your body. Restricting... by eating healthier foods... it's... it's not 100% recovered, but it is better than purging imo.",
      "created_utc": 1595498892.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fz06u9y",
      "author": "None",
      "body": "Eating healthy food (fruits, veg, protein, fats) is not, in and of itself, disordered. As long as you are getting adequate caloric intake you’re taking steps in the right direction. If, for now, you have to “eat clean” to avoid binging/purging, then that’s okay. You can give yourself a rest from the b/p & get your body used to consuming adequate amounts of food. Once you’ve maintained that for a while, you can start slowly re-introducing “forbidden”/fear foods in small quantities and see how you feel.\n\nI would advise getting the help of a doctor, nutritionist, and/or therapist in the meantime. You’re going to need help and support, so getting a professional on your side can do a lot of good.\n\nGood luck.",
      "created_utc": 1595528349.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fz08zse",
      "author": "norewichhea",
      "body": "It is totally okay to ease into a full diet! your body is used to getting a small amount of food and nutrition right now and wants to keep it at the same place (homeostasis) Work on eating the good fruits and veggies etc that you already are when youre hungry, try to not over eat, but eat frequently if you can! This is what I’ve been doing - very gradually mind you, to help grow my appetite. My goal is to be eating frequent, good sized meals to maintain good sleep, and a healthy amount of exercise. Hopefully all together mental and physical health will be pretty solid! \n\nI would keep on the vegetarian diet if its working for you! In a few more months, if you’re finding success in the veg lifestyle you can always see your GP for bloodwork to ensure you’re getting all the right nutrients! Like, having low iron can really tire one out!",
      "created_utc": 1595529333.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fz17p21",
      "author": "redwood_seeker",
      "body": "This is a step in the right direction. At the same time, you need qualified help and support so that you can get to a point where you expand your diet and replace the disordered thoughts with healthy ones.\n\nFor a long time, I was severely (and exclusively) orthorexic. Eventually, stress and life circumstances caused my to transition into something that looked more like anorexia but didn’t quite check all the boxes. When I hit rock bottom and started getting better, in order to force myself to eat enough food, I had to allow myself to engage in certain rituals and behaviors that were not physically unhealthy in and of themselves, but were parts of my orthorexia (like having to drink a certain concoction before allowing myself breakfast). My therapist told me at the time that the most important thing was me eating and we would address the behaviors in time.",
      "created_utc": 1595546219.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fyyvypz",
      "author": "gigi-bungsu",
      "body": "I think any progress is a really good step, and you should be totally proud of yourself! Also, if a vegetarian diet is the one thing that really helps to prevent you purging/bingeing, I think it’s totally fine to keep going with that. Good luck! You got this! ❤️",
      "created_utc": 1595502076.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fyz6rp1",
      "author": "abo0486",
      "body": "It is not uncommon to mix eating disorders.",
      "created_utc": 1595510351.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fyyr54y",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1595497398.0,
      "score": 1,
      "context": []
    }
  ]
}