{
  "id": "hxkb3o",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1595671316.0,
  "title": "Request: Psychologist told me I have Anorexia",
  "selftext": "So, I posted on here about being ashamed of eating and I got a lot of positive feedback. \n\nTruth is I'd been dealing with eating disorders and stuff since I was a teenager.\n\nI opened up to my psychologist who is a really good person (he's the same person that diagnosed me with autism) and he told me I'm dealing with anorexia and body dysmorphia.\n\nWe've been talking a lot about my trauma and family abuse, so when I opened up about this he wasn't surprised.\n\nBut he did tell me I needed to take care of myself because anorexia could potentially be fatal. I told him I'd make sure I was okay.\n\nObviously, this is only the first step. I'm going to get more help for my anorexic behavior. I just wanted to let you all know I took that first step.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hxkb3o/request_psychologist_told_me_i_have_anorexia/",
  "score": 80,
  "num_comments": 6,
  "comments": [
    {
      "id": "fz87os3",
      "author": "FitLotus",
      "body": "Hey it’s nothing to be ashamed of. I also have disordered eating and have struggled with body dysmorphia. For me it’s a control thing. I like to feel in control of my body. I also have struggled with self love and self acceptance due to some pretty nasty abuse I suffered as a kid. Everyone has their demons. Everyone has a battle. This is just ours.",
      "created_utc": 1595706911.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fz6xd7a",
      "author": "rubbish-bread",
      "body": "Fingers crossed everything goes well for you and congrats on taking the first step :)!",
      "created_utc": 1595681384.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fz8zub5",
      "author": "lilweeep",
      "body": "baby steps ❤️ proud of you!!!",
      "created_utc": 1595719391.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fz9oy0d",
      "author": "abo0486",
      "body": "Honestly being honest is the first step.",
      "created_utc": 1595734843.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fza9z3q",
      "author": "tymopa",
      "body": "Much love to you. Good job for seeking medical advice. This is a life long journey and your therapist is spot on. Best of luck.",
      "created_utc": 1595752644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fz6mpe0",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1595671316.0,
      "score": 1,
      "context": []
    }
  ]
}