{
  "id": "hyhoor",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1595808078.0,
  "title": "Request: Chewing Food and spitting out",
  "selftext": "Does anyone else do this? I have never dealt with having an eating disorder. I do this with foods that I know I should eat like bagels, muffins, Mac and cheese... but only if I remember that I can do this and be satisfied 😅 with my craving.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hyhoor/request_chewing_food_and_spitting_out/",
  "score": 51,
  "num_comments": 19,
  "comments": [
    {
      "id": "fzcrupc",
      "author": "jeabgrenouille",
      "body": "I would rethink your statement that you've never dealt with an eating disorder because chewing and spitting is a disordered behaviour. You might need to broaden your definition of eating disorder",
      "created_utc": 1595808680.0,
      "score": 67,
      "context": []
    },
    {
      "id": "fzcz8bw",
      "author": "lcbauza",
      "body": "I do this sometimes with food I eat impulsively but immediately regret. Like spoonfuls of peanut butter. Or bites of cake, or bread.",
      "created_utc": 1595813194.0,
      "score": 9,
      "context": []
    },
    {
      "id": "fzd47ux",
      "author": "goodfuckwhatfuckery",
      "body": "i do this almost daily and i absolutely have an ed",
      "created_utc": 1595816231.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fzdk7i9",
      "author": "None",
      "body": "This is a disordered behaviour and also it is quite dangerous. When you chew food your stomach produces extra acid to prepare for digestion but when you spit the food out, the acid has nowhere to go. It can burn holes in your stomach and be very painful. A recovering bulimic I follow on YouTube and such once did this and was in pain for a week after only chewing and spitting once.",
      "created_utc": 1595827205.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fzcycmz",
      "author": "deaddogmom",
      "body": "Of all of my years of having eating disorders I've only done this a couple times",
      "created_utc": 1595812660.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fzd59kh",
      "author": "thechasteandpure",
      "body": "I did this compulsively for a long time. It started out as the only way I would allow myself to taste chocolate, muffins, etc. while I was starting to recover from very restrictive eating, and then became much more compulsive - like planning my evening around having a chew & spit binge. Since you posted this question to this sub I think you understand that this is not healthy eating behaviour.",
      "created_utc": 1595816875.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fzcqu3m",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1595808079.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fzdf376",
      "author": "skelze",
      "body": "Yeah, the impulse to spit something I’ve put in my mouth is usually one of the first signs that I’m settling back into disordered behaviors. I hope it’s an early sign for you, too, to steer clear of this path!",
      "created_utc": 1595823316.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fzdg2f6",
      "author": "sharongrace_",
      "body": "I used to do this very often when I was in the deepest part of my ED, and I was SO addicted, and my whole life revolved around it. It started out small, and then spiraled wildly out of control. Please stop while you can, as it can become incredibly addictive, and can cause long term damage to your teeth, digestion, and even can permanently mess up your insulin production.",
      "created_utc": 1595824029.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fze3qv3",
      "author": "daintycaloriess",
      "body": "All day everyday bby ✌️😭 honestly tho i sometimes have a whole ass chew/spit binge, better than normal binge i guess but again completely disordered",
      "created_utc": 1595846085.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fze7hnt",
      "author": "Emptyfulfillment",
      "body": "Im currently doing a documentary on this. It’s my own documentary. This is an eating disorder. I have an addiction to it and it controls my life. It messes up your teeth and it’s an oral fixation and it’s not healthy. I can’t go though 100’s of dollars in food to just chew and spit out as a waste. At night I obsessively wait to be alone just to do this and all day it’s all I want to do. It’s a horrible horrible god forsaken curse of an addiction. I’m planning on recovery soon. Just eating healthy and actually eating. But it’s crazy so many people don’t know about this eating disorder. Method of madness. That’s why I’m doing this documentary to shed light on it so there can be help on it and we don’t have to hide the fact of suffering from chewing and spitting out food addiction. It’s rough having something no one else really knows about. I’m glad you posted this because man I feel alone and like I’m the only one that does this but i know for a fact it’s real and more common than we thought.",
      "created_utc": 1595849595.0,
      "score": 3,
      "context": []
    },
    {
      "id": "fzdx1o5",
      "author": "ablindbabywith7legs",
      "body": "Yeah I did this when I was younger. I've heard about other people struggling with it many times. It was one of my closest friends main struggle with their ED. Whether an eating disorder, or a form of disordered eating or anxiety or something else, this is concerning  I really suggest connecting with a mental health professional about this. Can't stress enough that these behaviours quickly spiral out of control and the sooner someone gets support the better. If you're afraid to seek help about this remember it's your choice whether you want to stop or not and no one can take that away from you. You get to decide what you want to do, it just might help to understand why this is happening and where it's coming from in the first place",
      "created_utc": 1595839169.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fze0r3l",
      "author": "grneyegal83",
      "body": "I do this sometimes. I do it because I want whatever it is but I’m either on an eating binge and just can’t bring myself swallow it because I’ve eaten so much already, or I’m depressed and hungry but I just can’t stand the thought of food in my stomach. I feel so ashamed doing it, but in those moments I can’t stop myself from doing it either.",
      "created_utc": 1595843021.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fzd6tcw",
      "author": "sadminecraftgirl",
      "body": "is it because you feel guilty for eating it?? are u trying to lose weight by  doing that? i mean its obviously disordered eating but it doesnt rlly sound like a full ed",
      "created_utc": 1595817834.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzu34tc",
      "author": "bumblej13",
      "body": "I do this most days usually if I want eat at but feel guilty for it, I get stomach pains from it potentially a developing ulcer but it’s like an obsession that I can’t stop",
      "created_utc": 1596174436.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzdzupo",
      "author": "0_surge",
      "body": "i never spit out food. closest i get is if i get something on my lip while i’m not eating and i wipe it off + the area around it.\nyour mouth takes in calories anyway and if you swallow the saliva while/right after you’ve had food in your mouth you take in calories so there’s not much point",
      "created_utc": 1595842091.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fzd9lxm",
      "author": "Thick-Glutesgirl",
      "body": "Haha I didn’t know and I was assuming that it was along the lines 😅",
      "created_utc": 1595819602.0,
      "score": 4,
      "context": [
        {
          "id": "fzcrupc",
          "author": "jeabgrenouille",
          "body": "I would rethink your statement that you've never dealt with an eating disorder because chewing and spitting is a disordered behaviour. You might need to broaden your definition of eating disorder",
          "created_utc": 1595808680.0
        }
      ]
    },
    {
      "id": "fzdm3sk",
      "author": "thechasteandpure",
      "body": "I did not know this, I'm really glad you commented. This is probably the root cause of my multiple ulcers and acid reflux. (I'm treating my stomach problems and don't chew and spit anymore, but this gives me hope that it'll improve in the long term).",
      "created_utc": 1595828739.0,
      "score": 5,
      "context": [
        {
          "id": "fzdk7i9",
          "author": "None",
          "body": "This is a disordered behaviour and also it is quite dangerous. When you chew food your stomach produces extra acid to prepare for digestion but when you spit the food out, the acid has nowhere to go. It can burn holes in your stomach and be very painful. A recovering bulimic I follow on YouTube and such once did this and was in pain for a week after only chewing and spitting once.",
          "created_utc": 1595827205.0
        }
      ]
    },
    {
      "id": "fzdf55r",
      "author": "Thick-Glutesgirl",
      "body": "I am trying to maintain or lose weight. I usually wouldn’t do this, but this  quarantine is making me less active.",
      "created_utc": 1595823356.0,
      "score": 2,
      "context": [
        {
          "id": "fzd6tcw",
          "author": "sadminecraftgirl",
          "body": "is it because you feel guilty for eating it?? are u trying to lose weight by  doing that? i mean its obviously disordered eating but it doesnt rlly sound like a full ed",
          "created_utc": 1595817834.0
        }
      ]
    }
  ]
}