{
  "id": "hypyij",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1595846430.0,
  "title": "Request: mentally have an ED but still gaining weight?",
  "selftext": "Has this ever happened to anyone else? I am so fixated on what I eat and cutting out calories where I can, but I’m also heavier than ever. \n\nIt’s a new level of frustrating. Despite feeling good that my body can sustain weight, it’s just strange to have the imbalance between mental feeling and physical feeling.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hypyij/request_mentally_have_an_ed_but_still_gaining/",
  "score": 105,
  "num_comments": 14,
  "comments": [
    {
      "id": "fze4mtj",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1595846964.0,
      "score": 29,
      "context": []
    },
    {
      "id": "fzf0eb6",
      "author": "redwood_seeker",
      "body": "With the exception of anorexia (typical form), you don’t have to have any particular weight or body type to have an eating disorder. You still have an ED, you just have a different sized body than you did before. \n\nFor what it’s worth, in recovery, it’s typical to restore your weight but still be dealing with disordered thoughts for awhile. The weight comes back before the healthy mindset. Please talk to someone.",
      "created_utc": 1595866489.0,
      "score": 16,
      "context": []
    },
    {
      "id": "fzfifx1",
      "author": "u-n-k-n-o-w-n-2",
      "body": "yes yes yes I relate so bad! I'm so disgusted with myself",
      "created_utc": 1595875006.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fzevc5j",
      "author": "yaboytheo1",
      "body": "This is basically where I’ve been at since recovering. I’ve gained weight to the point where I’m disgusted at myself, and still have the same urges to restrict, binge and other ED behaviours, and still hate myself, but am at what I would consider an unacceptably high weight. Love it 🙃",
      "created_utc": 1595864056.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fze4375",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1595846430.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzfv4t9",
      "author": "indecision-king",
      "body": "Are you gaining weight because you're recovering? In that case I'm guessing it would be pretty normal. And you can have an ED at any weight. Just make sure that if it's truly like, you're eating in a way that should be causing weight loss, but you're experiencing unexplained weight gain, you talk to your doctor because unexplained weight gain could be a physical health problem.",
      "created_utc": 1595881025.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzgu9w0",
      "author": "mablepiines",
      "body": "ED's are mental illnesses, so we can fixate or obsess over food and calories, without losing weight.  It's common, and I experienced this before and during recovery.",
      "created_utc": 1595899382.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzgy259",
      "author": "IzzyDitz",
      "body": "This has been my situation most of my ED journey. You are not alone!",
      "created_utc": 1595901566.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzi4m71",
      "author": "mignon8822",
      "body": "I am with the same issue. Anorexia gaining weight while eating so few calories, makes everything pretty much hard to deal with",
      "created_utc": 1595936424.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fze4krq",
      "author": "avie8",
      "body": "I might need a little more information, but not giving your body enough food can slow down your metabolism and cause it to hold onto more fat and cause weight gain",
      "created_utc": 1595846910.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzffuq2",
      "author": "None",
      "body": "As far as I could tell, it has happened to me! Sometimes it isn't so much what we're eating, as are our bodies' responses and reaction to the stuff we bring into contact with it. Hormonal imbalances and stress can also have a significant impact on how and why you're gaining weight despie eating less. \n\nI've done some research on nutrition and healthy eating/lifestyle, and have come to a point where I'm not losing wieght, but at least I'm not gaining any either. Regular vigorous exercise has been helpful to me. Also chucking away negative thoughts and inaccruate self-perceptions, and instead taking a more correct view of my own value as a human being--created by God, loved by God, and redeemed by God (that applies to you too, if you trust in Him!) has helped me bring back balance into this area of my life (struggles with wieght and eating). \n\nAs a start, maybe try to take a step out of being so fixated on your own troubles and calories, and instead focus on how you could be more productive and help other people? Sometimes that could help you feel better. Then after a while, when you're less frustrated, come back to this and start doing some research on what calories really are, how your body works with carbs, proteins and fat, and how/what you should eat, and when for your own body type. \n\nHope that helps! Blessings.",
      "created_utc": 1595873823.0,
      "score": 0,
      "context": []
    },
    {
      "id": "fzeuypp",
      "author": "He_who_humps",
      "body": "This is a very likely scenario.  Your body makes choices about metabolism and fat storage based of of food scarcity.  When you lower your caloric intake you tell your body that there is a shortage and it adjusts by lowering metabolism and cutting off nonessential functioning.",
      "created_utc": 1595863877.0,
      "score": 0,
      "context": [
        {
          "id": "fze4krq",
          "author": "avie8",
          "body": "I might need a little more information, but not giving your body enough food can slow down your metabolism and cause it to hold onto more fat and cause weight gain",
          "created_utc": 1595846910.0
        }
      ]
    },
    {
      "id": "fzf833c",
      "author": "norewichhea",
      "body": "I think this is my problem and I dont know when it started - I was born a smallish baby even and never had an appetite really. Now I feel really proud when I get hungry and eat on that hunger multiple times a day to grow that metabolism!",
      "created_utc": 1595870184.0,
      "score": 0,
      "context": [
        {
          "id": "fze4krq",
          "author": "avie8",
          "body": "I might need a little more information, but not giving your body enough food can slow down your metabolism and cause it to hold onto more fat and cause weight gain",
          "created_utc": 1595846910.0
        }
      ]
    }
  ]
}