{
  "id": "hzxxxr",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596016329.0,
  "title": "Request: Advice on GF and her ed",
  "selftext": "Hi there. I've never posted on here so I'm not quite sure how to do this, and apologize if I get it wrong.\n\nMy(21) girlfriend(22) of one year has struggled with eating for nearly five years now. This has coincided (or is symptomatic of) some rough home stuff, and a long term predatory relationship an older friend of her family's.\n\nHer home life is much better now, she told her family about the friend, she's seeing a therapist, and she is actively and consciously seeking recovery. \n\nShe's remarkable, incredibly strong, and I am unbelievably proud and supportive of her.\n\nI know that this subreddit offers plenty of help along the lines of \"How to talk to her about it?\", and I appreciate every post but I would just like some advice slightly more in line with her/our situation.\n\nI worry endlessly about her. I recently found out she still purges a few times a week, and it's all I think about now. Though she has opened up to me, I know she still keeps things from me to prevent me from worrying. Ironically, this makes me worry more because everything is left up to my imagination and I instantly dive straight into worst-case scenarios. \n\nI don't know how to approach it. I obviously want to be completely in the loop, no matter how scary that loop is, because I don't know what she's not telling me, and I fooled myself once into thinking it was better than it was because of this, which led (in part) to her normalising her behaviour since everything seemed fine. \n\nHow do I approach her more often and more transparently without seeming like I'm interrogating her? Or is the best course of action not to so actively pursue it?\n\nSecobd is something slightly more niche (and out of taste perhaps, I'm sorry, that's not my intention but I totally understand if you want to leave this out). In the bedroom, my girlfriend really likes to give. She loves going down on me, and she likes it if I get rough because she doesn't have a gag reflex. It recently dawned on me as to why that is, and now I feel uncomfortable with it because it just leaves me feeling paranoid again (which is making it about me, I know, I'm sorry). I think I want to bring this up with her, but also don't want her to feel ashamed about it. Is there any way to do this? Should I just not bring it up at all? Am I being overly neurotic about this?\n\nThank you for your time, and best of luck on all your journeys.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/hzxxxr/request_advice_on_gf_and_her_ed/",
  "score": 42,
  "num_comments": 4,
  "comments": [
    {
      "id": "fzm8qb4",
      "author": "sorryIlikeTrashyTV",
      "body": "It might help to start couple’s therapy so you have a safe space to share all this and a mediator (therapist) who can help make the discussion productive",
      "created_utc": 1596028019.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fzm90yj",
      "author": "heetherweether",
      "body": "hello, im 16 and i have an eating disorder aswell (buliimia) and i think its incredibly sweet that you care so much . but i think talking to her and telling her what u want , eg keeping u completely in the loop etcetc and reassuring her that it wont change anyt and that u genuinely just want to b there for her can help alot \n\nfinding out the trigger can also help alot , eg when she first started and if there are any reasons that caused her to start\n\nas u said shes been doing this for 5 years , it could be more than wanting to look good , and it could have developed into an obsession\n\nas for yourself , pls do try ur best to see her as herself , and not just a eating disorder , not just a person u love w bulimia . i think u can do some research and watch videos on the various reasons as to why people feel this way , and i think that it can be v insightful :)\n\nall the best , and i do hope u guys last long , much love <3",
      "created_utc": 1596028210.0,
      "score": 8,
      "context": []
    },
    {
      "id": "fznpu5l",
      "author": "None",
      "body": "I can not recommend this book enough, as an ED sufferer I felt it was extremely accurate and enlightening. It's called Loving Someone with an Eating Disorder by Dana Harron. It not only explains a lot about what's happening and why, but it also advises you on how to communicate, what to say/not say in common situations, and how to deal with everything from mealtimes to sex and family planning. It is incredible and so so helpful. I got it at my local library, perhaps you could do the same!",
      "created_utc": 1596055187.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fzlumo3",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596016329.0,
      "score": 1,
      "context": []
    }
  ]
}