{
  "id": "i0ak6w",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596062984.0,
  "title": "Request: Managing/recovering from ED while pregnant",
  "selftext": "I have been in outpatient treatment since February for an ED that is closest to binge eating. Treatment has overall been going very well.\n\nI recently found out I'm pregnant, and though I know that my therapist and dietician will be able to help out with some questions and food planning, I was wondering if anyone had experience with certain resources that they found really helpful.\n\nMy biggest concerns are eating healthy for baby (of course) but also not confusing pregnancy cravings with disordered thoughts.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i0ak6w/request_managingrecovering_from_ed_while_pregnant/",
  "score": 36,
  "num_comments": 4,
  "comments": [
    {
      "id": "fzocks1",
      "author": "None",
      "body": "Been there! I cycle between binging and restricting. Pregnancy was a brain cue to binge for me. I made a list of things my disorder says and ran my every craving by it. I also kept up with moderation. Like if I decided baby wanted a chocolate bar I would only have half. It also helped me to tell myself that baby didn’t actually want 15 chocolate chip cookies or a family size bag or Doritos and indeed those things weren’t good for the baby 😂 essentially, I reminded myself on the daily that pregnancy is not an excuse to eat in excess. It’s harder to manage “hunger” but I PROMISE you that baby doesn’t increase your appetite or caloric needs that much. It’s possible to stay on track and at the end you’ll be rewarded handsomely when you don’t have the 30-40 pounds most moms have to lose at the end. Also, it gets easier as baby gets larger. You won’t have as much room and it decreases your appetite so don’t beat yourself up in the early weeks for eating more than you feel you should.",
      "created_utc": 1596066848.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fzo5d61",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596062984.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1634lf",
      "author": "TheRealBlanketGirl",
      "body": "I've done it four times and for some reason the anorexia hit the back burner every time and I wasn't so worried about it. I had hypermesis gravidarum but when I could it just came naturally to eat for once. Hope you have a similar experience and congratulations!",
      "created_utc": 1597196127.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzor7ue",
      "author": "clumsy_hamster",
      "body": "Are you talking about making a list of trigger foods and comparing that to your cravings? If so that's a really good idea.",
      "created_utc": 1596074934.0,
      "score": 1,
      "context": [
        {
          "id": "fzocks1",
          "author": "None",
          "body": "Been there! I cycle between binging and restricting. Pregnancy was a brain cue to binge for me. I made a list of things my disorder says and ran my every craving by it. I also kept up with moderation. Like if I decided baby wanted a chocolate bar I would only have half. It also helped me to tell myself that baby didn’t actually want 15 chocolate chip cookies or a family size bag or Doritos and indeed those things weren’t good for the baby 😂 essentially, I reminded myself on the daily that pregnancy is not an excuse to eat in excess. It’s harder to manage “hunger” but I PROMISE you that baby doesn’t increase your appetite or caloric needs that much. It’s possible to stay on track and at the end you’ll be rewarded handsomely when you don’t have the 30-40 pounds most moms have to lose at the end. Also, it gets easier as baby gets larger. You won’t have as much room and it decreases your appetite so don’t beat yourself up in the early weeks for eating more than you feel you should.",
          "created_utc": 1596066848.0
        }
      ]
    }
  ]
}