{
  "id": "i0ji8d",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596103842.0,
  "title": "Request: I threw a way my dinner....",
  "selftext": "I have posted on the sub before to get advice and ask if if I had “eating disorder like habits” I got a few replies and all of them replied with a form of “yes”...... this was scary for me because I didn’t want to develop an ED eventually, I’m pretty sure nobody does. It started off with me losing weight I’m still not at my “goal weight” yet so I don’t feel like I can stop yet but I’m a healthy weight according to the BMI calculator, I count my calories before I would just guess but I recently started to use the food scale in my kitchen and it’s made me even more obsessed with calories and my weight. Over the past few days I’ve been restricting myself by leaving only a few hundred calories but yesterday I didn’t I ate almost all my calories only leaving about ten this was big for me since I hadn’t done it a week I felt good about this and thought maybe I’m getting better....Wrong! I always plan my meals before since I usually cook for myself I’m only 16 so I still live with my family but they give me freedom to eat what I want and cook for myself but my stepmom decided to make ribs, baked beans, and coleslaw I didn’t know the calories for the food and this absolutely terrified me so before she cooked I went to the store and I got pre-made food from the deli and hid it so they wouldn’t know I had gotten something else and I don’t want to be rude so I made a plate of the food she cooked but I threw it away as soon as I got to my room and just took out the food I bought and ate instead.....I never did that before and I don’t think it’s a good sign. I also don’t think it’s normal to obsess and constantly think about food, exercise, and calories. Please help me I want to get better if anyone could offer me support I would gladly accept I’m not sure if I’m ready to talk to this about the people in my life...",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i0ji8d/request_i_threw_a_way_my_dinner/",
  "score": 43,
  "num_comments": 10,
  "comments": [
    {
      "id": "fzpwvp1",
      "author": "Phantomsgf",
      "body": "I think that what is key here is that you know and recognize that the calorie counting and using the food scale is what is making you more obsessed with it.\nSo I think the key thing here would be to take a break from the calorie counting or at least to keep your calorie intake in a normal, healthy range according to your age and amount of activity.",
      "created_utc": 1596109048.0,
      "score": 12,
      "context": []
    },
    {
      "id": "fzq13e6",
      "author": "knezevicm96",
      "body": "Unfortunately, I think the key is to talk to someone in your life. We can all give you advice but since you’re 16 the best help you can get is from your family. You should be open with your parents and tell them how you’ve been feeling. It’s great that you are recognizing the dangerous path you’re on.",
      "created_utc": 1596112320.0,
      "score": 6,
      "context": []
    },
    {
      "id": "fzqgy9c",
      "author": "Lillyismydog1",
      "body": "Throw out the scale. Just do it. If you can’t look at the numbers they can’t torment you.",
      "created_utc": 1596121425.0,
      "score": 5,
      "context": []
    },
    {
      "id": "fzqsv70",
      "author": "punkycharlie",
      "body": "First of all I’m really proud of you for realizing and recognizing the dangerous paths you’re taking and the bad habits, it takes a lot of courage to do so. Please throw out the scale or stop using it and seek help from your family as you are only 16. The best thing would be to be open with your parents about this so they can assist you and help you seek help from a doctor. Try to fight the urges to weight everything and to count calories, you’re strong don’t give up!",
      "created_utc": 1596127051.0,
      "score": 4,
      "context": []
    },
    {
      "id": "fzqo515",
      "author": "ae_and_iou",
      "body": "languid cheerful airport rob cautious dazzling quiet run books groovy\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1596124782.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fzrh0a3",
      "author": "None",
      "body": "Hey friend, \n\nHere are a couple of thoughts and words of encouragement I have for you. \n\nFirst: Calories aren't really what would help you lose weight--the kind of calories also matter. So make sure that the food you're eating is actually healthy, natural, and good for you. Don't exchange good, home-cooked meals for chemical-filled stuff (not that you're necessarily doing that--just a warning!). Do some research, find healthy foods that make you feel full but not heavy, start a good, regular exercise routine, and remember to drink lots of clean, clear water. That would help you flush out your system and make your body cleaner and work better!\n\nSecond, I know it's hard to talk to people you know about this, but speaking from expeirnce, the people who live with you are those who know you best and who are in the best place to really help you when and how you need it. Maybe ask them to think of, and cook, some lighter, more healthy (less calories if that's what you want) foods as an alternative for you? Or just ask them if they're okay with you eating something else. That would take away the \"rudeness\" of not eating what they've cooked, if you just ask first and share your concerns so they know what you're struggling with. \n\nHope that helps you somewhat! Blessings.",
      "created_utc": 1596136055.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fzsegz9",
      "author": "youareinmybubble",
      "body": "I am glad that you are able to recognize that these things rant healthy. An eating disorder int about the food/weight its about control.  Your caloric intake what you eat don't eat how much you weigh these are all things you can control. What else is going on in your life? What are other things you are sutrgglig with?  I would start by find a therapist or a counselor. They can help you breakdown and tackle those issues in your life. I have found that talking with someone who isn't family/friends help a lot. Start by getting ride of the scale. Read about whole nutrition. Its not about restricting but getting the right anount of nutrience. Grains, fruits, veggie, dairy and fats all work together to make you strong mentally and physically.  If you ever want to talk feel free to message me. I will not judge just listen and offer my honest thoughts.",
      "created_utc": 1596143909.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fzstzqh",
      "author": "wdfchicka07",
      "body": "This is definitely disordered eating but its good that you recognize it. I would recommend reading about intuitive eating. Anti-Diet is also a great book. Constantly thinking of or obsessing about food is because of restriction. When you diet or restrict yourself you are signaling famine to your body. Eventually a binge will happen and/or your body will put weight back on. Every body has a set point weight range and your body will fight to get and stay there. Its not worth it, trust me. Enjoy the food and your life! Throw away the scales, stop tracking calories, and just eat what you want when you're hungry. No good foods or bad foods, it all gives your body what it needs to function properly.",
      "created_utc": 1596149709.0,
      "score": 2,
      "context": []
    },
    {
      "id": "fzprb95",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596103843.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g05goda",
      "author": "theFriendlySlytherin",
      "body": "I'm glad you recognize it! I get what you mean though, I used to hide food from my parents all the time... I know it's really scary to face calories but also try and remind yourself a plate of ribs won't really change anything, it's just one meal. \n\nEasier said than done, but it sounds like you're allowed to eat alone right? It might sound weird and it might sound like not really progress but next time when you're alone with a meal like that try making yourself eat it (don't give up on me yet, I know that sounds like a dick thing to say). \n\nLet yourself be upset and afraid though, it's okay if it takes you 3 hours to eat that plate of ribs and it's okay if you cry your eyes out the whole time. I can't tell you how many times I've cried my eyes out eating burgers, pizza, ribs, cake, icecream, etc. Really it's a lot of times... but the next morning I always looked the same and now those things aren't as stressful for me. Don't not eat super awesome tasty food because you're afraid of it. The first few times maybe you'll only get half the meal or less down before you have to quit but keep forcing yourself to face those fears. \n\nI've always found it helpful to call a friend to chat or hang out after to help distract me for the night since I'd always feel so horrible after.",
      "created_utc": 1596408757.0,
      "score": 1,
      "context": []
    }
  ]
}