{
  "id": "i14qyl",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596188658.0,
  "title": "Request: I (28M) think my friend (31F) has an eating disorder but she thinks she's fine. I need advice.",
  "selftext": "\n\nBecause she's worried she \"tricked me into thinking she had a problem,\" I am only including a list of objective facts that she and I have agreed on. Please tell me if you think this is disordered eating, and of course any advice.\n\n1. My friend is 6ft tall which is 8\" taller than the average woman on which calorie recommendations are based. She wants you to know she is overweight according to the BMI chart.  \n\n2. Since at least age 9, she has been more concerned with how fattening food would be than enjoying it.\n\n3. She once in her young adulthood ate so little that she was extremely thin and suffered some related health symptoms. She has recently described this as \"goal.\"\n\n4. She has been told by her mother her whole life that people would like her better if she were thinner, and she agrees.\n\n5. Shortly after quarantine began she began to feel urges to reduce the amount of food she consumes. She began to skip meals.\n\n6. Her eating habits concern her close friends who know about it .\n\n7. Her mom has been very supportive of her weight loss, even when she told her she hasn't been eating much. Recently she told her she was proud of her for not eating.\n\n8. After that, in the past month she began tracking calories.\n\n9. No matter what her calorie goal is, she feels stressed unless she is a couple hundred calories below. She also overestimates her calories.\n\n10.She weighs herself 5+ times a day.\n\n11 She thinks that she looks extremely fat, and I think she looks normal and of average weight.\n\n12 I convinced her to tell her therapist about her eating habits of late.\n\n13 This is a new therapist who hasn't met her in person due to the virus.\n\n14 When she told him the details and that she was worried she might have an eating disorder he told her he wasn't concerned and it didn't sound disordered.\n\n15 He told her that the amount she eats is healthy and he would only be concerned if she regularly ate xxx calories a day (far below healthy). He wasn't concerned that she's lost ~8 lbs in a month.\n\n16 Because of her experience in therapy, she feel like it's ok to continue on this path. I don't like it and I think this is a bad thing. She says she was worried for nothing and is sorry she tricked me into thinking she had an ED.\n\nPlease tell me your thoughts.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i14qyl/request_i_28m_think_my_friend_31f_has_an_eating/",
  "score": 77,
  "num_comments": 8,
  "comments": [
    {
      "id": "fzun2xo",
      "author": "None",
      "body": "It does indeed sound like she has an eating disorder. Having one doesn't necessarily mean to be super skinny or not eat at all, but it's a mind condition. Her way of thinking, her obsessive worry, weighting herself multiple times a day....\n\nIt all does add up to be what it is, and eating disorder, regardless of her body now.",
      "created_utc": 1596193747.0,
      "score": 32,
      "context": []
    },
    {
      "id": "fzurlxm",
      "author": "wsc1983",
      "body": "Does this new therapist have experience with eating disorders?  Something doesn't sound right about the therapist saying that there's nothing to be concerned about.  What did your friend relate to them, exactly?\n\nYour friend definitely has some unhealthy attitudes towards food and her body: categorizing foods into \"good\" and \"bad\" categories, believing that she must to be thin to have value as a person, an obsession with numbers (calories, body weight) and compulsions to control these numbers, fear/anxiety related to food intake, and so on.  If this is not already an eating disorder, it will not take much for it to become an eating disorder.\n\nGetting someone with an eating disorder to acknowledge that they have an eating disorder can be very difficult sometimes.  Eating disorders aren't neccessarily about food, either.  Often it's about lacking control over one's life.  What does she need to have a more fulfulling life (outside of her eating habits)?  You could take an indirect approach and help her achieve some of those goals rather than focusing primarily on her eating.",
      "created_utc": 1596197576.0,
      "score": 15,
      "context": []
    },
    {
      "id": "fzuxlrr",
      "author": "fur_trapper",
      "body": "I’ve struggled with anorexia and body dysmorphic disorder most of my adult life. It’s getting better in terms of my weight, but obsessive thoughts have stuck with me everyday.\n\nHer mother is extremely problematic. My mom is too. Growing up, learning food relationships to be more of a battle than enjoyment and gathering of family was standard. Earning praise when we have “full control” over our eating habits and weight loss. Constant dieting and pinching at bits of fat all over our bodies. It’s terrible and it takes a lifetime to unlearn. We can’t do it alone. Aggressive therapy is necessary. This disease is an addiction. Depending on where your friend lives, there are meeting groups specifically for those struggling with eating disorders. Knowing and listening to others speak to their experience and talking about this aloud can be very liberating and comforting. Admitting it is the first step. She is absolutely NOT ALONE. \n\nHer therapist should be someone who has experience with eating disorder and addiction therapy and treatment. Those therapists are out there. They must be able to articulate the sensitive language that is necessary for those who battle ED. I hope she continues to inquire in the search for the right counselor. It took me going through 5-6 therapists to find the right fit. It’s almost never the first. \n\nI recommend the podcast Food Psych. It is very informational. You’re a good friend. I hope she finds some peace soon.",
      "created_utc": 1596201708.0,
      "score": 7,
      "context": []
    },
    {
      "id": "fzuhxre",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596188658.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzyu9qx",
      "author": "Ari3n3tt3",
      "body": "Restrictive eating disorders are about gaining control so however you decide to approach her.. keep that in mind.\nEating disorders are deceptive. This sucks. If you decide to talk to her about it she might lie. Try not to take it personally.\nRecovery is best when the person who needs it seeks it themselves. It means they don’t have to worry about letting anyone else down.",
      "created_utc": 1596270783.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g04rq5o",
      "author": "yellowsub9999",
      "body": "i think the above comments have added good insight, the only thing i want to add is about the therapist. They said that her daily calories/weight loss is healthy but are they an MD or registered nutritionist? they might not be qualified to speak on this physical effects",
      "created_utc": 1596395651.0,
      "score": 1,
      "context": []
    },
    {
      "id": "fzyk4kf",
      "author": "toddthefox47",
      "body": "Unfortunately she's a recent DV escapee going through a custody battle and coming to grips with her abusive childhood. She has C-PTSD. Thanks for your comment it helped",
      "created_utc": 1596261092.0,
      "score": 2,
      "context": [
        {
          "id": "fzurlxm",
          "author": "wsc1983",
          "body": "Does this new therapist have experience with eating disorders?  Something doesn't sound right about the therapist saying that there's nothing to be concerned about.  What did your friend relate to them, exactly?\n\nYour friend definitely has some unhealthy attitudes towards food and her body: categorizing foods into \"good\" and \"bad\" categories, believing that she must to be thin to have value as a person, an obsession with numbers (calories, body weight) and compulsions to control these numbers, fear/anxiety related to food intake, and so on.  If this is not already an eating disorder, it will not take much for it to become an eating disorder.\n\nGetting someone with an eating disorder to acknowledge that they have an eating disorder can be very difficult sometimes.  Eating disorders aren't neccessarily about food, either.  Often it's about lacking control over one's life.  What does she need to have a more fulfulling life (outside of her eating habits)?  You could take an indirect approach and help her achieve some of those goals rather than focusing primarily on her eating.",
          "created_utc": 1596197576.0
        }
      ]
    },
    {
      "id": "fzvfded",
      "author": "toddthefox47",
      "body": "Her mother was and still is abusive but she's not ready to admit that yet :/\n\nThis whole debacle has made her decide she actually has no problems at all",
      "created_utc": 1596208896.0,
      "score": 2,
      "context": [
        {
          "id": "fzuxlrr",
          "author": "fur_trapper",
          "body": "I’ve struggled with anorexia and body dysmorphic disorder most of my adult life. It’s getting better in terms of my weight, but obsessive thoughts have stuck with me everyday.\n\nHer mother is extremely problematic. My mom is too. Growing up, learning food relationships to be more of a battle than enjoyment and gathering of family was standard. Earning praise when we have “full control” over our eating habits and weight loss. Constant dieting and pinching at bits of fat all over our bodies. It’s terrible and it takes a lifetime to unlearn. We can’t do it alone. Aggressive therapy is necessary. This disease is an addiction. Depending on where your friend lives, there are meeting groups specifically for those struggling with eating disorders. Knowing and listening to others speak to their experience and talking about this aloud can be very liberating and comforting. Admitting it is the first step. She is absolutely NOT ALONE. \n\nHer therapist should be someone who has experience with eating disorder and addiction therapy and treatment. Those therapists are out there. They must be able to articulate the sensitive language that is necessary for those who battle ED. I hope she continues to inquire in the search for the right counselor. It took me going through 5-6 therapists to find the right fit. It’s almost never the first. \n\nI recommend the podcast Food Psych. It is very informational. You’re a good friend. I hope she finds some peace soon.",
          "created_utc": 1596201708.0
        }
      ]
    }
  ]
}