{
  "id": "i2ir8v",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596398925.0,
  "title": "Request: Does anyone else feel sad that they can’t try diets?",
  "selftext": "Does anyone else feel sad that they can’t try diets?\n\nI suffer from bulimia and I’m currently in therapy to help with that. I’ve had a lot of issues with weight loss and gain throughout the years because of it. To make matters worse, I’m bipolar as well so my moods really affect my eating. Because of COVID, I’ve gained a little weight back after losing almost 30 lbs (the healthy way). \n\nLike I mentioned, I’m in therapy now and she REALLY looks down on restrictive diets. I used to calorie count but she’s really hesitant to encourage that because I get carried away so easily. I know dieting isn’t good for you. I just see all of this “intermittent fasting”, “juice cleanse”, “counting macros”, etc. that I want to try. It sucks not being able to engage like normal people. Why do I have to take everything to an unhealthy place? Does anyone else feel like it’s just one more reminder of how you can’t be like others?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i2ir8v/request_does_anyone_else_feel_sad_that_they_cant/",
  "score": 80,
  "num_comments": 20,
  "comments": [
    {
      "id": "g059tdn",
      "author": "mosephis13",
      "body": "It’s a very slippery slope, and unless someone has had an ED, they don’t understand why you can’t diet to lose a few pounds.  Those of us who’ve been there no how easy it is to become compulsive.",
      "created_utc": 1596405019.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g05c3qd",
      "author": "None",
      "body": "This is how I am currently feeling. Every time I try a diet I end up relapsing. But my nutritionist has reminded me that the whole idea of a “diet” is to temporarily change the way you eat to lose weight and people in GENERAL should avoid dieting because it just doesn’t work. The whole keto thing is a great example; I’ve known a lot of people who have lost weight on it but ended up gaining all of it or more back because they went back to how they were originally eating. Try to think of it in those terms. Dieting isn’t good for anyone",
      "created_utc": 1596406229.0,
      "score": 15,
      "context": []
    },
    {
      "id": "g050589",
      "author": "sl4ppyh4ppy",
      "body": "I get this way about exercise too. I wish I could go out for a nice walk without tracking everything about it and turning it into a forced march that goes on for hours. I totally get what you're talking about & I wish we could enjoy things like a normal person!",
      "created_utc": 1596399886.0,
      "score": 24,
      "context": []
    },
    {
      "id": "g05pemh",
      "author": "jeabgrenouille",
      "body": "My two cents is that if you really rewire your brain and go through the full recovery process, you will not want to do those diets. \n\nThat being said, you can be fit after recovering and rewiring. I believe I have a certain talent for some sports and fitness pursuits and I can have them in my life because I have rewired and recovered AND I have learned about how to be an athlete and how to care for my body in order to perform well. I also learned a lot about how to be mindful of harmful thoughts and how to do the opposite. I think we need to be aware of how the body works and how the ED brain works in order to be successful. I do NOT believe that we shoulder ever ever try and be super lean instagram models or enter bodybuilding shows, but we can be fit people.\n\nFit and truly healthy (feel good, good sleep, good hormone function, good sex drive, etc) not diets!",
      "created_utc": 1596413850.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g04ymju",
      "author": "lolikittenv",
      "body": "Trying to do keto but any diet I do turns into fasting to get to the goal faster :/",
      "created_utc": 1596399091.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g04yb4z",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596398925.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g05uko1",
      "author": "TheOneQueen",
      "body": "Not really, cuz I hate them. Can’t give blood either.",
      "created_utc": 1596416931.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g05603i",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1596403007.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g05k0cz",
      "author": "wdfchicka07",
      "body": "How are diets helpful when they have been scientifically proven that they don't work? What do you think dieting does for you? I agree with your therapist that calorie counting is not a good idea. All diets are restrictive and that just fuels the eating disorder. Calorie counting can create restriction and obsession. Others doing cleanses, fasting, etc. is not normal. Society wants us to think it is normal, but its not. Listening to your body, eating when you are hungry, and eating what you choose to eat-that is normal. I recommend reading the Anti-Diet by Christy Harrison, or the Fuck It Diet. Maybe they will help change your perspective. Dieting doesn't work, period. Wanting to try those things is a result of diet culture. The more you diet and restrict, the more your body will fight you. Change up your social media. Follow Anti-Diet and HAES supporters, food freedom coaches, etc. Unfollow accounts focused on weight loss, macros, counting calories, etc.",
      "created_utc": 1596410670.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g0ia9p1",
      "author": "AK1886",
      "body": "I’m bipolR too!!! Have you checked our r/bipolar it’s a great community.",
      "created_utc": 1596674361.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g05wj0h",
      "author": "DandiLies56Gym",
      "body": "It’s like, if you are a recovered alcoholic, you will never be able to have another sip or just one drink. They don’t have the impulse control even after recovery... same with EDs. Like for me I cannot lose weight without it turning into severe restriction. I struggle with a typical anorexia and binge eating on and off. One year I’m restricting, and the next I’m binging. I hate it. That is how my ED truly started with the restricting and I used to sometimes purge. It started after softball season ended in freshmen year of high school, and I wanted to continue the healthy path through the summer, so I came up with a rigorous hour by hour schedule I stuck to until sophomore year started and somehow I started cutting down what I was eating. Then I started increasing the schedule and then I cut more food back. By the time sophomore year started I was in full blown restriction, then my twin sister taught how to purge. I fought on and off constantly through highschool. And college and now I am 26 and still struggling very much so",
      "created_utc": 1596418105.0,
      "score": 3,
      "context": [
        {
          "id": "g059tdn",
          "author": "mosephis13",
          "body": "It’s a very slippery slope, and unless someone has had an ED, they don’t understand why you can’t diet to lose a few pounds.  Those of us who’ve been there no how easy it is to become compulsive.",
          "created_utc": 1596405019.0
        }
      ]
    },
    {
      "id": "g05i583",
      "author": "seatangle",
      "body": "This! The diet industry would not make billions of dollars if any of those diets actually worked. \n\nIf my eating disorder taught me anything it’s that the only way to lose weight is to put in less than you burn off and in the end it doesn’t fucking matter what time of day you eat or the type of food you are eating. Keto, intermittent fasting, paleo - all diets are such bullshit.",
      "created_utc": 1596409596.0,
      "score": 8,
      "context": [
        {
          "id": "g05c3qd",
          "author": "None",
          "body": "This is how I am currently feeling. Every time I try a diet I end up relapsing. But my nutritionist has reminded me that the whole idea of a “diet” is to temporarily change the way you eat to lose weight and people in GENERAL should avoid dieting because it just doesn’t work. The whole keto thing is a great example; I’ve known a lot of people who have lost weight on it but ended up gaining all of it or more back because they went back to how they were originally eating. Try to think of it in those terms. Dieting isn’t good for anyone",
          "created_utc": 1596406229.0
        }
      ]
    },
    {
      "id": "g064j2n",
      "author": "canyonlands2",
      "body": "This so much! If you don’t plan on sticking to it the rest of your entire life, diet results aren’t going to last in the long term. The only lifetime diet that’s real is a lifetime diet change",
      "created_utc": 1596422939.0,
      "score": 2,
      "context": [
        {
          "id": "g05c3qd",
          "author": "None",
          "body": "This is how I am currently feeling. Every time I try a diet I end up relapsing. But my nutritionist has reminded me that the whole idea of a “diet” is to temporarily change the way you eat to lose weight and people in GENERAL should avoid dieting because it just doesn’t work. The whole keto thing is a great example; I’ve known a lot of people who have lost weight on it but ended up gaining all of it or more back because they went back to how they were originally eating. Try to think of it in those terms. Dieting isn’t good for anyone",
          "created_utc": 1596406229.0
        }
      ]
    },
    {
      "id": "g05yn2f",
      "author": "FiendfyreFemmeFatal",
      "body": "This is gorgeous. I’ll let you know when my wiring snaps back into place lol. Unfortunately since I was a kid, self confidence has always been an issue. So when people mention how much or how little I’ve gained, I allow it to go to heart. \n\nI actually purchased a scale where I painted “healthy not skinny” on it. That helped believe it or not. COVID has been hard because all of the physical activities I actually enjoy are no longer commonplace (rock climbing, swimming at the beach, runnin a couple laps at the gym). I really strive to reach “healthy”. Any tips you may have to encourage this mindset would be greatly appreciated 💚",
      "created_utc": 1596419375.0,
      "score": 3,
      "context": [
        {
          "id": "g05pemh",
          "author": "jeabgrenouille",
          "body": "My two cents is that if you really rewire your brain and go through the full recovery process, you will not want to do those diets. \n\nThat being said, you can be fit after recovering and rewiring. I believe I have a certain talent for some sports and fitness pursuits and I can have them in my life because I have rewired and recovered AND I have learned about how to be an athlete and how to care for my body in order to perform well. I also learned a lot about how to be mindful of harmful thoughts and how to do the opposite. I think we need to be aware of how the body works and how the ED brain works in order to be successful. I do NOT believe that we shoulder ever ever try and be super lean instagram models or enter bodybuilding shows, but we can be fit people.\n\nFit and truly healthy (feel good, good sleep, good hormone function, good sex drive, etc) not diets!",
          "created_utc": 1596413850.0
        }
      ]
    },
    {
      "id": "g05gh2d",
      "author": "Spacemilk",
      "body": "I struggle hard with CICO long term but I like using it to reset/benchmark what is a “standard” day, ie what is a normal portion size, what does “full” really feel like in terms of getting enough nutrients and also being satisfied, and how does this all line up with my current activity levels.\n\nFor me personally though, CICO long term ends up with me obsessing over the most minute items which I MUST log, spending inordinate amounts of time crafting insane recipes and meals to fit my macros (instead of just, yknow, eating what sounds good and is good for me), beating myself up when I go over, over-exercising to “atone” for the previous days sins...it becomes obsessive to the point of self harm within, at most, a month or two of CICO. But luckily that’s a good amount of time to reset my mental picture of what a “standard” day is, so then I quit after that and save myself the inevitable spiral into what is really just another ED.",
      "created_utc": 1596408642.0,
      "score": 3,
      "context": [
        {
          "id": "g05603i",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1596403007.0
        }
      ]
    },
    {
      "id": "g05vb75",
      "author": "FiendfyreFemmeFatal",
      "body": "I totally agree. I used to calorie count and the ONLY reason it was helpful was because it showed me what a “serving” looked like. As an American, our plates are FILLED and as a kid I was taught to “finish everything on your plate”. Once I found foods that were more filling in smaller portions I stopped counting and just started adjusting my meals to include those things (rice, potatoes, cruciferous veggies, etc). \n\nBut I totally agree dieting isn’t a healthy option. I’ve seen all my friends so keto, paleo, Atkins, etc and they gain in all back in days. I just wish I could try to do something like a cleanse or intermittent fasting. That may be the ED talking though 😰",
      "created_utc": 1596417375.0,
      "score": 1,
      "context": [
        {
          "id": "g05k0cz",
          "author": "wdfchicka07",
          "body": "How are diets helpful when they have been scientifically proven that they don't work? What do you think dieting does for you? I agree with your therapist that calorie counting is not a good idea. All diets are restrictive and that just fuels the eating disorder. Calorie counting can create restriction and obsession. Others doing cleanses, fasting, etc. is not normal. Society wants us to think it is normal, but its not. Listening to your body, eating when you are hungry, and eating what you choose to eat-that is normal. I recommend reading the Anti-Diet by Christy Harrison, or the Fuck It Diet. Maybe they will help change your perspective. Dieting doesn't work, period. Wanting to try those things is a result of diet culture. The more you diet and restrict, the more your body will fight you. Change up your social media. Follow Anti-Diet and HAES supporters, food freedom coaches, etc. Unfollow accounts focused on weight loss, macros, counting calories, etc.",
          "created_utc": 1596410670.0
        }
      ]
    },
    {
      "id": "g06bgsx",
      "author": "jeabgrenouille",
      "body": "Cool! I can think of a few pieces of advice:\n\n1. Social media. When I follow athletes and fitness people, I am very careful to only follow people who I think are good role models to me and/or speak about the science related to fitness (not stupid diet hogwash that is harmful long-term). I really like Natacha Océane for the science and Kara Saunders, Amanda Barnhart, and Lindsay Dawn Webster are some of my favourite female athletes to follow. I also continue to watch specifically ED content from Tabitha Farrar to make sure I keep my brain vigilant against ED thoughts. I have to deal with them less and less and less and it gets easier and easier, but I feel I have to always be vigilant about it. The more I have learned about how my body and brain work, the better I have become mentally. \n\n2. Control. I do not decide how much I workout. I used to feel a lot of stress and thoughts would go around and around in my head about should I workout? What kind of workout? How long? Is that enough? Is that too much? It was very stressful and sometimes I'd spend all day debating about what would be perfect. I found that a great solution has been to put control in others' hands. I currently do group training with a trainer who I adore. I just come to his workouts as they are scheduled and do what's planned. No more than that what's on the plan. Bam. No problem. Whenever I don't have that option, I have purchased fitness plans (I have two of Natacha Océane's plans... I love her style. I have also bought two of Stephanie Buttermore's plans, but they aren't as fun to me.) And then I have just done them as prescribed. No more. If others are doing more, good thing I have practiced telling myself that my body is not affected by other people's choices and I have practiced not acting on thoughts about needing to do the most.\n\n3. Practicing breaking routine: the best thing that ever happened to me was taking extended time off of fitness and eating foods I was scared of. I did these things at the same time, and nothing bad happened at all. Once I went back to exercising, I had to build back up, but it was no big deal at all. I then knew I could take a break whenever I needed to or wanted to and nothing bad would happen. This was very important to my relationship with exercise. I just kept those previously scary foods in my diet because I realized they were just food and not magic or evil. This was also important. These things allow me to live a balanced and flexible life where I can workout, but I can also skip it if I need to, and I can eat \"healthy\" and make sure I fuel myself to perform well,  but I can also go out for ice cream, for example. \n\n4. Practicing discipline in a new way: Having had anorexia, I think there is something in me that makes me inherently very disciplined, and I've learned that sometimes, being disciplined means following my plan when I want to do more, taking rest days when I don't want to, slowing down when I need to, building up more slowly than I want to, eating when I don't want to, doing the opposite of harmful thoughts as they come, etc. I am also exercising discipline by not trying to \"cut\" or lean out because I know that I'm at a weight that is sustainable for the lifestyle that I want to have (I want to be fast and strong and continue to improve those things and feel good in my workouts, but I also want to be able to relax and be flexible) and I know that being at the weight I'm at helps me to feel good and perform well. If I were to try and lose weight, I know that it would be vanity weight loss and my performance and energy would suffer. I feel very proud of myself for being disciplined in this way because I know that it took a lot of work and practice to do it.\n\nThat's all I can think of for now. I had to go through a lot of trial and error and extreme hunger and weight gain and insecurity and lots of failure, but I really feel like I'm on a good track and I feel very proud and happy and free in general, especially when I reflect on how messy my journey has been and how IMPOSSIBLE almost every little thing I now do on a daily basis would have been 7+ years ago. It can get better and better and better bit by bit by bit by bit.",
      "created_utc": 1596427448.0,
      "score": 3,
      "context": [
        {
          "id": "g05pemh",
          "author": "jeabgrenouille",
          "body": "My two cents is that if you really rewire your brain and go through the full recovery process, you will not want to do those diets. \n\nThat being said, you can be fit after recovering and rewiring. I believe I have a certain talent for some sports and fitness pursuits and I can have them in my life because I have rewired and recovered AND I have learned about how to be an athlete and how to care for my body in order to perform well. I also learned a lot about how to be mindful of harmful thoughts and how to do the opposite. I think we need to be aware of how the body works and how the ED brain works in order to be successful. I do NOT believe that we shoulder ever ever try and be super lean instagram models or enter bodybuilding shows, but we can be fit people.\n\nFit and truly healthy (feel good, good sleep, good hormone function, good sex drive, etc) not diets!",
          "created_utc": 1596413850.0
        },
        {
          "id": "g05yn2f",
          "author": "FiendfyreFemmeFatal",
          "body": "This is gorgeous. I’ll let you know when my wiring snaps back into place lol. Unfortunately since I was a kid, self confidence has always been an issue. So when people mention how much or how little I’ve gained, I allow it to go to heart. \n\nI actually purchased a scale where I painted “healthy not skinny” on it. That helped believe it or not. COVID has been hard because all of the physical activities I actually enjoy are no longer commonplace (rock climbing, swimming at the beach, runnin a couple laps at the gym). I really strive to reach “healthy”. Any tips you may have to encourage this mindset would be greatly appreciated 💚",
          "created_utc": 1596419375.0
        }
      ]
    },
    {
      "id": "g05wa8e",
      "author": "wdfchicka07",
      "body": "Thats the ED talking! Separate your true thoughts from those thoughts. If you've seen friends fail on those diets then you know a cleanse or IF is just a different diet that isn't going to work. You don't have to finish your plate if you're not hungry. I was taught that too. Eat what sounds good, eat slowly and be mindful of what you're eating. It makes it more enjoyable and allows you to tune into your body when it tells you its full. There's really no need to diet, enjoy your life without trying to control your body. Every body is beautiful 😍",
      "created_utc": 1596417958.0,
      "score": 2,
      "context": [
        {
          "id": "g05k0cz",
          "author": "wdfchicka07",
          "body": "How are diets helpful when they have been scientifically proven that they don't work? What do you think dieting does for you? I agree with your therapist that calorie counting is not a good idea. All diets are restrictive and that just fuels the eating disorder. Calorie counting can create restriction and obsession. Others doing cleanses, fasting, etc. is not normal. Society wants us to think it is normal, but its not. Listening to your body, eating when you are hungry, and eating what you choose to eat-that is normal. I recommend reading the Anti-Diet by Christy Harrison, or the Fuck It Diet. Maybe they will help change your perspective. Dieting doesn't work, period. Wanting to try those things is a result of diet culture. The more you diet and restrict, the more your body will fight you. Change up your social media. Follow Anti-Diet and HAES supporters, food freedom coaches, etc. Unfollow accounts focused on weight loss, macros, counting calories, etc.",
          "created_utc": 1596410670.0
        },
        {
          "id": "g05vb75",
          "author": "FiendfyreFemmeFatal",
          "body": "I totally agree. I used to calorie count and the ONLY reason it was helpful was because it showed me what a “serving” looked like. As an American, our plates are FILLED and as a kid I was taught to “finish everything on your plate”. Once I found foods that were more filling in smaller portions I stopped counting and just started adjusting my meals to include those things (rice, potatoes, cruciferous veggies, etc). \n\nBut I totally agree dieting isn’t a healthy option. I’ve seen all my friends so keto, paleo, Atkins, etc and they gain in all back in days. I just wish I could try to do something like a cleanse or intermittent fasting. That may be the ED talking though 😰",
          "created_utc": 1596417375.0
        }
      ]
    },
    {
      "id": "g06innt",
      "author": "FiendfyreFemmeFatal",
      "body": "You’re seriously amazing. This is all stellar advice. I’m really going to look into Tabitha Farrar because I think that would be great to hear ED specific info. I have a friend who’s a personal trainer and, even though she means well, she really doesn’t understand how damaging it is to tell someone with a “proclivity to purge” that food should never be enjoyed, just consumed for fuel. \n\nSometimes it’s hard finding the right encouragement because I started eating vegan about a year ago. I didn’t do it for health, it was a personal ethical choice but it’s hard to find ED nutritionists who fit into that specific niche lol. I like listening to Evanna Lynch because she has an ED and she’s a vegan advocate but other than that I got zilch lol.  \n\nThe sciency fitness stuff does sound interesting though. I really need to find that motivation to move again. Thank you for all of this info! 💚💚",
      "created_utc": 1596432881.0,
      "score": 3,
      "context": [
        {
          "id": "g05pemh",
          "author": "jeabgrenouille",
          "body": "My two cents is that if you really rewire your brain and go through the full recovery process, you will not want to do those diets. \n\nThat being said, you can be fit after recovering and rewiring. I believe I have a certain talent for some sports and fitness pursuits and I can have them in my life because I have rewired and recovered AND I have learned about how to be an athlete and how to care for my body in order to perform well. I also learned a lot about how to be mindful of harmful thoughts and how to do the opposite. I think we need to be aware of how the body works and how the ED brain works in order to be successful. I do NOT believe that we shoulder ever ever try and be super lean instagram models or enter bodybuilding shows, but we can be fit people.\n\nFit and truly healthy (feel good, good sleep, good hormone function, good sex drive, etc) not diets!",
          "created_utc": 1596413850.0
        },
        {
          "id": "g05yn2f",
          "author": "FiendfyreFemmeFatal",
          "body": "This is gorgeous. I’ll let you know when my wiring snaps back into place lol. Unfortunately since I was a kid, self confidence has always been an issue. So when people mention how much or how little I’ve gained, I allow it to go to heart. \n\nI actually purchased a scale where I painted “healthy not skinny” on it. That helped believe it or not. COVID has been hard because all of the physical activities I actually enjoy are no longer commonplace (rock climbing, swimming at the beach, runnin a couple laps at the gym). I really strive to reach “healthy”. Any tips you may have to encourage this mindset would be greatly appreciated 💚",
          "created_utc": 1596419375.0
        },
        {
          "id": "g06bgsx",
          "author": "jeabgrenouille",
          "body": "Cool! I can think of a few pieces of advice:\n\n1. Social media. When I follow athletes and fitness people, I am very careful to only follow people who I think are good role models to me and/or speak about the science related to fitness (not stupid diet hogwash that is harmful long-term). I really like Natacha Océane for the science and Kara Saunders, Amanda Barnhart, and Lindsay Dawn Webster are some of my favourite female athletes to follow. I also continue to watch specifically ED content from Tabitha Farrar to make sure I keep my brain vigilant against ED thoughts. I have to deal with them less and less and less and it gets easier and easier, but I feel I have to always be vigilant about it. The more I have learned about how my body and brain work, the better I have become mentally. \n\n2. Control. I do not decide how much I workout. I used to feel a lot of stress and thoughts would go around and around in my head about should I workout? What kind of workout? How long? Is that enough? Is that too much? It was very stressful and sometimes I'd spend all day debating about what would be perfect. I found that a great solution has been to put control in others' hands. I currently do group training with a trainer who I adore. I just come to his workouts as they are scheduled and do what's planned. No more than that what's on the plan. Bam. No problem. Whenever I don't have that option, I have purchased fitness plans (I have two of Natacha Océane's plans... I love her style. I have also bought two of Stephanie Buttermore's plans, but they aren't as fun to me.) And then I have just done them as prescribed. No more. If others are doing more, good thing I have practiced telling myself that my body is not affected by other people's choices and I have practiced not acting on thoughts about needing to do the most.\n\n3. Practicing breaking routine: the best thing that ever happened to me was taking extended time off of fitness and eating foods I was scared of. I did these things at the same time, and nothing bad happened at all. Once I went back to exercising, I had to build back up, but it was no big deal at all. I then knew I could take a break whenever I needed to or wanted to and nothing bad would happen. This was very important to my relationship with exercise. I just kept those previously scary foods in my diet because I realized they were just food and not magic or evil. This was also important. These things allow me to live a balanced and flexible life where I can workout, but I can also skip it if I need to, and I can eat \"healthy\" and make sure I fuel myself to perform well,  but I can also go out for ice cream, for example. \n\n4. Practicing discipline in a new way: Having had anorexia, I think there is something in me that makes me inherently very disciplined, and I've learned that sometimes, being disciplined means following my plan when I want to do more, taking rest days when I don't want to, slowing down when I need to, building up more slowly than I want to, eating when I don't want to, doing the opposite of harmful thoughts as they come, etc. I am also exercising discipline by not trying to \"cut\" or lean out because I know that I'm at a weight that is sustainable for the lifestyle that I want to have (I want to be fast and strong and continue to improve those things and feel good in my workouts, but I also want to be able to relax and be flexible) and I know that being at the weight I'm at helps me to feel good and perform well. If I were to try and lose weight, I know that it would be vanity weight loss and my performance and energy would suffer. I feel very proud of myself for being disciplined in this way because I know that it took a lot of work and practice to do it.\n\nThat's all I can think of for now. I had to go through a lot of trial and error and extreme hunger and weight gain and insecurity and lots of failure, but I really feel like I'm on a good track and I feel very proud and happy and free in general, especially when I reflect on how messy my journey has been and how IMPOSSIBLE almost every little thing I now do on a daily basis would have been 7+ years ago. It can get better and better and better bit by bit by bit by bit.",
          "created_utc": 1596427448.0
        }
      ]
    },
    {
      "id": "g0970lb",
      "author": "jeabgrenouille",
      "body": "I'm glad I could help!! Yes, I really recommend finding people who talk about eating disorders specifically because we definitely have different things to work on when it comes to improving our overall wellness than many other people.\n\nWhen it comes to motivation, if you truly feel that you are in a place where movement can be a part of your life, I found the best thing to do was to set very low standards. I'm such a perfectionist like many of us, and sometimes I would think a workout had to be a certain length and a run had to be a certain distance. I started to love moving when I set lower standards for what movement is and what it means to me.\n\nSometimes I walk with an audiobook or podcast. Sometimes I have just run for 1 minute and then walked for 1 minute for only ten minutes total. Sometimes I run and take 100 breaks to take pictures of the river. Sometimes I play frisbee with my husband. Sometimes I spend a few minutes learning tiktok dances. In the past, I have joined intramural sports teams. I consider myself very fit, and I do push myself and work hard sometimes, but I am in a place where I want to work hard because I stopped pressuring myself to always work super hard, if that makes sense. I notice that only working super hard a few days a week helps me make more progress in my fitness anyway. \n\nGetting stronger and faster helps me with my confidence. HOWEVER. If I were being honest with myself, and I knew that fitness was not something that I was ready for, I would do myself a favour and do whatever work I need to do on rewiring my brain and take more time off of exercise, and making that choice that I know deep down is best for me would make me feel good about myself, even if it would be uncomfortable and not necessarily what I wish I were doing.",
      "created_utc": 1596487544.0,
      "score": 3,
      "context": [
        {
          "id": "g05pemh",
          "author": "jeabgrenouille",
          "body": "My two cents is that if you really rewire your brain and go through the full recovery process, you will not want to do those diets. \n\nThat being said, you can be fit after recovering and rewiring. I believe I have a certain talent for some sports and fitness pursuits and I can have them in my life because I have rewired and recovered AND I have learned about how to be an athlete and how to care for my body in order to perform well. I also learned a lot about how to be mindful of harmful thoughts and how to do the opposite. I think we need to be aware of how the body works and how the ED brain works in order to be successful. I do NOT believe that we shoulder ever ever try and be super lean instagram models or enter bodybuilding shows, but we can be fit people.\n\nFit and truly healthy (feel good, good sleep, good hormone function, good sex drive, etc) not diets!",
          "created_utc": 1596413850.0
        },
        {
          "id": "g05yn2f",
          "author": "FiendfyreFemmeFatal",
          "body": "This is gorgeous. I’ll let you know when my wiring snaps back into place lol. Unfortunately since I was a kid, self confidence has always been an issue. So when people mention how much or how little I’ve gained, I allow it to go to heart. \n\nI actually purchased a scale where I painted “healthy not skinny” on it. That helped believe it or not. COVID has been hard because all of the physical activities I actually enjoy are no longer commonplace (rock climbing, swimming at the beach, runnin a couple laps at the gym). I really strive to reach “healthy”. Any tips you may have to encourage this mindset would be greatly appreciated 💚",
          "created_utc": 1596419375.0
        },
        {
          "id": "g06bgsx",
          "author": "jeabgrenouille",
          "body": "Cool! I can think of a few pieces of advice:\n\n1. Social media. When I follow athletes and fitness people, I am very careful to only follow people who I think are good role models to me and/or speak about the science related to fitness (not stupid diet hogwash that is harmful long-term). I really like Natacha Océane for the science and Kara Saunders, Amanda Barnhart, and Lindsay Dawn Webster are some of my favourite female athletes to follow. I also continue to watch specifically ED content from Tabitha Farrar to make sure I keep my brain vigilant against ED thoughts. I have to deal with them less and less and less and it gets easier and easier, but I feel I have to always be vigilant about it. The more I have learned about how my body and brain work, the better I have become mentally. \n\n2. Control. I do not decide how much I workout. I used to feel a lot of stress and thoughts would go around and around in my head about should I workout? What kind of workout? How long? Is that enough? Is that too much? It was very stressful and sometimes I'd spend all day debating about what would be perfect. I found that a great solution has been to put control in others' hands. I currently do group training with a trainer who I adore. I just come to his workouts as they are scheduled and do what's planned. No more than that what's on the plan. Bam. No problem. Whenever I don't have that option, I have purchased fitness plans (I have two of Natacha Océane's plans... I love her style. I have also bought two of Stephanie Buttermore's plans, but they aren't as fun to me.) And then I have just done them as prescribed. No more. If others are doing more, good thing I have practiced telling myself that my body is not affected by other people's choices and I have practiced not acting on thoughts about needing to do the most.\n\n3. Practicing breaking routine: the best thing that ever happened to me was taking extended time off of fitness and eating foods I was scared of. I did these things at the same time, and nothing bad happened at all. Once I went back to exercising, I had to build back up, but it was no big deal at all. I then knew I could take a break whenever I needed to or wanted to and nothing bad would happen. This was very important to my relationship with exercise. I just kept those previously scary foods in my diet because I realized they were just food and not magic or evil. This was also important. These things allow me to live a balanced and flexible life where I can workout, but I can also skip it if I need to, and I can eat \"healthy\" and make sure I fuel myself to perform well,  but I can also go out for ice cream, for example. \n\n4. Practicing discipline in a new way: Having had anorexia, I think there is something in me that makes me inherently very disciplined, and I've learned that sometimes, being disciplined means following my plan when I want to do more, taking rest days when I don't want to, slowing down when I need to, building up more slowly than I want to, eating when I don't want to, doing the opposite of harmful thoughts as they come, etc. I am also exercising discipline by not trying to \"cut\" or lean out because I know that I'm at a weight that is sustainable for the lifestyle that I want to have (I want to be fast and strong and continue to improve those things and feel good in my workouts, but I also want to be able to relax and be flexible) and I know that being at the weight I'm at helps me to feel good and perform well. If I were to try and lose weight, I know that it would be vanity weight loss and my performance and energy would suffer. I feel very proud of myself for being disciplined in this way because I know that it took a lot of work and practice to do it.\n\nThat's all I can think of for now. I had to go through a lot of trial and error and extreme hunger and weight gain and insecurity and lots of failure, but I really feel like I'm on a good track and I feel very proud and happy and free in general, especially when I reflect on how messy my journey has been and how IMPOSSIBLE almost every little thing I now do on a daily basis would have been 7+ years ago. It can get better and better and better bit by bit by bit by bit.",
          "created_utc": 1596427448.0
        },
        {
          "id": "g06innt",
          "author": "FiendfyreFemmeFatal",
          "body": "You’re seriously amazing. This is all stellar advice. I’m really going to look into Tabitha Farrar because I think that would be great to hear ED specific info. I have a friend who’s a personal trainer and, even though she means well, she really doesn’t understand how damaging it is to tell someone with a “proclivity to purge” that food should never be enjoyed, just consumed for fuel. \n\nSometimes it’s hard finding the right encouragement because I started eating vegan about a year ago. I didn’t do it for health, it was a personal ethical choice but it’s hard to find ED nutritionists who fit into that specific niche lol. I like listening to Evanna Lynch because she has an ED and she’s a vegan advocate but other than that I got zilch lol.  \n\nThe sciency fitness stuff does sound interesting though. I really need to find that motivation to move again. Thank you for all of this info! 💚💚",
          "created_utc": 1596432881.0
        }
      ]
    }
  ]
}