{
  "id": "i38apq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596497781.0,
  "title": "Request: How do you deal with shame in anorexia recovery?",
  "selftext": "After a few months of weight restoration, I’m still unequipped to deal with the different moments of intense shame that seem to happen all of the time in recovery. I’ve felt ashamed when I  “you look healthier”, or realise I outgrew my favourite clothes. I’ve felt ashamed when people have seen even a sliver of your body; I don’t think I wear anything besides hoodies and sweatpants nowadays. I hate that I have to eat in front of people.  I hate the thought they’re seeing me eat. It feels as though my embarrassment is so great these days, I can barely go on.\n\nAs a result of this chronic shame, I am resentful of recovery. I don’t want to keep going; I want to go back so that I undo all of my new habits. Obviously, this isn’t sustainable long term, so does anyone know some healthier ways of dealing with shame?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i38apq/request_how_do_you_deal_with_shame_in_anorexia/",
  "score": 66,
  "num_comments": 6,
  "comments": [
    {
      "id": "g0a374x",
      "author": "kpoppin420",
      "body": "I relate to this so well. I have come across a few experiences that didn't bring up that shame that might help you. I find focusing on other parts of myself when I look in the mirror helps a lot. I will look at how beautiful other aspects of my human body are, not just the size of it. Also, if you can, save up some money and go buy some new favorite clothes. Put away the clothes that only fit you when you're harming your body. They're not worth it and there are tons of beautiful clothes out there that will help you regain the confidence in your body. I know for me I didnt want to go up a size. I felt so much shame in that. I feel like my way around that was instead of going back to the same stores and feeling the shame of buying the \"next size up\" I just started shopping at new stores. I found stores where I had never been so I got to try on multiple sizes at once to see what felt best. Most of all, try and remind yourself that numbers and letters don't define you! That's all weight and size is, letters and numbers. We are so much more than that. We deserves lives free of this shame, and together we can continue to share and find our ways through it. I promise you don't need to carry shame in healing your body, and if anyone does actively try and shame you, including yourself, they are dead wrong! Just keep focusing on your physical health, you'll get through this <3",
      "created_utc": 1596504111.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g0a12ar",
      "author": "spycam99",
      "body": "i do not know how to help with the shame but i am proud of your recovery thus far and by posting i can tell you want to keep going ! you are strong.",
      "created_utc": 1596502962.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g0a82tq",
      "author": "FunkyBlueMohawkBird",
      "body": "Recovery is sometimes truly bummer city ..and everything in us screams to retreat to the shells of humans we were. Totally valid. There are some urges, thoughts and feelings that never fully disappear, but they become more like weak whispers and echoes than shouts eventually. It’s all about building a life aligned with your values and a future filled with all the things you deserve and that will feel meaningful and fulfilling to you. Those things will matter more to you than your eating disorder, but you’ll have to decide that and choose them over and over before it all feels natural and true. Every time I get the “healthier” comment, I rephrase it in my head. It’s a way for people to say, “hey I was really concerned about you and I care about you” in the only way they know how. They are probably relieved, and want you to feel validated— like they want you to know that they notice whether you seem well, as well as notice the hard work you’ve put into recovery. It wouldn’t be super normal to just flat out ignore somebody who has a life threatening illness when they seem to be in remission, right? That might help shift the perspective. I really appreciate how my therapist addresses slips and more solid recovery. When I’m doing well, she says, “hey, it’s really nice to see this side of you! You’re getting excited and smiling and feeling things and we’re talking about things that aren’t 100% focused on eating disorders!” It’s like I’ve returned from a vacation or something and she’s pumped to see me again! And when I’m struggling and totally numbed out, she’ll say, “There’s not much of you for me to connect with right now. I get worried when you’re blank like this. You’re using behaviors because you want people to express care and concern, but you’re not receptive to their love when you’re numb anyway.” \nIt makes me feel like \n1. My actual personality and spirit is dull or vacant when I’m in the disorder. This makes me less present, less able to touch the world, and harder to connect with/love. \nAnd\n2. She likes me. Especially when I’m vibrant and healthy, because otherwise I’m barely there with her anyway. She doesn’t give a shit about my clothes, she just wants the real me out and shining.\n\nI will say that relapse is filled with regret and conflicted shame too. Now that you know you’re capable of recovery (to any extent you’ve achieved), and aware of all the reasons eating disorders are dysfunctional, don’t work and actually cause huge harm to you and those around you... it won’t feel as satisfying to fall back into old patterns. I’ve been there, and it feels like failure and giving up. You know what’s down the eating disorder path— you’ve been there and done that. You can go back down it however many times you need to, but it will never change. It will also always be there lurking if you want it, so why not try something new and look around and see how life could be different before you throw in the towel. No need to commit to recovery for life, just for right now, just for today. You’re allowed to exist in a bigger body, to take up space, to adorn that body with respect and admiration and clothes you love. Your body lets you feel joy and bliss, frees you to adventure to mountaintops, gives you the opportunity to taste new ice cream flavors and kiss people sloppily and dance as goofy as you please and hug those you love tightly. Your toes can feel the warmth of sand, your arms can cradle your baby cousins, your eyes can make suggestive winks and crinkle up with laughter all day long. Your mind, nourished, can protest, imagine, pretend, think elaborately and extensively and reason with wit. It can calculate so many things that aren’t calories and carbs, especially when it’s not starved for them and playing the same obsessive, hungry loop all day. Your mind is capable of so much. \nThe root of the word shame means “to cover,” or “to shroud,” so it alludes to hiding and to fear. It makes sense that you are literally covering your body more because you don’t want to feel exposed and scrutinized. I’m rambling now, but I feel for you, dude",
      "created_utc": 1596506743.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g09rimc",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596497781.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0a72rk",
      "author": "Alexandria_Eiley",
      "body": "This is so so hard to deal with. Some people may not understand, and there’s not a lot you can do to change that. I suggest looking into DBT, CBT, RODBT, and ACT. Specifically self help worksheets if you can’t access a therapist. Remember what you went through, agonize the body you had, and try to come to acceptance. This may not be the body you wanted, but this the body that is healthy. This is the body that will allow you to do so many things. They don’t understand what you went through. Call them out if you need to, it’s helpful for everyone else with EDs! \nThere are so many worksheet activities, like making lists of thought distortions, and going back and making them dialectics. Making a pros and cons lists of the ED. Making a timeline of what would happen if you kept using behaviors. Making a dream board of all the things you can do now, that you couldn’t before, and the feelings you feel. You are strong, you’ve got this 💪🏼 now comes the mind work ♥️",
      "created_utc": 1596506203.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0acdf8",
      "author": "luckiestofthelucky",
      "body": "That's actually really great advice to go to new stores. Brands are so wildly different and this seems like a really great way to focus on recovery and what feels good rather than just numbers.",
      "created_utc": 1596509132.0,
      "score": 3,
      "context": [
        {
          "id": "g0a374x",
          "author": "kpoppin420",
          "body": "I relate to this so well. I have come across a few experiences that didn't bring up that shame that might help you. I find focusing on other parts of myself when I look in the mirror helps a lot. I will look at how beautiful other aspects of my human body are, not just the size of it. Also, if you can, save up some money and go buy some new favorite clothes. Put away the clothes that only fit you when you're harming your body. They're not worth it and there are tons of beautiful clothes out there that will help you regain the confidence in your body. I know for me I didnt want to go up a size. I felt so much shame in that. I feel like my way around that was instead of going back to the same stores and feeling the shame of buying the \"next size up\" I just started shopping at new stores. I found stores where I had never been so I got to try on multiple sizes at once to see what felt best. Most of all, try and remind yourself that numbers and letters don't define you! That's all weight and size is, letters and numbers. We are so much more than that. We deserves lives free of this shame, and together we can continue to share and find our ways through it. I promise you don't need to carry shame in healing your body, and if anyone does actively try and shame you, including yourself, they are dead wrong! Just keep focusing on your physical health, you'll get through this <3",
          "created_utc": 1596504111.0
        }
      ]
    }
  ]
}