{
  "id": "i3uq0v",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596585208.0,
  "title": "Request: My husband is convinced that I have an eating disorder..",
  "selftext": "My husband confronted me tonight saying that he's done some research and he's convinced that I have some level of eating disorder. I'm just wondering what other people have to say, this is why he thinks I have one.\n\nI am obsessed with how much I weigh, I have to weigh first thing every morning if not my mind obsesses on it until I do, if I gained any weight the day before, even an ounce I instantly hate myself for the rest of the day. Everyone tells me I'm of average weight but when I look at myself all I can think is that I look like a massive pig. Anytime I get hungry the thought of gaining weight is so overwhelming that the thought of eating makes me nauseous, to the point the smell of food will make me sick. Other times I just keep thinking no you're to fat to eat, or you'll never be pretty if you keep eating, or you don't deserve to eat.  I have medical condition that if I go to long without eating I'll have seizures, but I push myself as close to that line as possible, when I feel that I'm starting to get sick I'll force myself to eat but the whole time Im eating I can't stop telling myself that I'm fat, ugly and worthless for eating.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i3uq0v/request_my_husband_is_convinced_that_i_have_an/",
  "score": 60,
  "num_comments": 14,
  "comments": [
    {
      "id": "g0e6pe9",
      "author": "updown27",
      "body": "This is a very unhealthy, dangerous relationship with both food and your own body. You are purposely hurting yourself out of fear of gaining weight. Your fear of gaining weight is controlling your thoughts, behavior, and emotions. Only a medical doctor can diagnose you but this is definitely an eating disorder. Get an evaluation done at an eating disorder clinic and they can let you know for sure. And thank your husband for looking out for you. These things can sneak up on us and be hard to recognize when we’re in the midst of it.",
      "created_utc": 1596587018.0,
      "score": 49,
      "context": []
    },
    {
      "id": "g0eid4d",
      "author": "ginmonty",
      "body": "I’ve read a lot by the experts who say, “if you’re at a point where you’re questioning if you have an eating disorder, you deserve help.”",
      "created_utc": 1596593989.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g0eqlfj",
      "author": "scubachip7",
      "body": "Yes, it is very, very obvious you have an eating disorder. You repeatedly said it’s something you obsess over and that you hate yourself if you gain even an ounce of weight. You even admitted that you’re willing to potentially give yourself seizures just to be able to starve yourself. You have to be honest with yourself. You cannot honestly believe that you don’t have an eating disorder. You do and it’s *severe*. You need to get professional help immediately. You are headed down a *very* dangerous road. Please, get the help you need. You deserve better. I wish you all the luck in the world.\n\nEdit: spelling mistake",
      "created_utc": 1596599075.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g0e90l9",
      "author": "anonchicago7",
      "body": "Your description of your mental state seems to have many of the qualities used in eating disorder diagnoses. Find a therapist/psychologist with ed experience and make an appointment. Explain your thoughts/feelings see what a professional thinks.",
      "created_utc": 1596588376.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g0etdim",
      "author": "Ellabee22",
      "body": "I'm gonna preface this by saying I'm by no means a psychologist, but I have struggled with an ED for about 5 years and am currently in remission.\n\nI'm so sorry you're dealing with these horrid thoughts, it's gotta be really hard right now. EDs are shrouded in secrecy, and you're not even supposed to know you have one (cos then you'd be trying to get out of it to some extent). And body dysmorphia is no fun either. They creep up on you, and take lots and lots of strength to get out of, especially since your brain is trying to convince you you shouldn't heal. But I promise you, it's possible. And the fact that you have a medical condition that gives you seizures if you don't eat means you should probably try to get out of it sooner than later. \n\nSome things that really really helped me in my recovery are as follows:\n\n\\- I stopped weighing myself. At first it sounded literally impossible, because my thoughts were so caught up in the numbers, but a day-to-day weigh-in isn't at all reflective of your actual weight. You could've drunk more water one day, or eaten different foods, but you'll still just see the number and think you're not worthy, or get really excited and stay in the cycle. I strongly recommend actively trying to lower the number of times you step on the scale, or giving it to your husband so you don't feel the urge to step on it when you see it.\n\n\\- I opened up to people. A couple of my close friends were going through the same thing, but even when I spoke with people who weren't experiencing what I was, I felt lighter and more loved than ever. Your ED might tell you that people don't care, but they really, really do. And opening up about it will literally feel like a weight is being lifted off your shoulders. \n\n\\- I stopped counting. If you are, you should really really reaalllyyy try to stop. Delete that calorie-counting weight loss app. It's for clinically obese people. You are not clinically obese. You do not need to log every single thing you put in your body! It's hard to stop, but maybe try one day a week where you don't count, and move from there. Baby steps.\n\n\\- Another thing that really really helped me was to eat with people who didn't worry about food. This may just completely be personal to me, but seeing how nonchalant people were about something that I spent every minute of my day obsessing over really made me more comfortable eating. It had to be with people I really really trusted though, and that was not a lot.\n\n\\- There are a few other tricks you can try, like writing one thing down a day that you like about yourself (it doesn't have to be about your body, but can start off with something like \"my handwriting is pretty\" and go from there)\n\n\\- I unfollowed LOTS of people on social media. So many Instagram models have unattainable, highly photoshopped bodies, so I just stopped exposing myself to that. If you do follow any unrealistic-bodied models or people who are very obviously dangerously thin, unfollow them! Follow self-care pages and recovery pages instead. What you expose yourself to heavilyyy influences your mental health! \n\nYour eating disorder is lying to you. You are not fat, or ugly, or worthless. You do not need to reach a certain weight to be worthy of healing. You deserve to enjoy the taste of things again, to eat without fear, and most of all to treat your body with love! It's fighting every day to survive, and it loves YOU so much!!! \n\nSending all my love and strength out to you. You will get through this <3",
      "created_utc": 1596600955.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g0emba1",
      "author": "rosieco",
      "body": "I mean, read back what you wrote about yourself and your relationship to food&weight. Does it sound typical to you of what an average person may feel?\n\nI think you can answer your own question. I won’t diagnose you, but it sounds like you present a few characteristics of someone with disordered eating habits and an unhealthy view of their body. Now is the next important question; are you interested in getting help to work through it, or do you think you can help yourself?",
      "created_utc": 1596596383.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g0eyhxf",
      "author": "gremsie",
      "body": "No criticism, just curious: what makes you unsure or that you don’t have an ED? Like don’t quite  know the definition of one?",
      "created_utc": 1596604817.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0ez8ts",
      "author": "zonkschonk",
      "body": "I was convinced I was just being dramatic when my parents made me see a doctor-now I have weekly therapy and nutritionist appointments and was almost hospitalized for an anorexia-induced heart condition. See a doctor as soon as possible. Your life might just depend on it.",
      "created_utc": 1596605424.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g0e3jjd",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596585209.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0f5rth",
      "author": "jannellopez",
      "body": "I used to do this 4 years ago and honestly life is so much better when you’re not worrying about your weight. I lost 30 pounds but felt unhappy and it was getting unhealthy. Please enjoy life without caring about your weight. Eat healthy, exercise in moderation. Everything in moderation is fine. You do sound like you have ednos but you still have time to seek help and get better I know it’s hard but trust me you don’t want to go down that road",
      "created_utc": 1596611318.0,
      "score": 0,
      "context": []
    },
    {
      "id": "g0ezfav",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1596605569.0,
      "score": -3,
      "context": []
    },
    {
      "id": "g0e7ps1",
      "author": "yellowposy2",
      "body": "This, definitely this. OP, when I went to an ED clinic, I genuinely thought the most they would ask me to do would be biweekly appointments with a therapist. Instead, they recommended a full day treatment program (like 35 hours a week). It’s crazy how insidious these disorders can be, but it’s so good that you have support to get help. Make an appointment. You deserve to be healthy and love yourself.",
      "created_utc": 1596587608.0,
      "score": 11,
      "context": [
        {
          "id": "g0e6pe9",
          "author": "updown27",
          "body": "This is a very unhealthy, dangerous relationship with both food and your own body. You are purposely hurting yourself out of fear of gaining weight. Your fear of gaining weight is controlling your thoughts, behavior, and emotions. Only a medical doctor can diagnose you but this is definitely an eating disorder. Get an evaluation done at an eating disorder clinic and they can let you know for sure. And thank your husband for looking out for you. These things can sneak up on us and be hard to recognize when we’re in the midst of it.",
          "created_utc": 1596587018.0
        }
      ]
    },
    {
      "id": "g0fgny9",
      "author": "houston_veronica",
      "body": "beautifully stated!!",
      "created_utc": 1596622613.0,
      "score": 3,
      "context": [
        {
          "id": "g0etdim",
          "author": "Ellabee22",
          "body": "I'm gonna preface this by saying I'm by no means a psychologist, but I have struggled with an ED for about 5 years and am currently in remission.\n\nI'm so sorry you're dealing with these horrid thoughts, it's gotta be really hard right now. EDs are shrouded in secrecy, and you're not even supposed to know you have one (cos then you'd be trying to get out of it to some extent). And body dysmorphia is no fun either. They creep up on you, and take lots and lots of strength to get out of, especially since your brain is trying to convince you you shouldn't heal. But I promise you, it's possible. And the fact that you have a medical condition that gives you seizures if you don't eat means you should probably try to get out of it sooner than later. \n\nSome things that really really helped me in my recovery are as follows:\n\n\\- I stopped weighing myself. At first it sounded literally impossible, because my thoughts were so caught up in the numbers, but a day-to-day weigh-in isn't at all reflective of your actual weight. You could've drunk more water one day, or eaten different foods, but you'll still just see the number and think you're not worthy, or get really excited and stay in the cycle. I strongly recommend actively trying to lower the number of times you step on the scale, or giving it to your husband so you don't feel the urge to step on it when you see it.\n\n\\- I opened up to people. A couple of my close friends were going through the same thing, but even when I spoke with people who weren't experiencing what I was, I felt lighter and more loved than ever. Your ED might tell you that people don't care, but they really, really do. And opening up about it will literally feel like a weight is being lifted off your shoulders. \n\n\\- I stopped counting. If you are, you should really really reaalllyyy try to stop. Delete that calorie-counting weight loss app. It's for clinically obese people. You are not clinically obese. You do not need to log every single thing you put in your body! It's hard to stop, but maybe try one day a week where you don't count, and move from there. Baby steps.\n\n\\- Another thing that really really helped me was to eat with people who didn't worry about food. This may just completely be personal to me, but seeing how nonchalant people were about something that I spent every minute of my day obsessing over really made me more comfortable eating. It had to be with people I really really trusted though, and that was not a lot.\n\n\\- There are a few other tricks you can try, like writing one thing down a day that you like about yourself (it doesn't have to be about your body, but can start off with something like \"my handwriting is pretty\" and go from there)\n\n\\- I unfollowed LOTS of people on social media. So many Instagram models have unattainable, highly photoshopped bodies, so I just stopped exposing myself to that. If you do follow any unrealistic-bodied models or people who are very obviously dangerously thin, unfollow them! Follow self-care pages and recovery pages instead. What you expose yourself to heavilyyy influences your mental health! \n\nYour eating disorder is lying to you. You are not fat, or ugly, or worthless. You do not need to reach a certain weight to be worthy of healing. You deserve to enjoy the taste of things again, to eat without fear, and most of all to treat your body with love! It's fighting every day to survive, and it loves YOU so much!!! \n\nSending all my love and strength out to you. You will get through this <3",
          "created_utc": 1596600955.0
        }
      ]
    },
    {
      "id": "g0f69ep",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1596611796.0,
      "score": 1,
      "context": [
        {
          "id": "g0ezfav",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1596605569.0
        }
      ]
    },
    {
      "id": "g0e8ypf",
      "author": "updown27",
      "body": "Same! I was embarrassed because I was sure they would tell me I didn’t have an eating disorder at all and to go home but they said, “the only thing we can do is immediately admit you to in-patient care”. I went but even then it took me years to fully accept my diagnosis.",
      "created_utc": 1596588345.0,
      "score": 10,
      "context": [
        {
          "id": "g0e6pe9",
          "author": "updown27",
          "body": "This is a very unhealthy, dangerous relationship with both food and your own body. You are purposely hurting yourself out of fear of gaining weight. Your fear of gaining weight is controlling your thoughts, behavior, and emotions. Only a medical doctor can diagnose you but this is definitely an eating disorder. Get an evaluation done at an eating disorder clinic and they can let you know for sure. And thank your husband for looking out for you. These things can sneak up on us and be hard to recognize when we’re in the midst of it.",
          "created_utc": 1596587018.0
        },
        {
          "id": "g0e7ps1",
          "author": "yellowposy2",
          "body": "This, definitely this. OP, when I went to an ED clinic, I genuinely thought the most they would ask me to do would be biweekly appointments with a therapist. Instead, they recommended a full day treatment program (like 35 hours a week). It’s crazy how insidious these disorders can be, but it’s so good that you have support to get help. Make an appointment. You deserve to be healthy and love yourself.",
          "created_utc": 1596587608.0
        }
      ]
    },
    {
      "id": "g0fbqwl",
      "author": "tymopa",
      "body": "Yep...BMI is a) not validated any longer by experts; and b) a trigger.",
      "created_utc": 1596617409.0,
      "score": 5,
      "context": [
        {
          "id": "g0ezfav",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1596605569.0
        },
        {
          "id": "g0f69ep",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1596611796.0
        }
      ]
    }
  ]
}