{
  "id": "i42zfa",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596623914.0,
  "title": "Request: My friend has anorexia, will the following idea help or worsen her condition?",
  "selftext": "My friend has anorexia and avoids eating and eating in front of people. I thought maybe it would be nice to offer her to eat together sometime, on the sole condition that she eats how much she wants and nothing more. If that means she won't even eat a grape for the first 26 times we eat together, that's completely fine. I'm okay with it. It's a process. But I hope that seeing me eat and being positive and understanding about her eating habits will teach her to eat with others and to eat something in general.\nBut I don't have an ED and I have no clue how they work, so if this seems like a bad idea, then I won't do it. I would NEVER force her to eat, end of story. But I guess I wanted to ask the sub if the people here would like it if a friend reached out to them pitching this plan.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i42zfa/request_my_friend_has_anorexia_will_the_following/",
  "score": 89,
  "num_comments": 23,
  "comments": [
    {
      "id": "g0fl86m",
      "author": "justblippingby",
      "body": "I think you being there for her like that is a truly incredible sacrifice on your part. Coming from someone with an ED who’s working on recovery, having someone there eating with me and showing me that it’s okay would’ve helped me to rationalize what food is and what it means. I would stay away from trying to make it about her anorexia though, that might end up pushing her thoughts in the opposite direction if it comes off as “so-and-so and I are doing this together just to get me better” and it’d be a chore rather than a friend being there to support her. Give it a shot, but just try to be really relaxed and chill about it. Also try to not catch her off guard because she might close you off from her problems if her defensive mindset takes over. Good luck with your friend, I hope my advice made sense and let me know if you want me to expand on anything",
      "created_utc": 1596626729.0,
      "score": 59,
      "context": []
    },
    {
      "id": "g0flutl",
      "author": "wh0fuckingcares",
      "body": "Best bet is to ask her if it helps. She might not even know for sure and might wanna try it. I know it wouldn't help me. Being around others eating puts me off.",
      "created_utc": 1596627162.0,
      "score": 22,
      "context": []
    },
    {
      "id": "g0gb5ls",
      "author": "bourbonandblonde",
      "body": "When I had eating disorders, eating in public was one of my biggest fears. I still have difficulty with it, just not as much as I used to. The only thing that helped me get better about that particular hang-up was having friends like you, who went out of their way to schedule lunches and stuff together, starting just in our homes, then moving up to cafes and restaurants. Your offer is really sweet and supportive.",
      "created_utc": 1596640551.0,
      "score": 13,
      "context": []
    },
    {
      "id": "g0hau1n",
      "author": "ganzeinfachkiki",
      "body": "I think I get where you are coming from. This probably would be a great idea but I guess you need to change it a bit. Like some people already said, to make it about anorexia itself would probably do the opposite. To bring her in an environment (like a restraunt or fast food place) where the norm is to eat it could even hurt a lot. At least for me. But I guess if you guys are just being you normal friends doing your normal friends stuff it would be easier if you by youself just see that if you are hungry or feel snackish you just grab a hot dog on the street or have some gummi bears. When my friends did this I realized that being me wasnt right. To never be hungry when you hang out all day. That everybody would understand if I say \"Hey I could have a smoothie.\" The one thing triggering me tho is when I actually say that I want to eat something on the go and my friends say they dont want to. I feel fat then. Like I eat too much. I loved it tho when anyone else had this confidence. Also eating on the go may not be the healthiest way of eating but this showed me that nobody cared. I still have the feeling that everyone is watching me eat but its just not true and I see that when I see my friends eat in the park on a bench or wherever. Just dont say that its about her anorexia. This could stress her.\n\n\nAt the end are those just my personal thoughts and expiriences. If someone else would like to add something, thats welcome.",
      "created_utc": 1596656868.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g0gep62",
      "author": "sadminecraftgirl",
      "body": "idk how it is for other people but when someone knows abt my ed it makes me less likely to eat around them but my cousin who knows sometimes she like just offers me a few diff options and sometimes i might accept but i never ever ask for food i only take it if its offered so maybe try offering her stuff?? tho idk if that could possibly have a reverse effect on her bc everyones different",
      "created_utc": 1596642061.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g0gmebo",
      "author": "ostrich_in_distress",
      "body": "I think this could be a really good idea depending on where she is in her recovery. If you two are really close friends, which I’m presuming you are, it will be a lot easier because she might feel more comfortable with you.\n\nThe first thing you need to do is ask her first, but try not to make it about her eating disorder as much as possible (we’re already thinking about our eating disorder behaviors all the time and having it brought up by a friend can be worse). Say something like “There’s a few restaurants I wanted to go to. Would you want to come with me? If you don’t it’s ok too.” That way she won’t feel like she’s being controlled and will feel like it’s her decision.\n\nIf she says yes it might be a good idea to suggest a few options of where or what to eat and have her pick from those (if she feels comfortable with that).\n\nWhen ordering or getting food it’s important to not make any comments about the food, like “This tastes delicious” or “I’m full”. It also might be helpful to order/make something for yourself that might be more of a challenge food for someone with an Eating Disorder (ex: order a burger instead of a salad). That way it might make her more comfortable in ordering something, knowing that you’re comfortable ordering something bigger. Also make sure that you clear your plate or eat most of your food. It can be triggering to see that the person you’re with only ate a couple of bites (We are CONSTANTLY comparing). \n\nI hope you found some of these tips helpful and just try to not beat yourself up about it if she isn’t comfortable with eating with you quite yet. The road to recovery is a long one.",
      "created_utc": 1596645602.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0gn3ja",
      "author": "longnecklytle",
      "body": "i wanna cry at how kind this idea is. your support for your friend is really admirable. i'd say talk to her about it, maybe don't make it 100% about her ED like other people are saying. i think that, even if this particular idea isn't the right one, an idea that does work would come up in that conversation. i've been on both sides of this, and even if your first suggestion isn't perfect, she will appreciate your support and will hopefully tell you what she does need. good luck to you and you friend, wishing you both the best!",
      "created_utc": 1596645933.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0fpttj",
      "author": "wsc1983",
      "body": "I am recovering from anorexia, and at it's worst, I was definitely uncomfortable eating with people, mostly because I was pressured into eating things I normally would never eat.  For instance, I eat a vegeratian diet whenver I can, but if I'm out with friends or coworkers then I have to eat meat just to appease them, which is quite uncomfortable even without an eating disorder.\n\nI have a friend that I ate lunch with during the work week before I figured out I had anorexia and he would occasionally comment on my eating habits but wouldn't pressure me to eat more, and that was always the best part of my day, despite having to eat.  I enjoy the socializing, especially as I'm extremely lonely and anorexia just makes you isolate yourself further.\n\nI'd say as long as you keep in mind that anorexia is not really about food but moreso feeling disconnected and not being in control of one's life then go for it.  She probably needs to be reminded that someone cares about her apart from what she does or does not eat.",
      "created_utc": 1596629816.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g0fpu7y",
      "author": "lfanning25",
      "body": "Ask what type of support you can provide. She may not be ready to eat with you but may be ready to talk more openly about her ED.",
      "created_utc": 1596629823.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0gub0b",
      "author": "None",
      "body": "My friends did this. It was agonising for us all since it could take up to two hours for me to eat some pizza or a curry. At first they had to visibly wave their food in my face before I'd even think about eating anything.  They were super patient, taking me out for a cake once and sitting for over an hour whilst I cried over it; holding me when I broke down over a flapjack; hosting regular pasta nights. \n\nYour friend needs to be totally on board with this and you do too. It's not going to be fun for either of you at points - there might be yelling, crying, awful things said to each other, and you need to know when it's enough for you. It's tough. It's pure shite.\n\nI was so fortunate to have friends to deal with me in this way who are still my friends.",
      "created_utc": 1596649202.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0heltn",
      "author": "HubbyHasBlueBalls",
      "body": "Honestly, just ask her in what ways would it be helpful to support her and if she wants support surrounding her disorder.  Let her know that if she ever reaches a place of needing meal support, you don't mind providing it, or it can be just a listening ear or trying to understand more. If she gets into treatment, you might end up the person she goes to where nothing about ed/ food/ treatment/ etc gets mentioned or brought up.  Recovery and treatment are exhausting and consuming, sometimes the exact opposite--where you can focus on regular life stuff for an hour is very helpful too",
      "created_utc": 1596658516.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0hmb6p",
      "author": "AbundantiaTheWitch",
      "body": "I think it’s Easier to eat with a distraction. Don’t make it about the ED at all just have a conversation. Sitting a thinking will make it worse",
      "created_utc": 1596662090.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0gfhcv",
      "author": "violetgay",
      "body": "My friend and I both have battled with eating disorders. Neither of us like eating in front of other people and last week we had dinner together. We talked about it during and she said, \"it means a lot we can do this together.\" So I think it is a really great thing to offer to do. Eating disorders are very socially isolating because eating for humans is traditionally a social activity. Feeling included and not judged is very nice. If she doesn't want to that is okay, just letting her know the offer stands will mean a lot, I think.",
      "created_utc": 1596642401.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0i38yk",
      "author": "spatulajean",
      "body": "For me, one of the hardest parts of recovery initially was asking for help, which often was just having a friend eat with me. Having someone offer that without asking and without judgement would have helped me so much back then (and honestly, even now). Every person is different, but we all need support, and you offering that to her would likely be really helpful.",
      "created_utc": 1596670613.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0ihaly",
      "author": "lunaelliott4",
      "body": "Thats such a sweet gesture for you to want to do maybe that could slowly help normalize \"mealtime\" again for her and eventually she may feel more comfortable and eat something with you but to clarify only if theyre ready if they truly aren't ready no gesture will be able to shake them",
      "created_utc": 1596678178.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0fhycx",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596623914.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0fnv8q",
      "author": "Sannatee",
      "body": "I get you! I've thought about not making it about the disorder. I'll only talk about other things and I won't ask about her food unless she brings it up. I wanna show her that it's okay to eat and if I talk about it like it's a whole achievement I feel like it will be like a chore like you said. So we'll just have fun but with food there.",
      "created_utc": 1596628521.0,
      "score": 9,
      "context": [
        {
          "id": "g0fl86m",
          "author": "justblippingby",
          "body": "I think you being there for her like that is a truly incredible sacrifice on your part. Coming from someone with an ED who’s working on recovery, having someone there eating with me and showing me that it’s okay would’ve helped me to rationalize what food is and what it means. I would stay away from trying to make it about her anorexia though, that might end up pushing her thoughts in the opposite direction if it comes off as “so-and-so and I are doing this together just to get me better” and it’d be a chore rather than a friend being there to support her. Give it a shot, but just try to be really relaxed and chill about it. Also try to not catch her off guard because she might close you off from her problems if her defensive mindset takes over. Good luck with your friend, I hope my advice made sense and let me know if you want me to expand on anything",
          "created_utc": 1596626729.0
        }
      ]
    },
    {
      "id": "g0htuqk",
      "author": "He_who_humps",
      "body": "This is very correct. Each person is unique.",
      "created_utc": 1596665782.0,
      "score": 3,
      "context": [
        {
          "id": "g0flutl",
          "author": "wh0fuckingcares",
          "body": "Best bet is to ask her if it helps. She might not even know for sure and might wanna try it. I know it wouldn't help me. Being around others eating puts me off.",
          "created_utc": 1596627162.0
        }
      ]
    },
    {
      "id": "g0hfjjk",
      "author": "Sannatee",
      "body": "I get you! Thanks for the input. So maybe the best idea is asking if she wants to and if she says yes just making it a hangout and also eating instead of focusing on the food aspect?",
      "created_utc": 1596658918.0,
      "score": 1,
      "context": [
        {
          "id": "g0hau1n",
          "author": "ganzeinfachkiki",
          "body": "I think I get where you are coming from. This probably would be a great idea but I guess you need to change it a bit. Like some people already said, to make it about anorexia itself would probably do the opposite. To bring her in an environment (like a restraunt or fast food place) where the norm is to eat it could even hurt a lot. At least for me. But I guess if you guys are just being you normal friends doing your normal friends stuff it would be easier if you by youself just see that if you are hungry or feel snackish you just grab a hot dog on the street or have some gummi bears. When my friends did this I realized that being me wasnt right. To never be hungry when you hang out all day. That everybody would understand if I say \"Hey I could have a smoothie.\" The one thing triggering me tho is when I actually say that I want to eat something on the go and my friends say they dont want to. I feel fat then. Like I eat too much. I loved it tho when anyone else had this confidence. Also eating on the go may not be the healthiest way of eating but this showed me that nobody cared. I still have the feeling that everyone is watching me eat but its just not true and I see that when I see my friends eat in the park on a bench or wherever. Just dont say that its about her anorexia. This could stress her.\n\n\nAt the end are those just my personal thoughts and expiriences. If someone else would like to add something, thats welcome.",
          "created_utc": 1596656868.0
        }
      ]
    },
    {
      "id": "g0fqvtc",
      "author": "Sannatee",
      "body": "Thanks! I'll make sure to support and care for her apart from the food.",
      "created_utc": 1596630468.0,
      "score": 1,
      "context": [
        {
          "id": "g0fpttj",
          "author": "wsc1983",
          "body": "I am recovering from anorexia, and at it's worst, I was definitely uncomfortable eating with people, mostly because I was pressured into eating things I normally would never eat.  For instance, I eat a vegeratian diet whenver I can, but if I'm out with friends or coworkers then I have to eat meat just to appease them, which is quite uncomfortable even without an eating disorder.\n\nI have a friend that I ate lunch with during the work week before I figured out I had anorexia and he would occasionally comment on my eating habits but wouldn't pressure me to eat more, and that was always the best part of my day, despite having to eat.  I enjoy the socializing, especially as I'm extremely lonely and anorexia just makes you isolate yourself further.\n\nI'd say as long as you keep in mind that anorexia is not really about food but moreso feeling disconnected and not being in control of one's life then go for it.  She probably needs to be reminded that someone cares about her apart from what she does or does not eat.",
          "created_utc": 1596629816.0
        }
      ]
    },
    {
      "id": "g0je38l",
      "author": "justblippingby",
      "body": "I’m glad to hear you’ve already thought about your approach so carefully! I’d say you’re good to go and I think you have a pretty good chance of connecting with her from what I’ve seen in the other comments. I wish you the best of luck",
      "created_utc": 1596701479.0,
      "score": 2,
      "context": [
        {
          "id": "g0fl86m",
          "author": "justblippingby",
          "body": "I think you being there for her like that is a truly incredible sacrifice on your part. Coming from someone with an ED who’s working on recovery, having someone there eating with me and showing me that it’s okay would’ve helped me to rationalize what food is and what it means. I would stay away from trying to make it about her anorexia though, that might end up pushing her thoughts in the opposite direction if it comes off as “so-and-so and I are doing this together just to get me better” and it’d be a chore rather than a friend being there to support her. Give it a shot, but just try to be really relaxed and chill about it. Also try to not catch her off guard because she might close you off from her problems if her defensive mindset takes over. Good luck with your friend, I hope my advice made sense and let me know if you want me to expand on anything",
          "created_utc": 1596626729.0
        },
        {
          "id": "g0fnv8q",
          "author": "Sannatee",
          "body": "I get you! I've thought about not making it about the disorder. I'll only talk about other things and I won't ask about her food unless she brings it up. I wanna show her that it's okay to eat and if I talk about it like it's a whole achievement I feel like it will be like a chore like you said. So we'll just have fun but with food there.",
          "created_utc": 1596628521.0
        }
      ]
    },
    {
      "id": "g0gm2sw",
      "author": "scubachip7",
      "body": "Is she currently in treatment for her ED or seeing a psychiatrist/therapist?",
      "created_utc": 1596645453.0,
      "score": 1,
      "context": [
        {
          "id": "g0fl86m",
          "author": "justblippingby",
          "body": "I think you being there for her like that is a truly incredible sacrifice on your part. Coming from someone with an ED who’s working on recovery, having someone there eating with me and showing me that it’s okay would’ve helped me to rationalize what food is and what it means. I would stay away from trying to make it about her anorexia though, that might end up pushing her thoughts in the opposite direction if it comes off as “so-and-so and I are doing this together just to get me better” and it’d be a chore rather than a friend being there to support her. Give it a shot, but just try to be really relaxed and chill about it. Also try to not catch her off guard because she might close you off from her problems if her defensive mindset takes over. Good luck with your friend, I hope my advice made sense and let me know if you want me to expand on anything",
          "created_utc": 1596626729.0
        },
        {
          "id": "g0fnv8q",
          "author": "Sannatee",
          "body": "I get you! I've thought about not making it about the disorder. I'll only talk about other things and I won't ask about her food unless she brings it up. I wanna show her that it's okay to eat and if I talk about it like it's a whole achievement I feel like it will be like a chore like you said. So we'll just have fun but with food there.",
          "created_utc": 1596628521.0
        }
      ]
    },
    {
      "id": "g0gq2tm",
      "author": "Sannatee",
      "body": "She's seeing a therapist, but for her anxiety. She recently got the anorexia diagnosis there too, so she hasn't gotten treatment but she has told me she wants to get better and wants the treatment/help. Hope that makes sense lol",
      "created_utc": 1596647280.0,
      "score": 1,
      "context": [
        {
          "id": "g0fl86m",
          "author": "justblippingby",
          "body": "I think you being there for her like that is a truly incredible sacrifice on your part. Coming from someone with an ED who’s working on recovery, having someone there eating with me and showing me that it’s okay would’ve helped me to rationalize what food is and what it means. I would stay away from trying to make it about her anorexia though, that might end up pushing her thoughts in the opposite direction if it comes off as “so-and-so and I are doing this together just to get me better” and it’d be a chore rather than a friend being there to support her. Give it a shot, but just try to be really relaxed and chill about it. Also try to not catch her off guard because she might close you off from her problems if her defensive mindset takes over. Good luck with your friend, I hope my advice made sense and let me know if you want me to expand on anything",
          "created_utc": 1596626729.0
        },
        {
          "id": "g0fnv8q",
          "author": "Sannatee",
          "body": "I get you! I've thought about not making it about the disorder. I'll only talk about other things and I won't ask about her food unless she brings it up. I wanna show her that it's okay to eat and if I talk about it like it's a whole achievement I feel like it will be like a chore like you said. So we'll just have fun but with food there.",
          "created_utc": 1596628521.0
        },
        {
          "id": "g0gm2sw",
          "author": "scubachip7",
          "body": "Is she currently in treatment for her ED or seeing a psychiatrist/therapist?",
          "created_utc": 1596645453.0
        }
      ]
    }
  ]
}