{
  "id": "i5asp4",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596792753.0,
  "title": "Request: I went to the doctors and they want me to come back........",
  "selftext": "Thursday I went to the doctors it was the normal routine go in get your height and weight and go wait for the doctor to examine you. Me and my dad are waiting in the room and the doctor arrives and the first thing she said was “it seems you’ve lost quite a bit of weight were you trying to do that?” I responding with “yes” I was actually trying to lose some weight since I was overweight and now I’m classified as a healthy weight. There were some papers there for me personally to fill out while she asked me about my calories intake which I told her and she told me it was too low and asked me how I was feeling but I felt fine she dropped it after that. The papers asked me if I had tried starving myself or bingeing, purging, any type of disordered eating I looked at the yes checkbox and decided to skip the question and come back to it but after she asked me those questions about my weight and calorie intake I quickly went backed it checked the no box.... a few more questions later it asked me how often I thought about weight loss and had anxiety about food I checked the several days a week box, I gotta be kinda honest right? Then a nurse came in took my blood and I got some shots and I left. Later that day the doctors called back and I guess they told my parents that I had lost thirty pounds in a year and my blood sugar and vitamin  D was very low im a 16 year old girl that isn’t normal... and they wanted to see me again on Tuesday. That night I deleted myfitnesspal and decided to stop counting my calories and just eat what I wanted, and the the 3 meals now recommended by my doctor... I never ate breakfast but the next day I did and it honestly wasn’t bad except I had to wake up early to fit it into my day which was new since I usually woke up at 12:00 in the afternoon everyday, that day I didn’t track anything and I felt okay it kinda displeased me that I couldn’t count but I also wanted to be healthy I still hadn’t reached my “goal weight” but the doctors visit scared me and I’m pretty sure my parents are starting to think I have an eating disorder and maybe I do too.... I just don’t have the common symptoms I don’t ever starve myself as long as it’s in my calorie budget I’ll eat whether it be cookies or chips of course there are foods that I avoid like fast food but I feel like everyone who’s trying to watch there figure does that right? I don’t binge because it scares me to eat that many calories that’s not normal is it? I get a bit repulsed when I walk past foods in the store I deem unhealthy.... I’ve purged maybe twice and after the second time I know I won’t do it again because it just didn’t feel good doing that too myself. But today was the second day of me not tracking and all I could think was “don’t weigh this food out”, “don’t step on the scale”,  “eat this it’ll be good for you”, “I don’t want too it’ll make gain weight..but you have too, they’ll think something is wrong if you don’t”, “how many calories do you think you ate?”....I feel sick right now because I’m scared that I’ll gain weight back I planned on slowly adding back calories to my diet after I lost a few more pounds but since I decided to stop counting since it put in a bad place I don’t know what to do.... I don’t want them to diagnose with an ED I don’t think I have one I just think I have some bad habits that I can work on by myself I don’t want my family to be upset with me I know they’ll try to blame themselves he’ll they tried to force feed me a smoothie yesterday and make it seem like they weren’t. I’m just so confused I plan on asking my dad to let me go in alone at the doctors on Tuesday though so I can be honest because maybe I do need help and I’m just too sick to see it.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i5asp4/request_i_went_to_the_doctors_and_they_want_me_to/",
  "score": 52,
  "num_comments": 7,
  "comments": [
    {
      "id": "g0o721n",
      "author": "Novice-Pirate",
      "body": "Going alone might help if your parents being around is what’s making you nervous! Sometimes when you are nervous about gaining weight but you aren’t starving yourself, you have “disordered eating” which is like not a formal ED but means you have an eating disorder, from what i understand. being honest with ur doctor is definitely #1 priority, even if it makes you feel nervous/guilty/doing something wrong. it’s brave to just go in!!!",
      "created_utc": 1596804208.0,
      "score": 18,
      "context": []
    },
    {
      "id": "g0o8jh9",
      "author": "updown27",
      "body": "You should definitely ask for alone time with your doctor, even if it’s just for part of the exam. Write down everything you want to talk about so you don’t forget it at the doctors office. That way you can find out if your goals and habits are healthy. Trust your doctor. Everything is going to be ok. It sounds like you are dedicated to taking good care of yourself. I’ll be thinking of you 🤞",
      "created_utc": 1596804898.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g0qd3zu",
      "author": "jenny_mac_",
      "body": "My fitness pal and counting calories in general can be really troubling psychologically. Those “calorie budgets” and goal weight timelines, etc disconnect you from trusting your body and it’s needs. No app or meal plan program can tell you what your body truly needs. Only your body can. They also reprogram your brain to obsess over numbers and rely on the app for security. I’ve been there, too and I have been free of counting calories, steps, macros, etc for 3+ years now and feel great about my body and food. So you can get to a better place! it takes some work but is 10000000% worthwhile. \nI would suggest looking into health at every size and intuitive eating, just google them and look for podcasts and books. Also, the work of Christy Harrison, Isabel foxen duke, and Anita Johnson. \nId suggest asking your doctor for help around the fear of gaining weight because that seems like the root cause here. We live in a manipulated culture that makes women fear gaining weight so we buy products to feel good about ourselves. Waking up to this lie and the evil of corporations while accepting that bodies come in all shapes and sizes, and larger bodies can still be healthy, is KEY! \nPerhaps you can see an ED therapist who can help you unpack the reason why you have those fears and to support you to trust your body to find it’s true healthy weight, and to accept and love it no matter what it looks like. \n\nFeel free to DM me if you want more support. \nSending hugs. I know it’s hard but you’re strong, self aware, and on the right path ❤️",
      "created_utc": 1596840537.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g0nqcbr",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596792753.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0ptpyq",
      "author": "whatsernamebree",
      "body": "Alone time with the doctor for sure. You can see what’s going on already, get the help now while you have the chance to change your bad habits.",
      "created_utc": 1596830922.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0ree19",
      "author": "chillychinchillada",
      "body": "Not necessarily what you were asking but low vitamin D is very common and among overweight people as well. Especially if you live in colder climate or don’t go out in the sun.",
      "created_utc": 1596862398.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0qebqv",
      "author": "jenny_mac_",
      "body": ">Copying another post I wrote to another Redditor that I thought would be helpful:  \n>  \n>First off, be proud of yourself for reaching out and being able to talk about your struggles. Both are HUGE steps toward recovery so congrats on this first big step!  \n>  \n>Second, are you seeing a therapist and nutritionist? . If you've been engaging in disordered eating for a long time, it can be a process to recover your metabolism, which I think you should have professional help with. I’d highly recommend seeking help from a nutritionist and ED-specializing therapist who practice the health at every size (HAES) and intuitive eating approach. You can search for providers on the HAES website or search your town, the type of provider, and intuitive eating or health at every size in google. I'd look into HAES and intuitive eating yourself to see what they're about.  These two theories have been MONUMENTAL in my recovery and finally feeling SANE and normal around food/eating.  \n>  \n>Third, working with a therapist to uncover the deeper root causes of your struggles. Many modern treatment centers often overlook this step and only treat the eating issues, not the mental/emotional patterns, trauma, etc. that is causing the disordered eating. Think of disordered eating as the symptom caused by some unaddressed internal issues (i.e anxiety/stress, depression, perfectionism, etc.). The mental/emotional struggles may seem to have no cause, but by working with a therapist, you may uncover parts of your past that may have influenced you. It helps a lot to sit and work through suppressed emotions, memories, and so on, and can really help clarify and make sense of what you've gone through and what you're going though. Therapists can help you develop self reflection practices, healthy coping mechanisms, self care routines, and more, so you don't rely on the disordered eating to manage stress/life. (I used disordered eating and compulsive overexercising to manage stress during college/life transitions, and have learned that I need to prioritize self care (journaling, joyful movement, fun, etc in order to feel mentally balanced.)  \n>  \n>Fourth, I highly recommend JOURNALING! Journal your thoughts, feelings, emotions, etc. Practice self compassion, let yourself cry if you need to, and most of all FORGIVE yourself. We are not perfect and we are always learning. Forgiveness is huge. Explore creativity, explore expression through dance, song, colors, cooking, whatever calls to you!  \n>  \n>Fifth: Regarding body image: It's virtually impossible to live in western society without  some form of body image struggles. Working on body image and reversing fat-phobia are KEY in recovery. Here's something I wrote to another redditor struggling with negative body image thoughts: Whenever I have a body conscious/bad body image thought, I try to recognize it as a  \"negative body image thought\" and respond with something like \"I am not  my body\" or \"my body does not define me\" or \"my body is my vessel\" or  \"the shape of my body does not matter\" or \"all bodies are worthy of  love\"... find some little mantras that resonate with you. I'd recommend  following fat-positive social media accounts (models, athletes,  influencers,  etc.) that are actively celebrating diverse body types and people in  larger bodies. This will help with restructuring your mindset to be less  fat-phobic.  \n>  \n>In addition, I have found journaling about my feelings to  be super helpful as I remind myself where our fat phobia/body  dissatisfaction comes from in the first place. We live in a  society/economy that glorifies a body type that only a small fraction of  the female population naturally has. Capitalism media/marketing has  insidious psychological tactics to make you hate your body and fear  being \"fat\" in order to SELL YOU THINGS (diets, exercise products,  beauty products, clothes, the list goes on)! They profit off of self  hatred they instill within us- It's truly evil. We must remember that  \"modern\" times are only a glimpse of human history. Women in larger bodies  have been worshiped for millennia by other cultures since they saw the  full feminine form is a sign of fertility, beauty, and prosperity. See  these prehistoric goddess statues  for example. Try to remember that we have all been subconsciously  programmed by social construction, media, and marketing to fear the fat  on our bodies. There is truly NOTHING wrong with your body no matter what size it is.  Journaling  down these reminders and self affirmations to encourage body acceptance  will help restructure your mindset. It is totally possible to create new  neural networks (brain connections = thought patterns) and overcome the root cause of your struggles!  \n>  \n>More resources:\n\n* The food psych podcast\n* the love food podcast\n* the fuck it diet podcast\n* Eating in the light of the moon\n* Intuitive eating book and workbook\n* Local support groups\n* Link to MORE resources: [https://alissaswankcounseling.com/new-page](https://alissaswankcounseling.com/new-page)\n* instagrams such as: nourishandeat, danaisabellaaa, bodyposipanda, bravespacenutrition",
      "created_utc": 1596841184.0,
      "score": 1,
      "context": [
        {
          "id": "g0qd3zu",
          "author": "jenny_mac_",
          "body": "My fitness pal and counting calories in general can be really troubling psychologically. Those “calorie budgets” and goal weight timelines, etc disconnect you from trusting your body and it’s needs. No app or meal plan program can tell you what your body truly needs. Only your body can. They also reprogram your brain to obsess over numbers and rely on the app for security. I’ve been there, too and I have been free of counting calories, steps, macros, etc for 3+ years now and feel great about my body and food. So you can get to a better place! it takes some work but is 10000000% worthwhile. \nI would suggest looking into health at every size and intuitive eating, just google them and look for podcasts and books. Also, the work of Christy Harrison, Isabel foxen duke, and Anita Johnson. \nId suggest asking your doctor for help around the fear of gaining weight because that seems like the root cause here. We live in a manipulated culture that makes women fear gaining weight so we buy products to feel good about ourselves. Waking up to this lie and the evil of corporations while accepting that bodies come in all shapes and sizes, and larger bodies can still be healthy, is KEY! \nPerhaps you can see an ED therapist who can help you unpack the reason why you have those fears and to support you to trust your body to find it’s true healthy weight, and to accept and love it no matter what it looks like. \n\nFeel free to DM me if you want more support. \nSending hugs. I know it’s hard but you’re strong, self aware, and on the right path ❤️",
          "created_utc": 1596840537.0
        }
      ]
    }
  ]
}