{
  "id": "i5at8p",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596792835.0,
  "title": "Request: in danger of a relapse",
  "selftext": "I don't usually post much on here but I legit have no idea what to do anymore. \n\nI'm on vacation with a close friend of mine and they've started developing an ED. at the moment they're doing keto, IF and low fat all at the same time and constantly making comments about the food that everyone else is eating, as they get a special plate with just barely any meat and some veggies. they also constantly talk about burning the calories and it's extremely triggering for me. \n\nseeing their eating habits and hearing all the food talk has made my recovery extremely hard and every day is a huge struggle so I don't relapse. \n\nI've tried talking to them about it and they said they would do less food talk but it hasn't actually happened. I've also tried explaining what this road would do to them but they seem legit proud of what they're doing. \n\nI'm scared for my own as well as their well being. any advice on what I should do?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i5at8p/request_in_danger_of_a_relapse/",
  "score": 44,
  "num_comments": 10,
  "comments": [
    {
      "id": "g0o50sa",
      "author": "Special_Cabinet",
      "body": "This might sound harsh, but only worry about yourself here. You’ve tried to talk to them and they aren’t listening, and now you just have to make sure you stay on track. Lead by example for them, and keep yourself healthy. \n\nLook, I really don’t know the tools to combat a relapse because I’m relapsing right now and have been for months. But one thing I do know is that I will get healthy again. We can do this. We can all do this. You can do this. You can make it through this. This vacation is temporary and soon enough you will be away from these triggers. You clearly do not want to go back to your ED or you wouldn’t be posting. The triggers are going to be in our lives always and this is a test for you. You can recognize the trigger, but not let it control you. You are so strong. I feel dumb commenting with no actual advice but I just wanted to offer my support. Hopefully it helps somehow. \n\nReally though, you can do this. You do not have to relapse.",
      "created_utc": 1596803230.0,
      "score": 28,
      "context": []
    },
    {
      "id": "g0oirk2",
      "author": "Emmalea211",
      "body": "You might need to distance yourself from said friend. They’re triggering you and that puts you in a really dangerous position. \n\nAdmittedly, they seem to be developing an ED. You’ve tried to talk to them but they obviously don’t really care that they’re affecting you. That’s also really worrying considering that your friend’s going down that path. If you could have a serious heart to heart, and explain how much it hurts and affects you, it might help (but i cannot make any guarantees). \n\nYou are your most important person. You need to do what’s best for you, first, and then worry about your friend. That fact that it’s triggering you so much and you’re worried of a relapse, that’s not okay. It sounds like their habits are making either the situation or friendship toxic, and you need to separate yourself from that. Your friend also needs to understand that not everything is about them, and that the food talk is really damaging your psyche. I get that they’re developing an ED, but considering that you’ve already have one I’d say you’re more at risk out of the two of you. You need to look out for yourself and get into a better mindset, either by leaving your friend for a while or really connecting with them and helping them understand how serious this is to you and said person. \n\nI hope i’m not coming across as harsh, especially towards your friend, but you do not deserve this. Recovery by itself is already excruciatingly hard, and your friend talking about food the way they do and being really open about their progression w their ED isn’t good for you in the recovery stage. Distance yourself or really get them to understand how toxic that behavior is, not only to them but especially to you. You deserve to be happy and healthy, and at the moment things sound pretty toxic. \n\nYou are worthy of recovery. You are worthy of being happy. Do everything you can to become as such, because you can’t save your friend if you can’t even save yourself. Don’t become the white knight. Be cautious and understand that you and your recovery is the most important thing to you. Sending you love, be safe. Keep us updated if you want :’)",
      "created_utc": 1596809506.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g0oid9h",
      "author": "lazyleann",
      "body": "Ugh i have a friend who does similar things. I’m sorry, I know that’s extremely hard to hear those things and continue to do the right thing for yourself. But even though they seem proud, they’re misguided because disordered eating isn’t something to be proud of. What IS something to be proud of is continuing to push forward with your recovery when you’re forced to hear the voice of your eating disorder come out of your friends mouth. If your friend is truly developing an ed, they might act proud and happy and think they’re doing something right and all that, but deep down they’re actually miserable and hurting, and not living a full life. Remember what it’s like to be completely consumed by your ed? Think of your worst eating disorder day. How miserable and dark and hopeless everything feels? And even though recovery is hard and you don’t always feel great, I’d guess it’s probably better than that. Consider that they might be in that dark place, and remember that it’s not better than where you are now. Also, something that helps me with my friend is to continue to push in my recovery and not sit still. I feel better knowing I still have an eating disorder and have more to do in my recovery, so I work towards that and put my energy into it. There’s always more progress to be made, but I hope that encourages you rather than discourages you.",
      "created_utc": 1596809308.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g0qian9",
      "author": "sweetass0dap0p",
      "body": "I wouldn't be quick to say they are developing an eating disorder, first of all. Obsession over fitness and nutrition is not an ED, but can be a a biproduct of one. Eating disorders are less about the behaviors and more about what goes on in one's head to make them act the way they do. It's okay to be concerned for them, but be careful giving unsolicited advice. If you are triggered, set boundaries and communicate to your friends why you are triggered. Use more \"I feel\" language and not try to project your personal struggles on her.\n\nXoxo to you in your recovery. You've got this!",
      "created_utc": 1596843334.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0oczg9",
      "author": "Ahunteman",
      "body": "Focus on you.  Can you get to a twelve step meeting, f2f, computer, or phone?  OA Big Book Solution Group is a really healthy group.  They have a web page you can Google.",
      "created_utc": 1596806928.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0pxlkn",
      "author": "liamdepam",
      "body": "If they aren't listening distance yourself. A friendship isn't worth your health.",
      "created_utc": 1596832814.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0qi6i6",
      "author": "voiceinheadphone",
      "body": "You need to tell this friend point blank that she can not speak about food or dieting when you are present because it’s making you want to relapse. Not a word about it to you or other people. If she is a true friend or even just a decent person she will take that to heart . And if she continues to do so you should tell her you can’t be around her anymore. Seems\nharsh but setting these boundaries are important. I’ve had people to it to me with things.",
      "created_utc": 1596843271.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0nqf8c",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596792835.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0ppve8",
      "author": "nooorecess",
      "body": "when i’m relapsing i too come here and give other people advice about avoiding relapse hahah. i think it’s actually helpful cuz it puts you more easily in that rational thinking mindset, like when therapists ask “what would you tell someone else who was struggling with this?”\n\nand to OP, i also suggest trying to stop yourself and take apart the thoughts passing through your mind when you feel yourself becoming triggered by her food talk/choices. what are the underlying beliefs that are feeding the thoughts? are they based in reality, or just left over bits of your eating disorder?\nif your friend is suggesting that one should eat a tiny pile of vegetables for dinner, does that make it true? where did she get this idea? one of those shitty clickbait websites we’ve all been to that list the top 10 secret fat burning berries or whatever? do you think it’s safe to say you’re better off ignoring her chatter and sticking to your recovery plan?\n\nyou’ve probably been around this block enough times to know she’s making dangerous choices, and i’m sure she knows as well, which is why she needs to comment on everyone else’s food to reassure herself that this diet is a good idea. all you can do is take care of yourself and be there to empathize later if this thing gets out of control and she ends up needing to seek help herself. you can do it, we all can!",
      "created_utc": 1596829085.0,
      "score": 6,
      "context": [
        {
          "id": "g0o50sa",
          "author": "Special_Cabinet",
          "body": "This might sound harsh, but only worry about yourself here. You’ve tried to talk to them and they aren’t listening, and now you just have to make sure you stay on track. Lead by example for them, and keep yourself healthy. \n\nLook, I really don’t know the tools to combat a relapse because I’m relapsing right now and have been for months. But one thing I do know is that I will get healthy again. We can do this. We can all do this. You can do this. You can make it through this. This vacation is temporary and soon enough you will be away from these triggers. You clearly do not want to go back to your ED or you wouldn’t be posting. The triggers are going to be in our lives always and this is a test for you. You can recognize the trigger, but not let it control you. You are so strong. I feel dumb commenting with no actual advice but I just wanted to offer my support. Hopefully it helps somehow. \n\nReally though, you can do this. You do not have to relapse.",
          "created_utc": 1596803230.0
        }
      ]
    },
    {
      "id": "g0qfyh5",
      "author": "rebeljammer",
      "body": "Glad to see kindred spirits here. Here I am, relapsing myself, trying to give others advice. I can talk the talk but I can't walk the walk sometimes. Hoping to be better. \n\nOP I agree that you need to focus on yourself. You really can't convince someone that they have an eating disorder, so model your best behavior and distance yourself as much as possible from that talk.\n\nPersonally, I can change my behaviors but I can't change my thoughts. If I act in a healthy way, my thoughts will eventually shift to my new behavior. Even when the ED voice is loud, I just keep doing what's best for my body and the voice goes away.",
      "created_utc": 1596842068.0,
      "score": 6,
      "context": [
        {
          "id": "g0o50sa",
          "author": "Special_Cabinet",
          "body": "This might sound harsh, but only worry about yourself here. You’ve tried to talk to them and they aren’t listening, and now you just have to make sure you stay on track. Lead by example for them, and keep yourself healthy. \n\nLook, I really don’t know the tools to combat a relapse because I’m relapsing right now and have been for months. But one thing I do know is that I will get healthy again. We can do this. We can all do this. You can do this. You can make it through this. This vacation is temporary and soon enough you will be away from these triggers. You clearly do not want to go back to your ED or you wouldn’t be posting. The triggers are going to be in our lives always and this is a test for you. You can recognize the trigger, but not let it control you. You are so strong. I feel dumb commenting with no actual advice but I just wanted to offer my support. Hopefully it helps somehow. \n\nReally though, you can do this. You do not have to relapse.",
          "created_utc": 1596803230.0
        },
        {
          "id": "g0ppve8",
          "author": "nooorecess",
          "body": "when i’m relapsing i too come here and give other people advice about avoiding relapse hahah. i think it’s actually helpful cuz it puts you more easily in that rational thinking mindset, like when therapists ask “what would you tell someone else who was struggling with this?”\n\nand to OP, i also suggest trying to stop yourself and take apart the thoughts passing through your mind when you feel yourself becoming triggered by her food talk/choices. what are the underlying beliefs that are feeding the thoughts? are they based in reality, or just left over bits of your eating disorder?\nif your friend is suggesting that one should eat a tiny pile of vegetables for dinner, does that make it true? where did she get this idea? one of those shitty clickbait websites we’ve all been to that list the top 10 secret fat burning berries or whatever? do you think it’s safe to say you’re better off ignoring her chatter and sticking to your recovery plan?\n\nyou’ve probably been around this block enough times to know she’s making dangerous choices, and i’m sure she knows as well, which is why she needs to comment on everyone else’s food to reassure herself that this diet is a good idea. all you can do is take care of yourself and be there to empathize later if this thing gets out of control and she ends up needing to seek help herself. you can do it, we all can!",
          "created_utc": 1596829085.0
        }
      ]
    }
  ]
}