{
  "id": "i60b7r",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596898077.0,
  "title": "Request: I think my brother is struggling with an eating disorder and I'm not sure how I can help him",
  "selftext": "I've had my suspicions for a while now (for example, he always goes to the bathroom after a meal, while cleaning the toilet I sometimes find evidence that someone threw up, he eats A LOT but is not overweight), but my suspicions were confirmed today when I overheard him in the bathroom throwing up after lunch. He brushed his teeth after as well. I have never had any experience dealing with EDs or know anyone personally that struggled with it so I am lost on how I can go about helping him. I don't think I should tell my parents- they are a little old fashioned and I don't think they would understand. Any advice would help greatly!! \n\n(Note: my brother is 23 and I am 20)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i60b7r/request_i_think_my_brother_is_struggling_with_an/",
  "score": 62,
  "num_comments": 15,
  "comments": [
    {
      "id": "g0svcad",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1596904386.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g0sns8u",
      "author": "snowbreader",
      "body": "if you don’t want to talk to your parents, talk to him. but please remember that you can’t force anyone into recovery, they have to want to get better.",
      "created_utc": 1596900199.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g0so3eh",
      "author": "ComprehensiveEggo",
      "body": "I think if you're worried you should definitely ask him gently.  Tell him that you're concerned and list off what you've heard and had suspicions of.  I definitely wouldn't tell your parents since he's an adult and if that's a conversation he wants to avoid with them that's his prerogative.\n\nThe most you can do is offer your support.  You won't be able to change his behaviours and your support isn't going to make him all better but it will give him something to lean on if he needs it.  Don't try to police him and his actions because you may find he becomes more secretive, just offer him a friendly ear every so often as he needs.  It may seem counter-intuitive to know he's purging and then just sort of letting him purge but recovery is something that needs to be decided by him when he's ready and isn't something that should be forced on him.\n\nThe absolute best thing you can do for him is try to encourage him to visit a doctor.  If he doesn't want therapy or doesn't want to recover and resists it then I'd personally ask him to visit a doctor anyway to check up on him physically since the physical effects of purging can be dangerous.  Just because he visits a doctor to get certain things tested does not mean he's going to have to go to therapy or something along those lines.\n\nYou can always encourage him to recover and the best thing for him to hear would be that you'll always support him.  When you bring this up to him and when you have conversations with him in the future telling him that you'll not judge him and you'll support him the best you can in the way he needs will be so so so comforting.\n\nAlso you'll get something wrong.   You'll say something triggering and it'll be an accident.  Maybe if he's willing to talk to you about it, the subject of triggers can come up and you can ask him about it so you can try to avoid it.  You'll make a mistake and frankly that's okay.  Just apologise, realistically he'll know as well as you that you mean him no harm.  As a general rule though I wouldn't say things like \"you look good at your weight\" or \"you shouldn't lose/gain anymore\" because whilst those things can be perceived as nice they're actually sorta cursed to hear.\n\nBut you've already had a great start, you've come here looking for advice and you're trying to understand what to do and how to help him.  Recovery takes time and works best when decided on by the person who needs to recover with the support of family and friends.  I hope everything works out for you.  Also I don't know where you're from but please look at the Beat website because they have a support section for friends and family of those with eating disorders.  It can be scary, frustrating and it can worry you.  So please look after yourself as well, make sure you have a support system and stay as safe as possible.\n\nI wish you and your brother the best of luck",
      "created_utc": 1596900373.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g0ta4vn",
      "author": "None",
      "body": "Are you his brother or his sister?\nIt's kinda important to decide, how the approach and confrontation should look like. \nIf you are his brother, then he will be most likely very embarrassed about it. There is a strong stigma attached to male eating disorders. Being gay... It's no disease a \"normal\" man can even have, don't be so wimpy, stop doing it... The usual attitudes. He seems to be bulimic for a while. \n\nI mean, it will be hard for him to hear this from his younger (!) sibling in any case, but there is no easy, smooth way to do it. You might grab a few beers or whatever, take a walk, it's maybe best not do it at home, when he might fear discovery of your parents or whoever else lives in that place at the moment. Just some quit place and the two of you. \nDon't be too dramatic. Maybe be even a bit humorous and blunt to take the edge off, you know. \n\n\"So. Dude. What's up with all the puking? I don't think mum's cooking is that awful lately!\" Something like this maybe...\n\nBut directly after that, you have to tell him plainly and clearly, that this is a very dangerous habit of his, and that he will damage his health, might even die from it. \nThe tips with the milk are fine, but it won't stop the long-term damage Bulimia inflicts on a male or female body. That's the only thing, that interests you: His health, his well-being. You are not disgusted of him, and you won't tell anyone. I guess, that's most important to say from the very start. Otherwise, he will feel even more threatened. \n\nIf he is in denial about the Bulimia, you can try to set him straight.\nIf he comes up with excuses for the purging, you can argue with him about that, to a certain degree. If he won't come around, forget about it, he will need to be honest with himself and others first… \n\nWell, yeah, good luck. That's basically everything, that sprang to my mind about this situation of yours there.\n\nTake care.",
      "created_utc": 1596912082.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g0tm0v5",
      "author": "None",
      "body": "Hey i think the best thing is to approach him and show you care and are concerned for him. Just be their judgement free and try to understand him. There is plenty of material online about how to talk to a loved one about their ED. Maybe worth a google search.",
      "created_utc": 1596918115.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0tqn98",
      "author": "None",
      "body": "Just don’t do what my family does- shame me",
      "created_utc": 1596920557.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0sk610",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596898077.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0utcm8",
      "author": "GiantTigerPrincess",
      "body": "I went through this when I was younger. From when I was 11 (sibling 13) until I moved out at 17 my sister would throw up *often*. She would always say it was because she ate too much and her stomach was upset, or she wouldn’t say anything and go to the bathroom downstairs/turn the tap on. I didn’t even know what an ED was at 11, so it wasn’t until I was 16 or so that I realized what she was going through. \n\nAnd to be honest, I never talked to her about it. I regret it, but it wasn’t something she was doing constantly (maybe 1 or 2 times a week), and it didn’t feel like my space to enter.\n\nJust a few months ago she called me and told me she’s bulimic (I’m now 23), and she’s working on it. \n\nLooking back on my experience, I recommend talking to him about it. I don’t recommend going to your parents first - he’s 23 years old. He may not know the risks of what he is doing and it might be good for him to talk to someone about it - whether that be you or someone else.",
      "created_utc": 1596942208.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0t1xjb",
      "author": "scubachip7",
      "body": "To piggyback on this, at the very least tell him he needs to neutralize the acid after he throws up. He can try some milk, then brush his teeth a little later.",
      "created_utc": 1596907919.0,
      "score": 7,
      "context": [
        {
          "id": "g0svcad",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1596904386.0
        }
      ]
    },
    {
      "id": "g0ujivw",
      "author": "cococherry26",
      "body": "Thank you for this advice/information!! I didn't realize the serious implications brushing his teeth right after would have his health. I will definitely make sure to mention it to him.",
      "created_utc": 1596936441.0,
      "score": 2,
      "context": [
        {
          "id": "g0svcad",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1596904386.0
        }
      ]
    },
    {
      "id": "g0ujmq6",
      "author": "cococherry26",
      "body": "For sure. I don't want to push him into doing anything, just want to know and understand what's going on.",
      "created_utc": 1596936499.0,
      "score": 2,
      "context": [
        {
          "id": "g0sns8u",
          "author": "snowbreader",
          "body": "if you don’t want to talk to your parents, talk to him. but please remember that you can’t force anyone into recovery, they have to want to get better.",
          "created_utc": 1596900199.0
        }
      ]
    },
    {
      "id": "g0ujy32",
      "author": "cococherry26",
      "body": "Thank you for your long and detailed response. Honestly, I've been putting off talking to him because I am scared of saying something wrong or it will result in him pushing me away but for his health I know I have to do something. This has given me a lot of courage so thank you again.",
      "created_utc": 1596936671.0,
      "score": 2,
      "context": [
        {
          "id": "g0so3eh",
          "author": "ComprehensiveEggo",
          "body": "I think if you're worried you should definitely ask him gently.  Tell him that you're concerned and list off what you've heard and had suspicions of.  I definitely wouldn't tell your parents since he's an adult and if that's a conversation he wants to avoid with them that's his prerogative.\n\nThe most you can do is offer your support.  You won't be able to change his behaviours and your support isn't going to make him all better but it will give him something to lean on if he needs it.  Don't try to police him and his actions because you may find he becomes more secretive, just offer him a friendly ear every so often as he needs.  It may seem counter-intuitive to know he's purging and then just sort of letting him purge but recovery is something that needs to be decided by him when he's ready and isn't something that should be forced on him.\n\nThe absolute best thing you can do for him is try to encourage him to visit a doctor.  If he doesn't want therapy or doesn't want to recover and resists it then I'd personally ask him to visit a doctor anyway to check up on him physically since the physical effects of purging can be dangerous.  Just because he visits a doctor to get certain things tested does not mean he's going to have to go to therapy or something along those lines.\n\nYou can always encourage him to recover and the best thing for him to hear would be that you'll always support him.  When you bring this up to him and when you have conversations with him in the future telling him that you'll not judge him and you'll support him the best you can in the way he needs will be so so so comforting.\n\nAlso you'll get something wrong.   You'll say something triggering and it'll be an accident.  Maybe if he's willing to talk to you about it, the subject of triggers can come up and you can ask him about it so you can try to avoid it.  You'll make a mistake and frankly that's okay.  Just apologise, realistically he'll know as well as you that you mean him no harm.  As a general rule though I wouldn't say things like \"you look good at your weight\" or \"you shouldn't lose/gain anymore\" because whilst those things can be perceived as nice they're actually sorta cursed to hear.\n\nBut you've already had a great start, you've come here looking for advice and you're trying to understand what to do and how to help him.  Recovery takes time and works best when decided on by the person who needs to recover with the support of family and friends.  I hope everything works out for you.  Also I don't know where you're from but please look at the Beat website because they have a support section for friends and family of those with eating disorders.  It can be scary, frustrating and it can worry you.  So please look after yourself as well, make sure you have a support system and stay as safe as possible.\n\nI wish you and your brother the best of luck",
          "created_utc": 1596900373.0
        }
      ]
    },
    {
      "id": "g0ukbjf",
      "author": "cococherry26",
      "body": "I really appreciate all the advice you gave. I am his sister btw so maybe that will make the talk a little easier? I am still terrified of saying anything, but after reading this I know that I need to say something. Thank you again.",
      "created_utc": 1596936873.0,
      "score": 1,
      "context": [
        {
          "id": "g0ta4vn",
          "author": "None",
          "body": "Are you his brother or his sister?\nIt's kinda important to decide, how the approach and confrontation should look like. \nIf you are his brother, then he will be most likely very embarrassed about it. There is a strong stigma attached to male eating disorders. Being gay... It's no disease a \"normal\" man can even have, don't be so wimpy, stop doing it... The usual attitudes. He seems to be bulimic for a while. \n\nI mean, it will be hard for him to hear this from his younger (!) sibling in any case, but there is no easy, smooth way to do it. You might grab a few beers or whatever, take a walk, it's maybe best not do it at home, when he might fear discovery of your parents or whoever else lives in that place at the moment. Just some quit place and the two of you. \nDon't be too dramatic. Maybe be even a bit humorous and blunt to take the edge off, you know. \n\n\"So. Dude. What's up with all the puking? I don't think mum's cooking is that awful lately!\" Something like this maybe...\n\nBut directly after that, you have to tell him plainly and clearly, that this is a very dangerous habit of his, and that he will damage his health, might even die from it. \nThe tips with the milk are fine, but it won't stop the long-term damage Bulimia inflicts on a male or female body. That's the only thing, that interests you: His health, his well-being. You are not disgusted of him, and you won't tell anyone. I guess, that's most important to say from the very start. Otherwise, he will feel even more threatened. \n\nIf he is in denial about the Bulimia, you can try to set him straight.\nIf he comes up with excuses for the purging, you can argue with him about that, to a certain degree. If he won't come around, forget about it, he will need to be honest with himself and others first… \n\nWell, yeah, good luck. That's basically everything, that sprang to my mind about this situation of yours there.\n\nTake care.",
          "created_utc": 1596912082.0
        }
      ]
    },
    {
      "id": "g0ukils",
      "author": "cococherry26",
      "body": "I will definitely look into online resources. Like you suggested, all I really want is to know and understand what's going on with him and what he's going through. Thanks for your input.",
      "created_utc": 1596936978.0,
      "score": 1,
      "context": [
        {
          "id": "g0tm0v5",
          "author": "None",
          "body": "Hey i think the best thing is to approach him and show you care and are concerned for him. Just be their judgement free and try to understand him. There is plenty of material online about how to talk to a loved one about their ED. Maybe worth a google search.",
          "created_utc": 1596918115.0
        }
      ]
    },
    {
      "id": "g0tvlbb",
      "author": "curlytheatregremlin",
      "body": "I’d recommend baking soda",
      "created_utc": 1596923230.0,
      "score": 3,
      "context": [
        {
          "id": "g0svcad",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1596904386.0
        },
        {
          "id": "g0t1xjb",
          "author": "scubachip7",
          "body": "To piggyback on this, at the very least tell him he needs to neutralize the acid after he throws up. He can try some milk, then brush his teeth a little later.",
          "created_utc": 1596907919.0
        }
      ]
    },
    {
      "id": "g0ut9e9",
      "author": "None",
      "body": "I guess so. \n\nHe won't feel double-ashamed.\n\nIf you were his little brother, I would advice against the one on one talk maybe. \n\nI could not take that. Big brother is the guardian, and not the one with an eating disorder, that needs some psychological and emotional advice. \n\nI know, that is stupid and cliche, but that is how men tend to think intuitively. And women too for that matter. \n\nHe will certainly assume, that you can relate better to the issue itself (since you are a woman, which is certainly more or less true, up for debate, but that's how his perception of things most likely will be.)\n\nIs he some sort of professional athlete?\nThere are certain risk sports, that are notorious for the more rare development of male bulimia/anorexia. Boxing, wrestling, ballet dancer, running sports, gymnastics... Stuff, where weight classes play a big role for professional competition.\n\nIs he gay? \nIt's a stigma, but as far as I know, it is also not, since gay men have a pressure comparable to that of women, when it comes to being thin and attractive, and youthful, for the rest of their life. In other words, there are more gay men with eating disorders than heterosexual men - according to statistics, but those statistics are also quite scarce in comparison to the data there is about female bulimia/anorexia.\n\nAnd it does often play a role, beyond the rather mundane beauty cult in gay culture. Many men seem to develop the eating disorder out of denial and frustration about their own homosexuality. Hate for their own body and their sexual attraction to the same gender is compensated through the eating disorder. Gives them back control. \nThat is all very superficial, but might be good to know, when going into such a rather peculiar conversation.\n\nKeep it in mind. I would leave the gay thesis out for now. \n\nThis is like hitting him right in the dick, twice. It will be \"interesting enough\", if you confront him with your factual observations about his voluntary purging. \n(Except you know for a fact already, that he is gay, or you have a strong, strong suspicion for that as well.)\n\n\nSo. When are you going to do it? How? Any plans already?",
      "created_utc": 1596942152.0,
      "score": 1,
      "context": [
        {
          "id": "g0ta4vn",
          "author": "None",
          "body": "Are you his brother or his sister?\nIt's kinda important to decide, how the approach and confrontation should look like. \nIf you are his brother, then he will be most likely very embarrassed about it. There is a strong stigma attached to male eating disorders. Being gay... It's no disease a \"normal\" man can even have, don't be so wimpy, stop doing it... The usual attitudes. He seems to be bulimic for a while. \n\nI mean, it will be hard for him to hear this from his younger (!) sibling in any case, but there is no easy, smooth way to do it. You might grab a few beers or whatever, take a walk, it's maybe best not do it at home, when he might fear discovery of your parents or whoever else lives in that place at the moment. Just some quit place and the two of you. \nDon't be too dramatic. Maybe be even a bit humorous and blunt to take the edge off, you know. \n\n\"So. Dude. What's up with all the puking? I don't think mum's cooking is that awful lately!\" Something like this maybe...\n\nBut directly after that, you have to tell him plainly and clearly, that this is a very dangerous habit of his, and that he will damage his health, might even die from it. \nThe tips with the milk are fine, but it won't stop the long-term damage Bulimia inflicts on a male or female body. That's the only thing, that interests you: His health, his well-being. You are not disgusted of him, and you won't tell anyone. I guess, that's most important to say from the very start. Otherwise, he will feel even more threatened. \n\nIf he is in denial about the Bulimia, you can try to set him straight.\nIf he comes up with excuses for the purging, you can argue with him about that, to a certain degree. If he won't come around, forget about it, he will need to be honest with himself and others first… \n\nWell, yeah, good luck. That's basically everything, that sprang to my mind about this situation of yours there.\n\nTake care.",
          "created_utc": 1596912082.0
        },
        {
          "id": "g0ukbjf",
          "author": "cococherry26",
          "body": "I really appreciate all the advice you gave. I am his sister btw so maybe that will make the talk a little easier? I am still terrified of saying anything, but after reading this I know that I need to say something. Thank you again.",
          "created_utc": 1596936873.0
        }
      ]
    }
  ]
}