{
  "id": "i63rfy",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1596910170.0,
  "title": "Request: How to help daughters?",
  "selftext": "I am a father of two daughters with eating disorders.  I initially tried to be compassionate, but the ED grew worse.  Then I tried to be authoritative, which helped with ED but hurt the relationship.  What is the perspective of those have ED as to the best way that parents can help?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i63rfy/request_how_to_help_daughters/",
  "score": 53,
  "num_comments": 11,
  "comments": [
    {
      "id": "g0tcyzk",
      "author": "angiotensin-2",
      "body": "So this is very vague and I don’t know what is meant by being “compassionate” and “authoritative.” But I think the one thing parents absolutely need to understand is that they are not equipped with the tools to fight an ed. People go to school for years to understand the inner workings of eds and there is no way someone who doesn’t have an ed or that level of training can know how to properly care for someone with an ed. You need to take both daughters to an ed specific treatment center to be evaluated. They’ll be assigned an appropriate level of care based on each of their current conditions and will be treated by therapists and dietitians who will give them the tools to help them recover. Most treatment centers include family therapy which helps parents and other family members also learn how to deal with it from their end.",
      "created_utc": 1596913513.0,
      "score": 35,
      "context": []
    },
    {
      "id": "g0tyfa0",
      "author": "MechaBitch",
      "body": "I'm in treatment myself right now, and honestly the only thing you can do is be there as a support if they need you. They need professional help for recovery. You're not going to be able to fight this battle for them, and you can't force it fixed. \n\nIf they need to talk, or need help balancing a program, help them. Let them choose who they tell about their ed, and who they talk to about it. Avoid unnecessary comments about how much or what type of food they're eating, or anything that could sound like you're saying they're a burden (cost of food bill is much higher, can't keep food in the house).\n\nIn my program, we just had a session about the best caregivers. Look up caregivers for eating disorders, or caregiver type dolphin. This is classified as the best type, someone who is gentle and firm, compassionate, controls and regulates their own emotions.",
      "created_utc": 1596924756.0,
      "score": 20,
      "context": []
    },
    {
      "id": "g0vr86z",
      "author": "None",
      "body": "Eating disorders are mental illnesses and should be treated by professionals.\nIn my experience, when I am faced with an authoritative father, it only exacerbated my disorder because it makes me feel more out of control. \n\nOne of the center components of many eating disorders, happens to be related to control. Many patients develop an ED when they feel like there is little control in other aspects of their lives other than food.",
      "created_utc": 1596971398.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g0w53h2",
      "author": "liddig",
      "body": "Get them someone outside of the family to speak to! When my mum tried to be authoritative with me I got so angry and pushed her away, I felt I had no where to feel ‘safe’. Be the compassionate ear, don’t give into their eating disorders but listen and validate their feelings. Get them therapy ASAP, family therapy may be good and look at aroundthedinnertable.com it’s for parents of children with eating disorders",
      "created_utc": 1596981859.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g0w47tv",
      "author": "None",
      "body": "Hi! I am so happy to see this post. I am 33 and going on 22 years with an ED. When I was 16 my parents sent me to outpatient treatment. I was pulled out before completing the program bc my mom decided she didn’t like my counselor. That was very detrimental to my ED. That could be a reason I am still struggling daily. Here are some things I have always wished my parents would have done instead:\n\n1. Treat them and their ED as if they/it is normal. Because it is. More common than anyone knows. \n\n2. You will never understand an ED fully unless you have one yourself. Do lots of research. You’re already talking to people on this sub which says a lot. I wish I had a father like that. \n\n3. Do not babysit their ED. “What have you eaten today?” “Did you b/p?” Etc. Instead, ask them how they’re feeling? Is anything stressing them? How was your day? Provide a listening ear. \n\n4. Get them out of the house for fun activities outdoors. Spend quality time together. Fresh air and sun can do wonders.\n\n5. Avoid trigger food. It’s different for everyone but try to have well balanced meals together.\n\n6. Group therapy was a wonderful outlet for me. I was able to meet other young women who were struggling and together we supported one another. \n\nThese are just ideas of support that I have personally. I did not get any of this information from a reputable source. I just know that for me, when partners, friends and parents have ignored my ED, I felt like an alien. I wanted to be able to have an open and honest conversation and not feel so alone. The fact that you care enough to write this post says everything I need to know about the kind of father you are. Young women need more of that and I thank you for being a good support to your daughters.",
      "created_utc": 1596981304.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g0ur6q2",
      "author": "Baffled_octopus",
      "body": "Hiii I think it’s so sweet that you are trying to be there for them. In my house we never talked about it directly and I know that made me ashamed so I would say ask them questions about what they’re thinking/feeling and tell them what you are. I think you can tell them your trying to be there for them even if it’s not perfect all the time. With bulimia my parents would get really upset if they heard purging which actually did help me to stop solely because I didn’t want to get in trouble and it was hard to do it without any noise. Also family therapy couldn’t hurt. I wish you all the best health and happiness.",
      "created_utc": 1596940890.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g0t6b7b",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1596910170.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0wmaa1",
      "author": "invisiblepourlesyeux",
      "body": "Ooh this is tough, because it needs to be a balance. “I know this is really hard. You still need to eat.” “I’m sorry, I know you are mad at me, I can’t let you self-destruct like this.” \n\nMy favorite book for parents is Skills Based Learning for Caring for a Loved One with an Eating Disorder by Janet Treasure et al. It talks about neither hovering (I forget the animal metaphor) nor avoiding (ostrich), but being a dolphin (gently judging when needed). It is a SUPER hard balance, and obviously some kids need more of the emotional support and some kids need more of the firm authority. It just cannot be all one or the other. \n\nAnother thought is that when you are providing empathy and support, try to a) focus on supporting and validating the emotions and not the behavior and b) make sure that you are still providing empathy, support, and positive interaction in situations that have NOTHING to do with food, body image, or the ED. A lot of my clients struggle to give up their ED because they feel like if they do then their parents will think everything is fine and they won’t be supported or taken care of emotionally. \n\n(Source: am personally recovered and now treat eating disorders)",
      "created_utc": 1596991660.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g0wu3i7",
      "author": "None",
      "body": "I wish I had an answer for you, I just wanted to tell you thank you for caring this much. Not having any Male relative even try to emphasize did a number on me as a kid, I'd like to say im past it now that I'm older but still feel uneasy around men that are over 10 years older :/",
      "created_utc": 1596995751.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g0tds93",
      "author": "unf4bulous",
      "body": "I completely agree with this. The number one thing to understand is that eating disorders are so much more insidious than we give them credit for. Given enough time and lack of attention from trained professionals, they will wreak havoc for years and years to come. As someone who wishes I were taken to a treatment center, take them to a treatment center. It'll save their life",
      "created_utc": 1596913939.0,
      "score": 19,
      "context": [
        {
          "id": "g0tcyzk",
          "author": "angiotensin-2",
          "body": "So this is very vague and I don’t know what is meant by being “compassionate” and “authoritative.” But I think the one thing parents absolutely need to understand is that they are not equipped with the tools to fight an ed. People go to school for years to understand the inner workings of eds and there is no way someone who doesn’t have an ed or that level of training can know how to properly care for someone with an ed. You need to take both daughters to an ed specific treatment center to be evaluated. They’ll be assigned an appropriate level of care based on each of their current conditions and will be treated by therapists and dietitians who will give them the tools to help them recover. Most treatment centers include family therapy which helps parents and other family members also learn how to deal with it from their end.",
          "created_utc": 1596913513.0
        }
      ]
    },
    {
      "id": "g0yuc2x",
      "author": "LemonBeeCharm",
      "body": "Absolutely, 100% this. My thoughts (and experience) exactly. I can’t imagine how things would’ve went had my parents been my safe place to land.",
      "created_utc": 1597037708.0,
      "score": 2,
      "context": [
        {
          "id": "g0vr86z",
          "author": "None",
          "body": "Eating disorders are mental illnesses and should be treated by professionals.\nIn my experience, when I am faced with an authoritative father, it only exacerbated my disorder because it makes me feel more out of control. \n\nOne of the center components of many eating disorders, happens to be related to control. Many patients develop an ED when they feel like there is little control in other aspects of their lives other than food.",
          "created_utc": 1596971398.0
        }
      ]
    }
  ]
}