{
  "id": "i7efro",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597096022.0,
  "title": "Request: How should I respond to boyfriend's comments?",
  "selftext": " \n\nSo ive had a eating disorder since i was young years old.(trauma related) Ive been through them all. Anorexia, bulimia, binge eating. Anything eating disordered ive been there.\n\nWhen i met my boyf i was anorexic. This was over 10 years ago. I went through bulimia and binge eating since. Up and down in shape non stop. He acceptted it up till few years ago where binge eating took over and i put on extreme amount weight pretty quick in few years and i became pretty unhealthy. Im pretty tall lucky so its evened out over my body but im still alot heavy..\n\nAnyway he started saying to me he was worried for my health and it wasnt healthy and i needed to exercise so we could go on walks together and i needed eat better and stuff and Didnt find me attractive anymore.\n\nI agreed and i not happy how i looked or felt. I stopped binging pretty much at around xmas. Ive not binged once since. Ive lost alot weight. I wont say how much as im not sure a numbers allowed or not.\n\nHowever heres the issue. My boyf says i look no different and recently text me saying i looked like id put all my weight back on and looked fat and unhealthy again. When what actually happened is id just been eating normally for few weeks for a break from loosing.i didnt loose or put on any weight in those two weeks.i staid exactly the same weight. In those two weeks i stopped reporting every other day id lost a bit weight to him. So i think psychology he made me fatter in his head?? After he sent that i cried and cried for ages. I felt my big weight loss had meant nothing if i still looked just how i did before.\n\nIf i eat he rolls his eyes and judges me for it. Which really doesnt help me.\n\nI want to be healthy again but i still have binging urges constantly but im controling them but they are there daily.he has no idea how hard it is. He eats a big bar chocolate for pudding every day. I cant do that.\n\nI have a few health disorders that make loosing weight harder too like pcos and underactive thyriod ect.\n\nMy mum saw me after not having seen me for multiple months and said i looked quite alot better. So i know it is visable and the scales dont lie. Niether do the photos.\n\nI want to be healthy yes but i feel like theres alot pressure from my boyf and its making me feel really bad about myself. I should feel goid ive lost and im healthier. Im still classed as heavy so i have some more to loose but i should be pleased.\n\nLoosing all i did isnt easy when inside you wsnt to binge so badly. I have so many in dealt with emotional issues. I just feel like i cant eat right now. Parts me is greatful because i want be healthier but part of me is really annoyed. Id like to enjoy having a snack and feel not judged about it once in a while.\n\nIdk. I know he is just trying to help but it feels not so good sometimes. I dont know how to talk to him about it. I have pressure from myself i dont need it from him too.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i7efro/request_how_should_i_respond_to_boyfriends/",
  "score": 48,
  "num_comments": 27,
  "comments": [
    {
      "id": "g11gjkg",
      "author": "None",
      "body": "Either talk to him about you feel/the details of this post or dump him. Good luck.",
      "created_utc": 1597097694.0,
      "score": 40,
      "context": []
    },
    {
      "id": "g11icqk",
      "author": "updown27",
      "body": "Your health and peace of mind is too important be in a relationship with someone who thinks they are a personal trainer you never asked for.",
      "created_utc": 1597098583.0,
      "score": 34,
      "context": []
    },
    {
      "id": "g11ohul",
      "author": "MaryContrary26",
      "body": "I can't help wondering if he's using this whole weight thing as an excuse and there's really something else going on. I have found in my own relationship that when we're connecting, physical appearance isn't important but when we're not, everything seems magnified. And yes, you do need to be able to have a snack and not feel judged about it.",
      "created_utc": 1597101782.0,
      "score": 27,
      "context": []
    },
    {
      "id": "g11ikjp",
      "author": "dpr_mango",
      "body": "Honestly, I think you should drop him. If he wants you to eat healthy that’s good, but from what I read, he just criticizes your body and is very judgmental. Your boyfriend literally body shames you and isn’t supporting you through your recovery journey. \n\nWhen he makes negative comments about your body, he’s really just being toxic. You deserve to be loved no matter what you look like and having him judge you is not right. I’m also glad that you are eating healthier, and you need to know that you deserve to eat well and have good health. \n\nIf he judges you for eating or looking a certain way, that’s not a healthy relationship. If he doesn’t care about your issues or refuses to take the time to listen and understand you, you need to leave him. You are worth much more than you think and you deserve way better than anyone like him. I don’t know the full context, but this is my advice to you. Stay healthy and remember to love yourself!",
      "created_utc": 1597098694.0,
      "score": 24,
      "context": []
    },
    {
      "id": "g11sv7c",
      "author": "None",
      "body": "You’re doing great and I hope you can focus on the positive things you’ve accomplished. You have to maintain a positive support group and not let someone with negative thoughts creep into your recovery. Maybe take a break from the boyfriend. I wish you so much luck on your journey.",
      "created_utc": 1597104181.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g128inq",
      "author": "hkheimer",
      "body": "Sounds like you've been together for awhile so it's hard to just break up with him, but honestly that's not acceptable from a partner. They need to be supportive and caring and he sounds like he may be making your eating disorder worse. He should not care about your looks as much as who you are.",
      "created_utc": 1597112967.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g11mw1v",
      "author": "jeabgrenouille",
      "body": "I know it's not nice to hear from us that he does not sound like a supportive partner, but I hope perhaps it is tough love that is helpful. The last thing you need in a partner is someone who is going to criticize your eating habits and your body. That is the last thing you need... That feels like conditional love. I understand you have been together a long time, but there are people out there who will appreciate your physical appearance at any size and you can be examples for you in how to eat normally and who will cheer you on in just living your life without disordered thoughts or behaviours. I don't know the whole story though so I am really deeply sorry if you feel like I am being too blunt and unfair.\n\nIf you do actually need to lose weight for your health, it won't likely come from a place of hating your body and trying to please your boyfriend. \n\nIn all honesty, I feel like how dare you be made to feel like maintaining your weight is a failure. I feel angry about that because not bingeing is a pretty major thing, and it is not typical that people lose weight consistently every week, even with consistent effort. Extra sodium, extra carbs, eating late, not pooping, extra exercise, hormones, etc all affect your scale weight and have nothing to do with fat loss or gain.\n\nI really wish you the best. I hope that you take some time to reflect on what is best for you and you do what you need to do to advocate for that, whatever that may be.",
      "created_utc": 1597100932.0,
      "score": 13,
      "context": []
    },
    {
      "id": "g11uyge",
      "author": "wendy125",
      "body": "Get rid of him.  You don't need that negativity.  Hugs to you!",
      "created_utc": 1597105351.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g11w9ws",
      "author": "None",
      "body": "Get rid of him, he's just going to bring you down \n\nNo one is worth that",
      "created_utc": 1597106090.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g12oazu",
      "author": "hazy_PLUR_kitty",
      "body": "Please leave him. I am begging you. Dating someone thAt lacks basic understanding of eating disorders only makes it worst for u. Ive been there and even tho leaving was extremely painful it was one of the best decisions ive made for my mental health.",
      "created_utc": 1597123360.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g11u8o3",
      "author": "None",
      "body": "You should respond to your boyfriend’s comments by saying “You are trash and no longer my boyfriend” and then leave and be much happier out of that toxic relationship",
      "created_utc": 1597104949.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g12kzok",
      "author": "None",
      "body": "talk to him about it. if things don’t get better then dump his ass. i’m sorry but if he’s known you through multiple eating disorders he should know it’s something you struggle with and that by commenting negatively on your weight could send you on a downhill spiral and cause you to relapse on o e of your other EDs or just overall not be good for your mental health. if he can’t understand that then that’s on him.",
      "created_utc": 1597120854.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g130nvh",
      "author": "riversandroads8888",
      "body": "He sounds like a jerk. I don't want to be so blunt, but honestly, think about yourself in his position, would you love and support him or would you criticize like he's doing. I think he's probably just putting his own problems in you (projection etc.). Maybe he feels threatened by your improvements. I'd say have an honest talk with him and tell him how his behavior/ words feel. If he still doesn't change dump him, you deserve love regardless of your size or struggles. We all have mountains to climb in life and a partner who won't climb the mountain with you isn't much of a partner. Good luck!",
      "created_utc": 1597134757.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g12dp1z",
      "author": "Vampiric_Doll",
      "body": "Just throw the whole man away. lmao Seriously, though. You deserve BETTER and someone who loves and supports you regardless.",
      "created_utc": 1597116053.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g11d6uy",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597096022.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g12suxf",
      "author": "Zachstir",
      "body": "This is not someone who has your best interests in mind",
      "created_utc": 1597127215.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g12yd7d",
      "author": "None",
      "body": "Hi this is my post. I feel like i should explain that my boyf is a very caring person usually and has supported and staid with me through ALOT and tries to help and i think he was trying to show he cared but went about it maybe the wrong way idk. Maybe there are other issues going on too thats a possibility. I do feel he is ashamed of me a bit though and doesnt find me atractive but he comes from a family of naturally skinny people where none them are or ever been fat and thats not his fault he hasnt been brought up around them struggles. Idk to be honest. Theres alot that could be going on. \n\nI know he cares and trying show he cares but i also know he means it in a slightly  horrid way too.",
      "created_utc": 1597132420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1367p2",
      "author": "bhortelan89",
      "body": "Thats not how a relationship should work. This is straight up bullying. Honestly he is not doing any good or helping you to overcome this. Does he love you only if you look in a certain way?",
      "created_utc": 1597140403.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g139n9p",
      "author": "wdfchicka07",
      "body": "It sounds like he really doesn't care for you. Either he needs to support your recovery or he doesn't belong in your life. Try having a conversation with him and if that doesn't work, its time to move on.",
      "created_utc": 1597143720.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g139qk8",
      "author": "None",
      "body": "I think the fact that he has staid with me shows he does love me still he just would preffer it if i was a healthier smaller size. He isnt the \"jerk\" ur all saying he is.",
      "created_utc": 1597143804.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g18qee8",
      "author": "Over-Gain1100",
      "body": "Talk to him about how you feel and if this continues to be a problem, break up with him.",
      "created_utc": 1597257627.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1i21te",
      "author": "fishsourced",
      "body": "I think it would be detrimental to your long term mental health to stay with this guy.",
      "created_utc": 1597449668.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g13ur7p",
      "author": "firegirl58",
      "body": "Dump his ass <3",
      "created_utc": 1597157762.0,
      "score": 0,
      "context": []
    },
    {
      "id": "g12zter",
      "author": "tymopa",
      "body": "People can be caring on one hand and toxic on the other. The question really is about your own mental health. It doesn't matter where he comes from...in the end EDs are seriously damaging and also deadly as you know. I would check out advice eating disorder sites have for loved ones and pass it on to him. If he doesn't change things will get worse AND you deserve to feel good about the amazing progress you've made. And by feeling good, I mean just being able sit with yourself and celebrate your accomplishments and bask in a healthier you. You don't need any more chatter. It doesn't matter if he can't or won't change. The results are the same regardless. If you were giving your best friend advice who is in a similar situation what would you say? Best of luck to you.",
      "created_utc": 1597133891.0,
      "score": 2,
      "context": [
        {
          "id": "g12yd7d",
          "author": "None",
          "body": "Hi this is my post. I feel like i should explain that my boyf is a very caring person usually and has supported and staid with me through ALOT and tries to help and i think he was trying to show he cared but went about it maybe the wrong way idk. Maybe there are other issues going on too thats a possibility. I do feel he is ashamed of me a bit though and doesnt find me atractive but he comes from a family of naturally skinny people where none them are or ever been fat and thats not his fault he hasnt been brought up around them struggles. Idk to be honest. Theres alot that could be going on. \n\nI know he cares and trying show he cares but i also know he means it in a slightly  horrid way too.",
          "created_utc": 1597132420.0
        }
      ]
    },
    {
      "id": "g13ebrq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1597147655.0,
      "score": 2,
      "context": [
        {
          "id": "g12yd7d",
          "author": "None",
          "body": "Hi this is my post. I feel like i should explain that my boyf is a very caring person usually and has supported and staid with me through ALOT and tries to help and i think he was trying to show he cared but went about it maybe the wrong way idk. Maybe there are other issues going on too thats a possibility. I do feel he is ashamed of me a bit though and doesnt find me atractive but he comes from a family of naturally skinny people where none them are or ever been fat and thats not his fault he hasnt been brought up around them struggles. Idk to be honest. Theres alot that could be going on. \n\nI know he cares and trying show he cares but i also know he means it in a slightly  horrid way too.",
          "created_utc": 1597132420.0
        }
      ]
    },
    {
      "id": "g13a10a",
      "author": "None",
      "body": "I get he needs have better understsnding of my ED and how hard it is for me maybe. Maybe he just doesnt see how hard it is for me.",
      "created_utc": 1597144070.0,
      "score": 1,
      "context": [
        {
          "id": "g139qk8",
          "author": "None",
          "body": "I think the fact that he has staid with me shows he does love me still he just would preffer it if i was a healthier smaller size. He isnt the \"jerk\" ur all saying he is.",
          "created_utc": 1597143804.0
        }
      ]
    },
    {
      "id": "g13jmre",
      "author": "None",
      "body": "Your right, my therapist i started seeing recently has said she feels my partner holds some anger against me and maybe this is how its coming out. My weight is by no means dangerous to me. Im not extremely overweight. My doctors arnt concearned by it or anything. My mental health is by far more a priority. I think its something i will have bring up with my therapist and ask how best to approach this with my boyf. Thanks for your reply",
      "created_utc": 1597151330.0,
      "score": 1,
      "context": [
        {
          "id": "g12yd7d",
          "author": "None",
          "body": "Hi this is my post. I feel like i should explain that my boyf is a very caring person usually and has supported and staid with me through ALOT and tries to help and i think he was trying to show he cared but went about it maybe the wrong way idk. Maybe there are other issues going on too thats a possibility. I do feel he is ashamed of me a bit though and doesnt find me atractive but he comes from a family of naturally skinny people where none them are or ever been fat and thats not his fault he hasnt been brought up around them struggles. Idk to be honest. Theres alot that could be going on. \n\nI know he cares and trying show he cares but i also know he means it in a slightly  horrid way too.",
          "created_utc": 1597132420.0
        },
        {
          "id": "g13ebrq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1597147655.0
        }
      ]
    },
    {
      "id": "g5cs3wt",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600177789.0,
      "score": 2,
      "context": [
        {
          "id": "g12yd7d",
          "author": "None",
          "body": "Hi this is my post. I feel like i should explain that my boyf is a very caring person usually and has supported and staid with me through ALOT and tries to help and i think he was trying to show he cared but went about it maybe the wrong way idk. Maybe there are other issues going on too thats a possibility. I do feel he is ashamed of me a bit though and doesnt find me atractive but he comes from a family of naturally skinny people where none them are or ever been fat and thats not his fault he hasnt been brought up around them struggles. Idk to be honest. Theres alot that could be going on. \n\nI know he cares and trying show he cares but i also know he means it in a slightly  horrid way too.",
          "created_utc": 1597132420.0
        },
        {
          "id": "g13ebrq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1597147655.0
        },
        {
          "id": "g13jmre",
          "author": "None",
          "body": "Your right, my therapist i started seeing recently has said she feels my partner holds some anger against me and maybe this is how its coming out. My weight is by no means dangerous to me. Im not extremely overweight. My doctors arnt concearned by it or anything. My mental health is by far more a priority. I think its something i will have bring up with my therapist and ask how best to approach this with my boyf. Thanks for your reply",
          "created_utc": 1597151330.0
        }
      ]
    },
    {
      "id": "g5cxtti",
      "author": "None",
      "body": "Well im still loosing weight, i still obessed with weighing myself daily and reporting to him daily  if ive lost weight or not so i guess none thats changed. Alot things are the same, some areas have improved  that i wont go into if u know what i mean ;)  but mostly just the same.",
      "created_utc": 1600180553.0,
      "score": 1,
      "context": [
        {
          "id": "g12yd7d",
          "author": "None",
          "body": "Hi this is my post. I feel like i should explain that my boyf is a very caring person usually and has supported and staid with me through ALOT and tries to help and i think he was trying to show he cared but went about it maybe the wrong way idk. Maybe there are other issues going on too thats a possibility. I do feel he is ashamed of me a bit though and doesnt find me atractive but he comes from a family of naturally skinny people where none them are or ever been fat and thats not his fault he hasnt been brought up around them struggles. Idk to be honest. Theres alot that could be going on. \n\nI know he cares and trying show he cares but i also know he means it in a slightly  horrid way too.",
          "created_utc": 1597132420.0
        },
        {
          "id": "g13ebrq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1597147655.0
        },
        {
          "id": "g13jmre",
          "author": "None",
          "body": "Your right, my therapist i started seeing recently has said she feels my partner holds some anger against me and maybe this is how its coming out. My weight is by no means dangerous to me. Im not extremely overweight. My doctors arnt concearned by it or anything. My mental health is by far more a priority. I think its something i will have bring up with my therapist and ask how best to approach this with my boyf. Thanks for your reply",
          "created_utc": 1597151330.0
        },
        {
          "id": "g5cs3wt",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600177789.0
        }
      ]
    }
  ]
}