{
  "id": "i7r51g",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597149891.0,
  "title": "Request: Can you have an eating disorder without wanting to be thin?",
  "selftext": "I apologize in advance if this question is stupid or offensive.\nI'm just wondering if I have an eating disorder because I feel really disgusted around food and for example I can't touch it with my bare hands and the smell of food often makes me nauseous (for some reason it's worse when the smell is from someone else cooking).\nBut at the same time I don't wanna be thin because I think it's just not me. I eat a lot of junk food because I like it (and to get a lot of calories from one meal/day so I don't lose weight) but sometimes I crave healthy food too. I'm a really picky eater and I can't eat something that isn't absolutely perfect. One more problem is that I can't bring myself to eat more than once a day because I simply don't get hungry and the food won't go down if I try to force it. I recently got away from an abusive household if that matters\n\nBtw I'm somewhere between underweight and a healthy weight",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i7r51g/request_can_you_have_an_eating_disorder_without/",
  "score": 81,
  "num_comments": 15,
  "comments": [
    {
      "id": "g13kuu6",
      "author": "ambxvalence",
      "body": "You can absolutely have an eating disorder without wishing to be thin, so it is well worth seeking help if your eating habits are posing problems for you. I cant diagnose over the internet and dont know the extent of your problems, but you might want to look into ARFID, as your story does resemble some of the symptoms.",
      "created_utc": 1597152099.0,
      "score": 39,
      "context": []
    },
    {
      "id": "g13kzht",
      "author": "None",
      "body": "Eating disorders/disordered eating is a lot more complex than extreme restricting food intake or obsessing over thinness. I do *personally* define this disorder as a poor relationship with food at the most basic level, whether you are obsessed with “healthy” foods, extremely reducing calories, binging, or even just an extremely picky eater (this one can vary person to person on why they are picky). \n\nI would be interested to explore why you feel the way you do around food. I don’t know you personally so I don’t know your history or general habits. This is a bit silly and may not have anything to do with you, but I know in my childhood I got sick from certain foods (just random children sickness things lol) and now the same foods make me queasy just from the memory. \n\nAlso, you mentioned that you just got out of an abusive situation. I feel that eating disorders rarely exist on their own and come into existence from other events and illnesses. There are multiple reasons for this — ive had many therapists tell me that eating disorders may be developed from traumatic situations which you have had no control of. I also think that when people become distressed, it’s common to lose appetite. Depression, abuse, anxiety, etc can definitely lead to that — that’s what I thought of when you mentioned that you have trouble getting food down and that you just left an abusive household. \n\nTo directly answer your question: yes you can have an eating disorder without wanting to be thin. In my case even, I never wanted to be super thin, and loved curvy women, though still of course struggled badly with body image issues, yet for some reason found myself obsessing over food and my weight (I wanted to lose). \n\nPlease also understand that I’m not a professional and I am only speaking from personal experiences with mysef and others who have gone through EDs. I hope it was at least a bit helpful and feel free to reach out if you want to talk about it or ask anything :)",
      "created_utc": 1597152180.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g148ilj",
      "author": "Lilamyo228",
      "body": "Hi! It sounds like you may be struggling with ARFID, avoidant restrictive food intake disorder. It is a fairly new diagnosis. Most Eating Disorder treatment facilities have treatment protocols for ARFID because it is pretty different than the classic EDs. I would also say that you could start off working with a dietitian familiar with ARFID or occupational therapist (along with an ED therapist) to start making some progress. ARFID can be pretty confusing and isolating. \n\nDisclaimer: I am an ED therapist working at a treatment center.",
      "created_utc": 1597164564.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g13ts21",
      "author": "TheRealAmayan",
      "body": "Anything to do with eating that causes you any sort of grief is an eating disorder imho. Like people with ARFID. Usually their desire is to primarily be healthier, but they can't intake certain foods because of textures or flavours. Like for me, my diet is really limited, and not by choice. I've tried several times to eat better, but my body's reaction to it is usually to reject. Or my brain will just shut off when I try to force it. It's probably one of my biggest struggles.",
      "created_utc": 1597157184.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g13pmum",
      "author": "Ari3n3tt3",
      "body": "Absolutely. From a psychological perspective an eating disorder is about control. Either the cycle of loosing control and gaining control associated with bulimia or the strict restrictive control of anorexia. In addition to those there is also EDNOS (eating disorder not otherwise specified) in this category you find lots of things that don’t fit anorexia or bulimia completely but in my personal experience, EDNOS seems to be about control as well",
      "created_utc": 1597154867.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g14l5sp",
      "author": "not_a_smol_bean",
      "body": "Look into ARFID it's an eating disorder were you don't care about weight, but care about food looks, feels, tastes, smells, etc. To an extreme level. I have it and it sound like what your describing.",
      "created_utc": 1597170521.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g14z6jv",
      "author": "tssclay",
      "body": "yes this is definitely an eating disorder! some are made around sensory issues and are just as valid. i think it’s called ARFID.",
      "created_utc": 1597176999.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g15old7",
      "author": "Emptyfulfillment",
      "body": "It’s not a size it’s a mental disorder and the weight is a number nothing else",
      "created_utc": 1597188734.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g13hfod",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597149891.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g145t24",
      "author": "Polysys0",
      "body": "I still have an eating disorder and I’m satisfied with my body weight. It’s just that purging has become a lifestyle for me, and it’s so bad for me. Like for example, if I eat a lot, I would purge mostly not because I feel bad for gaining weight, but because I hate the feeling of being full, I’m not used to it, so I purge.Also,  I still have the habit of binge eating and purging.",
      "created_utc": 1597163369.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g14agdc",
      "author": "metempsychosis99",
      "body": "Of course, there are a great number of reasons one develops an eating disorder. It does not have to be related to body image and stuff like that. It's a deeper issue. It's not like we wake up one day and think \"I want to be thin so badly, why not through an ED? It's a quick fix\". It's never that simple, even if it seems like it for some.",
      "created_utc": 1597165466.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g14vbbl",
      "author": "coffeeaddictnerd",
      "body": "Absolutely. My ed largely stems from the need for control over something. I grew up in a very traumatizing/chaotic household where I always felt I had no control, and I was scared. So I started controlling the one thing I thought I could, which was my food and my body. After a few years I realized my ed became something of its own and I couldn’t control that either.",
      "created_utc": 1597175224.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g15ojry",
      "author": "Emptyfulfillment",
      "body": "Yesssssss for the love of god Y E S",
      "created_utc": 1597188712.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g15yl14",
      "author": "Neatingebla",
      "body": "In my mental health clinic there's an anorexic woman  (43 yo) extremely underweight and she says she hates thin bodies in general and herself of course. She doesnt want to be thin at all. But she doesnt find pleasure in eating. So yes, it's possible.",
      "created_utc": 1597193814.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g16ztyd",
      "author": "None",
      "body": "For me, at first, it was about control, avoiding \"gluttony\" and feeling superior.",
      "created_utc": 1597218828.0,
      "score": 2,
      "context": []
    }
  ]
}