{
  "id": "i8b9xb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597227844.0,
  "title": "Request: Trusting the Process is So Hard",
  "selftext": "I have always had disordered eating (restriction; purging; binging). I more or less maintained a healthy weight (though not healthy behaviors) for a few years, but then with covid I sank into binge eating and gained a lot of weight.\n\nEnough was enough, I got myself a nutritionist and into therapy. I have been binge free since the day after the first day I met with my nutritionist (four weeksish ago). My weight has been stable, more or less, with even a slight downward trend, presumably from not binging. My nutritionist wants me to chuck the scale but I’m not there yet. \n\nEven with this progress...it’s so hard to contend with this weight gain. I see pictures of myself and literally can barely recognize myself. And it’s not just dysmorphia - there’s a real difference. I had to buy a whole new wardrobe for returning to work—for people who will see me after months looking so different.\n\nI can’t move the way I used to. I love hiking, and when I tried a hike that would have been no problem for me last summer, I literally threw up from over-exertion. I have a wedding dress hanging in my closet (a beautiful, beautiful dress I loved and felt wonderful in) that would never fit me right now. I already had to postpone my wedding because of covid and I don’t want to lose the dress l loved too.\n\nMy weight has creeped up a pound or so during a long vacation and I am so overwhelmed and sad. My nutritionist says I need to be patient, and trust the process but this is really hard.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i8b9xb/request_trusting_the_process_is_so_hard/",
  "score": 60,
  "num_comments": 6,
  "comments": [
    {
      "id": "g18de31",
      "author": "lokiidokii",
      "body": "Chuck the dress. If you feel guilt for spending money on it, take it to a consignment shop that buys clothes. That stupid piece of fabric isn't remotely comparable in value to your mental health and well-being. Same to be said about any clothes. \n\nThat being said, it sounds like it's time to spruce up your wardrobe with clothes you'll love in this new body of yours. Dress that body up and garnish it with beautiful pieces that accentuate parts of your body that you love or are learning to love. Dig your legs? Invest in a shorter skirt that flatters your bum. Dig your boobs? Go ahead and get that lower cut blouse to flaunt the ladies. Are you a fan of your shoulders? Get an off-the shoulder blouse/dress. Love your face (or parts of it)? Maybe it's time to splurge a bit at Ulta or Sephora. Use fashion to help you learn (or relearn) how to respect this wonderful body that's been through such a difficult journey with you. It's really hard to deal with the weight gain during recovery but keep in mind you're trying to make peace with your body, not continue to fight it. It's been through a lot so be patient with it as it adjusts to your new lifestyle. \n\nYour nutritionist is right, the process is hard. It's hard as fuck and so so frustrating because it's truly about being patient, understanding of yourself, and consistent. You've already taken the hardest step by facing your disordered eating habits and getting to work with professionals. That's a huge accomplishment and you need to recognize it as such. Be proud of yourself, lovely. You're doing great, just keep going, continue to be patient, and don't let that little disordered part of your brain get the best of you.",
      "created_utc": 1597252016.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g179190",
      "author": "Alexandradisease",
      "body": "Please trust your nutritionist. Healthy weight loss is slow, but it's worth it, since you are going to develop a healthy relationship with food and don't put back on the weight you've just lost. You will fit in your dress, just keep pushing!",
      "created_utc": 1597228240.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g17gd52",
      "author": "sweetparamour79",
      "body": "This speaks to me on a whole other level. I am about 9 months into trusting the process and omg it is so hard! \n\nPlease do keep trusting the process though. I get that it isn't easy but we are undoing years and years of patterns. They won't be undone over night and our bodies will take time to adjust to a new normal. \n\nI have faith in you. \n\nAlso I am sorry covid is creating uncertainty around your wedding. I am sure you will look stunning in your dress.",
      "created_utc": 1597234526.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g187gww",
      "author": "None",
      "body": "The hardest part of healthy weight loss is **patience**. Weight is not gained *or* lost overnight, it creeps on/off over time. Think of it this way: the time is going to pass regardless, so why not adopt good, healthy habits and treat yourself right? It doesn’t need to be about the weight loss; your health is more important. If you focus on eating good food in reasonable portions you will be doing what is best for you in the long run. It might very well come with a side effect of weight loss but, ultimately, you should just try to be good to yourself. You are worthwhile regardless of your weight.\n\nEdit: I do want to say I get it though; I’m going through pretty much the same thing. Trying to follow my own advice lol!",
      "created_utc": 1597249421.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g178mjm",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597227844.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1btlk8",
      "author": "bumblej13",
      "body": "Hi I’ve made several and had no posts am I doing it wrong?",
      "created_utc": 1597327215.0,
      "score": 1,
      "context": [
        {
          "id": "g178mjm",
          "author": "AutoModerator",
          "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
          "created_utc": 1597227844.0
        }
      ]
    }
  ]
}