{
  "id": "i99x4v",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597358100.0,
  "title": "Request: Pregnant with baby #2 and bulimic",
  "selftext": "This is partly a vent and partly asking for advice and/or reassurance. \n\nFor some background, I’ve been bulimic with restriction for years and years. Then in 2017 I got pregnant with my first child, and I stopped smoking and drinking as soon as I got a positive pregnancy test. I did purge a couple times after I found out I was pregnant and always felt consumed by guilt afterwards and fear that I would lose my baby and it would be my fault. I had my healthy baby in early 2018.\n\nNow I’m pregnant with baby #2. Very much planned. I was late for my period by 5 days last Sunday so I took a test and it was positive. Again I immediately stopped all drinking and smoking, but I again I have purged a couple times since I found out, and I keep crying afterwards and apologizing to my baby and promising I won’t do it again. So I’ve already broken a promise to my child and he or she hasn’t even been born. I’m so overwhelmed with guilt and fear. This baby will complete my family and I know if I lose this pregnancy it will be my fault for purging. I refuse to do it again from now on. I will not do that to my child again. I will not break another promise. \n\nBut I’m so so so scared. I keep reading about how bulimia increases chances of a miscarriage and I’m so afraid. I guess I’m just looking for some reassurance (even though nobody can predict the future lol) or some advice on how to get the disordered thoughts out my head. I’m so scared I hurt my baby.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/i99x4v/request_pregnant_with_baby_2_and_bulimic/",
  "score": 57,
  "num_comments": 11,
  "comments": [
    {
      "id": "g1dyi6o",
      "author": "bpurly",
      "body": "Please please consider therapy. It's so hard to break out of these patterns if you don't have someone knowledgeable to talk to. \n\nI don't mean to guilt trip you in any way but maybe also think about your first child observing your behaviors. Research shows that children pick up on disordered eating habits from a very young age, starting from when they're toddlers. Maybe thinking about it this way could help.",
      "created_utc": 1597363362.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g1ds2pv",
      "author": "muushugaipan",
      "body": "Okay so I've had two kids but I'm not one to purge.  I don't feel qualified to give you advice.\n\nBut you can do this.  You can resist that urge for 36 (guessing you're about a month in?) more weeks.  You don't have to commit to forever if you're not ready yet, if trying to commit to forever is triggering the behavior.  It's just 36 more weeks.  Count it down, if you have to, but you're strong enough to do this.\n\nPM me if you ever need a reminder.",
      "created_utc": 1597360017.0,
      "score": 29,
      "context": []
    },
    {
      "id": "g1dyke3",
      "author": "None",
      "body": "Can you access day treatment/ inpatient treatment for the first few months of your pregnancy, just to get you into the swing of things? Or get extra monitoring of your health/your babies health? I know in the UK you can get treatment if you're struggling with an ED during pregnancy, not sure how it works elsewhere though.",
      "created_utc": 1597363395.0,
      "score": 17,
      "context": []
    },
    {
      "id": "g1dvgib",
      "author": "diet_cupcake",
      "body": "If you don't have a therapist, I would highly recommend getting one. It's so much easier now too because so many places are doing telehealth. Talking about your fears and ways to deal with it and figure out things to do instead of purging would probably be very helpful.\n\n\nBest of luck. You've got this! And congrats on the pregnancy",
      "created_utc": 1597361756.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g1elz53",
      "author": "mij3i",
      "body": "I have a good friend whom I was in treatment with. It seemed to really help her. Maybe get an assessment done and see which level of care would be right for you? If treatment isn't an option I would recommend that you he completely open and honest with your supports about what you're struggling with so they can help you. Try as hard as possible yo distract yourself after meals.  I know the urge to purge is so, so strong, and I also know thay you are capable of getting through it. You're stronger than you know 💛",
      "created_utc": 1597376362.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g1dymxn",
      "author": "marabo33",
      "body": "My mom was bulimic during both of her pregnancies and told me and my brother that she felt really guilty about the purging. I’m sure she curtailed it as much as she could. We were healthy when born. The real issue was when we got older, her ED really messed with how we deal with food, and still does to this day. Know that you can only do your best, and that your best will change depending on the day and the circumstances. 💕",
      "created_utc": 1597363434.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g1f2r1i",
      "author": "justblippingby",
      "body": "I’m not bulimic, but I’m a recovering anorexic. I can never recover for myself for very long, I have to do it for the people I love; a reason more important than myself. Your baby is a miracle and I’m sure you already love him/her very much and want them to be okay. When you think about purging, think about your love and longing for your baby and stay clean for them. Someone else commented that you don’t have to stay clean forever because that’s really, really hard, but right now make your baby your focus. \n\nPicking up a positive hobby like drawing/painting, knitting, reading, etc. could be a helpful distraction when you feel the urges coming on. Also, try to spend more time with your husband and friends if you can. Having people there will give you someone to interact with and potentially keep you from purging long enough for those urges to go away or weaken.\n\nI really wish you the best with your pregnancy and recovery <3",
      "created_utc": 1597388914.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1dvt36",
      "author": "the_scientist52",
      "body": "I don't have a lot of specific advice, but I wanted to say\n\n1) Congratulations!! \n\n2) Please try not to be so hard on yourself.  Eating disorders are complex illnesses and it makes sense that you're having trouble stopping behaviors immediately.  It's evident that you really care about your children and this baby is already so lucky to have you as a mother!  Give yourself grace and keep identifying healthier ways that you can use to cope when the desire to purge comes up.  Distraction can be a really good one to help you ride out the urges!  Reminding yourself of what you're fighting for is also a great one, but try to use it positively rather than a way to cause intense guilt.  I believe in you!",
      "created_utc": 1597361936.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g1do9gc",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597358100.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1gmtai",
      "author": "0ldScxrs",
      "body": "Not my proudest moments but I've purged a lot during my pregnancy. The baby takes what it needs from your body. You're the only one suffering from the effects of purging.  I'm not condoning or promoting it but yknow how it is. Try to purge as little as possible. But don't feel too guilty ♡",
      "created_utc": 1597425483.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1gomuu",
      "author": "daydreaming96",
      "body": "I am 9 months pregnant with my baby girl.  First ever pregnancy also. I have been dealing with bulimia also for a few years now. Before I got pregnant I decided to start a new page by myself and begin getting better. I had stopped purging and binging completely for over 8 months before pregnancy but due to a lot a of stress I had 1 or 2 slip ups before I got pregnant and I have been totally fine since. I didn’t really do anything that special because I had given myself 8 months to cut out that behaviour it gets ingrained in your brain the more you do it the more you feel you need to do it. The less you do it the easier it becomes. I eat healthy meals also.",
      "created_utc": 1597426279.0,
      "score": 2,
      "context": []
    }
  ]
}