{
  "id": "iapvh9",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597572240.0,
  "title": "Request: I'm so sick of this. But I don't know if I can stop.",
  "selftext": "Hi everyone.\n\nI struggled with a restrictive ED three years ago, made full physical recovery in the meantime, but basically, this summer, I'm finding myself in a relapse.\n\nI've lost more weight than I intended, and unfortunately, I like it, and I want to keep going. Intuitively, I know this is toxic thinking. I know this is my ED brain trying to win over my real brain, so I wonder why I can't just stop.\n\nI went on vacation a few weeks ago with my lovely boyfriend and it was so nerve-wracking for me. If we were going to have a meal out, that's all I would generally allow myself to have because I was so anxious not knowing the calorie counts of those meals. Tomorrow, we are celebrating our one year anniversary, and of course having a meal out will be involved, so I've already figured out a way I can keep myself from eating hardly anything the rest of the day.\n\nLately I've been getting worse, intentionally skipping meals, or replacing meals with very light snacks to create a larger deficit. I know this is bad. I know this is harmful. I hate fighting the hunger, going to bed feeling like I have zero energy left in me, feeling so anxious about anything food related. My body image is so damaged that I feel like the only way I can like it is if I become underweight again, but even I know this won't be true. There's never a light at the end of the tunnel with an ED.\n\nI just want to genuinely enjoy my anniversary with my sweetheart without being so anxious and guilty about eating, or having to worry about starving myself to make up for that one outing. He knows about what's been going on and is trying his best to be very helpful, but I can tell at this point that he's getting frustrated that it just seems like a dead end because I'm so hesitant to take his advice when he simply just tells me to eat more. Why is it so hard for me to do that? Is that how bad this has gotten?\n\nI just don't know what I can do. I want to have a better body image and I want to stop being so obsessive my food intake and weight, but I feel like I can't have both of those at the same time. I don't really know what I'm looking for in this post other than just to rant, but maybe someone can give me some insight that I can't see myself.\n\nTL;DR: I am so sick of this ED mindset but I don't know how to quit, but I feel like it's getting the way of enjoying my life and could ruin my relationship if I don't get this under control. I hate this so much but it's taking me over.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iapvh9/request_im_so_sick_of_this_but_i_dont_know_if_i/",
  "score": 71,
  "num_comments": 9,
  "comments": [
    {
      "id": "g1qdrug",
      "author": "None",
      "body": "I don't know if this helps ... but I've been reading about how the starved brain becomes rewired, and thinking about about how that means that when we 'feed' the ED thoughts, we are really just taking ourselves further down the path ... It sounds like you are just there - seeing yourself with toes over the edge but still not in the dark place ... I think you know inside that you are worth the fight. It's evident in the fact that you posted, how you described what is happening. \n\nActionable steps, then: \n\nFor the anniversary, and for yourself and the relationship with the person you want to have in your life - please consider not taking the 'deny all day to have dinner' route. Nourish yourself to the best of your ability. \n\nFor the relationship you want to have with someone you care about - nourish that, too. Leverage the medical support you can get and as often and loudly as you can, recognise that you have (till now) fed those ED thoughts and now it's being a raging, petulant brat but \\*you are the parent of you here and what you say goes.",
      "created_utc": 1597583531.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g1qiire",
      "author": "jeabgrenouille",
      "body": "You physically recovered, but did not rewire your brain. It looks like other people left you some good advice for what to do in the short term. I would suggest, if you haven't already, reading Tabitha Farrar's book(s) and checking out her YouTube videos and podcasts. She is very blunt and makes recovery pretty simple, I'd say (even though it's still difficult to do... she just makes it less complicated) and she talks a lot about how to rewire your brain and how important that is.",
      "created_utc": 1597586806.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g1r5aum",
      "author": "idance4",
      "body": "Unfortunately, it’s just going to be super hard. Opposite actions and exposure therapy were huge in my recovery. That’s what I use now when I feel a relapse coming on. I’ve been in recovery for 10 years and I can confidently say it gets WAY easier to fight it. But before you go any farther, and even though it feels good, keep doing the right thing. Your anxiety will follow. The more you expose yourself to not restricting, the easier it gets. You can do it!",
      "created_utc": 1597599559.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1q1san",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597572240.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1tvidc",
      "author": "sko03",
      "body": "I'm so sorry that you're beautiful moment is being eclipsed by intrusive ED thoughts. That's just miserable. I can really identify with so much of what you're saying. I had a relapse which went from summer 2019 to about March of this year when I decided to tell my partner and my therapist.\n\nFor me I can't just \"eat more\" because it's a much deeper issue. In my head I feel good about myself when I eat less (ideally nothing at all), and I feel horrible about myself when I eat more (even a little). I feel like I've accomplished something and mastered something when I'm in control of my hunger and eating, and then when I'm losing weight I have something else to feel proud of. I like the secret. I like the control. And that's a majority of the ED thinking for me.\n\nI had to get real help from a professional because I can't do it alone. I have tried in the past, and it hasn't worked. This is also the first time I told someone while actively restricting. In the past I've only mentioned it like \"yeah I used to have an ED...\" The fact that you're posting here is HUGE to me and shows that you care about yourself and want some kind of change",
      "created_utc": 1597659181.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1q8cf5",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1597579065.0,
      "score": -3,
      "context": []
    },
    {
      "id": "g1tfnyj",
      "author": "monikacherie",
      "body": "Um are you seriously posting this stuff on an ED page? You do know many people have issues with extreme calorie counting right? Also I don’t think this forum is to give unsolicited dieting advice without prefacing that you aren’t a professional (I have no idea what you do) or the fact that the op should maybe see their treating team for advice on what they should eat.  You don’t know their weight or anything about them so this is extremely inappropriate",
      "created_utc": 1597651643.0,
      "score": 1,
      "context": [
        {
          "id": "g1q8cf5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1597579065.0
        }
      ]
    },
    {
      "id": "g1uj81w",
      "author": "poopppppper",
      "body": "Sure,we’ll the OP posted here asking for advice so everyone is chiming in.She did say that when she goes out to eat,that’s the only thing she eats for the day and honestly everyone knows that’s really unhealthy.A lot of advice from ED recovered people is “opposite action”.Will that work?Yes 100%,it will Ensure you get rid of the Ed voice if you keep fighting it Everyday.Heres the thing,I recovered from ED as well,and I used to be very very annoyed or anxious when I go out to eat with the family because its either I sit and watch them eat or I eat the whole house down,there’s no in between.Reason why I gave the advice that I did,is because it sets a bench mark to help Ensure one doesn’t eat the whole house down.Is it healthy for Ed people to gain weight?(taking myself into account) yes it was,I was really on the verge of killing myself and gaining the weight was good for me physically.But get this,on the mental note,it freaking wasn’t.Seeing such a fast weight gained literally messed with my mind completely and it took me down a dark path.If OP were to do that,as in just eat that meal in the restaurant and nothing else,will power will run out soon and she will end up from one end of an eating disorder to the other like I did.I don’t want her to feel the same way as I did and that’s why I gave her that number bench mark.Does it mean she has to follow it?HELL NO.Its just an idea to help her ease her way through her life,because that helped me.It might or might not work for her and it’s up to her to make the decision whether or not to follow.",
      "created_utc": 1597668069.0,
      "score": 1,
      "context": [
        {
          "id": "g1q8cf5",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1597579065.0
        },
        {
          "id": "g1tfnyj",
          "author": "monikacherie",
          "body": "Um are you seriously posting this stuff on an ED page? You do know many people have issues with extreme calorie counting right? Also I don’t think this forum is to give unsolicited dieting advice without prefacing that you aren’t a professional (I have no idea what you do) or the fact that the op should maybe see their treating team for advice on what they should eat.  You don’t know their weight or anything about them so this is extremely inappropriate",
          "created_utc": 1597651643.0
        }
      ]
    }
  ]
}