{
  "id": "ibbdy8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597658924.0,
  "title": "Request: Mental Hunger vs. Mindless Eating?",
  "selftext": " \n\nHey guys,\n\nI'm wondering how to differentiate between mental hunger and mindless eating. A little backstory: I'm working with my psychologist and nutritionist on increasing my calories, and have stopped weighing my food, tracking things in MFP, etc. I'm focused on giving myself bigger portions than what I would normally, and my goal is to honestly regain my hunger cues and trust my body's signals again. I'm feeling good, although still very early on in recovery...like 3 weeks in.\n\nThe biggest thing I'm noticing though is just mindless eating. I'm not necessarily thinking about food and then just eating (which is what I think mental hunger is, right?), but rather, if food is simply there I'll just start eating it. Not because I'm hungry, not because I like it/it's a food I want to eat, but eating it just because. To me, that feels more like mindless eating, but I honestly have no idea at this point because my hunger cues are just so effed up.\n\nHave you guys experienced this before? Is there a difference between mindless eating vs. mental hunger when in recovery? And if so, is there a way to limit the mindless eating and be more intentional?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ibbdy8/request_mental_hunger_vs_mindless_eating/",
  "score": 50,
  "num_comments": 5,
  "comments": [
    {
      "id": "g1unr60",
      "author": "the_scientist52",
      "body": "To me, mindless eating (which normal eaters do sometimes too!) is when you're eating a bowl of popcorn, chips, etc. while watching TV and before you know it, you've eaten a lot more than you typically would or an amount that makes you uncomfortably full.  From my experience it's usually more about the *amount* of a food that you eat--you actively decide to eat it, but lose track of how much you actually consume.  Mental hunger, on the other hand, influences your decision to *start* eating.  Maybe the food sounds good, maybe it's because your body was restricted from that particular food for so long, or maybe it's because your body was restricted in general and wants nutrients wherever it can get them.\n\nIt sounds like what you're going through is more along the lines of mental hunger.  I can see where it might feel like a mindless eating issue, but I think it's more likely that the mental (or maybe even physical) hunger is there but you're having trouble recognizing it.  So you may not realize that you're physically hungry or mentally wanting the food, but you are.    I'm thinking this especially because of how early in recovery you are--mental hunger is something that a lot of people experience until their bodies have been restored/stable for an extended period of time.\n\nAnyway, this is all just my (non-professional) take on it based on my own experiences/opinions.  At any rate I'd recommend that when these eating episodes happen, try to take some time to get more in tune with how you body is feeling and what thoughts you're having.  That will help you get a better idea of what's going on leading up to the eating.",
      "created_utc": 1597669557.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g1uki2x",
      "author": "poopppppper",
      "body": "Yes I’ve experienced this before.Mental hunger comes when you have restricted the foods you’ve deemed as “bad” for a very very Long time.So once you lift those restriction,you will want to eat everything,even when you are not hungry.Mindless eating on the other hand is when that particular food sounds good to you like I could put a whole cake in front of you,a box of cookies,a whole pizza on the dinner table with your family,and u really crave cake,so you have maybe 3-4 slices,even tho 1-2 was enough for you.Thats mindless eating,you aren’t phased by the pizza or the cookies but all you wanted was cake.Mental hunger however will cause you to eat everything in front of you.To limit mindless eating,all you got to do is just eat your planned meals,but if you are hungry for let’s say a slice of cake,eat that slice of cake and pair it with a fruit to fill you up.Enjoy that slice of cake and make a mental note that if you want you can have it tomorrow again",
      "created_utc": 1597668481.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1tuvwf",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597658924.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1vx489",
      "author": "bellasuperstring",
      "body": "Just curious as I am learning as I go, too... \n\nWhen you talk about mental hunger are you differentiating that from emotional eating? As in you feel a certain way so you go to the food to soothe yourself? Or is that different from what you're saying?",
      "created_utc": 1597686145.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1wlhnz",
      "author": "wh0youwit",
      "body": "You are in recovery. Eat. When you are in recovery there is not a single reason to not eat if you feel like it. When I was in recovery I thought I had a problem with emitional eating, I did not. This is supposed to happen, good luck:)\n\n\nhttps://youtu.be/d1iB7S0min0",
      "created_utc": 1597695881.0,
      "score": 1,
      "context": []
    }
  ]
}