{
  "id": "ibmrwg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597697895.0,
  "title": "Request: Starting to eat again, are these feelings okay?",
  "selftext": "I’ve recently spent 4 months being underweight and not eating enough (definitely malnourished) and certainly lost 15% of my body weight over that time, I’ve started eating again within the past 5 days and my stomach is so bloated and I feel full all the time and not hungry and slightly sick, is this normal? I’m guessing it’s my stomach trying to adjust but I have no experience with anything like this and I’m so scared I’ve done something wrong and my body will suffer, any advice would be so helpful thank you! (I’m sorry if this isn’t the place or right format, I wasn’t too sure where to get help) x",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ibmrwg/request_starting_to_eat_again_are_these_feelings/",
  "score": 51,
  "num_comments": 8,
  "comments": [
    {
      "id": "g1wu6nu",
      "author": "Over-Gain1100",
      "body": "This happens to everyone!  It's part of the process.  Eventually it will stop.",
      "created_utc": 1597698650.0,
      "score": 21,
      "context": []
    },
    {
      "id": "g1x02qx",
      "author": "jeabgrenouille",
      "body": "Yes, I I've heard that a lot of people have experienced that. I didn't, but we aren't all the same. My understanding is that our digestion system adapts to starvation and restriction and so it can become slow and poor, but if you keep eating, it will adapt to having food again and become normal again. Bloating becomes less and less and less the longer you eat without restriction",
      "created_utc": 1597700916.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g1x5mk5",
      "author": "assassin-mythic",
      "body": "Hi!! I have also gone through a period of under eating followed by a period of what my doctors refer to as \"weight restoration\". I definitely know what you mean about the bloating and feeling sick and such because I felt the same way. I had a lot of bowel problems and went #2 a lot more (sorry if thats tmi). My doctor said that it was just my body adjusting to a larger volume of food and that it was normal and to be expected to feel this way. Its just part of your body adjusting and feeling safe again. My issues starting going away week by week and I stopped feeling super bloated after about a week and a half or so. Good Luck in your process and know you are doing the right thing for your body and yourself ❤️",
      "created_utc": 1597703613.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g1x6yxk",
      "author": "nooorecess",
      "body": "yeah it is annoying but very common. and just remember that trying to keep on track with your meal plan/weight restoration (rather than dipping in and out of restricting/ED habits) makes the uncomfortable transition stage less drawn out. obviously relapse and slip-ups are part of the recovery process, but the allure of a bloat/cramp-free lifestyle can be a great motivator when you need one",
      "created_utc": 1597704285.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g1x9sfe",
      "author": "None",
      "body": "Stomach issues are completely and totally normal, your body needs to get used to digesting the right amount of a variety of foods again, and your brain will take a little while to figure out hunger/fullness hormones too. Plus there's the psychological side of it- if you're focussing on/ worrying about the food in your tummy then that can feel a bit uncomfortable. It wont be long term! Make sure to drink liquids (especially electrolyte type drinks and a good multivitamin if you've been restricting for so long, it'll just make the transition a bit smoother because things can get a bit out of whack when people start eating again. If you're very underweight/have any other symptoms I'd probably say it'd be worth it to get someone to keep an eye on your bloods as a precaution because re-feeding issues can happen sometimes, but if you feel otherwise ok then that's probably not an issue). But yeah, general rule of a thumb, good amounts of liquid, a decent multivitamin and mint tea, and it should resolve itself within a few weeks <3",
      "created_utc": 1597705729.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g1xo8es",
      "author": "FunkyBlueMohawkBird",
      "body": "Hey love, first off— I hope you have the guidance of a therapist and a dietician. They will be immensely supportive and let you know what to expect and help you navigate emotions and physical changes. :) \nAlso, yes totally normal. Your body is not used to getting enough food, so digestion is slow at first and your body wants to hold onto every bit of nourishment and hydration. The bloating and water retention is uncomfortable, but it’s also temporary and bearable. A lot of girls in treatment are prescribed miralax for constipation, so that helps with keeping things moving and it’s natural (not a stimulant like laxatives people with EDs normally abuse) \nYour appetite is also not really to be trusted initially, which is why it’s great to have a nutritionist who will tell ya how much you need to eat (a lot!). A portion that makes you feel like you are overfull and almost nauseous might only be about a 5 out of 10 on the hunger/fullness scale for somebody who doesn’t restrict! That blew my mind when I was restoring. \nSending you hugs and sweet vibes. Proud of you for taking this important step into your life!",
      "created_utc": 1597713679.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2109qy",
      "author": "taylorjones10",
      "body": "Yes this is so normal. During the beginning of my recovery I was extremely bloated after almost everything I ate and my stomach was constantly uncomfortable. It’s just the process of your stomach and body adjusting to the increased intake of food. It definitely gets better though. After about a month or so for me it reduced a lot and became easier to manage. What you’re doing is really important and it can be a very challenging process but it’s so worth it and you should be proud of yourself for doing it!",
      "created_utc": 1597782164.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1wrsr7",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597697895.0,
      "score": 1,
      "context": []
    }
  ]
}