{
  "id": "ibxy3b",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597743808.0,
  "title": "Request: my eating has become disordered and i need advice/opinions on how i can fix it!",
  "selftext": " \n\ni was extremely overweight growing up and due to a health condition caused by my weight, i joined WW to shift the weight. i am now a normal weight for my height and i have noticed that (of no fault to WW), my relationship with food has went from one extreme to another.\n\ni find that i look forward to eating and am very stringent about when i do so. however i am restricting my calories far too much and i don’t feel comfortable eating anything that’s deemed more than around x points (small #) on WW. i am now far too anxious to eat much and my family have noticed and become extremely pushy and frustrated and are constantly nagging me to eat more. if i try, i just get anxious and have even been brought to tears at how stressed i am at the prospect of eating.\n\ni have seen my GP and she has referred me to counseling. however, i feel as if i still need to make changes in the meantime. i cannot afford to see a dietician/nutritionist, so this is my best (and uneducated) bet.\n\ni do not feel comfortable coming off any kind of diet/tracking system completely. i have considered coming off of WW entirely and using myfitnesspal to count calories. the main benefit is not considering points when eating may help me eat different things and potentially increase my calorie intake (gradually, of course, as i can imagine my metabolism is too damaged to go up to my TDEE maintainence number so quickly anyway) and along with counselling, may help my damaged relationship with food. when i proposed this to my family, they were very against it due to my success on WW.\n\ni was wondering if i could get any external and objective opinions on if this would be a good idea? i am also very open to other suggestions! thank you for reading if you got this far!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ibxy3b/request_my_eating_has_become_disordered_and_i/",
  "score": 54,
  "num_comments": 3,
  "comments": [
    {
      "id": "g1z0blp",
      "author": "None",
      "body": "Hey OP, I don’t know how old you are, but you don’t have to involve your family in your medical and wellness decisions if you can avoid it. If they don’t approve of your choices, that’s their business - this is about *you* and your relationship with food & your body. Your mental health is important. You can remind your family that Weight Watchers has been criticized by [a lot of people](https://www.livestrong.com/article/337442-the-dangers-of-weight-watchers/) as promoting unhealthy habits and ways of thinking. \n\nRemember that WW is a brand that wants to make money off of you; its ultimate aim as a company is to profit, not to ensure the health of well-being of the people who buy into its products. \n\nAlso, can I just say that I’m proud of you for recognizing disordered thinking habit/behaviors & seeking out help? Because that can be so hard to do! Definitely talk to your counselor, but in the meantime, make sure that your food intake is not harming your body. If you’re a teenager in particular, the amount of food you’re eating may not be providing you with the nutrients you need. Obviously I can’t offer specific advice as I don’t know your medical history nor am I a professional, but there are a ton of resources out there about [intuitive eating](https://www.intuitiveeating.org/10-principles-of-intuitive-eating/) and fixing your relationship with food. I know you said you’re not comfortable with the idea of not being on a diet/meal plan, but try learning more about it and see if it’s something you might be up for in the future.\n\nFor some people, switching from one way of restriction to another (eg counting calories) can have counterproductive effects of making them more focused on food. \n\nMy advice would be, don’t worry about tackling this on your own, meet with the counselor and share your thoughts with them. Make sure you’re eating enough to damage your body. You don’t have to feel guilty or ashamed of eating food. \n\nBest of luck!",
      "created_utc": 1597751343.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g1zijg2",
      "author": "the_scientist52",
      "body": "I would STRONGLY advise against moving to myfitnesspal/calorie counting.  Counting calories is really no different than counting WW points, and it still comes with the same amount of obsession and rigidity.\n\nInstead I'd suggest going to a dietitian who has experience treating eating disorders/disordered eating.  They can provide you with a meal plan so that you still feel like you have guidance/structure, but without counting specific nutrition facts.  A lot of dietitians use the exchange system where instead of having x calories per day, they instruct you to have x grains, x proteins, x fats, etc.  I'll be honest--this type of meal plan can feel rigid at times, and eventually moving off of a plan altogether might be challenging.  But, it's possible.  And this ensures that you're getting adequate nutrition while you're working through everything else (I'm so glad you're open to counseling btw--such a great idea!)\n\nExchange-based meal plans can also help you increase variety because if your dinner calls for x grains, you could have rice, pasta, sandwich bread, etc. and it would all count the same.  So you could really work on getting more comfortable with a wider variety of foods again!   Meal plans like this have the extra benefit of helping you start to see what a normal meal/snack looks like, which can be hard to do on your own if you have a disordered relationship with food.  Your body also gets used to eating appropriately-sized meals/snacks.  So when you do eventually start to move away from a plan, you'll have a good foundation for what a typical day of eating for you would look like.\n\nThis is the type of meal plan I've been on throughout my recovery and it isn't always perfect, but if you're someone who still feels you need guidance but is looking to start healing your relationship with food, I think it would be a good place to start.",
      "created_utc": 1597761968.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1ysh7h",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597743808.0,
      "score": 1,
      "context": []
    }
  ]
}