{
  "id": "iby0z3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597744262.0,
  "title": "Request: My girlfriend won't eat in front of me because she says she isn't comfortable. Worried she has an ED",
  "selftext": "I started dating an amazing woman 5 months ago and I really see a future between us. She has brought up some mental health struggles and I always do my best to listen and talk to her about them. We have a very good communicative relationship and I would always say I'm very supportive of her. She says how being together has helped her a lot and she's very happy. She is in her mid/late 20s and looks to be very healthy. Every time we eat together, she barley touches her food. For example, we went to a very popular restaurant that is difficult to get reservations at. We ordered a burger and a pizza to split. When the food arrived, she had maybe 4 bites of the burger (I had to push her to eat some at all) and didn't eat any pizza. We brought some home and watched a movie after. She said she was hungry and wanted a slice, I heated it up in the oven and gave her one and then she took half a bite. It seems to be like this every time we eat together. Evertime I try to get her to eat more, she says it takes her time to get comfortable eating in front of someone. I try my best to let here know she should be comfortable in front of me. Last night, she brought up how she struggled with anorexia and bulimia in high school for a few years and stopped getting her period as a result. I am very concerned for her and want nothing more than for her to be happy and healthy. I really am trying my best to be supportive and there for her. It has started to create a lot of stress because like I said, I worry for her health. Last night she said she \"wished she could be skinny for me\". She is 5'3 and maybe xxx pounds (a normal and healthy weight). I told her how great she looked but she kind of shrugged it off. What can I say or do to be supportive and not judgmental to here? Does it sound like she still has an eating disorder? Any and all advice is greatly appreciated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iby0z3/request_my_girlfriend_wont_eat_in_front_of_me/",
  "score": 41,
  "num_comments": 7,
  "comments": [
    {
      "id": "g1z1lw8",
      "author": "sarasarasarasara--",
      "body": "What your gf said to you sounds much like something I would say, or at least think, and I haven't acted on my Ed in years (for the most part). Truth about eds generally is that they don't vanish. You learn how to cope with them and how not to relapse, but they never truly go away. There's always going to be a disordered thought in the back of your mind. Maybe that's what your gf is going through. If she normally eats and is staying at a healthy, stable weight, I would say she probably isn't acting on the disordered thoughts. It could just be she isn't comfortable with other people watching her eat. I would just say, when she does eat in front of you, don't focus on the behaviour. Hell, avoid the subject completely if possible. Even if you mean well, if you tell her stuff like \"look who's finally eating something\" or \"I'm so glad you're eating in front of me\" or even worse stuff like \"look, you're doing it. It wasn't that hard after all\" you would get a really negative response and she would feel even more self conscious about it",
      "created_utc": 1597752384.0,
      "score": 21,
      "context": []
    },
    {
      "id": "g209pwf",
      "author": "saffronnectar",
      "body": "Perhaps try turning your backs to one another while you eat. This allows you to eat together without the pressure of being looked at and could hopefully start to make her feel more comfortable eating around you.",
      "created_utc": 1597771433.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g1yswjs",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597744262.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2131qr",
      "author": "justblippingby",
      "body": "I used to be anorexic and have had many relapses and am actually in one right now. It’s always been hard for me to eat in front of people after that initial experience. My ed was never super extreme or lengthy so that’s probably why it’s a little easier, but currently since I’m back in it eating in front of someone is the last thing I want. I have friends that I want to tell because I just want them to understand, but you can never really get it until you experience it. It’ll take her a while to adjust (you said it’s only been 5 months so far). Maybe try taking her out and getting less challenging foods rather than burgers and pizza",
      "created_utc": 1597783423.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g1z7dzg",
      "author": "None",
      "body": "Completely second this! Anything that brings attention to eating is often a huge no, even if it's meant well. E.g. my dad once whispered \"you don't HAVE to finish your salad\" to me in front of my entire family in a cafe while they all nodded in approval. Sounds like a a thoughtful thing to say because I was eating slowly right? But ED brain takes that as \" why is everyone is watching me eating, everyone is judging, they'll all think I'm disgusting and greedy if I finish this salad, they've said I don't have too, does that mean I'm not allowed? Stop stop stop looking at me please I don't know what to do because I genuinely want to eat it and told myself I could but now everyone is staring and judging, and do I have food around my mouth?? Was that last bite too big?? Is their too much food in my mouth at once?? Are they judging me for not leaving the eggs? Please.Stop.Looking.At.Me\".   \n\n\nSo yeah basically tread really carefully, and have those conversations AWAY from the table. Obviously communication is important, but I'd say it's much better to be asking questions than making observations, and try to keep those questions non-emotionally loaded.",
      "created_utc": 1597756413.0,
      "score": 5,
      "context": [
        {
          "id": "g1z1lw8",
          "author": "sarasarasarasara--",
          "body": "What your gf said to you sounds much like something I would say, or at least think, and I haven't acted on my Ed in years (for the most part). Truth about eds generally is that they don't vanish. You learn how to cope with them and how not to relapse, but they never truly go away. There's always going to be a disordered thought in the back of your mind. Maybe that's what your gf is going through. If she normally eats and is staying at a healthy, stable weight, I would say she probably isn't acting on the disordered thoughts. It could just be she isn't comfortable with other people watching her eat. I would just say, when she does eat in front of you, don't focus on the behaviour. Hell, avoid the subject completely if possible. Even if you mean well, if you tell her stuff like \"look who's finally eating something\" or \"I'm so glad you're eating in front of me\" or even worse stuff like \"look, you're doing it. It wasn't that hard after all\" you would get a really negative response and she would feel even more self conscious about it",
          "created_utc": 1597752384.0
        }
      ]
    },
    {
      "id": "g20pt5v",
      "author": "houston_veronica",
      "body": "that's really creative! I also wonder if watching a movie together while eating would be a good idea. I don't know how this all would resolve in the end, if what we are suggesting is actually helpful, but i would think it's worth trying.",
      "created_utc": 1597777822.0,
      "score": 2,
      "context": [
        {
          "id": "g209pwf",
          "author": "saffronnectar",
          "body": "Perhaps try turning your backs to one another while you eat. This allows you to eat together without the pressure of being looked at and could hopefully start to make her feel more comfortable eating around you.",
          "created_utc": 1597771433.0
        }
      ]
    },
    {
      "id": "g20t1xm",
      "author": "saffronnectar",
      "body": "That's a really good idea! Sometimes when you can't solve things right away, so it's good to come up with strategies to kind of creatively work with an issue until it can be resolved.",
      "created_utc": 1597779157.0,
      "score": 1,
      "context": [
        {
          "id": "g209pwf",
          "author": "saffronnectar",
          "body": "Perhaps try turning your backs to one another while you eat. This allows you to eat together without the pressure of being looked at and could hopefully start to make her feel more comfortable eating around you.",
          "created_utc": 1597771433.0
        },
        {
          "id": "g20pt5v",
          "author": "houston_veronica",
          "body": "that's really creative! I also wonder if watching a movie together while eating would be a good idea. I don't know how this all would resolve in the end, if what we are suggesting is actually helpful, but i would think it's worth trying.",
          "created_utc": 1597777822.0
        }
      ]
    }
  ]
}