{
  "id": "id7evc",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1597917312.0,
  "title": "Request: I’m not sure if I have an ED or just unhealthy habits",
  "selftext": " \n\nI used to be a big binger and I’ve dieted for what feels like half my life and I’ve never been happy about myself, but the last year I’ve started having to lie about what I’m eating because I know it’s not enough and it worries me So basically, I’m pretty sure I could stop at any time but I try to eat about xxx cals (extremely small amount) from when I wake up to until dinner where I eat just a normal dinner and then I don’t eat again till the next morning. I could eat more if I wanted to but I don’t want the extra calories, so I don’t. I know that I obsessively calorie count, I was really upset with myself the other day because I had a few squares of chocolate and found out it was x cals and I’d already eaten my limit for the day, i have a full list on my notes app of all the calories in different treats and food I like, to the point where I could tell you how much calories is in almost anything. I also weigh myself every morning - I know I shouldn’t but I can’t help myself, I need to know and it ruins my day if it goes up even by a 1/4 pound . But I want to lose weight and if I was happy with my body I wouldn’t need to do this.. so I don’t think I do have an ED because I will stop when I’m happy with my body. Im not able to restrict when my family gets a takeaway or something, whatever portion I get I always eat it all, I have not enough will power to only eat half or something, and then I just fell really upset with myself. I’ve now lost a significant amount of in about 2-3 months and the less I eat the better I feel about myself and I’m worried that’s wrong but I don’t think I want to stop",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/id7evc/request_im_not_sure_if_i_have_an_ed_or_just/",
  "score": 43,
  "num_comments": 11,
  "comments": [
    {
      "id": "g276akp",
      "author": "classic_moth",
      "body": "\"I'll stop when I'm happy with my body\"\nThis is a very typical thought in people with disordered habits. It's a lie we tell ourselves... \n\nWhen WILL you be happy? It's a tough pill to swallow for all of us that being happy with our bodies does not correlate with a number on the scale.\n\nAlso, defining wether or not your \"qualify\" as having an ED is not important here. You admit to having this obsession and it's causing you anxiety: that's a problem in and of itself. You're worthy of recovery, at any stage and any point.",
      "created_utc": 1597918374.0,
      "score": 27,
      "context": []
    },
    {
      "id": "g277vej",
      "author": "justblippingby",
      "body": "That’s exactly what I did when I became anorexic. I only ate up to a certain number as well, but I wouldn’t allow myself to enjoy other foods. I do think you might have a problem if you’re getting anxiety about what you eat and how much. It can be hard to differentiate between just wanting to lose weight so badly and being mentally sick with an ED. \n\nPlease talk to a doctor because this has been going on for a while it seems. They can give you tips about how to eat healthier and exercise moderately to achieve your goals in a healthier way while simultaneously healing your mind from your negative habits",
      "created_utc": 1597919963.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g27q92f",
      "author": "FoxiiFighter",
      "body": "PLEASE TALK TO SOMEONE. While nobody here can diagnose you, I can tell you that you've got some very big red flags happening. I'm not sure how old you are, but if you are a minor, PLEASE talk to a trusted adult and start getting these behaviors under control. If your an adult - Find a therapist that specializes in ED (Even if you aren't sure you have one), and make an appt asap.",
      "created_utc": 1597932759.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g2862tu",
      "author": "bpurly",
      "body": "Lol everyone with an ED thinks they'll stop when they're magically happy with their body. But the thing is, you're never happy. It never stops. If you don't already have an ED you are quickly hurtling towards developing one. Please talk to a doctor knowledgeable in EDs or a therapist.",
      "created_utc": 1597940328.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g2759um",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1597917312.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g282ejf",
      "author": "None",
      "body": "You can always take the quiz listed on the OA website to discover if you have a problem.  Oa.org, go to getting started & take the quiz.",
      "created_utc": 1597938561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g296lp7",
      "author": "PJDoubleKiss",
      "body": "The amount of calories you're eating will do a little more to confirm that this is an ED but it sounds a lot like an ED to me. \n\n\"it ruins my day if it does up even by 1/4 of a pound\"",
      "created_utc": 1597956353.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2a0q0s",
      "author": "pewpkween",
      "body": "Every time I catch myself thinking “I’d be so much happier if I was back down X number of pounds”, I have to remind myself that when I WAS that weight I was equally unhappy with my body",
      "created_utc": 1597971645.0,
      "score": 5,
      "context": [
        {
          "id": "g276akp",
          "author": "classic_moth",
          "body": "\"I'll stop when I'm happy with my body\"\nThis is a very typical thought in people with disordered habits. It's a lie we tell ourselves... \n\nWhen WILL you be happy? It's a tough pill to swallow for all of us that being happy with our bodies does not correlate with a number on the scale.\n\nAlso, defining wether or not your \"qualify\" as having an ED is not important here. You admit to having this obsession and it's causing you anxiety: that's a problem in and of itself. You're worthy of recovery, at any stage and any point.",
          "created_utc": 1597918374.0
        }
      ]
    },
    {
      "id": "g2ko93v",
      "author": "None",
      "body": "Hi thank you for your help, I am the person who wrote this post, It has been going on a long while but I feel sick if I eat at times other than a small snack in the morning and dinner time, I have lost all appetite for any eating that doesn’t stick to my “plan”",
      "created_utc": 1598181791.0,
      "score": 2,
      "context": [
        {
          "id": "g277vej",
          "author": "justblippingby",
          "body": "That’s exactly what I did when I became anorexic. I only ate up to a certain number as well, but I wouldn’t allow myself to enjoy other foods. I do think you might have a problem if you’re getting anxiety about what you eat and how much. It can be hard to differentiate between just wanting to lose weight so badly and being mentally sick with an ED. \n\nPlease talk to a doctor because this has been going on for a while it seems. They can give you tips about how to eat healthier and exercise moderately to achieve your goals in a healthier way while simultaneously healing your mind from your negative habits",
          "created_utc": 1597919963.0
        }
      ]
    },
    {
      "id": "g2ko1i8",
      "author": "None",
      "body": "Hi, I’m the person who wrote this post, thank you both for your input. I know I wasn’t happier when I was a certain weight but having been bigger now once I get there I think I’ll be a lot more grateful.\nI’m trying my best to prevent this getting any worse and I’m trying to eat atleast two full meals a day now but I’m taking it slow",
      "created_utc": 1598181637.0,
      "score": 1,
      "context": [
        {
          "id": "g276akp",
          "author": "classic_moth",
          "body": "\"I'll stop when I'm happy with my body\"\nThis is a very typical thought in people with disordered habits. It's a lie we tell ourselves... \n\nWhen WILL you be happy? It's a tough pill to swallow for all of us that being happy with our bodies does not correlate with a number on the scale.\n\nAlso, defining wether or not your \"qualify\" as having an ED is not important here. You admit to having this obsession and it's causing you anxiety: that's a problem in and of itself. You're worthy of recovery, at any stage and any point.",
          "created_utc": 1597918374.0
        },
        {
          "id": "g2a0q0s",
          "author": "pewpkween",
          "body": "Every time I catch myself thinking “I’d be so much happier if I was back down X number of pounds”, I have to remind myself that when I WAS that weight I was equally unhappy with my body",
          "created_utc": 1597971645.0
        }
      ]
    },
    {
      "id": "g2kov4z",
      "author": "justblippingby",
      "body": "Hey, I’m glad I was able to help a bit. \nYou’re feeling sick because your stomach shrinks if you’re not eating much, so when you do eat, you’ll get fuller faster but it’s not enough nutrition. If you’re actively trying to recover, start by eating more frequently, but not bigger portions just yet because you’ll end up with a horrible stomach ache. \n\nHaving an eating plan (AKA rules) is harmful because it’ll increase the level of your food anxiety and the sooner you try to challenge those thoughts, the easier it’ll be to recover. It’ll be really hard, but it’s worth going to someone to talk about the mental side of it and having a support system. \n\nI know this is a lot of info and it probably sounds harsh, but ED’s are fatal and you need to be aware of how dangerous they are to fall into",
      "created_utc": 1598182249.0,
      "score": 2,
      "context": [
        {
          "id": "g277vej",
          "author": "justblippingby",
          "body": "That’s exactly what I did when I became anorexic. I only ate up to a certain number as well, but I wouldn’t allow myself to enjoy other foods. I do think you might have a problem if you’re getting anxiety about what you eat and how much. It can be hard to differentiate between just wanting to lose weight so badly and being mentally sick with an ED. \n\nPlease talk to a doctor because this has been going on for a while it seems. They can give you tips about how to eat healthier and exercise moderately to achieve your goals in a healthier way while simultaneously healing your mind from your negative habits",
          "created_utc": 1597919963.0
        },
        {
          "id": "g2ko93v",
          "author": "None",
          "body": "Hi thank you for your help, I am the person who wrote this post, It has been going on a long while but I feel sick if I eat at times other than a small snack in the morning and dinner time, I have lost all appetite for any eating that doesn’t stick to my “plan”",
          "created_utc": 1598181791.0
        }
      ]
    }
  ]
}