{
  "id": "if0q1j",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1598177163.0,
  "title": "Request: my girlfriends bulimia has come back",
  "selftext": " \n\nmy girlfriends bulimia has come back, I need to know everything and anything there is about it so that I can support and help her as much as possible\n\nUp until recently when my girlfriend told me she struggled with bulimia in the past, I didn’t know what it was. And now she believes it’s starting to come back again.\n\nI want to be able to give her as much support and help as I can. I’m starting to do some research about it because I want to understand what she’s going through and what I can do to help. I need to know a list of do’s and dont’s, what she needs to hear and what she doesn’t. Anything that’ll help.\n\nThe first example happened today when she told me how she binged at dinner which was her first meal of the day and felt like purging afterwards because she felt really sick. I simply didn’t know what to tell her except for highlight the fact that I’m not mad or annoyed at her. If there’s any information or tips I can get about bulimia and how to support someone that struggles with it then I’d highly appreciate that. Thank you in advance.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/if0q1j/request_my_girlfriends_bulimia_has_come_back/",
  "score": 69,
  "num_comments": 7,
  "comments": [
    {
      "id": "g2kl2gc",
      "author": "None",
      "body": "It's a really tricky one because it's different for everyone. Firstly just want to say that you're doing really well already- so many people jump into the angry/defensive/confrontational approach, or start making assumptions about what's going on in people with EDs brains, which really doesn't help at all. Generally just being there for her is the most important thing that you can do.\n\nOther than that, ask questions (though definitely try to avoid talking about anything ED related over meals unless she initiates the conversation). She's not likely to be annoyed at you for asking how you can support her. She might not have an answer yet, but it opens up the conversation, shows that you're willing to help and (if she's not already) gets her thinking about what support might actually be beneficial. E.g. some people find it helpful to have a meal plan, to have someone sit with them after meals, or to have only a few days worth of food in the cupboard. Personally, when I feel like purging the most helpful thing is just being able to curl up next to my fiance (feels kind of like a safe space to me where I can focus on being warm and cosy), so we have a sort of unspoken deal that if I tell him I'm having a bad day he'll deal with me invading his personal space and cuddle me for an hour or so while we watch a film or something. In contrast, other people might need some time alone to just sit and deal with the anxiety, so it's really important to ask! On a side note, \"feeling sick\" can be a gentler way of saying fullness related anxiety, but that could be different for her.\n\nI guess some good starting questions to help you understand would be: Does she know what's triggered the relapse? What would help prevent it happening (or reduce the frequency of it happening) in future? And would she like you to take an active role in her recovery, or simply just be there for support while she figures things out herself? But honestly the most important thing is to be non-judgemental and try to understand what's going on in her world. EDs can be super confusing to people who haven't experienced them, we get that.\n\nSo basic do's and don'ts that would apply to most people:Do ask questions and try to understand what's going on for her, every ED is different.Do try to figure out of she wants you to help, and if so, what she thinks would help.Don't do the above over meals (try to chose a more neutral time), and try to avoid making a big deal during mealtimes in general. Often the most helpful thing at those times is just having someone acting normal, it's a great distraction. If you're openly fixating on what/how she's eating then it ends up as a double whammy of anxiety. Obviously if she's openly super distressed or brings up the conversation herself it's different, but use your judgement.",
      "created_utc": 1598179477.0,
      "score": 25,
      "context": []
    },
    {
      "id": "g2m1mj7",
      "author": "sailingthepacific",
      "body": "What I describe here is what I experience, this doesnt necessary count for everyone:\nI personally also struggle with bulimia and I'll usually only \"really binge\" when I am alone. I find it very helpful to just be with my bf and eat with him on his eatingpattern (so 3 main meals a day) for my pattern is totally disturbed when I'm alone. With him I can just stick to the eating times and also I won't really binge with him near because I just would feel very ashamed and (most importantly) I also usually won't feel the urge that much cuz his presence distracts me from the obsessive thinking about food all the time. Just the way he doesn't care about food that much makes me worry less about it myself and sometimes i find myself completely forgetting about thinking about it (which is an amazing feeling). Also when we eat he just acts normal, whether i eat little or much, it's all okay and not commented on. WHICH I FIND CRAZY IMPORTANT. It makes me sooo anxious when people say ANYTHING about (the lack of) something I'm eating. And yes, it helps when he just asks me what he can do or whether there is anything he can do. I'd say just act like always when around your gf, tell her she is beautifull (underrated but has a massive effect on me personally, i just will feel less like the purging or restricting immediately cuz i will be less anxious that i might look fat, but don't do it forced, aka when you're eating or something or when it's too obvious about the ED or something) and that you love her. I hope it helped a lil, but again- this is my perspective not necessarily your gf's. Wish you the best of luck but imo your gf already has a great start of getting rid of the ed again by having you as a caring bf.",
      "created_utc": 1598208648.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g2m75g6",
      "author": "JumpintohellX13",
      "body": "Eating disorders are very difficult for people to understand. I think you are doing all the right things by learning about the disorder. Like some of the others have said, ask your girlfriend what she finds helpful and what might trigger her. I know that meal planning is really helpful and making sure to keep healthy snacks on hand. Also, just being there to listen to her is very helpful. This may sound silly, but when my eating disorder acts up, my Husband will call it \"ED.\" Seeing my eating disorder as another person, helps me take back control. When \"ED\" shows up, my Husband will say something like, \"fuck off ed and leave my wife alone.\"  I always laugh and it helps me a lot to know that my Husband see's me as more then my eating disorder.",
      "created_utc": 1598211451.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g2kinh9",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1598177164.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2lmuou",
      "author": "dynamic_screwball",
      "body": "Redacted, wrong sub",
      "created_utc": 1598201434.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2nqqar",
      "author": "tssclay",
      "body": "i don’t have any advice but thank you so much for being such a good partner. i can tell you love her so much.",
      "created_utc": 1598242087.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3fw16a",
      "author": "None",
      "body": "It varies from person to person. I'm suffering from the same. I can definitely say don't push her to eat, focus on helping her mind and the rest tends to follow. Purposely ordering KFC or something is a no. Knowing that you're there for her and she's not a burden is really important. \n\nHow is she with fruits and veggies? Or smoothies?",
      "created_utc": 1598854493.0,
      "score": 1,
      "context": []
    }
  ]
}