{
  "id": "if0tax",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1598177652.0,
  "title": "Request: How do you stop feeling guilty about eating?",
  "selftext": " \n\nHey, I’m looking for tips. Basically, I don’t know if I have an ED and tbh I don’t think I do but I definitely need some help with some  healthy habits. How do you stop feeling guilty about eating? I have been restricting intensely for a long time now and this week I’ve had quite a few slip ups and I’m trying to move past it and pretend I don’t care but it’s eating me alive, I feel like I have to make up for it and that I’m disgusting. My sister made me a cheesecake, because i used to love eating it, and so obviously I had to have it, and I do love cheesecake and couldn’t control myself and I binged for about two days and now I’m so upset because I’ve probably gained so much weight. How do you guys move on and stop feeling so guilty?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/if0tax/request_how_do_you_stop_feeling_guilty_about/",
  "score": 39,
  "num_comments": 5,
  "comments": [
    {
      "id": "g2kq651",
      "author": "None",
      "body": "Hi everyone, I’m the person who wrote this post and I just wanted to add that since I wrote this, I have now weighed myself and I’m still losing weight and I’m really confused, I thought I was eating mountains but not only did I not gain, I acctually lost weight.. I’m concerned that my perceptions of what is a lot and what isn’t is gone",
      "created_utc": 1598183188.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g2lartt",
      "author": "DragonflyStunning",
      "body": "you need food to live! if you restrict too much you’ll feel sick all the time, have no energy, be grumpy, etc. I get over the guilt by thinking “i need this food to live a good healthy life” if i binge a little i tell myself it happens and that it’s ok to slip up, it’s over with and there’s nothing i can do to fix it, if i restrict because i binged i’m just gonna binge again. \n\nMaybe cruise the internet to look up ways to get over guilt from eating because it doesn’t do anything to just think about it all the time and stress!",
      "created_utc": 1598195848.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2m7114",
      "author": "None",
      "body": "Following",
      "created_utc": 1598211387.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g2kj398",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1598177652.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2l6qul",
      "author": "Tigrella17",
      "body": "It sounds like you’re losing that perception. Your post includes some classic descriptions of ED behavior. Restriction, guilt after eating, not enjoying foods you used to love etc. Many people with EDs don’t believe they have them because of warped body image or perceiving their ED behavior as necessary or normal. The behaviors you describe are not normal things that everyone does, they are disordered. It would be worth talking to a therapist or registered dietician about.",
      "created_utc": 1598194069.0,
      "score": 6,
      "context": [
        {
          "id": "g2kq651",
          "author": "None",
          "body": "Hi everyone, I’m the person who wrote this post and I just wanted to add that since I wrote this, I have now weighed myself and I’m still losing weight and I’m really confused, I thought I was eating mountains but not only did I not gain, I acctually lost weight.. I’m concerned that my perceptions of what is a lot and what isn’t is gone",
          "created_utc": 1598183188.0
        }
      ]
    }
  ]
}