{
  "id": "ig96gk",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1598349581.0,
  "title": "Request: I was wondering the difference between Anorexia Binge purge and bulimia",
  "selftext": "I hope this doesn't bother anyone, but i am currently struggling with some type of ED and, although i probably shouldn't, I was trying to 'self-diagnose' so i could deal with it better and try to avoid falling deeper into it. So if anyone could explain the difference between the two disorders it would be greatly appreciated, as what i've read online has confused me a bit. thanks!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ig96gk/request_i_was_wondering_the_difference_between/",
  "score": 49,
  "num_comments": 21,
  "comments": [
    {
      "id": "g2siz2s",
      "author": "Iscariiot",
      "body": "Honestly all EDs are more or less the same. But the “difference” I’ve found is that people with B/P Anorexia tend to b/p less than those with Bulimia, or its a secondary characteristic to restriction. I was diagnosed Anorexia b/p because I would purge without really binging- a normal meal felt like a binge to me. So it was an action I took to compensate along with restriction.\n\nLike I said tho- they’re all basically the same. People with “atypical anorexia” are just Anorexic but don’t meet the arbitrary weight requirement. With that logic, I was “atypical” for a year before hitting regular anorexia. That’s like saying you don’t have cancer until the chemo makes your hair fall out. It’s all stupid.",
      "created_utc": 1598357596.0,
      "score": 54,
      "context": []
    },
    {
      "id": "g2sjdjb",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1598357897.0,
      "score": 18,
      "context": []
    },
    {
      "id": "g2sk6z0",
      "author": "None",
      "body": "According to the DSM-IV the only real difference is BMI. People with BP subtype anorexia meet the criteria for bulimia but also have a BMI that puts them in the anorexia category.",
      "created_utc": 1598358492.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g2sqx99",
      "author": "None",
      "body": "Anorexia-BP is a subtype of anorexia. Meaning that the person with this would fit the criteria for anorexia but would also engage in bulimic behaviors to a clinically significant enough extent to note it. \nBulimia is where the person primarily binges and purges and may (actually probably more likely than not) exhibit some anorexic behaviors but not clinically significant enough to meet that criteria.\nA person who doesn’t meet criteria for anorexia or bulimia but primarily participates in anorexic behaviors with or without bulimic tendencies would be labeled as EDNOS. EDNOS, although without the criteria of being underweight and perhaps at less risk than the full blown bulimic for major issues, shouldn’t be discounted as any less dangerous than the other two. In fact, it may be more detrimental in the long run. \n\nSubtypes exist because both sets of behaviors are dangerous but need to be treated differently to avoid making the other worse. We shouldn’t get hung up on semantics as patients imo.",
      "created_utc": 1598362790.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g2sakon",
      "author": "elliebobs0",
      "body": "hi, the main differences between anorexia and bulimia is that usually people who have anorexia severely reduce their food intake to lose weight. People who have bulimia eat an excessive amount of food in a short period of time, then purge or use other methods to prevent weight gain (eg. vomiting)",
      "created_utc": 1598349865.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g2sab4s",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1598349581.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2smr1x",
      "author": "jeabgrenouille",
      "body": "I'll be honest and say that I don't think it matters. Often people move from anorexia to bulimia and back or the other way around. It's all restriction, ultimately, for a lot of people (restrict too much=body gets impulses to feast=binge=shame=restrict). Anorexia on its own doesn't really have that binge piece in there, but a lot of people ultimately develop that behaviour, even if they didn't do it in the beginning (not everyone. I didn't, but maybe I would have if I'd been sick longer). \n\nI started recovery without knowing I had anorexia specifically, and I was even admitted to the hospital without hearing anyone use that word. My mom finally told me what the doctors had been telling her I had. To me, anorexia was just a thing on doctor Phil, and I was just doing my special talent (restricting). That is to say, you don't need to have a name for it to get better. It might even be better because you won't identifying yourself by your illness and therefore have a harder time letting go of it.\n\nUltimately, whether it is anorexia or bulimia, the solution is to stop restricting completely and challenge fears to rewire your brain.\n\nNot a doctor, just sharing my understanding",
      "created_utc": 1598360243.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2v2n4p",
      "author": "seatangle",
      "body": "I was diagnosed with both at different points. My behaviors were exactly the same. The only difference is physical - BMI/weight loss and possible loss of menstruation for binge purge type anorexia.",
      "created_utc": 1598403511.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2v4z2z",
      "author": "kimberley112",
      "body": "It comes down to medical distinction. There's a lot of overlap between the both so they made EDNOS(eating disorder not otherwise specified) which accommodates people who either don't fit into the extremes which qualify diagnosis or when there's too much overlap.  It doesn't invalidate you're disorder if u have ednos tho. I found from personal experience that getting this diagnosis made me think I wasn't even good at being anorexic but I learned to realise it was because I had a mixed disorder instead.  Don't worry too much about a label for the disorder but rather try to figure out behaviours and coping mechanism",
      "created_utc": 1598404804.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2vt2b1",
      "author": "darkpartofyrheart",
      "body": "i hate the ways these are measured bc by some metrics “anorexia subtype binge/purge” is defined by how often a binge/purge or purging itself occurs vs consistency of restricting. by other metrics it’s by weight. i have received the “anorexia sub type b/p” diagnosis mostly by my weight, not my frequency of binging & purging. i know it’s necessary for treatment protocols, but it fucking sucks for people who deal with these symptoms at any level. no matter what it winds up making people feel like their ED isn’t valid or they aren’t sick enough :/ sending love and positive thoughts your way 🤍",
      "created_utc": 1598419665.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g2sfo8n",
      "author": "coldlick",
      "body": "If youre underweight and purposefully restrict (usually below 800 calories) to lose more weight, you have anorexia.\n\n If you're a normal weight and purposefully restrict, you have atypical anorexia.\n\n If you eat an excessive amount of food (binge) and purge it (either by doing a lot of exercise, self-induced vomiting or laxatives) you have bulimia. \n\nIf you don't binge and just purge something you ate, you have a purging disorder. \n\nYou can be anorexic and have bulimia, it's basically if you binge and purge while you're restricting and underweight.",
      "created_utc": 1598354919.0,
      "score": 0,
      "context": []
    },
    {
      "id": "g2tgl1e",
      "author": "Enilodnewg",
      "body": "Your description of yours is exactly what I'm struggling with. Full meals feel like a binge. Not always though, but it's been worse recently, my dog is my world and I had to drop her off at the vets yesterday afternoon, she's having surgery to remove like 7 lumps today. Just sebaceous cysts, basically the lumps are blackheads, it happens fairly often with her breed. But I'm still incredibly nervous and stressed so it set me off. I was doing better until this. \n\nAlso, solid comparison, and it is really stupid. I understand the need for doctors to know the difference when it comes to more dangers faced by lower weights, but it makes it harder for people to get the help they need. Especially in the US where insurances have specific requirements for treatments.",
      "created_utc": 1598374262.0,
      "score": 15,
      "context": [
        {
          "id": "g2siz2s",
          "author": "Iscariiot",
          "body": "Honestly all EDs are more or less the same. But the “difference” I’ve found is that people with B/P Anorexia tend to b/p less than those with Bulimia, or its a secondary characteristic to restriction. I was diagnosed Anorexia b/p because I would purge without really binging- a normal meal felt like a binge to me. So it was an action I took to compensate along with restriction.\n\nLike I said tho- they’re all basically the same. People with “atypical anorexia” are just Anorexic but don’t meet the arbitrary weight requirement. With that logic, I was “atypical” for a year before hitting regular anorexia. That’s like saying you don’t have cancer until the chemo makes your hair fall out. It’s all stupid.",
          "created_utc": 1598357596.0
        }
      ]
    },
    {
      "id": "g2skawp",
      "author": "None",
      "body": "I think I disagree with that. I had BP anorexia and the BP side of it was very severe and felt like my primary behaviour. It was just classed as anorexia because of my weight.",
      "created_utc": 1598358570.0,
      "score": 8,
      "context": [
        {
          "id": "g2siz2s",
          "author": "Iscariiot",
          "body": "Honestly all EDs are more or less the same. But the “difference” I’ve found is that people with B/P Anorexia tend to b/p less than those with Bulimia, or its a secondary characteristic to restriction. I was diagnosed Anorexia b/p because I would purge without really binging- a normal meal felt like a binge to me. So it was an action I took to compensate along with restriction.\n\nLike I said tho- they’re all basically the same. People with “atypical anorexia” are just Anorexic but don’t meet the arbitrary weight requirement. With that logic, I was “atypical” for a year before hitting regular anorexia. That’s like saying you don’t have cancer until the chemo makes your hair fall out. It’s all stupid.",
          "created_utc": 1598357596.0
        }
      ]
    },
    {
      "id": "g2txicp",
      "author": "DaughterofBabylon",
      "body": "See, I was always under the assumption this was originally an EDNOS (eating disorder not otherwise specified). When I suffered from it, it was under that umbrella as \"purging disorder\" but it was in the DSM 4.",
      "created_utc": 1598382209.0,
      "score": 2,
      "context": [
        {
          "id": "g2siz2s",
          "author": "Iscariiot",
          "body": "Honestly all EDs are more or less the same. But the “difference” I’ve found is that people with B/P Anorexia tend to b/p less than those with Bulimia, or its a secondary characteristic to restriction. I was diagnosed Anorexia b/p because I would purge without really binging- a normal meal felt like a binge to me. So it was an action I took to compensate along with restriction.\n\nLike I said tho- they’re all basically the same. People with “atypical anorexia” are just Anorexic but don’t meet the arbitrary weight requirement. With that logic, I was “atypical” for a year before hitting regular anorexia. That’s like saying you don’t have cancer until the chemo makes your hair fall out. It’s all stupid.",
          "created_utc": 1598357596.0
        }
      ]
    },
    {
      "id": "g2v2urx",
      "author": "seatangle",
      "body": "This isn’t true, I had b/p type anorexia for many years and binged every day, sometimes multiple times per day. The only real difference in diagnostic criteria is in regards to weight.",
      "created_utc": 1598403630.0,
      "score": 2,
      "context": [
        {
          "id": "g2siz2s",
          "author": "Iscariiot",
          "body": "Honestly all EDs are more or less the same. But the “difference” I’ve found is that people with B/P Anorexia tend to b/p less than those with Bulimia, or its a secondary characteristic to restriction. I was diagnosed Anorexia b/p because I would purge without really binging- a normal meal felt like a binge to me. So it was an action I took to compensate along with restriction.\n\nLike I said tho- they’re all basically the same. People with “atypical anorexia” are just Anorexic but don’t meet the arbitrary weight requirement. With that logic, I was “atypical” for a year before hitting regular anorexia. That’s like saying you don’t have cancer until the chemo makes your hair fall out. It’s all stupid.",
          "created_utc": 1598357596.0
        }
      ]
    },
    {
      "id": "g2t5sjj",
      "author": "None",
      "body": "Yes exactly. I think it's so far that people feel anorexia is more serious then OSFED or bulimia or any other eating disorder. The diagnostic criteria is just there to aid the treatment. Someone under weight needs different treatment then someone overweight but they are just as valid, dangerous and harmful. People just put anorexia on a pedestal unfortunately as like the main diagnosis but every eating disorder is dangerous as fuck and just as miserable.",
      "created_utc": 1598369715.0,
      "score": 5,
      "context": [
        {
          "id": "g2sjdjb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1598357897.0
        }
      ]
    },
    {
      "id": "g2ti60r",
      "author": "bingumarmar",
      "body": "This is exactly right and exactly stupid. I majored in psychology for my undergrad and I remember in one of the psych classes we learned about ED's and I asked my professor \"wait, so the only difference between Anorexia B/P and Bulimia is the weight?\" and they said yes. I then (very subtly) brought up how this is completely backwards as why would a *mental* disorder differ solely because of a physical characteristic? Don't remember what my professor said but I remember not being satisfied with the answer and dropping it.\n\nStill doesn't make sense to me, especially because most people associate Anorexia=super skinny person who doesn't eat and Bulimia=eat and throw up. Totally alienates so many people who have these disorders but don't fit into those boxes",
      "created_utc": 1598374983.0,
      "score": 1,
      "context": [
        {
          "id": "g2sjdjb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1598357897.0
        }
      ]
    },
    {
      "id": "g2vcszh",
      "author": "Stranger-Little",
      "body": "I was diagnosed with anorexia b/p but I am not underweight. A little over weight actually. I feel bulimia more fits the way I feel based on my past habits and present. It’s also easier to find info and explain to people bulimia than anorexia b/p",
      "created_utc": 1598409074.0,
      "score": 1,
      "context": [
        {
          "id": "g2sjdjb",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1598357897.0
        }
      ]
    },
    {
      "id": "g2skiec",
      "author": "Iscariiot",
      "body": "Oh my bad. Honestly it’s ALL arbitrary BS then. Because it’s not fair to classify based on weight.",
      "created_utc": 1598358718.0,
      "score": 17,
      "context": [
        {
          "id": "g2siz2s",
          "author": "Iscariiot",
          "body": "Honestly all EDs are more or less the same. But the “difference” I’ve found is that people with B/P Anorexia tend to b/p less than those with Bulimia, or its a secondary characteristic to restriction. I was diagnosed Anorexia b/p because I would purge without really binging- a normal meal felt like a binge to me. So it was an action I took to compensate along with restriction.\n\nLike I said tho- they’re all basically the same. People with “atypical anorexia” are just Anorexic but don’t meet the arbitrary weight requirement. With that logic, I was “atypical” for a year before hitting regular anorexia. That’s like saying you don’t have cancer until the chemo makes your hair fall out. It’s all stupid.",
          "created_utc": 1598357596.0
        },
        {
          "id": "g2skawp",
          "author": "None",
          "body": "I think I disagree with that. I had BP anorexia and the BP side of it was very severe and felt like my primary behaviour. It was just classed as anorexia because of my weight.",
          "created_utc": 1598358570.0
        }
      ]
    },
    {
      "id": "g2t5dsm",
      "author": "None",
      "body": "My dr said the only reason anorexia has a weight criteria was that underweight at a certain BMI is treated differently medically then someone who is overweight with restrictive eating. He said OSFED or bulimia is just as valid as anorexia, they just have differing treatments.",
      "created_utc": 1598369551.0,
      "score": 10,
      "context": [
        {
          "id": "g2siz2s",
          "author": "Iscariiot",
          "body": "Honestly all EDs are more or less the same. But the “difference” I’ve found is that people with B/P Anorexia tend to b/p less than those with Bulimia, or its a secondary characteristic to restriction. I was diagnosed Anorexia b/p because I would purge without really binging- a normal meal felt like a binge to me. So it was an action I took to compensate along with restriction.\n\nLike I said tho- they’re all basically the same. People with “atypical anorexia” are just Anorexic but don’t meet the arbitrary weight requirement. With that logic, I was “atypical” for a year before hitting regular anorexia. That’s like saying you don’t have cancer until the chemo makes your hair fall out. It’s all stupid.",
          "created_utc": 1598357596.0
        },
        {
          "id": "g2skawp",
          "author": "None",
          "body": "I think I disagree with that. I had BP anorexia and the BP side of it was very severe and felt like my primary behaviour. It was just classed as anorexia because of my weight.",
          "created_utc": 1598358570.0
        },
        {
          "id": "g2skiec",
          "author": "Iscariiot",
          "body": "Oh my bad. Honestly it’s ALL arbitrary BS then. Because it’s not fair to classify based on weight.",
          "created_utc": 1598358718.0
        }
      ]
    },
    {
      "id": "g2skqsd",
      "author": "None",
      "body": "Yeah I definitely agree that it's BS tbh. I think it's just an easier way to classify it because, for example, people who are low weight and BP are likely to have different health problems than those who BP and are at a normal weight, so it's easier for medical professionals to know what complications to look out for.",
      "created_utc": 1598358883.0,
      "score": 8,
      "context": [
        {
          "id": "g2siz2s",
          "author": "Iscariiot",
          "body": "Honestly all EDs are more or less the same. But the “difference” I’ve found is that people with B/P Anorexia tend to b/p less than those with Bulimia, or its a secondary characteristic to restriction. I was diagnosed Anorexia b/p because I would purge without really binging- a normal meal felt like a binge to me. So it was an action I took to compensate along with restriction.\n\nLike I said tho- they’re all basically the same. People with “atypical anorexia” are just Anorexic but don’t meet the arbitrary weight requirement. With that logic, I was “atypical” for a year before hitting regular anorexia. That’s like saying you don’t have cancer until the chemo makes your hair fall out. It’s all stupid.",
          "created_utc": 1598357596.0
        },
        {
          "id": "g2skawp",
          "author": "None",
          "body": "I think I disagree with that. I had BP anorexia and the BP side of it was very severe and felt like my primary behaviour. It was just classed as anorexia because of my weight.",
          "created_utc": 1598358570.0
        },
        {
          "id": "g2skiec",
          "author": "Iscariiot",
          "body": "Oh my bad. Honestly it’s ALL arbitrary BS then. Because it’s not fair to classify based on weight.",
          "created_utc": 1598358718.0
        }
      ]
    }
  ]
}