{
  "id": "igw2hm",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1598435919.0,
  "title": "Request: I’ve been feeling down and projecting it into my body image",
  "selftext": "Hello all,\n\nI’ve been feeling the struggle lately and I just wanted to let it out. I’ve struggled with EDNOS for most of my life and it comes in waves. Right now I’m not restricting or purging or self harming or food avoidance, but I think about doing those things a lot lately. I’ve just been feeling really down and I don’t know why. I just feel like I look at my body and I hate everything I see. My legs look too fat. My stomach is too fat and my hips are too big.\n\nWhat do you all do when you start feeling really, really down?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/igw2hm/request_ive_been_feeling_down_and_projecting_it/",
  "score": 44,
  "num_comments": 4,
  "comments": [
    {
      "id": "g2wan8p",
      "author": "brima24",
      "body": "Engaging in hobbies that give me 1) something to fixate on other than my body and food 2) a sense of accomplishment when I hit goals related to that hobby. So for me, I picked up skating recently, and it's a great way to engage my body that feels good. I also really like sewing and baking. And the physical end product of any creativity related task can be really rewarding and validating.",
      "created_utc": 1598437288.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g2wuvt0",
      "author": "VampireDetective",
      "body": "I think you're fucking awesome who's had these feeling and not letting them take control. Be proud of yourself that you've been able to have the thoughts but hasn't let them take action. That doesn't mean it isn't hard, it's hard af. But take a moment and pat yourself on the back for being honest about where you're at and the work you've put in to not start doing bad habits even though you've had the thoughts!!",
      "created_utc": 1598451763.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g2ylbqo",
      "author": "Prestigious-Menu",
      "body": "I think one thing I remind myself when I’m suddenly super negatively focused on my body is that I KNOW I’m doing it because of stress and my body hasn’t suddenly and drastically changed the way my attitude has. And then I distract myself from the thoughts.",
      "created_utc": 1598480966.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g2w9csh",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1598435919.0,
      "score": 1,
      "context": []
    }
  ]
}