{
  "id": "iiisnz",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1598660382.0,
  "title": "Request: I ate my fear food",
  "selftext": "Update from a while ago: I was sure I had an eating disorder and it turned out to be ARFID, but now I'm on my way to recovering! I ate one of my top fear foods, peanut butter. I developed ARFID from me panicking over peanut butter cookies at one point so this is a huge accomplishment for me! It was so good too, I can now eat more plus the peanut butter 😄 my ARFID surrounded my irrational fear of sudden allergic reactions and now that I ate that my next foods to try are honey nut cheerios, crab cakes and tuna, hopefully this turns out all well and I can eat normally again because my ARFID caused my OCD and it would be amazing to start getting better with my OCD too. I remembered fearing that I'd never be able to eat normally again thanks to the pandemic but I'm slowly getting there again and I can't believe what I'm doing since it's on my own along with therapy and my family helping me. It's so crazy but awesome 😄 thanks for reading!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iiisnz/request_i_ate_my_fear_food/",
  "score": 121,
  "num_comments": 8,
  "comments": [
    {
      "id": "g3735h1",
      "author": "honeyeyedbutts",
      "body": "That’s amazing, I’m so happy for you!",
      "created_utc": 1598663337.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g383hpw",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1598690874.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g36y5d2",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1598660382.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g37cf7j",
      "author": "smol_lydia",
      "body": "Proud of you!!!",
      "created_utc": 1598668939.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g37doxm",
      "author": "vampirebf",
      "body": "i’m so happy for you! peanut butter is one of my Bad Foods too",
      "created_utc": 1598669731.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g38fz83",
      "author": "wh0fuckingcares",
      "body": "Well done ♡♡♡ keep up the hard work",
      "created_utc": 1598703439.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g39be0b",
      "author": "stopitma",
      "body": "Yay!!! How will you celebrate? I felt so accomplished when I started eating my fear foods again. It's scary but it's such an exciting turning point in recovery.",
      "created_utc": 1598721119.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g39um4z",
      "author": "Coeurahge",
      "body": "Congratulations! Terrific and amazing... 😊",
      "created_utc": 1598729991.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3b9hz5",
      "author": "fireweed26",
      "body": "Congratulations!! Such great news to read:) Thanks for sharing!",
      "created_utc": 1598754267.0,
      "score": 1,
      "context": []
    }
  ]
}