{
  "id": "ija8xe",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1598780758.0,
  "title": "Request: Having trouble eating. Don't know what to do",
  "selftext": " \n\nI have never talked to anyone else about this before. I know I have an eating disorder. I had one when I was much younger and I know all the signs and tells of one. I just haven’t been able to talk to anyone about it because I don’t really want to recover, or at least, I don’t want to gain any weight.\n\nAbout two years ago, I developed a stomach issue where I would be nauseated and vomit all the time. I lost a lot of weight but never hated the way my body looked before or after. I went to multiple doctors and about 6 months ago, I found a doctor who helped me get on track to recover. The only problem is, I now don’t want to gain anymore weight. The vomiting has decreased immensely, but now I feel as though I need to vomit in order to maintain my current weight. So I make myself vomit- even if I eat something as small as an apple and peanut butter, I feel full and grossed out by myself and try to make myself throw up.\n\nI am trying to stop this eating disorder on my own because I honestly don’t think I can tell any of my friends or family. I just don’t want to tell them because even though I want to get better because it’s severely affecting my body ( I now have terrible GERD, am fatigued and light headed all the time, and am depressed because of it) I don’t want to gain weight because I love the way that I look now. I am so confident with myself and I haven’t felt this way for awhile.\n\nSo I just don’t know what to do. And I really don’t want to go to therapy for it or talk to anyone I know about it. I’d just like to figure out the best way to do it on my own.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ija8xe/request_having_trouble_eating_dont_know_what_to_do/",
  "score": 44,
  "num_comments": 2,
  "comments": [
    {
      "id": "g3c7b7s",
      "author": "FluffyPancakinator",
      "body": "Hi there. Sorry to hear you're going through this! :( and thank you for being brave enough to share, it's not easy. \n\nI guess all of us have eating disorders because we don't want to gain weight. Many of us have a crippling fear of gaining weight (myself included) which makes us do things like vomit, fast for long periods of time, or other unhealthy behaviours. \n\nWhat recovery tries to do is make it so we can maintain a healthy weight without resorting to binging / restricting / purging behaviours like vomiting etc. It's not really about 'gaining weight' as such. Its about being healthy without our lives being ruled by food, and bringing ourselves to a good mental and physical state that allows our bodies to function properly and keeps us healthy in the long term. \n\nThe key is to address why we feel so attached to losing weight, what weight means in terms of how we define our worth, and to understand why we have an unhealthy relationship with food.\n\nIt's a lot to deal with and process, but the key takeout is that recovery is much more to do with our mental health, making it so our lives don't revolve around food, and our body being healthy, rather than 'gaining weight' for the sake of it.",
      "created_utc": 1598781734.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g3c6e5e",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1598780758.0,
      "score": 1,
      "context": []
    }
  ]
}