{
  "id": "ijviee",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1598869579.0,
  "title": "Request: I’m so happy to be in recovery, but one thing no one talks about is how expensive it is...",
  "selftext": " \n\nI’m so happy to be in recovery, but one thing no one talks about is how expensive it is...\n\nwhen my eating disorder was at it’s worst, I would only eat at work, so my food costs were effectively zero.\n\nIt’s so nice to be cooking again & getting groceries for myself but it is a big financial adjustment. & with this pandemic, i’m making like half of what I used to.\n\nbut overall what is most overwhelming. is that i can’t afford to get myself new clothes to accommodate my new healthier body. wearing clothes that are too small for me is really damaging to my self esteem & my recovery. and not to mention extremely physically uncomfortable.\n\nright now I have 14 pairs of pants that no longer fit, & one single pair of stretchy pants that do.\n\n& with my shirts the only ones that fit me are my comfy pajama type shirts. or shirts that were once cutely oversized are now just an awkward fit.\n\nI’m surprisingly ok with my new body, it’s soft and curvy & cute ! but as soon as I put clothes on, i feel so incredibly ugly & unfashionable.\n\nI’m at a loss, I know that if I had nice clothes that fit I would feel soooo much better about recovering.\n\nBut I really can’t afford to get new clothes.\n\neven thrifting is a bit too expensive for me right now & I struggle to find clothes that fit properly & that are still nice. plus shopping can be somewhat triggering for me.\n\nbut I know I can’t be losing weight just to fit into these old clothes.\n\nnot sure if i’m looking for advice or not.\n\njust wondering if other people in recovery can relate & share their wisdom <3",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ijviee/request_im_so_happy_to_be_in_recovery_but_one/",
  "score": 142,
  "num_comments": 16,
  "comments": [
    {
      "id": "g3gbdh8",
      "author": "zyzpzflfww",
      "body": "You should sell your used clothes!",
      "created_utc": 1598870556.0,
      "score": 34,
      "context": []
    },
    {
      "id": "g3gd4je",
      "author": "houston_veronica",
      "body": "Check out Poshmark online for many options of gently used clothing; a wash is all it takes to be in great shape, just make sure you wait to buy things of super high value until you are at your set point -- which will happen when you can eat without restricting, to your point of satiety (you'll get stronger at reading hunger cues as time goes on), and there is a plateau on your weight in terms of you noting that clothing isn't getting tighter. If you are weighed by an MD or your RD, that's best - please don't weigh yourself at home.\n\nRecovery is costly, but so worth it.",
      "created_utc": 1598872268.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g3h5eh2",
      "author": "durrityo",
      "body": "Sell your old clothes then use the money at a thrift store it's good for the environment to recycle clothing and its normally cheaper and thrift stores normally have nicer clothes than people say.",
      "created_utc": 1598887218.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g3hl5zt",
      "author": "smd101989",
      "body": "Some food banks also give out clothing. It would be worth it to call a few around you and find out. I was happy when I found out that was a thing. If you find one, just bring your old clothes so give to them. That way you don't feel bad taking clothes you need.",
      "created_utc": 1598893321.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g3i4lea",
      "author": "None",
      "body": "What size clothing are you in need of? I might be able to send you some, please DM me. I am so happy to hear of your successes and I would hate for those reasons you have little control over to ruin your progress. I’m rooting for you!",
      "created_utc": 1598900724.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g3go763",
      "author": "MyPornAccountKady",
      "body": "If you can afford like two dollars here or there, I would definitely suggest checking out Goodwill's clothes - especially if you can find something with the sale color tag. I don't know if you have already, but it's been pretty great for my and my family's wardrobes when any of us haven't been in the greatest financial situation.",
      "created_utc": 1598880248.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g3gd599",
      "author": "CarelessBerry0",
      "body": "Hey there! It sounds like you’re doing well in your recovery and it’s really admirable. Clothes are one of my biggest issues too.\nSend me a dm - I’d like to help you out. x",
      "created_utc": 1598872288.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g3gaf20",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1598869579.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3iltkb",
      "author": "Rosenhansthud",
      "body": "I’m here too, fam. I have no idea how to buy jeans anymore.",
      "created_utc": 1598908193.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3ixnwk",
      "author": "annielovesbacon",
      "body": "I huuuugely relate to the clothes thing. it’s been my biggest trigger. like you said, I’m actually (mostly) okay with my body but putting clothes on makes me feel like shit. I can’t afford a new wardrobe but I can’t be naked so like?? what do I do? lol I’m sorry I don’t have advice but please know you’re not alone!",
      "created_utc": 1598913891.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3iy5uv",
      "author": "wdfchicka07",
      "body": "I can definitely relate and it is hard. Try selling your old clothes. You can probably find t-shirts and yoga pants or whatever at goodwill. Walmart is super cheap too! You're not alone but do the best you can.",
      "created_utc": 1598914159.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3iyt20",
      "author": "moonkingoutsider",
      "body": "Insanely expensive. Been battling this for 20ish years and still in therapy - $250/mo sometimes $375. But it’s worth it knowing I’m keeping myself healthy for my kids.",
      "created_utc": 1598914455.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3k0jse",
      "author": "Myodokaii",
      "body": "I'm in a similar boat. I was at a healthy weight in high school, and everything fit very comfortably. I am now quite overweight, and I had to throw away some clothes as a result - they were no longer wearable. Even a new pair of jeans can run me $20 at a cheap place, and $20 is a lot.\n\nI'm also on disability for an unrelated disability, and I just can't afford things at any time. I have to save up. I would love to be able to eat healthier, but my ED doesn't allow me to without getting sick, so it's a harsh struggle. Plus, the healthier foods tend to run more money.\n\nSolidarity, my friend.",
      "created_utc": 1598935434.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3kat84",
      "author": "None",
      "body": "wow this is so relatable. I’ve had to get new clothes three times in my recovery journey because I just keep gaining more weight from recovery binges. Makes me want to cry everytime I have to buy new clothes again. It sucks so much, spending so much money on clothes. I thrift because it’s cheaper, and I don’t trust my body will stay at the weight it’s a for long before I need new clothes again 😒",
      "created_utc": 1598944398.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3xgyjl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1599179602.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3ju63b",
      "author": "haloo_baloo",
      "body": "Nice idea! I’m definitely down to do the same :)",
      "created_utc": 1598931192.0,
      "score": 1,
      "context": [
        {
          "id": "g3i4lea",
          "author": "None",
          "body": "What size clothing are you in need of? I might be able to send you some, please DM me. I am so happy to hear of your successes and I would hate for those reasons you have little control over to ruin your progress. I’m rooting for you!",
          "created_utc": 1598900724.0
        }
      ]
    },
    {
      "id": "g4is0f9",
      "author": "longdoggosimon",
      "body": "If you’re in the UK I would be happy to send you clothes for free that would go to the charity shop anyways, if they’re the right size for you! I have way too many.",
      "created_utc": 1599629804.0,
      "score": 1,
      "context": [
        {
          "id": "g3xgyjl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1599179602.0
        }
      ]
    }
  ]
}