{
  "id": "ilezv3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1599078845.0,
  "title": "Request: My sister made me relapse. (Possible TW)",
  "selftext": "So to put in perspective I’ve been on and off my eating disorder. I have a sister and she’s always been so tiny compared to me and she knows this. It has been a year i was “clean” until today. We were out for lunch and i ordered the smallest size soup. She was telling me and my mom some chunky blonde girl in her sons class reminded her of me, and her son told her it was the chunky girls birthday and she made the comment to him “oh so it’s Maddies birthday” (I’m Maddie.) it made me feel sick to my stomach that not only did she call me fat, but made jokes about it with my nephew. I don’t want them to think of me like that. I immediately went to the bathroom to purge the little soup i had.  What would your advice be? Would you have said something back? :/ she makes comments like these all the time but this one was really bad.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ilezv3/request_my_sister_made_me_relapse_possible_tw/",
  "score": 101,
  "num_comments": 21,
  "comments": [
    {
      "id": "g3rpc4l",
      "author": "tomhall44",
      "body": "Your sister is toxic and you need to distance yourself from her.",
      "created_utc": 1599080370.0,
      "score": 96,
      "context": []
    },
    {
      "id": "g3s0i7z",
      "author": "canyonlands2",
      "body": "Your sister was intentionally being a POS and you need to talk to her about what she’s done because not only was it disrespectful and uncalled for, it was done with intent to hurt you. That’s unacceptable.\n\nThat being said, she didn’t make you relapse. You relapses because you were hurt by her cruel and unnecessary comments. But you need to take responsibility for what you’ve done. In recovery, you hit a ton of road blocks as I’m sure you understand from the long year of not purging. This comment just hit different and you coped with it destructively. Rarely do other people “make you” relapse. They can trigger you to take action, but that’s on you when you do that. I’m not saying that it was uncalled for, or makes you bad. But you need to own your actions. You already owned up to admitting you did it. Now you need to find the balance where you can get a hurtful comment and not relapse.",
      "created_utc": 1599085436.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g3rmf4i",
      "author": "None",
      "body": "Oh my god, I’m so sorry to hear that. That’s despicable. Don’t blame yourself for not standing up for yourself at the moment, but DEFINITELY bring it up with her. She needs a not-so-gentle dressing down.",
      "created_utc": 1599079283.0,
      "score": 19,
      "context": []
    },
    {
      "id": "g3rmhhw",
      "author": "_midsommar",
      "body": "This is horrible, she is bullying you plain and simple. What does your mom do when this happens? Does she just sit there and not hear it??",
      "created_utc": 1599079309.0,
      "score": 13,
      "context": []
    },
    {
      "id": "g3rqww5",
      "author": "o_elaine_g",
      "body": "give me her @ i just wanna talk 🤨",
      "created_utc": 1599081005.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g3s4vbt",
      "author": "None",
      "body": "I’m so sorry. Your sister sounds cruel and she’s teaching her son bad habits. I would speak up and point out at the least how sad it is that they can only identify this person with a negative description. I wish you the best. Please don’t be discouraged. You are worth it.",
      "created_utc": 1599087433.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g3s9lgh",
      "author": "victoriablaisdell",
      "body": "i would slap the skinny shit out of her",
      "created_utc": 1599089546.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g3sfme9",
      "author": "MoldySixth",
      "body": "I wish I could slap her lmfao... she’s dumb as hell for lording that over you and actively triggering you. She can stay as smug as she wants, no one wants a rotten egg like her.",
      "created_utc": 1599092286.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g3rpkfl",
      "author": "timeforbedplease",
      "body": "I'm so sorry this happened. I think you should be honest with her about how that statement affected you. She should know that her words bear weight, and that comments like that come at a great cost to your well being. You should definitely be straight forward, but avoid blaming her. Take this as an opportunity to educate her on how damaging remarks about weight can be to anyone, especially those with a history of ED.",
      "created_utc": 1599080455.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g3t3ee3",
      "author": "imgoodwithfaces",
      "body": "Sometimes it's easier to love them from afar. Where you don't feel scrutinized every second you are with them. The amount of stress/anxiety it causes is not worth it for you or your recovery.",
      "created_utc": 1599105521.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g3t49b5",
      "author": "SuingGodForAlimony",
      "body": "bro thats so shitty. If you can/want to, you can tell her hey thats not ok and it makes it really hard to deal with my eating disorder to think that way about my weight. Seriously, call her out, even if just for you.\n\nYour body doesn't dictate your value. You deserve to be respected and seen for who you are, especially by your family.",
      "created_utc": 1599106060.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g3t8qor",
      "author": "SophieRmama",
      "body": "Wow... that is fucked up... \nI know she's family, but she is toxic. Toxic people don't belong in our recovery path. I'm so sorry she acted out on HER insecurities, to make you feel bad...  that is a LOW blow. Please keep fighting. You are worthy of recovery. 💜",
      "created_utc": 1599109136.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g3rl8fq",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1599078845.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3uddrf",
      "author": "NaiveCareer",
      "body": "I'm so sorry you had to deal with that 😢\n\nI can relate to you since I've always struggled with being overweight my whole life and having close family members who are and always have been thinner than I am as well.\n\nI would say that it can help to distance yourself and/or go with little contact with your sister if it's possible. I'd also say that maybe some perspective change can help you as well. Know that you and your sister are completely different people. There is only one you in the whole world and its not your job to be thin. In the end, everyone just wants to be happy in their life and being thin won't guarantee happiness. I wish I had better advice I can give you but I hope you the best in recovering and growing as a person. 💚",
      "created_utc": 1599140372.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g3rs7j1",
      "author": "popcorn_enthusiast3",
      "body": "This^! To keep your recovery going, you need to distance yourself from anyone with a bad influence and that’s exactly what she is. She probably has issues of her own and feels better about herself by putting you down but it’s not your responsibility to deal with that. Tell her that you need to take a break from your relationship because she makes you feel bad about your weight. She might deny it but I think she is probably very aware of what she is doing",
      "created_utc": 1599081531.0,
      "score": 24,
      "context": [
        {
          "id": "g3rpc4l",
          "author": "tomhall44",
          "body": "Your sister is toxic and you need to distance yourself from her.",
          "created_utc": 1599080370.0
        }
      ]
    },
    {
      "id": "g3v08vu",
      "author": "IndieAcademic",
      "body": "Yes! I agree. You don't deserve that verbal abuse. It's hard, but you could draw a bright line and say you won't be in her presence if she is going to speak about anyone's body at all...because it's rude, immature, mean, and sets a horrid example for her son. If she says something like that about anyone, you are within your rights to just walk away, leave, excuse yourself...taking a stand about what's unacceptable.",
      "created_utc": 1599148195.0,
      "score": 3,
      "context": [
        {
          "id": "g3rpc4l",
          "author": "tomhall44",
          "body": "Your sister is toxic and you need to distance yourself from her.",
          "created_utc": 1599080370.0
        }
      ]
    },
    {
      "id": "g4ewji4",
      "author": "yiffing_for_jesus",
      "body": "In most cases I would agree with you, but given the fact that the sister made this comment intentionally and with the knowledge of OP’s illness, I think it’s fair to say she made OP relapse. That’s a pretty direct cause-and-effect series of events.",
      "created_utc": 1599540891.0,
      "score": 2,
      "context": [
        {
          "id": "g3s0i7z",
          "author": "canyonlands2",
          "body": "Your sister was intentionally being a POS and you need to talk to her about what she’s done because not only was it disrespectful and uncalled for, it was done with intent to hurt you. That’s unacceptable.\n\nThat being said, she didn’t make you relapse. You relapses because you were hurt by her cruel and unnecessary comments. But you need to take responsibility for what you’ve done. In recovery, you hit a ton of road blocks as I’m sure you understand from the long year of not purging. This comment just hit different and you coped with it destructively. Rarely do other people “make you” relapse. They can trigger you to take action, but that’s on you when you do that. I’m not saying that it was uncalled for, or makes you bad. But you need to own your actions. You already owned up to admitting you did it. Now you need to find the balance where you can get a hurtful comment and not relapse.",
          "created_utc": 1599085436.0
        }
      ]
    },
    {
      "id": "g3tk0bj",
      "author": "diiiiiiiizzzzzy",
      "body": "Me too. We’ll have a reallllllllll good chat.",
      "created_utc": 1599119194.0,
      "score": 4,
      "context": [
        {
          "id": "g3rqww5",
          "author": "o_elaine_g",
          "body": "give me her @ i just wanna talk 🤨",
          "created_utc": 1599081005.0
        }
      ]
    },
    {
      "id": "g3rplr1",
      "author": "dadbot_2",
      "body": "Hi so sorry this happened, I'm Dad👨",
      "created_utc": 1599080469.0,
      "score": -11,
      "context": [
        {
          "id": "g3rpkfl",
          "author": "timeforbedplease",
          "body": "I'm so sorry this happened. I think you should be honest with her about how that statement affected you. She should know that her words bear weight, and that comments like that come at a great cost to your well being. You should definitely be straight forward, but avoid blaming her. Take this as an opportunity to educate her on how damaging remarks about weight can be to anyone, especially those with a history of ED.",
          "created_utc": 1599080455.0
        }
      ]
    },
    {
      "id": "g3ucfsh",
      "author": "FluffyPancakinator",
      "body": "Looool, this!! Where she @ doe",
      "created_utc": 1599140014.0,
      "score": 5,
      "context": [
        {
          "id": "g3rqww5",
          "author": "o_elaine_g",
          "body": "give me her @ i just wanna talk 🤨",
          "created_utc": 1599081005.0
        },
        {
          "id": "g3tk0bj",
          "author": "diiiiiiiizzzzzy",
          "body": "Me too. We’ll have a reallllllllll good chat.",
          "created_utc": 1599119194.0
        }
      ]
    },
    {
      "id": "g3rs376",
      "author": "Spacemilk",
      "body": "Bad bot, this sub is not the place for you, please go away",
      "created_utc": 1599081485.0,
      "score": 8,
      "context": [
        {
          "id": "g3rpkfl",
          "author": "timeforbedplease",
          "body": "I'm so sorry this happened. I think you should be honest with her about how that statement affected you. She should know that her words bear weight, and that comments like that come at a great cost to your well being. You should definitely be straight forward, but avoid blaming her. Take this as an opportunity to educate her on how damaging remarks about weight can be to anyone, especially those with a history of ED.",
          "created_utc": 1599080455.0
        },
        {
          "id": "g3rplr1",
          "author": "dadbot_2",
          "body": "Hi so sorry this happened, I'm Dad👨",
          "created_utc": 1599080469.0
        }
      ]
    }
  ]
}