{
  "id": "iog4zq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1599512786.0,
  "title": "Request: How to handle post-binge mornings",
  "selftext": " \n\nHow do you guys handle that post-binge morning? I know I absolutely HATE waking up knowing I ate like an animal the day/night before. Seriously, I stay in bed as long as possible to avoid that mental fog, physical bloat and feeling like my skin is literally stretching to accommodate what my brain has convinced me is an extra 15 lbs. It SUCKS. I usually “punish” myself on days like this: restrict my eating and find a way to sweat/exercise as much as possible. It’s my way of purging without purging, but we all know that only perpetuates the cycle. So I’m looking for mental and physical alternatives. Anything work for you guys that you think I should try? Therapy has always been my go-to and still is, but sometimes the words of anonymous peers who understand your struggles can be just as comforting/healing. Thank you in advance and from the bottom of my heart!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iog4zq/request_how_to_handle_postbinge_mornings/",
  "score": 53,
  "num_comments": 5,
  "comments": [
    {
      "id": "g4ds6zz",
      "author": "meldusa90",
      "body": "I have been struggling with this lately too. The bloating is the worst part. I have been trying to drink a lot more water in the mornings. It doesn't really make the bloat go away much, but it still makes me feel better physically.",
      "created_utc": 1599515809.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g4ez9f0",
      "author": "enord11400",
      "body": "If you are not on any sort of meal plan or weight-gain plan then try to listen to your body. There is a chance you will feel ravenous if you usually restrict and your body needed that food. If that is he case then try to eat something when you wake up. Something with protein. If you still feel totally stuffed and bloated then you don’t have to force breakfast but try to take a snack with you if you have to leave the house and don’t shy away from having it if you get hungry. \n\nWhat helped me was to not obsess about undoing damage or atoning for what you had done. You can not change the past. You can only try to do better the next night. It’s easier said than done, but having someone else to be with helped me to break the cycle since I wouldn’t want to all out binge in front of them. That might not be an option right now but even just texting or messaging someone that your having a bad day or that you want to talk later could help. Any proactive steps could make you feel a bit better. The morning after sucked for me because I felt like I couldn’t do anything to fix it. Even if I put it out of my mind there was still that sinking feeling that all I could do was restrict and hope tonight’s binge wasn’t as bad. That’s not true. Try to make some changes to your environment or your schedule to get away from what happened the night before and avoid an exact repeat. Feeling like I was at least trying to do something always helped me a little.",
      "created_utc": 1599543157.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g4ej9eq",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1599531761.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g4rk8h2",
      "author": "blahblahblahblah8",
      "body": "My 2c, the best way to break the cycle is to not restrict the morning after. Wake up and eat a normal breakfast, a normal lunch, and a normal dinner. Log it all on a non-calorie tracking app like Recovery Road. Do the same thing every day, treating every day completely independently of the day before. You might think that this will cause weight gain because of the short term losses due to not restricting after bingeing, but it will rapidly pay dividends from reducing the frequency that the binges occur. Take it \\*\\*one\\*\\* day at a time.",
      "created_utc": 1599778265.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g4dm99w",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1599512786.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g55n1jv",
      "author": "averyyoungperson",
      "body": "Hello, I am interested how you discovered why you needed a vice for your emotions. I have family members that exhibit these behaviors and I can tell something deep is going on other than the act of bingeing or restricting. How did you find out why you needed a vice for your emotions? If you don't mind me asking. No pressure to answer at all",
      "created_utc": 1600027746.0,
      "score": 1,
      "context": [
        {
          "id": "g4ej9eq",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1599531761.0
        }
      ]
    }
  ]
}