{
  "id": "ioqq0t",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1599558413.0,
  "title": "Request: my bf has an eating disorder and i need advice",
  "selftext": "i don’t know if these kind of posts are allowed but i have no idea who else i could ask.\nwe’re both guys who have suffered with out weights, mine unintentional as i have health issues, his because of his eating disorder.\n\nhe always helps me and does his best to encourage me to eat and i do the same but recently he’s taken joint the ed community or twitter, i don’t know what his @ is or what exactly he posts because wo respect his space and i don’t need to follow ever socia media platform he has because i trust him.\n\nbut he’s recently gotten worse, i’m not going into detail but i can tell he’s gotten much worse and i’m worried, this twitter community is doing way more harm then good, he says it makes him happy to have a community but all they do is use thinspo and meanspo and him feel like shit about himself more.\n\ni’ve been apart of toxic communities on tumblr before that make my mental health worse, i only got help after my account was deleted and i didn’t make another, but i feel like i’m stuck because i can’t help him, i don’t want to take away this community and resources but i want to help him. \n\nany advice would be helpful please",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ioqq0t/request_my_bf_has_an_eating_disorder_and_i_need/",
  "score": 52,
  "num_comments": 6,
  "comments": [
    {
      "id": "g4fvaw0",
      "author": "VampireDetective",
      "body": "1. Know that if your partner doesn't want help, there's nothing you can do (except for point 5)\n2. Know that giving an ultimatum doesn't work\n3. Know that whatever you say or do the ED will make you the devil. every. single. time.\n4. Know that your partner needs love and support, *but that you do as well*\n5. Know that you have the right to set boundaries and not be bullied by your partner's ED\n6. Know that your love and support might not be met with the reaction you want and/or expect (see point 4)\n7. Know that eating disorders are extremely lonely diseases (no matter how *not* alone the person actually is) and the ED community makes your partner feel less lonely\n8. Know that the happiness your partner gets from the community (although it's nice of you to not want to take that away) is not so much happiness as it is a relief (see point 7) \n9. Know that you shouldn't engage with the ED, stand your ground and don't answer questions like \"do I look fat/ugly?\", \"should I eat this?\", \"did I eat too much?\", \"I haven't eaten all day, isn't that great?\" no matter how many times he asks or how he interprets your silence, because **there is no right answer.** (see point 4)\n10. Know that your partner doesn't choose to have an ED, the ED chooses him\n11. Know that it's not an easy or straight road to recovery, and you need a lot of patience\n\nLastly, and most importantly for you, know that it's not your job to cure or treat your partner. I repeat: **it's not your job to cure or treat your partner**. This might seem harsh, but it's the truth. Your job as his partner is to be there, support him and make sure he knows he's love. Leave the rest to the professionals.",
      "created_utc": 1599572847.0,
      "score": 31,
      "context": []
    },
    {
      "id": "g4fli8s",
      "author": "0_surge",
      "body": "eating disorder twitter is a very toxic space that purposefully encourages people to get worse.\ni use it daily myself, it sucks you in and i’ve definitely gotten worse since i’ve been on it.",
      "created_utc": 1599565999.0,
      "score": 21,
      "context": []
    },
    {
      "id": "g4h1dz2",
      "author": "imjustsuchafool",
      "body": "talk w him maybe. tell him you’re worried, how much u care about him, make him feel loved and accepted.\ni’m on ed twitter as well and honestly it makes u feel accepted and as everyone is going through pretty much the same it feels like a safe place. but at the same time i think it’s rly bad for ourselves, as we encourage ourselves to fast, give each other meanspo and stuff... most people on there are very sweet, but we’re really toxic for each other. so i hope u understand that ur bf is probably using that as his safe place where he feels understood etc. jus don’t be harsh on him. it takes a lot of effort to get better but if u support him all the way till he’s recovered, never give up on him, i think that y’all be able to get better. probably not the best advice, but i hope it helped somehow. i’m really sorry y’all goin thru this :(",
      "created_utc": 1599594614.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g4fdx02",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1599558413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4h1nsh",
      "author": "imjustsuchafool",
      "body": "it’s really hard to get better and put him in another headspace. but it’ll get eventually better. don’t give up and also don’t forget to take care of urself, u deserve to be loved and appreciated as well",
      "created_utc": 1599594747.0,
      "score": 2,
      "context": [
        {
          "id": "g4h1dz2",
          "author": "imjustsuchafool",
          "body": "talk w him maybe. tell him you’re worried, how much u care about him, make him feel loved and accepted.\ni’m on ed twitter as well and honestly it makes u feel accepted and as everyone is going through pretty much the same it feels like a safe place. but at the same time i think it’s rly bad for ourselves, as we encourage ourselves to fast, give each other meanspo and stuff... most people on there are very sweet, but we’re really toxic for each other. so i hope u understand that ur bf is probably using that as his safe place where he feels understood etc. jus don’t be harsh on him. it takes a lot of effort to get better but if u support him all the way till he’s recovered, never give up on him, i think that y’all be able to get better. probably not the best advice, but i hope it helped somehow. i’m really sorry y’all goin thru this :(",
          "created_utc": 1599594614.0
        }
      ]
    },
    {
      "id": "g4j470y",
      "author": "sonic2cool",
      "body": "yeah i second this. i’m on ed twt too & i love it & hate it ahaha",
      "created_utc": 1599642562.0,
      "score": 1,
      "context": [
        {
          "id": "g4h1dz2",
          "author": "imjustsuchafool",
          "body": "talk w him maybe. tell him you’re worried, how much u care about him, make him feel loved and accepted.\ni’m on ed twitter as well and honestly it makes u feel accepted and as everyone is going through pretty much the same it feels like a safe place. but at the same time i think it’s rly bad for ourselves, as we encourage ourselves to fast, give each other meanspo and stuff... most people on there are very sweet, but we’re really toxic for each other. so i hope u understand that ur bf is probably using that as his safe place where he feels understood etc. jus don’t be harsh on him. it takes a lot of effort to get better but if u support him all the way till he’s recovered, never give up on him, i think that y’all be able to get better. probably not the best advice, but i hope it helped somehow. i’m really sorry y’all goin thru this :(",
          "created_utc": 1599594614.0
        }
      ]
    }
  ]
}