{
  "id": "ips2ig",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1599695227.0,
  "title": "Request: I feel guilt for not being able to control what triggers me",
  "selftext": "I enjoy spending time with both of my sister-in-law’s outside of the fact that they both are extremely triggering to me. We have been able to have deep conversations and laughs. The only thing is, they constantly discuss restricting, fasting, only eating “healthy” foods, burning off calories, etc etc and are both thin. Meanwhile, I am trying to recover and eat intuitively. I am not restricting, counting calories, or basically doing any of the things that I make me feel in control and have gained weight in the process. \n\nI honestly feel like all my progress is lost when I am with them. I feel disgusting and shameful when I am around them. I wish I wasn’t triggered by them and I feel even more guilt for allowing them to impact me as much as it does. I don’t know what to do.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ips2ig/request_i_feel_guilt_for_not_being_able_to/",
  "score": 44,
  "num_comments": 6,
  "comments": [
    {
      "id": "g4o70es",
      "author": "FoxiiFighter",
      "body": "When I was attempting recovery, I had to stop going to family dinners with my fiance's parents because the entire situation was triggering. It was painful - I was shamed for it, my now ex-fiance said I was embarrassing him...but I asked him what was worse -- embarrassing him or breaking down in front of his family over a meal I couldn't handle? \n\nIt's hard but you need to do whats right for you until you learn how to mitigate triggers.",
      "created_utc": 1599743438.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g4mfrj9",
      "author": "wh0fuckingcares",
      "body": "I know you enjoy spending time with them but your health comes first. Like do they not know about your recovery? Talking like that in front of you is deliberately triggering imo. A wrong comment or mistake here and there ok sure. But constantly?",
      "created_utc": 1599711374.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g4m8sla",
      "author": "MysticalWateryEye",
      "body": "If you trust them and value their friendship then they should hopefully be understanding if you mention that you are in recovery from an eating disorder. \n\nEven people in recovery still can get triggered, it's an addiction and a mental illness. It's hard to see someone else laughing off things that have tried to destroy your life, your feelings are completely valid. You can try to politely voice that it's hard to listen to diet talk, hopefully they will be understanding, it sounds like you have a good connection with them.",
      "created_utc": 1599706909.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g4o0ofn",
      "author": "VampireDetective",
      "body": "Your health and safety (yes, safety) is much more important. I’ve stopped hanging out with people that trigger me and feel so much better for it. Once I’m recovered I can start incorporating them more. But for now, this is how it has to be.",
      "created_utc": 1599741133.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4ln49z",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1599695227.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g4pxodw",
      "author": "IndieAcademic",
      "body": "If you are close enough to them, you can explain you are in recovery and to please not mention anything at all about food, weight, or bodies around you at all. It's not a big ask; they might forget occasionally, but if they care about you they should try. I suggest this because you say you enjoy them & have had deep conversations.",
      "created_utc": 1599761658.0,
      "score": 1,
      "context": []
    }
  ]
}