{
  "id": "iqh3x8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1599788286.0,
  "title": "Request: I block myself from socializing if I've eaten too much or too recently.",
  "selftext": "Looking for advice. I have a nasty habit of hiding myself (avoiding other people and mirrors and not changing clothes) if I feel full. In college I would make sure to skip at least 1 meal before any social event. Occasionally, I would skip classes too, even though I enjoy school and am a strong student. I REALLY want to find a better way to cope. \n\nDoes anyone relate to this? How do you work through it???",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iqh3x8/request_i_block_myself_from_socializing_if_ive/",
  "score": 145,
  "num_comments": 19,
  "comments": [
    {
      "id": "g4s4gvk",
      "author": "Synchro_Shoukan",
      "body": "I do this too. I've binged/ gorged and not went to school or work because I hated myself so much. I've even stopped watching streamers if I feel bad.",
      "created_utc": 1599788793.0,
      "score": 19,
      "context": []
    },
    {
      "id": "g4s7r5c",
      "author": "Ok_Shopping4348",
      "body": "I’ve done this a lot and still struggle with it. If I’m invited somewhere where I know there will be food around but have eaten a lot that day, I won’t go and I’ll just isolate myself. In a perfect world, we would be able to just accept the invitation and be around food without having anxiety... but obviously our brains don’t work that way. I personally just try to take soda or some kind of “filling” beverage with me and gum when I’m invited somewhere where there’s food around. If you’re invited to a restaurant though that’s a different story. You could always pull then “I already ate” card and just order beverages instead of food but it’s always hard watching other people eat :( It’s such a horrible thing to have to say no to plans because your brain is telling you that you ate too much and need to isolate yourself. Just know that you’re not alone and try to slowly make an effort to get over your fear of attending these social events... you may surprise yourself. I hope I helped in some way! Good luck 💕",
      "created_utc": 1599790532.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g4scq1w",
      "author": "nooorecess",
      "body": "same! and i also use drinking as a crutch in social situations because i’m shy, which usually ends in disaster on an empty stomach :( ive basically just become a total recluse over the past 2 years while i work on my issues, cuz the stress of being around people just seems to undo so much progress every time. i’d like to eventually ease myself into going out again but it’s pretty daunting. following to see if anyone has any advice lol",
      "created_utc": 1599793242.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g4t3v9b",
      "author": "sonic2cool",
      "body": "i’m the exact same but just with anything really. i can’t hang out with my friends until i’ve lost loads of weight, i avoid going out to eat because i’ve gained too much & everyone will notice etc etc. even going to school is hard & i find myself sat alone during breaks all because of my body. it’s really tough & isolating man i wish i could give u some advice. just know ur not alone",
      "created_utc": 1599816182.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g4siac0",
      "author": "reyreybey",
      "body": "My therapist told me I needed to stop punishing myself. And that when I isolated bc of the war I am at with my body it’s letting the eating disorder win. I dunno her take on it kind of clicked. Like I really love swimming but if I feel fat I punish myself by not going to the beach with friends. And now I am like fuck that. I love swimming  and I won’t punish myself anymore. \n\nNot sure if I am articulating this well but good luck! You are not alone. Treatment helped me sooooo much of you are able to tap into that resource.",
      "created_utc": 1599796643.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g4sfvkr",
      "author": "helenhl001",
      "body": "Nothing to add except that I do this too-sometimes I would even make plans just to force myself out of my comfort zone but if I had a meal before it and felt like I ate too much, I would just cancel.",
      "created_utc": 1599795112.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4sps8p",
      "author": "fakeplasticturnips",
      "body": "I used to do this until I realised it would usually result in more binging and I was missing out on so much. When I forced myself to socialise instead I would usually have a good time and even if I didn’t it would save me from a binge. I had to force myself essentially with the knowledge that no one was thinking about how much I’d eaten or not eaten and no one cared except me. I would repeat in my head “I have as much right to be here (in public/social) as anyone else” and rip the bandaid off. The more I said yes to social events the less I binged and the more I was filled up in another way. \n\nSay yes and keep saying yes! And remember while you’re head is very busy thinking about you everyone else’s head is very busy thinking about them. \n\nAlso remember your future self is going to thank you for LIVING as opposed to hiding with your ED. It’s like living with a spider, the more you feed it with ED thoughts and behaviour the bigger it gets until it’s so big it’s all you see. Don’t feed the spider, say yes and live!!",
      "created_utc": 1599802138.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4svne4",
      "author": "aweebirb",
      "body": "I used to and still do this quite a lot. If you’re not seeing a therapist yet, I’d recommend that before anything else. :( It’s very difficult to overcome these feelings. One thing that’s helped me is finding soft/forgiving clothing that doesn’t touch my stomach that I can wear in days I feel sensitive about how much I’ve eaten.",
      "created_utc": 1599807281.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g4tmh1w",
      "author": "None",
      "body": "I’m unfortunately use the same copying mechanism. It was one of the reasons my bf broke up with me recently. He said when I don’t feel good I would distance myself and that I’m a cold bitch in such moments. I really don’t want to be like that, it just happens automatically.",
      "created_utc": 1599831673.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g4tq7wo",
      "author": "sirtunaboots",
      "body": "I do the same thing, so no advice, just letting you know you’re not alone❤️",
      "created_utc": 1599833747.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g4vig06",
      "author": "papush22",
      "body": "The same here! I used to do that A LOT, sometimes I even called sick to work when I ate a lot the day before because I felt disgusting and fat and I felt like everyone would notice. I was miserable all the time. I still sometimes feel like I should cancel some social events or dates because I ate a lot that day or the day before but I try not to. I focus on the fact that I really want to hang out with my friends/meet this person and I know they don't give a shit about my belly being bloated a little more. We're human and our bodies change every day. Trust me, after you overcome the obstacle just once, you'll feel the accomplishment and it will motivate you to do this more :) It's a good thing you realize that it's a problem you need to work on because that's one step forward already! You can do this, don't be afraid :)",
      "created_utc": 1599864493.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5474rm",
      "author": "catherine3434",
      "body": "I do this a lot. I especially would obsess over it in college. I was in a sorority and there was constant pressure to look good or thin. If I had an event or was planning to go to the bar I would make sure not to eat after 5 pm for the fear of being bloated or looking fat. I also have gained some weight due to an injury/ surgery and have stopped going to see friends as a result... the only thing that has worked for me is realizing that I am missing out on life. I have to remind myself that life is short, and even though I don’t feel great about my body right now, I don’t want to look back on my life when I’m older and think of all the things I didn’t do because I thought I was fat. I know this isn’t the greatest advice but it works sometimes. You aren’t alone! Sending love ❤️",
      "created_utc": 1600007992.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g57jmkq",
      "author": "taperj33ngirl",
      "body": "woah i relate lol i've been in recovery for quite some time and this is a huge thing i've struggled with, especially not wanting to see a significant other, go on a date etc. without fasting before hand. in my experience it takes pretty radical acceptance of the fact that yes people eat, and do we ever notice when our neighbor's belly is full through their clothes?? ¡¡NEVER!! i realize i am hyper aware of my own body, but probably no one else is. in real life combatting this habit looks like wearing comfy clothes i feel confident in, reminding myself that no one is scrutinizing me as much as i am, and making it a point to go through with the scenario (ie. socializing after a meal) in order to prove to myself that i did in fact survive it\n\nbest of luck and thanks for sharing 😅",
      "created_utc": 1600066458.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g4s3hfo",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1599788286.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5oidgi",
      "author": "None",
      "body": "Ok I need help with this too. Also everyone around me calling it \"intermittent fasting\" isnt helping. I binged last night and rationalized with myself that I just wouldnt eat for 2 days (2 days would be Saturday when I see my friends). I'm torn with wanting to be healthy after binging but also telling myself it's ok to eat again after.",
      "created_utc": 1600412354.0,
      "score": 2,
      "context": [
        {
          "id": "g4s4gvk",
          "author": "Synchro_Shoukan",
          "body": "I do this too. I've binged/ gorged and not went to school or work because I hated myself so much. I've even stopped watching streamers if I feel bad.",
          "created_utc": 1599788793.0
        }
      ]
    },
    {
      "id": "g5pfma4",
      "author": "Synchro_Shoukan",
      "body": "The way you do it doesn't sound healthy. Intermittent fasting has set times of when to and when not to eat. It isn't about punishing yourself for eating/ binging.",
      "created_utc": 1600440280.0,
      "score": 3,
      "context": [
        {
          "id": "g4s4gvk",
          "author": "Synchro_Shoukan",
          "body": "I do this too. I've binged/ gorged and not went to school or work because I hated myself so much. I've even stopped watching streamers if I feel bad.",
          "created_utc": 1599788793.0
        },
        {
          "id": "g5oidgi",
          "author": "None",
          "body": "Ok I need help with this too. Also everyone around me calling it \"intermittent fasting\" isnt helping. I binged last night and rationalized with myself that I just wouldnt eat for 2 days (2 days would be Saturday when I see my friends). I'm torn with wanting to be healthy after binging but also telling myself it's ok to eat again after.",
          "created_utc": 1600412354.0
        }
      ]
    },
    {
      "id": "g5qail6",
      "author": "None",
      "body": "Yeah youre right. I need to learn to handle the aftermath guilt better",
      "created_utc": 1600454989.0,
      "score": 1,
      "context": [
        {
          "id": "g4s4gvk",
          "author": "Synchro_Shoukan",
          "body": "I do this too. I've binged/ gorged and not went to school or work because I hated myself so much. I've even stopped watching streamers if I feel bad.",
          "created_utc": 1599788793.0
        },
        {
          "id": "g5oidgi",
          "author": "None",
          "body": "Ok I need help with this too. Also everyone around me calling it \"intermittent fasting\" isnt helping. I binged last night and rationalized with myself that I just wouldnt eat for 2 days (2 days would be Saturday when I see my friends). I'm torn with wanting to be healthy after binging but also telling myself it's ok to eat again after.",
          "created_utc": 1600412354.0
        },
        {
          "id": "g5pfma4",
          "author": "Synchro_Shoukan",
          "body": "The way you do it doesn't sound healthy. Intermittent fasting has set times of when to and when not to eat. It isn't about punishing yourself for eating/ binging.",
          "created_utc": 1600440280.0
        }
      ]
    },
    {
      "id": "g5qzzvb",
      "author": "Synchro_Shoukan",
      "body": "We all got stuff to work on, you'll get it, keep trying.",
      "created_utc": 1600466928.0,
      "score": 2,
      "context": [
        {
          "id": "g4s4gvk",
          "author": "Synchro_Shoukan",
          "body": "I do this too. I've binged/ gorged and not went to school or work because I hated myself so much. I've even stopped watching streamers if I feel bad.",
          "created_utc": 1599788793.0
        },
        {
          "id": "g5oidgi",
          "author": "None",
          "body": "Ok I need help with this too. Also everyone around me calling it \"intermittent fasting\" isnt helping. I binged last night and rationalized with myself that I just wouldnt eat for 2 days (2 days would be Saturday when I see my friends). I'm torn with wanting to be healthy after binging but also telling myself it's ok to eat again after.",
          "created_utc": 1600412354.0
        },
        {
          "id": "g5pfma4",
          "author": "Synchro_Shoukan",
          "body": "The way you do it doesn't sound healthy. Intermittent fasting has set times of when to and when not to eat. It isn't about punishing yourself for eating/ binging.",
          "created_utc": 1600440280.0
        },
        {
          "id": "g5qail6",
          "author": "None",
          "body": "Yeah youre right. I need to learn to handle the aftermath guilt better",
          "created_utc": 1600454989.0
        }
      ]
    }
  ]
}