{
  "id": "iragbr",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1599907635.0,
  "title": "Request: How to draw the line between low self esteem and an ED?",
  "selftext": "TW: mentions of self harm\n\nI feel like I should preface all of this by saying that I’ve never seemed professional help, for anything. Ironically (?), I’m too anxious to go to a doctor or therapist. I also have a hard time talking to people I’m close with.\n\nBasically my issue is that I’m not sure if I just have really low self esteem and use food as a way to cope sometimes, or if I’m actually developing/already have an ED. \n\nI really hate my body the majority of the time. I suck in, I pull on my fat, etc. I’ve stopped going clothes shopping in stores because ever since puberty its been a miserable and genuinely triggering experience. I would stand in the fitting room and punch myself in the stomach until I had to sit down or pass out. \n\nI eat large amounts of food in private, when bored or need to be distracted, and am ashamed of what I do eat. I never purge or starve myself, but I feel guilty sometimes. I’m vegan (for ethical reasons, not dieting), and really only exercise when I’m feeling optimistic, but that quickly goes again as soon as I feel low.\n\nUp until recently (last 6months?) I really didn’t think I had any sort of ED or was even at risk but now I’m not sure. I took the NEDA screening test and it said I was potentially at risk, but I’m still hoping for a more personal insight.\n\nI don’t want to take advantage of this sub, so please don’t give this time of day if it’s not relevant. Ofc, not everything’s here, but these are the main issues.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iragbr/request_how_to_draw_the_line_between_low_self/",
  "score": 51,
  "num_comments": 6,
  "comments": [
    {
      "id": "g4x6m39",
      "author": "BrowncoatIona",
      "body": "Eating disorders can be challenging to diagnose. Obviously there's the major ones that most everyone know by name, but then there's OSFED and ARFID and all sorts of subtypes beneath that. \n\nThe main question becomes, do thoughts about body, shape, weight, size, food, eating, calories, excercise, etc. interupt any major area of your life such as relationships, work, ability to sufficiently care for yourself, and so on. Have you ever skipped on an event (you would've liked to go to) because of your relationshop with your body or food? Has it ever impacted work or school? What about your relationships or desire for romance? Again, just questions to ponder. \n\nTo me, you seem to have some disordered eating and poor relationship with self at the absolute minimum. Obligitory, you should talk to a doctor, psychologist, therapist, or something similar if you can. You deserve care, empathy, and understanding.",
      "created_utc": 1599911189.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g4xfhxi",
      "author": "CrawlingUpHerLeg",
      "body": "I can relate to the feelings and behaviours you described, during my teenage years. I’m in my mid-late 20s now and have been in treatment for a couple years (sort of..it’s been quite the push and pull with recovery, addiction and my mental health in general), but although I feel I’m in an entirely different reality to when I was in my teens, I get fleeting yet regular moments of being the self-hating, low self-esteemed teenage girl who was not coping with her changing body and life in general.\n\nNow I have adult experiences and perceptions and history/advice from mental health experts, so NOW I have things I love about myself and things I hate. When the hatred silences any positive views of myself, that’s when my ed behaviours and thoughts start to really take a turn for the worse and I relapse. And that says so much about why I developed this issue in the first place - I was feeling negative about myself more than I could ever feel anything positive. My ed is most definitely a coping mechanism for my depression, which encompasses my low self-esteem, bad body image, trauma, and just overall negative perceptions about life. When I’m feeling good and doing more, I don’t have as much brain space for those ed thoughts telling me what I can and can’t do.\n\nThe trick is to work on yourself and your life that in no way relates to your body, then you start feeling more confident in yourself in other, less vain ways (for lack of a better term). Food as a coping mechanism begins to not work as well as it once did, and it starts being a little easier to land upon better coping mechanisms instead.\n\nGetting shit done (whether it’s just getting through a shift at my shitty job or writing a journal entry or practicing a hobby during the day, getting coffee with one person, watching a movie with a person I like), while eating a reasonable amount at a scheduled eating time or when I notice I’m feeling or thinking about food (easier said than done, but it’s possible as I’ve done it before and it gives me hope! Structure is the key), also socialising when you can and really trying to enjoy those moments of mutual interactions as an achievement and/or distraction from being too internally isolated with yourself and those mean thoughts (even if you think it’s not what you feel like doing, it can feel so rewarding afterwards! I have to remind myself all the time)....basically, when I’m doing things in my day or working towards a non-body related goal (like applying to get a new and better job, becoming better at drawing, practicing something you may not have tried like meditating for 10-20mins every morning) then I feel internally better about myself. Not always amazing but definitely better - and so using food to cope doesn’t feel as appealing as moving towards something that also makes me feel good but has a healthy and long term benefit as well. This has helped me stop mid-binge because I realised it was doing absolutely nothing for my mind or mood, which I never thought I’d be able to do in the past.\n\nUltimately, I think your disordered eating is a combination of not feeling okay within yourself (which I’m sure you know). And I’m so so sorry you’re struggling. It’s such a silent struggle to others but so deafening and lonely for us. But the low-self esteem IS a symptom of the ed and the ed IS a symptom of your low-self esteem. From my experience, I am only able to break the cycle of those two debilitating issues by finding rewards, satisfaction, friends, distraction, interest and so much more from other endeavours that help me feel more whole, confident and content long term and way less shattered and desperate inside.\n\nApologies for the wall of rant! I just really felt a connection to your words and I feel I’ve learnt so much since feeling the way you have described, even if I still struggle some days (haaa like today!)\n\nAll the best and please reach out to me if you need it <3 :)",
      "created_utc": 1599918120.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g4xmozr",
      "author": "FoxiiFighter",
      "body": "Like others have said, Ed's are extremely difficult to pin point, and a lot of that surrounds the gatekeeping of diagnoses, especially on social media platforms that make us question if what we experience is \"real\" or if we are just over reacting  \n\nBecause of that, I am now of the school of thought that ANYONE experiencing any type of disordered habits needs to to talk to someone ASAP. You may have an ED, or you may have something else that is manifesting itself through disordered eating habits. \n\nRegardless, If you have the slightest suspicion that something isnt right...go talk to someone immediately.",
      "created_utc": 1599922195.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g4z5ivy",
      "author": "bug_z666",
      "body": "Okay.... I've been wanting to post and ask this exact question but I'm too afraid I guess to post yet. Our stories are remarkably similar and I just wanted to show my appreciation for sharing",
      "created_utc": 1599943277.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g4x34m3",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1599907635.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5pkguz",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1600442723.0,
      "score": 1,
      "context": []
    }
  ]
}