{
  "id": "iugapx",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1600335805.0,
  "title": "Request: dating someone with an eating disorder",
  "selftext": "First off I'm really sorry if I sound ignorant. I'm truly just trying to learn and educate myself. I (29m) recently got in a relationship with a woman(27f), and she opened up, and told me about her struggles with eating disorders. She'll typically go long periods without eating anything. And I've never dated someone with an eating disorder before. I cook/bake a lot and I love making food for other people. Making food for others is how I express gratitude, appreciation, and love. I really like her and don't want to scare her off or make her think I'm not being supportive. Since we've been together ive dialed back a lot on the food talk because I get anxious that what I say might upset her.\nSo how do I navigate talking about food and making food without triggering and/or causing a relapse? How do I be the right kind of supportive? How do I be there for her if she does relapse? Where can I go to learn more?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iugapx/request_dating_someone_with_an_eating_disorder/",
  "score": 94,
  "num_comments": 9,
  "comments": [
    {
      "id": "g5kjigh",
      "author": "wh0fuckingcares",
      "body": "Use a code word\n \nYou use it when you feel rejected by her declining your food and she uses it when you say/do triggering things\n\nYou cant walk on eggshells, you cant keep that up long term and its potentially no good for her. Not saying anything bad about your gf but ED makes us super secretive. Its shameful. Even ppl who rarely lie, will lie their ass off to cover up ED symptoms. I often five small tidbits of info in order to cover up bigger problems im having. I could be wrong, your gf might be the exception to the rule.\n\nI'm glad she's got someone who cares enough to try and learn",
      "created_utc": 1600336750.0,
      "score": 40,
      "context": []
    },
    {
      "id": "g5knlui",
      "author": "fakeplasticturnips",
      "body": "I sounds like it’s still early days for your relationship so she may not be super comfortable opening up but I’d actually tell her exactly what you’ve posted here - you want to be supportive but have no experience and don’t really know how to navigate this. Get her advice   She knows better than anyone what she needs. \nMy advice for you is NEVER discuss weight - yours, hers, someone else’s. You want to keep well away from that, even if it seems innocent. Don’t discuss diets. Do make food as normal as possible for her with your own behaviour. Do include her in the cooking of meals and ask her if she’s comfortable with the ingredients before using them. Don’t focus on food, find other ways to express yourself!",
      "created_utc": 1600340952.0,
      "score": 31,
      "context": []
    },
    {
      "id": "g5l7bdm",
      "author": "workingonit777",
      "body": "don't get mad at her, don't punish her, remind her that you think she's beautiful in every way, remind her that you are always there, remind her it's okay to feel safe with you, don't force her to eat and don't say things like \"you dont want food do you?\" things like that. I would offer it and not think second about it , you should still cook for her , or enough for her too, i think once she's more comfortable around you it'll be easier",
      "created_utc": 1600353414.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g5l6x0i",
      "author": "Mental_Chip9096",
      "body": "Also, there are online drop in groups for friends/family of ED that would probably be very helpful for you. Read a book!\n\nEdit: also bless you for wanting to do the best for her.",
      "created_utc": 1600353212.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g5li60g",
      "author": "cobainsosane",
      "body": "The fact you are even thinking how your own actions affect her is the best way to start, and make that known to her as well that your still learning, and want to support her but don't know how cuz it's a new experience for you and you want be there for her in the way she needs.\n\nDon't ask her to explain her disorders to you if she hasn't educated herself fully on them, and do some of your own research to help you and her both understand together what your dealing with. \n\nPs never say things like \"wow your gonna eat that\"\n\"That's so much food\" \nOr Any joke about weight,\nOr stuff that could come off attacking\nIf there's something about her diet or habits you want to bring up, figure out a gentle way to bring them up to not offend her or trigger unwanted thoughts, it is possible to talk about triggers in a constructive way but it's a thin line between where people take things personally and can look at themselves from an outer perspective, \nLastly give it time, it's gonna be a learning process for both of you with lots of high highs and low lows",
      "created_utc": 1600358224.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g5nwrs4",
      "author": "skipperpenguin",
      "body": "just to add here: my ex boyfriend was the BEST most supportive #1 best person for my recovery! and we started dating right before I self admitted to treatment. it was over a lot of time, but cooking meals and going out with him and having someone accept my body was so awesome for slowly healing my relationship with food!",
      "created_utc": 1600396962.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5kinsf",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1600335805.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5ml6jt",
      "author": "wildxxdaze",
      "body": "Excellent advice! I also second \"do make food as normal as possible for her with your own behaviour\". When struggling with an ED, I've found it so helpful in recovery when people will include me in cooking meals together/still invite me for dinners when they're aware of the struggles. It helps you to practice your recovery and face the struggle, and reclaim the pleasures that your ED often wants to deny you. Me and my partner have a code word eg - the bully, for when I feel uncomfortable with certain ingredients or meals \"hmm the bully isn't a fan of that one\". Also helps to seperate the ED.",
      "created_utc": 1600373744.0,
      "score": 6,
      "context": [
        {
          "id": "g5knlui",
          "author": "fakeplasticturnips",
          "body": "I sounds like it’s still early days for your relationship so she may not be super comfortable opening up but I’d actually tell her exactly what you’ve posted here - you want to be supportive but have no experience and don’t really know how to navigate this. Get her advice   She knows better than anyone what she needs. \nMy advice for you is NEVER discuss weight - yours, hers, someone else’s. You want to keep well away from that, even if it seems innocent. Don’t discuss diets. Do make food as normal as possible for her with your own behaviour. Do include her in the cooking of meals and ask her if she’s comfortable with the ingredients before using them. Don’t focus on food, find other ways to express yourself!",
          "created_utc": 1600340952.0
        }
      ]
    },
    {
      "id": "g5l6pxo",
      "author": "Mental_Chip9096",
      "body": "This is THE best advice!",
      "created_utc": 1600353114.0,
      "score": 3,
      "context": [
        {
          "id": "g5knlui",
          "author": "fakeplasticturnips",
          "body": "I sounds like it’s still early days for your relationship so she may not be super comfortable opening up but I’d actually tell her exactly what you’ve posted here - you want to be supportive but have no experience and don’t really know how to navigate this. Get her advice   She knows better than anyone what she needs. \nMy advice for you is NEVER discuss weight - yours, hers, someone else’s. You want to keep well away from that, even if it seems innocent. Don’t discuss diets. Do make food as normal as possible for her with your own behaviour. Do include her in the cooking of meals and ask her if she’s comfortable with the ingredients before using them. Don’t focus on food, find other ways to express yourself!",
          "created_utc": 1600340952.0
        }
      ]
    }
  ]
}