{
  "id": "iumw2b",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1600360060.0,
  "title": "Request: My fiancé said I look 'big boned' and have gained weight :(",
  "selftext": "My fiancè is the type of person who says things without thinking first, which means he sometimes says something he doesn't really mean and meant to say another thing. \nToday we were chilling watching TV and I felt really unwell. He asked me if I could be pregnant again (we have a 2 month old baby already) as he had been noticing signs, but refused to tell me what signs as it would upset me. My heart immediately sank as I knew what that meant, and asked if I had gained weight. He told me that I had, and that I looked 'big boned'.\n\nHe knew from my face how incredibly hurt I was to hear that, especially as I have only recently started eating again after starving myself for a while after having a baby. He did feel really guilty and apologised many times, and said that it came out wrong and he didn't mean to say that. He really did feel awful about it and said he realised that it was something you shouldn't say to someone with a long history of eating disorders. But now I can't get it out of my head... Big boned. Gained weight. I mean, I've just had a baby, and I've been told many times how lucky I am that my body has slimmed down again so soon after. But obviously my fiance doesn't see that :(\n\nI'm a big coffee drinker but today I haven't been able to eat or drink a thing since he said that. I don't want to eat ever again. I'm hiding my body in baggy clothes even though it's boiling outside. I can't stop thinking about what he said :(",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iumw2b/request_my_fiancé_said_i_look_big_boned_and_have/",
  "score": 85,
  "num_comments": 22,
  "comments": [
    {
      "id": "g5lqb3z",
      "author": "DragonflyStunning",
      "body": "oh man:/ you JUST had a baby literally 2 months ago your body just created human life and it needs to heal. gaining weight doesn’t mean getting fat. where are the hardcore facts that you’re big boned? it’s merely just his opinion. tell him you don’t wanna hear anything to do with your body or body changes that he really hurt you and that he needs to be positive",
      "created_utc": 1600361453.0,
      "score": 52,
      "context": []
    },
    {
      "id": "g5m5cms",
      "author": "linda232323",
      "body": "Come on man. That’s just so fucking inconsiderate. You gotta sit him down and tell him to knock it the fuck off and not make comments about your body. Especially if you just had a baby! This goes beyond just “not thinking before you speak” that’s mean af.",
      "created_utc": 1600367618.0,
      "score": 27,
      "context": []
    },
    {
      "id": "g5nm00q",
      "author": "wordgromit",
      "body": "You literally just had a baby, and this guy is commenting on your body. I feel like this could be a teaching moment, and you have every right to feel hurt. I really wish I could give advice or something, but I only have empathy to offer.\n\nAll I'll say is this, if someone has an issue with your body, it not your job to worry bout it. They are the one with the problem.",
      "created_utc": 1600391136.0,
      "score": 17,
      "context": []
    },
    {
      "id": "g5noarb",
      "author": "Snowypaton1",
      "body": "That’s so mean. He knows you like, literally have struggled with eating disorders right? He should know not to say shit like that god. You just had a baby take it easy on yourself. I’m so sorry he said that. EDs are serious. People die. You can’t just say that shit to someone who you know has struggled with one. I get if he was wanting to know if you were pregnant again but there’s a million other ways to go about it without triggering you like that. Makes me mad. I’m sorry",
      "created_utc": 1600392366.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g5o2588",
      "author": "hopefulcynicx",
      "body": "Men are stupid and I’m sorry he said that to you. \nI honestly doubt he meant to hurt you, he was probably just being dumb. Most men don’t realize they’re saying something offensive until they already said it. \n\n\nFirst off, I know it’s easier said than done, but you’ve got to start eating. Having a newborn is rough... you NEED to eat for energy. \n\nSecond, you are still healing. Your body doesn’t completely recover from childbirth until 12-18 months. Your hormones can still be out of whack up until that point. Doctors will give the okay at 6 weeks if you’re healing properly to start doing LIGHT activity such as walking or lifting light weights in order to ease back into a fitness routine, but most doctors won’t even suggest dieting to lose weight until 6 months post partum. (Obviously special circumstances apply, if someone is severely overweight they might suggest it sooner)\n\nThird, do you realize what your body just did? Does he realize it? You literally grew a human inside of you for 9 months, had your uterus grow to the size of a watermelon (which has NOTHING to do with being fat or eating too much, your uterus MUST grow in order for your baby to grow) and at 2 months post partum, it is probably still shrinking. You then either pushed a baby out of you, or were cut open and had the baby removed from you. \nThat is not something you recover from quickly. This idea that women need to hurry up and get back to their pre pregnant size in a month is ridiculous. Give it time. Be patient with yourself.\n\n\nLastly, if you haven’t done so already, please check in with your OBGYN or even your pcp, and ask them to screen you for post partum depression.  I’m not saying you have it, I’m just concerned you’re at risk for developing it given the circumstances. \n\nI struggled with post partum depression and anxiety for 6 months before I finally broke down to my pcp. I was put on a low dose of an antidepressant and slowly started feeling like myself again. I don’t want other women to go through what I did, that is why I’m commenting. \n\nI’m sure your fiancé didn’t mean anything hurtful by it, like I said, guys don’t always think before they speak. You have my permission to sit him down and explain why he shouldn’t have said that, and how it could seriously affect you. \nJust show him this comment if you don’t want to talk about it.\nPlease take care. I wish you the best.",
      "created_utc": 1600399997.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g5menjq",
      "author": "None",
      "body": "Ive ask for a post to me put on about a similar thing. My nan comented on how last time i was so fat she thought i was maybe having a baby soon. Ive actually lost alot weight since but i can not get the uve put weight comments out my head now. I feel ashamed. I can not eat anymore without feeling guilt and shame. Many people say these things because to them it maybe wouldnt affect them how it does to  someone who has ever had or still had a eating disorder. They have no idea the impact itl have or the spiral itl send someone with hostory of ED into too. It was insensitive him to say but im sure he has no idea how bad itl effect you. \n\nIm not sure what to advise because i was going to ask for similar advice on how to forget those kind of comments and not let them effect me. \n\nYouve just had a baby. They take toll on the female body then once born your tired and emotional its hard to eat well, find time to exercise ect. You dont have be back to your before shape straight away and most women dont ever get back to their before shape anyway and end up being happy with a mummys body. \n\nAnyway. Im so sorry he was insensitive but im sure he never meant it to hurt so bad.",
      "created_utc": 1600371373.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g5p62f1",
      "author": "None",
      "body": "He knew what he was doing when he said that. In my opinion upon reading this, he knew it would trigger you. The excessive apology and saying it “came out wrong” is a manipulation tactic.... if this happens often with him, it is a massive red flag.... please take that into careful consideration before the two of you get married. I’ve dated many guys like this and it was always after the relationship had ended that I realized how many times they took advantage of my anxiety to keep me in check. Hope this makes sense. Good luck OP and don’t be too hard on yourself. Bodies will change throughout our lives, but remember that your value and worth is not your appearance.",
      "created_utc": 1600434934.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g5o4t1v",
      "author": "The-Vee-Dub",
      "body": "I agree with the comments that suggest taking some time to educate him on how you’d like and need to be spoken to, what’s helpful, what isn’t. Involving a counselor for both your own healing and in helping to convey this to him might also be an important step. \n\nI also agree with the others who say having a baby is physically really intense for quite a long time. I also suffered from PPD both times (once within 6 weeks the other time after 6 months) and it definitely triggered my ED both times. \n\nBy your description, he doesn’t sound malicious, but ignorant. Either way, it’s dangerous for your healing both form the ED and postpartum recovery. Luckily, ignorance is usually more easily and effectively treated.\n\nPlease take care of yourself. ♥️ you may be a mama now, and yes that means added responsibility, but you still matter very much and deserve a healthy body and mind as well.\n\nEdited- typo",
      "created_utc": 1600401656.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5o895s",
      "author": "None",
      "body": "Your body is amazing it gave life to a baby so be gentle to it.",
      "created_utc": 1600404036.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5og5pb",
      "author": "jannellopez",
      "body": "I know how hurtful and triggering a comment like that can be and stay in your head if you’ve suffered from eating disorders.i know it’s hard to get it out of your head but please take your mind off it and eat. You literally just had a newborn and your body needs it to recover properly.",
      "created_utc": 1600410337.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5lmw0h",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1600360060.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5p2v10",
      "author": "rosieco",
      "body": "So, after the baby you say you slimmed down by restricting...and he did nothing? Because you know that was noticeable. If you were breastfeeding, it was most likely more difficult because you weren’t taking in enough nutrients. You may have switched your baby to formula early for this very reason, I know a few women working through their EDs that went this route because they relapsed as soon as the baby was born. You had a baby just 2 MONTHS ago, friend. Weight loss can’t be the goal. Your husband said a stupid and thoughtless comment here, absolutely, but that’s not the issue here.\n\nIt’s an insane premise for someone with an eating disorder to follow, since we crave control over our bodies, but when women have children our bodies are suddenly not our own. Mistreating ourselves is mistreating our children, who are depending on our bodies to survive for the first portion of their lives (and beyond). \n\nI hope you have someone outside of the family, like a therapist, who you are talking to to work through your ED after having children. ED mixed with postpartum depression is one hell of a combo and very hard to cope with on your own. Not saying you have PPD, but your ED can certainly swing you into this territory and it is a dangerous place to be as a new mom. \n\nPlease take care of yourself. As a new mom, you’re sleep deprived, and firing on all cylinders to adjust to your new life as a mother. This all must add so much pressure and stress to the situation, and I hope you are finding ways to still feel strong.",
      "created_utc": 1600432834.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5tp28u",
      "author": "averyyoungperson",
      "body": "You JUST had a baby. TWO MONTHS AGO. Personally there is NO EXCUSE for saying something like that to anyone. That's a total dishonor of the woman's body and the life giving capabilities that we have as women, the pure sacrifice of carrying and birthing a child. Your body carried and grew life, it should be honored and praised. Honestly that just makes me pissed to hear. No offense to your fiance or anything but sounds like he's lacking serious discernment and needs to learn compassion and how to keep his mouth shut. If that were my husband I would have ripped him to shreds. PERIOD. \n\nI'm so sorry he said that to you. It stings like a knife to hear something like that. 😔",
      "created_utc": 1600528954.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g62x0jo",
      "author": "dogsandbooksarelove",
      "body": "Hi op, first of all, congratulations on the new baby. And to tell you directly, pregnancy and weight gain go hand in hand. Your body put on some were to protect and cushion the baby it was growing,  like any bird feathers its nest before laying eggs.\n\nIt's perfectly normal, and is a good indication that your body is working fine. As far as the losing weight thing is concerned, you just had a baby. Two months is the blink of an eye. \n\nTell your husband to zip it. And enjoy your first few months of motherhood. Your body GREW a whole person, and it needs gentle care and time to go back to the way it was. Please be kind to yourself, and remember that you are beautiful and loved.\n\nTake your time, breathe, and slowly eat. Eat healthy, eat in good amounts of quality food, drink your water, and get good sleep.\n\nI'm sure you already have that new mommy glow, and a little bit of TLC is sure to make you feel much better.",
      "created_utc": 1600677349.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5nkpld",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600390469.0,
      "score": -1,
      "context": []
    },
    {
      "id": "g5o0dj7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600398964.0,
      "score": -20,
      "context": [
        {
          "id": "g5nm00q",
          "author": "wordgromit",
          "body": "You literally just had a baby, and this guy is commenting on your body. I feel like this could be a teaching moment, and you have every right to feel hurt. I really wish I could give advice or something, but I only have empathy to offer.\n\nAll I'll say is this, if someone has an issue with your body, it not your job to worry bout it. They are the one with the problem.",
          "created_utc": 1600391136.0
        }
      ]
    },
    {
      "id": "g5ppo0l",
      "author": "BelligerentCoroner",
      "body": "Right?!?! \n\n\"Is there a chance you could be pregnant again? I don't want to tell you WHY I'm asking, don't make me say it. Ok, fine- you gained weight and you look big boned. No, that's not what I meant. Sorry, I shouldn't have brought it up.\" \n\nYikes. He has issues. He shouldn't even be THINKING that about the mother of his newborn child, let alone voicing it. He should be marveling at her body and what it has done.",
      "created_utc": 1600445168.0,
      "score": 2,
      "context": [
        {
          "id": "g5p62f1",
          "author": "None",
          "body": "He knew what he was doing when he said that. In my opinion upon reading this, he knew it would trigger you. The excessive apology and saying it “came out wrong” is a manipulation tactic.... if this happens often with him, it is a massive red flag.... please take that into careful consideration before the two of you get married. I’ve dated many guys like this and it was always after the relationship had ended that I realized how many times they took advantage of my anxiety to keep me in check. Hope this makes sense. Good luck OP and don’t be too hard on yourself. Bodies will change throughout our lives, but remember that your value and worth is not your appearance.",
          "created_utc": 1600434934.0
        }
      ]
    },
    {
      "id": "g5pdjsr",
      "author": "minttulisa",
      "body": "This is what I feel like too. If this is an accident and he knows OP this little how are you gonna raise a child? Purposely triggering a young mother with a history of ED’s makes this a massive red flag. With comments like that he can make the next baby himself.",
      "created_utc": 1600439186.0,
      "score": 1,
      "context": [
        {
          "id": "g5p62f1",
          "author": "None",
          "body": "He knew what he was doing when he said that. In my opinion upon reading this, he knew it would trigger you. The excessive apology and saying it “came out wrong” is a manipulation tactic.... if this happens often with him, it is a massive red flag.... please take that into careful consideration before the two of you get married. I’ve dated many guys like this and it was always after the relationship had ended that I realized how many times they took advantage of my anxiety to keep me in check. Hope this makes sense. Good luck OP and don’t be too hard on yourself. Bodies will change throughout our lives, but remember that your value and worth is not your appearance.",
          "created_utc": 1600434934.0
        }
      ]
    },
    {
      "id": "g5ntee1",
      "author": "bingumarmar",
      "body": "You dont break up with your partner and father of your child over one rude comment that they feel very horrible about. \n\nReddit sometimes, I swear...",
      "created_utc": 1600395107.0,
      "score": 6,
      "context": [
        {
          "id": "g5nkpld",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600390469.0
        }
      ]
    },
    {
      "id": "g5nmc8i",
      "author": "wordgromit",
      "body": "Not everything is fixed by dumping someone",
      "created_utc": 1600391312.0,
      "score": 1,
      "context": [
        {
          "id": "g5nkpld",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600390469.0
        }
      ]
    },
    {
      "id": "g5o5lv4",
      "author": "None",
      "body": "Don't you think that someone should be a little considerate about things the person they are in a relationship with is sensitive about? Obviously he knew it would hurt.",
      "created_utc": 1600402184.0,
      "score": 5,
      "context": [
        {
          "id": "g5nm00q",
          "author": "wordgromit",
          "body": "You literally just had a baby, and this guy is commenting on your body. I feel like this could be a teaching moment, and you have every right to feel hurt. I really wish I could give advice or something, but I only have empathy to offer.\n\nAll I'll say is this, if someone has an issue with your body, it not your job to worry bout it. They are the one with the problem.",
          "created_utc": 1600391136.0
        },
        {
          "id": "g5o0dj7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600398964.0
        }
      ]
    },
    {
      "id": "g5o79we",
      "author": "None",
      "body": "Right..",
      "created_utc": 1600403340.0,
      "score": 1,
      "context": [
        {
          "id": "g5nkpld",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600390469.0
        },
        {
          "id": "g5ntee1",
          "author": "bingumarmar",
          "body": "You dont break up with your partner and father of your child over one rude comment that they feel very horrible about. \n\nReddit sometimes, I swear...",
          "created_utc": 1600395107.0
        }
      ]
    },
    {
      "id": "g5nujxs",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600395746.0,
      "score": 1,
      "context": [
        {
          "id": "g5nkpld",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600390469.0
        },
        {
          "id": "g5nmc8i",
          "author": "wordgromit",
          "body": "Not everything is fixed by dumping someone",
          "created_utc": 1600391312.0
        }
      ]
    },
    {
      "id": "g5o0nse",
      "author": "wordgromit",
      "body": "In my comment I made I said that this situation should be a teaching moment. Idk, I feel like I would find it hard to leave someone when I have agreed to marry them, and have a baby with them, over one insensitive comment. If this was a pattern of behavior, yeah obviously, leave, but I don't think there is enough context of their relationship to say \"yeah dump them\"",
      "created_utc": 1600399122.0,
      "score": 3,
      "context": [
        {
          "id": "g5nkpld",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600390469.0
        },
        {
          "id": "g5nmc8i",
          "author": "wordgromit",
          "body": "Not everything is fixed by dumping someone",
          "created_utc": 1600391312.0
        },
        {
          "id": "g5nujxs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600395746.0
        }
      ]
    },
    {
      "id": "g5o1283",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600399350.0,
      "score": 2,
      "context": [
        {
          "id": "g5nkpld",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600390469.0
        },
        {
          "id": "g5nmc8i",
          "author": "wordgromit",
          "body": "Not everything is fixed by dumping someone",
          "created_utc": 1600391312.0
        },
        {
          "id": "g5nujxs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600395746.0
        },
        {
          "id": "g5o0nse",
          "author": "wordgromit",
          "body": "In my comment I made I said that this situation should be a teaching moment. Idk, I feel like I would find it hard to leave someone when I have agreed to marry them, and have a baby with them, over one insensitive comment. If this was a pattern of behavior, yeah obviously, leave, but I don't think there is enough context of their relationship to say \"yeah dump them\"",
          "created_utc": 1600399122.0
        }
      ]
    },
    {
      "id": "g5ogp4z",
      "author": "wordgromit",
      "body": "That is a fair point as well. I'm honestly conflicted. Personally, I have been trying not to let my eating disorder to get in the way of my life, but it has taken a lot for me to get here. So I really understand how devastating it must be to hear, and I think if I was in OP's place I would be in a really rough spot. I feel like with ed brain you use so many things that happen that you have no control over to keep justifying the punishment you inflict on your own body, which makes it hard to see who is abusing you. Part of me wants to have hope, and think of op's fiance to be acting in good faith, but you're also right, and if this is a pattern of behavior, op needs to get out.",
      "created_utc": 1600410811.0,
      "score": 2,
      "context": [
        {
          "id": "g5nkpld",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600390469.0
        },
        {
          "id": "g5nmc8i",
          "author": "wordgromit",
          "body": "Not everything is fixed by dumping someone",
          "created_utc": 1600391312.0
        },
        {
          "id": "g5nujxs",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600395746.0
        },
        {
          "id": "g5o0nse",
          "author": "wordgromit",
          "body": "In my comment I made I said that this situation should be a teaching moment. Idk, I feel like I would find it hard to leave someone when I have agreed to marry them, and have a baby with them, over one insensitive comment. If this was a pattern of behavior, yeah obviously, leave, but I don't think there is enough context of their relationship to say \"yeah dump them\"",
          "created_utc": 1600399122.0
        },
        {
          "id": "g5o1283",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600399350.0
        }
      ]
    }
  ]
}