{
  "id": "iwbeb9",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1600597058.0,
  "title": "Request: my boyfriend's family takes it as an offense that i don't eat much",
  "selftext": "hi! i (F19) live with my boyfriend (M21) and he's hands down the best partner i've ever had, ESPECIALLY in concerns to my recovery. he doesn't ask many questions, but whenever i have a boundary, he abides by it strictly, and he catches himself overstepping.\n\nto keep this anonymous, i won't say where he's from, but it's one of those cultures where food is definitely a love language.\n\ni've been struggling with bulimia since i was 15 and able to control what i ate and what i did with it. i was one of those girls that really seemed to just get more weight and curves overnight, and that was awful for me even without my mom's criticism, which inevitably sent me down that path. i was also addicted to working out, which was both something to do to get out of an awful house and something to punish myself.\n\nnow i'm at a healthier balance. i'm not perfect, by any means, but one of my things is that i keep track of what i eat. it's not obsessive for me, it's just something i can see at the end of the day and note that this is all the food i've kept down. i push myself every day, but i know when enough is enough.\n\nmy boyfriend's mother loves cooking for us, and my boyfriend understands that me eating everything she makes is, right now, out of the question for me. i really do try, you know? it's just that i see the amount of food there and my brain just tells me that i'm disgusting for even considering it and that i deserve the consequence of eating it. usually, it's not even a problem if i'm around the food in my apartment, because i have a lot of control now.\n\nbut if i'm at her house, it's just really hard to tell this sweet woman 'no' to almost everything.\n\nshe, my boyfriend's dad, and my boyfriend's sister ended up confronting my boyfriend about it, and said that my boyfriend's mom was really hurt because she thinks it means i don't like her food. to my boyfriend's credit, he tried to explain as much as he could without explicitly telling them i'm struggling, because he told me he thinks they'd either ask a lot of questions about it or they would walk on eggshells around me. this really devastated me, as i've never really had a family of my own and these people have been nothing but loving to me, and i really love them as well. i just don't even know what to say. they're from a country where an issue like this isn't necessarily a 'real' issue and is wildly untreated. is there anyone who was in a similar position? i don't even know where to turn now.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iwbeb9/request_my_boyfriends_family_takes_it_as_an/",
  "score": 84,
  "num_comments": 13,
  "comments": [
    {
      "id": "g5z108d",
      "author": "None",
      "body": "My SO is Mexican and I have a history of BED and bulimia and have a similar experience. However, we live about 250 miles from them, so the pressure upon visiting feels really hard sometimes. I really look forward to her food when I visit. If you enjoy the food, you should eat what you’re comfortable eating until you’re full. When you’re done, just say that you are full and if you liked it, maybe say something like “I don’t have room for more food, but I would love to take some leftovers home for later” or something? I also love cooking and have shown my SO’s mom an interest in learning her recipes and how to cook from her, which I think has helped.",
      "created_utc": 1600606360.0,
      "score": 47,
      "context": []
    },
    {
      "id": "g5yrte9",
      "author": "chachainthechacha",
      "body": "If youre comfortable enough, try talking to his family. Or asl your boyfriend to speak to them and tell them what to say by coming up with a plan on what you'recomfortabletelling them beforehand. Its common for certain cultures to not really understand how EDs work, but one thing I've noticed with these cases is that there is a strong response to authority. Instead of telling them that \"I have an ED\", you can try framing it as \"My doctor informed me that...\" and emphasize the medical rather than emotional aspect. It's not perfect, but it's a start and it get them interestested into looking into the topic to understand it better.",
      "created_utc": 1600602431.0,
      "score": 22,
      "context": []
    },
    {
      "id": "g5zac4m",
      "author": "newprofilewhodis1352",
      "body": "I had an ex like that. I had anorexia and ARFID and major gastro issues. Even NOW if I eat too much I’ll throw it all up. Like everything. My ex would get mad when he cooked for me and I picked at it. He was genuinely good at cooking but I couldn’t always eat.\n\nMaybe: 1. Ask for some to go? 2. Possibly let them (the parents) know the basics of your issue, without revealing way too much for yourself 3. Tell them you have gastro issues (because you really sort of do!) and that is the only reason.",
      "created_utc": 1600610389.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g60qlmn",
      "author": "graveyardho",
      "body": "Oooff. My fiancé is Mexican, and I still struggle (actively) with anorexia. His mom and grandparents have finally understood that I don't eat much, but it's a point of insult to his \"godmom\" (aka his best friend's mom). She gets very upset if I don't eat a lot, so I have to try to explain that I don't eat much at all, but it's delicious. (\"Yo no puedo comer mucho, pero la comida es deliciosa, gracias\"). Basically, just let her know that you don't eat a lot, or you have food allergies. Tell her how much you appreciate it, and that you will eat what you can, but that you just physically cannot eat a lot.",
      "created_utc": 1600631411.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g615sw4",
      "author": "Mental_Chip9096",
      "body": "I really feel you on this. It's been an issue in two relationships with boyfriends' families. Both cultures push food as love hard and took/take it as a personal rejection and insult when I don't indulge heartily in their food at holidays and visits. The current one, I have been avoiding holidays because of it. I found out he told them about my ED, because they brought up to him that they noticed I'm uncomfortable around meals. So I don't know, I wish I had an answer or good advice about it. I wish people could just worry about what they're eating and enjoy time spent together, and it could not always have to revolve around meals. But you're definitely not alone.",
      "created_utc": 1600637129.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g62cnz8",
      "author": "None",
      "body": "Eat some of it and ask if you can take  the rest home because you are full but love the food.",
      "created_utc": 1600659708.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g5yj6hm",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1600597058.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g5ysaur",
      "author": "wh0fuckingcares",
      "body": "No advice just......you say 'under control' alot for someone in am ED forum. If your so in control, why can't you eat her food? \n\nI'm really not trying to be harsh.",
      "created_utc": 1600602671.0,
      "score": -14,
      "context": []
    },
    {
      "id": "g5yr2ky",
      "author": "ItsYoshi64251",
      "body": "Mexico?",
      "created_utc": 1600602043.0,
      "score": -6,
      "context": []
    },
    {
      "id": "g5z11nq",
      "author": "converter-bot",
      "body": "250 miles is 402.34 km",
      "created_utc": 1600606375.0,
      "score": 12,
      "context": [
        {
          "id": "g5z108d",
          "author": "None",
          "body": "My SO is Mexican and I have a history of BED and bulimia and have a similar experience. However, we live about 250 miles from them, so the pressure upon visiting feels really hard sometimes. I really look forward to her food when I visit. If you enjoy the food, you should eat what you’re comfortable eating until you’re full. When you’re done, just say that you are full and if you liked it, maybe say something like “I don’t have room for more food, but I would love to take some leftovers home for later” or something? I also love cooking and have shown my SO’s mom an interest in learning her recipes and how to cook from her, which I think has helped.",
          "created_utc": 1600606360.0
        }
      ]
    },
    {
      "id": "g5z15ul",
      "author": "catpotatotots",
      "body": "She also said she is in recovery and is trying to find a good balance and is still working on herself. It’s hard to go back to eating everything with no guilt after so long",
      "created_utc": 1600606415.0,
      "score": 14,
      "context": [
        {
          "id": "g5ysaur",
          "author": "wh0fuckingcares",
          "body": "No advice just......you say 'under control' alot for someone in am ED forum. If your so in control, why can't you eat her food? \n\nI'm really not trying to be harsh.",
          "created_utc": 1600602671.0
        }
      ]
    },
    {
      "id": "g5zl5u9",
      "author": "None",
      "body": "Huh? Lol how is this not harsh? She clearly said she does eat her food. It's just his family wants to push more food on her then she feels comfortable eating at the moment. OP said she's in a good place with recovery and feels in control of her Ed but that she struggles mentally still. This is normal. Maybe you don't understand what is like to be afraid to push your boundaries, especially when you've been working really hard to get to a good place. Her having these thoughts does not mean she's not in a good place recovery wise.\n\nFeeling in control of your recovery and your Ed thoughts doesn't mean you can just go overeat easily, or feel comfortable eating a lot of food in front of someone. Or have a lot of other thoughts that the Ed pushes.",
      "created_utc": 1600614644.0,
      "score": 12,
      "context": [
        {
          "id": "g5ysaur",
          "author": "wh0fuckingcares",
          "body": "No advice just......you say 'under control' alot for someone in am ED forum. If your so in control, why can't you eat her food? \n\nI'm really not trying to be harsh.",
          "created_utc": 1600602671.0
        }
      ]
    },
    {
      "id": "g60y6ep",
      "author": "None",
      "body": "There’s a BUNCH of other cultures where stuffing your guests/ loved ones is expected and enforced.",
      "created_utc": 1600634421.0,
      "score": 2,
      "context": [
        {
          "id": "g5yr2ky",
          "author": "ItsYoshi64251",
          "body": "Mexico?",
          "created_utc": 1600602043.0
        }
      ]
    }
  ]
}