{
  "id": "iwxa0b",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1600681271.0,
  "title": "Request: My mother is constantly triggering my ED and I’m on the verge of relapse.",
  "selftext": "I had gone into a outpatient program for eating disorder in October of last year. I was there for four months and I felt that I made tons of progress. I was able to, for the most part, stay away from the ED urges. My mother was part of my recovery, going to therapy with me once a week and such, but never seemed to care how much her words could trigger me. So now it’s September and my mother has been continuously making comments about her own weight, needing to diet, needing to stop eating certain foods, since the pandemic has broken out. I tell her every time she makes a comment like that, that it’s triggering to me, and could she please talk to someone else about these things.  For a while I was able to brush off the comments but now reaching 6 months of hearing these comments almost everyday I’m start to break, and quickly. I’m already going back to some of my old habits. I’ve told her that her comments, about foods, dieting, and weight, have hurt me and lead to me to falling into a really bad mental spot with my eating disorder again. She responded with “You can’t blame me, It’s not my fault that you aren’t eating the right things.” I know deep down she is referring to the meal plan I had back at my outpatient program, but it made me feel destroyed. She says I can’t blame her, but it is her fault I’m back here. Just like a big part of me having an eating disorder is from her. I’ve already purged once, and have been getting on the scale every morning. She claims she just forgets that she can’t say those things, but I know it’s just because she wants to tell some one about what she’s doing. \nI can’t stop thinking about my body, my weight, and what I can’t eat. My mental state has plummeted. It kills me that my mother is the cause, but she has always been selfish. \nI’m genuinely just at a loss.\nIf I had the financial ability to move out I would do it in a heartbeat. But I’m currently in college and don’t have the finances to completely support myself. \n\nDoes anyone have any advice to get through this and to get through to my mother? I feel defeated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iwxa0b/request_my_mother_is_constantly_triggering_my_ed/",
  "score": 67,
  "num_comments": 9,
  "comments": [
    {
      "id": "g63z4zs",
      "author": "moonsoakedflow",
      "body": "This is going to sound SUPER passive aggressive. But at this point, you’ve done all you can to verbally communicate your problem to her and she has been blatantly disrespectful of your situation. My mother has issues like this. Next time she starts up, flat out turn around and walk away. You already tried to talk about it, the next step is to remove yourself from the situation. You can’t move out, I get that, so go outside or go to your room, maybe take a walk. When she asks why you’re walking away, let her know you’re choosing to walk away from something that is damaging to you, and if she can’t respect that, then she must not care much about your recovery. If you stop giving her a response and removing yourself from the situation, she eventually learn not to bring it up the topic that triggers you. It’s a really difficult situation and murky waters to traverse and I wish for you that you didn’t have to be in that situation but it sounds very much like you need to start setting up boundaries. \nI very much believe in you. The road to recovery isn’t always linear, so please don’t be hard on yourself. Just remember to keep trying, as difficult as it’s going to feel. And a side note, you don’t have to be disrespectful to her in this conversation, but you have tried what sounds like on multiple occasions to start an open dialogue with her, so in my opinion, from my life experience, the next step is to remove yourself. It may be challenging and it might sting both of you a little at first. But if you can set up those boundaries, you two will build more respect in the long run.",
      "created_utc": 1600701104.0,
      "score": 24,
      "context": []
    },
    {
      "id": "g63vq2g",
      "author": "liamdepam",
      "body": "This is very tricky. You've already done the most important thing and that's putting your cards out on the table. While I understand that people can't always take into account triggers, I think that in this situation your mother should definitely be listening; especially since she's been so involved in your therapy. Removing yourself from the situation is hard assuming you still live at home. What you could do is cut her off whenever she starts talking about food. \"Mom, I've told you this triggers me and I'm not willing to listen.\" This, depending how your mom is as a person, could potentionally piss her off. \n\nAnother option is having someone else talk to her on your behalf, preferably a therapist. My mom tends to not listen to me, but frankly when my therapist will tell her the exact same thing she does listen. \n\nMore drastic solutions would be to find your own place or, if you already live by yourself, tell her that you may need to spend some time out of touch until you're not on the verge of relapse. This could also open her eyes to the point where she will see how damaging her behavior is since you're basically breaking contact for a while to stay healthy.\n\nOf course, these are my own personal takes on the situation. I hope you find a way to solve this; but keep in mind that your health and wellbeing is priority number 1!",
      "created_utc": 1600699625.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g63dmb4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1600690631.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g63nqgd",
      "author": "None",
      "body": "Are there any professionals you're in touch with who could reiterate those things to her? E.g. a therapist or someone from an ED support line? It feels like it might be a bit of a long shot, but would hearing those things from someone other than you, like an authority figure, make her listen?",
      "created_utc": 1600695984.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g642xo0",
      "author": "ThestralBreeder",
      "body": "Is there someone from rehab you can contact - like a sponsor or therapist? If you have already purged once, the urge will grow stronger and stronger. Reach out to someone else. Do you have a father figure or grandparents in your life? Try and talk to them. Do you have any close best friends who are familiar with your struggle? Talk to them. In the interim, I would limit contact with your mom as much as possible even if you are in the same house. Aka - having your meals in a different room (ideally not your bedroom), wearing headphones around her, going out for walks etc. If she makes a comment you can say “you’ve made it clear that modifying your language for my recovery is in no way a priority for you and I am relapsing into dangerous behaviors. Unless you can make a firm commitment to changing, this is how it has to be for me to try and maintain sanity. While I cannot expect complete strangers to anticipate my ED triggers, it is the minimum I can expect from my own mother.” Good luck OP! I am also in recovery.",
      "created_utc": 1600702724.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g66qhxy",
      "author": "emilyl14",
      "body": "Girlll, it sounds like your literally telling my story. I cant believe our moms and situation is so similar. The worst this is my mom doesn't even care to ask me how I am or my mental state Even when I bring it up or ask for help she just moves on. I wish u the best and that u find a solution to this problem as I know how mentally damaging it is, just know you're not alone and u have people rooting for u. Most importantly u have every right to be mad and frustrated no matter what she has done or will say to rationalize her behaviour.",
      "created_utc": 1600750587.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g630dim",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1600681271.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g64zzy9",
      "author": "Rawsourceful",
      "body": "Don’t listen to anything negative only focus on your goal. Nobody can control you and don’t let anyone control you by reminding yourself that.  I was in the same position and only I could change my life, whether that means distancing yourself and putting yourself first. And if she wants to gaslight you let her act the child. In the end you are being the adult to take care of your one and only life.  Repeat over and over in your head that you can do it and that whatever she says isn’t true. Prove her wrong as well as yourself. Also tough pill to swallow but you bringing up her causing you to not eat in the end is your fault. You decided to let things affect you or not. If you truly seek treatment start doing instead of listening. Whether your own self defeating thoughts, victim mindset as well as blaming others for your own problems.",
      "created_utc": 1600716463.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g63vy33",
      "author": "liamdepam",
      "body": "Edit; I misread the last sentence about not being able to move out so please ignore half my comment aicnkssnsn",
      "created_utc": 1600699721.0,
      "score": 3,
      "context": [
        {
          "id": "g63vq2g",
          "author": "liamdepam",
          "body": "This is very tricky. You've already done the most important thing and that's putting your cards out on the table. While I understand that people can't always take into account triggers, I think that in this situation your mother should definitely be listening; especially since she's been so involved in your therapy. Removing yourself from the situation is hard assuming you still live at home. What you could do is cut her off whenever she starts talking about food. \"Mom, I've told you this triggers me and I'm not willing to listen.\" This, depending how your mom is as a person, could potentionally piss her off. \n\nAnother option is having someone else talk to her on your behalf, preferably a therapist. My mom tends to not listen to me, but frankly when my therapist will tell her the exact same thing she does listen. \n\nMore drastic solutions would be to find your own place or, if you already live by yourself, tell her that you may need to spend some time out of touch until you're not on the verge of relapse. This could also open her eyes to the point where she will see how damaging her behavior is since you're basically breaking contact for a while to stay healthy.\n\nOf course, these are my own personal takes on the situation. I hope you find a way to solve this; but keep in mind that your health and wellbeing is priority number 1!",
          "created_utc": 1600699625.0
        }
      ]
    },
    {
      "id": "g63dn1h",
      "author": "dadbot_2",
      "body": "Hi so sorry you're dealing with this and i wish i had some better advice, I'm Dad👨",
      "created_utc": 1600690643.0,
      "score": 2,
      "context": [
        {
          "id": "g63dmb4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1600690631.0
        }
      ]
    }
  ]
}