{
  "id": "iy745h",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1600854387.0,
  "title": "Request: Hunger cues",
  "selftext": " \n\nDoes anyone else struggle with their bodies hunger cues? I’ve been on and off recovered for years and I still struggle with monitoring when my body is hungry and when I’m full. I often won’t eat until I feel starving and when I do eat I will usually end up over eating because I eat until my stomach hurts especially if I still have food on the plate. I think this is because when recovering your often encouraged/forced to eat everything. Because of all this I have no sense of my bodies real hunger cues and I don’t really know how to fix it and the overeating just makes me feel badly and causes relapses. Does anyone have advice for me?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iy745h/request_hunger_cues/",
  "score": 57,
  "num_comments": 12,
  "comments": [
    {
      "id": "g6b4xf8",
      "author": "bpurly",
      "body": "Did you ever have a period of time where you ate a lot more than normal? I thought I was recovered until I was forced to eat 2500-3000 calories daily to get my period back. It was only during this time that my real hunger and fullness signals actually came back. Before, they were blunted by my relatively low caloric intake even though I thought I was recovered. This could be the case for you.",
      "created_utc": 1600861797.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g6azxvq",
      "author": "kinkyandconcerned",
      "body": "Because of an ED, as well as a (probably related but who knows) digestive issue, I rarely get hunger cues, I often only realise I need to eat when I start to feel faint.    \n\nThat being said, I try to have times in the day that I eat at, they can change but its like okay I need to eat at some point this morning, I need to have at least a snack by this time in the afternoon, and I need to eat tonight. \n  \nI have some safe foods or foods that are easy to prepare or easy for my body to digest that I keep on standby, because some days I am craving food so Ill make whatever Im craving but other times, I need to fall back on the safe food list.    \nStuff like loaded oatmeal, with banana and peanut butter etc (Ik for myself oatmeal gives me longlasting energy so even if im not hungry ik if I have oatmeal I will be sufficiently fed until my next designated meal)    \n\nIts hard because so much advice for eating healthy is eat intuitively, when what is healthy for me to is to override what is intuitive?\n If that makes any sense. \n\nI guess tldr: Have set times you eat even if you dont really want to and even if its only a little, have foods you know you can eat and that will give you energy for times when you have no inspiration and you just need to get it done     \n\nsorry for the ramble hope any of this helps.",
      "created_utc": 1600856823.0,
      "score": 12,
      "context": []
    },
    {
      "id": "g6b0e3r",
      "author": "fakeplasticturnips",
      "body": "I spoke to my psychologist about this yesterday and he recommended I plan my meals the night before and not skip meals eat outside of that. That doesn’t really help with intuitive eating though... perhaps you could try something to get in touch with your body- \n\nmeditation (I highly recommend Headspace!) \neating slowly\nput less food on your plate but still a reasonable amount\nplan to eat at 3 hour intervals and check in with yourself asking yourself how you feel both emotionally and hunger wise \n\nI think it’s important not to put pressure on yourself to be totally in touch with your hunger cues. It can take a very very long time to develop a normal relationship with food and your body post ED.",
      "created_utc": 1600857332.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g6brz3r",
      "author": "None",
      "body": "I really suck at listening to my hunger cues. Sometimes it goes to both extremes were I don’t eat all day to I over eat. I really wish I can learn how to read my hunger cues but I can’t. I feel like I have such a long time with disordered eating that I trained myself to ignore my hunger cues.",
      "created_utc": 1600875525.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g6biugq",
      "author": "IzzyDitz",
      "body": "This might just be a me thing, but when I miss the hunger pangs and skip a meal, I get wildly anxious for no reason. It took awhile to figure out but now I try really hard not to skip a meal because the anxiety attack just isn't worth it.",
      "created_utc": 1600870851.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g6btfvm",
      "author": "reallymissinvine",
      "body": "I didn't really have hunger cues either when I got into my recovery full force. I can verify that when you're recovering, it does feel like that you have to eat everything on your plate. \n\nMy advice would be to eat every few hours, so that when a meal comes, you're not starving and feel like eating a horse when you've only got room for a pony. I used to eat about every 2-3 hours, whether it be a snack or a meal, just something. Then when dinner would come, I'd feel fuller and more noticeably but not uncomfortably satisfied. It takes a bit to get used to throwing food away when you think that you need to eat all of it, but you'll get there :).\n\nYour situation is very similar to mine, and including snacks in my diet really helped me recover",
      "created_utc": 1600876244.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6bplle",
      "author": "bpurly",
      "body": "Ok I reread your post and the reason your hunger cues haven't come back is because you're still engaging/flirting with restriction. That needs to go. Once you cut out the restriction and truly eat however much you want (even if that means overeating for a period of time) your hunger cues WILL eventually come back. The on and off restriction is what's causing this.",
      "created_utc": 1600874343.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g6axvpw",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1600854387.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6cbnal",
      "author": "jenny_mac_",
      "body": "Hi! I struggle with this, too. I agree with the other suggestion to eat at designated times. Like “I haven’t eaten in ~3-4 hours, I should probably have a snack”. Or preemptively eat to avoid that primal level of hunger such as “I won’t be able to eat for another few hours so i should have a snack”. I’d recommend the Intuitive Eating workbook by Tribole and Resch. There is a hunger and fullness scale and other exercises to work on attunement. Also, hunger cues come in many forms (not just grumbling tummy), such as just thoughts of food, irritability, etc. \ngood luck - you got this!",
      "created_utc": 1600885117.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6d0ycs",
      "author": "schloooooo",
      "body": "I just went through this!! I fixed my hunger cues via mindfulness. This is not to be confused with intuitive eating; I'm not there yet. But what I did do was start setting times about when to eat and force myself to eat at/around those times. For me, I ate three meals and had two snacks, because I realized that my binge eating kicked in when I waited too long to eat (and inevitably this led to a \"fuck it\" mentality and overeat). The best way to go about this is to see a nutritionist, who will help point you in the right direction about what your meals should consist of (a good amount take insurance, and some specialize in eating disorders) so that you are getting enough proteins, fats, and carbs. \n\nI will say, it takes time, it's not super easy, and you really do have to learn to trust the process, but my hunger cues are a lot more assertive, regular, and manageable. Don't give up, this is completely fixable!! You are worth it",
      "created_utc": 1600898093.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6ddcsk",
      "author": "jenny_mac_",
      "body": "I’ll also add that our appetite can fluctuate with our menstrual cycle. I get much more hungry the week prior to my moon, and then appetite drops off while bleeding. Something you might want to tune into!",
      "created_utc": 1600905527.0,
      "score": 2,
      "context": [
        {
          "id": "g6cbnal",
          "author": "jenny_mac_",
          "body": "Hi! I struggle with this, too. I agree with the other suggestion to eat at designated times. Like “I haven’t eaten in ~3-4 hours, I should probably have a snack”. Or preemptively eat to avoid that primal level of hunger such as “I won’t be able to eat for another few hours so i should have a snack”. I’d recommend the Intuitive Eating workbook by Tribole and Resch. There is a hunger and fullness scale and other exercises to work on attunement. Also, hunger cues come in many forms (not just grumbling tummy), such as just thoughts of food, irritability, etc. \ngood luck - you got this!",
          "created_utc": 1600885117.0
        }
      ]
    }
  ]
}