{
  "id": "iyl1qd",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1600901063.0,
  "title": "Request: Getting things off my chest + advice (tw: suicide)",
  "selftext": "(sorry guys..... i'm really going through it lol...)\n\nHi friends :)\nI'm writing this out of total desperation. I joined reddit a couple minutes ago just so I could get this mess called my life story off of my chest for the first time ever.\n\nSo to start, I am female, just turned 18, 5'10\" and xxx lbs (normal BMI range). I have been struggling with body image/ eating/ weight since 7th grade, puberty sort of kick-starting it all. I grew to my final height in about a year, which caused me to be hungry CONSTANTLY. I didn't think too much about it because my weight was consistent and I was getting plenty of exercise with school sports. \nNow we go to the beginning of ninth grade; the worst year of my life, the year I almost didn't make it through. \n\nLots of changes this year. I had just moved to a new place, I went from a small neighborhood to a secluded farm 40 minutes away from town (which I didn't really mind.) A new school, a highschool  where I know absolutely no-one. A house that required almost 100k worth of renovations. And a bipolar mother who had been 3 months without her medication. And a father with extreme anger issues.\nI cried every day for at least an hour. My parents would constantly scream and swear at each other, my father would break things, I was treated as a glorified punching bag for both of them during the heat of it. I should also mention my anxiety, social anxiety, depression and ADHD (only the depression has been diagnosed professionally.)  Who knew renovations could be so terrifying? I think it gave me ptsd, too. I never liked being yelled at as a child, but these days even a loud laugh from someone makes my hair raise and brings tears to my eyes.   \nThis is when I noticed my eating behaviors. It was always when the house was quiet, like I was terrified a fight would break out any moment. I would eat a lot. Tons. I would stop, get anxious again and then keep eating. Everyday. I think I took to this because it kept my brain and body busy, and the only thing I had to worry about was getting too full. It got much, much worse when highschool actually started. I was too scared to eat my lunch at school (isn't social anxiety the best?) so I would get home and binge for a while, continuing after dinner. Halfway through grade nine, the depression began to creep in. My parents were too busy trying to kill each other to notice I guess, the binging continued. My social anxiety was life threatening at this point. I was scared ALL day, everything made me jump, even walking in the halls. I would shake for the rest of the day after answering a question. I guess all this fear made me more hungry, because I was now binging until the verge of vomiting. I wanted to die. I was going to drown myself in the river at the front of my property, wearing my school bag full of books. One, so it would weigh me down, two, so my parents would know it was school  that pushed me to do it. \n\nI am holding TONS of probably important details back but I really don't want to be here forever, so I'll speed things up.\n\nBasically, my dog (my best friend) kept me from killing myself, I realized leaving him behind was selfish and I would miss him in hell. I cried more, till I would vomit, my parents finally noticed and took me out of school. I slowed down on my binging and tried using exercise as an escape, and it actually worked. Feeling better now but the other side of depression took its toll on me. I was lazy, grumpy, unmotivated, and emotionless. Halfway through grade 10 and the reno is complete. My parents actually start to patch up their marriage; going to counseling, my mom started new meds and dad tried anger meds.  I am now failing grade 10. I don't want to die but I don't want to live, so I sleep. I go back to school for grade 11 as I have no other choice. Luckily, my depression ironically made me so numb that my social anxiety could not compete anymore. My binging doesn't really occur anymore, I spend most of my time working out. I feel a bit better that summer. My parents are doing ok and I rarely binge, yet I slow down on my exercise and start making tons of desserts and delicious food. I eventually became yyy lbs (just beyond normal weight range) by the start of grade 12.\n\nHere is where I discovered my current problem; almost no self control around certain foods. It's really strange, when I bake cookies, for example, I end up eating the whole batch of them by the end of the day. For some savory things I do the same,  only if I really like them. I forgot to mention, I have always been late for class, almost everyday, because it is very hard for me to get dressed. I change 1000 times and just end up being angry or crying.  Still happens today. \nReally gonna speed it up now, we're almost there!! \n\nWhen quarantine started, I took the opportunity to shed some lbs. I didn't think I could do it, but I ended up getting to my current weight, xxx lbs. I exercised everyday and used an app to count calories. It took about 4 months but I was super proud of myself. I still had no control over \"yummy\" foods though; if I over ate I would stay up until 7am the next morning to starve myself. I could never be successful if dessert was brought into the house or if I went out with friends. I decide to stop my diet  because counting calories everyday was starting to become mentally draining for me.\n\nNow we have reached current day. I have gotten used to the weight I am now and have started acting similar to how I was at yyy. I'm starting to hate how I look again. I always say my fat looks very unnatural, and I think how I gained weight influences this. I am not counting calories but watching my portions. I have been doing well until a couple hours ago, when my mother made chocolate chip cookies, I ate 6, meaning I cannot have dinner tonight. Worst part is, I injured my leg the other day and cannot run to burn it off.\n \nIf you have any advice for \"no self control ,\" please, please let me know. I just want to eat normally for once, I want to be able to enjoy something without any regrets or weight gain.\n\nThank you for reading! I know this was a very long, very heavy read. I have been typing for about an hour now so excuse the grammatical errors the best you can. \n\nThanks once more  <3",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/iyl1qd/request_getting_things_off_my_chest_advice_tw/",
  "score": 44,
  "num_comments": 9,
  "comments": [
    {
      "id": "g6duxy5",
      "author": "None",
      "body": "Hun we're the same age, I'd be 100% down for you to dm me anytime and be friends/let you vent/whatever else you need",
      "created_utc": 1600917372.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g6e7fhw",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1600926474.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g6e8xk9",
      "author": "jenny_mac_",
      "body": "Had to break it into two parts:\n\nPart 1 -\n\nFirst off, if you ever have sucidal thoughts, PLEASE reach out to your local suicide hotline. In the USA it's: 800-273-8255. Just know: you have a purpose to be here. You matter. Your life matters. You are healing and growing and your story can help others heal and grow. Don't forget how valuable your life is. \n\nSecond, PLEASE STOP COUNTING CALORIES AND PLEASE ALLOW YOURSELF TO EAT. No matter what you have eaten throughout the day or day before or how much you exercise, you are allowed to eat!! When I was counting calories to loose weight, my Dr. told me the amount that my app was telling me to eat was the very baseline for my body to exist for 1 day. No thinking, no moving, no other energy expulsion. Living takes calories and those apps are super unhealthy for you, especially at your age! Please ditch the apps and calorie counting. Also, I highly recommend you stop weighing yourself, body checking, overexercising etc. This can seem like a lot of behaviors to shift at once so be patient with yourself, but know that you CAN change!\n\nThird, be proud of yourself for reaching out and being able to talk about these intense experiences and your struggles. Both are HUGE steps towards healing so congrats on this first big step!\n\nFourth, Here we go, my apologies for the insanely long response but I hope it's helpful!\n\nI would highly recommend seeing a therapist or counselor. It sounds like you have experienced repeated severe trauma that is and will continue to be the root cause of your disordered eating. Do not blame yourself or feel that you are broken. Your disordered eating was protecting you against the pain and trauma that you were experiencing. It was/is a coping mechanism, a protective force in your life. But it is not serving your full best interest so it's time to learn to find new coping mechanisms and ways to heal. The healing and recovery process is difficult, non-linear (meaning ups and downs), but TOTALLY worth it. You're young and already on the right path by reaching out and having self awareness. You're doing great! However, to further your healing process, I’d highly recommend seeking help from an ED-specializing therapist who practices the health at every size (HAES) and intuitive eating approach. You can search for providers on the [HAES](https://haescommunity.com/) website or search your town, the type of provider, and \"intuitive eating or health at every size\" in Google. With COVID, lots of therapists are doing virtual sessions so you don't necessarily need someone local. I'd look into HAES and intuitive eating yourself (there are many books, podcasts, instagram accounts, etc. devoted to these. See my below list for some starters). These two theories have been MONUMENTAL in my recovery and finally feeling SANE and normal around food/eating. I used to count calories and obsess about my weight, too. Now I eat whatever I want, don't track anything, and genuinely trust my body to know what it needs. I'm not perfect, I sometimes overeat or eat lots of \"unhealthy\" foods but that is literally considered NORMAL eating. The difference is now I do not feel guilt/shame nor do I feel I need to overexercise or restrict to compensate for it. I just move on and nourish my body. ",
      "created_utc": 1600927810.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g6d6996",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1600901064.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6fn6b9",
      "author": "BlondeHerbivore",
      "body": "Hey thanks for sharing. Life sounds like it’s been super, super hard for you. A lot of that seems to come from your home Environment— won’t it be great when you can move out? Then you can get your own dog, and maybe even a cat! \n\nThere’s nothing I can say here that will fix the deep pain you feel, only years of therapy can do that. I know you don’t know me, but please, person to person; go to therapy. Find a health professional you click with and then stick with it.\n\nTherapists help you navigate triggers and emotions, which you have a lot of right now it seems. Figuring them out alone feels impossible sometimes, but with the right therapist, it becomes doable. :) best of luck and thanks for sharing",
      "created_utc": 1600961862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g6f625i",
      "author": "None",
      "body": "Hi, this is my post! This is so kind, thank you! I don't plan on using reddit that much but if I'm ever feeling low I'll keep you in mind!! 🥰",
      "created_utc": 1600953493.0,
      "score": 1,
      "context": [
        {
          "id": "g6duxy5",
          "author": "None",
          "body": "Hun we're the same age, I'd be 100% down for you to dm me anytime and be friends/let you vent/whatever else you need",
          "created_utc": 1600917372.0
        }
      ]
    },
    {
      "id": "g6f2d1v",
      "author": "None",
      "body": "Hi, this is my post!\nThank you so much for commenting, it really means a lot that someone took the time to read this! I can totally see what you're saying. I always scorn myself when there's \"unhealthy\" food around so you're probably pretty on point about restricting food groups. I'm gonna to try and be less hard on myself when I choose to eat something. Thank you again for the comment <3",
      "created_utc": 1600951242.0,
      "score": 3,
      "context": [
        {
          "id": "g6e7fhw",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1600926474.0
        }
      ]
    },
    {
      "id": "g6e8z10",
      "author": "jenny_mac_",
      "body": "Part 2-\n\nWe live in what ED therapists and nutritionists call \"Diet culture\". It is the mainstream culture and industry of dieting, weight loss, fitness, healthy eating, clean eating etc. While these seem like they are good for us, it is SCIENTIFICALLY proven that diets do not actually result in long term weight loss. Short term yes, but in the long term, almost all people will regain the weight they lost and MORE. Because diets go against our biological urge to survive. All of the humans before us went through famines so our bodies have adapted to hold onto and crave calories in times of scarcity. When we experience deprivation, whether it is physical (restricting food/nutrients) or mental (\"I can't eat this, I shouldn't eat this, this food is bad, I am guilty if I eat this food...etc.), our bodies immediately rebel against us and we overeat because our bodies are scared of being deprived. Dieting and restriction goes against our body's innate biology. This is why diets fail and Diet culture LIES to us by telling us it is our fault for failing and we just need to try harder or have more will power. Restriction = deprivation = biological response to overeat = fear of weight gain/guilt about overeating = restriction. And it repeats. This is called the binge/restrict cycle. It's like a pendulum. The farther you push towards restriction, the farther it will swing back towards binging. This is why you feel crazy around food. As well as the fact that you have had trauma and pain and that food is a cheap, available, and effective coping mechanism that temporarily soothes emotional pain. But don't worry, you're on your healing path now!\n\nI would HIGHLY recommend working with a therapist to heal the trauma you've experienced and to help rewire your mindset around food, body image, and trusting your body through intuitive eating. Many modern treatment centers often overlook this step and only treat the eating issues, not the mental/emotional patterns, trauma, etc. that is causing the disordered eating. Think of disordered eating as the symptom caused by some unaddressed internal issues (i.e trauma, anxiety/stress, depression, perfectionism, etc.). Work with a therapist to work through suppressed emotions, memories, and so on, and really help make sense of what you've gone through and what you're going though. Therapists can help you develop self reflection practices, healthy coping mechanisms, self care routines, and more, so you don't rely on the disordered eating to manage trauma/stress. (I used disordered eating and compulsive overexercising to manage stress during college/life transitions, and have learned that I need to prioritize self care (journaling, joyful movement, fun, etc in order to feel mentally balanced.)\n\nI highly recommend JOURNALING! Journal your thoughts, feelings, emotions, etc. Practice self compassion, let yourself cry when you need to, and most of all FORGIVE yourself. We are not perfect and we are always learning. Forgiveness is huge. Explore creativity, explore expression through dance, song, colors, cooking, whatever calls to you!\n\nRegarding body image: It's virtually impossible to live in western society without some form of body image struggles. Working on body image and reversing fat-phobia are KEY in recovery. Here's something I wrote to another redditor struggling with negative body image thoughts: Whenever I have a body conscious/bad body image thought, I try to recognize it as a \"negative body image thought\" and respond with something like \"I am not my body\" or \"my body does not define me\" or \"my body is my vessel\" or \"the shape of my body does not matter\" or \"all bodies are worthy of love\"... find some little sayings that resonate with you. I'd recommend following fat-positive social media accounts (models, athletes, influencers, etc.) that are actively celebrating diverse body types and people in larger bodies. This will help with restructuring your mindset to be less fat-phobic.\n\nIn addition, I have found journaling about my feelings to be super helpful as I remind myself where our fat phobia/body dissatisfaction comes from in the first place. We live in a society/economy that glorifies a body type that only a small fraction of the female population naturally has. Capitalism media/marketing has insidious psychological tactics to make you hate your body and fear being \"fat\" in order to SELL YOU THINGS (diets, exercise products, beauty products, clothes, the list goes on)! They profit off of self hatred they instill within us- It's truly evil. We must remember that \"modern\" times are only a glimpse of human history. Women in larger bodies have been worshiped for millennia by other cultures since they saw the full feminine form is a sign of fertility, beauty, and prosperity. See these prehistoric goddess statues for example. Try to remember that we have all been subconsciously programmed by social construction, media, and marketing to fear the fat on our bodies. There is truly NOTHING wrong with your body no matter what size it is. Journaling down these reminders and self affirmations to encourage body acceptance will help restructure your mindset. It is totally possible to create new neural networks (brain connections = thought patterns) and overcome the root cause of your struggles!\n\nAnd please don't hesitate to DM me if you ever need more support. BEST OF LUCK BEAUTIFUL SOUL - YOU GOT THIS! <3\n\nMore resources:\n\n* The food psych podcast\n* the love food podcast\n* the fuck it diet podcast\n* Eating in the light of the moon\n* Intuitive eating book and workbook\n* Local support groups\n* Link to MORE resources: [https://alissaswankcounseling.com/new-page](https://alissaswankcounseling.com/new-page)\n* instagrams such as: nourishandeat, danaisabellaaa, bodyposipanda, bravespacenutrition",
      "created_utc": 1600927849.0,
      "score": 3,
      "context": [
        {
          "id": "g6e8xk9",
          "author": "jenny_mac_",
          "body": "Had to break it into two parts:\n\nPart 1 -\n\nFirst off, if you ever have sucidal thoughts, PLEASE reach out to your local suicide hotline. In the USA it's: 800-273-8255. Just know: you have a purpose to be here. You matter. Your life matters. You are healing and growing and your story can help others heal and grow. Don't forget how valuable your life is. \n\nSecond, PLEASE STOP COUNTING CALORIES AND PLEASE ALLOW YOURSELF TO EAT. No matter what you have eaten throughout the day or day before or how much you exercise, you are allowed to eat!! When I was counting calories to loose weight, my Dr. told me the amount that my app was telling me to eat was the very baseline for my body to exist for 1 day. No thinking, no moving, no other energy expulsion. Living takes calories and those apps are super unhealthy for you, especially at your age! Please ditch the apps and calorie counting. Also, I highly recommend you stop weighing yourself, body checking, overexercising etc. This can seem like a lot of behaviors to shift at once so be patient with yourself, but know that you CAN change!\n\nThird, be proud of yourself for reaching out and being able to talk about these intense experiences and your struggles. Both are HUGE steps towards healing so congrats on this first big step!\n\nFourth, Here we go, my apologies for the insanely long response but I hope it's helpful!\n\nI would highly recommend seeing a therapist or counselor. It sounds like you have experienced repeated severe trauma that is and will continue to be the root cause of your disordered eating. Do not blame yourself or feel that you are broken. Your disordered eating was protecting you against the pain and trauma that you were experiencing. It was/is a coping mechanism, a protective force in your life. But it is not serving your full best interest so it's time to learn to find new coping mechanisms and ways to heal. The healing and recovery process is difficult, non-linear (meaning ups and downs), but TOTALLY worth it. You're young and already on the right path by reaching out and having self awareness. You're doing great! However, to further your healing process, I’d highly recommend seeking help from an ED-specializing therapist who practices the health at every size (HAES) and intuitive eating approach. You can search for providers on the [HAES](https://haescommunity.com/) website or search your town, the type of provider, and \"intuitive eating or health at every size\" in Google. With COVID, lots of therapists are doing virtual sessions so you don't necessarily need someone local. I'd look into HAES and intuitive eating yourself (there are many books, podcasts, instagram accounts, etc. devoted to these. See my below list for some starters). These two theories have been MONUMENTAL in my recovery and finally feeling SANE and normal around food/eating. I used to count calories and obsess about my weight, too. Now I eat whatever I want, don't track anything, and genuinely trust my body to know what it needs. I'm not perfect, I sometimes overeat or eat lots of \"unhealthy\" foods but that is literally considered NORMAL eating. The difference is now I do not feel guilt/shame nor do I feel I need to overexercise or restrict to compensate for it. I just move on and nourish my body. ",
          "created_utc": 1600927810.0
        }
      ]
    },
    {
      "id": "g6f5vy1",
      "author": "None",
      "body": "Hi, this is my post.\nThank you so much for such a detailed reply, it feels amazing knowing someone cares about my situation! Thank you for all the resources you've linked, I'll be sure to check them out!! I'll try my best to give you some details I missed in my initial post. \nFirst of all, the suicide hotline is greatly appreciated. As of today, I no longer have these thoughts and have been coping very well with my depression. It is honestly pretty embarrassing for me to talk about my ed tendencies because of how important health is to me regarding other people. Some of the things you've mentioned about body positivity, HAES, diet culture, and nasty, nasty capitalism are similar things I preach to my friends and family! It is crazy the way my brain has contorted me into thinking everyone but me is beautiful in their own skin! The last thing I'll touch on is therapy. I am in a pretty sticky situation when it comes to it. I have asked my doctor for a referral a couple times now, but because my bmi is normal she believes that the clinic would refuse me (maybe because my case isn't \"extreme\" enough?) I have told my mother about what I'm going through but she doesn't actively give me support. I suppose now that I'm 18 I can start booking my own therapy sessions but I'm still looking for a good therapist that specializes in eating disorders.\n\nThank you again for everything you said, it truly warms my heart and you couldn't believe how grateful I am for all this advice! You are also a beautiful soul and I wish you the best ^^",
      "created_utc": 1600953391.0,
      "score": 2,
      "context": [
        {
          "id": "g6e8xk9",
          "author": "jenny_mac_",
          "body": "Had to break it into two parts:\n\nPart 1 -\n\nFirst off, if you ever have sucidal thoughts, PLEASE reach out to your local suicide hotline. In the USA it's: 800-273-8255. Just know: you have a purpose to be here. You matter. Your life matters. You are healing and growing and your story can help others heal and grow. Don't forget how valuable your life is. \n\nSecond, PLEASE STOP COUNTING CALORIES AND PLEASE ALLOW YOURSELF TO EAT. No matter what you have eaten throughout the day or day before or how much you exercise, you are allowed to eat!! When I was counting calories to loose weight, my Dr. told me the amount that my app was telling me to eat was the very baseline for my body to exist for 1 day. No thinking, no moving, no other energy expulsion. Living takes calories and those apps are super unhealthy for you, especially at your age! Please ditch the apps and calorie counting. Also, I highly recommend you stop weighing yourself, body checking, overexercising etc. This can seem like a lot of behaviors to shift at once so be patient with yourself, but know that you CAN change!\n\nThird, be proud of yourself for reaching out and being able to talk about these intense experiences and your struggles. Both are HUGE steps towards healing so congrats on this first big step!\n\nFourth, Here we go, my apologies for the insanely long response but I hope it's helpful!\n\nI would highly recommend seeing a therapist or counselor. It sounds like you have experienced repeated severe trauma that is and will continue to be the root cause of your disordered eating. Do not blame yourself or feel that you are broken. Your disordered eating was protecting you against the pain and trauma that you were experiencing. It was/is a coping mechanism, a protective force in your life. But it is not serving your full best interest so it's time to learn to find new coping mechanisms and ways to heal. The healing and recovery process is difficult, non-linear (meaning ups and downs), but TOTALLY worth it. You're young and already on the right path by reaching out and having self awareness. You're doing great! However, to further your healing process, I’d highly recommend seeking help from an ED-specializing therapist who practices the health at every size (HAES) and intuitive eating approach. You can search for providers on the [HAES](https://haescommunity.com/) website or search your town, the type of provider, and \"intuitive eating or health at every size\" in Google. With COVID, lots of therapists are doing virtual sessions so you don't necessarily need someone local. I'd look into HAES and intuitive eating yourself (there are many books, podcasts, instagram accounts, etc. devoted to these. See my below list for some starters). These two theories have been MONUMENTAL in my recovery and finally feeling SANE and normal around food/eating. I used to count calories and obsess about my weight, too. Now I eat whatever I want, don't track anything, and genuinely trust my body to know what it needs. I'm not perfect, I sometimes overeat or eat lots of \"unhealthy\" foods but that is literally considered NORMAL eating. The difference is now I do not feel guilt/shame nor do I feel I need to overexercise or restrict to compensate for it. I just move on and nourish my body. ",
          "created_utc": 1600927810.0
        },
        {
          "id": "g6e8z10",
          "author": "jenny_mac_",
          "body": "Part 2-\n\nWe live in what ED therapists and nutritionists call \"Diet culture\". It is the mainstream culture and industry of dieting, weight loss, fitness, healthy eating, clean eating etc. While these seem like they are good for us, it is SCIENTIFICALLY proven that diets do not actually result in long term weight loss. Short term yes, but in the long term, almost all people will regain the weight they lost and MORE. Because diets go against our biological urge to survive. All of the humans before us went through famines so our bodies have adapted to hold onto and crave calories in times of scarcity. When we experience deprivation, whether it is physical (restricting food/nutrients) or mental (\"I can't eat this, I shouldn't eat this, this food is bad, I am guilty if I eat this food...etc.), our bodies immediately rebel against us and we overeat because our bodies are scared of being deprived. Dieting and restriction goes against our body's innate biology. This is why diets fail and Diet culture LIES to us by telling us it is our fault for failing and we just need to try harder or have more will power. Restriction = deprivation = biological response to overeat = fear of weight gain/guilt about overeating = restriction. And it repeats. This is called the binge/restrict cycle. It's like a pendulum. The farther you push towards restriction, the farther it will swing back towards binging. This is why you feel crazy around food. As well as the fact that you have had trauma and pain and that food is a cheap, available, and effective coping mechanism that temporarily soothes emotional pain. But don't worry, you're on your healing path now!\n\nI would HIGHLY recommend working with a therapist to heal the trauma you've experienced and to help rewire your mindset around food, body image, and trusting your body through intuitive eating. Many modern treatment centers often overlook this step and only treat the eating issues, not the mental/emotional patterns, trauma, etc. that is causing the disordered eating. Think of disordered eating as the symptom caused by some unaddressed internal issues (i.e trauma, anxiety/stress, depression, perfectionism, etc.). Work with a therapist to work through suppressed emotions, memories, and so on, and really help make sense of what you've gone through and what you're going though. Therapists can help you develop self reflection practices, healthy coping mechanisms, self care routines, and more, so you don't rely on the disordered eating to manage trauma/stress. (I used disordered eating and compulsive overexercising to manage stress during college/life transitions, and have learned that I need to prioritize self care (journaling, joyful movement, fun, etc in order to feel mentally balanced.)\n\nI highly recommend JOURNALING! Journal your thoughts, feelings, emotions, etc. Practice self compassion, let yourself cry when you need to, and most of all FORGIVE yourself. We are not perfect and we are always learning. Forgiveness is huge. Explore creativity, explore expression through dance, song, colors, cooking, whatever calls to you!\n\nRegarding body image: It's virtually impossible to live in western society without some form of body image struggles. Working on body image and reversing fat-phobia are KEY in recovery. Here's something I wrote to another redditor struggling with negative body image thoughts: Whenever I have a body conscious/bad body image thought, I try to recognize it as a \"negative body image thought\" and respond with something like \"I am not my body\" or \"my body does not define me\" or \"my body is my vessel\" or \"the shape of my body does not matter\" or \"all bodies are worthy of love\"... find some little sayings that resonate with you. I'd recommend following fat-positive social media accounts (models, athletes, influencers, etc.) that are actively celebrating diverse body types and people in larger bodies. This will help with restructuring your mindset to be less fat-phobic.\n\nIn addition, I have found journaling about my feelings to be super helpful as I remind myself where our fat phobia/body dissatisfaction comes from in the first place. We live in a society/economy that glorifies a body type that only a small fraction of the female population naturally has. Capitalism media/marketing has insidious psychological tactics to make you hate your body and fear being \"fat\" in order to SELL YOU THINGS (diets, exercise products, beauty products, clothes, the list goes on)! They profit off of self hatred they instill within us- It's truly evil. We must remember that \"modern\" times are only a glimpse of human history. Women in larger bodies have been worshiped for millennia by other cultures since they saw the full feminine form is a sign of fertility, beauty, and prosperity. See these prehistoric goddess statues for example. Try to remember that we have all been subconsciously programmed by social construction, media, and marketing to fear the fat on our bodies. There is truly NOTHING wrong with your body no matter what size it is. Journaling down these reminders and self affirmations to encourage body acceptance will help restructure your mindset. It is totally possible to create new neural networks (brain connections = thought patterns) and overcome the root cause of your struggles!\n\nAnd please don't hesitate to DM me if you ever need more support. BEST OF LUCK BEAUTIFUL SOUL - YOU GOT THIS! <3\n\nMore resources:\n\n* The food psych podcast\n* the love food podcast\n* the fuck it diet podcast\n* Eating in the light of the moon\n* Intuitive eating book and workbook\n* Local support groups\n* Link to MORE resources: [https://alissaswankcounseling.com/new-page](https://alissaswankcounseling.com/new-page)\n* instagrams such as: nourishandeat, danaisabellaaa, bodyposipanda, bravespacenutrition",
          "created_utc": 1600927849.0
        }
      ]
    },
    {
      "id": "g6gkmmk",
      "author": "jenny_mac_",
      "body": "Thanks for the response and kind words! Just know I am so so glad I can offer some guidance and help! Makes all my years of study and recovery efforts feel even more worth it!\n\nI know it can feel shameful and embarrassing and SCARY to talk about your disordered eating and internal struggles but it gets easier, trust me! I was so scared to admit it at first, and only told a few people I trusted. But as I healed, and processed, and grew, sharing my story became empowering and not longer scary. I always gauge conversation dynamic and my trust for whoever I'm about to tell, and usually it's received in very positive ways. It goes something like this \"I've been in recovery from disordered eating for x years. I've done a lot of work on healing my relationship to food, my body, and perfectionism. It's been a huge teacher, allowed me to reflect on myself, my tendencies, and who I want to grow into....\" You'll get there, step by step. Starting with journalling and talking to a therapist will really help! and TIME. Time is your friend. It heals everything. \n\nI'm sorry to hear your Doctor and mom haven't been super supportive. There is a false understanding among many people and even medical professionals that eating disorders are limited to anorexia and bulimia and that a person is only in real trouble if they are severely underweight. This could not be more wrong. Some studies show EDs have the highest death rate of all mental illness. And body size does NOT matter in a diagnosis. It is the behavior and how much it impacts a person's quality of life. Many people in larger bodies have severe EDs and need clinal help. Also, there is now a medical diagnosis of \"eating disorder not otherwise specified\" ([EDNOS](https://www.nationaleatingdisorders.org/learn/by-eating-disorder/osfed)) which includes any unique combination of disordered eating behaviors.\n\n I would recommend you either stop seeking help from your doctor and find a therapist on your own OR find a new Doctor who is HAES and ED specializing. If you stay with your current Dr., I would talk to her about the diagnosis of EDNOS which (at least in the United States), she can diagnose you as having. This would allow her to prescribe you to see a nutritionist (please make sure they are Intuitive Eating and HAES focused - lots of nutritionists are diet culture minded) and psychologist/therapist as a medical requirement and would be more likely covered by insurance. OR you can bypass your Dr. and do your own research on finding an ED/HAES therapist (and/or nutritionist, if you desire). Take charge of your recovery, you don't actually need a Dr to find a therapist. Use that HAES pledge search and do some web searches. There also may be ED/youth support groups in your area. Look up ED treatment centers and see if they have group therapy if that interests you.\n\nI'd also recommend Isabel Foxen Duke's \"Stop fighting food\" course and/or Christy Harrison's \"Intuitive Eating Fundamentals\". These are expensive but I have a feeling if you emailed them with your story/age, they'd offer you a discount/scholarship. That said, there are lots of good interviews on Food Psych to listen to for free and the Intuitive Eating book is relatively cheap. So start there!\n\nIn regards to mom not being super understanding. This was the same with my experience. My mom was a major influence in my food/body struggles as she food policed me and made comments about my body growing up. She has her own disordered relationship to food and body and that really affected me. This is SUPER common in ED world and is a huge challenge in recovery. Recognize that your mom may not understand, acknowledge, or validate your struggles, but you 100000000% deserve to be seen, heard, and supported, so that's why you seek help from professionals. Keep working on healing and growing and it will show. Maybe in due time, she will see how you've changed. For now, do what you can to keep your recovery journey to yourself or other loved ones you can trust (perhaps dad, grandparents, siblings, aunts/uncles, teachers, coaches?)\n\nFeel free to DM if you want to chat more privately! \n\nHope this helps!",
      "created_utc": 1600977108.0,
      "score": 1,
      "context": [
        {
          "id": "g6e8xk9",
          "author": "jenny_mac_",
          "body": "Had to break it into two parts:\n\nPart 1 -\n\nFirst off, if you ever have sucidal thoughts, PLEASE reach out to your local suicide hotline. In the USA it's: 800-273-8255. Just know: you have a purpose to be here. You matter. Your life matters. You are healing and growing and your story can help others heal and grow. Don't forget how valuable your life is. \n\nSecond, PLEASE STOP COUNTING CALORIES AND PLEASE ALLOW YOURSELF TO EAT. No matter what you have eaten throughout the day or day before or how much you exercise, you are allowed to eat!! When I was counting calories to loose weight, my Dr. told me the amount that my app was telling me to eat was the very baseline for my body to exist for 1 day. No thinking, no moving, no other energy expulsion. Living takes calories and those apps are super unhealthy for you, especially at your age! Please ditch the apps and calorie counting. Also, I highly recommend you stop weighing yourself, body checking, overexercising etc. This can seem like a lot of behaviors to shift at once so be patient with yourself, but know that you CAN change!\n\nThird, be proud of yourself for reaching out and being able to talk about these intense experiences and your struggles. Both are HUGE steps towards healing so congrats on this first big step!\n\nFourth, Here we go, my apologies for the insanely long response but I hope it's helpful!\n\nI would highly recommend seeing a therapist or counselor. It sounds like you have experienced repeated severe trauma that is and will continue to be the root cause of your disordered eating. Do not blame yourself or feel that you are broken. Your disordered eating was protecting you against the pain and trauma that you were experiencing. It was/is a coping mechanism, a protective force in your life. But it is not serving your full best interest so it's time to learn to find new coping mechanisms and ways to heal. The healing and recovery process is difficult, non-linear (meaning ups and downs), but TOTALLY worth it. You're young and already on the right path by reaching out and having self awareness. You're doing great! However, to further your healing process, I’d highly recommend seeking help from an ED-specializing therapist who practices the health at every size (HAES) and intuitive eating approach. You can search for providers on the [HAES](https://haescommunity.com/) website or search your town, the type of provider, and \"intuitive eating or health at every size\" in Google. With COVID, lots of therapists are doing virtual sessions so you don't necessarily need someone local. I'd look into HAES and intuitive eating yourself (there are many books, podcasts, instagram accounts, etc. devoted to these. See my below list for some starters). These two theories have been MONUMENTAL in my recovery and finally feeling SANE and normal around food/eating. I used to count calories and obsess about my weight, too. Now I eat whatever I want, don't track anything, and genuinely trust my body to know what it needs. I'm not perfect, I sometimes overeat or eat lots of \"unhealthy\" foods but that is literally considered NORMAL eating. The difference is now I do not feel guilt/shame nor do I feel I need to overexercise or restrict to compensate for it. I just move on and nourish my body. ",
          "created_utc": 1600927810.0
        },
        {
          "id": "g6e8z10",
          "author": "jenny_mac_",
          "body": "Part 2-\n\nWe live in what ED therapists and nutritionists call \"Diet culture\". It is the mainstream culture and industry of dieting, weight loss, fitness, healthy eating, clean eating etc. While these seem like they are good for us, it is SCIENTIFICALLY proven that diets do not actually result in long term weight loss. Short term yes, but in the long term, almost all people will regain the weight they lost and MORE. Because diets go against our biological urge to survive. All of the humans before us went through famines so our bodies have adapted to hold onto and crave calories in times of scarcity. When we experience deprivation, whether it is physical (restricting food/nutrients) or mental (\"I can't eat this, I shouldn't eat this, this food is bad, I am guilty if I eat this food...etc.), our bodies immediately rebel against us and we overeat because our bodies are scared of being deprived. Dieting and restriction goes against our body's innate biology. This is why diets fail and Diet culture LIES to us by telling us it is our fault for failing and we just need to try harder or have more will power. Restriction = deprivation = biological response to overeat = fear of weight gain/guilt about overeating = restriction. And it repeats. This is called the binge/restrict cycle. It's like a pendulum. The farther you push towards restriction, the farther it will swing back towards binging. This is why you feel crazy around food. As well as the fact that you have had trauma and pain and that food is a cheap, available, and effective coping mechanism that temporarily soothes emotional pain. But don't worry, you're on your healing path now!\n\nI would HIGHLY recommend working with a therapist to heal the trauma you've experienced and to help rewire your mindset around food, body image, and trusting your body through intuitive eating. Many modern treatment centers often overlook this step and only treat the eating issues, not the mental/emotional patterns, trauma, etc. that is causing the disordered eating. Think of disordered eating as the symptom caused by some unaddressed internal issues (i.e trauma, anxiety/stress, depression, perfectionism, etc.). Work with a therapist to work through suppressed emotions, memories, and so on, and really help make sense of what you've gone through and what you're going though. Therapists can help you develop self reflection practices, healthy coping mechanisms, self care routines, and more, so you don't rely on the disordered eating to manage trauma/stress. (I used disordered eating and compulsive overexercising to manage stress during college/life transitions, and have learned that I need to prioritize self care (journaling, joyful movement, fun, etc in order to feel mentally balanced.)\n\nI highly recommend JOURNALING! Journal your thoughts, feelings, emotions, etc. Practice self compassion, let yourself cry when you need to, and most of all FORGIVE yourself. We are not perfect and we are always learning. Forgiveness is huge. Explore creativity, explore expression through dance, song, colors, cooking, whatever calls to you!\n\nRegarding body image: It's virtually impossible to live in western society without some form of body image struggles. Working on body image and reversing fat-phobia are KEY in recovery. Here's something I wrote to another redditor struggling with negative body image thoughts: Whenever I have a body conscious/bad body image thought, I try to recognize it as a \"negative body image thought\" and respond with something like \"I am not my body\" or \"my body does not define me\" or \"my body is my vessel\" or \"the shape of my body does not matter\" or \"all bodies are worthy of love\"... find some little sayings that resonate with you. I'd recommend following fat-positive social media accounts (models, athletes, influencers, etc.) that are actively celebrating diverse body types and people in larger bodies. This will help with restructuring your mindset to be less fat-phobic.\n\nIn addition, I have found journaling about my feelings to be super helpful as I remind myself where our fat phobia/body dissatisfaction comes from in the first place. We live in a society/economy that glorifies a body type that only a small fraction of the female population naturally has. Capitalism media/marketing has insidious psychological tactics to make you hate your body and fear being \"fat\" in order to SELL YOU THINGS (diets, exercise products, beauty products, clothes, the list goes on)! They profit off of self hatred they instill within us- It's truly evil. We must remember that \"modern\" times are only a glimpse of human history. Women in larger bodies have been worshiped for millennia by other cultures since they saw the full feminine form is a sign of fertility, beauty, and prosperity. See these prehistoric goddess statues for example. Try to remember that we have all been subconsciously programmed by social construction, media, and marketing to fear the fat on our bodies. There is truly NOTHING wrong with your body no matter what size it is. Journaling down these reminders and self affirmations to encourage body acceptance will help restructure your mindset. It is totally possible to create new neural networks (brain connections = thought patterns) and overcome the root cause of your struggles!\n\nAnd please don't hesitate to DM me if you ever need more support. BEST OF LUCK BEAUTIFUL SOUL - YOU GOT THIS! <3\n\nMore resources:\n\n* The food psych podcast\n* the love food podcast\n* the fuck it diet podcast\n* Eating in the light of the moon\n* Intuitive eating book and workbook\n* Local support groups\n* Link to MORE resources: [https://alissaswankcounseling.com/new-page](https://alissaswankcounseling.com/new-page)\n* instagrams such as: nourishandeat, danaisabellaaa, bodyposipanda, bravespacenutrition",
          "created_utc": 1600927849.0
        },
        {
          "id": "g6f5vy1",
          "author": "None",
          "body": "Hi, this is my post.\nThank you so much for such a detailed reply, it feels amazing knowing someone cares about my situation! Thank you for all the resources you've linked, I'll be sure to check them out!! I'll try my best to give you some details I missed in my initial post. \nFirst of all, the suicide hotline is greatly appreciated. As of today, I no longer have these thoughts and have been coping very well with my depression. It is honestly pretty embarrassing for me to talk about my ed tendencies because of how important health is to me regarding other people. Some of the things you've mentioned about body positivity, HAES, diet culture, and nasty, nasty capitalism are similar things I preach to my friends and family! It is crazy the way my brain has contorted me into thinking everyone but me is beautiful in their own skin! The last thing I'll touch on is therapy. I am in a pretty sticky situation when it comes to it. I have asked my doctor for a referral a couple times now, but because my bmi is normal she believes that the clinic would refuse me (maybe because my case isn't \"extreme\" enough?) I have told my mother about what I'm going through but she doesn't actively give me support. I suppose now that I'm 18 I can start booking my own therapy sessions but I'm still looking for a good therapist that specializes in eating disorders.\n\nThank you again for everything you said, it truly warms my heart and you couldn't believe how grateful I am for all this advice! You are also a beautiful soul and I wish you the best ^^",
          "created_utc": 1600953391.0
        }
      ]
    }
  ]
}