{
  "id": "j1w5ap",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1601372499.0,
  "title": "Request: My [21F] boyfriend [21M] never feels hunger and feels ill when he eats even a little bit",
  "selftext": "My boyfriend has always been very thin and a slightly picky eater, but he's lost around 10% of his body weight in the last year and I've been growing increasingly concerned. This weekend he could barely eat anything (he claims it's because he didn't smoke any weed this weekend) and whenever he ate he felt so full that he was nauseous. He ate less during each meal than a small child would eat, and then he'd have to lay down or sit on the toilet until he felt okay again. \n\nI read a similar post on here where the replies said the bf might have ARFID, but my bf doesn't really restrict how much he eats, he just can't stomach food and he forces himself to eat. Does this sound like an ED? He doesn't take any medications or do anything that would suppress his appetite, and he seems to get frustrated with himself for not being able to eat more. I desperately want to help him be able to eat without feeling sick and I offer him all the support I can but I wish we knew why he can't get hungry.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j1w5ap/request_my_21f_boyfriend_21m_never_feels_hunger/",
  "score": 50,
  "num_comments": 8,
  "comments": [
    {
      "id": "g71mmx4",
      "author": "nevernevermind",
      "body": "I was in a similar situation (weed smoker, nausea and pain when eating) and ended up actually having hpylori, a stomach bacteria. Rule out any medical issues before thinking it's an eating disorder. I was treated as bulimic and a phobia of food for years before demanding to be tested for the bacteria.  Doctors said I had an eating disorder and it was related to smoking weed when in reality I was really sick. I still have issues around food but I'm recovering from them now that the bacteria is gone.",
      "created_utc": 1601373037.0,
      "score": 49,
      "context": []
    },
    {
      "id": "g71odak",
      "author": "BlackJack613",
      "body": "There are quite a few health issues that can cause this: bacteria, inadequate smooth muscle contractions,  inadequate bile production to name a few. Encourage him to get looked at by a doctor before you jump to eating disorders",
      "created_utc": 1601375037.0,
      "score": 26,
      "context": []
    },
    {
      "id": "g71qzf1",
      "author": "None",
      "body": "Firstly, get to a doctor to rule out physical causes. There are a huge range of illnesses that can cause appetite loss or issues with digestion, so that's a really important step and I'd suggest doing it asap. You never know what's going on in someone's body and that level of weight loss will ring alarm bells for any decent doctor.  \n\n\nRule out the physical causes first, if nothing comes up then start to consider psychological causes.  It could be AFRID, or it could be appetite loss from depression, or it could be anxiety related, or it could be anything really, so I'd really suggest getting a professional involved.",
      "created_utc": 1601377872.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g73ok87",
      "author": "timeforbedplease",
      "body": "Is he a heavy cannabis user? Not to bash it, I smoke regularly. Just asking because weed does have an effect on hunger signals and satiety. Ceasing smoking after being a heavy user commonly results in difficulty eating as well.",
      "created_utc": 1601411301.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g71m646",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1601372499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g73dotw",
      "author": "ThePlanck",
      "body": ">I read a similar post on here where the replies said the bf might have ARFID, but my bf doesn't really restrict how much he eats, he just can't stomach food and he forces himself to eat. \n\nARFID isn't about restricting how much you eat, rather its more about extreme anxiety around certain foods, to the point that you can't eat them because their taste/texture/smell makes you gag/feel like they'll make you throw up. In some extreme cases where people have very few safe foods who might struggle to eat anything at all and lose a lot of weight as result. \n\nIts possible that this is what your boyfriend is experiencing and he just doesn't understand what is happening very well so it might be worth talking to him about it after doing a bit more research to figure out what questions to ask him about what it is about foods that makes nauseous, but from the way you are describing the situation it feels like its more of a medical issue.",
      "created_utc": 1601406534.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g743r2g",
      "author": "88lilly",
      "body": "I had the same issue. This video helped get me on the road to healing https://youtu.be/0jzaH42w_Zo\nYes it could be an infection but eating enough can combat any of those infections (addressing them would also be important of course)\nThere are videos from people with EDs on how eating enough finally took care of their infections they battled for years (Jessica Rieman on youtube)",
      "created_utc": 1601418689.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g74lyvu",
      "author": "None",
      "body": "Doctor",
      "created_utc": 1601429215.0,
      "score": 1,
      "context": []
    }
  ]
}