{
  "id": "j2izs1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1601458400.0,
  "title": "Request: Need to lose weight, but every time I try I feel my disordered eating creeping up",
  "selftext": " \n\nI'm a 22 year old woman that's struggled with various kinds of disordered eating over the years, and I'm trying to find the best way for me to lose weight.\n\nI am obese. My doctors always really want me to lose weight, and I would like to as well. My problem is that every time I try, I feel my disordered eating creeping up.\n\nI've been overweight since I was pretty young, and due to my parents pushing, weight has always been a focus of mine. Up until the past couple years I went through cycles of binging and purging with periods of excessive restriction and excessive binging in between.\n\nWhen I try to use pretty stands methods, like just simply counting calories, I impulsively try to push the number lower, or get distressed and binge if I go over it.\n\nWhile I've been relatively stable for a while, attempts at weight loss tend to throw me off and make me start a spiral, so I'm not sure where to begin. Therapy is not an option because of how much the co-pay is (and in my experience, therapy doesn't work too well for me. Since I'm undeniably overweight, my concern with weight loss tends to go overlooked).\n\nAny suggestions? Books, websites, guides?\n\nThanks",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j2izs1/request_need_to_lose_weight_but_every_time_i_try/",
  "score": 109,
  "num_comments": 27,
  "comments": [
    {
      "id": "g75uro4",
      "author": "None",
      "body": "OP I have so much empathy/sympathy for your situation. What’s been working for me is finding forms of excercise I genuinely enjoy and would do even if they had zero effect on weight loss. I like swimming, yoga and weight lifting. Maybe that could be helpful?",
      "created_utc": 1601466026.0,
      "score": 27,
      "context": []
    },
    {
      "id": "g75v5p7",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1601466373.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g75zrru",
      "author": "jeabgrenouille",
      "body": "Look up April Lauren on YouTube. She has had a lot of weight fluctuations in her life, and currently, she is working on losing 200 pounds, but she is being so patient and purposely losing the weight very slowly so that she can actually keep the weight off this time. She shares her plans and goals each month and she just always seems to be really good at holidng herself back and just setting reasonable goals for sustainable weight loss. She is just very sweet as well.",
      "created_utc": 1601469998.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g763kn0",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1601472369.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g77rovd",
      "author": "andreea_carla_b",
      "body": "Hi!\n\nI'm really sorry you're struggling. I've also been (and sometimes still am) struggling with my relationship with food.\n\nWhen I diet I have a crazy urge to binge as if it's my last meal ever. And sometimes I also binge (food is just too damn comforting).\n\nThe issue here isn't the weighloss per se, but rather your relationship with food and your coping mechanisms. \n\nI wouldn't look into dieting for weight loss right now, but rather to create better habits. Weight loss will come later, that is just setting some long term goals.\n\nTherapy would be ideal, but there as other things you can do until you can properly speak to a therapist. \n\nI know it sound corny, but try meditation, low impact yoga, going for waks, dancing in your pyjamas while singing into your brush/microphone. Try experimenting with ways of being active and ways of de-stressing that don't include food. See what's easier and what gives you joy.\n\nAnd of course, manage expectations. It's a long term commitment that pays off every milestone you reach. Set small goals to start with. If you're thinking walking a mile even though you're mostly sedentary,  try for smaller goals. There is absolutely nothing wrong with that. \n\nYou need to take baby steps so you don't trigger those anxious reactions that lead to binging.\n\nBut if you slip a bit, don't beat yourself up! We all have bad days and you are allowed to have one. But don't abandon altogether, that is the most important part. \n\nGood luck OP. We are rooting for you ❤",
      "created_utc": 1601497814.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g76ph7f",
      "author": "wordgromit",
      "body": "Eating intuitively can be really helpful, but you have to train yourself to recognize genuine hunger cues. From personal experience, when I bring numbers into it is when I start having disordered thoughts, so I don't weigh myself or count calories, which makes loosing weight pretty hard (it's like trying to drive blind). I try to stick to regular meal times, and when I get the urge to snack or eat I ask myself if it's because I'm hungry or because I want food. Also, drink lots of water, a lot of my thirst cues feel like hunger.",
      "created_utc": 1601483040.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g76q8hm",
      "author": "ball-of-fury-NY",
      "body": "I struggled with the similar disorded eating habitats as well. I couldnt calorie count becuase it would send me into a spiral or talk about how many calories are in a food item ir meal. What I did instead was focus on how I approached food. When I cooked a meal actually measure out the true serving size. Its insane to see the difference in what I thought was a half cup to what a true half cup is.\n\nI also ate while I wasnt distracted. So rather than make a plate of food and plop down in front of the TV, I sat at the table and ate. It let me focus on what I was eating instead of mindlessly eating and I would feel quite satisfied after my meal that I wouldnt go back for seconds or thirds.\n\nThis really helped me.",
      "created_utc": 1601483354.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g76pl9c",
      "author": "jessiebear86",
      "body": "I dont know your budget but I do find CBT workbooks to be helpful. I prefer them in audio format such as podcasts etc - you can find free podcasts online. \n\nI also find with myself that counting calories doesnt work for me. Its a trigger. Therefore I try to measure food by how it looks on the plate. You can find images on sites like pinterest that show portion sizes based on the size of your fist etc. \n\nI also like to integrate yoga or pilates into my daily routine. You tube 30 days of yoga. Its free if you already have a mat and is a wonderful chance to get 30 mins to reconnect with your body and mind. \n\nHope this helps but please let us know how you get on and what works for you :)",
      "created_utc": 1601483090.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g78dfe0",
      "author": "Aktrow05",
      "body": "Speaking as a male with eating disorder around your age. I tried for the longest time to get under 200 pounds.\n\nThe “aha” moment for me was: making a fun breakfast. Whatever is your first official meal of the day since waking up.\n\nFor me , even if it’s coffee and bread, I might go with black coffee and trying that vegan creamer but still eating eggs and toast.\n\nI’ve  been doing “vegan keto” since mid 2018 and it has helped me get down and maintain a healthy weight.",
      "created_utc": 1601508733.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g78y9sd",
      "author": "chelseamarg",
      "body": "I could’ve written this post myself. I have very little advice to offer you but I do want to thank you for taking the time and courage to post. Knowing I’m not the only one who needs balance recovery with weight loss (for health reasons) is such a relief. \n\nIntuitive eating may work for you. I tried it, but due to the pressing health concerns of my weight, I felt it was too little structure. Honestly, I couldn’t afford to gain any extra weight. I also tried calorie counting but found that would trigger me and my obsessive thoughts. Currently my approach is to eat balanced meals (protein, veggie/fruit, carb, and a healthy fat) and exercise I enjoy like walking the dog or even dancing to my music. I’m hoping that taking a holistic approach to health will eventually result in shedding some pounds. If you ever want to talk, please reach out :) \n\nNavigating this world while limiting exposure to triggers is exhausting! Take care of yourself the best you can.",
      "created_utc": 1601520755.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g76u4b1",
      "author": "None",
      "body": "I had an eating disorder. The only thing to ever successfully help me lose weight was calorie counting, but this time, i did r/1500isplenty, not 200-800 calories as and I made sure I hit 1500 calories a day and nothing less. Also set realistic goals, like 5 lbs a month and think of where you want to be this time next YEAR, not just next month. It takes time. 1500 is barely under maintenance for a healthy person but if you’re obese you can lose up to 10 lbs a month while learning healthy habits to keep. I’ve maintained a healthy weight loss of 50 lbs for the last 5 months. Focus on being healthy and strong, not skinny. I recommend the lose it app. It completely changed my life.",
      "created_utc": 1601484910.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g75nqsh",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1601458400.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g78t3hi",
      "author": "bot_hair_aloon",
      "body": "Hey op. What age are you? If you are young there would be much more of a benefit to let your mind fully heal before you begin to change your body. As you do this, im sure you will loose some weight anyway. I would suggest focusing on quality rather than quantity. Eat 80/20, 80% healthy and 20% to feed your soul. Also definitely some type of exercise you like. Exercise and food are the best medicines. Dont go too hard on yourself. Good luck :)",
      "created_utc": 1601517823.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7ecmid",
      "author": "guacamalia",
      "body": "This is my exact situation. To be honest with you, the only thing that has helped me has been therapy. As soon as I started I told my therapist I wanted to build a relationship with food and exercise based on health and not body image and just completely detach myself from the idea that weight loss was something I wanted to achieve a beauty standard, because it would always make me go back to my ED. I think through both therapy if that’s something that’s available to you and meditation, and just distancing yourself from the thought of your body when it comes to the reason why you want to lose weight you should be able to start being healthier without letting your ED take over. I hope this helps in any way. Good luck OP, I’m pretty much on the same boat so if you’d ever like to talk to someone consider me a friend, may not have the best advice but here to listen\n\n\nEdit: I did not read that last paragraph and disnt know you couldn’t get therapy, if you’d like my dms are open like I said and I could always share things I’ve learned through therapy",
      "created_utc": 1601644061.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8cbcmp",
      "author": "Northstar04",
      "body": "If you can afford it, I would recommend a personal trainer and nutritionist to plan meals FOR you that are healthy, well portioned and aligned to reasonable goals for GRADUAL weight loss. Nothing would be more worth the money.\n\nIf you must DIY, get some initial advice on how much weight you should be losing each week on a reasonable exercise and diet plan. Combine low impact cardio with weight lifting. Weight lifting will help your metabolism kick into high gear. I like kickboxing for cardio but try different things until you find something you can keep up that isn't too crazy.",
      "created_utc": 1602350805.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g75t778",
      "author": "finnbiker",
      "body": "you may want to explore the WholeFoods Plant Based (WFPB) way of eating. Lots of people lose weight, it is super healthy, and because most of the foods are less calorie dense you don’t have to count calories as much. Look up Forks Over Knives. God Bless.",
      "created_utc": 1601464546.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g76s5by",
      "author": "gummygem7",
      "body": "Since you have an eating disorder history it’s probably best that you seek HAES (health at every size) practitioners. They won’t necessarily try to stop you from your goal, however, they’ll help you avoid doing it in a dangerous way.",
      "created_utc": 1601484089.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g773ptx",
      "author": "PancakeFoxReborn",
      "body": "I'm OP. That's a funny coincidence, actually. I got diagnosed with ADHD and have been taking Vyvanse for a little while.\n\nIts definitely affected my appetite, but for consistent weight loss it seems more is required.",
      "created_utc": 1601488685.0,
      "score": 3,
      "context": [
        {
          "id": "g75v5p7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1601466373.0
        }
      ]
    },
    {
      "id": "g77np1v",
      "author": "andreea_carla_b",
      "body": "I love her! She's such a lovely person ❤",
      "created_utc": 1601496241.0,
      "score": 3,
      "context": [
        {
          "id": "g75zrru",
          "author": "jeabgrenouille",
          "body": "Look up April Lauren on YouTube. She has had a lot of weight fluctuations in her life, and currently, she is working on losing 200 pounds, but she is being so patient and purposely losing the weight very slowly so that she can actually keep the weight off this time. She shares her plans and goals each month and she just always seems to be really good at holidng herself back and just setting reasonable goals for sustainable weight loss. She is just very sweet as well.",
          "created_utc": 1601469998.0
        }
      ]
    },
    {
      "id": "g76sdfo",
      "author": "gummygem7",
      "body": "You need a balanced diet that includes carbs and other nutrients (not just protein) when you’re working out regularly. Carbs also help build muscle and they give you the energy to actually do your workouts.",
      "created_utc": 1601484178.0,
      "score": 5,
      "context": [
        {
          "id": "g763kn0",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1601472369.0
        }
      ]
    },
    {
      "id": "g76sii9",
      "author": "gummygem7",
      "body": "This! A diet will not work. And you gain rebound weight from dieting.",
      "created_utc": 1601484233.0,
      "score": 6,
      "context": [
        {
          "id": "g76ph7f",
          "author": "wordgromit",
          "body": "Eating intuitively can be really helpful, but you have to train yourself to recognize genuine hunger cues. From personal experience, when I bring numbers into it is when I start having disordered thoughts, so I don't weigh myself or count calories, which makes loosing weight pretty hard (it's like trying to drive blind). I try to stick to regular meal times, and when I get the urge to snack or eat I ask myself if it's because I'm hungry or because I want food. Also, drink lots of water, a lot of my thirst cues feel like hunger.",
          "created_utc": 1601483040.0
        }
      ]
    },
    {
      "id": "g78sldz",
      "author": "bot_hair_aloon",
      "body": "I think this would be way too low for someone overweight and would cause a binge. Im at a healthy weight and if i ate that few calories i would binge within 5 days.",
      "created_utc": 1601517540.0,
      "score": 2,
      "context": [
        {
          "id": "g76u4b1",
          "author": "None",
          "body": "I had an eating disorder. The only thing to ever successfully help me lose weight was calorie counting, but this time, i did r/1500isplenty, not 200-800 calories as and I made sure I hit 1500 calories a day and nothing less. Also set realistic goals, like 5 lbs a month and think of where you want to be this time next YEAR, not just next month. It takes time. 1500 is barely under maintenance for a healthy person but if you’re obese you can lose up to 10 lbs a month while learning healthy habits to keep. I’ve maintained a healthy weight loss of 50 lbs for the last 5 months. Focus on being healthy and strong, not skinny. I recommend the lose it app. It completely changed my life.",
          "created_utc": 1601484910.0
        }
      ]
    },
    {
      "id": "g75w5kf",
      "author": "QueenofSocks",
      "body": "I personally had a bad experience with plant based eating, at first it was great, but after a few weeks it triggered my ED like never before. Even though you don't restrict your calorie intake, you do restrict the types of food you can eat, and that created a lot of frustration and anxiety for me and made me binge on 'forbidden' foods every opportunity I had.",
      "created_utc": 1601467220.0,
      "score": 7,
      "context": [
        {
          "id": "g75t778",
          "author": "finnbiker",
          "body": "you may want to explore the WholeFoods Plant Based (WFPB) way of eating. Lots of people lose weight, it is super healthy, and because most of the foods are less calorie dense you don’t have to count calories as much. Look up Forks Over Knives. God Bless.",
          "created_utc": 1601464546.0
        }
      ]
    },
    {
      "id": "g78k5x4",
      "author": "Responsible-Host1657",
      "body": "I have never heard of this medication so I  wondering if someone who restricts should take it. My depression and anxiety are getting bad along with starting to restricting again.  I've taken about every antidepressant out there and I quit once I noticed weight  gain.  I  was wondering if anyone is on a medication that helps with ed and depression.",
      "created_utc": 1601512755.0,
      "score": 1,
      "context": [
        {
          "id": "g75v5p7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1601466373.0
        },
        {
          "id": "g773ptx",
          "author": "PancakeFoxReborn",
          "body": "I'm OP. That's a funny coincidence, actually. I got diagnosed with ADHD and have been taking Vyvanse for a little while.\n\nIts definitely affected my appetite, but for consistent weight loss it seems more is required.",
          "created_utc": 1601488685.0
        }
      ]
    },
    {
      "id": "g797l7l",
      "author": "bikecrotchthrowaway",
      "body": "ADHD treatment with stimulants + ED therapy seems to be the special combo for me",
      "created_utc": 1601526838.0,
      "score": 1,
      "context": [
        {
          "id": "g75v5p7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1601466373.0
        },
        {
          "id": "g773ptx",
          "author": "PancakeFoxReborn",
          "body": "I'm OP. That's a funny coincidence, actually. I got diagnosed with ADHD and have been taking Vyvanse for a little while.\n\nIts definitely affected my appetite, but for consistent weight loss it seems more is required.",
          "created_utc": 1601488685.0
        }
      ]
    },
    {
      "id": "g768uhg",
      "author": "lunarhealer",
      "body": "Same!!! WFPB started my binge eating issue. It really enforces that \"this is the last time I'll ever eat this\" mentality that causes Last Supper type bingeing.",
      "created_utc": 1601475483.0,
      "score": 2,
      "context": [
        {
          "id": "g75t778",
          "author": "finnbiker",
          "body": "you may want to explore the WholeFoods Plant Based (WFPB) way of eating. Lots of people lose weight, it is super healthy, and because most of the foods are less calorie dense you don’t have to count calories as much. Look up Forks Over Knives. God Bless.",
          "created_utc": 1601464546.0
        },
        {
          "id": "g75w5kf",
          "author": "QueenofSocks",
          "body": "I personally had a bad experience with plant based eating, at first it was great, but after a few weeks it triggered my ED like never before. Even though you don't restrict your calorie intake, you do restrict the types of food you can eat, and that created a lot of frustration and anxiety for me and made me binge on 'forbidden' foods every opportunity I had.",
          "created_utc": 1601467220.0
        }
      ]
    },
    {
      "id": "g761ao9",
      "author": "finnbiker",
      "body": "Ok, good to know. I can see how that could happen.",
      "created_utc": 1601471007.0,
      "score": 1,
      "context": [
        {
          "id": "g75t778",
          "author": "finnbiker",
          "body": "you may want to explore the WholeFoods Plant Based (WFPB) way of eating. Lots of people lose weight, it is super healthy, and because most of the foods are less calorie dense you don’t have to count calories as much. Look up Forks Over Knives. God Bless.",
          "created_utc": 1601464546.0
        },
        {
          "id": "g75w5kf",
          "author": "QueenofSocks",
          "body": "I personally had a bad experience with plant based eating, at first it was great, but after a few weeks it triggered my ED like never before. Even though you don't restrict your calorie intake, you do restrict the types of food you can eat, and that created a lot of frustration and anxiety for me and made me binge on 'forbidden' foods every opportunity I had.",
          "created_utc": 1601467220.0
        }
      ]
    },
    {
      "id": "g78kkop",
      "author": "PancakeFoxReborn",
      "body": "I mean Vyvanse is an ADHD med. It's similar to adderall (though preferable imo cause it releases slowly so the benefits don't wear off as fast).\n\nADHD meds tend to stifle appetites. I'm not sure exactly why, it's more of an unintentional side effect.\n\nI'm pretty sure that prescribing it specifically for that reason is \"off label\"",
      "created_utc": 1601512997.0,
      "score": 2,
      "context": [
        {
          "id": "g75v5p7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1601466373.0
        },
        {
          "id": "g773ptx",
          "author": "PancakeFoxReborn",
          "body": "I'm OP. That's a funny coincidence, actually. I got diagnosed with ADHD and have been taking Vyvanse for a little while.\n\nIts definitely affected my appetite, but for consistent weight loss it seems more is required.",
          "created_utc": 1601488685.0
        },
        {
          "id": "g78k5x4",
          "author": "Responsible-Host1657",
          "body": "I have never heard of this medication so I  wondering if someone who restricts should take it. My depression and anxiety are getting bad along with starting to restricting again.  I've taken about every antidepressant out there and I quit once I noticed weight  gain.  I  was wondering if anyone is on a medication that helps with ed and depression.",
          "created_utc": 1601512755.0
        }
      ]
    },
    {
      "id": "g78kvq3",
      "author": "Responsible-Host1657",
      "body": "Ok, thank for the advice.",
      "created_utc": 1601513181.0,
      "score": 1,
      "context": [
        {
          "id": "g75v5p7",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1601466373.0
        },
        {
          "id": "g773ptx",
          "author": "PancakeFoxReborn",
          "body": "I'm OP. That's a funny coincidence, actually. I got diagnosed with ADHD and have been taking Vyvanse for a little while.\n\nIts definitely affected my appetite, but for consistent weight loss it seems more is required.",
          "created_utc": 1601488685.0
        },
        {
          "id": "g78k5x4",
          "author": "Responsible-Host1657",
          "body": "I have never heard of this medication so I  wondering if someone who restricts should take it. My depression and anxiety are getting bad along with starting to restricting again.  I've taken about every antidepressant out there and I quit once I noticed weight  gain.  I  was wondering if anyone is on a medication that helps with ed and depression.",
          "created_utc": 1601512755.0
        },
        {
          "id": "g78kkop",
          "author": "PancakeFoxReborn",
          "body": "I mean Vyvanse is an ADHD med. It's similar to adderall (though preferable imo cause it releases slowly so the benefits don't wear off as fast).\n\nADHD meds tend to stifle appetites. I'm not sure exactly why, it's more of an unintentional side effect.\n\nI'm pretty sure that prescribing it specifically for that reason is \"off label\"",
          "created_utc": 1601512997.0
        }
      ]
    }
  ]
}