{
  "id": "j35jlq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1601545726.0,
  "title": "Request: Worried about the hunger I'm expereincing",
  "selftext": " Am I experiencing extreme hunger?\n\nHello, I may not have an ed as long as some others does, but when I realized I been dealing with anorexia and orthorexia for a couple months I decided to start recovery. But I am very scared and honesty confused about what is happening, the urge to eat more and feeling not satisfied, although i am full and already ate a meal. This been happening since like the first day I started recovery which is like a few months ago and I am already weight restored. it feels like binging.\n\nIs this normal? Does anyone have advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j35jlq/request_worried_about_the_hunger_im_expereincing/",
  "score": 58,
  "num_comments": 13,
  "comments": [
    {
      "id": "g79ru2f",
      "author": "Affectionate_Hawk_86",
      "body": "Just went through the exact same experience a few weeks ago, what you're experiencing is your body screaming for more energy. As you put more food in, your body needs more as your metabolism is kicking back on. Be sure to stay hydrated. You should seek help as refeeding is extremely difficult alone.",
      "created_utc": 1601546129.0,
      "score": 25,
      "context": []
    },
    {
      "id": "g7a3xo6",
      "author": "jeabgrenouille",
      "body": "Extreme hunger. It doesn't matter what your weight is. If you have been in a negative energy balance for a prolonged period of time and/or restricting calories and/or certain foods, extreme hunger can occur during recovery. \n\nEvery resource I have seen has always said to give in and eat completely unrestricted. You might gain some weight, but that could be temporary and just there while your body heals. Also, bloating during this time can make you look like you gained weight, but it might just be water.\n\nI certainly had extreme hunger when recovering from my relapse with anorexia, and I would eat a meal, and feel like I didn't eat anything. I fought that feeling hard and just developed new weird eating habits, and therefore my extreme hunger lasted years. If you lean into it and just accept this phase of recovery, it will not last nearly as long",
      "created_utc": 1601556647.0,
      "score": 13,
      "context": []
    },
    {
      "id": "g79unzy",
      "author": "None",
      "body": "It sounds like your body wants to store all the food it can to make up for the time when you were starving yourself. It will take some time for your body to realize that you're not \"in danger\" anymore.",
      "created_utc": 1601549221.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g7a3qi4",
      "author": "Brenqred",
      "body": "I've been recovering from a long term orthorexia and malnourishment for six months now, and I've also been trough this feeling of extreme hunger. As said, your body is screaming for energy and nutrition, and it will take some time from your metabolism to get normal. Give your body the time it needs. Seek for professional help. I got over my extreme hunger by following a regular and scheduled diet planned by professional therapists who are specialized in treating ED's.",
      "created_utc": 1601556518.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g7aqstj",
      "author": "xhikaru_himex",
      "body": "one answer is you're hypermetabolizing. this happens in recovery often. happened to me a couple times being weight restored and I was ravenous. are you sweating at all? getting weighed daily by a professional? only ask bc weight loss despite following your meal plan is a hallmark sign. no numbers obviously. your body is in overdrive bc it's activated by the adequate calorie intake. weird, right?",
      "created_utc": 1601568015.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g7bguf0",
      "author": "None",
      "body": "When I recovered I did spiral down into binging SO keep an eye on it BUT ALSO your body needs more than just weight. You’re also missing lots of other good things that your body needs. Try to figure out what those things are based on your cravings. Sweets? Maybe you need more protein or maybe your pancreas is still catching up to your glucose levels. Salty? Maybe your electrolytes are still learning to manage. Carbs? Maybe you need more healthy starches. If you can adjust WHAT you are eating to satisfy the needs of your body then you won’t intake too much volume and feel like you’ve binged. You’ll feel a normal satiated state and it really will help you maintain your health. \n\nAlso, a dietician is a wonderful thing to have. They can give you more specific ideas of what your body is trying to tell you.",
      "created_utc": 1601579387.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g7btwx1",
      "author": "enord11400",
      "body": "If you are not seeing a dietician then you should. Congrats for making progress. It’s a big deal and your body will need time to adjust, but something that was important to me was learning that being at a “normal/healthy” bmi does not mean you are weight restored. Weight restoration is not a cut and dry journey of getting to a “healthy” bmi especially if you are young. My bmi never left the healthy range, but I was diagnosed with anorexia (age 17) because of how quickly I lost weight and how much it deviated from what was expected based on my growth chart. When they told me they wanted me to gain weight after a bit of time in treatment, my mom told me I could leave if I wanted. Even people who are not disordered were so confused by this and thought it was absurd. Society has convinced a lot of people that weighing less is worth being mentally ill and/or suffering. It’s not about being in the average healthy range for someone of you height and age, it’s about being in the healthy range for your own body. \n\nThere is also something called “overshooting” which suggests that your body is going to demand more resources(weight) for awhile to repair any damage and get prepared for another famine since biologically that is what your body thinks has happened, and then your weight will settle back down to its own happy place after it’s gone awhile without any disruptions to the food supply. If you don’t show it that there is in fact plenty of food then it might not let go of this extra hunger. \n\nIt’s really hard to navigate even with an entire treatment team. I hope you can keep up the good work towards being mentally and physically healthy. ❤️",
      "created_utc": 1601584634.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g7cwnj0",
      "author": "alexie_0213",
      "body": "GO WATCH STEPHANIE BUTTERMORE ON YOUTUBE",
      "created_utc": 1601605268.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g79ri40",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1601545727.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7ch8z3",
      "author": "Vvberry",
      "body": "Hi human , I have also suffered from a eating disorder and let me tell you what I think of this. So basically I’m  in recovery and I have been extremely shocked at how much my appetite has increased like it’s insane!!!! I have that never full feeling too and I think it’s 100% normal our bodies are trying to heal from the damage we’ve done :) please don’t be ashamed of this, it’s completely normal",
      "created_utc": 1601596875.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7cqb1f",
      "author": "wdfchicka07",
      "body": "Totally normal. Eat consistently and eat when you're hungry. It goes away. Your body is telling you it needs food to heal, trust it. Maybe you aren't weight restored yet. Restricting causes our set point to change. Trust your body and the process.",
      "created_utc": 1601601823.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7ch2zo",
      "author": "PrincepsMagnus",
      "body": "Casein protein was a life saver for me. Im a male with ED and work landscaping. Drinking a casein shake in the morning fills my system with protein. I wake up with deadly hunger pangs that make my stomach sick to the point I cant eat anything and it becomes a crippling cycle. Casein lets my body have protein in the reserves for the next 8 hours so my brain doesnt send the pain signal to my stomach. Now I have been able to eat breakfast in the mornings, lunch and dinner. My portions are still too small for a guy who should be over 200lbs but im making progress. Im hoping I can start eating big and lifting big weights by the summer next year. Just dont give up on recovery.",
      "created_utc": 1601596778.0,
      "score": 0,
      "context": []
    },
    {
      "id": "g7azn8i",
      "author": "timeforbedplease",
      "body": "This! It's likely some form of a starvation response.",
      "created_utc": 1601571896.0,
      "score": 4,
      "context": [
        {
          "id": "g79unzy",
          "author": "None",
          "body": "It sounds like your body wants to store all the food it can to make up for the time when you were starving yourself. It will take some time for your body to realize that you're not \"in danger\" anymore.",
          "created_utc": 1601549221.0
        }
      ]
    }
  ]
}