{
  "id": "j43x9r",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1601675929.0,
  "title": "Request: I don’t think I’ll pass as a woman if I recover.",
  "selftext": "Hello. I have been anorexic for two years now, and recently it’s starting to really hurt. My chest hurts and I feel weak. This makes me sad; it’s sad to think I’ve permanently damaged my body and that I may have problems forever because of this. Even still, I am having incredible trouble following my eating plan. \n\nI’m afraid to gain weight because as someone who is already misgendered regularly, I worry that because I carry weight in traditionally masculine places, feeling like a woman is going to be hard for me after recovery. I also worry that my appetite will grow out of control. \n\nI am not sure what to do. Should I just go to the hospital?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j43x9r/request_i_dont_think_ill_pass_as_a_woman_if_i/",
  "score": 68,
  "num_comments": 13,
  "comments": [
    {
      "id": "g7ghlya",
      "author": "such_dependent",
      "body": "If you have a doctor, please talk to them. If you don’t, go to a walk in clinic if you can and be COMPLETELY honest about the severity of your condition. Don’t down play it. Be brutally honest about your fears so they can give you the best treatment. I’m so sorry you’re going through this. Being misgendered on top of struggling with an eating disorder must be so fucking awful and difficult. I’m so glad you’re looking for help, though. I know you can do this.",
      "created_utc": 1601678310.0,
      "score": 30,
      "context": []
    },
    {
      "id": "g7h9oj5",
      "author": "None",
      "body": "Look, I'm going to be really blunt here: if you continue down this road, you won't have to worry about whether or not you'll pass as woman. You could die. You're having chest pain and your body is weak. Your body is shutting down. \n\nYou need to focus on living right now. You need to stop using this as an excuse. If you gain weight in the wrong places, then there are ways you can fix that later on. But you don't actually know what's going to happen. \n\nBeing misgendered sucks. Being dead is worse. Go to the hospital, be honest about your condition, tell them how bad you are and get help, please. Chest pain is really bad.",
      "created_utc": 1601695155.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g7ggvif",
      "author": "canyonlands2",
      "body": "I’m sorry for you’re situation and I can’t give you great advice because I’m not a misgendered person. It’s heartbreaking to know that you’re going through that with an eating disorder on top, and that your eating disorder helps you feel more like the gender you identify with. I am really concerned about your chest pain. I think you should see a doctor and I hope you can see a therapist that will help you feel better.",
      "created_utc": 1601677980.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g7gz74y",
      "author": "MathyMama",
      "body": "This just broke my heart. Please please please get medical help for your eating disorder. Immediately. You deserve life and love and health. Fears about how recovery will change your appearance are very common in ED sufferers, your doctors can help you through this! You can and will be a beautiful woman in recovery. I want to send you the biggest hug. Please update us- I will be thinking of you.",
      "created_utc": 1601688911.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g7gfuzs",
      "author": "transparentspruce",
      "body": "oh this is going to be deeply relatable for me one day\n\ni'm sorry that you're going through this, sis. i'm here for you if you need. i don't have any advice though, i'm sorry to say.",
      "created_utc": 1601677543.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g7h0kci",
      "author": "Snowbunny42",
      "body": "This was my biggest fear when I was going through treatment.  Refeeding put all the fat on my stomach at first and was really hard to handle mentally.  Eventually hrt did what it does and redistributed the fat in ways that made me more feminine and helped me pass.\n\nMy body couldn't absorb my hormones properly when I was deep in my anorexia.  I could never keep my levels right until after recovery.  And, I couldn't have curves if it weren't for body fat.\n\nGetting help and recovering is terrifying.  It's worth it though, especially when it comes to making progress in your transition.",
      "created_utc": 1601689784.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g7gmu6n",
      "author": "nooorecess",
      "body": "have you done any DBT? it offers a lot of really useful coping skills you can learn and practice, so that you feel more prepared for facing potentially triggering or hurtful situations later on.\n\nthe more you prepare an action plan ahead of time, the less likely you will be to relapse or return to unhealthy coping mechanisms when/if the distressing thing happens. it might feel goofy, but literally writing out “if _____ happens, i will [contact your support person, do a comforting activity that is non ED related, whatever works]” helps you feel more secure and regain a little power over situations that are unfair and out of your control.\n\nand just remember that thinness is a beauty standard placed on all of us and it does not determine our worth or who we are. only a very tiny percentage of all women look like models, in reality the world is extremely diverse and we have all kinds of different bodies. there is no “correct way” to look like a woman. you deserve to live a fulfilling life that isn’t dominated by thoughts about food and weight, we all need to stop cheating ourselves out of that",
      "created_utc": 1601681168.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g7gtxnm",
      "author": "Fickle_Orchid",
      "body": "At the very least you should consult your doctor about your fears, including your worries about being misgendered.",
      "created_utc": 1601685569.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g7hpmfp",
      "author": "None",
      "body": "My friend is seen as a boy by people that don't know her, partly because of her ED. She has a lot of guys as friends (including me) and we all would do anything if it would help her recover. We see her for the woman she is, but more importantly for the person she is. And we love her to bits for it.\n\nI can imagine your mind wants you to worry about how other people think and do in regards to you. That doesn't matter at all, but I will tell you how it is: People that are worth it will love and support you for who you are, not for how you look. And all the people who don't should gtfo. Everyone that matters wants you to be healthy and happy. And they are rooting for you to recover from this.",
      "created_utc": 1601707161.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g7gbiu5",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1601675929.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7hzyjm",
      "author": "highacidcontent",
      "body": "I'm here if you want to talk, DM me (if you want of course).",
      "created_utc": 1601716906.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7lkzhf",
      "author": "OkRaccoon8225",
      "body": "It’s great that you’re aware of what’s happening but don’t let it stop there, if you’re smart enough to know what you’ve been doing has consequences. Seek help before it’s too late.\nNever settle just because you think it’s permanent.\nI mean it could be the longer you weight to debate about getting help.\nSo this is the now\nDo something\nLike now!!! \nMadam\nOnce you start being reconfize as a girl you’ll start to love it\nYou may not think it\nBut after a while\nYou’ll have regret for not living your life that way but really it won’t hurt that bad because you’ll be happy to know you’re healthy and you feel good.",
      "created_utc": 1601777698.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7grqxm",
      "author": "gummygem7",
      "body": "Second this!!!! This is great advice.",
      "created_utc": 1601684188.0,
      "score": 1,
      "context": [
        {
          "id": "g7ghlya",
          "author": "such_dependent",
          "body": "If you have a doctor, please talk to them. If you don’t, go to a walk in clinic if you can and be COMPLETELY honest about the severity of your condition. Don’t down play it. Be brutally honest about your fears so they can give you the best treatment. I’m so sorry you’re going through this. Being misgendered on top of struggling with an eating disorder must be so fucking awful and difficult. I’m so glad you’re looking for help, though. I know you can do this.",
          "created_utc": 1601678310.0
        }
      ]
    }
  ]
}