{
  "id": "j5ipkm",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1601901861.0,
  "title": "Request: Anyone else bake/cook more when restricting?",
  "selftext": "Man, I've been baking and cooking sooooo much now and not eating any of it. It feels so good but also very sad. I don't know when's the next time I'm going to just lose control but I'm feeling so powerful and in control these days but I cannot stop thinking about food, it is on my mind all day every day. I look up recipe videos all the time on youtube and I used to watch soooooo many mukbang videos in the past but now I try to stay away from those as I feel it makes my cravings even more intense. It's so weird because those videos used to actually help me but now it's the total opposite for some reason. Baking & cooking now helps me in a way, I just love seeing the food and feeling it and smelling it. I just love being with it even if I'm not eating it. I'm just scared of losing control again. I'm so tired of this, honestly, I don't know how much more of this shit I can take. I'm going crazy most of the time but right now I'm in control but I know it won't last.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j5ipkm/request_anyone_else_bakecook_more_when_restricting/",
  "score": 89,
  "num_comments": 9,
  "comments": [
    {
      "id": "g7t41bd",
      "author": "seatangle",
      "body": "This is pretty common with EDs. Even people without eating disorders can become overly occupied with food if they are deprived for a significant amount of time.",
      "created_utc": 1601918785.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g7sko9j",
      "author": "None",
      "body": "i’m obsessed with cooking and baking too. Before my ed i used to hate cooking and i thought i was really bad at it, my mum always cooked for me or we went out to eat. Furring my ed and especially in recovery i have been so obsessed with making food, even if it wasn’t for me. I also loved going to the supermarkets and looking at all those products or buying them and never eating them or only eating them rarely.",
      "created_utc": 1601909630.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g7uwiop",
      "author": "stevieisbored",
      "body": "Yep. I make so much food for my partner and I intentionally cook it with meat so I have an excuse not to eat it because of my ✨lifestyle choices✨",
      "created_utc": 1601951388.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g7u8w66",
      "author": "kayteesays",
      "body": "When my ED developed, I started baking/cooking for others as a hobby. Eventually I quit my good healthcare job and got a job at a bakery. \n\nI eat keto, so I never eat anything I bake. )-:",
      "created_utc": 1601938065.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g7uj64y",
      "author": "theatrepunkindiegirl",
      "body": "yeah i developed this obsession when my ed started",
      "created_utc": 1601943919.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g7s7hrb",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1601901861.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7ty62i",
      "author": "jake25456",
      "body": "Yeeeeesssss",
      "created_utc": 1601932738.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7viyum",
      "author": "emmabella614",
      "body": "Yuppp",
      "created_utc": 1601969519.0,
      "score": 1,
      "context": []
    }
  ]
}