{
  "id": "j62r04",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1601980523.0,
  "title": "Request: I don’t know if this is an eating disorder?",
  "selftext": "Recently, I have been not happy to eat. I see it as just something I need to do in order to survive and not pass out. I try to postpone eating as much as possible until I absolutely have to eat because I feel so sick. However, I always feel gross eating and like I’m going to throw up or when I think of food I also get nauseous. I don’t know what is happening or if I should seek help.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j62r04/request_i_dont_know_if_this_is_an_eating_disorder/",
  "score": 46,
  "num_comments": 7,
  "comments": [
    {
      "id": "g7vv0vh",
      "author": "Haydouche",
      "body": "Sometimes the body can react like that when eating is so sporadic you and infrequent. That’s just my own personal experience, the less I eat, the less I want to eat and the worse I feel when I do finally eat",
      "created_utc": 1601983319.0,
      "score": 17,
      "context": []
    },
    {
      "id": "g7waec0",
      "author": "token_asian23",
      "body": "This is more or less how I described what it’s like eating; I don’t enjoy it that much and see it as a chore. I was eventually diagnosed with ARFID, Avoidant-Restrictive Food Intake Disorder. Of course I’m not diagnosing you, but it sounds like something you should look into. It can be described as being very picky, having little pleasure eating, being afraid to choke/vomit. It’s a relatively newer ED but still mentioned in the DSM-V. Hope this was helpful",
      "created_utc": 1601993953.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g7z4ta8",
      "author": "tymopa",
      "body": "I would recommend a professional opinion from an ED therapist if possible. Good for you for being alert and aware. Prevention is priceless. Keep us posted!",
      "created_utc": 1602047098.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7zky7i",
      "author": "ChickenAir",
      "body": "Well I guess I don't need to make my post about this haha",
      "created_utc": 1602064390.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g86ya3n",
      "author": "Akgh2880",
      "body": "I am the exact same way. I hate eating food and i just wish that i didn’t have to eat at all. i recently decided to get help and I’m seeing doctors and dietitian for it. They all said they were really glad that i decided to get help. so it wouldn’t hurt to talk to professional about it and get their opinion",
      "created_utc": 1602224018.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g7vsbc6",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1601980523.0,
      "score": 0,
      "context": []
    },
    {
      "id": "g87675x",
      "author": "ChickenAir",
      "body": "That's so good!",
      "created_utc": 1602232804.0,
      "score": 1,
      "context": [
        {
          "id": "g86ya3n",
          "author": "Akgh2880",
          "body": "I am the exact same way. I hate eating food and i just wish that i didn’t have to eat at all. i recently decided to get help and I’m seeing doctors and dietitian for it. They all said they were really glad that i decided to get help. so it wouldn’t hurt to talk to professional about it and get their opinion",
          "created_utc": 1602224018.0
        }
      ]
    }
  ]
}