{
  "id": "j6q3kv",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1602074524.0,
  "title": "Request: Being a trigger for my girlfriend",
  "selftext": "My girlfriend just recently got triggered back into eating problems after she weighed herself for the first time in a long time and since then has been struggling with body dysmorphia. While talking about it she let it slip that I (F) am a sort of trigger for her. I am tall and lanky and I also have a bunch of stomach issues that prevent me from eating full meals. I feel like I cant get undressed in front of her anymore. When I eat slower than her or dont finish my food that's also something I know bothers her. I just dont know what to do to help.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j6q3kv/request_being_a_trigger_for_my_girlfriend/",
  "score": 56,
  "num_comments": 6,
  "comments": [
    {
      "id": "g80lg8k",
      "author": "None",
      "body": "I'm sorry to say that I don't think there's really anything you Can do, besides maybe removing yourself from the situation which obviously is not ideal. It's not Your fault that she finds your form triggering. Part of recovery is learning to cope with our personal triggers. \nI'm very very sorry you've been put in this situation \nMy heart goes out to you 💕",
      "created_utc": 1602088058.0,
      "score": 25,
      "context": []
    },
    {
      "id": "g81f8d5",
      "author": "None",
      "body": "Her eating disorder is talking when she says that you are a trigger to it. Her ED will come up with any excuse or trigger to continue hurting her. It’s a mental illness she has to be able to fight basically everyday. I suggest you go to a nutritionist or doctor for yourself because that sounds like you need medical help that way you can show her getting help is a good thing. Then maybe ask her if she is willing to go to a therapist or RD. Maybe even get a body positive life coach. She relapsed but she can go back on track again she just needs support and the right people professionals that can help her.",
      "created_utc": 1602102529.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g80n59n",
      "author": "humongousgoat",
      "body": "Okokok, this is my best idea so far. Idk if it’ll be helpful for you but imma brainstorm.\n\nMaybe you could talk to a nutritionist for yourself, showing your gf you want to be able to eat more. Regardless if a nutritionist could help you more than other professionals you’ve probably already seen, you could be a good influence on her to speak to someone about her eating. A nutritionist may be a good compromise between therapy and “dieting”, she may go with the idea in mind that she’ll learn even more about how to eat disorderedly however, assuming you’ve already screened the person, they should help her learn about food through a sustenance and health perspective.\n\nEven if she doesn’t go, a nutritionist may be able to help you figure out how to eat around her. Which foods you both can eat and won’t trigger her disorder or your health.\n\nAnother idea: talk to a family doctor about how to best support her",
      "created_utc": 1602088895.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g824m7y",
      "author": "HikeSkiHiphop",
      "body": "Hey friend! I am also a boyfriend of someone who struggles with an ED. My girlfriend is about a year into recovery and as a somewhat lanky dude with stomach issues myself, I can relate super hardcore. What really helped our (me and my gf) relationship was establishing firm boundaries and keeping to them. Whenever I would do something that would be triggering I’d take a note of it and then ask about it at a later time when she was in a good place. We’d work out a game plan for how to address that situation in the future. Usually it was one of three general outcomes: 1, it would be something for me to avoid doing completely. 2. It was something that we would need to communicate about immediately before happening. 3. It was something that she needed to work on with her therapy and I shouldn’t change. \n\nIt’s important for your own mental health and for the longevity of her recovery for you not to take on the full breadth of her ED. Being supportive and helpful is really important but also recognizing what is healthy behavior for you and having realistic expectations for your behavior will allow her recovery to stay rooted in reality and allow your relationship to become stronger in the long run. The key comes down to communication. Have talks often, when she isn’t triggered and don’t be afraid to take space when you need it.",
      "created_utc": 1602115928.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g81k2na",
      "author": "chrisgoogi",
      "body": "You need to talk with her and get down to the root. I say see a nutritionists with her, but also... go see a therapists with her. Talk it out.",
      "created_utc": 1602104953.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g7zw06b",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1602074525.0,
      "score": 1,
      "context": []
    }
  ]
}