{
  "id": "j7ahsu",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1602152000.0,
  "title": "Request: I threw out my scales today.",
  "selftext": "  \n\nI did something terrifying today and I just wanted to post it here as I need support. Sorry if it’s too basic :(\n\nI have realised that I have a problem. I can’t control looking at the scale, I can’t control binging, or purging and I certainly can’t the self loathing that I have. I’m obese and because of that I hate myself. But I shouldn’t and I refuse to any longer. I need to change my brain so I’ve taken an important step- I threw out my scale and it’s ridiculous because I feel like sobbing. Because there’s some sick twisted thing in the back of my head telling me that I need it. But I don’t, and I’m not going to let it hurt me anymore. I’m done with my disorder bring in control.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j7ahsu/request_i_threw_out_my_scales_today/",
  "score": 175,
  "num_comments": 19,
  "comments": [
    {
      "id": "g83jtg7",
      "author": "Fat_banana_",
      "body": "You are worth more than the scales. You should be proud of yourself. That is a big step to take x",
      "created_utc": 1602156065.0,
      "score": 17,
      "context": []
    },
    {
      "id": "g83p4ep",
      "author": "pinkivhy",
      "body": "so so so proud of you!!!! Sending light",
      "created_utc": 1602160399.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g83xulx",
      "author": "gnawtydog",
      "body": "Congratulations on an important step towards healing! Realize that it's going to be difficult to break that numbers obsession but you CAN do this!! I haven't owned a scale for 20+ years and it's been instrumental in keeping me mentally healthy. I know how my body should feel and concentrate on that, not numbers. Best wishes 🍀 feel free to dm me if you're looking for some encouragement or insights.",
      "created_utc": 1602165854.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g84lceo",
      "author": "Arya_9",
      "body": "It’s really hard to convince yourself to do that!! I grew up with a scale in the bathroom and it’s hard not to step on it when it’s right there. Good job!",
      "created_utc": 1602177790.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g84un4m",
      "author": "chrisgoogi",
      "body": "That’s a huge ass step sis. Good job for winning the first battle!",
      "created_utc": 1602182261.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g84f4dl",
      "author": "durrityo",
      "body": "Frick yeah!!!!!",
      "created_utc": 1602174741.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g84l2c1",
      "author": "None",
      "body": "You can do it!",
      "created_utc": 1602177652.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g83fzcq",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1602152000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g84gu2n",
      "author": "jenny_mac_",
      "body": "WELL DONE! You do NOT need a scale in your home nor do you need to ever know your weight ever again. Click my account to see other comments I’ve left on other posts in r/eatingdisorders, I think the info in them would really help on your path. \nYou got this! You’re doing an amazing job by recognizing what doesn’t serve you and having the desire to change. Keep up the great work!",
      "created_utc": 1602175575.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g852m9w",
      "author": "quinoabrogle",
      "body": "The strength? The determination? The bravery?\n\nYou fuckin go! Proud for you:)))",
      "created_utc": 1602185540.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g855j72",
      "author": "sapphicmary",
      "body": "Good job! I'm so proud of you! That's such a hard, huge step forward. You are not the scale. You are not a number. ❤️",
      "created_utc": 1602186875.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g857orw",
      "author": "FitLotus",
      "body": "I hid my scale after years of torturing myself. I weigh myself every so often just to check in, but not every day like I used to. definitely has positively impacted my mood.",
      "created_utc": 1602187753.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g85bd82",
      "author": "be-better-me",
      "body": "You are so brave! Congratulations",
      "created_utc": 1602189260.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g85iv44",
      "author": "meowy_face",
      "body": "That’s fantastic!!!! You can do this and I believe in you!!❤️",
      "created_utc": 1602192442.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g85xz97",
      "author": "jeabgrenouille",
      "body": "Yeah buddy!!!! I stopped weighing myself for 7 years. That helped me so much in that time. I weighed myself again when I knew that it would just be data for me, and when I felt I had really become completely emotionally detached from the number, knowing how it can be affected by water and muscle mass.",
      "created_utc": 1602200441.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g868xki",
      "author": "2alchow",
      "body": "Yasssss! That’s awesome! You are so much more than some numbers on a digital plate. Good for you!!!! I’m not quite there yet (and I share a house with people who use it) but I hope to one day be as brave as you just were!!",
      "created_utc": 1602206657.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g86qfvd",
      "author": "mildlystable_",
      "body": "Proud of you! I know the journey you are on and it is tough but SO worth it. You got this. (https://vm.tiktok.com/ZMJPYYftt/)",
      "created_utc": 1602217302.0,
      "score": 1,
      "context": []
    }
  ]
}