{
  "id": "j8hde6",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1602320816.0,
  "title": "Request: Is avoiding certain food an ED symptom",
  "selftext": "I’m very concerned about one of my family member that’s currently on a diet and they really wanna lose weight. They’re purposely avoiding to eat carbs and sugar and sometimes they skip their meals too. I wanna know if that’s okay and won’t develop an ED, not only what they’re eating is very little for me but also knowing they wanna eat lesser and lesser is really triggering to me. Can I know if that’s normal to do so since they’re on a diet? Or it’s not healthy and I should do something about it. Any advice is appreciated, thank you.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j8hde6/request_is_avoiding_certain_food_an_ed_symptom/",
  "score": 39,
  "num_comments": 7,
  "comments": [
    {
      "id": "g8awefn",
      "author": "deutschestar",
      "body": "I used to work with a girl who was on a very strict Keto diet (very low carb, high fat) with intermittent fasting and definitely seemed to have developed disordered eating - although maybe not an eating disorder. She was even avoidant of taking OTC medications bc she was scared there were carbs in them. It was very triggering for me as well and I always felt like i had to compete with her. I always feel like anyone around me trying to lose weight or diet is developing an ED, I think we just become hyper aware and maybe watch out for telling signs. Which isn’t a bad thing. Your family member could be struggling with disordered eating patterns and not even realize it. I don’t see harm in trying to talk to them as long as it’s not accusatory or harmful.",
      "created_utc": 1602323708.0,
      "score": 20,
      "context": []
    },
    {
      "id": "g8cb9su",
      "author": "notelixa",
      "body": "I have ED and decided to cut off soda, which I haven’t drink it in about 7 years and also became vegetarian about 3 years ago... I often think if this is my ED taking over but somehow is good for me, so I just let it flow\nThere was a time where I thought cutting off some other stuff but I was to scared to not having control... any ways",
      "created_utc": 1602350762.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g8ccp5d",
      "author": "Northstar04",
      "body": "It depends on how long they do it for and how extreme the restriction is. Restrictive eating for a few weeks or months isn't terribly concerning if they are doing it in a reasonable and balanced way. And keto diets can be effective for people with diabetes if done under the supervision of a nutritionist. But even a Keto diet is supposed to have SOME carbs. It is just a very small amount.\n\nFEAR of eating ANY carbs (or pills because they might contain carbs like a respondent said) sounds like a mental disorder to me. A healthy person following a low or no carb diet should be ABLE to eat carbs; it would just throw them off their diet that day and they would have to get back into ketosis if that is their goal. If someone seems deeply distressed by the idea of eating a normal food... I would question their mental health and feel they dont have a healthy relationship with food.\n\nI personally don't like the keto diet. I tried it twice and both times it just made me feel sick. The thought or eating ONLY fat and protein made me want to puke and not in a bulima-inspired way. \n\nIntermittant fasting is easier for me, and okay if not taken to extremes. Three meals a day isn't necessary for everyone to have energy. I have never really eaten breakfast unless I am at a conference or something where food is served. \"fasting\" for me is just not eating after 10pm and not rising early enough to be hungry before noon. Lunch is usually my first meal of the day.",
      "created_utc": 1602351558.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g8byn5q",
      "author": "gummygem7",
      "body": "Even if a diet doesn’t lead to health issues, restriction will screw with with a person psychologically. \n\nNaturally if you restrict, you’re going to feel totally out of control around those foods you don’t let yourself have.\n\nAnd avoiding carbs isn’t ideal. The brain needs whole grains to function. Carbs give your body energy. \n\nIf you’re trying to get through to them I would recommend coming with the facts - follow some HAES dietitians and therapists on Instagram. Dieting doesn’t work. Neither does skipping meals. Dieting causes a person to gain all the weight back and then some. It also is a miserable way to live your life whether it leads to an eating disorder or not.\n\n\nGood luck.",
      "created_utc": 1602344315.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g8atjzx",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1602320816.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8ayimz",
      "author": "pyoooo",
      "body": "Yes, I personally also think that people that are trying to be on a diet are struggling with ED and I’m very triggered by that. I always remind myself to not eat more than what my family member did. But I told them that i was worried about them developing an ED, they promised me that they’ll stop when they reached their goal, so I’ll just try my best not to judge their eating patterns. Did you talk to your friends tho about how you felt by her diet? I hope you’re okay. thank you so much!",
      "created_utc": 1602326023.0,
      "score": 5,
      "context": [
        {
          "id": "g8awefn",
          "author": "deutschestar",
          "body": "I used to work with a girl who was on a very strict Keto diet (very low carb, high fat) with intermittent fasting and definitely seemed to have developed disordered eating - although maybe not an eating disorder. She was even avoidant of taking OTC medications bc she was scared there were carbs in them. It was very triggering for me as well and I always felt like i had to compete with her. I always feel like anyone around me trying to lose weight or diet is developing an ED, I think we just become hyper aware and maybe watch out for telling signs. Which isn’t a bad thing. Your family member could be struggling with disordered eating patterns and not even realize it. I don’t see harm in trying to talk to them as long as it’s not accusatory or harmful.",
          "created_utc": 1602323708.0
        }
      ]
    },
    {
      "id": "g8ayw1j",
      "author": "deutschestar",
      "body": "I’m glad that you made them aware that you were worried for them. I hope that they really do stop once they reach their goal and don’t develop any ED kind of thought patterns and habits. I did not talk to her about it unfortunately. We weren’t terribly close and I wasn’t sure how to approach the situation. The office that I work in is all female and is very pro diet culture, including Keto. I knew that any sort of counter argument I would have made would’ve been met with hostility from her and others and I just don’t have the energy or brain power to argue about it. I am worried about her though and hope that she is ok :( it just seems so well accepted in my office to skip meals and watch intake, etc. thank you! and no problem, I hope that you are ok as well! 💕",
      "created_utc": 1602326299.0,
      "score": 3,
      "context": [
        {
          "id": "g8awefn",
          "author": "deutschestar",
          "body": "I used to work with a girl who was on a very strict Keto diet (very low carb, high fat) with intermittent fasting and definitely seemed to have developed disordered eating - although maybe not an eating disorder. She was even avoidant of taking OTC medications bc she was scared there were carbs in them. It was very triggering for me as well and I always felt like i had to compete with her. I always feel like anyone around me trying to lose weight or diet is developing an ED, I think we just become hyper aware and maybe watch out for telling signs. Which isn’t a bad thing. Your family member could be struggling with disordered eating patterns and not even realize it. I don’t see harm in trying to talk to them as long as it’s not accusatory or harmful.",
          "created_utc": 1602323708.0
        },
        {
          "id": "g8ayimz",
          "author": "pyoooo",
          "body": "Yes, I personally also think that people that are trying to be on a diet are struggling with ED and I’m very triggered by that. I always remind myself to not eat more than what my family member did. But I told them that i was worried about them developing an ED, they promised me that they’ll stop when they reached their goal, so I’ll just try my best not to judge their eating patterns. Did you talk to your friends tho about how you felt by her diet? I hope you’re okay. thank you so much!",
          "created_utc": 1602326023.0
        }
      ]
    }
  ]
}