{
  "id": "j9323c",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1602411717.0,
  "title": "Request: does anyone else starve themselves for self harm / control instead of body image?",
  "selftext": "i don't eat because i want to feel exhausted and i want myself to physically feel as weak as i feel mentally. my body has never really been an issue for me. does anything starve themselves for this? or generally something unrelated to body image",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/j9323c/request_does_anyone_else_starve_themselves_for/",
  "score": 269,
  "num_comments": 37,
  "comments": [
    {
      "id": "g8gwcch",
      "author": "Alienist404",
      "body": "Yeah, I'll purposefully deprave myself of any food and sometimes even water to punish myself. I alternate between that, or binging till I'm so bloated and in so much pain that I want to throw up, but I'm incapable of forcing myself to vomit, so I just suffer.\n\nFood was always a basic human right that was used as a way to control and punish me so I've never had a healthy relationship with food in the first place.",
      "created_utc": 1602414065.0,
      "score": 30,
      "context": []
    },
    {
      "id": "g8h2bm6",
      "author": "None",
      "body": "Personally it was a bit of both for me, and I kind of switched between the two. Sometimes I'd just be fixated on self-destructing (the aim wasn't to look \"beautiful\" etc, but to make myself as unwell as possible), but then that was driven by the same self-hate that fuelled my body image issues, so things got pretty confusing pretty quick. For a while I was convinced I didn't have any body-image issues anymore, but then as soon as I started gaining weight and my body started growing I freaked the heck out, so there was still obviously still something going on with that side of things.  \n\n\nI think it's a lot more common than people think though. Society's common understanding of eating disorders is that they're solely the result of body dysmorphia/body image issues. I think that's a bit of an issue in the medical profession too, and as a result people without body image issues can struggle to get a proper diagnosis and appropriate support, and the support available is almost entirely tailored to body-image issues. I remember going to a support group which had set topics for each day, mostly centred around \"feeling fat\" and body image. Almost everyone spoke about things like self-harm, self-destruction and dissociation from their body, but the person running the group had no idea how to deal with that side of things so just changed the topic back to body image etc. It was really disheartening.",
      "created_utc": 1602416783.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g8hreod",
      "author": "minalv",
      "body": "Yes. I was diagnosed with depression and my therapist described it as a “slow suicide”, I feel unworthy of food and feel like I need to be as empty as possible because I don’t deserve to be “given life” if that makes sense. Sorry it’s super fucking dark but It’s definitely not “body” related in my case.",
      "created_utc": 1602428881.0,
      "score": 17,
      "context": []
    },
    {
      "id": "g8hl8a3",
      "author": "None",
      "body": "I like to feel the pain starvation causes, mostly because it makes me feel in control.",
      "created_utc": 1602425208.0,
      "score": 10,
      "context": []
    },
    {
      "id": "g8hoa9l",
      "author": "_Sewerslide_",
      "body": "  I do it for both self harm and body image. I’ve always had terrible body image. I starve and b/p I go through phases of switching off between both. My self harm is cutting but recently since trying to quit cutting my eating disorder has gotten ALOT worse. Like throwing every meal and snack up. \n\n     I do it for control though also. I’ve had lots of abuse and trauma in my childhood so one thing I hardly got when I was little was control. So I got control through restricting and self harm. I like to be in control.",
      "created_utc": 1602426982.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g8hrfm0",
      "author": "Another_Human-Being",
      "body": "Yes, I don't eat because I feel like I deserve to starve and use it as punishment for myself and I started because I didn't have control over anything at that moment and needed control over something. But I also don't want to gain weight. If I gain weight, I feel like a failure and eat even less.",
      "created_utc": 1602428897.0,
      "score": 6,
      "context": []
    },
    {
      "id": "g8iooue",
      "author": "peach_kittyy",
      "body": "Honestly I feel so good when I starve myself. It feels so much better than being full. \n\nI love how weak my body gets to the point of passing out.",
      "created_utc": 1602445642.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g8nzr04",
      "author": "SoftDramatic",
      "body": "That's always been my \"thing\".\n\nI've always been on the thinner side (until recently), so I always felt decently confident about my body, except when called flat. And the times I thought I was fat.\n\n&#x200B;\n\nAnyways, my eating was always questionable, but it took a nosedive when living with my abusive ex for two years.\n\nThat relationship stressed me out so much, and I always put off eating to get \"more important\" things done first.\n\nIt didn't help that I had so many people, including my ex, tell me how \"beautiful\" my malnourished body was, so it became so hard to realize that my lifestyle had caught up to me, and I was disgustingly malnourished.\n\nI finally dumped him and it's been exactly one year since my lowest weight.\n\n&#x200B;\n\nAt times I find myself not eating in lieu of \"more important\" things, I'm also at my highest (though still healthy) weight and that brings anxiety about  no longer having \"that\" body that was always praised. That anxiety makes it easy to become fatigued, and the scale not really changing makes me think it's okay.\n\n&#x200B;\n\nOne thing that helps me stay on track is gardening.\n\nGardening is alllll about control. You pick the plants, you need to be out there watering them on a schedule, you're feeding the bugs, you're trimming the spent blooms, you're battling spiders, harvesting seeds, re-spreading those seeds...it's a whole ass mission.\n\nMy current \"most important\" thing is saving the Monarch butterfly population through gardening, as they've dropped 90% since the 90's. The only plant their caterpillars eat is Milkweed, so I've spent a lot of my time focusing on those numbers.\n\nAt the end of a long day of gardening, I'm hungry AF.\n\nAnd I can't ignore that hunger because the future of the Monarch butterflies is partially in my hands, so if I don't eat, they don't eat.",
      "created_utc": 1602565463.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g8hs6yj",
      "author": "None",
      "body": "Yeah, I don’t care what I look like, I just fucking hate myself and not eating is my preferred method of harm.",
      "created_utc": 1602429342.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g8i7xg0",
      "author": "ashadowcreature",
      "body": "Yeah, it's because my brain feels like it's going *too* fast though, so the less I eat, the more numb I feel and then everything in my head/life isn't so overwhelming.\n\nThen the actual ED bits come in where its easier to just control one thing (food) bc I have no control over anything else in my life & the more small I get the more I feel like I'm at least good at something, even if it is not eating",
      "created_utc": 1602437974.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g9d6yq0",
      "author": "ribbitrabbit27",
      "body": "It's scary that this is the first post i saw on this page, because this is something i do frequently. I'm doing it right now. I starve myself as punishment after i have an emotional outburst, and it's gotten to the point where if I'm depressed or upset at myself, my body won't show many signs of hunger, or food will taste unappealing to me even if i try to eat. So I'll eat next to nothing until my emotional problem is solved, because I'm overcompensating for my lack of control in certain events. Shit sucks dude",
      "created_utc": 1603140372.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g8gri7c",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1602411717.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8h4bh7",
      "author": "crystaldmb41",
      "body": "Me",
      "created_utc": 1602417628.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8hqzgp",
      "author": "endothermic_amniote",
      "body": "yes!!! both self harm and control. i stop eating in hopes to feel smaller and become invisible. it’s a behavior that’s stemmed from both anxiety and depression.",
      "created_utc": 1602428630.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8impf5",
      "author": "d3vilsfav",
      "body": "I saw it as a way of committing suicide, but slowly so that noone would say I committed suicide if I die. Probably sounds stupid. \n\nI am happy I didnt die after my first health scares though.",
      "created_utc": 1602444900.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8is01o",
      "author": "candy_irl",
      "body": "Yes. Whenever something frustrantes me too much im like thats it i don't deserve to eat. it's not healthy at all but it's not uncommon",
      "created_utc": 1602447043.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8j3hoi",
      "author": "iwannakmsuwu",
      "body": "I have a little bit of body image issues but tbh I started starving myself as self harm. For me, the weight loss was just a positive side effect that encouraged me on, but one day I just started starving myself and then didn’t stop. And then the self harm stopped at the same time so yay, I was doing better, right? (Lmao no I wasn’t) And then when I tried to go back to eating normally the cutting returned. Now I’m stuck between which self harm method I prefer.",
      "created_utc": 1602452133.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8jgimh",
      "author": "quinoabrogle",
      "body": "I definitely relate to this. I have come to *enjoy* hunger pangs and have to, now that I'm trying to recover, use other signs as hunger cues.\n\nOne way I've most productively faught with my body to eat is when I feel hunger, i throw something in the oven. So, like, I throw a veggie burger patty in the oven, which takes about 30 minutes, and I get the satisfaction of feeling hunger and a bit weak, but I'm not actively starving myself? Prob not the healthiest, but baby steps.",
      "created_utc": 1602459072.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8hq6cr",
      "author": "ivymel666",
      "body": "Yes. I have depression , very serious. Instead of cutting myself I just stop eating, for days.",
      "created_utc": 1602428141.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8i5lbq",
      "author": "hiimalextheghost",
      "body": "I’ve Definitely had my fair share of relapses caused by self harm thought cycles. And I’m sure never learning my own worth outside of my body or thinking i deserved this pain wasn’t helpful",
      "created_utc": 1602436757.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8i7zfh",
      "author": "thinkaarushi",
      "body": "hey, I think I know what you're going through, im going through something similar. so for me even though body dysmorphophobia is definitely there, it obviously comes with a host of other problems, or rather, it stems from a host of other problems. I find myself self-harming quite often, cutting is the easiest way. honestly it's so scary sometimes, I feel scared and feel like I'm just watching myself do something like that to my self and with so much vigour. it also makes me like lose focus in every day tasks and sometimes becomes a 'solution' to not face my fears, ( I have high functioning general anxiety disorder). it's really dauting sometimes and completely drains me. also since this is related to eating disorders, I am bulimic but don't have the exact symptoms, I've tried to come out of it but it's really hard, self harm seems like a viable option to channel all the emotion but I think we know it isn't viable at all, even though sometimes it really does feel like it. also if youre suffering from an eating disorder,  I would give you some advice a friend gave me, which is to stop using tumblr, trust me it really helps. \n\ndo reach out to me if we could talk. take care okay?",
      "created_utc": 1602438004.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8ja9a5",
      "author": "Pomrio",
      "body": "It started as a body image issue for me, and slowly turned into self harm as time went on and I got more aggressive with myself. I would say it’s still both but leaning towards sh",
      "created_utc": 1602455592.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8jcf2y",
      "author": "Sneakyturtle2a",
      "body": "I guess the issue isn't always about the food both these things sound like coping mechanisms that could be used as a form of control when something out of your control in your life gets too much\nIts trying to find healthy coping mechanisms maybe",
      "created_utc": 1602456761.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8jlmig",
      "author": "katsukatsuyuuri",
      "body": "Y U P",
      "created_utc": 1602462000.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8jqc3u",
      "author": "ConsumingKels",
      "body": "Yes. I need the control. I control when I feel hungry. I control the pain that I do to myself and how long I feel the hunger pangs. I do it for exactly these reasons. I focus more and am more productive when I am actively punishing myself both by not eating and my thoughts telling me what a piece of trash I am.",
      "created_utc": 1602464573.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8k97er",
      "author": "country_baby",
      "body": "I feel like this is at least part of my issue. I suffer from almost constant anxiety and depression. I feel completely out of control of my life and emotions, but food I can control.",
      "created_utc": 1602476112.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8kcnn1",
      "author": "None",
      "body": "I had an ED because I had trauma and history of sexual abuse and I also self harmed. I wanted to be skinny as possible to lose my curves and not be seen as sexually attractive at all. I wanted to basically look as ugly and disgusting as I felt in the inside. I didn’t want any sexual attention or look beautiful. So my ED had nothing to do with looking skinny to be attractive but more to look unattractive. I was scared I being found sexually appealing and be raped again. I guess it’s kinda related to body image but the opposite of what most people think. Most want to be skinny to be “attractive” but I wanted to basically die and harm myself for feeling so sick of myself for being sexually abused I feel gross with my body being attractive. Also when I have depressive episodes it triggers my restrictive eating to want to die and disappear and hide and not get any attention from anyone.",
      "created_utc": 1602478803.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9rh8yw",
      "author": "somethinrandomb",
      "body": "I will do this or I purge for self harm. I will get the urge to throw up regardless of when the last time I ate was just because I hate myself and I know it is painful and will hurt me and is self-destructive. I feel so much better after I do, even if there is hardly anything to throw up.\n\nOr I'll tell myself I have to go all day without eating because I deserve the horrible feelings that come along with it. Then, if I fail and eat anything, I make myself throw it up.\n\nIts frustrating because my doctor and therapist say I have bulimia nervosa, and are trying to treat me for that, but I don't binge, so I feel like their treatment plan isn't working for me. Everything has been centered around how to avoid a binge so I don't purge, but thats not why I do it.",
      "created_utc": 1603464423.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gb5xsm7",
      "author": "marlysse",
      "body": "If I don’t feel like I’ve accomplished enough in my day I tell myself that I haven’t done anything that day and don’t deserve to eat/drink water/put on lip balm etc.",
      "created_utc": 1604528578.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbo9qul",
      "author": "None",
      "body": "Both but not anymore forced to recover",
      "created_utc": 1604884264.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh6miu8",
      "author": "HateKnuckle",
      "body": "Yep. Currently on second day of no food. My longest is a week.\n\nSometimes the emotional pain hits too hard and I find hunger enjoyable. I don't really care too much what I look like. I'm here for the hunger.",
      "created_utc": 1609076530.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8jpsch",
      "author": "seravivi",
      "body": "I just wanted to say thank you for you openness. Your comment made me realize what I've been doing to myself with some of my choices.",
      "created_utc": 1602464271.0,
      "score": 8,
      "context": [
        {
          "id": "g8gwcch",
          "author": "Alienist404",
          "body": "Yeah, I'll purposefully deprave myself of any food and sometimes even water to punish myself. I alternate between that, or binging till I'm so bloated and in so much pain that I want to throw up, but I'm incapable of forcing myself to vomit, so I just suffer.\n\nFood was always a basic human right that was used as a way to control and punish me so I've never had a healthy relationship with food in the first place.",
          "created_utc": 1602414065.0
        }
      ]
    },
    {
      "id": "g9bctm3",
      "author": "tattered_teddy28",
      "body": "im so sorry for your suffering. food was also used as punishment and therefore, i understand having a really unhealthy view of food. i feel really un- comfortable eating in public and often cry during eating. Have you found anything that helps? A show, book, podcast, anything?? Honest question & also wanted to express my sympathy for your situation. I hope we can both start to feel much better soon:);)",
      "created_utc": 1603108639.0,
      "score": 1,
      "context": [
        {
          "id": "g8gwcch",
          "author": "Alienist404",
          "body": "Yeah, I'll purposefully deprave myself of any food and sometimes even water to punish myself. I alternate between that, or binging till I'm so bloated and in so much pain that I want to throw up, but I'm incapable of forcing myself to vomit, so I just suffer.\n\nFood was always a basic human right that was used as a way to control and punish me so I've never had a healthy relationship with food in the first place.",
          "created_utc": 1602414065.0
        }
      ]
    },
    {
      "id": "g8jgp5i",
      "author": "quinoabrogle",
      "body": "This is something I agree with. It's not so much being not fat/looking attractive. My biggest \"wins\" have been when my body looked *sick*.",
      "created_utc": 1602459177.0,
      "score": 3,
      "context": [
        {
          "id": "g8h2bm6",
          "author": "None",
          "body": "Personally it was a bit of both for me, and I kind of switched between the two. Sometimes I'd just be fixated on self-destructing (the aim wasn't to look \"beautiful\" etc, but to make myself as unwell as possible), but then that was driven by the same self-hate that fuelled my body image issues, so things got pretty confusing pretty quick. For a while I was convinced I didn't have any body-image issues anymore, but then as soon as I started gaining weight and my body started growing I freaked the heck out, so there was still obviously still something going on with that side of things.  \n\n\nI think it's a lot more common than people think though. Society's common understanding of eating disorders is that they're solely the result of body dysmorphia/body image issues. I think that's a bit of an issue in the medical profession too, and as a result people without body image issues can struggle to get a proper diagnosis and appropriate support, and the support available is almost entirely tailored to body-image issues. I remember going to a support group which had set topics for each day, mostly centred around \"feeling fat\" and body image. Almost everyone spoke about things like self-harm, self-destruction and dissociation from their body, but the person running the group had no idea how to deal with that side of things so just changed the topic back to body image etc. It was really disheartening.",
          "created_utc": 1602416783.0
        }
      ]
    },
    {
      "id": "g9bd68o",
      "author": "tattered_teddy28",
      "body": "this sounds like a really sad experience. i hope you find better help soon. i agree alot that sometimes even mental health profs don't always know how to treat eating disorders bc it has alot to do with good nutrition info to start with; sometimes i try to lie & tell myself, i don't know any better, etc... i hope we can find people to help or talk about stuff soon:);)",
      "created_utc": 1603108916.0,
      "score": 1,
      "context": [
        {
          "id": "g8h2bm6",
          "author": "None",
          "body": "Personally it was a bit of both for me, and I kind of switched between the two. Sometimes I'd just be fixated on self-destructing (the aim wasn't to look \"beautiful\" etc, but to make myself as unwell as possible), but then that was driven by the same self-hate that fuelled my body image issues, so things got pretty confusing pretty quick. For a while I was convinced I didn't have any body-image issues anymore, but then as soon as I started gaining weight and my body started growing I freaked the heck out, so there was still obviously still something going on with that side of things.  \n\n\nI think it's a lot more common than people think though. Society's common understanding of eating disorders is that they're solely the result of body dysmorphia/body image issues. I think that's a bit of an issue in the medical profession too, and as a result people without body image issues can struggle to get a proper diagnosis and appropriate support, and the support available is almost entirely tailored to body-image issues. I remember going to a support group which had set topics for each day, mostly centred around \"feeling fat\" and body image. Almost everyone spoke about things like self-harm, self-destruction and dissociation from their body, but the person running the group had no idea how to deal with that side of things so just changed the topic back to body image etc. It was really disheartening.",
          "created_utc": 1602416783.0
        }
      ]
    },
    {
      "id": "g8jqoq6",
      "author": "alaskanelliot",
      "body": "Completely understand this though, the idea of slow suicide is something that doesn’t often get a lot of attention. In some cases, it kind of is deeply body related but invalidated by typical social ideas of eating disorders.",
      "created_utc": 1602464774.0,
      "score": 4,
      "context": [
        {
          "id": "g8hreod",
          "author": "minalv",
          "body": "Yes. I was diagnosed with depression and my therapist described it as a “slow suicide”, I feel unworthy of food and feel like I need to be as empty as possible because I don’t deserve to be “given life” if that makes sense. Sorry it’s super fucking dark but It’s definitely not “body” related in my case.",
          "created_utc": 1602428881.0
        }
      ]
    },
    {
      "id": "g9bdq2n",
      "author": "tattered_teddy28",
      "body": "im so sorry about this feeling for you. i know what it feels like to feel hollow all the time, even if you beat or don't and if you need to talk ever; i know i am just a stranger but myb we can relate. i mostly have to stay in bed and monitor how much i stand, so please be careful, i feel as though ive done permanent damage to my body & so we might be able to console each other sometimes. best of luck in feeling better:);)",
      "created_utc": 1603109315.0,
      "score": 1,
      "context": [
        {
          "id": "g8iooue",
          "author": "peach_kittyy",
          "body": "Honestly I feel so good when I starve myself. It feels so much better than being full. \n\nI love how weak my body gets to the point of passing out.",
          "created_utc": 1602445642.0
        }
      ]
    }
  ]
}