{
  "id": "ja18qo",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1602542339.0,
  "title": "Request: I attempted recovery on my own!",
  "selftext": "So today I ate lunch! Okay so I never eat so this to me makes me so happy because i didn’t feel guilty and even tho I ate so much more than a normal person would...I’m still happy that I don’t feel guilty for it. At first I was hesitant and I was having a mental breakdown because I didn’t want to eat and i felt terrified to even try and recover. However after I stopped crying i decided to just go for it and eat and I did so I’m not planning on purging. I just will try today to recover. I also decided to not weigh myself today because i know if i do it will make me regret everything i ate and it will make me depressed so I just won’t weigh myself.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ja18qo/request_i_attempted_recovery_on_my_own/",
  "score": 70,
  "num_comments": 7,
  "comments": [
    {
      "id": "g8nd4ec",
      "author": "jeabgrenouille",
      "body": "Yay!! I have this similar significant memory of when my family went skating. My grandpa gave us kids money to spend on anything from the concession and I went and bought a box of Smarties (Canadian/British candy that are like m&ms. I love them. I just have so many awesome childhood memories associated with them... This included). \n\nI ate the box and I was so proud and happy. I hadn't felt any emotion in months, and it was just the first time I felt happy. I showed everyone my empty box and my family was so happy and proud of me. It was so nice that I was offered that money with no one expecting anything from me or begging me to spend it. It was just my idea and I went for it and it was so lovely. I don't remember feeling anxious about it whatsoever. Just so happy. I didn't think about it or agonize at all and stop myself. Happy memory. \n\nI can't remember where that memory falls in the timeline of my recovery. I don't think for me, it started my recovery. I think it was more of a one-off moment where it was like my anorexia just disappeared for some reason. In any case, I proved to myself that food could be a happy thing again and not a terrifying thing like it had been for so long.\n\nGood luck!",
      "created_utc": 1602551163.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g8oo12p",
      "author": "quinoabrogle",
      "body": "It's not an easy thing to do alone, but you can do it!",
      "created_utc": 1602590665.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8ppi54",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1602611796.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8my4jb",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1602542339.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8noaqs",
      "author": "pinkrilakkumas",
      "body": "Aw congrats! ❤️",
      "created_utc": 1602557663.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8od32t",
      "author": "thinkaarushi",
      "body": "this is so amazing and it kfndbfbbfjdjdjsjs it makes me SO happy ugh I'm really happy for you, you got this ❤",
      "created_utc": 1602578963.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g90z6ef",
      "author": "stephaniestegosaurus",
      "body": "Recovering now for 5-6 years. Just take it one meal at a time, one day at a time. Be kind with yourself. You got this <3",
      "created_utc": 1602872806.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g90zcha",
      "author": "stephaniestegosaurus",
      "body": "Agreed so much on the ups and downs: patience and persistence are key!",
      "created_utc": 1602872889.0,
      "score": 1,
      "context": [
        {
          "id": "g8ppi54",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1602611796.0
        }
      ]
    }
  ]
}