{
  "id": "jaafad",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1602583378.0,
  "title": "Request: my ED is affecting relationship with husband",
  "selftext": " \n\nI have been severely restricting calories (under xx most days .. an extremely small amount). I refuse to even put anything in my mouth that has any amount of carbs. It’s putting a severe strain on my relationship with my husband. I want to lose more weight and he wants me to stop. I have body dysmorphia and I always feel fat. He has always known I struggle with ED but only very recently have I told him how my mind works (how I look fatter immediately after eating something I shouldn’t have.) This greatly upset him and he refused to talk to me anymore after that and slept elsewhere away from me. \n\nHas anyone else dealt with a partner who has reacted this way? What did you do?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jaafad/request_my_ed_is_affecting_relationship_with/",
  "score": 47,
  "num_comments": 7,
  "comments": [
    {
      "id": "g8p4n9a",
      "author": "Fickle_Orchid",
      "body": "You should get individual and couples counseling",
      "created_utc": 1602601202.0,
      "score": 39,
      "context": []
    },
    {
      "id": "g8pgxi8",
      "author": "None",
      "body": "People tend to not like the truth. Even when they ask for it. Idk why punishment is seen as an answer though. I guess he doesn’t know what else to do.",
      "created_utc": 1602607557.0,
      "score": 11,
      "context": []
    },
    {
      "id": "g8pm5gz",
      "author": "captain_jayne",
      "body": "How would you feel if the person you loved and wanted to spend your life with was hurting themselves, to the point where they could have serious medical problems or die? Would you just say \"Go for it hun!\" No.\n\nIf he was a meth addict would you say, here let me help you find ways to make your using easy. No. If he was a drunk & he drank every day and night and his liver was failing, but he wouldn't stop...would you say - here is a 6 pack. \n\nI know you don't see it that way. But you ARE hurting yourself. Why would he help you continue to do that? He's upset. He may feel like he's lost you. He's probably very concerned for YOU. This is a mental problem, and you need counseling. He probably does as well. What's more important? Your weight on a scale....or your health and marriage? Do you really want to live this way forever? \n\nI mean, not to mention, we all know how MISERABLE we are while in active ED. Imagine what it's like for the people in our lives, especially our close relationships with partners. The obsessing, the counting, the sadness, panicking, being moody, etc. Most people find pleasure in food, and the whole acts around it...like a romantic dinner with your husband. Christmas dinner with the family. A lot of people associate food with positive memories.   \n\n\nIt's a lot to process, and I hope you guys go to counseling and you seek help. I don't think he's in the wrong, but if you decide the ED over your marriage, that's on you.",
      "created_utc": 1602610148.0,
      "score": 23,
      "context": []
    },
    {
      "id": "g8ogrhu",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1602583378.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g8pc69j",
      "author": "sparklymagicalpanda",
      "body": "Sounds like an emotional maturity issue. The reaction seems childish and probably reflects a bigger problem in how he responds to things and sees the world around him (from a very self-centred perspective). Does he normally respond to problems by giving you the silent treatment? Silent treatment is a form of emotional abuse/manipulation. I highly suggest you look into narcissism and see if the traits of someone with Narcissistic Personality Disorder (or just a lot of narcissistic qualities) matches his traits. Warning, it may or may not open up a whole can of worms.",
      "created_utc": 1602605121.0,
      "score": -16,
      "context": []
    },
    {
      "id": "g8qs3gi",
      "author": "None",
      "body": "I should have probably read what subreddit this was before reading the title.. my face at ED 🤔 then husband 🤨 then when I saw the subreddit 😮",
      "created_utc": 1602631066.0,
      "score": -1,
      "context": []
    },
    {
      "id": "g8onqzu",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1602590433.0,
      "score": -12,
      "context": []
    },
    {
      "id": "g8pfqe5",
      "author": "None",
      "body": "Extremely inappropriate to be recruiting in this subreddit. Jeez.",
      "created_utc": 1602606943.0,
      "score": 5,
      "context": [
        {
          "id": "g8onqzu",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1602590433.0
        }
      ]
    }
  ]
}