{
  "id": "jbxavp",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1602799318.0,
  "title": "Request: I am weight restored but I don’t think I’m any better mentally.",
  "selftext": "Today I reached the goal weight my doctor set for me for 6 months ago. The way everyone talks to me about it is like, “now you see you have nothing to be afraid of” but that’s not the case. I am still terrified of my body and it getting bigger. I feel like all of this weight makes me look like a man, and I want so desperately to restore my weight to what it was 6 months ago. The thoughts related to anorexia continue so frequently in my head, and I don’t think this is a sign of progress. It kind of feels like I’ve just been binging for half a year rather than helping my brain get better. The worst part is: my doctor responded to these concerns by suggesting that the best solution might be more weight gain. Is she right? What should I do? I am sorry I just don’t have a person other than my doctor to discuss this stuff with.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jbxavp/request_i_am_weight_restored_but_i_dont_think_im/",
  "score": 70,
  "num_comments": 8,
  "comments": [
    {
      "id": "g8y2hmh",
      "author": "fakeplasticturnips",
      "body": "You’ve healed your body now it’s time to heal the mind! It’s a 2 part process and although they’re interlinked they’re seperate battles also. I would advise you to find a psychologist you click with who specialises in EDs and start the process of changing your thoughts and healing your mind.",
      "created_utc": 1602801666.0,
      "score": 28,
      "context": []
    },
    {
      "id": "g8y3bpk",
      "author": "gummygem7",
      "body": "It’s worth mentioning that weight restoration can be the most difficult part of recovery. My doctor never told me a number goal weight or when I reached it if she had one for me. They simply had me follow my meal plan and reach the maintenance part of recovery.\n\nNow that you’re weight restored, you have to maintain. Psychiatric support (therapy & psychiatry) can help you with this.\n\nAll of the weight is what your body needs to keep itself safe right now. Please know that this weight will eventually redistribute. It feels like a lot now, but you will become more comfortable with your body. It takes time. Trust the process and trust your body. Your body will stop gaining weight when it’s ready.",
      "created_utc": 1602802125.0,
      "score": 7,
      "context": []
    },
    {
      "id": "g8ytuit",
      "author": "None",
      "body": "It wasn’t until 7 years after my weight got back within normal range that I started to let go of the fear of weight gain/ perception of being overweight when I wasn’t. So it’s a slow process. Really something I should have done was to get rid of the clothes that didn’t fit me at a healthy weight, because it just made me sad when I went to wear something that was way too small for my current body. Get rid of the things that don’t fit and replace them with pieces that compliment your new figure. Continue taking care of your body and it’ll take care of you too. I can say that I weigh probably the most I ever have (I’m at a healthy weight) and I feel the best about my appearance that I ever have. It’ll take time but you’ll get there. :)",
      "created_utc": 1602817578.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g8yhwc2",
      "author": "wdfchicka07",
      "body": "You need to uncover the root cause of fearing weight gain and your body changing. You literally have to rewire your brain in this phase so its best to have someone help you work through it. It's about uncovering beliefs and creating new ones.",
      "created_utc": 1602810404.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g8yh9zz",
      "author": "throwaway905653",
      "body": "First of all, congratulations on being weight restored. I know how hard it is to get there and you should be immensely proud of yourself for doing so.\n\nSometimes the work to be done gets even harder when you’re weight restored. Remember that it will take time for your body and your brain to heal. The fact that you are weight restored despite these thoughts is HUGE progress. \n\nIs there any way you can speak to a counsellor about any of this? I’m not sure where you’re located but I’d be happy to help you find some resources. \n\nI promise that if you persevere and continue to restore, it will get better. The doctor may be right- sometimes more weight is necessary, and overshoot can be important in AN recovery. \n\nRecovery is really freaking hard. Sometimes it really sucks, and it’s definitely not linear. BUT you can do it. It’s worth it, and I know it may not mean much coming from an internet stranger but I BELIEVE IN YOU!",
      "created_utc": 1602810044.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8xy86a",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1602799318.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g91pdlj",
      "author": "Northstar04",
      "body": "You should be proud of yourself. Many people with anorexia struggle to do what you have done. Some can't even admit that they have a problem to begin with. Give yourself MAJOR points that you A) listen to real doctors B) were able to gain weight and C) recognize that your MIND is projecting a distorted view of health, weight and beauty to you. That recognition is really important!\n\nYou now need to double down on Cognitive Behavioral Therapy to interrupt negative thought patterns and recalibrate your relationship with food, health and happiness. This includes facing your fears, which is the hardest part really, but you are doing it! You are living your fear. Next comes recogizing that your fear is IRRATIONAL and restoring rational thought and healthy behaviors. \n\nThis will take time. Think of it like ruts in the road. You have been running the wheels on a track of \"be thinner\". There are literal grooves in your brain along this track that will take time to smooth over. You have to fill in the ditch. You do that by interrupting negative thoughts and realligning your goals by thought and habit a little bit more each day. \n\nYou can do it! Others have done it. You should feel really encouraged you have come this far and take it as a kudos that you are on the RIGHT track. \n\nDo get a good psychologist. Tell friends and family you are struggling with positive body image. Throw out clothes like another poster said. Start thiking of your body as being the # that fits you now and that body is beautiful! Only watch TV and read magazines if the people portrayed reflect normal, healthy weights. Or read books instead. \n\nYou can do this.",
      "created_utc": 1602885939.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9012gz",
      "author": "brettybangsrosin",
      "body": "that's really motivational! love to hear you've healed :)",
      "created_utc": 1602855244.0,
      "score": 2,
      "context": [
        {
          "id": "g8ytuit",
          "author": "None",
          "body": "It wasn’t until 7 years after my weight got back within normal range that I started to let go of the fear of weight gain/ perception of being overweight when I wasn’t. So it’s a slow process. Really something I should have done was to get rid of the clothes that didn’t fit me at a healthy weight, because it just made me sad when I went to wear something that was way too small for my current body. Get rid of the things that don’t fit and replace them with pieces that compliment your new figure. Continue taking care of your body and it’ll take care of you too. I can say that I weigh probably the most I ever have (I’m at a healthy weight) and I feel the best about my appearance that I ever have. It’ll take time but you’ll get there. :)",
          "created_utc": 1602817578.0
        }
      ]
    }
  ]
}