{
  "id": "jc6x7i",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1602841161.0,
  "title": "Request: How to cope with putting my pet on a necessary weight-loss diet",
  "selftext": "This may be kind of an odd advice request, but I can't find any discussions about this particular scenario I'm dealing with online anywhere.\n\nI've been dealing with atypical anorexia and compulsive overeating on and off for a few years now. Recently I've been meeting remotely with a dietician to try to keep myself on track to recovery during the pandemic. It's been going fairly well.\n\nToday I took one of my cats to the vet and asked them about his size since he's been looking a little overweight compared to his brother. I've been raising him and his brother from kittenhood and they're finally getting to the age where we have to start worrying about overfeeding. The vet said he was in fact starting to get too heavy for his frame and recommended that we switch from letting the cats graze on dry food all day to having portioned, scheduled feeding.\n\nAs a lifelong obsessive cat lover and someone aspiring to a career in vet medicine, I understand full well that being overweight as a cat is far more unhealthy and dangerous than being \"overweight\" as a human. Our anatomies are not the same; we have different dietary needs. I trust that if our vet says my cat should go on a diet, then it is necessary to preserve his health, comfort, and happiness. And I am determined to do right by my cats.\n\nThis isn't a question of if I should restrict my pets' food intake, as I've already said I understand and trust our vet's professional opinion; it's a question of how I can cope with the feelings this stirs in me as a recovering eating disordered person.\n\nI have to count calories for my cats. I may have to buy a scale to monitor their weight. And I have to push through denying them food when they're vocalizing that they're hungry because they've gotten used to being able to eat whenever.\n\nAll of this is of course very distressing and puts me at risk of relapse.\n\nDoes anyone out there have any advice for me to get through this? I love my cats and I want to help them, but I'm scared of harming myself in the process.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jc6x7i/request_how_to_cope_with_putting_my_pet_on_a/",
  "score": 73,
  "num_comments": 6,
  "comments": [
    {
      "id": "g8zvu9d",
      "author": "Ambitious-Medicine",
      "body": "First of all, you clearly love your cats so much. I'm a cat lover myself and had a cat that needed to be put on a restrictive diet too. \n\nIt's hard. It's stressful. And it can feel overwhelming...\n\nHowever, I will share with you the things I did to help overcome my anxiety around it all, hopefully this helps.\n\n- Don't buy a scale - Vets will usually weigh a pet for free if you want to know the exact figure, however I just researched how a healthy cat is supposed to look, there are lots of charts and diagrams online to help know what to look for in a healthy weight cat. This was much easier for me and felt less invasive.\n\n- Use it as an excuse to spoil your fur babies! Buy new toys to help keep them active, spend more time with them, snuggle and cuddle and play. When mine whined for food I just distracted him with toys and attention... Cats can eat when they are bored like humans do, so distraction is great. Also, the best thing you can give them is your time. \n\n- Scheduled timing for food works great, they get into the routine really quickly and you'll be amazed how in tune their body clocks become. 6am and 5pm were my cats meal times and I could guarantee he would come to me about 5minutes beforehand and start telling me he was ready. \n\n- Don't track calories. If you are giving them the right amount of the right food and limiting treats then you don't need to track the calories of it all. It's actually really simple with pets because they just eat one thing and it's the same every meal. \n\n- Remember that you are helping them. They are completely dependent on you, you are doing your absolute best for them, and you are helping to elongate their lives. \n\nYou are doing amazing just by acknowledging this issue. If you need anything just pm me. Xx",
      "created_utc": 1602851908.0,
      "score": 42,
      "context": []
    },
    {
      "id": "g90i0nq",
      "author": "satanlovesjoker",
      "body": "You don’t need to buy a scale. Usually cat food bags say how much u should give for their age just buy a measuring cup. You don’t need to weigh them usually you can tell if they look pudgy but just have a follow up in a month or something with your vet and they’ll weight them. Also no need to count calories they’re cats lol",
      "created_utc": 1602864215.0,
      "score": 5,
      "context": []
    },
    {
      "id": "g92olmu",
      "author": "None",
      "body": "I haven't read the other comments but.. it will be ok. You don't need to buy a scale, if your vet is seriously concerned and you will be returning, they can weigh the cat for you. If you really think they need a scale you can purchase a pet scale like the one they use at a vet, not one for humans. You also don't have to count calories, just purchase some measuring cups and find out (maybe even from your vet) how much to feed them. My cat got a little chubby (although he is a big boy) and I just fed him twice a day with a measuring cup, if he ate it all he ate it all and had to wait until the morning. If he left it, great, have a snack for later lmao. You can tell your vet what food you are giving them and they can calculate it for you. Good luck and don't stress, it will be okay. :-)",
      "created_utc": 1602908764.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g8zk11f",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1602841161.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g90y9ay",
      "author": "None",
      "body": "I’m sorry that I don’t have any particular advice, but I can say I am in a similar boat. My cat (ESA) used to be overweight and we had to monitor her a lot to help her lose a substantial amount of weight over about a year (she went from ~18 pounds to 12 pounds). I think it’ll be harder since you have two cats, but I found that doing the math just once was helpful for me. Ie, I figured out her caloric needs with the vet, figured out how many cups of food that translated to, and then I invested in an automatic, timed feeder. That means she gets her 1/4 cup at 6am and 6pm, and I don’t have to think about it.\n\nI also have my partner weigh her, since we don’t have a pet-specific scale. So he’ll weigh himself, then weigh himself holding her, and we subtract the difference. Although he’s unhappy with his weight, he doesn’t have an ED, so it’s not distressing for him. For me, if I saw my actual weight +12 pounds, I’d have a panic attack.\n\nI hope you’re able to find something that helps you!!",
      "created_utc": 1602872349.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g90yfyy",
      "author": "None",
      "body": "Though I’m actually dealing with sort of the opposite now - she has breast cancer and either IBD or small-cell gastrointestinal lymphoma and was vomiting a lot and lost weight. She also lost her appetite. Now that we’re doing some treatment for her, she’s starting to eat again and maintain weight, and I have a REAL dissonance about it how proud I am of her when she eats her food vs how upset I get with myself when I eat. 🤡",
      "created_utc": 1602872440.0,
      "score": 1,
      "context": [
        {
          "id": "g90y9ay",
          "author": "None",
          "body": "I’m sorry that I don’t have any particular advice, but I can say I am in a similar boat. My cat (ESA) used to be overweight and we had to monitor her a lot to help her lose a substantial amount of weight over about a year (she went from ~18 pounds to 12 pounds). I think it’ll be harder since you have two cats, but I found that doing the math just once was helpful for me. Ie, I figured out her caloric needs with the vet, figured out how many cups of food that translated to, and then I invested in an automatic, timed feeder. That means she gets her 1/4 cup at 6am and 6pm, and I don’t have to think about it.\n\nI also have my partner weigh her, since we don’t have a pet-specific scale. So he’ll weigh himself, then weigh himself holding her, and we subtract the difference. Although he’s unhappy with his weight, he doesn’t have an ED, so it’s not distressing for him. For me, if I saw my actual weight +12 pounds, I’d have a panic attack.\n\nI hope you’re able to find something that helps you!!",
          "created_utc": 1602872349.0
        }
      ]
    }
  ]
}