{
  "id": "jde325",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603017066.0,
  "title": "Request: How do I tell my parents I’m starting to relapse?",
  "selftext": " \n\nHow do I tell my parents I’m starting to relapse with my ED Again without them freaking out? 22yr old female, recovered from severe anorexia for a year. My ED was really hard on my parents I’ve had plates of food thrown at me by frustrated parents. Screamed at and have had the police called all over eating. I live with my mom currently and when I was deeply entrenched in my ED my mom became depressed and said it was my fault she would threaten suicide always be crying I made her seek therapy but it didn’t help. She’s extremely pushy still about my eating habits but she’s been away the past few days and I have been really struggling; I need to be able to find a safe way to tell Her or someone",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jde325/request_how_do_i_tell_my_parents_im_starting_to/",
  "score": 77,
  "num_comments": 4,
  "comments": [
    {
      "id": "g97lkb4",
      "author": "booboobacon",
      "body": "As someone who also relapsed in my 20’s I realized my parents were NOT going to be helpful in my recovery unless I had to depend on them for something (like buying food, or health insurance). \n\nI actually told my therapist, nutritionist, and 3 best friends. They were my tribe to help me recover. I realized my mom and dad were so toxic to me and added so much extra stress that they would actually make my ed WORSE. Both my parents are narcissists. \n\nHowever, if you live at home, or depend on them for any reason (insurance or money) I would message to them that you want to see _______ doctor more frequently because your life is getting challenging and you want to make sure you don’t slip further back into your old habits. \n\nSending you love right now. This shit is so hard.",
      "created_utc": 1603021919.0,
      "score": 48,
      "context": []
    },
    {
      "id": "g97xec0",
      "author": "KDPlazed",
      "body": "I would recommend for you to consult a doctor without telling your parents. It seems that in your situation, your parents are not going to be helpful in recovering from your relapse. And it would be in your good health to consult a doctor without telling your parents. I believe there are some services where they might help you without contacting your parents. I hope you are able to recover from your relapse.",
      "created_utc": 1603028207.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g97d2u4",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603017066.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g99oslh",
      "author": "None",
      "body": "I don’t think your parents seem healthy for your recovery. I would go to professionals first.",
      "created_utc": 1603061295.0,
      "score": 1,
      "context": []
    }
  ]
}