{
  "id": "jed8bx",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603148977.0,
  "title": "Request: Discussing Disordered Eating with Foreign Exchange Student",
  "selftext": "My SO and I are hosting a foreign exchange student for the 2020-2021 school year. She is 15 and I am very concerned about her eating habits. I understand Americans eat larger portions and expected that she would eat less than we do. She's been with us 7 weeks now and I know it's been hard on her with virtual school limiting her social interactions with other teens.\n\nI've noticed that she subsists mostly off milk and fruit. I make dinner from scratch 4-6 nights a week and she will take a small portion, but does not eat lunch. I have encouraged her to go through cookbooks with me to find recipes she wants to try. We have also baked a few desserts because she loves chocolate. My SO is in hospitality, so we go to restaurant openings and events sometimes - she does appear to eat better in public than at home.\n\nYesterday a bathroom scale arrived from Amazon for her. This, coupled with the calorie deficit, has pushed me to reach out to the foreign exchange coordinator to have a discussion with her tomorrow about our concerns. I am afraid that this will trigger her to eat larger portions in front of us and then purge. \n\nHow can we have a productive conversation with her that doesn't trigger a new ED or exacerbate an existing one? I hesitate to call her parents and ask if she has done this at home or if this is a new control behavior she's developed here.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jed8bx/request_discussing_disordered_eating_with_foreign/",
  "score": 68,
  "num_comments": 13,
  "comments": [
    {
      "id": "g9dtb8c",
      "author": "MissyChevious613",
      "body": "I don't have any suggestions but I think you are doing the right thing by reaching out to the coordinator about your concerns.",
      "created_utc": 1603152207.0,
      "score": 42,
      "context": []
    },
    {
      "id": "g9e00dz",
      "author": "seatangle",
      "body": "I would recommend talking to her one on one first. If she does have an ED involving another person (especially someone who might inform her parents) is a leap too far. All you have are suspicions at this point. Many girls that age are weight conscious, it doesn’t mean they have an ED. She could also have anxiety or homesickness causing a loss of appetite. Food in the US is also really different from the rest of the world. The same basic things can taste odd to someone from another country (when I moved here after living in the UK for 4 years I was really surprised at how fake certain things tasted). I’m also a bit confused as to why you think she would purge if there’s no suggestion that she’s ever done that before. \n\nYour intentions are good but I would dial it back a little and have a discussion with her first before jumping to conclusions and involving someone new.",
      "created_utc": 1603156021.0,
      "score": 36,
      "context": []
    },
    {
      "id": "g9em8jg",
      "author": "_fidgetspinner",
      "body": "Hi there,\n\nI am a student that studied abroad a few years ago. I lived with a family as well, like your foreign exchange student. I also had very, very bad anorexia (still do, but it was so intense while I was abroad).\n\nEveryone's experience is different, but for me personally, I felt so, so bad whenever I turned down food from my host family or didn't eat a lot. I didn't want them to think I was being disrespectful or ungrateful, yet it was just so difficult to eat. I also felt really awkward, because I was trying so desperately to hide the fact that I had a problem.\n\nFor me, it was nice that my host family didn't comment on my eating habits. They did make the occasional \"you eat like a bird\" joke to me, which really bothered me, so please don't make comments to your student, as it only fuels the ED. \n\nI think it's good that you reached out to the coordinator to discuss. It wasn't until the end of my study abroad experience that a staff member finally had a conversation with me (though rumors had been circulating which made it so awkward), but at that point I was so far gone, and we were leaving in mere weeks. \n\nYou are lovely people for noticing this and being concerned. I would just be very careful with how you go about it, but also don't act like you're walking on eggshells around her, because she will sense that. \n\nAnyways, I hope this was a bit helpful.",
      "created_utc": 1603170347.0,
      "score": 14,
      "context": []
    },
    {
      "id": "g9e68s7",
      "author": "underthiscontract",
      "body": "Thank you for taking the initiatives and thinking above and beyond.  I was an exchange student/foreign student for most part of my life and my ED started during those times. Living far away from home in a foreign environment can definitely be a trigger as you are removed from what you are accustomed to in an unnatural and abrupt manner.  Thinking back to where I was and how I felt, I would say getting a conversation started and showing that people care would be the best way to approach it.",
      "created_utc": 1603159595.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g9dx4jn",
      "author": "smolcoconut",
      "body": "Why did you open her package though ? ..\n\nI can see your heart is in the right place but if I were in her position I would definitely feel you were intruding. I think you should let a third party (her own family, foreign exchange coordinator, etc) handle whatever confrontation you feel needs to happen.",
      "created_utc": 1603154379.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g9dnhye",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603148977.0,
      "score": 2,
      "context": []
    },
    {
      "id": "g9lqqem",
      "author": "throwaway-m1",
      "body": "Just one small piece of advice: if you can, definitely take her out to eat as much as possible, or do anything else that makes it easier for her to eat (maybe pay attention to how she behaves after to make sure she isn’t purging). This won’t solve her eating problems, but it will help her sustain herself.",
      "created_utc": 1603329683.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9mu5kj",
      "author": "Netakakak",
      "body": "Hi, first of all - thank you for posting this and for expressing concern. Not only are you doing an amazing thing by granting somebody the unique experience of staying with an American family but you have also chosen to explore various ways of tackling a perceived problem rather than confront the person in a potentially unexpected and uncomfortable way. As a former foreign exchange student (I even suspect the person you are hosting may be on the same exchange program as I was) and - unfortunately - somebody with disordered eating habits, I can say that there may be different sides to the situation. Being an active alumna of my exchange program, I’ve also got to be involved in work with future exchange students and therefore have witnessed and heard about some relatable experiences.\nFirst and foremost, it’s sadly true that weight gain and issues with eating behavior tend to be one of the most intimidating and frustrating aspects of the desired “American experience”. I’m referring to them as an “aspect” because in my case, it was already at the pre-departure orientation in my home country that they were named among the “bad/unpleasant things that will most likely happen”. Although the goal was to encourage us not to worry about it (and I personally did not back then), I can understand why somebody may prepare themselves for closely monitoring their weight throughout the exchange year and for paying increased attention to portion sizes / calorie intake, etc. While all that may certainly become a direct road to developing an eating disorder, it still does not necessarily mean your student has one. Not sure if you have contacted the coordinator already, but I would be a bit wary of that as typically coordinators are asked to step in when there is serious misunderstanding between you and the student (I remember doing something stupid once and even though I apologized to my host parents and we reached an agreement, all of a sudden they decided to get the coordinator involved “just in case”, which made me feel terrified as I was convinced they wanted me to be sent to a new family). From what I read, your relationship does not seem like it would cause the student discomfort at this time. I really think that if you are determined to find out what’s going on you should find a good way of talking to her yourself. As for the coordinator, however, I wonder if they ever have group meetings with the exchange students they coordinate. It might be a good idea to suggest that they bring up the topic of food-related concerns during one of those because despite the potential sensitivity of the question, a non-binding discussion in a friendly relaxing setting could be of help.\n\nFeel free to message me anytime if you need any other advice from somebody who once was in your guest’s shoes :)",
      "created_utc": 1603362102.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9dudl0",
      "author": "flavorless-soup",
      "body": "I also am not really sure about this situation, but I am glad that you were able to recognize this as something that she may be struggling with rather than dismissing it as someone else’s business. So many people let others struggle because they are so avoidant of confrontation.",
      "created_utc": 1603152813.0,
      "score": 15,
      "context": [
        {
          "id": "g9dtb8c",
          "author": "MissyChevious613",
          "body": "I don't have any suggestions but I think you are doing the right thing by reaching out to the coordinator about your concerns.",
          "created_utc": 1603152207.0
        }
      ]
    },
    {
      "id": "g9fi7jj",
      "author": "crazy-chicken-chick",
      "body": "I am legally required by the program to notify them if I have any concerns; her parents aren't notified unless it becomes a medical issue verified by a doctor - we aren't anywhere near that yet. Her coordinator is a very sweet middle school teacher who lives down the road and has been involved from her arrival. She's coming over to go over school midterm stuff anyway and I want to bring up that if she's having trouble with the food here or is worried about her weight that she can talk to us about it.\n\nI want to be prepared for an escalation; I am not necessarily expecting it.",
      "created_utc": 1603200317.0,
      "score": 10,
      "context": [
        {
          "id": "g9e00dz",
          "author": "seatangle",
          "body": "I would recommend talking to her one on one first. If she does have an ED involving another person (especially someone who might inform her parents) is a leap too far. All you have are suspicions at this point. Many girls that age are weight conscious, it doesn’t mean they have an ED. She could also have anxiety or homesickness causing a loss of appetite. Food in the US is also really different from the rest of the world. The same basic things can taste odd to someone from another country (when I moved here after living in the UK for 4 years I was really surprised at how fake certain things tasted). I’m also a bit confused as to why you think she would purge if there’s no suggestion that she’s ever done that before. \n\nYour intentions are good but I would dial it back a little and have a discussion with her first before jumping to conclusions and involving someone new.",
          "created_utc": 1603156021.0
        }
      ]
    },
    {
      "id": "g9ffmm9",
      "author": "crazy-chicken-chick",
      "body": "Very helpful to get another student's insight, thank you. \n\nI have avoided mentioning her portions and let her make up her own plate when I'm making dinner. The only time we really talk about food is if we're grabbing dinner from a drive-thru and she doesn't want anything - I'll ask if she's sure she doesn't want a milkshake or some fries, she doesn't have to get a whole meal. I have also made dishes from her home country and noted recipes that she seems to enjoy so I can make them again.\n\nI definitely don't want to trigger her or walk on eggshells, I just don't want to ignore it.",
      "created_utc": 1603198701.0,
      "score": 5,
      "context": [
        {
          "id": "g9em8jg",
          "author": "_fidgetspinner",
          "body": "Hi there,\n\nI am a student that studied abroad a few years ago. I lived with a family as well, like your foreign exchange student. I also had very, very bad anorexia (still do, but it was so intense while I was abroad).\n\nEveryone's experience is different, but for me personally, I felt so, so bad whenever I turned down food from my host family or didn't eat a lot. I didn't want them to think I was being disrespectful or ungrateful, yet it was just so difficult to eat. I also felt really awkward, because I was trying so desperately to hide the fact that I had a problem.\n\nFor me, it was nice that my host family didn't comment on my eating habits. They did make the occasional \"you eat like a bird\" joke to me, which really bothered me, so please don't make comments to your student, as it only fuels the ED. \n\nI think it's good that you reached out to the coordinator to discuss. It wasn't until the end of my study abroad experience that a staff member finally had a conversation with me (though rumors had been circulating which made it so awkward), but at that point I was so far gone, and we were leaving in mere weeks. \n\nYou are lovely people for noticing this and being concerned. I would just be very careful with how you go about it, but also don't act like you're walking on eggshells around her, because she will sense that. \n\nAnyways, I hope this was a bit helpful.",
          "created_utc": 1603170347.0
        }
      ]
    },
    {
      "id": "g9feeov",
      "author": "crazy-chicken-chick",
      "body": "I didn't open her package. She opened it in the kitchen to put the box in the recycling bin. I do not open her mail.",
      "created_utc": 1603197880.0,
      "score": 4,
      "context": [
        {
          "id": "g9dx4jn",
          "author": "smolcoconut",
          "body": "Why did you open her package though ? ..\n\nI can see your heart is in the right place but if I were in her position I would definitely feel you were intruding. I think you should let a third party (her own family, foreign exchange coordinator, etc) handle whatever confrontation you feel needs to happen.",
          "created_utc": 1603154379.0
        }
      ]
    },
    {
      "id": "g9frlqk",
      "author": "seatangle",
      "body": "Oh, I see. That’s good it’s someone familiar.",
      "created_utc": 1603205524.0,
      "score": 2,
      "context": [
        {
          "id": "g9e00dz",
          "author": "seatangle",
          "body": "I would recommend talking to her one on one first. If she does have an ED involving another person (especially someone who might inform her parents) is a leap too far. All you have are suspicions at this point. Many girls that age are weight conscious, it doesn’t mean they have an ED. She could also have anxiety or homesickness causing a loss of appetite. Food in the US is also really different from the rest of the world. The same basic things can taste odd to someone from another country (when I moved here after living in the UK for 4 years I was really surprised at how fake certain things tasted). I’m also a bit confused as to why you think she would purge if there’s no suggestion that she’s ever done that before. \n\nYour intentions are good but I would dial it back a little and have a discussion with her first before jumping to conclusions and involving someone new.",
          "created_utc": 1603156021.0
        },
        {
          "id": "g9fi7jj",
          "author": "crazy-chicken-chick",
          "body": "I am legally required by the program to notify them if I have any concerns; her parents aren't notified unless it becomes a medical issue verified by a doctor - we aren't anywhere near that yet. Her coordinator is a very sweet middle school teacher who lives down the road and has been involved from her arrival. She's coming over to go over school midterm stuff anyway and I want to bring up that if she's having trouble with the food here or is worried about her weight that she can talk to us about it.\n\nI want to be prepared for an escalation; I am not necessarily expecting it.",
          "created_utc": 1603200317.0
        }
      ]
    }
  ]
}