{
  "id": "jf1bv5",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603236560.0,
  "title": "Request: Class documentary while currently struggling with an eating disorder",
  "selftext": "I am a 23 year old college student currently taking an online developmental psych class. Right now we are on a unit of eating disorders. As a psychology major I KNOW I will have to learn about this and do the assignments. But right now the next thing due is a notes sheet on a documentary about eating disorders. Just in the first 5 minutes I couldn’t handle it and had to turn it off due to how triggering it was for me. Would it be appropriate to ask my professor for a different assignment/explain why I am mentally not well enough to do this assignment right now? Or is that too personal and I should just take the 0? It’s only 20 points so it’s not too weighted into my overall grade but I pride myself on doing my hardest to achieve good grades. I’m unsure of what to do. Any advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jf1bv5/request_class_documentary_while_currently/",
  "score": 57,
  "num_comments": 10,
  "comments": [
    {
      "id": "g9hn3kh",
      "author": "Just-strangers",
      "body": "I would talk to the Professor. As someone recovering from an ED, I can totally understand how triggering this would be. Hopefully they will understand the circumstances and be able to assign you something different.",
      "created_utc": 1603237601.0,
      "score": 44,
      "context": []
    },
    {
      "id": "g9hnni5",
      "author": "DragonflyStunning",
      "body": "honestly this is a tough situation bc i totally understand how hard it is but at the same time you’re right it is a psych class and eating disorders are expected to be talked about. \n\nif i was in your position i would talk to the professor about it and explain how you’re working towards recovery (and if you’re not you NEED to be especially if you’re going into psych!) but that right now the documentary is too much for you. tell them you understand that this is a requirement but if there are any alternative assignments available you’d rather do one of those. or maybe suggest reading an article on ed’s and writing a note sheet on that or a shorter video that’s not as descriptive (if you’re able to handle that). if not you might have to take the 0. i’m sorry you’re in this position sending love 💕",
      "created_utc": 1603237920.0,
      "score": 16,
      "context": []
    },
    {
      "id": "g9hscse",
      "author": "Various-List",
      "body": "If you can manage it, yeah. You’re in recovery and this is too graphic for you at this point in time. Can you do an alternative assignment that is just reading/writing based.",
      "created_utc": 1603240574.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g9hlard",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603236561.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9ib99u",
      "author": "taylorjones10",
      "body": "I would definitely talk to your professor about it and tell them you’re not mentally able to watch the documentary for the time being. As a psychology professor they should likely be accepting and understanding of this.",
      "created_utc": 1603251969.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9jcseb",
      "author": "wat-potato",
      "body": "I faced a similar thing with a mental health unit I had to take that had a lot of content surrounding eating disorders. Before we got onto the topic my tutor explained that if any content was distressing/triggering etc to contact her to arrange an alternative way to learn the content. She worked with me throughout the semester for the topics and supported me with the option to research a different topic for the same assessment task so maybe try contacting your professor to see what they can do! \nnot sure if this may help but personally for me I found that a lot of the videos were triggering for me however reading the information on a screen and reading research studies etc was a lot easier to absorb the content! best of luck and I send my love xx",
      "created_utc": 1603285980.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9jykxi",
      "author": "mckatli",
      "body": "When I took weight training in college one of the assignments was to do a diet/calorie tracker for two weeks. Obviously, I did not think that would be the healthiest choice for me. I emailed the instructor and she was super understanding and just gave me an alternate assignment to do. Def talk to your prof if you feel comfortable- eating disorders are really widespread on college campuses so it likely won't be the first time they've gotten this request.",
      "created_utc": 1603297363.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9hntun",
      "author": "nocreativeusernames",
      "body": "i second this. they're a psychology prof; they should understand how bad triggers can be for a person's health",
      "created_utc": 1603238018.0,
      "score": 23,
      "context": [
        {
          "id": "g9hn3kh",
          "author": "Just-strangers",
          "body": "I would talk to the Professor. As someone recovering from an ED, I can totally understand how triggering this would be. Hopefully they will understand the circumstances and be able to assign you something different.",
          "created_utc": 1603237601.0
        }
      ]
    },
    {
      "id": "g9hzh8i",
      "author": "ANGLEDHOURGLASS",
      "body": "Please talk to them!",
      "created_utc": 1603244657.0,
      "score": 3,
      "context": [
        {
          "id": "g9hn3kh",
          "author": "Just-strangers",
          "body": "I would talk to the Professor. As someone recovering from an ED, I can totally understand how triggering this would be. Hopefully they will understand the circumstances and be able to assign you something different.",
          "created_utc": 1603237601.0
        }
      ]
    },
    {
      "id": "g9hocl8",
      "author": "bpurly",
      "body": "I do think most professors would be understanding and would not give OP a 0. Definitely talk to your professor and hopefully you guys  can come to a mutual understanding. It's not too personal (as long as you are comfortable confiding in them) and they should be accomodating.",
      "created_utc": 1603238317.0,
      "score": 4,
      "context": [
        {
          "id": "g9hnni5",
          "author": "DragonflyStunning",
          "body": "honestly this is a tough situation bc i totally understand how hard it is but at the same time you’re right it is a psych class and eating disorders are expected to be talked about. \n\nif i was in your position i would talk to the professor about it and explain how you’re working towards recovery (and if you’re not you NEED to be especially if you’re going into psych!) but that right now the documentary is too much for you. tell them you understand that this is a requirement but if there are any alternative assignments available you’d rather do one of those. or maybe suggest reading an article on ed’s and writing a note sheet on that or a shorter video that’s not as descriptive (if you’re able to handle that). if not you might have to take the 0. i’m sorry you’re in this position sending love 💕",
          "created_utc": 1603237920.0
        }
      ]
    }
  ]
}