{
  "id": "jfcbdy",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603285185.0,
  "title": "Request: Having an ED and living with roommates",
  "selftext": "I have had anorexia with bulimic tendencies for a almost two years now. It started after I gained weight my freshman year of college, which I didn’t even notice, until my ex’s friend accidentally sent a message to me talking about how much larger I look. That summer after freshman year I started the keto diet, this was kind of restrictive but I don’t believe my disordered eating started until I went back to school. When I realized I couldn’t keep up with only having x amount of carbs a day on keto, \n I decided to switch to a traditional diet: caloric deficit. I re downloaded my calorie counting app that I got when I was 12 (think I had a brush with an ED then) and started religiously tracking everything I ate, and I haven’t stopped since. I was and am obsessed with calories, I would heavily restrict or try to go days at a time without food when I went “over” in calories, then those punishments led to horrible binge eating episodes followed by purging. I’m in a much different place now than I was a year ago, I would say a year ago I was at my lowest with my ED, and I have since been going to therapy weekly but i still actively have anorexia. A big component of my ED is secrecy, I know this is common from this thread so thank you for showing me I’m not alone, and it wasn’t until last week that I finally told someone what has been happening. I was high having a really deep conversation with my boyfriend and I just felt a sudden urge to blurt it out, he wasn’t shocked of course but offered his support and a shoulder to lean on. I felt obligated to then tell my two best friends, 1 I live with, the other I do not. The friend I live with is one of the most kind, thoughtful, helpful, compassionate, and generous people I know. She’s truly amazing, and when I told her about my ED she said she will love me enough for the both of us, I couldn’t ask for better support. But in her efforts to help me, with only the absolute best intentions, she has now been calling attention to what I eat frequently and in front of others. I know she just wants me to be healthy and happy, but I don’t know how to tell her that bringing attention to what I eat makes me want to hide in my room and not give food a second thought.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jfcbdy/request_having_an_ed_and_living_with_roommates/",
  "score": 64,
  "num_comments": 5,
  "comments": [
    {
      "id": "g9kcxi1",
      "author": "stevieisbored",
      "body": "I would tell her how much you appreciate the support first, then say that it makes you uncomfortable when she comments on your food in front of others. \nOne thing my partner does for me that I think is helpful is that, instead of commenting on my food amounts, he’ll say stuff like “Oooh, that would taste amazing if you added x,y,z to it.” And a lot of the times I end up eating a healthier amount without realizing it because he talks about adding flavor instead of calories. It tricks my brain.",
      "created_utc": 1603304193.0,
      "score": 19,
      "context": []
    },
    {
      "id": "g9kp363",
      "author": "enord11400",
      "body": "Some people really really want to help. I had a partner who acted similarly right after I got out of treatment on two occasions (although I did not live with her) and sometimes it felt helpful but ultimately another person (who is not a part of your treatment team) can not assume responsibility for your eating or mental health in general because it will hurt both of you eventually. \nSecrecy was a major part of my ED as well and having another person watching me only made my symptoms worse because my ED saw it as an added challenge. I think it’s important for the people around you to know what’s happening because EDs thrive on secrecy and isolation, but also for those people to know that it is not their fight. Just as much as you could not take another person’s drivers test for them, they can not do this for you no matter how badly they want to. You need to tell her this since she might have taken you telling her what was going on as you asking for her help and she thinks she is helping.  \n\nTry to tell your friend why you decided to let her know what was going on with you, so she knows what you are expecting of her. (She probably isn’t thinking of it like that, but it could help.) I hope you can convince her to back off a bit.",
      "created_utc": 1603309987.0,
      "score": 8,
      "context": []
    },
    {
      "id": "g9l0vi9",
      "author": "bpurly",
      "body": "I just wanted to say this is the exact same as my story. I developed an ED after I gained weight freshman year of college and tried to diet that next summer to lose the freshman 15 but my disordered eating really started and spiraled into an ED sophomore fall. I'm now a senior and I'm in recovery (I would say I'm 90% recovered). OP if you want to talk to someone who understands please message me!",
      "created_utc": 1603315724.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g9jbiuc",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603285185.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9ledrw",
      "author": "c8lopez",
      "body": "agreed! let her know how appreciative you are, then set some boundaries. for me, recovering from bulimia, i HATE input. im the only one who knows my body, thank you. the only person i take it from is my sister, who every now and then if she notices me comfort/binge eating, asks unassuming questions like \"are you enjoying what you eat?\" or \"are you comfort eating?\". my sister also only talks about food in terms of flavor, like what their\\^ partner does. that's helped me get in the mindset of intuitive eating a lot more. learning my body's cues & wants is weirdly fun(: on another note, I hate IG but my one exception is the account @/thebodylovesociety. they make helpful infographics & mindset switches that focus on undieting. Good luck with your roommates! secrecy was a big struggle for me and still is sometimes. it's like it would never occur to me to articulate the disordered thoughts as they're happening, and if it did, then i'd be too ashamed to. that's fatphobia for ya. being open is freeing. that's so awesome you've been able to tell your close ones!",
      "created_utc": 1603322580.0,
      "score": 3,
      "context": [
        {
          "id": "g9kcxi1",
          "author": "stevieisbored",
          "body": "I would tell her how much you appreciate the support first, then say that it makes you uncomfortable when she comments on your food in front of others. \nOne thing my partner does for me that I think is helpful is that, instead of commenting on my food amounts, he’ll say stuff like “Oooh, that would taste amazing if you added x,y,z to it.” And a lot of the times I end up eating a healthier amount without realizing it because he talks about adding flavor instead of calories. It tricks my brain.",
          "created_utc": 1603304193.0
        }
      ]
    }
  ]
}