{
  "id": "jg0soq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603377410.0,
  "title": "Request: how did you get back to eating normal sizes and not feeling guilty? How do you know the limit?",
  "selftext": "Hi guys, 17f. Ive been struggling with this since i was about 11. It got really bad for a couple of years, then i started recovery at around 14. The past 3 years have been hard but worth it; im eating 3 meals, i dont have mood swings, im not tired all the time.\n\nThis past year has been the peak. But Im starting to get antsy again. My mom tells me how ive got to stop eating so much, and i have been eating more than normal, but what is \"normal\"? Should i have snacks between two meals every day? How much is too much?\n\nI had to go up a pants size for the first time in years. I know its because im eating regularly and thats a good thing, but i cant even fit into my old pants anymore.\n\nTy <3",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jg0soq/request_how_did_you_get_back_to_eating_normal/",
  "score": 57,
  "num_comments": 13,
  "comments": [
    {
      "id": "g9nm7kz",
      "author": "rachel_chxn",
      "body": "I find it awful how your mom is telling you to eat less. There is no \"normal\" so just do what works for you. If you feel that your meals are satisfying and leave you feeling good, then you dont have to change anything.",
      "created_utc": 1603380570.0,
      "score": 28,
      "context": []
    },
    {
      "id": "g9npltt",
      "author": "bpurly",
      "body": "Now that I'm recovered I don't need to place a limit on myself. I know the limit because I get full and then I stop eating. My body lets me know when I should stop eating. But, if you've been restricting for a long time your hunger signals are probably off. I'm sorry your mom is telling you this but she's wrong-- we often need to go through a period of \"overfeeding\" to get our hunger signals back and be able to intuitively eat.",
      "created_utc": 1603382244.0,
      "score": 17,
      "context": []
    },
    {
      "id": "g9oltkw",
      "author": "candy_irl",
      "body": "1-is common to eat more than \"normal\" on the first stages of recovery, your body is compensating for all the years of abuse, so dont worry too much about it. Try to drink enough water and eat until youre full (look up intuitive eating!). At first is difficult but with time your sense of fullness will adjust, be patient, conscious and keep working on it.\n\n2- My family does the same exact thing and it sucks, it triggers me a lot and it makes me feel shameful and disgusting. Heres how i cope with it: conversation. Most of the times they dont do it to harm my feelings and is the result of conservative/outdated mentality. I try to calmly explain to them that My eating is not their problem because it's still healthy, that i dont need to explain it, and that it hurts my feelings. If you are brave enough consider \"coming out\" to your family about your struggles. Lastly, if talking doesnt work, just straight up ignore them and keep in mind they dont understand the full context of your eating habits.\n\n3- weight gain is expected ofc but its great that you know its a good thing. When trying on new clothes try to make the whole plan something fun, try buying new clothes with Friends, go to places where you know youll have plenty size variety. Also, most weight gain happens on the first year of recovery, then itll mostly stay stable if You don't have any issues. It may be hard now and seem excessive but if You look at it from a greater spectrum it's probably not that much. \n\nLastly: stop weighting if You do \n\n(Edit: typos >:( )",
      "created_utc": 1603396914.0,
      "score": 4,
      "context": []
    },
    {
      "id": "g9oho14",
      "author": "bootydamage420",
      "body": "I really admire your strength and commitment. What really helped me is starting with healthy snacks! There might be some residual guilt, but at least that will help until you start gaining the trust back with your body so you can enjoy all the yummy foods you like. Trust your body, not your mom's opinion. Some days I eat two huge meals and some days I just munch all day and once I started trusting my body, my weight was healthy and stayed that way, so I stopped worrying about \"losing control\" of eating and constantly fearing that I was going to turn into some binge-monster. Best of luck <3",
      "created_utc": 1603395187.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g9nfwcf",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603377410.0,
      "score": 0,
      "context": []
    },
    {
      "id": "g9oq2hm",
      "author": "Mgmender",
      "body": "My therapist tell me three  macro-meals a day plus three snacks but to eat when your body is hungry. I’m still trying to teach myself intuitive eating and how to listen and give my hunger/body what it needs. (Macro-meal protein, carbohydrates and fats).",
      "created_utc": 1603398683.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9orlld",
      "author": "Northstar04",
      "body": "Have you told your mom you have an eating disorder? That would be a good first step to getting the support you need for healthy body positivity. To know how much you should be eating, we would need to know your height, weight, and activity level.",
      "created_utc": 1603399352.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9p4wkw",
      "author": "Sorxleva",
      "body": "I wish you the best of luck, I have the opposite problem, I eat very very small meals and have rapidly lost weight. \nI’m underweight for my height and have been trying to get to eat “normal” sizes as well but it’s a struggle.\nIt’s been taking me months to try and gain weight, I’d say start off small? Just start decreasing meals bit by bit (but not too much!) look at calorie in take? And what’s “normal” for your height. \nBut either way you’re rocking it 👍👍",
      "created_utc": 1603405423.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9pyfdx",
      "author": "wdfchicka07",
      "body": "Eat what feels good for you. I'm sorry you have to go through that with your mom. If I were you I would have a conversation with her. Thats just not ok. There is no normal. Eat when you're hungry and what you're hungry for. Your body is meant to change and thats ok. You shouldn't feel guilty for eating.",
      "created_utc": 1603421109.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9zrvb4",
      "author": "Daddy_maddy_",
      "body": "Hey guys, im the op. Ty for all the nice comments. \n\nHearing that i will need a couple years of eating regularly for my weight to stabilize makes me feel at ease. Checked my weight today (i dont often, i dont even have one at my house), and its 135. Highest its ever been, but this is also the happiest/healthiest ive ever been. This is good!\n\nTo help me find out what is normal for me, lll be paying attention to when im hungry and when im not (i am currently hungry, so it is donut time). Also, to help myself feel more healthy, i am going to do dance work out vids to combine fun + health! Booya!\n\nAgain, ty guys for commenting. I really didnt expect anyone to reply! If anyone else has any tips or advice, id love to hear it <3",
      "created_utc": 1603593385.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9nzpiw",
      "author": "durrityo",
      "body": "I agree You should eat because your body needs it, if you feel hungry you should eat, just eat what you need. A little hungry In between classes eat a little, very hungry after riding bikes with friends for a while eat a meal. Talking to a dietitian is also good, they can help you figure out how much to eat and adjust portions based on your bodies functions.",
      "created_utc": 1603387120.0,
      "score": 7,
      "context": [
        {
          "id": "g9nm7kz",
          "author": "rachel_chxn",
          "body": "I find it awful how your mom is telling you to eat less. There is no \"normal\" so just do what works for you. If you feel that your meals are satisfying and leave you feeling good, then you dont have to change anything.",
          "created_utc": 1603380570.0
        }
      ]
    },
    {
      "id": "g9pyia0",
      "author": "wdfchicka07",
      "body": "Totally agree!",
      "created_utc": 1603421152.0,
      "score": 2,
      "context": [
        {
          "id": "g9npltt",
          "author": "bpurly",
          "body": "Now that I'm recovered I don't need to place a limit on myself. I know the limit because I get full and then I stop eating. My body lets me know when I should stop eating. But, if you've been restricting for a long time your hunger signals are probably off. I'm sorry your mom is telling you this but she's wrong-- we often need to go through a period of \"overfeeding\" to get our hunger signals back and be able to intuitively eat.",
          "created_utc": 1603382244.0
        }
      ]
    },
    {
      "id": "ga5e7s8",
      "author": "Clear-Scene",
      "body": "I'm glad you're feeling good but please don't weight yourself, it can be very triggering for some people!!\n\nGood job having such a positive mindset about this! I'm so happy you're happy and healthy and staying that way :) I hope you're proud of yourself, because I know I am\n\nI love the dance workout idea. Doing things with my body has helped me learn to love it, and it helps keep your mood and energy levels up. Dancing sounds like the perfect way to do that!",
      "created_utc": 1603700971.0,
      "score": 1,
      "context": [
        {
          "id": "g9zrvb4",
          "author": "Daddy_maddy_",
          "body": "Hey guys, im the op. Ty for all the nice comments. \n\nHearing that i will need a couple years of eating regularly for my weight to stabilize makes me feel at ease. Checked my weight today (i dont often, i dont even have one at my house), and its 135. Highest its ever been, but this is also the happiest/healthiest ive ever been. This is good!\n\nTo help me find out what is normal for me, lll be paying attention to when im hungry and when im not (i am currently hungry, so it is donut time). Also, to help myself feel more healthy, i am going to do dance work out vids to combine fun + health! Booya!\n\nAgain, ty guys for commenting. I really didnt expect anyone to reply! If anyone else has any tips or advice, id love to hear it <3",
          "created_utc": 1603593385.0
        }
      ]
    }
  ]
}