{
  "id": "jh6fki",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603533726.0,
  "title": "Request: My parents incite me to binge by offering me food. How do you recover in such environment?",
  "selftext": "I'm tired of telling them, yelling, crying, they always do it again. I don't have enough willpower to stop EDing on my own, lest with an environment like this. \n\nThey say I'm meager while in a healthy BMI, and they're obese. They let me buy anything with their money though I insisted many times to limit me. I asked for a budget deposited on my account so I would have to work on it, but I'm just getting richer while they just give me their credit card anytime, even when I don't ask. They go out of their way to buy me cakes and chips, without me having to lift a finger. They ask me everyday if I have enough to eat for the evening, and cook and insane amount of food as \"leftover\" that they would have to throw in the trash if i was able to contain myself.\n\nI can't find a psych, not only because of covid, but because of my autism, they keep telling me they can't help and redirect me to an org that told me they can't help.\n\nI'm defeated. I've been struggling for 10 years. I'm going to lose it. I had tests done and I have scars inside of me, they know, they don't care.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jh6fki/request_my_parents_incite_me_to_binge_by_offering/",
  "score": 48,
  "num_comments": 10,
  "comments": [
    {
      "id": "g9x9wil",
      "author": "JustHereForBoobs96",
      "body": "I'm not sure if it helps but I was on the flip side. My mom promoted diets and starving. She'd restrict an unhealthy amount and couldn't figure out why I wasn't losing more weight because to her I was fat. \n\nI would suggest maybe talking to a dietician. They can help with your parents as well and certain banks you can set limits on your cards so maybe that would help? I'm really sorry your parents are enabling you and don't want you to get better.",
      "created_utc": 1603556107.0,
      "score": 13,
      "context": []
    },
    {
      "id": "g9xlcpv",
      "author": "None",
      "body": "Unfortunately, it looks like you can’t rely on your family to control your ED for you. They have shown you unequivocally that they do not/will not help. This means that you have to do the hard job of parenting yourself. While they have given you the option of unlimited access to food, it’s up to you to remove yourself from temptation. Ignore the excess food. Don’t accept food pushing. Gently tell your family you’re not eating anymore once you are comfortably full. Walk away if you have to. As long as you *are* eating enough to be healthy you’ll be okay.\n\nBelieve me, I understand that this is not easy; I’m a binger myself. But I’ve been fighting it for a while now and as useless as it might seem to say so, just saying “no” is really the only thing that works. You can’t binge if you don’t put food in your mouth. Eat for health, not as a hobby. Do not let yourself linger next to binge triggers. It sucks, it’s hard as hell, but you’re the only one that can help yourself. Good luck.",
      "created_utc": 1603561874.0,
      "score": 9,
      "context": []
    },
    {
      "id": "g9y4bao",
      "author": "None",
      "body": "That really sucks. I’m sorry they are not respecting your requests or you\n\nI also have autism and I have had no issues getting ED treatment at my local ED treatment center. I don’t understand why they wouldn’t help just because you are autistic? That’s fuck up\n\nI will say tho that my therapist I see through the program is not very knowledgeable or helpful for my autism so I occasionally see my normal therapist when I need help with non-ED stuff\n\nCan you look into treatment options outside of your city? Because a lot of programs are online for the foreseeable future so even if the office is far away you might still be able to join (tho you probably aren’t allowed to go out of state because of telehealth laws)\n\nIt really sounds like treatment is important for you and my main advice is just keep pushing even tho it hurts and it sucks. Keep contacting doctors and keep reminding your parents. You might be able to frustrate them so much by talking about it all the time that they will help you find treatment (idk your parents tho, so take treat with a grain of salt)\n\nEdit: another thought I just had for the meanwhile until you can get treatment is to try to enforce your own limits. Something I often do is if I know I will binge on something, I cover it in ungodly amounts of salt or pepper or whatever so I won’t want to eat it. \n\nOr you might be able to throw food away when they aren’t looking and act like you ate it.\n\n(Don’t do this if you struggle with restricting tho because it can become a slippery slope that just ends in more binges)\n\n\nWhen it comes to money, my best suggestion is when you are going to the store or other food place, carry only what cash you need and leave your card at home. Then you don’t have the option to buy tons of binge foods",
      "created_utc": 1603571428.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g9vxpmq",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603533727.0,
      "score": 0,
      "context": []
    },
    {
      "id": "g9xgux3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1603559572.0,
      "score": -4,
      "context": []
    },
    {
      "id": "g9ygg25",
      "author": "wdfchicka07",
      "body": "Personally I don't think they are doing it to be harmful. A lot of people would be lucky to have parents to do those things for them. You don't have to accept food or money. Be mindful when you eat and walk away when you've had enough. Binging is usually emotionally driven. A therapist would help and there are a lot of online resources. Even noticing your emotions when you eat and journaling it out would be helpful. Keep a food and mood journal to see what emotions you are experiencing when you binge versus when you eat until satisfied.",
      "created_utc": 1603576003.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9yo2c7",
      "author": "None",
      "body": "I’m bulimic and this is my dream my parents starve me",
      "created_utc": 1603578644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9z5gom",
      "author": "Donutsdope",
      "body": "Loved ones often use feeding as it's the only tool they have at their disposal to help. There are providers other than psychologists that could help. I got help from a counsellor who specialised in ED as I couldn't afford a psych. Finding the person who fits with your needs can take time. It sounds like you have the funds - try broadening the pool of people of professionals you're looking at. Good luck - you're showing amazing strength in trying to get help!",
      "created_utc": 1603584917.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9z9432",
      "author": "None",
      "body": "I will share my two cents. so, I struggle with food too. my mom especially is also enabling me. the only thing that ever worked for me back then was when I was literally eating my own food.\n\nI don't have the money to do so to my liking but you sound like you would be able to. \n\nI know this is very hard and challenging and although I can relate, each of ours experiences are different.. \n\nbut if I were in your place I would ask them to let me have a part of fridge or just store the food in my room (if the fridge isn't an option and if you have a shop close by you can just walk there for stuff that has to me refrigerated when you wanna eat it.. obviously these days it's hard with covid and everyone should stay inside but hopefull this will soon be over.. and a walk like that would help you get your mind off of food and being outside is generally beneficial and walking is a nice light exercise) and just with the money you have available.. you can buy good nutritious food that will satisfy you and maybe you can find some healthier alternatives to your binge foods. for example I love fried seaweed and eat it instead of chips.. and so on. with the money you can buy avocados or mangos or other expensive products that I personally can't afford but would love to buy and know it would help my binging and maybe it could help you too. cooking is also great at keeping you occupied and this way you could probably get the best of what you are provided right now. there are tons of healthy recipes and if you have higher budget you can try a lot of new stuff.. you can make smoothies or just whatever you would enjoy.\n\nas others have suggested, ed specialized dietician is also a good idea. \n\nI wish you the best luck, hopefully you will find your solution",
      "created_utc": 1603586277.0,
      "score": 1,
      "context": []
    },
    {
      "id": "g9xmcys",
      "author": "capnage",
      "body": "With this being said, make sure to find a dietician that understands ED issues. Some dieticians still hold negative diet culture beliefs that are not beneficial to recovery",
      "created_utc": 1603562399.0,
      "score": 7,
      "context": [
        {
          "id": "g9x9wil",
          "author": "JustHereForBoobs96",
          "body": "I'm not sure if it helps but I was on the flip side. My mom promoted diets and starving. She'd restrict an unhealthy amount and couldn't figure out why I wasn't losing more weight because to her I was fat. \n\nI would suggest maybe talking to a dietician. They can help with your parents as well and certain banks you can set limits on your cards so maybe that would help? I'm really sorry your parents are enabling you and don't want you to get better.",
          "created_utc": 1603556107.0
        }
      ]
    },
    {
      "id": "g9z9dd0",
      "author": "None",
      "body": "great advice. what are you even doing here with this attitude",
      "created_utc": 1603586380.0,
      "score": 1,
      "context": [
        {
          "id": "g9xgux3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1603559572.0
        }
      ]
    }
  ]
}