{
  "id": "jhlc6v",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603591036.0,
  "title": "Request: How can I find Binge Eating Support (NOT oa)?",
  "selftext": "Hi, I'm a man in his 30s looking for support with binge eating. I've tried OA support groups - they have many online Zoom meetings focused on men. But their approach is too black & white for me. I found the same with AA when I went there. I'm now 2+ years alcohol-free, but many of the same triggers which would induce drinking now just transferred to foods.\n\nAlmost all of the time I eat nutritiously. I don't track my food because it gets into \"unhealthy obsession\" territory. That's where OA fails me - any sponsor wants me to commit unwaiveringly to a strict portion-controlled plan, to the point of obsession. Then they say, \"Well are you committed to the plan or ARE YOU NOT?\" with this judgmental tone. (If you've had a good experience with OA or a 12-step program, I don't mean to diminish that. This is just what my experience has been.) Aside from that, I don't believe addiction is a disease or that the brain chemistry of alcoholics or compulsive eaters is hopelessly unchangeable and fundamentally different than \"normal\" people.\n\nI do habitually eat whole, unprocessed, nutritious foods, mostly plant-based, and this serves me well nearly all of the time. I've already, slowly over the course of many years, developed long-term nutrition habits which work for me. I've even worked on mindfully noticing and honoring my hunger and fullness cues.\n\nIt's just the binges which are an issue, and the problem for me is emotional. It's those times when I feel anxious or out of control or frustrated or angry or overwhelmed or upset or hopeless. That's when I'd go out and buy a bunch of food that I wouldn't usually eat - processed, frozen, fast food, calorie-dense stuff. I know that it's an adaptive (maladaptive) coping mechanism to deal with unpleasant emotions. But I don't have it under control yet, and I feel like I'm alone in this battle.\n\nIs there somewhere I can find some kind of sponsor-like support for this? Like someone to call when I'm feeling like I'm going to binge to talk me down off the ledge? Very few friends or family know about my binge eating. None of my guy friends do.\n\nI just started seeing a new therapist and working through complex PTSD which came about as a response to childhood trauma. The binge eating certainly is a part of that, but it's not our focus in therapy, and I can't just call up my therapist any time I'm feeling like I need support.\n\nAny suggestions or advice is appreciated. Thanks.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jhlc6v/request_how_can_i_find_binge_eating_support_not_oa/",
  "score": 46,
  "num_comments": 9,
  "comments": [
    {
      "id": "ga030cm",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1603597586.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ga0fec8",
      "author": "PiccoloOk3054",
      "body": "Have you read Brain Over Binge?",
      "created_utc": 1603602866.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ga26qvy",
      "author": "invisiblepourlesyeux",
      "body": "Aaron Flores offers a men’s group that might be helpful: https://www.bvmrd.com/groups\n\nCenter for Discovery has a BED specific online group: https://centerfordiscovery.com/groups/ (scroll towards the bottom)\n\nANAD’s Communities of Healing program: https://anad.org/communities-of-healing/",
      "created_utc": 1603636181.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ga0mvug",
      "author": "tymopa",
      "body": "I would look into NEDA and call their help line. I understand where you are coming from: https://www.nationaleatingdisorders.org/ Best of luck to you!",
      "created_utc": 1603606360.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ga2qbem",
      "author": "higherthanheels",
      "body": "I have had success with my BED through DBT, or dialectical behavioral therapy. It was originally developed for folks with Borderline Personality Disorder but it's used for ED treatment too. DBT is aimed at addressing emotional dysregulation, damaging impulsive behaviors, and many issues that BED folks encounter. Your therapy program sounds like it might share some commonalities - you mention maladaptive behaviors which was a key factor in my program's strategy for addressing binges. The programs consist of multi week group class paired with individual therapy. I found the combo to be super effective for me - group kept me accountable, and then my individual therapy let me dig more deeply into what I was learning. You should be able to google DBT programs in your area. Lmk if you have any questions.",
      "created_utc": 1603646593.0,
      "score": 3,
      "context": []
    },
    {
      "id": "g9zllzl",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603591036.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ga20v4p",
      "author": "No_Area_9175",
      "body": "Thanks for the suggestion. I just looked them up, and there aren't any chapters in my area.",
      "created_utc": 1603633293.0,
      "score": 2,
      "context": [
        {
          "id": "ga030cm",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1603597586.0
        }
      ]
    },
    {
      "id": "ga22a3o",
      "author": "No_Area_9175",
      "body": "No, I haven't. Did you read it, and was it helpful for you? If so, can you give a specific account of your experience?\n\nI'm reading mixed reviews of it on Amazon and am not sure it is for me.",
      "created_utc": 1603634082.0,
      "score": 2,
      "context": [
        {
          "id": "ga0fec8",
          "author": "PiccoloOk3054",
          "body": "Have you read Brain Over Binge?",
          "created_utc": 1603602866.0
        }
      ]
    },
    {
      "id": "ga241ve",
      "author": "No_Area_9175",
      "body": "Thank you. There seem to be a lot of resources here.",
      "created_utc": 1603634940.0,
      "score": 1,
      "context": [
        {
          "id": "ga0mvug",
          "author": "tymopa",
          "body": "I would look into NEDA and call their help line. I understand where you are coming from: https://www.nationaleatingdisorders.org/ Best of luck to you!",
          "created_utc": 1603606360.0
        }
      ]
    },
    {
      "id": "ga23tlu",
      "author": "PiccoloOk3054",
      "body": "I starting reading it and I had put it on the back burner while I was studying for my licensure exam... It was a really different approach from other books I had read like Overcoming Binge Eating by Christopher Fairburn. The approach aligned with your experience that OA groups didn’t feel right and treated binge eating as side effect from defective mind that would always be broken and couldn’t be fixed. The whole idea of this book is that your mind can be healed and you can be totally free of binge eating. I think it is worth the read to understand the research the author includes to support that addiction comes from your primitive brain and your high brain can be used to combat the impulses from the primitive brain. The majority of the research she provides lines up with things I’ve observed with my experiences as a healthcare worker and the basic research I’ve made. Of course you have to analyze everything and make sure you’re comfortable with the information you get from any source and its worth doing some research of your own. Based on your experiences described above I think this approach could really resonate with you.",
      "created_utc": 1603634827.0,
      "score": 4,
      "context": [
        {
          "id": "ga0fec8",
          "author": "PiccoloOk3054",
          "body": "Have you read Brain Over Binge?",
          "created_utc": 1603602866.0
        },
        {
          "id": "ga22a3o",
          "author": "No_Area_9175",
          "body": "No, I haven't. Did you read it, and was it helpful for you? If so, can you give a specific account of your experience?\n\nI'm reading mixed reviews of it on Amazon and am not sure it is for me.",
          "created_utc": 1603634082.0
        }
      ]
    }
  ]
}