{
  "id": "ji2qxg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603665281.0,
  "title": "Request: Do I really have a problem?",
  "selftext": "I've been overweight for nearly my whole life, but I've always had a not-so-great relationship with food. \n\nAt the end of last year, I began taking a new antidepressant, and it suppressed my appetite for two or three weeks. I believe this is when it began to get worse. I ate normally after those weeks passed, but the negative self-talk got worse than it ever has been, as if my brain were saying \"you stopped eating before, don't go back.\"\n\nThen, in January, my partner was diagnosed with cancer, and almost died from a pulmonary embolism. It looks like they're going to be okay now, but from January to around August, that wasn't so sure. On top of that, I've been going to therapy and, while it has helped with some things, it's also painful - I'm bringing up things I've never talked about before and realizing just how badly I've been treated in the past. On top of that, college has been extremely difficult, unrewarding, and unsatisfying. And then there's the pandemic, and everything else. Everything just felt hopeless and, to an extent, still feels hopeless and out of control.\n\nIn March is when I really began to restrict, and since June it's been particularly bad. If I eat over my self-imposed calorie limit, I feel incredibly anxious and panicky. If my partner brings home any cakes or take out, or any outside food, or cooks for me, I want to cry because I know they expect me to eat it, and that they're just being sweet, despite not having to at all - so I eat it, and I hate myself for it, and I hate myself for hating myself. My partner regularly comments on how little I eat, \"like a bird\". I tell them I'm fine, just not so hungry today, but it always strikes fear in me that they're gonna figure it out eventually.\n\nI count calories obsessively, weigh myself everyday, and I've lost a significant amount of weight since January (still overweight, though, so no one seems to notice, besides my partner.)\n\nI feel tired all the time, I get shaky, it's hard to concentrate, especially on school. I'm constantly thinking about food and planning out my meals and trying to make sure I count every single little thing. I'm always anxious to eat around others, and I've been noticing bruises on my legs where I've bumped into things that, before, never gave me bruises. I enjoy the feeling of an empty stomach, even when it hurts, because it makes me feel like I'm finally accomplishing something, that this, at least, I can control, and I can control well. Every day, I try to get away with eating as little as possible.\n\nMy therapist has brought up the possibility of receiving extra treatment from someone who specializes in eating and eating disorders, but I'm extremely hesitant. I know what I'm doing isn't good, exactly, but it's hard to think about it being a big enough issue to receive extra treatment for - that I'm not sick enough for that. \"I'm overweight anyways, and I have to lose weight anyways, so what's the problem?\" my brain says. I think I'm too scared to face the reality of what's happening to me, and what I'm doing to myself. I think I'm ashamed. It's hard to tell how bad off I really am, because I tend to minimize my own experiences. Do I really have a problem that's bad enough to receive extra treatment for?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ji2qxg/request_do_i_really_have_a_problem/",
  "score": 36,
  "num_comments": 4,
  "comments": [
    {
      "id": "ga4ck15",
      "author": "jeabgrenouille",
      "body": "Yes. You sound very similar to me when I was in the spiral of anorexia. You can have problems with compulsive restriction even if you are overweight and you can have many of the same symptoms as an underweight person. It is still a very harmful thing to do to restrict your intake compulsively, at any weight. Certainly, your quality of life is being affected. That is very clear to me. \n\nIf you were looking for someone to give you permission to get that treatment for anorexia or an eating disorder or compulsive restriction or whatever you want to call it, you've got it.",
      "created_utc": 1603672646.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ga4phpw",
      "author": "Zealousideal_Cake_78",
      "body": "It sounds like yes, you do really have a problem.  And with eating disorders, probably as with most things, the earlier you get treatment the more quickly you can try to get your life back, and get healthy, and get back on track- not just with your eating but with your life.  With eating disorders there is often a myth that unless you are emaciated, you’re not really that sick.  From my perspective there is of course always the real life medical issues which can loom with an eating disorder, but another incredibly important issue is your quality of life.  This sounds like it is making you unhappy, making your relationship difficult, taking over your life, and making it harder to function the way you used to.  Given a ton of stressors, and some “accidental” restricting seems like the perfect storm to kick off an eating disorder.  The label is not so important.  I think you know you have a problem, it sounds like your therapist agrees, and I urge you to get specialized help.  You deserve to eat food and enjoy food, in a normal way, like a human being... food is one of life’s pleasures... and we could all use some pleasure right now.  The trap of weight loss, and the short term reward you feel for restricting or losing weight is eventually going to take over your life, most likely, without some help turning things around.  And in the end, at least in my experience, that is a very very difficult and impoverished sort of life.  You deserve more!",
      "created_utc": 1603680149.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ga4nqwx",
      "author": "SukhmaniAtmaKaur",
      "body": "First—Did your therapist diagnose you with an eating disorder? There are certain questions and diagnostic questionnaires they use that dig deeper into patterns and frequencies of behaviors. It’s important to explore those and get a diagnosis.\n\nAs for the restricting behavior, you’re under an extreme amount of stress. Our relationship with food is a direct reflection— a mirror— of our relationship with everything in our life, including loved ones. Where we hold back in one area, we hold back (whether consciously or unconsciously) in all areas.\nAn eating disorder vs disordered eating is an important distinction to make. You have a high level of awareness about your habits and motivations in your post. Restricting is how you’re coping with loss of control. Forgive yourself for this. You’re doing the best you can right now— you’re grasping and your body is the one thing you have total domain over. It is ok. This is human— it is you vs you. Understand this and start forgiving and loving yourself.\n\nStart by: (1) Saying no, with authority and with love and appreciation, when you do not want cakes or other foods that you feel don’t nourish you. It is OK to say no. Give yourself permission. It’s scary, but coming forward like this is remembering who you are— you are powerful and a good person who is remembering they have boundaries and makes decisions independently of others. Saying no is a good thing.\n(2) each day choose to enjoy a food that nourishes you. Take an avocado for example or a delicious bowl of oatmeal with raisins and chia seeds and cinnamon. Let your body relax and enjoy little by little. \n(3) prior to eating, write in a journal for a few minutes, writing any anxieties, emotions, free thoughts, anything— fast and without pause. Do not judge what comes out. You are emptying the subconscious. All of that tension you carry, let it flood the pages. It doesn’t have to be legible. It just needs to feel free and expansive.\n(4) eat in a space that is calm. Turn on calming music. Open a window. Organize prior to the meal. The energy will shift.\n\nSmall changes lead to completely different landing places. Love to you. You’re getting there and you’re right on time.",
      "created_utc": 1603679100.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ga3z5d4",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603665281.0,
      "score": 1,
      "context": []
    }
  ]
}