{
  "id": "jiy28b",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603791475.0,
  "title": "Request: How I feel being at the heaviest I’ve been in my entire life...",
  "selftext": "The pandemic has not been kind to me. When it started I had reached a number I had never seen on the scale before (which wasn’t even that bad, in retrospect). I decided to use my extra free time to start counting calories obsessively, working out, etc. and dropped to an unhealthy number on the scale and still thought I needed to lose more.\n\nSuffice it to say, that was not sustainable and while I’ve refused to step on the scales for weeks now (I don’t think I could handle it) I know I’ve reached my starting weight, if not more. While I’m still not “happy,” one thing I’ve noticed is that I can eat a big meal and I don’t get a “pregnancy belly” since I’m not just skin and bones anymore. It’s not much, but it’s something I’ve been appreciating and wonder if anyone else has noticed the same thing.\n\nAnyways I hope the pandemic has been kinder to you, the mental struggle is way harder than I anticipated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jiy28b/request_how_i_feel_being_at_the_heaviest_ive_been/",
  "score": 68,
  "num_comments": 7,
  "comments": [
    {
      "id": "ga9nwbk",
      "author": "None",
      "body": "I’ve had the same experience! I started bad behaviours again after a while on being good about last August and then from Christmas to lockdown I was eating well and feeling good. But I started binging the first few weeks of quarantine and then I weighed myself. I was the heaviest I have ever been in my life. I then stopped eating normally and insanely calorie counted and restricted - finally back on track again though :) Hope you’re well!!!!",
      "created_utc": 1603803710.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gaa1ay6",
      "author": "Zelda_is_my_homegirl",
      "body": "Yep. I ate relatively healthy pre-pandemic and felt good. Then the stress and isolation triggered binging and lethargy. I gained quite a bit and now all my clothes are tight. \n\nThat then triggered obsessive weighing and restricting/binge cycles. I’m a mess right now, but I’m taking steps to get back to a healthy place. I know I’m going to struggle now to not spiral into orthorexic behaviors. The struggle is real.",
      "created_utc": 1603811158.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ga99ycj",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603791475.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gaba42z",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1603832385.0,
      "score": -1,
      "context": []
    },
    {
      "id": "gaa993v",
      "author": "captain_jayne",
      "body": "Big same. I haven't gotten on a scale since last year and I don't think I could handle it without going bull blown crazy. I even broke down and ordered new jeans. I'm trying to just stay happy and hope this ends someday and I can get back to a better normal without going back to ED.",
      "created_utc": 1603814984.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gacy6pq",
      "author": "sn00tboop",
      "body": "Honestly, same here. I've been steadily gaining weight too since this pandemic started. I can't seem to stop obsessing over how much I've gained and now seeing my body sends me into a panic spiral.",
      "created_utc": 1603869145.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gabk3xu",
      "author": "a_coco",
      "body": "Spamming an eating disorder sub with your weight loss book? Classy...",
      "created_utc": 1603837474.0,
      "score": 2,
      "context": [
        {
          "id": "gaba42z",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1603832385.0
        }
      ]
    }
  ]
}