{
  "id": "jk7anh",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1603965839.0,
  "title": "Request: I need advice on how to enjoy Halloween with friends",
  "selftext": "I have been struggling with binging and purging and am extremely anxious about the calories in the food I eat. I am going to a friends house for Halloween, and we are going to have dinner with homemade desserts and appetizers as well. I know I won’t be able to calorie count, but I want to have fun and eat normally with my friends without feeling like I have to purge. Does anyone have any advice on strategies for this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jk7anh/request_i_need_advice_on_how_to_enjoy_halloween/",
  "score": 43,
  "num_comments": 8,
  "comments": [
    {
      "id": "gahhzt5",
      "author": "jeabgrenouille",
      "body": "Omg. I remember a Halloween as a kid when I was at my most unwell, I had a nightmare that I ate like 10 mini kitkats. It was full nightmare status. My heart was racing, and I was sweaty, and my throat was tight. I was terrified of my Halloween candy.\n\nMy best advice is for next time. Our brains fear not knowing calories so the only way to enjoy eating food without knowing calories is to practice eating foods without knowing the calories until you no longer fear it. You have to teach your brain that there is nothing to fear, or else it will continue to have that fear.\n\nI always comment on these types of posts... DO NOT RESTRICT IN ANTICIPATION OF AN EVENT. I'm telling you, it makes it worse every time. I have always loved Christmas, and I would always try to restrict extra all through December, thinking if I lose more weight, I'll be okay eating more on Christmas day. It NEVER worked. All it ever did was make me even sicker on Christmas day and even more afraid of food and even more restrictive. All it did was make my family worry about me more. I remember everyone commenting on how sick I was, and I was just staring at a bowl of jujubes trying to make myself eat one, and I just got so overwhelmed by everyone's comments, so I just ran away and weighed myself instead. \n\nFor this time, if you haven't practiced eating in this way, my best advice is to have a bit of a plan. I used to honestly copy my sister sometimes to give me a sense of security. I would just plan to eat the same as her, and that felt more structured than just needing to choose for myself. If your friends know you struggle, you could ask one of them to serve you your portion, and then plan to eat the whole thing, no matter what. I would also plan for if you start to have too much anxiety and you need a break. If you need a break, you can step into the bathroom and breathe a bit, calm yourself down, and then give yourself a little pep talk. It's nice to know that there is an option if you need out for a minute.",
      "created_utc": 1603976638.0,
      "score": 24,
      "context": []
    },
    {
      "id": "gahjmed",
      "author": "throwaway1597526995",
      "body": "I have B/P issues but it usually only happens when I eat alone.\n\nWhat does help though is putting in the effort to make a full plate with what I am craving. If you want dessert, put a serving on the plate. You are allowed to put one serving of whatever you want on the plate (within reason. Your plate should be full but not piled high in volume or you’re going to feel like you need to purge because it’ll be too much food to be comfortable. Whatever is on the plate, you are allowed to eat however much you want. When the plate is empty, do your best to focus on something else. It’s ok if while you’re eating you have to tune out from conversation for a minute. I know when I eat with people it’s hard to eat mindfully with them asking me a bunch of questions. It’s ok to be quiet while you eat.",
      "created_utc": 1603977614.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gak6js7",
      "author": "None",
      "body": "Eat based on how others eat. So choose one person who has a good relationship with food and eat what they eat. This only works if they don’t have any type of ED tho so make sure they don’t have binge eating disorder or any other type. This will help you mirror having a good relationship with food and not make you freak out if you’re eating too little or too much. Then try to forgive yourself for just one day of not restricting don’t try to compensate the day before or after, let it go.",
      "created_utc": 1604023749.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gajas20",
      "author": "wdfchicka07",
      "body": "Eat mindfully. There is no reason to calorie count. Take a bite and put the food down so you recognize when you're full and only eat the things you really want. You'll be with your friends, just enjoy the time together!",
      "created_utc": 1604006696.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gajbz1n",
      "author": "Northstar04",
      "body": "This is so important. Try to look at this as a cheat day. You are going to eat and ENJOY yourself and NOT worry about what one day of extra eating will do to you (which quite seriously and scientifically is nothing if you aren't binging to discomfort). Try cognitive behavioral therapy going into and after the party. Interrupt negative thought patterns about calories and purging with positive thoughts about your friends and body positivity. Use the night as an exercise in \"exposure\" where the goal is to FACE YOUR FEAR of what you \"think\" will happem if you don't purge. The goal is to get through the day eating a reasonable amount and go to bed without purging and just not count the calories. They dont count. It is a holiday. It doesn't matter. Life is about enjoyment. You can do this.",
      "created_utc": 1604007298.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gah4sf5",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1603965839.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gajhivy",
      "author": "clumsycouture",
      "body": "I’m really sorry your going through this and I know exactly how you feel. I used to hate going out to eat with friends bc I was always worrying about how much they ate and making sure I didn’t eat more than them. I don’t have a good answer, just try to enjoy yourself although it might seem impossible. The thing that helped me when I finally stopped purging was realizing food = energy. Food is good, your body needs it. It is not the enemy. When those thoughts of wanting to purge come up try to think about being in the moment with your friends and enjoying their company.",
      "created_utc": 1604010118.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ganqsp1",
      "author": "wdfchicka07",
      "body": "This post is perfect for you:\n\n \n\nYou know what's scary?\n\nFear foods and diet culture taking the fun out of the holidays.\n\nLet’s talk Halloween candy. I can think of so many memories and conversations (and I’m sure you can too!) that go something like “I can’t keep this food in the house!” “Get that candy away from me” “I can’t stop eating candy once I start. I only keep it around for a few days a year, then it’s out of the house.”  \n\n\nThese rules can SEEM like they give us control over food but really they reinforce the binge-restrict, black & white mentality around food, and it backfires.  \n\n\nAny kind of restriction, mental - like “diet starts tomorrow” - can set off this black & white, binge-restrict response. By changing this pattern of eating, can help you neutralize foods so that you can ditch the food guilt, rules and ‘diet starts tomorrow’ mentality.\n\n**How to start:**  \n1. Make sure you are eating enough variety of food regularly, throughout the day. If we aren’t eating enough, you are going to be feeling out of control - your body is trying to ensure you have enough to eat.  \n\n\n2. Neutralize food - ditch the labels: ‘good’ ‘bad’ ‘guilty’ ‘healthy’ or ‘unhealthy’ - food has no moral value.  \n\n\n3. Keep foods that are normally ‘off-limits’ to you in the house and available to you, and allow yourself to eat them! This might mean keeping ‘off-limits’ foods stocked in the house and letting yourself have it whenever you crave it.  \n\n\nIn the beginning, you might want this food often and it might taste really, really amazing. Eventually, as you continue to allow yourself to have this food, it might still taste amazing to you, but since it’s a food that’s always available, it will lose some of its charge so that you can start to choose to have it in a satisfying amount, or not, without guilt, or feeling out of control. Allowing foods to be available without the threat of being restricted again, tomorrow or next Monday, allows you to rebuild trust within your body and eventually helps you to notice and navigate what hunger, fullness and different foods feel like to you.  \n\n\nThe myth is that we need more control over our body and what we eat, the truth is that we need more trust that our body doesn’t need to be tricked. [Read here](http://email.c.kajabimail.net/c/eJwVjstuwyAURL_GbCqsy8MGFizStJW67gdEGC4xDfGNHNwof19HmsVodKQ5yQ9DShMrXoIEAQqk0FaaXvQH-wnmqJWGd-fM0XYaYn8Jv2Eq11Bqv2BjszcoggM3IkqZ4jjBhBFGZ9SgUOcJWPVza7d7pw6d_NrTZnxgrXmrfaTrPmAqjdYS6t7vjW48I9aynDltjVPmkZa2UuVhpW1JPBMlhi-DU9q5P1yfp5I8F1pLYZVxI1v9I-U4l3gJYHbtZ5iJXm-s-Z_S8O37o5PKWT3af2mkUAM) for more on shifting your mindset from scarcity to abundance.\n\nHalloween looks different this year but I hope however you are (safely) celebrating, you can have some more peace and flexibility around food to enjoy the people and memories, without guilt! Supporting you.\n\n\\- Brenna\n\n📷",
      "created_utc": 1604107113.0,
      "score": 1,
      "context": []
    }
  ]
}