{
  "id": "jlq8dh",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1604178697.0,
  "title": "Request: I actually did it",
  "selftext": "I’ve been on a journey recovering from an eating disorder. It’s been crazy, hiding it from my parents and pretending like I’m recovering, especially after relapsing a gazillion times. Anyways, I ate two huge burgers on consecutive days. Yes, I ate one yesterday and one today. I don’t know how to feel about it, but I did it. I’m usually the person who binge eats one day and then skips meals for three consecutive days, and so on ( the cycle continues ). Recently tho, I just unconsciously started eating and enjoying my meals. It’s been three weeks since calories or weighing scales have been integrated into my routine checks. Am i proud? I’m not sure. But I did it, somehow. \n•\nPs: if I, a weak-willed individual and a fucking coward, can do something like this, you for sure can. SO don’t give up. You’ve got this!!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jlq8dh/request_i_actually_did_it/",
  "score": 75,
  "num_comments": 5,
  "comments": [
    {
      "id": "gaqhytw",
      "author": "__echo_",
      "body": "You are not a weak willed coward. You are a fighter. Congratulations for your victory. Proud of you.",
      "created_utc": 1604180570.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gaqgr9u",
      "author": "sarathedime",
      "body": "So proud of you!",
      "created_utc": 1604179816.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gaqewhu",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1604178698.0,
      "score": 0,
      "context": []
    },
    {
      "id": "garl4yg",
      "author": "poopematic",
      "body": "You did.. give yourself some more credit because you fucking deserve it. 😌 \nI’m proud of you",
      "created_utc": 1604207447.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gas7qyn",
      "author": "katiemia",
      "body": "aww i'm so proud of you",
      "created_utc": 1604229838.0,
      "score": 1,
      "context": []
    }
  ]
}