{
  "id": "jmlevu",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1604314600.0,
  "title": "Request: If I use starvation as self harm, does this mean I have an eating disorder",
  "selftext": "  \n\nTW: Suicide and Self Harm.\n\nOver the past month and a bit, I moved to university and began to lose my appetite as well as seeing a degradation to my mental health. There was one night where I binged a whole bunch of snacks and then felt an urge to throw it all up, which I resisted. Recently, my suicidal thoughts have become overwhelming and I've started starving myself as well as not taking the medicine that prevents me from bleeding out when I menstruate. I'm anaemic due to my period which means I don't feel hungry unless it's really bad, and I want to punish myself by starving myself and getting closer to death. If I use starvation as self harm, does this mean I have an eating disorder?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jmlevu/request_if_i_use_starvation_as_self_harm_does/",
  "score": 72,
  "num_comments": 8,
  "comments": [
    {
      "id": "gavy3lp",
      "author": "25lives",
      "body": "I'm no psychologist and won't diagnose people, but....well. Welcome to r/ED :(\n\nI can at least say that I've seen this same post here several times before from others. Using food/lack of food to control/punish is a waterfall of red flags, normal folks don't do that. You're going to want to take this post to a therapist and let them guide yo through whether or not this is ED or something else, and how to approach coming back from it. \n\nAnd remember, if this does turn out to be ED, you're not somehow failing. Or morally wrong. Or gross or weak or stupid, you're sick. Being sick happens, and you'll get better with the right care,  but you've gotta find a doctor to help get that care. Good luck.",
      "created_utc": 1604316648.0,
      "score": 31,
      "context": []
    },
    {
      "id": "gavzlnd",
      "author": "I_am_the_flower",
      "body": "Like the other user said, no one here can diagnose you but eating disorders are more or less defined as using harmful behaviors around food and having abnormal habits with food. I can’t say you have an eating disorder but starvation and other bad behaviors as self harm can be classified (by a professional) as eating disorder behavior. But I cannot say that you have an eating disorder. Please, please, please seal help though. It’s best to get help early on rather than later because things can get even more ugly really quick. No one wants to see another life be wasted away to an eating disorder. It sucks.",
      "created_utc": 1604318129.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gawk0sr",
      "author": "irenek1990",
      "body": "well, i started binging and purging and starving as a way of self harm, because cutting myself didn't work since i was only making deep cuts that needed stitches, so i couldn't really hide it, and i was looking for a more ''hidden\" way of self harm and now i have a full-blown eating disorder. but i stopped cutting. honestly, i'd prefer cutting instead of having an eating disorder. i wouldn't wish it on my worst enemy.\n\nso even if it means you don't have an eating disorder at this point, it's highly likely you'll develop one. please take care",
      "created_utc": 1604331271.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gaxtoyx",
      "author": "schnabeltierliebe",
      "body": "Sometimes also bpd can cause eating disorders or destructive eating behaviour or you really have an eating disorder. I don't know if you have any diagnosis? The best thing you can do is seeking help. You might feel that you're not sick enough or don't worth it to get help but you are.",
      "created_utc": 1604352998.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gavw73h",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1604314600.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gaxpqur",
      "author": "throwaway-m1",
      "body": "Very possibly. People’s reasons behind their eating disorders vary. Some people’s eating disorders are due to self harm, looks, control, etc. \n\nThe only difference is that if your #1 problem is self harm, focusing on treating that (instead of focusing on recovering from your eating disorder) might be the most helpful thing you can do. (Also it sounds like it is, and it’s really dangerous. Please please get help!!!)",
      "created_utc": 1604351056.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gawf2x9",
      "author": "Pawslover-180",
      "body": "https://suicidepreventionlifeline.org",
      "created_utc": 1604328728.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gay0veg",
      "author": "enord11400",
      "body": "It could. I kind of switched off between various ED behaviors and self harm (cutting) so sometimes they would fill the same void of wanting control and to punish myself but other times my ED was about feeling accomplished via weight loss. I’ll say for me bingeing and purging filled a very similar void to self harm most of the time. They can overlap but I think only a psychiatrist could make the final call after a lengthy discussion about your feelings and reasons for different behaviors.",
      "created_utc": 1604356588.0,
      "score": 1,
      "context": []
    }
  ]
}