{
  "id": "jn7ywx",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1604399089.0,
  "title": "Request: Am I displaying subtle signs of a possible eating disorder / body dysmorphic behaviour?",
  "selftext": "I come from a pretty size-attuned culture where thinness is a huge thing. If you’re not Asian-sized skinny, then you need to lose weight. \n\nWeight talk is a thing where I’m from. Everybody seems to be allowed to have an opinion on your weight, your size, how you look, and how you *should* look — family, relatives, friends, classmates, even colleagues. Diet fads are a thing. Metabolism pills, herbs, coffees and teas are widely used. We have a whole “healthier choice” movement and if you’re not trying to engage in it, then you’re not trying hard enough to be healthy. We are BMI-obsessed. Clothes go up to an Asian large, but go down to an Asian xx-small (because xs isn’t small enough). \n\nAnd I’ve struggled with my weight a lot. The first time I thought I was disgusting, I was 8 — wearing a dance leotard and a skirt for a dance competition, thinking my arms were huge and that my stomach was literally bulging out and spilling over my skirt. I looked like any normal 8’yo girl, like the pics you’d find on google, but I felt disgusted with myself, at that young age. My mum had said something along the lines of “your tummy looks quite big in this costume” and so I assumed I was fatter than everyone else. \n\nThings have since worsened, of course. Put simply, jokes made by relatives like “I saw a really big-sized person downstairs, I didn’t know it was actually (my name)!” / “wow you look really ugly in this photo!”, comments by my parents like “you need to exercise more” / “if you exercised more your joints wouldn’t hurt” / “don’t eat dinner anymore, and don’t eat your whole lunch” / “stop eating rice or noodles, it’s so much carbs” / “you really put on weight, are you planning to do something about it”, classmates: “wow she has a fat belly” (i was eleven and at a healthy weight), colleagues: “you would look prettier if you were skinnier” (i’d just lost some weight after going on a no-carb diet, and still wasn’t skinny emough), these comments from other people just made me feel so sick of myself. And eventually, the thoughts became my own. If no-one else was saying it to me, then I’d be saying it to myself.\n\nAcross the years I’ve engaged in food restricting behaviour (calories restriction / skipping meals / starving myself when i felt hungry), partook in diet fads like liquid diets (only soups), water-only diets (only mineral water and a handful of diet pills a day, no food at all, marketed as a “body cleanse”), and diet pills like garcinia cambogia carb-blocking supplements. I used creams like slimming gels & fat-burning creams locked in with cling wrap. I went for slimming programs like toasting myself in a machine meant to “sculpt”, and then had to sit in a sauna for 30 minutes to “sweat the fat” out of my body. I used to be obsessed with exercise workouts. Not one message I sent wasn’t about some kind of workout routine or challenge. I was obsessed with making my body look a certain way. I weighed myself day in and day out, and the slightest weight gain would leave me feeling terrible. I would try to puke, or try to give myself food poisoning just so that everything that went into my body would come out — I never binged, but I needed it to not stay in my system. When i couldn’t make myself purge in that manner, I turned to taking laxatives on a daily basis for a substantial period of time. Despite everything I did, the numbers still climbed (despite some occasional dips). \n\nAnd every single time I ate more than I felt I would have to “pay it back” by starving myself and skipping / rationing meals.If my stomach shrank, so would my appetite.And I had a crazy amount of appetite to be honest, I was always dancing. And I would get told (even when I was dancing 6 days a week for hours at a time), that I still wasn’t exercising enough and needed to do more — I was barely at home at this point and was getting increasingly burnt out; I stopped dancing once I hit my limit. \n\nAnd then I eventually felt so bad about my body that I would cry looking at myself in the mirror before a shower, and squeeze my flab and claw at it. I wanted to take a slicing knife and cut it all off. I stopped weighing myself. When I lived abroad alone I stopped restricting my eating, ate whenever I felt empty (emotionally because I was getting depressed, but mistook it for physical hunger) and put on a ton of weight. When I came home from abroad I didn’t want to meet anyone at all for any “welcome home” meet-ups. I didn’t want to celebrate festivities. All I wanted to do was sleep and die alone out of embarrassment. I didn’t need to hear the comments because I already felt that way myself. \n\nI couldn’t & still can’t look at myself in the mirror and in pictures without feeling gargantuan. I feel like I’m taking too much space in this world, because I’m not small in clothing sizes. If my bum has to squeeze past someone else in the aisle of a crowded bus, it’s because I’m fat. If I brush shoulders with the person sitting beside me on a train, it’s because I’m fat. Nothing looks good on my body. My nose is too big for my face. I assume that I’m twice the size of my friends. I still check my body in the mirror everyday. I body-check my wrists. I have a terrible relationship with my body, myself, how I look, my clothing sizes, fitness, exercise, diets, expectations in general (because I was never slim enough, never exercised enough, never lost enough weight).\n\nThese days, I’ve started weighing myself again since having to attend monthly psychiatric appointments for moderate-severe depression. I’d been losing lots of weight after eating very little for months, due to depression’s poor appetite. And recently I’ve gained a very tiny bit of weight that I had lost, after starting to eat breakfast and a fuller lunch again because I started going back to work / existing outside of my house again. And the super tiny weight gain has had me reeling. I kind of made a competition with myself to lose more and more weight each time I went for the appointments — if I didn’t weigh lighter than the last appointment, then I was a complete fat fucking failure. \n\nI’m not at a healthy weight per my BMI. I carry quite a bit of muscle from my dancing days. My recent weight gain puts me back in the Obese category. It makes me sick. And I still do this thing where if I ate a small breakfast for the day , then I could only eat half my lunch and couldn’t let myself eat dinner — if I was hungry in the evening, I would have to make friends with gastric pains and mineral water. I’m doing it right now tbh. \n\nAnd I hate it. I hate having this constant balancing scale going on in my head — so much compensatory behaviour. I’m sick of myself. I feel like my brain and my body are both conspiring against me, with these body image obsessed thoughts and depression (outside of body image) and all. I feel worthless. I hate how I look. I hate how I’m always thinking about compensating for portions that I eat (even if food and calories aren’t on my mind 24/7). \n\nAt this point I don’t know if it’s just my internalized asian fatphobia towards myself (I’m body-positive with all of my friends and family, but am very hypocritically the opposite with my own body), or if I’ve really been taking it too far with my weight management habits. I never thought that I had an eating disorder because I was overweight (because maybe it was normal to feel this way about a body that wasn’t the ideal average-looking skin?), but after becoming more aware of eating disorder stories by athletes / dancers / figure skaters recently, i find myself identifying with so many of their stories leading up to getting treatment for an ED, right down to rituals, habits and thoughts. Gracie Gold is basically the olympic athlete version of my own experience with my body. \n\nI don’t know, am I displaying subtle signs (or maybe glaring signs) of a possible eating disorder? Or are they just disordered eating habits? Do I need help? Where is the line between normal weight management vs. probably needing to see a professional for eating-related issues? \n\nI see my psychiatrist this week, and have been thinking about highlighting this body image issue with her, but I’m worried that she’ll say “well it’s because you’re clinically obese, it’s normal to want to lose weight”. But I may bring it up to her if someone can convince me that I actually should. I’m just tired of feeling like this. It’s been 15 fucking years.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jn7ywx/request_am_i_displaying_subtle_signs_of_a/",
  "score": 50,
  "num_comments": 4,
  "comments": [
    {
      "id": "gb0pdul",
      "author": "Northstar04",
      "body": "You may or may not clinically qualify as having an eating disorder. I can't make that determination. But you DEFINITELY have an unhealthy relationship with your body and negative thought patterns that are making you unhappy. A therapist specializing in ED would be very good for you. People who are overweight can absolutely have eating disorders and the goals you have for your weight are unrealistic. You don't say how tall you are or what your weight actually is but an Asian xxs is not the bar you should have. An American size Large is a perfectly acceptable and healthy weight. If you have an eating disorder, you really shouldn't be focused on losing weight at all, though. Being overweight is so much healthier than having ED! You need to be healthy first, to stop obsessing about your body, and learn to have confidence about your size and beauty in the face of your family. People believe what they are told so tell them you are beautiful and strong and to shut up otherwise. You should spend your time thinking about all of your hobbies and interests and relationships. Your weight should be last on the list.\n\nTake up dancing again, but not to lose weight. Do it because it is fun and skip the leotards. Exercise is good for your depression and dance is one of the funnest exercises you can do. I know some big girls who are incredible dancers. Try to be incredible. Focus on growing your skill. Find a studio that will let you perform! Yes, you should dance on stage.\n\nIf your family is so awful... stop seeing them. Tell them you have had enough of the negative body talk and just stop engaging. Make friends with balanced body types. Consume media with balanced body types. Focus on the beauty of your soul inside and heal your relationship with yourself and your body, which is such a powerful instrument. Focus on what your body allows you to DO (like dance) and make that your aim.",
      "created_utc": 1604421833.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gazqbhl",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1604399089.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gazwgv9",
      "author": "XTianoElCurioso",
      "body": "Go for it and talk to your psychiatrist if you feel that they might listen to you and take you seriously (if not talk to someone else, your GP, a friend, a therapist!) Don’t get wrapped up in trying to figure out whether what you experience fits with some diagnosis or not. It’s clearly important to you. Even it’s it not a ‘typical’ eating disorder (and I am not saying that it isn’t) it affects you and it might be helpful for you to talk about it. Depression, eating etc.they all hang together anyway...why not talk to your therapist who you are seeing for your mood? \nGood luck!",
      "created_utc": 1604405210.0,
      "score": 9,
      "context": [
        {
          "id": "gazqbhl",
          "author": "AutoModerator",
          "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
          "created_utc": 1604399089.0
        }
      ]
    },
    {
      "id": "gb0e9s1",
      "author": "xhbxvjnfgggg",
      "body": "I couldn't agree more, I think you should too. If you do, then good luck, I'm sure it'll turn out fine. Anyway no harm could come from just talking about it, in fact it'll probably be a good thing\n :)",
      "created_utc": 1604416421.0,
      "score": 1,
      "context": [
        {
          "id": "gazqbhl",
          "author": "AutoModerator",
          "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
          "created_utc": 1604399089.0
        },
        {
          "id": "gazwgv9",
          "author": "XTianoElCurioso",
          "body": "Go for it and talk to your psychiatrist if you feel that they might listen to you and take you seriously (if not talk to someone else, your GP, a friend, a therapist!) Don’t get wrapped up in trying to figure out whether what you experience fits with some diagnosis or not. It’s clearly important to you. Even it’s it not a ‘typical’ eating disorder (and I am not saying that it isn’t) it affects you and it might be helpful for you to talk about it. Depression, eating etc.they all hang together anyway...why not talk to your therapist who you are seeing for your mood? \nGood luck!",
          "created_utc": 1604405210.0
        }
      ]
    }
  ]
}