{
  "id": "jn7zf9",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1604399171.0,
  "title": "Request: Does anyone else with anorexia have binge eating episodes?",
  "selftext": "Does anyone else with anorexia have binge eating episodes? What can I do?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jn7zf9/request_does_anyone_else_with_anorexia_have_binge/",
  "score": 50,
  "num_comments": 18,
  "comments": [
    {
      "id": "gazya8l",
      "author": "DragonflyStunning",
      "body": "yes i did when i would fast i would go into a binge, i stopped binging by eating normally throughout the day and not fasting",
      "created_utc": 1604406718.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gb0pta7",
      "author": "kkumas",
      "body": "Yes i used to have a couple episodes through the month.  The more weight i lost the bigger and more frequent they became.  There is a binge/purge subtype for anorexia so!",
      "created_utc": 1604422032.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gazxtkb",
      "author": "I_am_the_flower",
      "body": "I don’t personally but there are many people with anorexia and binge episodes. There’s a whole sub type of anorexia for it. I don’t know how to help but please know you are not alone in your struggles. Many many people experience this.",
      "created_utc": 1604406348.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gb21khw",
      "author": "Juliakerman",
      "body": "Actually I do, or I mean, sometimes I start to eat and then I just can’t stop and I could eat like a ton of food (I feel like a never ending pit). And that’s sooooo frustrating. It’s like I can’t put food aside of my mind, it’s my brain constantly telling me « eat more eat more » and then there is the illness that is too afraid to completely fall in. And it happens even though I don’t restrict my intakes (or I don’t seem to)",
      "created_utc": 1604444928.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gb24iip",
      "author": "bpurly",
      "body": "Yes. It's \"normal\" and is because of severe restriction. The way to stop it is to stop restricting (physical and mental). I haven't had a single binge or even anything resembling a binge since I've been in recovery.",
      "created_utc": 1604446509.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gb2c8zg",
      "author": "noonefromnowherefrom",
      "body": "Hi, \nThere are two types of anorexia, binge-restrict type which is the most common form of anorexia and what you described and restrict only which is what is most commonly depicted in the media where you don’t eat at all or very little. The only way to stop bingeing is to stop restricting which of course is easier said. The help of someone trained in this field is what you need! And I just wanted to say that you can and will overcome this! I went through binge-restrict anorexia as well and am in recovery! I recommend looking for a cbt oriented therapist along with a dietitian.",
      "created_utc": 1604450820.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gb31ov7",
      "author": "depressedfatbitch",
      "body": "Yes I fast, then heavy restrict, so live off almost no calories for a few days. Always results in a binge, feel so painfully bloated the next day. Rinse and repeat!!! Oh and I do all my binging shamefully in the kitchen between 11pm and 2am.",
      "created_utc": 1604465302.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gazzo1f",
      "author": "OhToBeSkinny",
      "body": "I experience this myself and I understand how upsetting and confusing it is because logically it isn’t worth it. Why would you go through so much pain only to gain weight back? It doesn’t make sense in my brain but I can’t seem to stop until something clicks back into place and I’m pushed too far off of the edge. I don’t really get a “normal” period of eating, it’s one extreme or the other and I hate it and I hate myself for it. It’s always my lowest point when I get into a binge period",
      "created_utc": 1604407766.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gazqe4a",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1604399171.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gb1pde7",
      "author": "nodaybuttoday__",
      "body": "Yes, it’s your body trying to protect itself from famine.",
      "created_utc": 1604438854.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gb2u6ms",
      "author": "BrowncoatIona",
      "body": "This has always been my frustration with labels. No one fits perfectly into them. I was first diagnosed with bulimia, then anorexia-b/p subtype, then anorexia-R subtype. At the point of those diagnosis, I had never binged, but I did purge regularly. It made me feel super gross and invalidated (which is a garbage mindset I have since moved on from!).\nI guess they kinda just try to shove you into the box that fits \"best\". Realistically almost everyone should probably be under OSFED as eating disorders really are a spectrum, but they use diagnostic labels to help with treatment and insurance. \n\nBut yes, I have known many people with anorexia who regularly binged, with or without purging (people diagnosed with both anorexia-R and anorexia-b/p). I've actually pretty rarely met someone who's struggled with an ED for any considerable amount of time who hasn't experienced binging. I think it's more common than people are willing to admit. After the point of those diagnoses, I have also experienced a few binges (I'm not sure whether it would meet the medical definition or not, but they were terrifying). It's a really natural response to restriction, especially severe restriction or fasting. However, they are dangerous :c but I'm sure I'm preaching to the choir. EDs are dangerous. \n\nThe best way to avoid binges is, frustratingly, to eat the amount you need to satisfy your physical and emotional needs. It also definitely takes time :c",
      "created_utc": 1604460906.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gb2s69v",
      "author": "iwasntlucid",
      "body": "Yep.",
      "created_utc": 1604459806.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbbovz3",
      "author": "shannonmerritt01",
      "body": "i’m not diagnosed with either but when i go for ages without eating, sometimes i’ll binge and just eat loads and then feel guilty and then restrict even more",
      "created_utc": 1604648464.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gb14wpo",
      "author": "More-7712",
      "body": "I am the original poster here and I have been struggling with what I believe would be categorized as binge/purge anorexia for nine or ten months now. How were you able to stop restricting?  I believe my binges may be caused by such severe restriction in the first place but I am stuck in a repeating bingeing/fasting/restricting cycle which I have been unable to escape from.",
      "created_utc": 1604429148.0,
      "score": 3,
      "context": [
        {
          "id": "gazya8l",
          "author": "DragonflyStunning",
          "body": "yes i did when i would fast i would go into a binge, i stopped binging by eating normally throughout the day and not fasting",
          "created_utc": 1604406718.0
        }
      ]
    },
    {
      "id": "gb3dhif",
      "author": "Punkenerci",
      "body": "Same. \nI've basically lost 100lbs through severe restriction.\nI'm struggling to not binge. \nI hit my lowest weight beginning of October but now I'm hovering about 10-15lbs over that. \n😭😞🤬😡\n\nIt is hard.",
      "created_utc": 1604473434.0,
      "score": 1,
      "context": [
        {
          "id": "gb31ov7",
          "author": "depressedfatbitch",
          "body": "Yes I fast, then heavy restrict, so live off almost no calories for a few days. Always results in a binge, feel so painfully bloated the next day. Rinse and repeat!!! Oh and I do all my binging shamefully in the kitchen between 11pm and 2am.",
          "created_utc": 1604465302.0
        }
      ]
    },
    {
      "id": "gb14mgu",
      "author": "More-7712",
      "body": "I an the original poster here and I relate to this so much.  I have binge eating episodes then abuse laxatives/overexercise and do fasting for two or three days afterwards to try to compensate.  I always feel like I am messing up all my weight loss progress from fasting/restricting when I binge even though I plan my binges.  Complete with planning my fasting/restricting days to ensure I am still at a calorie deficit for the week to continue with weight loss.\n\nI also relate to having to be at one extreme or the other in regards to eating.  I have to be either fasting/severely restricting or bingeing.  There is no eating normal portions for me. I feel like my days are almost always either bingeing or fasting to compensate for the binge for the past nine or ten or ten months since this eating disorder began taking over my life.  I am stuck in a repeating bingeing/fasting/restricting cycle which seems impossible to escape from sometimes.",
      "created_utc": 1604429012.0,
      "score": 2,
      "context": [
        {
          "id": "gazzo1f",
          "author": "OhToBeSkinny",
          "body": "I experience this myself and I understand how upsetting and confusing it is because logically it isn’t worth it. Why would you go through so much pain only to gain weight back? It doesn’t make sense in my brain but I can’t seem to stop until something clicks back into place and I’m pushed too far off of the edge. I don’t really get a “normal” period of eating, it’s one extreme or the other and I hate it and I hate myself for it. It’s always my lowest point when I get into a binge period",
          "created_utc": 1604407766.0
        }
      ]
    },
    {
      "id": "gb18x77",
      "author": "DragonflyStunning",
      "body": "i was able to break the cycle by mechanical eating (forcing myself to eat) breakfast, lunch and dinner eating 3 meals a day even if they’re small helps me from restricting and binging. I also didn’t start mechanical eating until i tried inpatient recovery i quit after 2 weeks but was able to recover on my own after that. getting in the habit of eating morning, afternoon, and night really helped. \n\ni know it’s easier said than done but once i broke the habit it did become easier. i try to tell myself that if i restrict it will just end in a binge and it’s a shitty cycle i don’t wanna go through again",
      "created_utc": 1604431082.0,
      "score": 3,
      "context": [
        {
          "id": "gazya8l",
          "author": "DragonflyStunning",
          "body": "yes i did when i would fast i would go into a binge, i stopped binging by eating normally throughout the day and not fasting",
          "created_utc": 1604406718.0
        },
        {
          "id": "gb14wpo",
          "author": "More-7712",
          "body": "I am the original poster here and I have been struggling with what I believe would be categorized as binge/purge anorexia for nine or ten months now. How were you able to stop restricting?  I believe my binges may be caused by such severe restriction in the first place but I am stuck in a repeating bingeing/fasting/restricting cycle which I have been unable to escape from.",
          "created_utc": 1604429148.0
        }
      ]
    },
    {
      "id": "gb23lcm",
      "author": "wdfchicka07",
      "body": "Thats exactly why. Restriction leads to binging. You need to allow yourself to have anything you choose and eat consistently. Eat every 4 hours so your body trusts you that food is available. When you restrict your body thinks its in a famine and then you binge because it thinks its the last time food is available. You have to teach it that food is abundant. You can't do that if you aren't regularly eating.",
      "created_utc": 1604446013.0,
      "score": 3,
      "context": [
        {
          "id": "gazya8l",
          "author": "DragonflyStunning",
          "body": "yes i did when i would fast i would go into a binge, i stopped binging by eating normally throughout the day and not fasting",
          "created_utc": 1604406718.0
        },
        {
          "id": "gb14wpo",
          "author": "More-7712",
          "body": "I am the original poster here and I have been struggling with what I believe would be categorized as binge/purge anorexia for nine or ten months now. How were you able to stop restricting?  I believe my binges may be caused by such severe restriction in the first place but I am stuck in a repeating bingeing/fasting/restricting cycle which I have been unable to escape from.",
          "created_utc": 1604429148.0
        }
      ]
    }
  ]
}