{
  "id": "jqkr2c",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1604873363.0,
  "title": "Request: No support from boyfriend",
  "selftext": "My bf and I have been dating for 2y now. This year has been taking a really bad turn on my mental health the last few months which didn’t make my relationship easier. My eating disorder has been getting worse. I know I can be a hand full and I appreciate the time he was there to help me get better when I was being upset. If I look back on the first year, I was being really irrational. I feel like I’ve broken him at this point, I wanted to get better and went into therapy this year. I’m following DBT, going weekly to a psychologist & (since recently) a dietitian. I’m really trying and I’m doing better with handling my emotions and conversations but I get no more support from him especially with my ED. This makes recovery so hard for me, if I’m having a hard time he just ignores me and eventually just leaves. I try to make up for the times I’m upset but it’s just not enough anymore. The distance keeps getting worse and I’m stuck cause he doesn’t know how to help even though I’ve told him exactly how he can help. It just doesn’t happen. I can’t do this alone, especially since I feel like I’m being judged by him and the people around me but I’m at a breaking point. I’m thinking of breaking up, since I feel like it’s the best for both of us. He’s clearly not happy anymore but I feel like this relationship needs to go both ways and he’s pushing me down further. But I would still like some advice, I don’t wanna be unreasonable but I’m tired of trying and getting no support from his end.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jqkr2c/request_no_support_from_boyfriend/",
  "score": 41,
  "num_comments": 7,
  "comments": [
    {
      "id": "gbntsgu",
      "author": "None",
      "body": "i’m glad you are recovering, and i’m sorry you’re having a hard time. however, it is ultimately up to you to recover. it’s great and healthy to need extra support from an extended network of family, friends, and your SO, but if you’re expecting your boyfriend to aid entirely in your recovery effort and keep you afloat, then he is probably going to resent you. cause even tho he loves you it is a lot to put singularly on another person, especially if there is a lot of history of you being “irrational” and a “handful” as you said. just lots of baggage there that’s hard to overcome. \n\nalso, it’s not fair to you to feel judged and distant from your SO. it sucks. i honestly fault no one in this situation, but you do deserve honesty and transparency from him. if the relationship is no longer benefiting or satisfying either of you, it might be time to talk and lay everything out on the table so you can decide together what’s best for each of you going forward, whatever that means for you. \n\ni truly truly wish you the best and believe in you, recovery sucks but it is worth it. best of luck x",
      "created_utc": 1604875694.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gbo7txy",
      "author": "hannu30",
      "body": "Been in two very long relationships with girls with psychological and/or eating disorders, so just my take to bring some insight from the other side (without pretending to know your situation or what he is thinking/feeling).\n\nYes, it takes a real toll on your partner, especially if he feels like you have been working some anger out on him. What bothered me most was that no matter how hard you try your best, you keep being on the receiving end of a lot of the bad emotions and in the end you stop even trying to guess what you need to do to do the right thing.\n\nSo it may be possible that it's not a willingness to help, but just a feeling that he can't help. I don't know how the dynamic between you works, but maybe try and acknowledge a bit more the moments that he does support you and try to look at things from his side too.\n\nIt's up to you to find out if there is still something left in the relationship, and if yes, then I would try to salvage it if you think that improved relationship can help you with your recovery.\n\nIf not, then it's just more negative energy.",
      "created_utc": 1604883157.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gboa94h",
      "author": "ae_and_iou",
      "body": "whistle public spotted mighty plants cable bag fuel payment rich\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1604884562.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gbp2loo",
      "author": "bbeetle_juice",
      "body": "so happy you’re trying to recover ! i’m really sorry abt how your boyfriend is acting esp because ur making an effort to get better and in a way he’s kinda punishing or like negatively reinforcing restrictive tendencies bc i’m assuming u associate him being nicer with when u were struggling :/\n\ni hate to sound like your therapist but a dear man could be really helpful in this situation as well as incorporating more of the give skill into your interactions. he could also be completely unaware of how his actions are affecting u ! ask for clarification on his intentions instead of assuming the worst \n\ngood luck <3 i hope everything works out",
      "created_utc": 1604902957.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gbnp9md",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1604873364.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gbpc7j3",
      "author": "SoftDramatic",
      "body": "Dump him.\n\nI mean it.\n\nI was so suicidal and malnourished, until I found the strength to leave.\n\nI became sick in his presence and couldn’t heal until he was gone.\n\nYou may go through some ups and downs without him, that’s okay. You’re processing a lifestyle change.\n\nForgive yourself if you have some intense post breakup mishaps and keep going.\n\nI believe in you and I 1000000% believe that dumping him will help. I say that from experience.\n\nI’m 1 year single, 1 year sober, 1 year healthy weight, 1 year in remission for depression, 1 year into DBT therapy.\n\nIt’s been the most incredible, and the hardest, year of my life...but I feel like I’m in heaven from the peace of mind.",
      "created_utc": 1604912422.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gby81hn",
      "author": "pretendyourespecial",
      "body": "Idk if I have anything constructie to addm but I was in a similar place before I left my ex, who basically told me I chose to have a (restrictive) ED.\n\nWe also binge-ate together. I also self-harmed when I was with him.\n\nThat relationship was a toxic piece of garbage.\n\nI'm glad you're out of your own toxic relationship and doing well <3\n\nOP, I  don't want to be egging you on... But for someone to ignore you or get up and leave when you're breaking down, means they aren't invested in the relationship anymore. What happens if you have kids with that guy? Is he gonna walk away the moment shit gets tough? Save yourself a life of heartbreak, dump him...",
      "created_utc": 1605113877.0,
      "score": 2,
      "context": [
        {
          "id": "gbpc7j3",
          "author": "SoftDramatic",
          "body": "Dump him.\n\nI mean it.\n\nI was so suicidal and malnourished, until I found the strength to leave.\n\nI became sick in his presence and couldn’t heal until he was gone.\n\nYou may go through some ups and downs without him, that’s okay. You’re processing a lifestyle change.\n\nForgive yourself if you have some intense post breakup mishaps and keep going.\n\nI believe in you and I 1000000% believe that dumping him will help. I say that from experience.\n\nI’m 1 year single, 1 year sober, 1 year healthy weight, 1 year in remission for depression, 1 year into DBT therapy.\n\nIt’s been the most incredible, and the hardest, year of my life...but I feel like I’m in heaven from the peace of mind.",
          "created_utc": 1604912422.0
        }
      ]
    }
  ]
}