{
  "id": "jrin30",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1605003829.0,
  "title": "Request: I binged for a whole month and I can’t get back on track.",
  "selftext": "I’ve been binging every single day for a month and I can’t get back on track like I’ve done with my previous binges. I’ve already gained about xx lbs and I see a big difference in my body.\n\nIt started when I wanted to stop my binge-restrict cycle last month so I went two whole weeks with no restrictions and no guilt, but I just ended up binging and after that I think developed a junk food addiction. I’ve tried intuitive eating and calorie counting to lose weight but both keep ending up in binges. \n\nThis is the worst my binging has gone and I’m so desperate to get better. I wanna see a therapist but I won’t be able to handle it if he/she tells me I need to gain or maintain weight in order to recover.\n\nDoes anyone have advice? It feels like I’ve lost control over my entire life because of binging.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jrin30/request_i_binged_for_a_whole_month_and_i_cant_get/",
  "score": 83,
  "num_comments": 20,
  "comments": [
    {
      "id": "gbtf6ae",
      "author": "None",
      "body": "See the therapist. Just go for it, it may be just what you need. Your weight doesn't matter, you need to overcome this disorder. Best of luck x",
      "created_utc": 1605005963.0,
      "score": 30,
      "context": []
    },
    {
      "id": "gbtnynn",
      "author": "justashittymillenial",
      "body": "Two podcasts that continue to help me are “food psych” podcast with christi Harrison & “binge breakers” with Jacqueline Davis. They continue to help me through my own recovery",
      "created_utc": 1605013802.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gbunok8",
      "author": "None",
      "body": "i really doubt they will tell you that you need to gain weight unless you are at current severely underweight/ extremely malnourished, at which point y'know, weight gain could be beneficial. but i don't think thats what they will tell you-- most likely, from my experiences with a dietician and a therapist, they will want to help you get on track with making healthy choices for food and also improving your overall mental health and relationship to food! i would highly recommend it :) a therapist is something that EVERYONE should go to imo, especially when they feel like you said, \"i've lost control\". thats what they are there for! it'll all work out, i wish you the best!",
      "created_utc": 1605032188.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gbu85du",
      "author": "Jax-Jax",
      "body": "It might be a good idea to find ED support groups on zoom. it would definitely be important to find a therapist and a dietitian. I wouldn't necessarily look for just a nutritionist because the qualifications depend on different things per state, a dietitian would be more recommended. If you're bringing and purging that often it might also be beneficial to find an outpatient program as well. It doesn't matter what you're weight is, it can still be dangerous to be purging that often.",
      "created_utc": 1605024971.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gbvjy9d",
      "author": "RoseTyler38",
      "body": "> I won’t be able to handle it if he/she tells me I need to gain or maintain weight in order to recover.\n\nThat is not what the therapist is there for. The therapist is there to help you uncover the root cause of this eating disorder and help you develop healthy coping strategies.",
      "created_utc": 1605047746.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gbwhy1r",
      "author": "Zampan0-",
      "body": "In isolation and lockdowns I move found myself bingeing too. It’s gotten way out of hand. Also having the apps that get shitty food to you in 39 mins I’ve had way too much junk food.\nI’ve put on way too much weight. I relate to this.\nI see a psychologist but I have yet to bring up the eating issues. I also purge sometimes and I can usually get it under control after a lapse but atm I’ve lost a very close friend to suicide and this years been hell but I need to get a hold of it.\nI hope you do! You deserve to be happy and live a fulfilled life. To be secure and happy with how you look. Own it and love yourself and people will see it and your weight won’t matter.\nIt’s easy to say but rlly hard to put it in place.\nI’m not telling you what to do as I have no leg to stand on and I don’t wanna be a hypocrite.\nI wish you all the best.\nYou’re beautiful as you are\nPeace :)",
      "created_utc": 1605066522.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gbtfyp5",
      "author": "DragonflyStunning",
      "body": "usually with binging they won’t tell you to gain weight (unless of course you’re at a dangerously low weight) if you’re at a healthy weight right now they won’t tell you to gain any and a therapist will most likely not tell you, you have to gain weight thats more doctors and nutritionists (a nutritionist might help btw) \n\ni would look into therapy for this i think it would really help, i wish you the best of luck",
      "created_utc": 1605006815.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gbtd8lc",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1605003829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gby4lec",
      "author": "BestWesterChester",
      "body": "A good eating disorder therapist is worth seeing. Please see a specialist in ED; it’s worth the extra cost. \n\nOne tip that might help is to try maintaining your awareness of what you’re eating during a binge. Think about the taste, the chewing, the swallowing. If you can slower, go slower. You don’t have to stop or change anything, just be in the moment and pay attention to what you are doing. Best of luck to you.",
      "created_utc": 1605112180.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gby706s",
      "author": "pretendyourespecial",
      "body": "You definitely don't need to get back on track with anything except unrestricted eating. I was in your position last year and thought I'd traded one ED for another but as soon as I let go and started eating without restriction, things fell back into place.\n\nYou CAN handle gaining weight. I recommend megsyrecovery and What Mia did Next on YT, their vids helped me massively in my own recovery and I still go back to rewatch occasionally.\n\nIf I may ask, how did your ED begin? Why do you consider weight gain scary? If you analyze the reason why you fear weight gain so much, you can uncover the  underlying problem and attack it.",
      "created_utc": 1605113377.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gbw0grp",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1605056638.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gccl8ek",
      "author": "thatanonymousgirl22",
      "body": "I started dieting last year and throughout my weight loss phase I’ve been making really drastic changes. The first major one is going from absolutely hating every kind of vegetable to eating vegetables at every meal. The second is cutting out all processed meat and most processed foods which used to be part of my daily diet. The third is going fully vegan with no transition period. In less than a year I went from wanting to throw up every time I ate vegetables to going vegan and living off of vegetables.\n\nI used to only allow myself to eat unhealthy during vacations, and before quarantine I went on lots of vacations so I guess that stopped me from feeling restricted. However, now that I’m stuck at home everyday because of quarantine, I’ve been eating really “healthy” for months. At some point I realized it was unhealthy and so I decided to eat intuitively, but instead I ended up binging and this time I could no longer control myself.\n\nI fear weight gain because I’m an athlete and gaining a ton of weight, especially in the form of fat, will make me perform worse. I’m also really conscious of how I look and I’m scared people will judge me especially since some of them have seen my previous “healthy” diet.",
      "created_utc": 1605420051.0,
      "score": 2,
      "context": [
        {
          "id": "gby706s",
          "author": "pretendyourespecial",
          "body": "You definitely don't need to get back on track with anything except unrestricted eating. I was in your position last year and thought I'd traded one ED for another but as soon as I let go and started eating without restriction, things fell back into place.\n\nYou CAN handle gaining weight. I recommend megsyrecovery and What Mia did Next on YT, their vids helped me massively in my own recovery and I still go back to rewatch occasionally.\n\nIf I may ask, how did your ED begin? Why do you consider weight gain scary? If you analyze the reason why you fear weight gain so much, you can uncover the  underlying problem and attack it.",
          "created_utc": 1605113377.0
        }
      ]
    },
    {
      "id": "gccoatg",
      "author": "pretendyourespecial",
      "body": "Absolutely freaking NOT.\n\nYou're telling somebody with an eating disorder to further engage in restrictive behavior. What this will do, is make their body crave more food, **because they need it right now.**\n\nIf you genuinely think this is a good idea, please seek help and refrain from giving damaging advice on an ED subreddit.",
      "created_utc": 1605421427.0,
      "score": 2,
      "context": [
        {
          "id": "gbw0grp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1605056638.0
        }
      ]
    },
    {
      "id": "gccpzwa",
      "author": "pretendyourespecial",
      "body": "You say you've lost a lot of weight. This was my story, too, and I, like you, thought I was binging when I stopped restricting.\n\nWhat happened to us is not a binge. You just reached your breaking point and that is actually great.\n\nIt's a natural reaction of the body to want to get out of a severe deficit. Even if you aren't underweight by the BMI chart, you may be underweight for your body, which is just as bad! Let yourself eat unrestrictedly, only then will those moments where you can't stop... stop. You are on the right track! Please don't be afraid to let go of your food rules; only this will enable you to recover and live a full live again.\n\nBefore you started eating a lot, you were living in a state of chronic undereating. Like another poster mentioned, check out the Minnesota starvation study.\n\nThat is my experience. I only ate as you described until my hunger cues etc normalized, which wasn’t even that long.\n\nMore importantly, give yourself permission to eat. That way, you aren't always going to be taking in big quantities as food at once and feel guilty about it later.\n\nEating isn't something to be ashamed of or feel guilty about.\n\nPlease don’t listen to the person telling you to go on a juice cleanse. Prolonging your restriction will only keep you stuck in the restriction – craving big quantities of food cycle. I promise you things will normalize.\n\nI also started dieting and got an ED because I went too far but recovery didn’t make me overweight at all, not even remotely. I look good and feel good now. You aren’t going to go back to where you started.\n\nAbout sports: **Any** exercise while battling an eating disorder is a no-no, especially competitive sports. Look at it that way: sports are holding you back. There’s a big chance that you'll be able to return to sports after you're recovered. But recovery AND sports/exercise/sports competitions aren't compatible because they have goals that contradict each other.\n\nQuitting exercise/sports for now is a step in the right direction, despite what your ED and even your family and friends may be telling you. And you don’t have to quit forever if you’re honest with yourself on the road to recovery and do what it takes.\n\nLast but not least: talk to people who you think will judge you. Tell them about your problem. That way, they're less likely to judge and you're less likely to feel isolated. If people still judge, **they are the problem.**\n\nYou can always DM me for support; just keep in mind that I'm not a pro. \n\nDo you have your period still after the weight loss? (Sorry for the directness)\n\nDon’t be afraid of seeking professional help; just research the therapists you pick a lot.",
      "created_utc": 1605422237.0,
      "score": 1,
      "context": [
        {
          "id": "gby706s",
          "author": "pretendyourespecial",
          "body": "You definitely don't need to get back on track with anything except unrestricted eating. I was in your position last year and thought I'd traded one ED for another but as soon as I let go and started eating without restriction, things fell back into place.\n\nYou CAN handle gaining weight. I recommend megsyrecovery and What Mia did Next on YT, their vids helped me massively in my own recovery and I still go back to rewatch occasionally.\n\nIf I may ask, how did your ED begin? Why do you consider weight gain scary? If you analyze the reason why you fear weight gain so much, you can uncover the  underlying problem and attack it.",
          "created_utc": 1605113377.0
        },
        {
          "id": "gccl8ek",
          "author": "thatanonymousgirl22",
          "body": "I started dieting last year and throughout my weight loss phase I’ve been making really drastic changes. The first major one is going from absolutely hating every kind of vegetable to eating vegetables at every meal. The second is cutting out all processed meat and most processed foods which used to be part of my daily diet. The third is going fully vegan with no transition period. In less than a year I went from wanting to throw up every time I ate vegetables to going vegan and living off of vegetables.\n\nI used to only allow myself to eat unhealthy during vacations, and before quarantine I went on lots of vacations so I guess that stopped me from feeling restricted. However, now that I’m stuck at home everyday because of quarantine, I’ve been eating really “healthy” for months. At some point I realized it was unhealthy and so I decided to eat intuitively, but instead I ended up binging and this time I could no longer control myself.\n\nI fear weight gain because I’m an athlete and gaining a ton of weight, especially in the form of fat, will make me perform worse. I’m also really conscious of how I look and I’m scared people will judge me especially since some of them have seen my previous “healthy” diet.",
          "created_utc": 1605420051.0
        }
      ]
    },
    {
      "id": "gceaxqo",
      "author": "IECoach",
      "body": "Hi PretendYourSpecial,\n\nThanks for the comment! I can understand why you would feel this way IF I was asking her to restrict. \n\nThe OP states, \"I think developed a junk food addiction.\" She also states she's been bingeing every single day for a month. \n\nWhen we binge for this long our digestive systems become backed up and our connection to our bodies become NILL. \n\nHaving been here in the past myself, I understand the cycle being disconnected to our bodies bring. We eat, and eat, and eat, and eat. **The addiction to the food is all we feel.** \n\nCleansing the digestive system will help this. [(This technique is also done in actual centers.)](https://www.hawaiinaturopathicretreat.com/conditions/addiction/food-addiction/)\n\nWhat's worked for me here is to get everything moving. The easiest quickest way to do this is to start the day with fruit. NOT EAT ONLY FRUIT. Simply, **start the day with fruit.** \n\nNow, if the purpose is to move it through, eat the fruit wait two hours and then **eat regularly. No restriction advised at all in this or that post.** \n\nGive your digestive tract the space to move things through so that you can reconnect to the body once again. \n\nI don't think this will help, I KNOW this will help. One week where she is connecting to natural foods--water based foods first thing in the morning will **DISCONNECT** her from the need to eat junk food. [Digestion will help her feel calm.](https://www.webmd.com/a-to-z-guides/chronic-constipation-ease-stress) She will start to feel sane again. \n\nBut then, that's up to her to try. \n\nI hope this helped clear things up.",
      "created_utc": 1605454473.0,
      "score": 1,
      "context": [
        {
          "id": "gbw0grp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1605056638.0
        },
        {
          "id": "gccoatg",
          "author": "pretendyourespecial",
          "body": "Absolutely freaking NOT.\n\nYou're telling somebody with an eating disorder to further engage in restrictive behavior. What this will do, is make their body crave more food, **because they need it right now.**\n\nIf you genuinely think this is a good idea, please seek help and refrain from giving damaging advice on an ED subreddit.",
          "created_utc": 1605421427.0
        }
      ]
    },
    {
      "id": "gcgwlhx",
      "author": "thatanonymousgirl22",
      "body": "I’m not sure if it was because of my weight loss but I did lose my period for over 5 months which I then got back through meds.\n\nI’ve also heard of extreme hunger but when I compare myself to the stories of others who have gone through it, it feels like my restriction phase wasn’t “restrictive” enough to cause that. It feels like I’m just binging because I have no self control but I don’t know, maybe I’m just too harsh on myself.\n\nI’m finally considering seeking help though, just need to get the confidence to ask my parents now.",
      "created_utc": 1605505174.0,
      "score": 2,
      "context": [
        {
          "id": "gby706s",
          "author": "pretendyourespecial",
          "body": "You definitely don't need to get back on track with anything except unrestricted eating. I was in your position last year and thought I'd traded one ED for another but as soon as I let go and started eating without restriction, things fell back into place.\n\nYou CAN handle gaining weight. I recommend megsyrecovery and What Mia did Next on YT, their vids helped me massively in my own recovery and I still go back to rewatch occasionally.\n\nIf I may ask, how did your ED begin? Why do you consider weight gain scary? If you analyze the reason why you fear weight gain so much, you can uncover the  underlying problem and attack it.",
          "created_utc": 1605113377.0
        },
        {
          "id": "gccl8ek",
          "author": "thatanonymousgirl22",
          "body": "I started dieting last year and throughout my weight loss phase I’ve been making really drastic changes. The first major one is going from absolutely hating every kind of vegetable to eating vegetables at every meal. The second is cutting out all processed meat and most processed foods which used to be part of my daily diet. The third is going fully vegan with no transition period. In less than a year I went from wanting to throw up every time I ate vegetables to going vegan and living off of vegetables.\n\nI used to only allow myself to eat unhealthy during vacations, and before quarantine I went on lots of vacations so I guess that stopped me from feeling restricted. However, now that I’m stuck at home everyday because of quarantine, I’ve been eating really “healthy” for months. At some point I realized it was unhealthy and so I decided to eat intuitively, but instead I ended up binging and this time I could no longer control myself.\n\nI fear weight gain because I’m an athlete and gaining a ton of weight, especially in the form of fat, will make me perform worse. I’m also really conscious of how I look and I’m scared people will judge me especially since some of them have seen my previous “healthy” diet.",
          "created_utc": 1605420051.0
        },
        {
          "id": "gccpzwa",
          "author": "pretendyourespecial",
          "body": "You say you've lost a lot of weight. This was my story, too, and I, like you, thought I was binging when I stopped restricting.\n\nWhat happened to us is not a binge. You just reached your breaking point and that is actually great.\n\nIt's a natural reaction of the body to want to get out of a severe deficit. Even if you aren't underweight by the BMI chart, you may be underweight for your body, which is just as bad! Let yourself eat unrestrictedly, only then will those moments where you can't stop... stop. You are on the right track! Please don't be afraid to let go of your food rules; only this will enable you to recover and live a full live again.\n\nBefore you started eating a lot, you were living in a state of chronic undereating. Like another poster mentioned, check out the Minnesota starvation study.\n\nThat is my experience. I only ate as you described until my hunger cues etc normalized, which wasn’t even that long.\n\nMore importantly, give yourself permission to eat. That way, you aren't always going to be taking in big quantities as food at once and feel guilty about it later.\n\nEating isn't something to be ashamed of or feel guilty about.\n\nPlease don’t listen to the person telling you to go on a juice cleanse. Prolonging your restriction will only keep you stuck in the restriction – craving big quantities of food cycle. I promise you things will normalize.\n\nI also started dieting and got an ED because I went too far but recovery didn’t make me overweight at all, not even remotely. I look good and feel good now. You aren’t going to go back to where you started.\n\nAbout sports: **Any** exercise while battling an eating disorder is a no-no, especially competitive sports. Look at it that way: sports are holding you back. There’s a big chance that you'll be able to return to sports after you're recovered. But recovery AND sports/exercise/sports competitions aren't compatible because they have goals that contradict each other.\n\nQuitting exercise/sports for now is a step in the right direction, despite what your ED and even your family and friends may be telling you. And you don’t have to quit forever if you’re honest with yourself on the road to recovery and do what it takes.\n\nLast but not least: talk to people who you think will judge you. Tell them about your problem. That way, they're less likely to judge and you're less likely to feel isolated. If people still judge, **they are the problem.**\n\nYou can always DM me for support; just keep in mind that I'm not a pro. \n\nDo you have your period still after the weight loss? (Sorry for the directness)\n\nDon’t be afraid of seeking professional help; just research the therapists you pick a lot.",
          "created_utc": 1605422237.0
        }
      ]
    },
    {
      "id": "gcej7vy",
      "author": "pretendyourespecial",
      "body": "You don't take into account that she says she lost a lot of weight and has an obsession with eating in a healthy manner. She is also probably underweight and her \"binge-eating\" you're discouraging her from is a direct response to past restriction. She is panicking BECAUSE of her eating disorder telling her she needs to eat little and that she now has BED and can't control herself.\n\nIt's not addiction to junk food. She won't feel sane again UNLESS she lets her body get all the food it needs in whatever form for now. Then everything will normalize. But not if she tries to fight it doing some form of a cleanse which will only entrench her in her ED.",
      "created_utc": 1605459250.0,
      "score": 1,
      "context": [
        {
          "id": "gbw0grp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1605056638.0
        },
        {
          "id": "gccoatg",
          "author": "pretendyourespecial",
          "body": "Absolutely freaking NOT.\n\nYou're telling somebody with an eating disorder to further engage in restrictive behavior. What this will do, is make their body crave more food, **because they need it right now.**\n\nIf you genuinely think this is a good idea, please seek help and refrain from giving damaging advice on an ED subreddit.",
          "created_utc": 1605421427.0
        },
        {
          "id": "gceaxqo",
          "author": "IECoach",
          "body": "Hi PretendYourSpecial,\n\nThanks for the comment! I can understand why you would feel this way IF I was asking her to restrict. \n\nThe OP states, \"I think developed a junk food addiction.\" She also states she's been bingeing every single day for a month. \n\nWhen we binge for this long our digestive systems become backed up and our connection to our bodies become NILL. \n\nHaving been here in the past myself, I understand the cycle being disconnected to our bodies bring. We eat, and eat, and eat, and eat. **The addiction to the food is all we feel.** \n\nCleansing the digestive system will help this. [(This technique is also done in actual centers.)](https://www.hawaiinaturopathicretreat.com/conditions/addiction/food-addiction/)\n\nWhat's worked for me here is to get everything moving. The easiest quickest way to do this is to start the day with fruit. NOT EAT ONLY FRUIT. Simply, **start the day with fruit.** \n\nNow, if the purpose is to move it through, eat the fruit wait two hours and then **eat regularly. No restriction advised at all in this or that post.** \n\nGive your digestive tract the space to move things through so that you can reconnect to the body once again. \n\nI don't think this will help, I KNOW this will help. One week where she is connecting to natural foods--water based foods first thing in the morning will **DISCONNECT** her from the need to eat junk food. [Digestion will help her feel calm.](https://www.webmd.com/a-to-z-guides/chronic-constipation-ease-stress) She will start to feel sane again. \n\nBut then, that's up to her to try. \n\nI hope this helped clear things up.",
          "created_utc": 1605454473.0
        }
      ]
    },
    {
      "id": "gch0wlc",
      "author": "pretendyourespecial",
      "body": "> I’m not sure if it was because of my weight loss but I did lose my period for over 5 months which I then got back through meds. \n\nIt was probably because of your weight loss. It happened to me as well.\n\n> I’ve also heard of extreme hunger but when I compare myself to the stories of others who have gone through it, it feels like my restriction phase wasn’t “restrictive” enough to cause that.  \n\nThis is a classic trap of eating disorders: you never feel sick enough. Even when I couldn't get through a day of work, I though I wasn't sick enough and didn't deserve to recover. EDs aren't a competition; they are a deadly illness which will not let you live long or well if you don't kick its a$$ in time. You lost your period; you're afraid of weight gain; you're afraid of other people judging your weight gain; you are afraid of weight gain... You have all the signs of an ED! It doesn't matter how much weight you lost or whether you're underweight. You have an ED; you deserve to recover. Your pain is valid.\n\n> I’m finally considering seeking help though, just need to get the confidence to ask my parents now. \n\nI'm rooting for you! Keep us posted.",
      "created_utc": 1605508605.0,
      "score": 1,
      "context": [
        {
          "id": "gby706s",
          "author": "pretendyourespecial",
          "body": "You definitely don't need to get back on track with anything except unrestricted eating. I was in your position last year and thought I'd traded one ED for another but as soon as I let go and started eating without restriction, things fell back into place.\n\nYou CAN handle gaining weight. I recommend megsyrecovery and What Mia did Next on YT, their vids helped me massively in my own recovery and I still go back to rewatch occasionally.\n\nIf I may ask, how did your ED begin? Why do you consider weight gain scary? If you analyze the reason why you fear weight gain so much, you can uncover the  underlying problem and attack it.",
          "created_utc": 1605113377.0
        },
        {
          "id": "gccl8ek",
          "author": "thatanonymousgirl22",
          "body": "I started dieting last year and throughout my weight loss phase I’ve been making really drastic changes. The first major one is going from absolutely hating every kind of vegetable to eating vegetables at every meal. The second is cutting out all processed meat and most processed foods which used to be part of my daily diet. The third is going fully vegan with no transition period. In less than a year I went from wanting to throw up every time I ate vegetables to going vegan and living off of vegetables.\n\nI used to only allow myself to eat unhealthy during vacations, and before quarantine I went on lots of vacations so I guess that stopped me from feeling restricted. However, now that I’m stuck at home everyday because of quarantine, I’ve been eating really “healthy” for months. At some point I realized it was unhealthy and so I decided to eat intuitively, but instead I ended up binging and this time I could no longer control myself.\n\nI fear weight gain because I’m an athlete and gaining a ton of weight, especially in the form of fat, will make me perform worse. I’m also really conscious of how I look and I’m scared people will judge me especially since some of them have seen my previous “healthy” diet.",
          "created_utc": 1605420051.0
        },
        {
          "id": "gccpzwa",
          "author": "pretendyourespecial",
          "body": "You say you've lost a lot of weight. This was my story, too, and I, like you, thought I was binging when I stopped restricting.\n\nWhat happened to us is not a binge. You just reached your breaking point and that is actually great.\n\nIt's a natural reaction of the body to want to get out of a severe deficit. Even if you aren't underweight by the BMI chart, you may be underweight for your body, which is just as bad! Let yourself eat unrestrictedly, only then will those moments where you can't stop... stop. You are on the right track! Please don't be afraid to let go of your food rules; only this will enable you to recover and live a full live again.\n\nBefore you started eating a lot, you were living in a state of chronic undereating. Like another poster mentioned, check out the Minnesota starvation study.\n\nThat is my experience. I only ate as you described until my hunger cues etc normalized, which wasn’t even that long.\n\nMore importantly, give yourself permission to eat. That way, you aren't always going to be taking in big quantities as food at once and feel guilty about it later.\n\nEating isn't something to be ashamed of or feel guilty about.\n\nPlease don’t listen to the person telling you to go on a juice cleanse. Prolonging your restriction will only keep you stuck in the restriction – craving big quantities of food cycle. I promise you things will normalize.\n\nI also started dieting and got an ED because I went too far but recovery didn’t make me overweight at all, not even remotely. I look good and feel good now. You aren’t going to go back to where you started.\n\nAbout sports: **Any** exercise while battling an eating disorder is a no-no, especially competitive sports. Look at it that way: sports are holding you back. There’s a big chance that you'll be able to return to sports after you're recovered. But recovery AND sports/exercise/sports competitions aren't compatible because they have goals that contradict each other.\n\nQuitting exercise/sports for now is a step in the right direction, despite what your ED and even your family and friends may be telling you. And you don’t have to quit forever if you’re honest with yourself on the road to recovery and do what it takes.\n\nLast but not least: talk to people who you think will judge you. Tell them about your problem. That way, they're less likely to judge and you're less likely to feel isolated. If people still judge, **they are the problem.**\n\nYou can always DM me for support; just keep in mind that I'm not a pro. \n\nDo you have your period still after the weight loss? (Sorry for the directness)\n\nDon’t be afraid of seeking professional help; just research the therapists you pick a lot.",
          "created_utc": 1605422237.0
        },
        {
          "id": "gcgwlhx",
          "author": "thatanonymousgirl22",
          "body": "I’m not sure if it was because of my weight loss but I did lose my period for over 5 months which I then got back through meds.\n\nI’ve also heard of extreme hunger but when I compare myself to the stories of others who have gone through it, it feels like my restriction phase wasn’t “restrictive” enough to cause that. It feels like I’m just binging because I have no self control but I don’t know, maybe I’m just too harsh on myself.\n\nI’m finally considering seeking help though, just need to get the confidence to ask my parents now.",
          "created_utc": 1605505174.0
        }
      ]
    },
    {
      "id": "gcg4q8b",
      "author": "IECoach",
      "body": "\" She says she lost a lot of weight and has an obsession with eating in a healthy manner. \"\n\nI don't see that in her OP. I think I'm missing something? \n\n\"She is also probably underweight and her \"binge-eating\" you're discouraging her from..\" \n\nI'm sorry--I don't see me discouraging her from bingeing either. I'm lost. \n\nEither way, I hope I was able to clear up what my first post was about. \n\n--Martita",
      "created_utc": 1605489096.0,
      "score": 1,
      "context": [
        {
          "id": "gbw0grp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1605056638.0
        },
        {
          "id": "gccoatg",
          "author": "pretendyourespecial",
          "body": "Absolutely freaking NOT.\n\nYou're telling somebody with an eating disorder to further engage in restrictive behavior. What this will do, is make their body crave more food, **because they need it right now.**\n\nIf you genuinely think this is a good idea, please seek help and refrain from giving damaging advice on an ED subreddit.",
          "created_utc": 1605421427.0
        },
        {
          "id": "gceaxqo",
          "author": "IECoach",
          "body": "Hi PretendYourSpecial,\n\nThanks for the comment! I can understand why you would feel this way IF I was asking her to restrict. \n\nThe OP states, \"I think developed a junk food addiction.\" She also states she's been bingeing every single day for a month. \n\nWhen we binge for this long our digestive systems become backed up and our connection to our bodies become NILL. \n\nHaving been here in the past myself, I understand the cycle being disconnected to our bodies bring. We eat, and eat, and eat, and eat. **The addiction to the food is all we feel.** \n\nCleansing the digestive system will help this. [(This technique is also done in actual centers.)](https://www.hawaiinaturopathicretreat.com/conditions/addiction/food-addiction/)\n\nWhat's worked for me here is to get everything moving. The easiest quickest way to do this is to start the day with fruit. NOT EAT ONLY FRUIT. Simply, **start the day with fruit.** \n\nNow, if the purpose is to move it through, eat the fruit wait two hours and then **eat regularly. No restriction advised at all in this or that post.** \n\nGive your digestive tract the space to move things through so that you can reconnect to the body once again. \n\nI don't think this will help, I KNOW this will help. One week where she is connecting to natural foods--water based foods first thing in the morning will **DISCONNECT** her from the need to eat junk food. [Digestion will help her feel calm.](https://www.webmd.com/a-to-z-guides/chronic-constipation-ease-stress) She will start to feel sane again. \n\nBut then, that's up to her to try. \n\nI hope this helped clear things up.",
          "created_utc": 1605454473.0
        },
        {
          "id": "gcej7vy",
          "author": "pretendyourespecial",
          "body": "You don't take into account that she says she lost a lot of weight and has an obsession with eating in a healthy manner. She is also probably underweight and her \"binge-eating\" you're discouraging her from is a direct response to past restriction. She is panicking BECAUSE of her eating disorder telling her she needs to eat little and that she now has BED and can't control herself.\n\nIt's not addiction to junk food. She won't feel sane again UNLESS she lets her body get all the food it needs in whatever form for now. Then everything will normalize. But not if she tries to fight it doing some form of a cleanse which will only entrench her in her ED.",
          "created_utc": 1605459250.0
        }
      ]
    },
    {
      "id": "gch11yn",
      "author": "thatanonymousgirl22",
      "body": "Thank you so much! Will do 🙂",
      "created_utc": 1605508729.0,
      "score": 2,
      "context": [
        {
          "id": "gby706s",
          "author": "pretendyourespecial",
          "body": "You definitely don't need to get back on track with anything except unrestricted eating. I was in your position last year and thought I'd traded one ED for another but as soon as I let go and started eating without restriction, things fell back into place.\n\nYou CAN handle gaining weight. I recommend megsyrecovery and What Mia did Next on YT, their vids helped me massively in my own recovery and I still go back to rewatch occasionally.\n\nIf I may ask, how did your ED begin? Why do you consider weight gain scary? If you analyze the reason why you fear weight gain so much, you can uncover the  underlying problem and attack it.",
          "created_utc": 1605113377.0
        },
        {
          "id": "gccl8ek",
          "author": "thatanonymousgirl22",
          "body": "I started dieting last year and throughout my weight loss phase I’ve been making really drastic changes. The first major one is going from absolutely hating every kind of vegetable to eating vegetables at every meal. The second is cutting out all processed meat and most processed foods which used to be part of my daily diet. The third is going fully vegan with no transition period. In less than a year I went from wanting to throw up every time I ate vegetables to going vegan and living off of vegetables.\n\nI used to only allow myself to eat unhealthy during vacations, and before quarantine I went on lots of vacations so I guess that stopped me from feeling restricted. However, now that I’m stuck at home everyday because of quarantine, I’ve been eating really “healthy” for months. At some point I realized it was unhealthy and so I decided to eat intuitively, but instead I ended up binging and this time I could no longer control myself.\n\nI fear weight gain because I’m an athlete and gaining a ton of weight, especially in the form of fat, will make me perform worse. I’m also really conscious of how I look and I’m scared people will judge me especially since some of them have seen my previous “healthy” diet.",
          "created_utc": 1605420051.0
        },
        {
          "id": "gccpzwa",
          "author": "pretendyourespecial",
          "body": "You say you've lost a lot of weight. This was my story, too, and I, like you, thought I was binging when I stopped restricting.\n\nWhat happened to us is not a binge. You just reached your breaking point and that is actually great.\n\nIt's a natural reaction of the body to want to get out of a severe deficit. Even if you aren't underweight by the BMI chart, you may be underweight for your body, which is just as bad! Let yourself eat unrestrictedly, only then will those moments where you can't stop... stop. You are on the right track! Please don't be afraid to let go of your food rules; only this will enable you to recover and live a full live again.\n\nBefore you started eating a lot, you were living in a state of chronic undereating. Like another poster mentioned, check out the Minnesota starvation study.\n\nThat is my experience. I only ate as you described until my hunger cues etc normalized, which wasn’t even that long.\n\nMore importantly, give yourself permission to eat. That way, you aren't always going to be taking in big quantities as food at once and feel guilty about it later.\n\nEating isn't something to be ashamed of or feel guilty about.\n\nPlease don’t listen to the person telling you to go on a juice cleanse. Prolonging your restriction will only keep you stuck in the restriction – craving big quantities of food cycle. I promise you things will normalize.\n\nI also started dieting and got an ED because I went too far but recovery didn’t make me overweight at all, not even remotely. I look good and feel good now. You aren’t going to go back to where you started.\n\nAbout sports: **Any** exercise while battling an eating disorder is a no-no, especially competitive sports. Look at it that way: sports are holding you back. There’s a big chance that you'll be able to return to sports after you're recovered. But recovery AND sports/exercise/sports competitions aren't compatible because they have goals that contradict each other.\n\nQuitting exercise/sports for now is a step in the right direction, despite what your ED and even your family and friends may be telling you. And you don’t have to quit forever if you’re honest with yourself on the road to recovery and do what it takes.\n\nLast but not least: talk to people who you think will judge you. Tell them about your problem. That way, they're less likely to judge and you're less likely to feel isolated. If people still judge, **they are the problem.**\n\nYou can always DM me for support; just keep in mind that I'm not a pro. \n\nDo you have your period still after the weight loss? (Sorry for the directness)\n\nDon’t be afraid of seeking professional help; just research the therapists you pick a lot.",
          "created_utc": 1605422237.0
        },
        {
          "id": "gcgwlhx",
          "author": "thatanonymousgirl22",
          "body": "I’m not sure if it was because of my weight loss but I did lose my period for over 5 months which I then got back through meds.\n\nI’ve also heard of extreme hunger but when I compare myself to the stories of others who have gone through it, it feels like my restriction phase wasn’t “restrictive” enough to cause that. It feels like I’m just binging because I have no self control but I don’t know, maybe I’m just too harsh on myself.\n\nI’m finally considering seeking help though, just need to get the confidence to ask my parents now.",
          "created_utc": 1605505174.0
        },
        {
          "id": "gch0wlc",
          "author": "pretendyourespecial",
          "body": "> I’m not sure if it was because of my weight loss but I did lose my period for over 5 months which I then got back through meds. \n\nIt was probably because of your weight loss. It happened to me as well.\n\n> I’ve also heard of extreme hunger but when I compare myself to the stories of others who have gone through it, it feels like my restriction phase wasn’t “restrictive” enough to cause that.  \n\nThis is a classic trap of eating disorders: you never feel sick enough. Even when I couldn't get through a day of work, I though I wasn't sick enough and didn't deserve to recover. EDs aren't a competition; they are a deadly illness which will not let you live long or well if you don't kick its a$$ in time. You lost your period; you're afraid of weight gain; you're afraid of other people judging your weight gain; you are afraid of weight gain... You have all the signs of an ED! It doesn't matter how much weight you lost or whether you're underweight. You have an ED; you deserve to recover. Your pain is valid.\n\n> I’m finally considering seeking help though, just need to get the confidence to ask my parents now. \n\nI'm rooting for you! Keep us posted.",
          "created_utc": 1605508605.0
        }
      ]
    }
  ]
}