{
  "id": "jtevhg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1605263806.0,
  "title": "Request: worried about my girlfriend and her eating.",
  "selftext": " \n\nI’m (20 NB) am worried about my girlfriend (19 MtF) and her eating.\n\nFor some background, My girlfriend is a pre-transition trans woman. she came out as trans a few years ago, but she hasn’t been able to go to any sort of therapy. At first, this was because she couldn’t afford it. Now it’s because she not only is a full time student, but also works full time. She is hypoglycemic (I don’t know if this is diagnosed by a doctor, but she said she had hypoglycemia). She also has quite a bit of trauma related to her upbringing. She volunteered at a hospital for many years, and grew to believe that it is rude to eat in front of other people. She also believes it is rude to ask someone for food, or to take a second helping of food at a meal. I often have to make her eat by eating with her. (This is a problem for me, because I have gastric sleeve surgery, and can not eat a lot of food.) Often when she eats at my house, she will only take a small amount of food and later mention that she was hungry, but then when I try to get her to eat she refuses.\n\nShe’s never been great about eating enough, but she recently got a new job where she is less active, and someone made a comment that she had started gaining a small amount of weight. Since she has started this new job, it has become even harder for me to get her to eat, and on days that we are not together (because of her schedule, i only really get to see her on weekends), she will mention that she has only eaten 1 or 2 things through the day.\n\nToday we were talking on her way to work, and she mentioned that she was hungry and that she hadn’t eaten all day. I told her she should stop and get something to eat, as her work wouldn’t be upset if she was a few minutes late (and they wouldn’t be). She said no, and that her work ethic is more important her her than her health. I offered to send food to her work so she could eat during her break, but she told me not to, saying that she wouldn’t be allowed to bring it in and that she was fine.\n\nI brought up that I was worried about her eating, and she denied it. In her eyes, she thinks that she eats in a healthy way. I don’t know how to help her. I’m worried one day she’s going to go too long without eating and faint while she’s driving or woodworking. How can I show her that she isn’t being healthy?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jtevhg/request_worried_about_my_girlfriend_and_her_eating/",
  "score": 39,
  "num_comments": 3,
  "comments": [
    {
      "id": "gc5a54x",
      "author": "DragonflyStunning",
      "body": " you tell her she needs help because you cannot help her, that you hate seeing her do this to herself. mention some treatment options, like free group therapy, or a nutritionist, therapist etc. if she doesn’t want treatment there’s not much you can do as you can’t force her to do anything, but you can set boundaries, you can tell her you don’t want to hear about her starving herself, about her weight and stuff because that’s fueling her ed. \n\nif she says she hasn’t eaten all day you can ask her “what can i do to help?” instead of making her try to eat.\nyou have to decide if this is what you wanna deal with tho, because eds don’t go away after time, you have to think to yourself if you can handle her talking about her weight all the time while actively engaging in her ed and not receiving help. \n\nyou can use “I” statements like “i noticed you aren’t eating dinner anymore”, “i’ve noticed some unhealthy habits such as....” dont bring up her weight or anything to with size and stuff, try not to say “you’re doing this and this” because it sounds like blaming and can make her defensive. \n\nhope this helped a little good luck",
      "created_utc": 1605269618.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gc54ixf",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1605263807.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gc81bq5",
      "author": "enord11400",
      "body": "Most likely she will not see any of this as an issue and probably a part of her really likes doing this. You can put crackers/hard candies in her glove box and tell her that you are worried about her hypoglycemia with driving since she seems to believe that is a real medical issue. A friend of mine has it and recently passed out at the wheel. It can be serious especially combined with disordered eating habits that lead to skipped meals. I know carrot sticks can be a good alternative while at home or work since vegetables can be easier if this is about weight(but she could try to use them as a meal). Obviously you can not make her eat them but if she has them there already then she might use them but never comment on it if she does unless she brings it up. \n\nAlso, She probably won’t want to spend money on food while out either so try to have snacks she can grab or you can put in her bag just in case. I can’t really explain why this is except to say that people with restrictive tendencies tend to apply them to all parts of their lives. It can be seen clearly in finances where people will not buy things (or will agonize over the decision) even if they need something and have plenty of money/can afford it. You can also see it socially in the way she is reserved (at least related to food like you described.) If she doesn’t have a full blown ED already she is at risk, but sadly there is not much you can do other than try to be there for her and have food available for her if she decides to eat. Also pay very close attention to any complaints of chest pains/heart flutters or fainting as that can tell you that there are some really issues happening. Encourage her to go to her GP about any issues and don’t be afraid to take her to the hospital if you are ever really concerned about acute issues like fainting. You do not have to be underweight to die of ED complications. I hope things get better for her and you find some way to help.",
      "created_utc": 1605325935.0,
      "score": 1,
      "context": []
    }
  ]
}