{
  "id": "ju3zzc",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1605369169.0,
  "title": "Request: Post request: how can I stop binging/purging when I’m stressed?",
  "selftext": "hello. So, my problem started developing when I was a young child, (I’m not diagnosed because I have never told anyone about my mental health, but I’m certain this is an eating disorder) basically, my family grew up very very poor, so we rarely had any food in the house. This situation did get better over time and a few years before I was a teen, we had food pretty much all the time. But we were still going through a lot of drama/trauma, and several family deaths. So, i ate. I guess it was comforting thinking “atleast I have food”.  I started gaining and it caused horrible bullying, but I couldn’t stop eating because it gave me comfort. So I started purging. This quickly resulted in my binging severely when I had any kind of stress/ any other kind of emotion that I didn’t like. So I would binge and purge several times in a single day, then I started restricting so I wouldn’t gain, then I got scared that I couldn’t have food so I would binge again and just start the cycle over again. I’m an adult now in my own place, and unfortunately still struggling. Not as badly, but it’s clearly still a problem. Anytime I have even a minor argument with anyone, someone is sick, something going on at my school, something at work, my immediate reaction is binge and purge. Again. I hate myself for it,  but I still can’t stop. I’ve tried everything I can think of but I always end up back in that horrible place that I just have to. I hate myself. I have to stop this. Please help me stop.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ju3zzc/request_post_request_how_can_i_stop/",
  "score": 39,
  "num_comments": 4,
  "comments": [
    {
      "id": "gc9gefr",
      "author": "sydneynicolet",
      "body": "Have you ever thought of going to an eating disorder anonymous meeting? Or reading their eda 12 step book?",
      "created_utc": 1605370552.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gc9metq",
      "author": "daniellelife",
      "body": "in my experience, i totally understand this. I felt like when I got stressed or ate too much or I couldn’t relax or do literally anything until I purged it was crippling. but distracting myself was really important and mostly having people around was important too. It’s not easy but you have to push yourself not to do it. The less you purge, the less there’s an urge. and the more you purge the more you urge. so it’s really important to cut at least a couple days out at first and slowly make your way down to 0. I promise the need to purge does go away. there was a lot of ups and downs on my journey as well but it does get better",
      "created_utc": 1605373996.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gc9e34w",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1605369169.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gccvrbw",
      "author": "enord11400",
      "body": "There are a few thing you can try until a time comes when you can get some professional help since I think limited access to food early in childhood is a common trigger of bingeing and you have to work on that in therapy. In the meantime...\n\nTry delaying behaviors if you can. Even if it is only for 1 minute. Make yourself wait as long as you can. You can do this before a binge and/or before purging. You will not die during this waiting period. It feels horrible to sit with the feelings but you have to realize that they can not actually hurt you. I believe during therapy I was told that most intense emotions lessen within 20 min to 2 hours so if you can build up to this much of a wait then you greatly improve your chances of avoiding those behaviors. This requires a lot of mental effort though and it is okay if you can’t make it through the wait every time but every time that you do makes you more likely to make it the next time as you’re disrupting the behavioral feedback loop. \n\nTry to find a short activity to fill this time and even better if it can be extended into something longer. You could browse non-ed related Reddit pages or play a phone game or put on one episode of a light hearted tv show or call/text a supportive friend (even if you don’t discuss the ed situation). The biggest point is to create space between the stressor and your reaction to give yourself a chance to think about if the behavior is really going to help the actual thing causing you stress or not.",
      "created_utc": 1605425311.0,
      "score": 1,
      "context": []
    }
  ]
}