{
  "id": "jvrcen",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1605612026.0,
  "title": "Request: How to lose weight without triggering myself",
  "selftext": " \n\nI’m having a really hard time not giving in to my urges. I wanted to post this to see if anybody had some advice.\n\nI’ve  been in recovery for a bit over three years. Only reason I stopped was  because I got pregnant. I gained a lot of weight during pregnancy, still have a  lot of it. I’m struggling not to give back in and start up again. I’m  falling back into more restrictive eating patterns and every time I  loose a little bit of weight, it gets worse. I can’t lose weight without  triggering myself but I can’t stay the same either. Any advice or words  of comfort? ☹️",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jvrcen/request_how_to_lose_weight_without_triggering/",
  "score": 63,
  "num_comments": 24,
  "comments": [
    {
      "id": "gcln6wv",
      "author": "None",
      "body": "Talk to your medical health professional. \n\nI'm in the same boat as you. Restriction and food rules are a trigger.  My advice is to do things that you enjoy, and would do even if it had no effect on weight loss or weight gain. I learned how to cook plant-based meals. I took up weight lifting before the pandemic started. I do yoga. Some days are easier than others.",
      "created_utc": 1605612579.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gclpsyq",
      "author": "elliebethanynorton",
      "body": "For me in my area it's really hard to get professional help. I'm no expert and still struggle a lot but these are things I know help me: \n\n- Try to be good to your body and respect it. Feed it foods that make it happy rather than things that you personally tell yourself is acceptable. I.e telling yourself NO CARBS ALLOWED just have things in moderation like your body actually wants. If you don't know too much about it there's lots of information online about what you should eat in a day. Your mood will probably improve naturally too which will help the way you think about things! \n\n- Stay away from checking yourself in the mirror to look for body changes. I know it's easier said than done but really try, it takes some pressure off. Then anything positive that comes will be a nice surprise rather than waiting and punishing yourself to try and get to a certain point. \n\n- Try to find some healthy recipes or exercises that you actually enjoy. Overall you want to try and look at the whole weight loss thing in a more positive, fun and rewarding way. \n\nWith eating disorders you put an enormous amount of pressure on yourself and it's so draining and tiring. Love yourself as best you can because you have one life, fuck what anyone thinks. We don't realise that actually people don't look at us half as much as we think they do, it's sort of one of those things our eating disorders tell us to keep us under. \n\nGood luck I wish you all the very best x",
      "created_utc": 1605615060.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gcnrsaj",
      "author": "momunist",
      "body": "I know this isn’t what you want to hear, but there isn’t a way to intentionally lose weight without triggering yourself. Any attempt at intentionally losing weight will be triggering to someone with an eating disorder. \n\nSo what to do? Like you said, you have pregnancy weight you’re hoping to lose. What I would recommend is getting rid of the weight loss goals entirely and focus on eating intuitively, making decisions to engage in healthy habits, and work on losing any preoccupation with regaining your pre-baby body. Your body is never going to look like it did before you were pregnant, and that is NORMAL. Bodies change. Anyone who tells you differently is selling something. \n\nYou can read more about intuitive eating, it’s the best method of eating disorder recovery. It takes a lot of practice, and it can be scary and uncomfortable in the beginning, but it’s a small price to pay for true recovery from eating disorders. It requires giving up goals of weight loss, giving up categorizing foods as “good” or “bad”, and giving up guilt about how much or what you eat. \n\nHow is this healthy? Because once you stop restricting yourself from certain foods, they lose their appeal. Yes, when you first start intuitive eating, you’ll probably eat more desserts (or just eat more). This is a necessary part of the process. Your body has to learn that it’s *allowed* to eat what it wants. You have to learn not to feel guilty for what you eat. You have to learn to listen to your body. It sounds too good to be true, but it works.\n\nInstead of making weight loss your goal, why not make health a goal? Instead of making choices with weight loss in mind, make choices with your health in mind. Get in exercise because it makes your body feel good and it’s good for your heart instead of because you want to lose weight. You might lose weight anyway, but it’s not guaranteed. (It’s never guaranteed, even when weight loss is your goal.) But if weight loss isn’t your goal, just health, you vastly reduce your risk of triggering yourself.",
      "created_utc": 1605652867.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gcmecj5",
      "author": "notyouraverage924",
      "body": "Lift weights. Dont be afraid of lifting weights. You will lose weight. Or resistance training. HITT workouts are really effective without taking all day so you can enjoy your baby.\n\nDont hate on your body it took 10 months to gain. Give it time to come off.",
      "created_utc": 1605629891.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gcoqxkf",
      "author": "bellasuperstring",
      "body": "If you have an eating disorder there is absolutely no way to simultaneously restrict and not fall back into old behaviors. You must give up this idea. And to be clear, the disordered eating will always come back when you invite it in. \n\nAn alternative approach may be to think of a \"diet\" more as the typical foods you regularly consume, and not so much as a set of restrictions, rules, or planning meals with a certain portion size or number of calories. \n\nEspecially when we are with our families, I think it is easy to repeatedly eat foods which tend to lack nutrients. If you're making sure you get the foundation foods that really feed your body well, you're going to feel better and probably notice your body function more efficiently. But again, in my mind this is not based at all on restriction. I still eat whatever, but I always try to get several servings of fresh fruit, veggies, and protein. If I want more and can still get those things I don't worry about it.\n\nWhat we are is what we do repeatedly. If you make it a habit to get more nutrient rich foods (vitamins and minerals) as the core of what you eat, whatever else you may enjoy won't be as impactful and you may even feel less need for restriction or binging, and less stressed about it.\n\nDon't \"diet.\" Don't weigh yourself. Those things just invite bad habits. Think of all the positive changes you have made. Know that your body, that has gotten you this far and given you your child. It is strong and good and deserves to be loved on. Eating well is an act of love for yourself and your family. Moving your body in ways that you *enjoy* and *feel good* is also an act of love. Taking care of your mental/emotional health is an act of love. It won't change your body shape, or mood, or make you wealthy and able to leape tall buildings in a single bound, but doing these things repeatedly most of the time will make you feel better and better most of the time. \n\nWhenever in doubt, talk to your trusted therapist or medical professional. Lots of love to you!",
      "created_utc": 1605672670.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gco3z2d",
      "author": "OnlyGenz",
      "body": "My tips\n\n- DON’T track calories, this will most likely make you relapse\n\n- DON’T look at labels\n\n- DO exercise, just do a healthy amount. 30 minutes- 1 hour a day 3/4 times a week\n\n- DO allow your self to eat less nutritious foods. \n\n- DON’T label foods as healthy or non healthy, bad or good, junk or clean. All food is good for you.\n\nHope this helps. If you ever find that you are going down the path again, stop. Stop doing everything and wait until your ready. Every body size can be healthy.",
      "created_utc": 1605659467.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gclthgp",
      "author": "unicornbaby23",
      "body": "If I could recommend the book, Savor by Thich Naht Han. A really small book on how to change your relationship with eating, and become more mindful of the experience.",
      "created_utc": 1605618055.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gcoemo7",
      "author": "sweetparamour79",
      "body": "Personally I got a coach with a holistic approach. \nShe is online but she give me macros/training schedules, monitor my biofeedback +checks in weekly and has been really great with helping me manage my anxiety. \n\nI don't know if I could do this without her, she is setting me up with new life long habits that are realistic. No cutting out foods etc. I am literally eating a cheeseburger right now with no anxiety... I couldn't do that before her.",
      "created_utc": 1605665438.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gcq76dr",
      "author": "Young_Uncle",
      "body": "If you can afford it, talk to a nutritionist. Not all, but some, are actually really good in situations like this as they're big on mental health surrounding food, not just physical. Avoid the gym bro nutritionists, and definitely don't go to a physical trainer. Try to find a specialist.",
      "created_utc": 1605714296.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gcmqc3f",
      "author": "TravelbugRunner",
      "body": "For me personally the best way to lose weight without triggering yourself is by not using a scale. \n\nEat, exercise, and use clothing size as an indicator or your progress. \n\nI know that if I use a scale I get really obsessed and crazy about making the number go lower even if I’m at a healthy or normal weight. It just makes me want to be focused on the number instead of health. \n\nAnd so far I’ve managed to keep myself healthy and I haven’t relapsed into my ED behaviors. I won’t use a scale again and I won’t even have the nurse or doctor divulge the number to me.",
      "created_utc": 1605635409.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gclrtx1",
      "author": "jeabgrenouille",
      "body": "I reccomend following Jordan Syatt. He is someone who discusses weight loss in the simplest and most objective way possible. He takes all the guilt out and talks about how to lose weight, how to weigh yourself (whenever he is actively losing weight, we will show him weighing himself and show how the numbers trend. I find that super helpful because he shows how your weight can spike and \"woosh\" downward and that is the process.) He is very no bs. I like him a lot.",
      "created_utc": 1605616778.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gclp9wf",
      "author": "Party_Tohks",
      "body": "How about consulting a medical specialist for safe weight loss?",
      "created_utc": 1605614572.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gcm8drd",
      "author": "wtfiswrongwithme17",
      "body": "Hey I am suffer from an ed , i usually try to workout but i get busy a lot due to school so here's a workout that's fun and not too difficult and would prob not trigger you - [https://www.youtube.com/watch?v=SoRmqE7A\\_IE](https://www.youtube.com/watch?v=SoRmqE7A_IE)",
      "created_utc": 1605626970.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gclmnf8",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1605612026.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gcmlokz",
      "author": "Ditz3n",
      "body": "\\+1 on this comment! You only have 1 life here on earth! You were born for a reason, and that was TO BE \"YOU\". No one else can be like you! Even if nobody tells you, that you're good enough, it's always a good reminder that you were born for a reason! Don't waste your time being sad/tired, when you can have an amazing life with energy and a great mood! <3",
      "created_utc": 1605633287.0,
      "score": 4,
      "context": [
        {
          "id": "gclpsyq",
          "author": "elliebethanynorton",
          "body": "For me in my area it's really hard to get professional help. I'm no expert and still struggle a lot but these are things I know help me: \n\n- Try to be good to your body and respect it. Feed it foods that make it happy rather than things that you personally tell yourself is acceptable. I.e telling yourself NO CARBS ALLOWED just have things in moderation like your body actually wants. If you don't know too much about it there's lots of information online about what you should eat in a day. Your mood will probably improve naturally too which will help the way you think about things! \n\n- Stay away from checking yourself in the mirror to look for body changes. I know it's easier said than done but really try, it takes some pressure off. Then anything positive that comes will be a nice surprise rather than waiting and punishing yourself to try and get to a certain point. \n\n- Try to find some healthy recipes or exercises that you actually enjoy. Overall you want to try and look at the whole weight loss thing in a more positive, fun and rewarding way. \n\nWith eating disorders you put an enormous amount of pressure on yourself and it's so draining and tiring. Love yourself as best you can because you have one life, fuck what anyone thinks. We don't realise that actually people don't look at us half as much as we think they do, it's sort of one of those things our eating disorders tell us to keep us under. \n\nGood luck I wish you all the very best x",
          "created_utc": 1605615060.0
        }
      ]
    }
  ]
}