{
  "id": "jx0m25",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1605782943.0,
  "title": "Request: Post request. starved as a child, now always hungry.",
  "selftext": "When I was young (4-13) my father had custody of us. He bought drugs and alcohol, but rarely food. He often sold his foodstamps, so my brother and I walked home with food from the church and that was often our only way to eat, aside from hot dogs and bologna. \n\nI remember eating pebbles, lemon grass and clover flowers... I shoplifted and stole bird seed from the neighbor's feeders. I often traveled in search of food outside, even dumpster diving at the stores. Summers were rough, because that was the end of school lunches. \n\nWhen I was 13, mom got custody... Which was for the best! I was finally safe! But we both tried to make up for years lost, in food. She knew we went though hell so she'd get us whatever we wanted to eat. I was eating huge amounts of food, any hour of the day/night. I could sit and eat 4 packs of ramen, my own medium pizza even. It was never enough. My brother and I even started fighting over food when things got a bit scarce. I tripled my weight in a couple years.\n\nNow I'm 27, I've attempted to get help over the years of therapy, but I still have food insecurity. I've become severely diabetic and the injections aren't helping. \n\nMy doctor has told me I need to go vegan... Has told me to cut my plate size. Told me to limit myself. But has also told me she doesn't want to help me in ways until I \"try harder\" and lose weight. \n\nI've cut my eating in half- even moreso. I don't eat after 10pm (my husband gets off work at 10pm, so I can't eat sooner) I cut all sweets and don't drink any sugar. My doctor doesn't believe me. She suggested getting the belly band, but only if I \"try harder\".\n\nToday I ate grapes for breakfast, 2 slices of pizza for lunch, and carrots and lite ranch for a snack. My sugar is WAY HIGH... (Typical)\n\nI just don't know what to do. I'm so hungry, I have no energy, no self esteem... I was doing better when I was going to physical therapy and getting my spine injections, but haven't gone since the virus got worse (my community is anti science, anti mask. A lot of cases)  \n\nI'm sick of hating myself. I'm always afraid my husband is gonna fall in love with a pretty woman. \n\nWhat can I do? What helped you?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jx0m25/request_post_request_starved_as_a_child_now/",
  "score": 70,
  "num_comments": 20,
  "comments": [
    {
      "id": "gcthd4r",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1605783743.0,
      "score": 62,
      "context": []
    },
    {
      "id": "gctmufh",
      "author": "Gumnutbaby",
      "body": "Standard advice for someone diabetic is to cut carbs, not ain all products. Unless you are eating very high portions of meats they don’t affect your blood glucose.   \n\n\nI’d definitely encourage you to have a chat to a trained professional. It’s part of diabetes management, but you’ll also need it for your relationship with food.\n\n&#x200B;\n\nand can I also add, I’m really sorry to hear about your history, and it’s amazing you have survived and come out the other side. Please don’t let it define you, it’s part of your story, but not all of it.",
      "created_utc": 1605788904.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gctpnt4",
      "author": "mud_octopus",
      "body": "Can you see a dietician/nutritionist? (As well as a therapist.)\n\nThe day you described sounds like you're idea of dieting/eating healthy is way too low. For a lot of people (I'd wager everyone to some degree) eating too little in an attempt to eat healthy leads to extreme hunger and overeating or bingeing. \n\nI don't want to give you any advice, because I don't know you and I'm not a professional, and I think that's what you need. But just in case you can't, I would think you should try to focus on higher protein (and even fat), especially for breakfast. Grapes are pretty sugary I think, so is all fruit, so I wouldn't think it would be the best choice for a diabetic for breakfast...although even as a non-diabetic, I personally find fruit/carbs for breakfast leaves me hungry really soon and causes me distress for that reason.",
      "created_utc": 1605791066.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gcujgoq",
      "author": "iactuallyruntho",
      "body": "If you find a doctor willing to prescribe, ive found Vyvanse is very useful for binge eating",
      "created_utc": 1605806976.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gcud8ee",
      "author": "None",
      "body": "Get a different doctor. Get into therapy. See a dietitian. This is much bigger than you can handle alone and you shouldn’t have to try.",
      "created_utc": 1605804050.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gcubklq",
      "author": "SignificantBeing5",
      "body": "Please get a new doctor. I’m not qualified to give you personal advice, but your doctor has not been educated in the area of eating disorders. I’m sorry for everything that’s happened to you. I concur with what everyone has suggested with getting a dietician or a nutritionist and a therapist who specializes in trauma. You are a brave person to have lived through that- never blame yourself and allow yourself some grace.",
      "created_utc": 1605803267.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gctglj9",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1605782943.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gcth966",
      "author": "BlackJack613",
      "body": "Are you in therapy for your traumatic past? I think it would drastically improve your situation. Also if you're able to I would suggest seeing a nutritionist (don't go to a dietitian, they have no formal education so the advice they give is varied). \n\nYou're strong and you can get through this you just need the help of professionals who have dealt with this before so you don't damage your health (physical and mental) any more than it already is.",
      "created_utc": 1605783628.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gcup4tp",
      "author": "Maggiemaccy",
      "body": "I developed an eating disorder from scarcity in my childhood. When I had my own money and independence to go get my own food I quickly became absolutely obsessed with food. If I wasn’t eating I was thinking of my next meal, watching cooking shows, looking at pictures of food online, reading about food. \nI would ping pong between binge eating and total starvation. I remember during binge eating periods in my life I just couldn’t wrap my head around the idea that food had to come to an end, an entire share size bag of chocolates wasn’t enough I was genuinely distressed at the idea that I would eventually eat them all and there would be none left. I’d eat until I physically couldn’t move, my skin would hurt from being stretched so far, I thought on occasions I had done serious internal damage. I would go through periods of starvation not so much for weight reasons but primarily because I find the feeling of a totally empty stomach extremely comforting I guess it reminds me of a simpler time. \n\nThe only way I could get this to stop was to lean into the idea that there is ALWAYS going to be more if I want it, always. So I had to ditch dieting or any notion that I would curb my binge eating. My binge eating came from a fear of food scarcity so it was never going to go away if I kept imposing food scarcity as a solution. I had to resolve with myself that I was going to let it play out until I finally realised that food wasn’t going away again, if I don’t eat enough now and I’m hungry later I can get more. It’s a slow process but I’m about 6 years into recovery and I haven’t had an episode of binge eating in 5 years. I can’t even get myself into the frame of mind I was in at that time anymore. I distinctly remember I couldn’t keep peanut butter in the house because again I couldn’t accept that I wasn’t allowed to use an entire jar at one time. Which now feels bizarre, I use as much as I want and that’s like one tablespoon, but my brain was wired to stockpile and take as much as I could for fear there wouldn’t be enough food later. \n\nIn short you cannot remedy an issue that came from being deprived of food by depriving yourself again. I really recommend resolving to square this away mentally, I’ve had an incredibly free 5 years and I can now maintain my healthy weight without a thought",
      "created_utc": 1605809546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gcvu9tv",
      "author": "workingonit777",
      "body": "listening to your bodies cues, drinking water and eating slowly, to determine when you're truly full. eating a balance of foods, mainly fruits and vegetables, limit your bread/carb intake, trade out things like ranch for apple cider vinegar",
      "created_utc": 1605827603.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gcwhnlw",
      "author": "sokale2",
      "body": "Please message me! I’m a dietitian that specializes in diabetes and have some resources to at least get you headed in the right direction.",
      "created_utc": 1605839995.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gden8ks",
      "author": "Madam_Zombie",
      "body": "Leave that asshole of a doctor and find someone that will help you. Get some couples consiling with your husband, ask the consilar for technques for your husband to show that he loves you. If you husband leaves you then he doesn't understand your value as a woman.",
      "created_utc": 1606190374.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gcy9euu",
      "author": "wordgromit",
      "body": "I second this, you should be seeing someone who can actually help you have a healthy relationship with food. I recommend a dietician, they can give you a realistic meal plan you can stick to",
      "created_utc": 1605888180.0,
      "score": 1,
      "context": [
        {
          "id": "gcthd4r",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1605783743.0
        }
      ]
    },
    {
      "id": "gcw1jtf",
      "author": "None",
      "body": "People who are diabetic actually should still be eating carbs, no one should cut carbs, your body *needs* carbohydrates. Someone who is diabetic should be focusing on eating foods low on the glycemic index if they need to watch their blood glucose. Typically thats picking carbohydrates that have a good Fibre content. \n\nI 100% agree about seeing a professional, though. Healing the relationship with food is so hard and the right professional will be able to guide through that process!",
      "created_utc": 1605831156.0,
      "score": 6,
      "context": [
        {
          "id": "gctmufh",
          "author": "Gumnutbaby",
          "body": "Standard advice for someone diabetic is to cut carbs, not ain all products. Unless you are eating very high portions of meats they don’t affect your blood glucose.   \n\n\nI’d definitely encourage you to have a chat to a trained professional. It’s part of diabetes management, but you’ll also need it for your relationship with food.\n\n&#x200B;\n\nand can I also add, I’m really sorry to hear about your history, and it’s amazing you have survived and come out the other side. Please don’t let it define you, it’s part of your story, but not all of it.",
          "created_utc": 1605788904.0
        }
      ]
    },
    {
      "id": "gcuka1d",
      "author": "DarkRapunzel_North",
      "body": "I am not diabetic but grapes, pizza, and carrots sounds like a lot of sugar to me. Even switching the fruit and veggies for lower sugar ones (like berries or cucumber) would be a small switch.",
      "created_utc": 1605807355.0,
      "score": 2,
      "context": [
        {
          "id": "gctmufh",
          "author": "Gumnutbaby",
          "body": "Standard advice for someone diabetic is to cut carbs, not ain all products. Unless you are eating very high portions of meats they don’t affect your blood glucose.   \n\n\nI’d definitely encourage you to have a chat to a trained professional. It’s part of diabetes management, but you’ll also need it for your relationship with food.\n\n&#x200B;\n\nand can I also add, I’m really sorry to hear about your history, and it’s amazing you have survived and come out the other side. Please don’t let it define you, it’s part of your story, but not all of it.",
          "created_utc": 1605788904.0
        }
      ]
    },
    {
      "id": "gcut6fw",
      "author": "Ironicbanana14",
      "body": "Yeah natural carbs or carbs from bread/wheat/pasta etc are usually empty calories and run out very fast, leaving you hungrier. Although what they ate wasnt horrible, but when your body is confused, it cant tell. I usually go for protein like beans, soy, baked chicken, and a lot of salad, celery, corn, or mushrooms.\n\nFruits are actually quite sugary, bananas, berries, and apples being the worst, and i think lemons are the best. Bread and cheese from the pizza would be sugary as well because the sauce. Carrots are excellent but lite ranch actually has sugar added into it to make up for the fat, would that be better to just eat regular ranch if you're diabetic? Idk if the sugar fat trade off is worth it.",
      "created_utc": 1605811429.0,
      "score": 2,
      "context": [
        {
          "id": "gctpnt4",
          "author": "mud_octopus",
          "body": "Can you see a dietician/nutritionist? (As well as a therapist.)\n\nThe day you described sounds like you're idea of dieting/eating healthy is way too low. For a lot of people (I'd wager everyone to some degree) eating too little in an attempt to eat healthy leads to extreme hunger and overeating or bingeing. \n\nI don't want to give you any advice, because I don't know you and I'm not a professional, and I think that's what you need. But just in case you can't, I would think you should try to focus on higher protein (and even fat), especially for breakfast. Grapes are pretty sugary I think, so is all fruit, so I wouldn't think it would be the best choice for a diabetic for breakfast...although even as a non-diabetic, I personally find fruit/carbs for breakfast leaves me hungry really soon and causes me distress for that reason.",
          "created_utc": 1605791066.0
        }
      ]
    },
    {
      "id": "gctuepp",
      "author": "absfae",
      "body": "It’s actually the opposite. Dietitians are board certified and have academic backgrounds often with research under their belts. They can work in places like hospitals or eating disorder recovery centers. Nutritionists can get a certification in a matter of months or taking an online course.",
      "created_utc": 1605794200.0,
      "score": 12,
      "context": [
        {
          "id": "gcth966",
          "author": "BlackJack613",
          "body": "Are you in therapy for your traumatic past? I think it would drastically improve your situation. Also if you're able to I would suggest seeing a nutritionist (don't go to a dietitian, they have no formal education so the advice they give is varied). \n\nYou're strong and you can get through this you just need the help of professionals who have dealt with this before so you don't damage your health (physical and mental) any more than it already is.",
          "created_utc": 1605783628.0
        }
      ]
    },
    {
      "id": "gczdaik",
      "author": "Gumnutbaby",
      "body": "For type 2 current advice is that it’s ok to forgo them as much as you can maintain. when you go on drugs like Metformin you ain’t have a hypo episode.",
      "created_utc": 1605907544.0,
      "score": 1,
      "context": [
        {
          "id": "gctmufh",
          "author": "Gumnutbaby",
          "body": "Standard advice for someone diabetic is to cut carbs, not ain all products. Unless you are eating very high portions of meats they don’t affect your blood glucose.   \n\n\nI’d definitely encourage you to have a chat to a trained professional. It’s part of diabetes management, but you’ll also need it for your relationship with food.\n\n&#x200B;\n\nand can I also add, I’m really sorry to hear about your history, and it’s amazing you have survived and come out the other side. Please don’t let it define you, it’s part of your story, but not all of it.",
          "created_utc": 1605788904.0
        },
        {
          "id": "gcw1jtf",
          "author": "None",
          "body": "People who are diabetic actually should still be eating carbs, no one should cut carbs, your body *needs* carbohydrates. Someone who is diabetic should be focusing on eating foods low on the glycemic index if they need to watch their blood glucose. Typically thats picking carbohydrates that have a good Fibre content. \n\nI 100% agree about seeing a professional, though. Healing the relationship with food is so hard and the right professional will be able to guide through that process!",
          "created_utc": 1605831156.0
        }
      ]
    },
    {
      "id": "gdgq6pd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606239871.0,
      "score": 1,
      "context": [
        {
          "id": "gctmufh",
          "author": "Gumnutbaby",
          "body": "Standard advice for someone diabetic is to cut carbs, not ain all products. Unless you are eating very high portions of meats they don’t affect your blood glucose.   \n\n\nI’d definitely encourage you to have a chat to a trained professional. It’s part of diabetes management, but you’ll also need it for your relationship with food.\n\n&#x200B;\n\nand can I also add, I’m really sorry to hear about your history, and it’s amazing you have survived and come out the other side. Please don’t let it define you, it’s part of your story, but not all of it.",
          "created_utc": 1605788904.0
        },
        {
          "id": "gcw1jtf",
          "author": "None",
          "body": "People who are diabetic actually should still be eating carbs, no one should cut carbs, your body *needs* carbohydrates. Someone who is diabetic should be focusing on eating foods low on the glycemic index if they need to watch their blood glucose. Typically thats picking carbohydrates that have a good Fibre content. \n\nI 100% agree about seeing a professional, though. Healing the relationship with food is so hard and the right professional will be able to guide through that process!",
          "created_utc": 1605831156.0
        }
      ]
    },
    {
      "id": "gcu8s2s",
      "author": "BlackJack613",
      "body": "You're correct, thanks for catching that!",
      "created_utc": 1605801920.0,
      "score": 5,
      "context": [
        {
          "id": "gcth966",
          "author": "BlackJack613",
          "body": "Are you in therapy for your traumatic past? I think it would drastically improve your situation. Also if you're able to I would suggest seeing a nutritionist (don't go to a dietitian, they have no formal education so the advice they give is varied). \n\nYou're strong and you can get through this you just need the help of professionals who have dealt with this before so you don't damage your health (physical and mental) any more than it already is.",
          "created_utc": 1605783628.0
        },
        {
          "id": "gctuepp",
          "author": "absfae",
          "body": "It’s actually the opposite. Dietitians are board certified and have academic backgrounds often with research under their belts. They can work in places like hospitals or eating disorder recovery centers. Nutritionists can get a certification in a matter of months or taking an online course.",
          "created_utc": 1605794200.0
        }
      ]
    },
    {
      "id": "gdhj1hz",
      "author": "None",
      "body": "Type 2 diabetics still need carbs. Everyone needs carbohydrates.\n\n I work in Healthcare, I've had diabetic patients of all types. They *all* get carbs because carbs are a macro that we need. We focus on blood glucose, and making sure they're getting foods low on the glycemic index if that's what they need. Im not saying op should continue to eat what they're eating, so im not sure why that was mentioned. Im saying they should pay attention to the glyemic index, which will allow carbs + better control of blood glucose.",
      "created_utc": 1606253426.0,
      "score": 1,
      "context": [
        {
          "id": "gctmufh",
          "author": "Gumnutbaby",
          "body": "Standard advice for someone diabetic is to cut carbs, not ain all products. Unless you are eating very high portions of meats they don’t affect your blood glucose.   \n\n\nI’d definitely encourage you to have a chat to a trained professional. It’s part of diabetes management, but you’ll also need it for your relationship with food.\n\n&#x200B;\n\nand can I also add, I’m really sorry to hear about your history, and it’s amazing you have survived and come out the other side. Please don’t let it define you, it’s part of your story, but not all of it.",
          "created_utc": 1605788904.0
        },
        {
          "id": "gcw1jtf",
          "author": "None",
          "body": "People who are diabetic actually should still be eating carbs, no one should cut carbs, your body *needs* carbohydrates. Someone who is diabetic should be focusing on eating foods low on the glycemic index if they need to watch their blood glucose. Typically thats picking carbohydrates that have a good Fibre content. \n\nI 100% agree about seeing a professional, though. Healing the relationship with food is so hard and the right professional will be able to guide through that process!",
          "created_utc": 1605831156.0
        },
        {
          "id": "gdgq6pd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606239871.0
        }
      ]
    },
    {
      "id": "gcuh2h8",
      "author": "absfae",
      "body": "No prob :)",
      "created_utc": 1605805855.0,
      "score": 3,
      "context": [
        {
          "id": "gcth966",
          "author": "BlackJack613",
          "body": "Are you in therapy for your traumatic past? I think it would drastically improve your situation. Also if you're able to I would suggest seeing a nutritionist (don't go to a dietitian, they have no formal education so the advice they give is varied). \n\nYou're strong and you can get through this you just need the help of professionals who have dealt with this before so you don't damage your health (physical and mental) any more than it already is.",
          "created_utc": 1605783628.0
        },
        {
          "id": "gctuepp",
          "author": "absfae",
          "body": "It’s actually the opposite. Dietitians are board certified and have academic backgrounds often with research under their belts. They can work in places like hospitals or eating disorder recovery centers. Nutritionists can get a certification in a matter of months or taking an online course.",
          "created_utc": 1605794200.0
        },
        {
          "id": "gcu8s2s",
          "author": "BlackJack613",
          "body": "You're correct, thanks for catching that!",
          "created_utc": 1605801920.0
        }
      ]
    }
  ]
}