{
  "id": "jxn6on",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1605870589.0,
  "title": "Request: (post request) finally admitted I needed help",
  "selftext": "after years of struggling with my eating (I am unsure what a crippling fear of gaining weight, skipping meals/cutting down on my food intake, and avoiding certain foods would be classified as, but hopefully I'll receive a diagnosis), I finally got honest with my parents and therapists. I still dont feel like my parents fully care or believe that I'm struggling, but thankfully they go along with whatever my therapists and I agree upon.\n\nI have an intake for an IOP program next Wednesday. reading these posts have honestly helped a lot and gave me a sense of community and a place where I felt like I belonged. thank you :')",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jxn6on/request_post_request_finally_admitted_i_needed/",
  "score": 54,
  "num_comments": 5,
  "comments": [
    {
      "id": "gcya6ci",
      "author": "None",
      "body": "Congrats on starting recovery ❤️",
      "created_utc": 1605888559.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gcxjdi9",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1605870590.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gczjzb1",
      "author": "everythingiamnow",
      "body": "i'm proud of you💜",
      "created_utc": 1605911008.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gd1038a",
      "author": "tymopa",
      "body": "Congrats! Just the journey to get where you are is no easy life. You are going to learn so much. Embrace it all...it will be painful, uncomfortable, beautiful, liberating, and healing. Just know that people don't understand. Some try their very best and still don't get it. It's a learning process and one that has no deadline. Best of luck to you. IOP was the best thing I ever did for myself.",
      "created_utc": 1605944585.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gd5un0p",
      "author": "The-person-it-is_99",
      "body": "This is a beautiful thing! Sending you all of my love and strength!!",
      "created_utc": 1606020176.0,
      "score": 2,
      "context": []
    }
  ]
}