{
  "id": "jzfgdw",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1606128387.0,
  "title": "Request: I ruined my relationship with food and I regret it",
  "selftext": "&#x200B;\n\nFor context, it all started just before quarantine. I (F16) started restricting what I eat and I learned about calorie counting. Stupid me started eating very low calorie, even though it's not as low as some people go. I was extremely obsessed with food. When I went to sleep I thought about what I would eat in the morning, I would even try to count the calories for the next day in my head. In school I was always tired, hungry and cold and I couldn't stop thinking about food. I would spend way too much time at the grocery store comparing labels to get the most low calorie option. I would weight every gram of food I ate. And of course during the quarantine I had alot of free time and I would exercise for 2h per day, sometimes even more. All that went on for about 3 months, I lost some weight and ended up losing my period. I started binging uncontrollably and got my period back. I would find myself in the kitchen, binging on sweets. I started buying large amounts of sweets, for example a bag of cookies, a chocolate bar and a bag of candy and I would eat all of it at once. I would always think to myself \"this is my last binge, I'm getting back on track tomorrow\". But every day I would just wake up and have an extreme need to binge. I binged every day, stopped working out and gained more weight than I had lost. During summer I kind of got back on track, started working out again and tried to eat healthier .\n\nBut now I just don't know what to do. It feels like I can't just eat normally. I don't restrict and I don't binge as much as I did before, but it happens sometimes. I overeat almost every day and even the smallest restriction triggers me. I'm addicted to sweets and I need to have some everyday. I am of course worried for my looks because like any teenager I am abit insecure with my body but I am even more worried about my health. I can't imagine all the damage I did to my health with the restrict/binge cycle and with the large amount of sweets I eat every day. I wish I could go back in time and stop myself from restricting what I eat. I wish I could eat like normal people do, in normal portions.\n\nI've only talked about this with one friend but not in too much detail. I don't know if I had or have an eating disorder because sometimes it seems like it wasn't serious enough to be considered as one. Please help me if you know how to rebuild my relationship with food and stop always overeating. Does anyone relate to this situation?\n\n&#x200B;\n\nEDIT:  Please notify [u/picklednood1e](https://www.reddit.com/u/picklednood1e) when you respond, so they can see the replies ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/jzfgdw/request_i_ruined_my_relationship_with_food_and_i/",
  "score": 90,
  "num_comments": 33,
  "comments": [
    {
      "id": "gdbsh39",
      "author": "jeabgrenouille",
      "body": "What I will say could possibly be reassuring? The same thing happened to me. I was extremely restrictive, I gained some weight and started doing better, and then I relapsed into restricting. After that relapse, I got extreme hunger for the first time, and I could not tolerate an ounce of restriction. I couldn't even handle waiting an extra minute for a meal. I over ate almost every day and some days, I ate basically non stop. Obviously, I gained some weight. \n\nFortunately, I stopped weighing myself, and because I was so hungry, I couldn't consider doing something about the weight gain because it would be impossible with the insanely strong impulse I had to eat and inability to not eat. I was generally unhappy with my body at that time, though, and I was unhappy that I couldn't seem to control myself. I thought I was a mess.\n\nThe good news is, that didn't last forever. Little by little, I noticed myself becoming more and more \"normal\" around food. Every once in a while, I would notice that I did something that I never used to be able to do, and it was suddenly possible (like forgetting about food, waiting for a meal, not working out, eating out with no anxiety... Stuff like that) . That came about because I kept eating every day (I felt like I had no choice on that haha) and I started challenging my fears about eating certain foods and doing a certain amount of exercise. \n\nIt seems like, for lots of people, this phase lasts several months. For me, it lasted years, but I believe that that was because for the first few years, I continued to exercise a lot and restrict certain foods and try to limit my intake too much (even though I would never succeed at this because my extreme hunger was so powerful). \n\nNow, I feel really normal around food. It is such a small part of my day now, and it used to be the #1 thing that I would think about. I lost the extra weight I had gained without trying.\n\nThis year has been so awful. I'm sorry that it affected you in this way. Compulsive restriction is often triggered by a life event (for me, it started when I changed schools). I wish the best for you <3\n\nTLDR; Being well-fed for a long time and finally letting go of food fears and restrictions and compulsive exercise got me to be a much more normal eater and caused me to lose weight I had gained during a period of extreme hunger.",
      "created_utc": 1606136687.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gdc5glk",
      "author": "hammersandstrings11",
      "body": "I wouldn’t stress about long term health effects from a relatively short period of binging/restricting. The bigger issue is your mental health, self image, and happiness. Talk to a professional and let them help you develop a healthy relationship with food again. You’re young and can have a long healthy life from here :)",
      "created_utc": 1606144969.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gdc5871",
      "author": "picklednood1e",
      "body": "Hey everyone thank you so much for your replies! Feel free to message me if you want to talk about the struggle  💓",
      "created_utc": 1606144840.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gdcbntp",
      "author": "AnxietyOk5407",
      "body": "I feel this post so much! I’m also F16 and during quarantine I picked up horrible habits and began restricting my food, and over exercising I lost weight and am now scared to start eating regular meals i’m going through the same thing with binging and restricting it’s a horrible cycle..  hoping for the best for everyone going through this !",
      "created_utc": 1606148240.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gdbxg8m",
      "author": "luismarcelomf",
      "body": "Same, I can’t seem to tell anyone cause well its embarrassing besides they never understand",
      "created_utc": 1606140213.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdc4e6v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606144387.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdbjrtl",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1606128387.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdbsocf",
      "author": "not_0K",
      "body": "I completely relate and have found that scheduled meals really help. At first I wasn’t hungry for breakfast ever because I would binge so hard the day before usually late in the day. But I would eat a “normal” sized breakfast around 8-9am, have lunch at 12-1 and a dinner between 5-6pm. Over a week of doing this helped restore my hunger cues but did not curb my craving for food. I think because I had restricted for so long, my body entered starvation mode so was food-seeking constantly. To help with this, I would either allow myself a snack, go for a walk, chew some gum, drink a delicious tea or hot chocolate, but overall try to move on until the next meal. Not every day is perfect. I still have days that I crave a binge but I do it must less frequently now. I use the app “Days Since” and it motivates me to see how many days it has been since my last big binge. It’s been weeks and I am much happier. Also remember that there are multiple forms of “purging”. I don’t make myself sick because I can’t stand the feeling of it and physically I don’t think I’m able to but over exercising is another form of purging. Make sure you are drinking plenty of water and sleeping at least 8 hours. Make sure you are managing stress. Those things alone will help a good amount. If you haven’t tried therapy maybe consider that. It’s not for everyone. So far I’ve found journaling for me helps more than therapy but everyone is different. \n\nSome resources you can look into are the free eating disorder [guides and info](https://www.cci.health.wa.gov.au/Resources/Looking-After-Yourself/Disordered-Eating) here. Carolyn Costin’s 8 keys recovery workbook helped me gain more insight into why I eat the way I do. My piece of advice to you is this: do NOT start following diets. This is not the time to go keto or try intermittent fasting or go vegan. Just stick with what you were eating and how you were eating before you first noticed these behaviours. Do NOT engage in dangerous activities. Smoking or over consumption of energy drinks to curb your appetite literally kills you in the long run. It is not a badge of honour to abuse your body. You are more than your ED. You are a person, whole and worthy of love. It is ok to fail but you can always try again. Take care of yourself 💕",
      "created_utc": 1606136841.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gde47f9",
      "author": "None",
      "body": "I am sorry if this may sound stupid, but have you tried intuitive eating where you only eat when you are hungry? (trust me, you'll know the difference.) and stop when you feel you are getting full? Maybe try to make up a meal plan for eating 100-200kcal above your BMR, something like oats, oatmeal and other high fibre food? Should keep you full. To distract yourself from binging, go for a walk or watch a movie, don't buy big portions of sweets (it's hard I know, been there many times.. ) , instead buy a small twinx chocolate bar or something alternative?",
      "created_utc": 1606180057.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdeknnm",
      "author": "wat-potato",
      "body": "I relate to this so much :((( especially the environment of being in quarantine it accelerated my disordered thoughts about food to the point where I took action w the unhealthy restriction, over exercise & binging cycles. I’m abit older (f20) but just want to say the fact that you’re talking about it and recognising the unhealthy relationship w food is such a big step in itself! for a long time I didn’t think anything was wrong solely bc I wasn’t “skinny” which is so messed up! wishing u all the best & here if u ever need to talk to help get through it together !!!",
      "created_utc": 1606188898.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdf9h7i",
      "author": "ight_imma_joe_out",
      "body": "This is kind of similar to my current situation.\nI started losing weight in January by fasting. I stopped when quarantine started. Those 3ish months where great and I did not have an eating disorder. I didn't count calories but ate very little (unknowingly) because I would fast 23 hours a day. Still I felt great, I had lost around 6kg. From March to August I had gained 8kg (which is more than I initially lost). I was at my heaviest and had developed a very bad relationship with food. I ate way too much and still didn't think there was any problem. I thought I would lose the weight once I started school again, boy was I wrong. I might have even gained a little. My country is now in quarantine for the second time. It all started November 7th. I told myself I was fat and had to lose the weight asap. What really motivated me was the fact that I had gained so much in the previous quarantine so if I kept going I would gain even more. So I started calorie counting. I'm not comfortable with sharing how many calories I consume daily but basically I feel tired and my heart beats very fast. I don't think I have a fully developed eating disorder so I came to this sub to prevent that, I think it's too late. I can't imagine myself going back to eating normally. I really hope I can get out of this as soon as possible, before it's too late. Good luck to all of you ♡",
      "created_utc": 1606207465.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdfery1",
      "author": "TemporaryAccount_101",
      "body": "Same thing happened to me.\n\nI started restricting, lost a lot of weight, got really sick and out of feae of irreversible health problem I started to eat, a lot.\n\nI developed BED and theb bulimia and now, a few years later, I'm starting to heal properly.\n\nMy behaviours around food are better and I noticed sometimes I can eveb go without eating a meal just because my body isn't hungry and not eating just because.\n\nAs some other has said, this bit depends on the person and it's different for everyone but one common denominator is: it gets better.\n\nIt's hard at the beginning because you feel out of control and I thought that I'd never get a grip on my body responses because I had fucked them up so bad, but your body knows what it needs.\n\nGoing with the flow will probably get the process over sooner rather than later\n\nEdit: also, I'm talking about a few years of restricting therefore it's only natural that my 'unrestriction' lasted so long \n\nStay strong x",
      "created_utc": 1606212978.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdlyhit",
      "author": "dunzle",
      "body": "This happened to me. I used to restrict non stop and would be fine doing it. Then one day I decided to eat and I was fine. I was eating normally. I restricted again. This was a non stop cycle until one day I was so tired of restricting I couldn’t stop eating everything around me. I would be impatient to eat and even if I was full I wouldn’t stop eating. Now when I eat I can’t stop because I think my brain thinks I’m not gonna get the food again. I don’t know if that makes sense. I can’t even restrict anymore. I can’t last long doing it because I absolutely cannot tolerate the hunger.",
      "created_utc": 1606350677.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdnea7h",
      "author": "skadisorkvir",
      "body": "Just wait until you've had an ED for nearly a decade like me. At least you have time to fix it. My restriction has caused my digestive system to essentially stop functioning. Get help while it's early days. There is nothing I regret more than doing this too myself when I was younger.",
      "created_utc": 1606387200.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ge6x301",
      "author": "hummingb1rd90",
      "body": "I relate so much...it's hell. Be as kind and compassionate with yourself as you can...if you can manage that, things will improve (at least that's what I believe for myself). Headed into a residential program soon...not expecting it to 100% heal my relationship with food or my body, but I do have faith it'll help a lot.",
      "created_utc": 1606773019.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdbsuzl",
      "author": "not_0K",
      "body": "I second the not weighing yourself bit wholeheartedly! Put that shit back in your closet or give it to someone else. I strongly believe people with EDs do not benefit from regular weigh-ins until they have healed.",
      "created_utc": 1606136982.0,
      "score": 12,
      "context": [
        {
          "id": "gdbsh39",
          "author": "jeabgrenouille",
          "body": "What I will say could possibly be reassuring? The same thing happened to me. I was extremely restrictive, I gained some weight and started doing better, and then I relapsed into restricting. After that relapse, I got extreme hunger for the first time, and I could not tolerate an ounce of restriction. I couldn't even handle waiting an extra minute for a meal. I over ate almost every day and some days, I ate basically non stop. Obviously, I gained some weight. \n\nFortunately, I stopped weighing myself, and because I was so hungry, I couldn't consider doing something about the weight gain because it would be impossible with the insanely strong impulse I had to eat and inability to not eat. I was generally unhappy with my body at that time, though, and I was unhappy that I couldn't seem to control myself. I thought I was a mess.\n\nThe good news is, that didn't last forever. Little by little, I noticed myself becoming more and more \"normal\" around food. Every once in a while, I would notice that I did something that I never used to be able to do, and it was suddenly possible (like forgetting about food, waiting for a meal, not working out, eating out with no anxiety... Stuff like that) . That came about because I kept eating every day (I felt like I had no choice on that haha) and I started challenging my fears about eating certain foods and doing a certain amount of exercise. \n\nIt seems like, for lots of people, this phase lasts several months. For me, it lasted years, but I believe that that was because for the first few years, I continued to exercise a lot and restrict certain foods and try to limit my intake too much (even though I would never succeed at this because my extreme hunger was so powerful). \n\nNow, I feel really normal around food. It is such a small part of my day now, and it used to be the #1 thing that I would think about. I lost the extra weight I had gained without trying.\n\nThis year has been so awful. I'm sorry that it affected you in this way. Compulsive restriction is often triggered by a life event (for me, it started when I changed schools). I wish the best for you <3\n\nTLDR; Being well-fed for a long time and finally letting go of food fears and restrictions and compulsive exercise got me to be a much more normal eater and caused me to lose weight I had gained during a period of extreme hunger.",
          "created_utc": 1606136687.0
        }
      ]
    },
    {
      "id": "gde0szu",
      "author": "picklednood1e",
      "body": "Wow thank you for your reply ! I do feel impatient  when it comes to food and I can't stand being hungry because it triggers my binge eating. What I understood from your experience is that I should be patient because technically this is recovery and well it takes some time. I'm gonna try to not weight myself even though it is abit hard to resist the temptation. I would say that I don't restrict and over exercise now, my main problem is that I can't really know when to stop eating and I always want to eat as much as I can. Like I said, I over eat every day and yeah it's technically not always a binge but I'm definitely in a big calorie surplus and I am not skinny so this is not a surplus that I need to be healthy. I think I need to do something to recognize my hunger cues and stop eating when I'm full.",
      "created_utc": 1606178211.0,
      "score": 4,
      "context": [
        {
          "id": "gdbsh39",
          "author": "jeabgrenouille",
          "body": "What I will say could possibly be reassuring? The same thing happened to me. I was extremely restrictive, I gained some weight and started doing better, and then I relapsed into restricting. After that relapse, I got extreme hunger for the first time, and I could not tolerate an ounce of restriction. I couldn't even handle waiting an extra minute for a meal. I over ate almost every day and some days, I ate basically non stop. Obviously, I gained some weight. \n\nFortunately, I stopped weighing myself, and because I was so hungry, I couldn't consider doing something about the weight gain because it would be impossible with the insanely strong impulse I had to eat and inability to not eat. I was generally unhappy with my body at that time, though, and I was unhappy that I couldn't seem to control myself. I thought I was a mess.\n\nThe good news is, that didn't last forever. Little by little, I noticed myself becoming more and more \"normal\" around food. Every once in a while, I would notice that I did something that I never used to be able to do, and it was suddenly possible (like forgetting about food, waiting for a meal, not working out, eating out with no anxiety... Stuff like that) . That came about because I kept eating every day (I felt like I had no choice on that haha) and I started challenging my fears about eating certain foods and doing a certain amount of exercise. \n\nIt seems like, for lots of people, this phase lasts several months. For me, it lasted years, but I believe that that was because for the first few years, I continued to exercise a lot and restrict certain foods and try to limit my intake too much (even though I would never succeed at this because my extreme hunger was so powerful). \n\nNow, I feel really normal around food. It is such a small part of my day now, and it used to be the #1 thing that I would think about. I lost the extra weight I had gained without trying.\n\nThis year has been so awful. I'm sorry that it affected you in this way. Compulsive restriction is often triggered by a life event (for me, it started when I changed schools). I wish the best for you <3\n\nTLDR; Being well-fed for a long time and finally letting go of food fears and restrictions and compulsive exercise got me to be a much more normal eater and caused me to lose weight I had gained during a period of extreme hunger.",
          "created_utc": 1606136687.0
        }
      ]
    },
    {
      "id": "gdbzm7v",
      "author": "wholesome100chonker6",
      "body": "this makes me feel so relieved. i restricted for a few months and then got caught in a binge/restrict cycle where i would binge because i was extremely hungry and then fast for several days afterwards\n\ni’m trying to recover now and i’m just so hungry constantly i don’t know what to do about it, my stomach is so full it hurts but i’m still hungry\n\nwhat do i do about the hunger? i feel like if it was my choice i’d never stop eating but im really scared to gain back all the weight i lost and then never be able to lose it again",
      "created_utc": 1606141584.0,
      "score": 3,
      "context": [
        {
          "id": "gdbsh39",
          "author": "jeabgrenouille",
          "body": "What I will say could possibly be reassuring? The same thing happened to me. I was extremely restrictive, I gained some weight and started doing better, and then I relapsed into restricting. After that relapse, I got extreme hunger for the first time, and I could not tolerate an ounce of restriction. I couldn't even handle waiting an extra minute for a meal. I over ate almost every day and some days, I ate basically non stop. Obviously, I gained some weight. \n\nFortunately, I stopped weighing myself, and because I was so hungry, I couldn't consider doing something about the weight gain because it would be impossible with the insanely strong impulse I had to eat and inability to not eat. I was generally unhappy with my body at that time, though, and I was unhappy that I couldn't seem to control myself. I thought I was a mess.\n\nThe good news is, that didn't last forever. Little by little, I noticed myself becoming more and more \"normal\" around food. Every once in a while, I would notice that I did something that I never used to be able to do, and it was suddenly possible (like forgetting about food, waiting for a meal, not working out, eating out with no anxiety... Stuff like that) . That came about because I kept eating every day (I felt like I had no choice on that haha) and I started challenging my fears about eating certain foods and doing a certain amount of exercise. \n\nIt seems like, for lots of people, this phase lasts several months. For me, it lasted years, but I believe that that was because for the first few years, I continued to exercise a lot and restrict certain foods and try to limit my intake too much (even though I would never succeed at this because my extreme hunger was so powerful). \n\nNow, I feel really normal around food. It is such a small part of my day now, and it used to be the #1 thing that I would think about. I lost the extra weight I had gained without trying.\n\nThis year has been so awful. I'm sorry that it affected you in this way. Compulsive restriction is often triggered by a life event (for me, it started when I changed schools). I wish the best for you <3\n\nTLDR; Being well-fed for a long time and finally letting go of food fears and restrictions and compulsive exercise got me to be a much more normal eater and caused me to lose weight I had gained during a period of extreme hunger.",
          "created_utc": 1606136687.0
        }
      ]
    },
    {
      "id": "gde26rx",
      "author": "picklednood1e",
      "body": "That's true! But I am also worried about the large quantities of sugar I still consume daily",
      "created_utc": 1606178962.0,
      "score": 2,
      "context": [
        {
          "id": "gdc5glk",
          "author": "hammersandstrings11",
          "body": "I wouldn’t stress about long term health effects from a relatively short period of binging/restricting. The bigger issue is your mental health, self image, and happiness. Talk to a professional and let them help you develop a healthy relationship with food again. You’re young and can have a long healthy life from here :)",
          "created_utc": 1606144969.0
        }
      ]
    },
    {
      "id": "gdcflwv",
      "author": "One-Awareness9491",
      "body": "Do you happen to have an eating disorder clinic near you? I’ve deal kind of the same as you and also f(16), now I’m kind of doing better but I still want to get the help and make it so I can enjoy food about thinking 20mins and feeling guilty for each meal I decide to eat. Not sure if it’ll be helpful but it’s worth a shot to go to one and talk to a professional. If not, the comments here honestly seem really helpful but either way I wish the best for you",
      "created_utc": 1606150187.0,
      "score": 2,
      "context": [
        {
          "id": "gdc5871",
          "author": "picklednood1e",
          "body": "Hey everyone thank you so much for your replies! Feel free to message me if you want to talk about the struggle  💓",
          "created_utc": 1606144840.0
        }
      ]
    },
    {
      "id": "gde2jbm",
      "author": "picklednood1e",
      "body": "It feels good to know that you're not alone :) \n\nI hope that you'll get out of that cycle soon!",
      "created_utc": 1606179150.0,
      "score": 2,
      "context": [
        {
          "id": "gdcbntp",
          "author": "AnxietyOk5407",
          "body": "I feel this post so much! I’m also F16 and during quarantine I picked up horrible habits and began restricting my food, and over exercising I lost weight and am now scared to start eating regular meals i’m going through the same thing with binging and restricting it’s a horrible cycle..  hoping for the best for everyone going through this !",
          "created_utc": 1606148240.0
        }
      ]
    },
    {
      "id": "gde2cut",
      "author": "picklednood1e",
      "body": "Hey feel free to message me if you need someone to talk to! I understand you because it's extremely embarrassing to talk about it, especially with people who can't relate and don't even understand how ed works.",
      "created_utc": 1606179054.0,
      "score": 2,
      "context": [
        {
          "id": "gdbxg8m",
          "author": "luismarcelomf",
          "body": "Same, I can’t seem to tell anyone cause well its embarrassing besides they never understand",
          "created_utc": 1606140213.0
        }
      ]
    },
    {
      "id": "gdc8167",
      "author": "picklednood1e",
      "body": "Yeah same I couldn't share it with anyone because I was so embarrassed until my friend mentioned that she went through a similar experience so since I could relate I opened up and we talked about it. It's crazy because if she hadn't mentioned it I would have never guessed that she's going through this.",
      "created_utc": 1606146352.0,
      "score": 1,
      "context": [
        {
          "id": "gdc4e6v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606144387.0
        }
      ]
    },
    {
      "id": "gde2415",
      "author": "picklednood1e",
      "body": "Thank you for your reply! I don't think that scheduled meals would work well for me but it's something I am willing to try. It's just that scheduling meals is some form of restriction for me because if for example I'd have to eat supper around 6 but I am hungry way before that, I'd have to wait and be hungry which is triggering for me since this is exactly what I did back when I was trying to lose weight fast and obsessing over food. But I think having some snacks and overall larger meals could help me not feel that hunger in between meals. I journal and it is something that makes me  understand myself more. And yes, the sleep and stress part is so important! I try to get at least 8h of sleep per night but it's not always possible and I am a quite anxious person.",
      "created_utc": 1606178920.0,
      "score": 3,
      "context": [
        {
          "id": "gdbsocf",
          "author": "not_0K",
          "body": "I completely relate and have found that scheduled meals really help. At first I wasn’t hungry for breakfast ever because I would binge so hard the day before usually late in the day. But I would eat a “normal” sized breakfast around 8-9am, have lunch at 12-1 and a dinner between 5-6pm. Over a week of doing this helped restore my hunger cues but did not curb my craving for food. I think because I had restricted for so long, my body entered starvation mode so was food-seeking constantly. To help with this, I would either allow myself a snack, go for a walk, chew some gum, drink a delicious tea or hot chocolate, but overall try to move on until the next meal. Not every day is perfect. I still have days that I crave a binge but I do it must less frequently now. I use the app “Days Since” and it motivates me to see how many days it has been since my last big binge. It’s been weeks and I am much happier. Also remember that there are multiple forms of “purging”. I don’t make myself sick because I can’t stand the feeling of it and physically I don’t think I’m able to but over exercising is another form of purging. Make sure you are drinking plenty of water and sleeping at least 8 hours. Make sure you are managing stress. Those things alone will help a good amount. If you haven’t tried therapy maybe consider that. It’s not for everyone. So far I’ve found journaling for me helps more than therapy but everyone is different. \n\nSome resources you can look into are the free eating disorder [guides and info](https://www.cci.health.wa.gov.au/Resources/Looking-After-Yourself/Disordered-Eating) here. Carolyn Costin’s 8 keys recovery workbook helped me gain more insight into why I eat the way I do. My piece of advice to you is this: do NOT start following diets. This is not the time to go keto or try intermittent fasting or go vegan. Just stick with what you were eating and how you were eating before you first noticed these behaviours. Do NOT engage in dangerous activities. Smoking or over consumption of energy drinks to curb your appetite literally kills you in the long run. It is not a badge of honour to abuse your body. You are more than your ED. You are a person, whole and worthy of love. It is ok to fail but you can always try again. Take care of yourself 💕",
          "created_utc": 1606136841.0
        }
      ]
    },
    {
      "id": "gde4sfh",
      "author": "picklednood1e",
      "body": "I've wanted to try intuitive eating but I know that it takes a long time to get to where you actually eat intuitively.  To me it seems like the healthiest way of eating and seeing food and I hope one day I'll actually be able to eat intuitively. But for now, it is hard for me to listen to my hunger cues.",
      "created_utc": 1606180373.0,
      "score": 1,
      "context": [
        {
          "id": "gde47f9",
          "author": "None",
          "body": "I am sorry if this may sound stupid, but have you tried intuitive eating where you only eat when you are hungry? (trust me, you'll know the difference.) and stop when you feel you are getting full? Maybe try to make up a meal plan for eating 100-200kcal above your BMR, something like oats, oatmeal and other high fibre food? Should keep you full. To distract yourself from binging, go for a walk or watch a movie, don't buy big portions of sweets (it's hard I know, been there many times.. ) , instead buy a small twinx chocolate bar or something alternative?",
          "created_utc": 1606180057.0
        }
      ]
    },
    {
      "id": "gdenfzl",
      "author": "picklednood1e",
      "body": "Yeah same I wasn't \"skinny\" either and at first I really tought that I was just trying to lose weight in a healthy way even though when I look back it was far from being healthy.\n\nWish you the best !",
      "created_utc": 1606190493.0,
      "score": 2,
      "context": [
        {
          "id": "gdeknnm",
          "author": "wat-potato",
          "body": "I relate to this so much :((( especially the environment of being in quarantine it accelerated my disordered thoughts about food to the point where I took action w the unhealthy restriction, over exercise & binging cycles. I’m abit older (f20) but just want to say the fact that you’re talking about it and recognising the unhealthy relationship w food is such a big step in itself! for a long time I didn’t think anything was wrong solely bc I wasn’t “skinny” which is so messed up! wishing u all the best & here if u ever need to talk to help get through it together !!!",
          "created_utc": 1606188898.0
        }
      ]
    },
    {
      "id": "gde1dwk",
      "author": "jeabgrenouille",
      "body": "I can't speak for you, but for me, I was basically never full for a period of time. Even if my stomach hurt from eating so much, I still wanted to keep eating. That was what I had for hunger cues, but my body was reacting logically to having been starved for an extended period of time. My advice is to be patient and keep eating, and over time, your body will know it does not need to survive a famine anymore and food is plentiful and your hunger cues will come back.",
      "created_utc": 1606178528.0,
      "score": 5,
      "context": [
        {
          "id": "gdbsh39",
          "author": "jeabgrenouille",
          "body": "What I will say could possibly be reassuring? The same thing happened to me. I was extremely restrictive, I gained some weight and started doing better, and then I relapsed into restricting. After that relapse, I got extreme hunger for the first time, and I could not tolerate an ounce of restriction. I couldn't even handle waiting an extra minute for a meal. I over ate almost every day and some days, I ate basically non stop. Obviously, I gained some weight. \n\nFortunately, I stopped weighing myself, and because I was so hungry, I couldn't consider doing something about the weight gain because it would be impossible with the insanely strong impulse I had to eat and inability to not eat. I was generally unhappy with my body at that time, though, and I was unhappy that I couldn't seem to control myself. I thought I was a mess.\n\nThe good news is, that didn't last forever. Little by little, I noticed myself becoming more and more \"normal\" around food. Every once in a while, I would notice that I did something that I never used to be able to do, and it was suddenly possible (like forgetting about food, waiting for a meal, not working out, eating out with no anxiety... Stuff like that) . That came about because I kept eating every day (I felt like I had no choice on that haha) and I started challenging my fears about eating certain foods and doing a certain amount of exercise. \n\nIt seems like, for lots of people, this phase lasts several months. For me, it lasted years, but I believe that that was because for the first few years, I continued to exercise a lot and restrict certain foods and try to limit my intake too much (even though I would never succeed at this because my extreme hunger was so powerful). \n\nNow, I feel really normal around food. It is such a small part of my day now, and it used to be the #1 thing that I would think about. I lost the extra weight I had gained without trying.\n\nThis year has been so awful. I'm sorry that it affected you in this way. Compulsive restriction is often triggered by a life event (for me, it started when I changed schools). I wish the best for you <3\n\nTLDR; Being well-fed for a long time and finally letting go of food fears and restrictions and compulsive exercise got me to be a much more normal eater and caused me to lose weight I had gained during a period of extreme hunger.",
          "created_utc": 1606136687.0
        },
        {
          "id": "gde0szu",
          "author": "picklednood1e",
          "body": "Wow thank you for your reply ! I do feel impatient  when it comes to food and I can't stand being hungry because it triggers my binge eating. What I understood from your experience is that I should be patient because technically this is recovery and well it takes some time. I'm gonna try to not weight myself even though it is abit hard to resist the temptation. I would say that I don't restrict and over exercise now, my main problem is that I can't really know when to stop eating and I always want to eat as much as I can. Like I said, I over eat every day and yeah it's technically not always a binge but I'm definitely in a big calorie surplus and I am not skinny so this is not a surplus that I need to be healthy. I think I need to do something to recognize my hunger cues and stop eating when I'm full.",
          "created_utc": 1606178211.0
        }
      ]
    },
    {
      "id": "gde1bov",
      "author": "picklednood1e",
      "body": "I totally feel you for the hunger part! My stomach can be in pain because I ate so much but I would still continue eating. And it's embarrassing when my family is around because they would see me combing back for another and another piece of cake, for example. Sometimes I have to stop myself because it's embarrassing but if I could I would eat the whole cake with no problem. Anyways, good luck  and I hope that your relationship with food can get better soon! :)",
      "created_utc": 1606178495.0,
      "score": 2,
      "context": [
        {
          "id": "gdbsh39",
          "author": "jeabgrenouille",
          "body": "What I will say could possibly be reassuring? The same thing happened to me. I was extremely restrictive, I gained some weight and started doing better, and then I relapsed into restricting. After that relapse, I got extreme hunger for the first time, and I could not tolerate an ounce of restriction. I couldn't even handle waiting an extra minute for a meal. I over ate almost every day and some days, I ate basically non stop. Obviously, I gained some weight. \n\nFortunately, I stopped weighing myself, and because I was so hungry, I couldn't consider doing something about the weight gain because it would be impossible with the insanely strong impulse I had to eat and inability to not eat. I was generally unhappy with my body at that time, though, and I was unhappy that I couldn't seem to control myself. I thought I was a mess.\n\nThe good news is, that didn't last forever. Little by little, I noticed myself becoming more and more \"normal\" around food. Every once in a while, I would notice that I did something that I never used to be able to do, and it was suddenly possible (like forgetting about food, waiting for a meal, not working out, eating out with no anxiety... Stuff like that) . That came about because I kept eating every day (I felt like I had no choice on that haha) and I started challenging my fears about eating certain foods and doing a certain amount of exercise. \n\nIt seems like, for lots of people, this phase lasts several months. For me, it lasted years, but I believe that that was because for the first few years, I continued to exercise a lot and restrict certain foods and try to limit my intake too much (even though I would never succeed at this because my extreme hunger was so powerful). \n\nNow, I feel really normal around food. It is such a small part of my day now, and it used to be the #1 thing that I would think about. I lost the extra weight I had gained without trying.\n\nThis year has been so awful. I'm sorry that it affected you in this way. Compulsive restriction is often triggered by a life event (for me, it started when I changed schools). I wish the best for you <3\n\nTLDR; Being well-fed for a long time and finally letting go of food fears and restrictions and compulsive exercise got me to be a much more normal eater and caused me to lose weight I had gained during a period of extreme hunger.",
          "created_utc": 1606136687.0
        },
        {
          "id": "gdbzm7v",
          "author": "wholesome100chonker6",
          "body": "this makes me feel so relieved. i restricted for a few months and then got caught in a binge/restrict cycle where i would binge because i was extremely hungry and then fast for several days afterwards\n\ni’m trying to recover now and i’m just so hungry constantly i don’t know what to do about it, my stomach is so full it hurts but i’m still hungry\n\nwhat do i do about the hunger? i feel like if it was my choice i’d never stop eating but im really scared to gain back all the weight i lost and then never be able to lose it again",
          "created_utc": 1606141584.0
        }
      ]
    },
    {
      "id": "gde59d1",
      "author": "picklednood1e",
      "body": "Not gonna lie I am scared of going to a clinic because I haven't told my parents about my ed and if I go to a clinic they'll probably find out about it. I just don't have a close relationship with them and it would make me feel really uncomfortable to talk about it. My school doesn't even have a psychologist or a social worker this year, just some counselors who don't really have time for me. But if they get a new psychologist I would definitely schedule a meeting .",
      "created_utc": 1606180628.0,
      "score": 1,
      "context": [
        {
          "id": "gdc5871",
          "author": "picklednood1e",
          "body": "Hey everyone thank you so much for your replies! Feel free to message me if you want to talk about the struggle  💓",
          "created_utc": 1606144840.0
        },
        {
          "id": "gdcflwv",
          "author": "One-Awareness9491",
          "body": "Do you happen to have an eating disorder clinic near you? I’ve deal kind of the same as you and also f(16), now I’m kind of doing better but I still want to get the help and make it so I can enjoy food about thinking 20mins and feeling guilty for each meal I decide to eat. Not sure if it’ll be helpful but it’s worth a shot to go to one and talk to a professional. If not, the comments here honestly seem really helpful but either way I wish the best for you",
          "created_utc": 1606150187.0
        }
      ]
    },
    {
      "id": "gdeaj9w",
      "author": "not_0K",
      "body": "I understand the complex dynamics at play when it comes to EDs. I believe in you. You know yourself best and should do what you think is right for you! I wish you every success 💕💕",
      "created_utc": 1606183463.0,
      "score": 1,
      "context": [
        {
          "id": "gdbsocf",
          "author": "not_0K",
          "body": "I completely relate and have found that scheduled meals really help. At first I wasn’t hungry for breakfast ever because I would binge so hard the day before usually late in the day. But I would eat a “normal” sized breakfast around 8-9am, have lunch at 12-1 and a dinner between 5-6pm. Over a week of doing this helped restore my hunger cues but did not curb my craving for food. I think because I had restricted for so long, my body entered starvation mode so was food-seeking constantly. To help with this, I would either allow myself a snack, go for a walk, chew some gum, drink a delicious tea or hot chocolate, but overall try to move on until the next meal. Not every day is perfect. I still have days that I crave a binge but I do it must less frequently now. I use the app “Days Since” and it motivates me to see how many days it has been since my last big binge. It’s been weeks and I am much happier. Also remember that there are multiple forms of “purging”. I don’t make myself sick because I can’t stand the feeling of it and physically I don’t think I’m able to but over exercising is another form of purging. Make sure you are drinking plenty of water and sleeping at least 8 hours. Make sure you are managing stress. Those things alone will help a good amount. If you haven’t tried therapy maybe consider that. It’s not for everyone. So far I’ve found journaling for me helps more than therapy but everyone is different. \n\nSome resources you can look into are the free eating disorder [guides and info](https://www.cci.health.wa.gov.au/Resources/Looking-After-Yourself/Disordered-Eating) here. Carolyn Costin’s 8 keys recovery workbook helped me gain more insight into why I eat the way I do. My piece of advice to you is this: do NOT start following diets. This is not the time to go keto or try intermittent fasting or go vegan. Just stick with what you were eating and how you were eating before you first noticed these behaviours. Do NOT engage in dangerous activities. Smoking or over consumption of energy drinks to curb your appetite literally kills you in the long run. It is not a badge of honour to abuse your body. You are more than your ED. You are a person, whole and worthy of love. It is ok to fail but you can always try again. Take care of yourself 💕",
          "created_utc": 1606136841.0
        },
        {
          "id": "gde2415",
          "author": "picklednood1e",
          "body": "Thank you for your reply! I don't think that scheduled meals would work well for me but it's something I am willing to try. It's just that scheduling meals is some form of restriction for me because if for example I'd have to eat supper around 6 but I am hungry way before that, I'd have to wait and be hungry which is triggering for me since this is exactly what I did back when I was trying to lose weight fast and obsessing over food. But I think having some snacks and overall larger meals could help me not feel that hunger in between meals. I journal and it is something that makes me  understand myself more. And yes, the sleep and stress part is so important! I try to get at least 8h of sleep per night but it's not always possible and I am a quite anxious person.",
          "created_utc": 1606178920.0
        }
      ]
    },
    {
      "id": "gdeus8l",
      "author": "None",
      "body": "this exact same thing happened to me too. this is a very good answer. I wish w good luck to all of you",
      "created_utc": 1606195172.0,
      "score": 3,
      "context": [
        {
          "id": "gdbsh39",
          "author": "jeabgrenouille",
          "body": "What I will say could possibly be reassuring? The same thing happened to me. I was extremely restrictive, I gained some weight and started doing better, and then I relapsed into restricting. After that relapse, I got extreme hunger for the first time, and I could not tolerate an ounce of restriction. I couldn't even handle waiting an extra minute for a meal. I over ate almost every day and some days, I ate basically non stop. Obviously, I gained some weight. \n\nFortunately, I stopped weighing myself, and because I was so hungry, I couldn't consider doing something about the weight gain because it would be impossible with the insanely strong impulse I had to eat and inability to not eat. I was generally unhappy with my body at that time, though, and I was unhappy that I couldn't seem to control myself. I thought I was a mess.\n\nThe good news is, that didn't last forever. Little by little, I noticed myself becoming more and more \"normal\" around food. Every once in a while, I would notice that I did something that I never used to be able to do, and it was suddenly possible (like forgetting about food, waiting for a meal, not working out, eating out with no anxiety... Stuff like that) . That came about because I kept eating every day (I felt like I had no choice on that haha) and I started challenging my fears about eating certain foods and doing a certain amount of exercise. \n\nIt seems like, for lots of people, this phase lasts several months. For me, it lasted years, but I believe that that was because for the first few years, I continued to exercise a lot and restrict certain foods and try to limit my intake too much (even though I would never succeed at this because my extreme hunger was so powerful). \n\nNow, I feel really normal around food. It is such a small part of my day now, and it used to be the #1 thing that I would think about. I lost the extra weight I had gained without trying.\n\nThis year has been so awful. I'm sorry that it affected you in this way. Compulsive restriction is often triggered by a life event (for me, it started when I changed schools). I wish the best for you <3\n\nTLDR; Being well-fed for a long time and finally letting go of food fears and restrictions and compulsive exercise got me to be a much more normal eater and caused me to lose weight I had gained during a period of extreme hunger.",
          "created_utc": 1606136687.0
        },
        {
          "id": "gde0szu",
          "author": "picklednood1e",
          "body": "Wow thank you for your reply ! I do feel impatient  when it comes to food and I can't stand being hungry because it triggers my binge eating. What I understood from your experience is that I should be patient because technically this is recovery and well it takes some time. I'm gonna try to not weight myself even though it is abit hard to resist the temptation. I would say that I don't restrict and over exercise now, my main problem is that I can't really know when to stop eating and I always want to eat as much as I can. Like I said, I over eat every day and yeah it's technically not always a binge but I'm definitely in a big calorie surplus and I am not skinny so this is not a surplus that I need to be healthy. I think I need to do something to recognize my hunger cues and stop eating when I'm full.",
          "created_utc": 1606178211.0
        },
        {
          "id": "gde1dwk",
          "author": "jeabgrenouille",
          "body": "I can't speak for you, but for me, I was basically never full for a period of time. Even if my stomach hurt from eating so much, I still wanted to keep eating. That was what I had for hunger cues, but my body was reacting logically to having been starved for an extended period of time. My advice is to be patient and keep eating, and over time, your body will know it does not need to survive a famine anymore and food is plentiful and your hunger cues will come back.",
          "created_utc": 1606178528.0
        }
      ]
    },
    {
      "id": "gde2n1t",
      "author": "picklednood1e",
      "body": "Thank you this gave me hope :)",
      "created_utc": 1606179208.0,
      "score": 2,
      "context": [
        {
          "id": "gdbsh39",
          "author": "jeabgrenouille",
          "body": "What I will say could possibly be reassuring? The same thing happened to me. I was extremely restrictive, I gained some weight and started doing better, and then I relapsed into restricting. After that relapse, I got extreme hunger for the first time, and I could not tolerate an ounce of restriction. I couldn't even handle waiting an extra minute for a meal. I over ate almost every day and some days, I ate basically non stop. Obviously, I gained some weight. \n\nFortunately, I stopped weighing myself, and because I was so hungry, I couldn't consider doing something about the weight gain because it would be impossible with the insanely strong impulse I had to eat and inability to not eat. I was generally unhappy with my body at that time, though, and I was unhappy that I couldn't seem to control myself. I thought I was a mess.\n\nThe good news is, that didn't last forever. Little by little, I noticed myself becoming more and more \"normal\" around food. Every once in a while, I would notice that I did something that I never used to be able to do, and it was suddenly possible (like forgetting about food, waiting for a meal, not working out, eating out with no anxiety... Stuff like that) . That came about because I kept eating every day (I felt like I had no choice on that haha) and I started challenging my fears about eating certain foods and doing a certain amount of exercise. \n\nIt seems like, for lots of people, this phase lasts several months. For me, it lasted years, but I believe that that was because for the first few years, I continued to exercise a lot and restrict certain foods and try to limit my intake too much (even though I would never succeed at this because my extreme hunger was so powerful). \n\nNow, I feel really normal around food. It is such a small part of my day now, and it used to be the #1 thing that I would think about. I lost the extra weight I had gained without trying.\n\nThis year has been so awful. I'm sorry that it affected you in this way. Compulsive restriction is often triggered by a life event (for me, it started when I changed schools). I wish the best for you <3\n\nTLDR; Being well-fed for a long time and finally letting go of food fears and restrictions and compulsive exercise got me to be a much more normal eater and caused me to lose weight I had gained during a period of extreme hunger.",
          "created_utc": 1606136687.0
        },
        {
          "id": "gde0szu",
          "author": "picklednood1e",
          "body": "Wow thank you for your reply ! I do feel impatient  when it comes to food and I can't stand being hungry because it triggers my binge eating. What I understood from your experience is that I should be patient because technically this is recovery and well it takes some time. I'm gonna try to not weight myself even though it is abit hard to resist the temptation. I would say that I don't restrict and over exercise now, my main problem is that I can't really know when to stop eating and I always want to eat as much as I can. Like I said, I over eat every day and yeah it's technically not always a binge but I'm definitely in a big calorie surplus and I am not skinny so this is not a surplus that I need to be healthy. I think I need to do something to recognize my hunger cues and stop eating when I'm full.",
          "created_utc": 1606178211.0
        },
        {
          "id": "gde1dwk",
          "author": "jeabgrenouille",
          "body": "I can't speak for you, but for me, I was basically never full for a period of time. Even if my stomach hurt from eating so much, I still wanted to keep eating. That was what I had for hunger cues, but my body was reacting logically to having been starved for an extended period of time. My advice is to be patient and keep eating, and over time, your body will know it does not need to survive a famine anymore and food is plentiful and your hunger cues will come back.",
          "created_utc": 1606178528.0
        }
      ]
    },
    {
      "id": "gdhzm1t",
      "author": "One-Awareness9491",
      "body": "I feel that, my mom and I are kind of close though but I would feel uncomfortable talking to her about this stuff. I went to the doctor on my own and everything, but yeah I’d get being worried about them finding out.",
      "created_utc": 1606261897.0,
      "score": 1,
      "context": [
        {
          "id": "gdc5871",
          "author": "picklednood1e",
          "body": "Hey everyone thank you so much for your replies! Feel free to message me if you want to talk about the struggle  💓",
          "created_utc": 1606144840.0
        },
        {
          "id": "gdcflwv",
          "author": "One-Awareness9491",
          "body": "Do you happen to have an eating disorder clinic near you? I’ve deal kind of the same as you and also f(16), now I’m kind of doing better but I still want to get the help and make it so I can enjoy food about thinking 20mins and feeling guilty for each meal I decide to eat. Not sure if it’ll be helpful but it’s worth a shot to go to one and talk to a professional. If not, the comments here honestly seem really helpful but either way I wish the best for you",
          "created_utc": 1606150187.0
        },
        {
          "id": "gde59d1",
          "author": "picklednood1e",
          "body": "Not gonna lie I am scared of going to a clinic because I haven't told my parents about my ed and if I go to a clinic they'll probably find out about it. I just don't have a close relationship with them and it would make me feel really uncomfortable to talk about it. My school doesn't even have a psychologist or a social worker this year, just some counselors who don't really have time for me. But if they get a new psychologist I would definitely schedule a meeting .",
          "created_utc": 1606180628.0
        }
      ]
    }
  ]
}