{
  "id": "k1k6gd",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1606414093.0,
  "title": "Request: Should I let my recovering daughter buy a scale?",
  "selftext": "This may seem obvious to some but allow me to explain. For the last two months, my adult daughter has been trying to adhere to a weight-restoration diet as well as seeing a doctor via telehealth once every two weeks in order to treat her anorexia. She seems very unhappy, but she still adheres to her meal-plan for the most part. The days of her appointments, she is supposed to weigh herself, so I’ve reluctantly agreed to let her keep a scale in her bathroom. \n\nWell, today our scale broke, and I wouldn’t hesitate to buy a new one for the doctor’s measurements if I didn’t feel like my daughter gave me so many reasons to pause. For example, how did she realise the scale was broken on a day she isn’t allowed to weigh herself? Furthermore, when I said I would “wait and see” about buying another one, she started crying, begging me to understand how much she “needs” a scale. She’s also been losing a little bit of weight over the last two weeks, so I’m concerned she’s measuring her weight then compensating for her diet in some way. After all, she admitted a few days ago that she was hoping the target weight set by the doctor would turn out to be an “overestimation” \n\nI don’t know, should I replace the broken scale if she’s this upset about it? Do you think there’s a way for an anorexic to own a scale and not reinforce their disease?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k1k6gd/request_should_i_let_my_recovering_daughter_buy_a/",
  "score": 67,
  "num_comments": 25,
  "comments": [
    {
      "id": "gdopetc",
      "author": "None",
      "body": "if you do buy one, an idea could be to keep it in your possession (like your bathroom or bedroom) and give it to her so she can weigh herself only on the days she is meant to. i completely understand why you wouldn’t want to buy her a new scale, and i think it’s worth talking to her doctor about. maybe you could work out a plan so she is weighed at the appointments instead of at home? best of luck to the both of you <3",
      "created_utc": 1606414909.0,
      "score": 78,
      "context": []
    },
    {
      "id": "gdpaptf",
      "author": "MaryContrary26",
      "body": "A scale is perhaps the greatest barrier to recovery. Why? Generally people in recovery want to recover...unless it means actually gaining weight. It's really important to shift the focus away from the body and weight. And I hope she is wrapped in support (other than medical).",
      "created_utc": 1606424418.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gdosogt",
      "author": "HookomOnHealth",
      "body": "I would consult with her doctor about it and see what their perspective is. Based on what you've shared, it sounds like your daughter's ED may be trying to get a scale to fight weight restoration. If you do get another scale, it might be a good idea to keep the scale in your control and not your daughter's as it sounds like her ED is still strong and trying to call the shots for her. I think her doctor would best be able to determine whether her having a scale to track weight restoration outweighs the risk of the scale fueling her ED.",
      "created_utc": 1606416328.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gdoy6pb",
      "author": "seatangle",
      "body": "As weighing is part of her treatment plan, get a new scale, but don't let her keep it in her bathroom. Only allow her to use it when she is supposed to weigh herself. Personally, I find the idea of a recovering anorexic weighing themselves on their own rather strange and counterproductive, but perhaps it's a necessity due to the pandemic. I used to be anorexic and I still can't own a scale and prefer not to know my weight at all. The simplest thing to do is to take away the possibility of being tempted by the scale, because it just doesn't need to be there.",
      "created_utc": 1606418775.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gdpkexy",
      "author": "Wizards_Checks",
      "body": "No scale. \nNo seeing her weight.\nJust no. Absolutely no.",
      "created_utc": 1606430021.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gdpf3wv",
      "author": "bellasuperstring",
      "body": "Do not keep a scale out. Put it away somewhere inconvenient between uses if your doctor insists on it.",
      "created_utc": 1606426920.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gdoqzf4",
      "author": "Poison-_-Ivy",
      "body": "Please do not let her buy one",
      "created_utc": 1606415592.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gdp7lkn",
      "author": "jeabgrenouille",
      "body": "Maybe she needs a scale, she does not necessarily need to see the number, right? My dad used to weigh me between appointments to make sure I was staying on track (honestly very necessary) and he would not let me look at the scale. I was a kid at the time so maybe that's easier said than done, but maybe at a time that she is feeling better, you could discuss the idea and see if she agrees that it is not helpful for her to see the number and maybe she will agree that the number should be hidden from her. \n\nIf she has a bad day and begs to see the number, you can go back to the fact that it was her decision to not look. \n\nIf she do a not agree with the idea to have you weigh her and you hide the number, maybe she will come around to that idea in time if you don't push it and trust that she will take steps to improve when she is ready if she feels safe to do so",
      "created_utc": 1606422967.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gdphnbm",
      "author": "stressedrepressed",
      "body": "No. Just don't, it's a terrible idea.",
      "created_utc": 1606428385.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gdoy6lp",
      "author": "Jothepotatohoe",
      "body": "When I was recovering and still used the scale to weigh myself it would make me feel awful and there were some occasions I couldn't take seeing my weight coming up and locked myself in my room to not eat. This was just a vicious cycle until my dad took away the scale so I couldn't weigh myself anymore. At first I was panicking badly but flash forward a few years and I'm fully recovered and maintain a healthy size but I've not weighed myself in years and don't plan on doing so as I find using my clothes as an indicator is all I need. I would talk to the doctor of course but this was my personal experience with scales and, personally, I think they hinder rather than help recovery.",
      "created_utc": 1606418774.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gdqdlab",
      "author": "ahchava",
      "body": "I have absolutely taken scales away from my friends when they needed me too. On appointment days they got weighed at the doctor. I’ve never had a doctor be upset or ask them to repurchase a scale. I would discuss the interaction with her doctor if you can, (even if you just end an email that you don’t get a response to) and her doctor can communicate her treatment plan with her. Crying about needing to weigh herself is not behavior that most doctors would be expecting if they are requiring her to weigh herself at home. As an adult she is responsible to follow her own treatment plan, but sharing your experience with her doctor can help the doctor develop that plan.",
      "created_utc": 1606448798.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdoq5xk",
      "author": "2jz93",
      "body": "What would you buy the scale to begin with why would she need it",
      "created_utc": 1606415222.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gdonl07",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1606414093.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdpnt5b",
      "author": "notyouraverage924",
      "body": "How old is she?",
      "created_utc": 1606432075.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdq8t7b",
      "author": "makeupyourworld",
      "body": "if she is an adult its hard to stop her. sincerely an adult who drives her worried mom insane",
      "created_utc": 1606445576.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdq9rmy",
      "author": "swaggysalamander",
      "body": "i wouldn’t recommend buying it with her knowledge. if you need a scale, buy one. but make sure to hide it super well because when you have an eating disorder, you’re desperate. just don’t let her know.",
      "created_utc": 1606446199.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdqf5bt",
      "author": "elite-alien",
      "body": "Noooooooooooooo. I freak out every time I see my weight. It's just a number, hence no one needs to know it. (Except her doctor).",
      "created_utc": 1606449858.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdqpyp3",
      "author": "zonkschonk",
      "body": "Depending on the way your doctors office and insurance work, she may be able to go into nurse triage and get a blind weigh in and blood pressure check, and have them send it directly to the doctor. My nutritionist has had me do this every two weeks for a few months and it actually works very well.",
      "created_utc": 1606457864.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdqwn0g",
      "author": "hazelnut_mylk",
      "body": "i didn’t read the text. just from the title alone, NO. \n\nand maybe it’s to track if she’s making weight gain progress or whatever. but think about what that act represent? we always say recovery is just as mental as it is physical so why the scale? \n\nher mental health and well being is far more important than what she weighs. \n\nand she’s understandably upset about it but don’t let the crying sway you. anorexia is a hideous illness that’ll do whatever it have in its power to try and keep sufferers from recovering. while she might not understand it now, in time to come, your daughter will thank you for ur support in helping her recover. her life should not be ruled by a scale. \n\nsupport her, and be persistent and patient. it’s going to take a while. she’s an adult now, as you said, and i can’t imagine spending more of her adults years to this. all the best to your family.",
      "created_utc": 1606463537.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdrdpte",
      "author": "unicornbaby23",
      "body": "NO NO. Please this should be a warning sign how upset she was over the old scale being broken. Pleaseeee! Keep scales out of the house. They will only hold her back on her recovery. She can get weighed at her dr appts as needed. She is in recovery from an eating disorder she is having a hard enough time existing without the temptation to weigh herself after every activity. 💗",
      "created_utc": 1606480954.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdrfkdj",
      "author": "Juliakerman",
      "body": "Yep, if think you shouldn't buy a scale at all.... the problem is, being anorexic, the number is never the *good* number. When it's too low you freak out (but still keep losing on weight) and when it's too high well... you freak out too. Your house shouldn't be a place where she weights herself as it is a really anxious process. She may be really frustrated about you not buying a scale but believe me it's the best thing to do !! The weight in should be done under medical circumstances, it has to be spatially delimited. And the doc can help her processing the weight in. Stay strong, your daughter and you :)",
      "created_utc": 1606482338.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ge0hhe0",
      "author": "sko03",
      "body": "By the way it's so kind that you would come on here and ask this question. It's really brave and shows how much you care. Your daughter needs your support and will get so much farther with you. I know I wouldn't be as far in my recovery without my support people.\n\nThere are a lot of good suggestions here. I'm in outpatient therapy, and the scale is a major part of my recovery. It's a reassurance checking that I'm okay, not gaining weight, feel secure and in control, and a major head trip. Just the idea of giving over that control still messes with my head.\n\n I went from weighing myself constantly every day to once a week. Now I'm at twice a week. She (and maybe you together) should talk to her doctor. Maybe she has started weighing more. Or maybe the idea of not having a scale is scaring her. Maybe she has been following the plan. It's hard to say. But a good tool may also be that she weighs herself with you. That way another person is aware of her weight and when she weighs herself. I'm also not supposed to keep my scale out where I can see it or easily step on it to reduce the urge. If you have any other questions, we are here!",
      "created_utc": 1606646847.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gdot8in",
      "author": "Bailzasaurus",
      "body": "Yes, this! If her doctor truly needs her to weigh herself, get the scale but do not let it be generally accessible. Also, and this would require the daughter’s cooperation, but would it be possible fir your daughter to weigh herself without looking at the number, you record it, and communicate it to her doctor? \nAlso, is she getting any kind of therapy in addition to the medical treatment? It seems like she maybe needs more support. \n\n(I say this as someone who was able to get rid of the worst of my ED behaviours without actually dealing with the thoughts in a significant way, and it cane back big this year. I want for your daughter to have help getting better physically AND mentally ❤️)",
      "created_utc": 1606416574.0,
      "score": 30,
      "context": [
        {
          "id": "gdopetc",
          "author": "None",
          "body": "if you do buy one, an idea could be to keep it in your possession (like your bathroom or bedroom) and give it to her so she can weigh herself only on the days she is meant to. i completely understand why you wouldn’t want to buy her a new scale, and i think it’s worth talking to her doctor about. maybe you could work out a plan so she is weighed at the appointments instead of at home? best of luck to the both of you <3",
          "created_utc": 1606414909.0
        }
      ]
    },
    {
      "id": "gdottbq",
      "author": "Motherfukky",
      "body": "When I go to the doctor I get on the scale backwards so that I'm not able to read it, maybe that could be helpful for her?",
      "created_utc": 1606416832.0,
      "score": 15,
      "context": [
        {
          "id": "gdopetc",
          "author": "None",
          "body": "if you do buy one, an idea could be to keep it in your possession (like your bathroom or bedroom) and give it to her so she can weigh herself only on the days she is meant to. i completely understand why you wouldn’t want to buy her a new scale, and i think it’s worth talking to her doctor about. maybe you could work out a plan so she is weighed at the appointments instead of at home? best of luck to the both of you <3",
          "created_utc": 1606414909.0
        },
        {
          "id": "gdot8in",
          "author": "Bailzasaurus",
          "body": "Yes, this! If her doctor truly needs her to weigh herself, get the scale but do not let it be generally accessible. Also, and this would require the daughter’s cooperation, but would it be possible fir your daughter to weigh herself without looking at the number, you record it, and communicate it to her doctor? \nAlso, is she getting any kind of therapy in addition to the medical treatment? It seems like she maybe needs more support. \n\n(I say this as someone who was able to get rid of the worst of my ED behaviours without actually dealing with the thoughts in a significant way, and it cane back big this year. I want for your daughter to have help getting better physically AND mentally ❤️)",
          "created_utc": 1606416574.0
        }
      ]
    }
  ]
}