{
  "id": "k25gsw",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1606498124.0,
  "title": "Request: What is the right amount to be eating?",
  "selftext": " \n\n I (20F) am not officially diagnosed, but I acknowledge that I have an unhealthy relationship with food. I spent a lot of time at home since quarantine, and my parents made awful comments about my weight and called me a lot of names. Korean standards are severe. I was a healthy weight, probably considered thin still. At first I started exercising for myself, but it slowly turned into restricting because I wanted the exercise to have more effect, and I did not want to hear the comments anymore. I lost a decent amt of weight before leaving for school - was still a healthy weight. I didn't have to hear the comments, but it started becoming a fear of what they would say when I came back from school. I started mentally counting calories and on an app, and if I knew that I was going out or eating a lot on some days, I would plan for it ahead of time. I didn't have access to a scale, so I didn't know I was losing a lot more. So, when I got home, it both felt really good and horrible to hear my parents saying that I got very thin and to see it on the scale. I know that I should be talking to a therapist, but the school one that is free and one that I wouldn't have to tell my parents about cannot practice on zoom because I don't live in the state I go to school in. My parents believe that only psychotic people go to therapy so telling them is not really an option and they have expressed before how embarrassing it is to see other kids go because it means the parents failed. I have expressed to them before that I absolutely do not appreciate comments about my weight, but they see it as a joke. I have told my bf and some friends, so they are really helpful to talk to, but most of the journey rests on me. Real therapy/help is not really an option until I go back to school in two months, but I do not want to lose more weight and want to be more stable until then. However, I have genuinely no concept of what is enough food, because I thought I was doing better in eating the last month, only to have lost more. So what is an average day of eating look like for someone that is 5 4' and does anyone have any suggestions as to what I can do? Is counting calories to see if I am getting enough food a bad idea?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k25gsw/request_what_is_the_right_amount_to_be_eating/",
  "score": 39,
  "num_comments": 7,
  "comments": [
    {
      "id": "gdsce8g",
      "author": "annieo6008",
      "body": "Counting calories is probably not helpful. My dietician told me to try to get a little of each food group w 3 meals and 2 snacks. Each major meal has a serving of carb, protein, fat, and fruit/veggie. Each snack has one serving of protein and one serving of carb (for example, peanut butter on crackers) or fruit (peanut butter on apple). However, I am not a medical doctor and this is just a suggestion",
      "created_utc": 1606500750.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gdsmxq4",
      "author": "None",
      "body": "I’m a therapist, feel free to message me if you want to talk. I worked in a residential center for eating disorders and have struggled myself. It’s not easy but I’m glad you’re seeking help. You got this 🙏",
      "created_utc": 1606506224.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gdswppd",
      "author": "HookomOnHealth",
      "body": "Calorie counting is likely not going to be particularly helpful and may actually fuel an unhealthy relationship with food.\n\nPersonally, I don't think it's helpful to be super rigid with food, but it might help to think about eating a meal/snack with a protein, carb, and fat at least every 3-5 hours.\n\nIt sounds like you're planning on seeking out professional help once you return to school which is great!",
      "created_utc": 1606511649.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gds6hcj",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1606498124.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gds7ipg",
      "author": "LordExplosionMurderx",
      "body": "https://kellyinthekitch.blog/2017/10/17/my-recovery-meal-plan-a-few-tipstricks-on-how-to-get-it-done-implement-it-get-healthy-not-despair-when-times-get-hard/\n\n\n\nHere’s a link that might help you. In general try to eat a variety of foods that you like and eat until you’re satisfied",
      "created_utc": 1606498591.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdt32yb",
      "author": "NachoCupcake",
      "body": "The questions that your asking would be more appropriate for a Dietitian than a therapist, would you be able to get around your parents that way?\n\nAlso, there are quite a few free online supports available, depending on where you live. Please DM me and I can try to help you out with finding appropriate supports for your location and situation.",
      "created_utc": 1606515195.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gdtljg0",
      "author": "hazelnut_mylk",
      "body": "everyone have diff nutritional needs based on activity, medical history, any health conditions, age and so on. that’s why a registered dietican is the best (and only person you should be asking) person to ask for advice. \n\nif you can’t afford to see a dietician, maybe look up intuitive eating? \nthere’s many RD (registered dietician) on Instagram who discussed this. and the point of intuitive eating isn’t to count calories. you see, counting calories to recovery is quite the oxymoron since the purpose of recovery is to not count calories and let go of food rules. \n\nand maybe look up CBT workbook or worksheet in the meantime before you return to school and seek out the professional help you need.",
      "created_utc": 1606526011.0,
      "score": 2,
      "context": []
    }
  ]
}