{
  "id": "k25kf4",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1606498428.0,
  "title": "Request: My husband has lost a lot of weight due to medical problems and it’s starting to effect my recovery",
  "selftext": "My husband has had ongoing undiagnosed medical problems for about a year that have caused him to not be able to eat a normal amount of food and certain types of foods. He has lost a lot of weight and now weighs only a few pounds more than me. I have been in recovery from my ED for about three years and have been at a healthy weight but his weight loss is starting to trigger my ED thoughts again. I’ve always had this distorted idea that I have to be much smaller than men to be attractive and to feel confident about myself and his weight loss is making me feel insecure about myself and unattractive. I’m beginning to want to restrict and over-exercise again and I’m really struggling. My husband has mental health problems as well and I think part of his mystery physical illness is mental and maybe an ED. I just feel really triggered and I have worked so hard on my recovery and to feel confident at my healthy weight and I don’t know what to do... any advice is greatly appreciated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k25kf4/request_my_husband_has_lost_a_lot_of_weight_due/",
  "score": 41,
  "num_comments": 2,
  "comments": [
    {
      "id": "gdthq2z",
      "author": "Northstar04",
      "body": "This is difficult to answer since we don't have specifics about either you or your husband. Are you seeing a therapist for your ED and have you asked them this question? If not, I would start there.\n\nSecond, I would communicate with your husband about how his weight loss is affecting you. It is possible he has a physical illness, which he should get diagnosed. If he has an ED, you may be feeding into each other's illness. Either way, you have a couple of options.\n\nOption 1 is for both of you to look at living together as an exposure (ERP) and that you owe it to each other to habituate to your anxieties and encourage each other to eat healthy amounts of food. \n\nOption 2 is for you to separate if Option 1 is not possible. Basically either you both get better together or you have to get better separately. The separation doesnt have to be permanent, but might impress upon each of you the seriousness of these issues and also provide a goal to recovery (getting back together and enjoying life together).\n\nAs I like to keep reminding people, it is BRAVE to recognize that your thoughts and/or behaviors are damaging your well being. There is lots of hope when you have this awareness and that hope grows the more insight you have and the more you committ to facing your fears and gradually conquering them. \n\nI do recommend speaking to a professional specializing in your issues as recovery is a process that is going to be hard (scary) and will require support.",
      "created_utc": 1606523697.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gds75b4",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1606498428.0,
      "score": 2,
      "context": []
    }
  ]
}