{
  "id": "k3bes7",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1606664542.0,
  "title": "Request: Reddit is triggering AF",
  "selftext": "Doesn’t it feel like nearly every day there’s a post trending here on Reddit talking about how now that someone has begun running X amount miles a day that they’ve saved themselves from all chronic illness and suffering and have lost a crapload of weight?? Then all the good stars and comments and trophies that follow. Man. It’s really tough to keep going your own way when the entire world including/especially the internet celebrates such triggering things. I get that people need to make choices to be healthy but no one ever cares to discuss the aftermaths of such a slippery-slope choice.\n\nEnd of rant, lol. Hope you guys had a sweet delicious thanksgiving. I’m stuffing my face and hope you are too.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k3bes7/request_reddit_is_triggering_af/",
  "score": 134,
  "num_comments": 17,
  "comments": [
    {
      "id": "ge1zbk2",
      "author": "WindTossed",
      "body": "And the amount of hate a lot of redditors have for people who are fat is awful. They say the most dehumanizing things and pretend it’s about “health” when it’s just hateful and cruel. This site can be rough",
      "created_utc": 1606669282.0,
      "score": 32,
      "context": []
    },
    {
      "id": "ge1vstp",
      "author": "Zelda_is_my_homegirl",
      "body": "It’s not just the internet. I’ve struggled with various eating disorders for 15 years. Last year I starved myself so badly that my gallbladder failed and I had to have it removed. \nI was significantly overweight/obese when that episode occurred, and all I heard was how great I looked with the weight loss. Not only was I suffering from my eating disorder, but when my gallbladder started failing I was incapable of eating. I cried every day just wanting to eat. \n\nAnd I heard from probably 50 or more coworkers how amazing it was. **one person** said “... I hope everything is ok and this isn’t a health issue”. It felt so good to have at least someone recognize how irregular and unhealthy it appeared. ..and to confess that everything was not ok. \n\nI have PCOS and a thyroid disorder that cause difficulty losing weight and unexplained weight gain. Sometimes I’m ok and I can eat normal, but then gaining weight triggers me, so I relapse into restricting. Every time I get sick and start listening to my eating disorder, I am rewarded and praised. \n\nI’ve just started treatment for the first time, and I’m so scared that I will end up in a position where people stop complementing my body again. It sounds so shallow, but when you hate your body, it feels so good for others to complement it.",
      "created_utc": 1606667864.0,
      "score": 33,
      "context": []
    },
    {
      "id": "ge27g6h",
      "author": "itasteyourbloodykiss",
      "body": "I find Reddit triggering but I think even more so for me is seeing actual pictures or videos of these “fit” people. All the diet and work out TV commercials are enough to like ruin my day sometimes honestly.. I can’t watch them, I have to look away. Twitter and Instagram trigger me a lot but Reddit does for even a larger number of reasons.",
      "created_utc": 1606673265.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ge25oo1",
      "author": "ahchava",
      "body": "In have a VERY carefully curated feed. I don’t ever go into trending or into normal reddit. I only ever look on my subreddits.",
      "created_utc": 1606672389.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ge22biz",
      "author": "Low-Euphoric",
      "body": "That is incredibly true. I believe this is because lots of people are just completely ignorant about what health really is. They do not understand that if you’re not mentally healthy, you cannot possibly be healthy physically (the brain has a huge impact on diseases, more than you’d think). So with that in mind, what’s the point of being « healthy » physically if you’re miserable inside? People are no aware of this, and it’s not necessarily their fault, they haven’t been exposed to that information. However it does make it more difficult to find the motivation to recover and follow through with it, but the obstacles make the victory more fulfilling ❤️ what I try to think of when I feel triggered is to see it as a challenge, which I can overcome with compassion to myself but also forgiveness to others who are simply not aware and don’t mean any harm. If the people complimenting you on your appearance are loved ones, inform them that you appreciate the intention but that in the future you would rather not hear those comments. If they are worth keeping in your life they will respect this.",
      "created_utc": 1606670712.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ge1px8i",
      "author": "None",
      "body": "I think it’s just typical of Redditors to do that like at r/NoFap where they believe that abstaining from fapping will transform your life into a Millionaire Chad",
      "created_utc": 1606665616.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ge1ms2h",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1606664542.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge333ur",
      "author": "anjaliv",
      "body": "Health has nothing at all to do with weight. That’s just the truth. The fact that someone can be malnourished, starving themselves and still be overweight is impossible to grasp for our body image obsessed society because we’ve been taught  that health is visible from the outside. That is our biggest issue. When one comes to understand WHY fat exists and also WHY people even store fat, suddenly none of the dieting/thinspo stuff makes any sense at all. Our bodies acclimate themselves to however they need to be to live, survive and thrive. Sure; we can always make healthy choices for our body. But still, what does it have to do with fat? It’s like if a larger bodied person decides to become healthy, that means weight loss. Why does society believe health is in any way visible on the outside? It’s not. Make easy health choices. Don’t attach it to weight. Oh and health is not a moral/ethical choice. Be healthy if you want to... that is all.",
      "created_utc": 1606686829.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ge4y4ds",
      "author": "OtmjT_596",
      "body": "I keep getting ads for intermittent fasting and that piss me off",
      "created_utc": 1606732327.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfchork",
      "author": "Heyjoehaze",
      "body": "It can be sometimes.",
      "created_utc": 1607651513.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ge33txp",
      "author": "anjaliv",
      "body": "Hey, I’m so sorry you’re going through this. That sounds really rough. I don’t think weight is ever as important as your well-being and we’re in a place in society right now where people just don’t get that yet. But you do you and do whatever you need to do for your health. Screw everyone else!!",
      "created_utc": 1606687187.0,
      "score": 3,
      "context": [
        {
          "id": "ge1vstp",
          "author": "Zelda_is_my_homegirl",
          "body": "It’s not just the internet. I’ve struggled with various eating disorders for 15 years. Last year I starved myself so badly that my gallbladder failed and I had to have it removed. \nI was significantly overweight/obese when that episode occurred, and all I heard was how great I looked with the weight loss. Not only was I suffering from my eating disorder, but when my gallbladder started failing I was incapable of eating. I cried every day just wanting to eat. \n\nAnd I heard from probably 50 or more coworkers how amazing it was. **one person** said “... I hope everything is ok and this isn’t a health issue”. It felt so good to have at least someone recognize how irregular and unhealthy it appeared. ..and to confess that everything was not ok. \n\nI have PCOS and a thyroid disorder that cause difficulty losing weight and unexplained weight gain. Sometimes I’m ok and I can eat normal, but then gaining weight triggers me, so I relapse into restricting. Every time I get sick and start listening to my eating disorder, I am rewarded and praised. \n\nI’ve just started treatment for the first time, and I’m so scared that I will end up in a position where people stop complementing my body again. It sounds so shallow, but when you hate your body, it feels so good for others to complement it.",
          "created_utc": 1606667864.0
        }
      ]
    },
    {
      "id": "ge2zdhi",
      "author": "nickdstd",
      "body": "Stay strong, you’ve so got this!",
      "created_utc": 1606684998.0,
      "score": 2,
      "context": [
        {
          "id": "ge1vstp",
          "author": "Zelda_is_my_homegirl",
          "body": "It’s not just the internet. I’ve struggled with various eating disorders for 15 years. Last year I starved myself so badly that my gallbladder failed and I had to have it removed. \nI was significantly overweight/obese when that episode occurred, and all I heard was how great I looked with the weight loss. Not only was I suffering from my eating disorder, but when my gallbladder started failing I was incapable of eating. I cried every day just wanting to eat. \n\nAnd I heard from probably 50 or more coworkers how amazing it was. **one person** said “... I hope everything is ok and this isn’t a health issue”. It felt so good to have at least someone recognize how irregular and unhealthy it appeared. ..and to confess that everything was not ok. \n\nI have PCOS and a thyroid disorder that cause difficulty losing weight and unexplained weight gain. Sometimes I’m ok and I can eat normal, but then gaining weight triggers me, so I relapse into restricting. Every time I get sick and start listening to my eating disorder, I am rewarded and praised. \n\nI’ve just started treatment for the first time, and I’m so scared that I will end up in a position where people stop complementing my body again. It sounds so shallow, but when you hate your body, it feels so good for others to complement it.",
          "created_utc": 1606667864.0
        }
      ]
    },
    {
      "id": "ge1s14z",
      "author": "OtmjT_596",
      "body": "r/NoFap is one of the worst, most toxic subreddit I've ever been on.",
      "created_utc": 1606666381.0,
      "score": 5,
      "context": [
        {
          "id": "ge1px8i",
          "author": "None",
          "body": "I think it’s just typical of Redditors to do that like at r/NoFap where they believe that abstaining from fapping will transform your life into a Millionaire Chad",
          "created_utc": 1606665616.0
        }
      ]
    },
    {
      "id": "ge5jizr",
      "author": "FoxiiFighter",
      "body": "\"Our bodies acclimate themselves to however they need to be to live, survive, and thrive\" \n\nWell, that certainly isn't happening in our society. Our bodies are not handling overly processed fast foods well or sedentary lifestyles well. They also aren't adapting to our crash diets, starvation, photo-shop inspired dysmorphia, or exercise binging.  \n\nGen Z is the first generation that may not outlive their parents due to the climbing obesity rates. Obesity related illnesses kill 30k a month in the U.S. Anorexia (undereating disorders in general) STILL have the highest mortality rates among all mental illnesses. That doesn't sound like surviving. \n\nOur culture and society is designed to fight every instinct our bodies have to be healthy, on all ends of the spectrum. Our food is designed to be overly palate-able and make us crave and binge it -- and it's available at the push of a button for a few bucks. Our ability to move and exercise is often crushed by work hours, commutes, and exhaustion, lack of sleep, etc.\n\nIn this society, you need to be aware. In order to stay in tune with your body, you can't just rely on your \"instincts\" because your instincts are literally silenced by sensory overstimulation and \"normalized\" eating practices. \n\nFat and weight are major parts of health and optimizing the human body. You can't be healthy if you're carrying an extra human's worth of weight on a single skeletal frame (fat or muscle) -- so, yes, you can visually see this aspect of health. You also can't be healthy if knees are bigger than your thighs, and you've got fluffs growing on your body to keep you warm.  But we are talking in extremes here. \n\nGenerally speaking, if someone is 15-20lbs over or underweight, you can't really determine their health by looking at them. But when you start getting into higher deviations from the norm, (under or over), it would be ignorant to deny the known health complications from those numbers.",
      "created_utc": 1606749198.0,
      "score": 2,
      "context": [
        {
          "id": "ge333ur",
          "author": "anjaliv",
          "body": "Health has nothing at all to do with weight. That’s just the truth. The fact that someone can be malnourished, starving themselves and still be overweight is impossible to grasp for our body image obsessed society because we’ve been taught  that health is visible from the outside. That is our biggest issue. When one comes to understand WHY fat exists and also WHY people even store fat, suddenly none of the dieting/thinspo stuff makes any sense at all. Our bodies acclimate themselves to however they need to be to live, survive and thrive. Sure; we can always make healthy choices for our body. But still, what does it have to do with fat? It’s like if a larger bodied person decides to become healthy, that means weight loss. Why does society believe health is in any way visible on the outside? It’s not. Make easy health choices. Don’t attach it to weight. Oh and health is not a moral/ethical choice. Be healthy if you want to... that is all.",
          "created_utc": 1606686829.0
        }
      ]
    },
    {
      "id": "ge3eua8",
      "author": "Zelda_is_my_homegirl",
      "body": "I’m working on it. I have a therapist and nutritionist that work together. I’m not supposed to count calories or measure/weigh food or myself. \nI have an app on my phone where I’m supposed to log 3 meals plus 3snacks per day. \n\nNot being able to have control over those things is really hard. I’ve been functioning this way for 20ish years, but I just can’t do it anymore.",
      "created_utc": 1606692890.0,
      "score": 1,
      "context": [
        {
          "id": "ge1vstp",
          "author": "Zelda_is_my_homegirl",
          "body": "It’s not just the internet. I’ve struggled with various eating disorders for 15 years. Last year I starved myself so badly that my gallbladder failed and I had to have it removed. \nI was significantly overweight/obese when that episode occurred, and all I heard was how great I looked with the weight loss. Not only was I suffering from my eating disorder, but when my gallbladder started failing I was incapable of eating. I cried every day just wanting to eat. \n\nAnd I heard from probably 50 or more coworkers how amazing it was. **one person** said “... I hope everything is ok and this isn’t a health issue”. It felt so good to have at least someone recognize how irregular and unhealthy it appeared. ..and to confess that everything was not ok. \n\nI have PCOS and a thyroid disorder that cause difficulty losing weight and unexplained weight gain. Sometimes I’m ok and I can eat normal, but then gaining weight triggers me, so I relapse into restricting. Every time I get sick and start listening to my eating disorder, I am rewarded and praised. \n\nI’ve just started treatment for the first time, and I’m so scared that I will end up in a position where people stop complementing my body again. It sounds so shallow, but when you hate your body, it feels so good for others to complement it.",
          "created_utc": 1606667864.0
        },
        {
          "id": "ge33txp",
          "author": "anjaliv",
          "body": "Hey, I’m so sorry you’re going through this. That sounds really rough. I don’t think weight is ever as important as your well-being and we’re in a place in society right now where people just don’t get that yet. But you do you and do whatever you need to do for your health. Screw everyone else!!",
          "created_utc": 1606687187.0
        }
      ]
    },
    {
      "id": "ge6ab6b",
      "author": "anjaliv",
      "body": "I can promise you that nearly everyone on this eating disorder subreddit which you are commenting in is not only vigilant, but keenly obsessed with all of this that you mentioned. Yes, obesity is an issue and yes, so is anorexia. And ironically both are revolving around one another like two universes ready to collide and destroy. \n\nBut still. We know that nearly 95% of diets fail. And worse, we know that UCLA concluded that 2/3 of dieters are actually regaining their body weight and then some. We know that dieting is causing a loss of muscle and a regain of fat. We know that fat is stored in a food shortage. We know that the deep rooted systemic issues related to American food have much more to do with the government subsidizing various parts of farming IE corn. We know that access is a problem. We know that black and Latinos are at the bottom rung of the ladder and have the largest issues with obesity, so it’s a race problem too. And we know that even still there are other countries in the world where people or either starving, or obesity rates are climbing and we don’t know what to do about it. Doom and gloom, seriously.\n\nOn any other day I agree with you, sure we do need to be aware. But with all respect, it has nothing to do with someone reading this page looking for a cynical reason not to eat today on this ED subreddit. That’s the problem with your comment because that’s exactly what it’s going to do.\n\nThe worst we can do is body shame and make the victim responsible for such a large scale problem. That causes actual harm. Because moderately overweight (otherwise healthy) develop eating disorders and diet/binge into obesity. \n\nSo if we’re talking about health? And not just looks? There’s a lot more to cover. \n\n 1. This is a systemic issue that is connected to privilege, education, and most of all, access. \n2. Healthy changes can and should be accessible and made by anyone despite their weight. The health comes before the number on the scale.\n3. 2/3 of diets flop and cause weight regain, plus extra weight. Loss of muscle mass and regain of fat. \n4. Dieting also causes, unsurprisingly, binging. If I diet every day, measure my portions and eat only handfuls of things, you can bet I’m having plates full of food for thanksgiving besides the (SINGLE) plate I had because hey, I’m not suppressing my appetite.\n\nThe last person I am going to throw the responsibility on for a global systemic issue is someone on an EATING DISORDER subreddit.\n\nTo whoever reading this I only replied to that comment for you, don’t worry about the scale right now. Focus on your health. And don’t worry about the scale. There are a million ways to improve your health in ways besides the scale. Go for a walk. Meditate. Bike ride. Literally anything... just 20 minutes at a time once a day. Don’t suppress your appetite. But make choices to nourish yourself, take care of yourself. Make healthy food changes wherever that’s in arm’s reach for you. I don’t think all of us come from the same place of privilege. So don’t attempt the impossible. Oh and when it’s thanksgiving weekend? Eat.\n\nPS if you don’t want to be healthy, that’s ok too. You’re not evil (lol)",
      "created_utc": 1606762272.0,
      "score": 4,
      "context": [
        {
          "id": "ge333ur",
          "author": "anjaliv",
          "body": "Health has nothing at all to do with weight. That’s just the truth. The fact that someone can be malnourished, starving themselves and still be overweight is impossible to grasp for our body image obsessed society because we’ve been taught  that health is visible from the outside. That is our biggest issue. When one comes to understand WHY fat exists and also WHY people even store fat, suddenly none of the dieting/thinspo stuff makes any sense at all. Our bodies acclimate themselves to however they need to be to live, survive and thrive. Sure; we can always make healthy choices for our body. But still, what does it have to do with fat? It’s like if a larger bodied person decides to become healthy, that means weight loss. Why does society believe health is in any way visible on the outside? It’s not. Make easy health choices. Don’t attach it to weight. Oh and health is not a moral/ethical choice. Be healthy if you want to... that is all.",
          "created_utc": 1606686829.0
        },
        {
          "id": "ge5jizr",
          "author": "FoxiiFighter",
          "body": "\"Our bodies acclimate themselves to however they need to be to live, survive, and thrive\" \n\nWell, that certainly isn't happening in our society. Our bodies are not handling overly processed fast foods well or sedentary lifestyles well. They also aren't adapting to our crash diets, starvation, photo-shop inspired dysmorphia, or exercise binging.  \n\nGen Z is the first generation that may not outlive their parents due to the climbing obesity rates. Obesity related illnesses kill 30k a month in the U.S. Anorexia (undereating disorders in general) STILL have the highest mortality rates among all mental illnesses. That doesn't sound like surviving. \n\nOur culture and society is designed to fight every instinct our bodies have to be healthy, on all ends of the spectrum. Our food is designed to be overly palate-able and make us crave and binge it -- and it's available at the push of a button for a few bucks. Our ability to move and exercise is often crushed by work hours, commutes, and exhaustion, lack of sleep, etc.\n\nIn this society, you need to be aware. In order to stay in tune with your body, you can't just rely on your \"instincts\" because your instincts are literally silenced by sensory overstimulation and \"normalized\" eating practices. \n\nFat and weight are major parts of health and optimizing the human body. You can't be healthy if you're carrying an extra human's worth of weight on a single skeletal frame (fat or muscle) -- so, yes, you can visually see this aspect of health. You also can't be healthy if knees are bigger than your thighs, and you've got fluffs growing on your body to keep you warm.  But we are talking in extremes here. \n\nGenerally speaking, if someone is 15-20lbs over or underweight, you can't really determine their health by looking at them. But when you start getting into higher deviations from the norm, (under or over), it would be ignorant to deny the known health complications from those numbers.",
          "created_utc": 1606749198.0
        }
      ]
    },
    {
      "id": "ge6e0xi",
      "author": "FoxiiFighter",
      "body": "You are talking to someone diagnosed with Anorexia, with a binge-purge subtyping. Someone who has been in-patient. Someone who has SEEN people go down the path you are trying to push and become morbidly obese, only to relapse and hate themselves more.  TRUST me. I know eating disorders. \n\nYour 95% statistic is based off 1 study done in 1959, of 100 people, and was not even a weight loss study. Stop demonizing healthy balanced eating as a \"diet\" that fails. Successful weight loss and health journeys are only anecdotal at this point because no one has been able to put together a long-term systematic study on it. \"Diets\" like Keto and Whole 30 and all that other bullshit are just that - they are fad diets that fail. But eating high quality, proper foods isn't a \"diet.\" Training yourself to get off the dopamine release of lab-designed candy and hyper-palatable chemical laden food isn't \"disordered.\" In fact, a proper diet won't cause binging - crash dieting does, but we aren't talking about fad diets here - we are talking about eating what humans are supposed to eat, and not eating what are brains have been re-wired to tell us what we want based on chemicals and lab-created foods. \n\nBut just because those fad diets fail doesn't mean someone can't succeed on a healthy balanced diet. If you are eating the right foods, and the right quality, if you are paying attention and listening to your body, and not your damn cravings,  your body will do what its supposed to do as a human, all while enjoying the occasional cookie. \n\nI'm not body shaming anyone - again, you're mixing facts and feelings. It's no insult to say a dead man is dead, AND it certainly isn't a problem to acknowledge that OP or anyone suffering from feeling skinny fat might need to increase their nutrition and movement to help mitigate the affects of a starvation diet. \n\nYou are on such a SJW crusade that you just told someone it's okay to not want to be healthy. So its okay to want to starve yourself? It's okay to want to feed your body crap? \n\nPart of the problem is you are mixing health with morality because you feel that's what everyone does.  And you think you have some kind of superiority because you can \"see past\" someone's size. You're no better than people who claim they \"Don't see color.\"",
      "created_utc": 1606764013.0,
      "score": 1,
      "context": [
        {
          "id": "ge333ur",
          "author": "anjaliv",
          "body": "Health has nothing at all to do with weight. That’s just the truth. The fact that someone can be malnourished, starving themselves and still be overweight is impossible to grasp for our body image obsessed society because we’ve been taught  that health is visible from the outside. That is our biggest issue. When one comes to understand WHY fat exists and also WHY people even store fat, suddenly none of the dieting/thinspo stuff makes any sense at all. Our bodies acclimate themselves to however they need to be to live, survive and thrive. Sure; we can always make healthy choices for our body. But still, what does it have to do with fat? It’s like if a larger bodied person decides to become healthy, that means weight loss. Why does society believe health is in any way visible on the outside? It’s not. Make easy health choices. Don’t attach it to weight. Oh and health is not a moral/ethical choice. Be healthy if you want to... that is all.",
          "created_utc": 1606686829.0
        },
        {
          "id": "ge5jizr",
          "author": "FoxiiFighter",
          "body": "\"Our bodies acclimate themselves to however they need to be to live, survive, and thrive\" \n\nWell, that certainly isn't happening in our society. Our bodies are not handling overly processed fast foods well or sedentary lifestyles well. They also aren't adapting to our crash diets, starvation, photo-shop inspired dysmorphia, or exercise binging.  \n\nGen Z is the first generation that may not outlive their parents due to the climbing obesity rates. Obesity related illnesses kill 30k a month in the U.S. Anorexia (undereating disorders in general) STILL have the highest mortality rates among all mental illnesses. That doesn't sound like surviving. \n\nOur culture and society is designed to fight every instinct our bodies have to be healthy, on all ends of the spectrum. Our food is designed to be overly palate-able and make us crave and binge it -- and it's available at the push of a button for a few bucks. Our ability to move and exercise is often crushed by work hours, commutes, and exhaustion, lack of sleep, etc.\n\nIn this society, you need to be aware. In order to stay in tune with your body, you can't just rely on your \"instincts\" because your instincts are literally silenced by sensory overstimulation and \"normalized\" eating practices. \n\nFat and weight are major parts of health and optimizing the human body. You can't be healthy if you're carrying an extra human's worth of weight on a single skeletal frame (fat or muscle) -- so, yes, you can visually see this aspect of health. You also can't be healthy if knees are bigger than your thighs, and you've got fluffs growing on your body to keep you warm.  But we are talking in extremes here. \n\nGenerally speaking, if someone is 15-20lbs over or underweight, you can't really determine their health by looking at them. But when you start getting into higher deviations from the norm, (under or over), it would be ignorant to deny the known health complications from those numbers.",
          "created_utc": 1606749198.0
        },
        {
          "id": "ge6ab6b",
          "author": "anjaliv",
          "body": "I can promise you that nearly everyone on this eating disorder subreddit which you are commenting in is not only vigilant, but keenly obsessed with all of this that you mentioned. Yes, obesity is an issue and yes, so is anorexia. And ironically both are revolving around one another like two universes ready to collide and destroy. \n\nBut still. We know that nearly 95% of diets fail. And worse, we know that UCLA concluded that 2/3 of dieters are actually regaining their body weight and then some. We know that dieting is causing a loss of muscle and a regain of fat. We know that fat is stored in a food shortage. We know that the deep rooted systemic issues related to American food have much more to do with the government subsidizing various parts of farming IE corn. We know that access is a problem. We know that black and Latinos are at the bottom rung of the ladder and have the largest issues with obesity, so it’s a race problem too. And we know that even still there are other countries in the world where people or either starving, or obesity rates are climbing and we don’t know what to do about it. Doom and gloom, seriously.\n\nOn any other day I agree with you, sure we do need to be aware. But with all respect, it has nothing to do with someone reading this page looking for a cynical reason not to eat today on this ED subreddit. That’s the problem with your comment because that’s exactly what it’s going to do.\n\nThe worst we can do is body shame and make the victim responsible for such a large scale problem. That causes actual harm. Because moderately overweight (otherwise healthy) develop eating disorders and diet/binge into obesity. \n\nSo if we’re talking about health? And not just looks? There’s a lot more to cover. \n\n 1. This is a systemic issue that is connected to privilege, education, and most of all, access. \n2. Healthy changes can and should be accessible and made by anyone despite their weight. The health comes before the number on the scale.\n3. 2/3 of diets flop and cause weight regain, plus extra weight. Loss of muscle mass and regain of fat. \n4. Dieting also causes, unsurprisingly, binging. If I diet every day, measure my portions and eat only handfuls of things, you can bet I’m having plates full of food for thanksgiving besides the (SINGLE) plate I had because hey, I’m not suppressing my appetite.\n\nThe last person I am going to throw the responsibility on for a global systemic issue is someone on an EATING DISORDER subreddit.\n\nTo whoever reading this I only replied to that comment for you, don’t worry about the scale right now. Focus on your health. And don’t worry about the scale. There are a million ways to improve your health in ways besides the scale. Go for a walk. Meditate. Bike ride. Literally anything... just 20 minutes at a time once a day. Don’t suppress your appetite. But make choices to nourish yourself, take care of yourself. Make healthy food changes wherever that’s in arm’s reach for you. I don’t think all of us come from the same place of privilege. So don’t attempt the impossible. Oh and when it’s thanksgiving weekend? Eat.\n\nPS if you don’t want to be healthy, that’s ok too. You’re not evil (lol)",
          "created_utc": 1606762272.0
        }
      ]
    }
  ]
}