{
  "id": "k3tj6k",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1606732852.0,
  "title": "Request: My gf has ed and I know it's time to contact her therapist behind her back but I am so scared",
  "selftext": "I'm 18 she's 16, she's struggled with this for over a year now,, it's been rough and she thinks it's not a big deal and I shouldn't care but I care so fucking much I don't know what to do anymore, \nI asked her to please go to her therapist herself but she said she lost track of time and didn't get to it,, she says she's gonna tell her this time but I feel like she really won't I know it's hard but she's clearly not well I have no fucking clue why I'm the only one to see it, it's so heartbreaking, I just need to be reassured and encouraged but the person that encourages me the most is the one I need to betray it feels so cruel but she's hurting herself with this and her mindset is the same as mine before I was involuntary hospitalized, it's so scary, I need guidance I can't tell everyone to my own therapist because of mandatory reporting and I don't think that's a bad thing I'm just trying to give her one more chance to tell her therapist and then I'm pulling the plug and writing a email,  I'm so lost and so fucking scared I love her so much, \n\nI know I'm not over reacting but this feels so wrong,",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k3tj6k/request_my_gf_has_ed_and_i_know_its_time_to/",
  "score": 86,
  "num_comments": 12,
  "comments": [
    {
      "id": "ge5au9q",
      "author": "myredbandlife",
      "body": "Personally I’d report it. It took someone reporting me for me to see how bad it had gotten and to seek treatment for it. I know it’s hard and scary and I’m so sorry that feel alone in all of this but you will be doing the right thing. If you’re uncomfortable telling the therapist first perhaps you can try to talk to her once more and open a discussion about why she’s been avoiding telling the therapist. *ETA* if that doesn’t work, you’re going to have to talk to the therapist yourself. \n\nAt the end of the day it just sounds like this has been really tough on you so remember to take a break and do some self care as well. Your mental well being matters as well.",
      "created_utc": 1606743923.0,
      "score": 21,
      "context": []
    },
    {
      "id": "ge6lerw",
      "author": "idance4",
      "body": "My friends went behind my back and I was pissed. But they saved my life and we are still best friends 11 years later. I haven’t met a single friend in recovery that wasn’t eventually thankful to the people who “betrayed” them by helping. I’m sorry you are in that position. I know it sucks.",
      "created_utc": 1606767452.0,
      "score": 13,
      "context": []
    },
    {
      "id": "ge51kik",
      "author": "Heymaybeonedayidk",
      "body": "I don’t think it’s betrayal your doing it to save her she’s lucky to have someone that cares so much if this is what you have to do to help her she might get upset now but somewhere down the line she’ll be thanking you",
      "created_utc": 1606736031.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ge52bq8",
      "author": "lovnelymoon-",
      "body": "Go on and do it. It's hard, I know. But it will make things easier, possibly even save her life. The faster you do this the better the chances she will ever (fully) recover.\n\nShe might hate you for it now, but she will thank you in the future. I would have been so thankful if someone had done this for me. Perhaps I would be healthy today. So yes, go ahead. You might save her life.",
      "created_utc": 1606736806.0,
      "score": 19,
      "context": []
    },
    {
      "id": "ge5f6ze",
      "author": "such_dependent",
      "body": "If telling your therapist won’t get her immediately institutionalized, I would highly suggest that. They will be a lot more knowledgeable than a group of people on the internet (obvi I’m included). Also, going directly to her own therapist may feel like an invasion of privacy, which will make it harder for her to deal with everything. I know it’s hard to bring it up, but if her mindset is similar to yours when you were hospitalized, you know how serious this is. \n\nI would ask her one more time to bring it up to them, and tell her how important her health is to you and how much you value her as a person, and her happiness. If she still can’t tell her therapist, go to yours.",
      "created_utc": 1606746732.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ge690dy",
      "author": "sashavlr",
      "body": "DO IT. Please. Maybe it can be kept confidential if you do report it? Your girlfriend might be upset at first, if at all, but in the long run she will thank you. This shows that you really care about her and everyone will be able to recognize that. I applaud you for being so young and wanting to take charge. I wish my partner was even a bit concerned about my illness. I was diagnosed with anorexia and he just abandoned me. Sending you and your girlfriend light and love ❤️ You’re both so strong.",
      "created_utc": 1606761670.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge8n40y",
      "author": "None",
      "body": "Do it. My friends have done it with me before and saved my fucking life. Yes, give her one more chance, but in if she doesn't do it, someone needs to take action before it's too late. Yeah, I was pissed when my friends did it, but I'm glad they did because look who's still kicking. And I'm still friends with them because I know they did it out of love.",
      "created_utc": 1606808269.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ge5xel4",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1606756133.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ge4ylk1",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1606732852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ge5gpju",
      "author": "tonsaweed",
      "body": "I totally agree with this! If you really care, you should do it.",
      "created_utc": 1606747622.0,
      "score": 6,
      "context": [
        {
          "id": "ge52bq8",
          "author": "lovnelymoon-",
          "body": "Go on and do it. It's hard, I know. But it will make things easier, possibly even save her life. The faster you do this the better the chances she will ever (fully) recover.\n\nShe might hate you for it now, but she will thank you in the future. I would have been so thankful if someone had done this for me. Perhaps I would be healthy today. So yes, go ahead. You might save her life.",
          "created_utc": 1606736806.0
        }
      ]
    },
    {
      "id": "ge6ztq5",
      "author": "Myechomyshadowandme",
      "body": "I‘m sorry about your partner‘s ignorance. I know how hard it is. My boyfriend isn’t understanding either and doesn’t want to talk about my eating disorder. He even triggers me regularly.",
      "created_utc": 1606774323.0,
      "score": 4,
      "context": [
        {
          "id": "ge690dy",
          "author": "sashavlr",
          "body": "DO IT. Please. Maybe it can be kept confidential if you do report it? Your girlfriend might be upset at first, if at all, but in the long run she will thank you. This shows that you really care about her and everyone will be able to recognize that. I applaud you for being so young and wanting to take charge. I wish my partner was even a bit concerned about my illness. I was diagnosed with anorexia and he just abandoned me. Sending you and your girlfriend light and love ❤️ You’re both so strong.",
          "created_utc": 1606761670.0
        }
      ]
    },
    {
      "id": "ge7sx75",
      "author": "bellasuperstring",
      "body": "I somewhat agree with this. However, I probably would just do it and explain to the therapist that she said she was going to try to remember to contact her. It may give the doctor a chance to reach out and ask how friend has been without her even knowing you said anything.  \n\nAlso, you do deserve to feel OK, too. You shouldn't have to live your life on pins and needles wondering if today is the day she does something that may cause her harm. It is totally understandable that you are having a hard time deciding whether you should \"tell\" on her or not. Many of us have felt this way at one time or another about somebody we care about for various reasons. But remember, your gut reaction that something is wrong is exactly what you need to listen to. This might even be an act of self care for you and that is so important, too. \n\nShe will never know who told her therapist if you prefer it be confidential. You could even email anonously and explain the situation. I'm sure the therapist can handle it from there without even bringing you up or painting you in a bad light. Acts like this are done out of care and compassion, and when the person is able to understand that they will be incredibly grateful. \n\nYou're a very strong person for realizing you are not equipped to handle this situation and for seeking help. I wish you both all the best.",
      "created_utc": 1606788189.0,
      "score": 4,
      "context": [
        {
          "id": "ge5xel4",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1606756133.0
        }
      ]
    },
    {
      "id": "ge8tslu",
      "author": "None",
      "body": "He has to go.",
      "created_utc": 1606814990.0,
      "score": 2,
      "context": [
        {
          "id": "ge690dy",
          "author": "sashavlr",
          "body": "DO IT. Please. Maybe it can be kept confidential if you do report it? Your girlfriend might be upset at first, if at all, but in the long run she will thank you. This shows that you really care about her and everyone will be able to recognize that. I applaud you for being so young and wanting to take charge. I wish my partner was even a bit concerned about my illness. I was diagnosed with anorexia and he just abandoned me. Sending you and your girlfriend light and love ❤️ You’re both so strong.",
          "created_utc": 1606761670.0
        },
        {
          "id": "ge6ztq5",
          "author": "Myechomyshadowandme",
          "body": "I‘m sorry about your partner‘s ignorance. I know how hard it is. My boyfriend isn’t understanding either and doesn’t want to talk about my eating disorder. He even triggers me regularly.",
          "created_utc": 1606774323.0
        }
      ]
    }
  ]
}