{
  "id": "k4id8m",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1606818184.0,
  "title": "Request: I’m so tired.",
  "selftext": "tw: ED behaviours, weight gain & loss, bowel movement (bm), depression, suicidal thoughts\n\nI’m so tired, from everything. I feel like my depression is never going to lift. I’ve been stuck with suicidal thoughts and urges for what feels like forever. I’m physically and mentally exhausted from everything and it feels like I’m dying on the inside. \n\nMy ED behaviours are at an all time high. I’ve been trying to restrict calories / portions and purge at the same time, drinking a lot more water than I eat, and yet my weight stays the same or goes up. And the one time I eat a little extra because my family is policing my behaviours now (even though I purged), but still way under the average caloric limit for women, I somehow gained an entire kilogram over the past 2 days. I don’t understand. I’ve purged to the point that my eyeballs hurt to move. I haven’t had a BM in 2-3 weeks. Sometimes it feels like I don’t eat enough to even purge anything, or if I did eat enough, then not much seems to be coming up — I end up dry heaving and burping. I’m just growing heavier by the day. I feel terrible, so fucking gross. I’m an absolute failure. I’ll only be able to see the specialist at my local ED clinic next year, it’s a 4+ month wait. I don’t know why but I have this sinking feeling that I’ll end up in a hospital or a morgue before then. \n\nI can’t do this anymore. With the suicidal thoughts and the depression and the pure exhaustion and being stuck in this loop of restricting + purging (no binging at all) and gaining weight in return instead of losing it, I’m just so tired. What’s the point? All of this is so tedious and painful and I don’t know what to do anymore. I just need a sign, an explanation, words of support, some good news, something / anything to make sense. I’m so fucking tired. \n\n(if you can, please tag u/ennaxanne in your replies so that i can read them, or feel free to drop me a PM if that suits you better. thank you.)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k4id8m/request_im_so_tired/",
  "score": 54,
  "num_comments": 6,
  "comments": [
    {
      "id": "ge8zxg6",
      "author": "bot_hair_aloon",
      "body": "U/Ennaxanne, hi, i think anyone thats come out of an ed knows that its not about weight and your not meant to talk about it and all that but its impossible to gain 2kg in 3 days. No matter how much food you ate. Its just water weight, try not to worry about it. Even if you started eating properly it would take ages for your body to recover and really start gaining healthy weight. \nI guess alot of the time an ED is a form of punishment for yourself. I dont know you, but noone deserves what your going through. Noone deserves to have an ED. Im so so sorry your going through this. I know it doesnt seem like you could ever stop, i remember when going a day without purging was a huge deal for me. Fuck that, going a meal with out purging was a big deal. Youve got to want to get better. Youve got to want to stop feeling so shit and its going to feel even more exhausting than you do now, but it is worth it. I also suffer with derpression and tbh i kinda numbed it when i was in my ed cuz at least theres something to focus on. This sounds contradictory but Im also much happier now. Its like i can finally really feel what im feeling and can get over it. \nI cant say theres anything to help you stop other than actually forcing whats been rewired in your brain to not be scared of food anymore. Be kind to yourself. \nTheres people that love you and i really hope the bets for you. Youre not your ED and its just blocking so much goof shit that you could be experiencing x",
      "created_utc": 1606821681.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gea4cpv",
      "author": "None",
      "body": "Hey so as someone who has recovered from my ED, I think back to 7-8 years ago and I was exactly where you are at right now. My problems were so heavy and I felt so consumed and trapped by anxiety and depression. What you said in this post is EXACTLY how I felt and it’s one of the most horrible feelings in the world.\n\nEventually I got to a point where I was making small steps and improving in tiny increments, but those little changes seemed so huge to me they brought me so much joy. Each time I cleaned a room or showed up for work on time was like a miracle and it felt like I won an award. \n\nI’m telling you this because I found my suicide note the other day and it broke my heart to read. It didn’t even seem possible that I wrote it. I was just so so thankful that I chose to live. It was the hardest thing I ever did, but by far the most rewarding. I feel like I’m talking to my past self when I say this; so imagine this is from your future self. The journey is worth it. Someday you are going to leap out of bed every morning thinking of everything but your eating disorder. Someday you’ll be through the trauma and on the other side and you will look at yourself with so so so much love. Life will be exciting and you’ll be grateful for every moment. Even if you can’t see it yet, you’re already on the path to that reality. You have already made progress. And if you need to hear this, I believe in you. Because I know how that feels and if I could recover after feeling that, you DEFINITELY can too. \n\nI wish you didn’t have to feel this pain right now. Just take a small step. Even if it’s just watching something funny just to hear yourself laugh, recognize that as an effort to put yourself in a better mental state. This little steps are what add up to recovery. You took a huge one by reaching out and posting here. I’m SO proud of you! You can do this. I know it’s very hard but you can, and you’re already doing it.",
      "created_utc": 1606845799.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ge9u2om",
      "author": "Zelda_is_my_homegirl",
      "body": "Hey- I’m having similar symptoms/behaviors recently. I had actually been doing reasonably ok. I just started treatment/recovery a few weeks ago. Then Thanksgiving just fucked me up hard. Like a total nosedive. It’s really hard right now. \n\nI just wanted to say though. I’ve started working with a nutritionist as part of my recovery. I’ve been in the same boat a bit with my weight. I’m actually fairly overweight (thyroid and hormonal issues), but I just can’t lose even though I’m restricting/purging, etc. \nMy nutritionist told me that I have slowed my metabolism from the years of restricting, and that the solution is to eat enough and balance my metabolism. I told her my caloric goal, and she told me that it wasn’t enough for a 12 year old. I told her “well, if I eat normally it’s actually xxx calories higher than that”. She said that still wasn’t enough, and that my body thinks it’s going to starve, so I’m not losing weight. \n\nI highly recommend working with a nutritionist. It’s scary, but it could be helpful. I use an app with mine called recovery record, and we don’t measure food or count calories, but I can log a description of what I eat, and feelings/behaviors around the meal. Including skipping meals, binging, thoughts, etc. \n\nBest of luck! I hope you start to feel better soon. It’s a difficult journey, but I think recovery is worth it.",
      "created_utc": 1606840905.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ge8wo8d",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1606818184.0,
      "score": 1,
      "context": []
    },
    {
      "id": "geax8xd",
      "author": "Ceilo77",
      "body": " [u/EDPostRequests](https://www.reddit.com/user/EDPostRequests/) , first of all, believe in yourself.  your body needs certain foods and drinks to survive.  keep drinking water.  eat foods that have fiber to help with the bm.  stay focused on positive and productive things.  which will redirect those unpleasant thoughts and emotions.",
      "created_utc": 1606859306.0,
      "score": 1,
      "context": []
    },
    {
      "id": "geia1l8",
      "author": "None",
      "body": "u/ennaxanne, I have gone through similar things, and just want to offer some words of support and maybe share some thoughts on what I've done to solve these issues in my own life. \n\nFirst, you're not alone! Second, you matter, and your life has a purpose. You are a valuable human being (because you are created by a loving God). Third, don't give up hope! Things can get better. I'll be praying for you. \n\nNow to what I've done. So, when I admitted that I had a problem with my eating habits, I asked my family to help me and keep me accountable for what I ate or what I didn't. I also did a lot of research on healthy foods, nutrition, and exercise. Then, I started putting what I learned into practice. I began working out regularly. I ate less carbs and sugar and processed foods, focusing on enjoying more vegetables, good fats, and fruits. I drank more water, since it helps my body regulate an heal itself from the inside out. I talked to people about my struggles, and found out that I wasn't alone. \n\nNow, I don't have a perfect body, but I am mentally, emotionally, and physically more healthy than I was. I encourage you to do your own research, develop healthy goals for your workouts and meals, and stick to them! \n\nI hope this helps. Blessings!",
      "created_utc": 1607018155.0,
      "score": 1,
      "context": []
    }
  ]
}