{
  "id": "k57e22",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1606907578.0,
  "title": "Request: am i sick enough?",
  "selftext": "i’m afraid to like. start recovering. \nso the low down, at the start of quarantine I started to get into some really bad body image issues and it was no fun so i decided, like an idiot, to start counting calories, and at first it was fine. Then i got a fitness tracking watch and starting doing regular exercise which is great but it started small (30 mins a day of light jogging, an hour of dancing, youtube workouts, etc) but noes it’s rigid 2-3 times a week strength training and 50 minutes of intense cardio a day + an extra 2 hour walk. I feel bad if i don’t complete my rings or walk around for a certain amount of time. because i wasn’t super strict with tracking i just exercise a shit ton to try and add a small overestimation of calories. Cal counting wasn’t bad at first But now i think it’s gotten to the point of like, actual disordered eating? I know all the calories in a lot of things, i kind of stopped eating cereal and others, i try not to eat a lot early in the day so i can have dessert and dinner later (my family cooks dinner and i never know what’s going on so i just allot a lot of cals for it), I count and overestimate and 3 days ago i had a breakdown over some mac and cheese (i dont even really like mac and cheese, but i just wanted to eat a shit ton of it for no reason), and i’ve been working on how to purge but can’t bring myself to it. I don’t know. i think this is disordered but I’m afraid to try and get help or tell anyone because i don’t think i’m sick enough yet and it’s kind of sickening because on some level I think i know this is heading down a bad path but on another level I just have this voice telling me i’m not there yet, i don’t have a problem and therefore can’t talk about it. should i try and talk to a friend?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k57e22/request_am_i_sick_enough/",
  "score": 47,
  "num_comments": 11,
  "comments": [
    {
      "id": "gecx2zs",
      "author": "rubyhatesfeet",
      "body": "You shouldn’t feel you have to wait until you’re “sick enough” it’s good that you’ve recognised disordered behaviour and you want to change it. \nI think that talking to a friend or family member you trust is a good idea and maybe a doctor too? \nThe voice is always going to tell you you’re not there yet and to push a bit further because it does for so many people. If you’re struggling, heavily restricting or obsessing over calories and exercise then I’d say talking to someone would be a good thing, even if you don’t go get help right now it can feel better to get it off your chest and just have people around to support you",
      "created_utc": 1606908191.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gecyzxo",
      "author": "I_am_the_flower",
      "body": "I’m not a therapist but this does sound like disordered eating. Eating disorders will always tell you that you aren’t sick enough. Even when you’re lying in bed close to death. Studies have shown the earlier you get help the better chance you have at getting rid of the disorder for good. Please seek help. You are worthy of it. I used to think the same way. That I haven’t had my ED long enough and I’m not sick enough. Hell, I still think that way. But now, I’ve had my ED for 2+ years and it’s ruined my life. I’m only 15 and I’ve let this thing ruin my life. If I could go back months or years and get help, I would. You don’t have to be sick enough to get help. If you’re sick, you need help. I promise.",
      "created_utc": 1606910108.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gedeqxj",
      "author": "enord11400",
      "body": "A note: even if you haven’t lost tons of weight from these behaviors, the wanting to eat tons of something you don’t even like is a side effect of restricting. It can either be because your body is craving more nutrients (especially carbs/fats) from not eating enough during the day to support your exercising or it can even be psychological from putting so many rules on yourself and your mind just wanting a break and some happy chemicals from eating. \n\nAlso STOP trying to figure out purging. Seriously. Once you go there you can’t ever go back. If you can pull yourself back from the edge of that abyss then please do it. I know it is not really that easy but it will become so much harder if it becomes a legitimate option for you. Plus purging always gave me a lot of chest pain (plus orthostatic hypotension and bradycardia that got me sent inpatient) that made exercise really painful and it sounds like exercise is enough of a burden. \n\nTry to give yourself a little bit of compassion. You deserve rest and relaxation. Try to change out some of that exercise for some more joyful movement like dancing or yoga if you’re into that.  Finding a therapist would be most helpful. You can tell your family that it’s for anxiety if you don’t want to get into everything right now but you have to be willing to open up about these behaviors there. \n\nYou are smart to be concerned with what you are feeling and you need to reach out to someone irl if you can. You probably won’t ever feel sick enough. Even people dying in the hospital do not feel sick enough. If these feelings and behaviors are impacting your day to day life mentally, emotionally, or physically then you are sick enough to get help. That’s all there is. If someone you care about had some kind of wound or sickness that needed medical attention you wouldn’t tell them to wait until it got infected and/or was about to kill them before going to the doctor. Mental health is the same. \n\nSorry this is long, but good luck! \n\nTL;DR: craving food means you need it. Purging is a doorway to hell that you do not want to open. Try to relax a little and find a therapist. You are right that this sounds problematic and should try to get help now.",
      "created_utc": 1606920004.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gecwhd0",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1606907578.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gedkc74",
      "author": "None",
      "body": "its about the mind not your physical state:(",
      "created_utc": 1606922454.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gedlaft",
      "author": "soundandvisions",
      "body": "That voice telling you you aren’t sick enough, you’re okay, IS they eating disorder unfortunately. I deal with it every day. Mine tells me I’m just fine and these behaviors are okay. My nutritionist has a lot to say otherwise.",
      "created_utc": 1606922862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gee0nrl",
      "author": "Zelda_is_my_homegirl",
      "body": "I put off recovery for 20 years because I felt like I wasn’t “sick enough” or it wasn’t a “real eating disorder”. You’re heading down a slippery slope and it’s a path that leads nowhere good. \n\nParticularly the sentence about trying to figure out how to purge stood out to me. The desire to purge is reason enough to talk to someone, but coupled with your other symptoms, this is the start of something dangerous.  These are problematic and disordered behaviors whether you meet diagnostic criteria for a “real” eating disorder or not. \n\nPlease reach out for help OP.",
      "created_utc": 1606929124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gee6u26",
      "author": "wsc1983",
      "body": "No one wants to believe that they are \"sick enough\" in the beginning.  You sound like you have a bigger problem than you can deal with right now and deserve to get help.",
      "created_utc": 1606931623.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gefevgh",
      "author": "sarathedime",
      "body": "My best friend from treatment went into cardiac arrest yesterday, they resuscitated her but she still says she’s not sick enough. There is no “sick enough,” according to eating disorders. \n\nI felt the same when I went to treatment and the sad reality is that most people question if they’re even sick. Reach out for help, don’t wait.",
      "created_utc": 1606950862.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gedgu84",
      "author": "enord11400",
      "body": "I could have written this the story is so close. 2 years is 2 years too long. My issues also started just before I turned 13 and I got help at 16. I’m 22 now and have been in a good place for over 2 years. wanted to tell you that it can get better but only if you want it and work for it. I believe in you. ❤️",
      "created_utc": 1606920922.0,
      "score": 5,
      "context": [
        {
          "id": "gecyzxo",
          "author": "I_am_the_flower",
          "body": "I’m not a therapist but this does sound like disordered eating. Eating disorders will always tell you that you aren’t sick enough. Even when you’re lying in bed close to death. Studies have shown the earlier you get help the better chance you have at getting rid of the disorder for good. Please seek help. You are worthy of it. I used to think the same way. That I haven’t had my ED long enough and I’m not sick enough. Hell, I still think that way. But now, I’ve had my ED for 2+ years and it’s ruined my life. I’m only 15 and I’ve let this thing ruin my life. If I could go back months or years and get help, I would. You don’t have to be sick enough to get help. If you’re sick, you need help. I promise.",
          "created_utc": 1606910108.0
        }
      ]
    },
    {
      "id": "gee1bbs",
      "author": "Zelda_is_my_homegirl",
      "body": "Real talk about the purging. I have had disordered habits for a long time (mostly heavy restricting)- about 20 years. \n\nJust a few weeks ago I started purging. Now it’s this urge that I can’t seem to fight. I’ve even started feeling nauseous when I eat like my body wants to reject food. Engaging in purging is the scariest symptom that has ever manifested for me, and I feel totally helpless and out of control. \n\nI am in treatment, and I hope I can get a hold of this soon, but purging has worn me down and made me hate myself more than anything I’ve ever experienced.",
      "created_utc": 1606929384.0,
      "score": 1,
      "context": [
        {
          "id": "gedeqxj",
          "author": "enord11400",
          "body": "A note: even if you haven’t lost tons of weight from these behaviors, the wanting to eat tons of something you don’t even like is a side effect of restricting. It can either be because your body is craving more nutrients (especially carbs/fats) from not eating enough during the day to support your exercising or it can even be psychological from putting so many rules on yourself and your mind just wanting a break and some happy chemicals from eating. \n\nAlso STOP trying to figure out purging. Seriously. Once you go there you can’t ever go back. If you can pull yourself back from the edge of that abyss then please do it. I know it is not really that easy but it will become so much harder if it becomes a legitimate option for you. Plus purging always gave me a lot of chest pain (plus orthostatic hypotension and bradycardia that got me sent inpatient) that made exercise really painful and it sounds like exercise is enough of a burden. \n\nTry to give yourself a little bit of compassion. You deserve rest and relaxation. Try to change out some of that exercise for some more joyful movement like dancing or yoga if you’re into that.  Finding a therapist would be most helpful. You can tell your family that it’s for anxiety if you don’t want to get into everything right now but you have to be willing to open up about these behaviors there. \n\nYou are smart to be concerned with what you are feeling and you need to reach out to someone irl if you can. You probably won’t ever feel sick enough. Even people dying in the hospital do not feel sick enough. If these feelings and behaviors are impacting your day to day life mentally, emotionally, or physically then you are sick enough to get help. That’s all there is. If someone you care about had some kind of wound or sickness that needed medical attention you wouldn’t tell them to wait until it got infected and/or was about to kill them before going to the doctor. Mental health is the same. \n\nSorry this is long, but good luck! \n\nTL;DR: craving food means you need it. Purging is a doorway to hell that you do not want to open. Try to relax a little and find a therapist. You are right that this sounds problematic and should try to get help now.",
          "created_utc": 1606920004.0
        }
      ]
    }
  ]
}