{
  "id": "k6ithf",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1607079354.0,
  "title": "Request: When is it an eating disorder?",
  "selftext": "I've always hated my body because I've always been overweight. There was a brief period of time when I was a healthy weight, and even though I achieved it through accidental starvation (I was overworked and never had a minute to sit down) I was finally happy with my appearance. Now, I've lost my job and started doing a lot of artwork, so I've gained back all of the weight I lost (and it was a lot) and I am miserable. Every bite of food I take makes me feel guilty. Every single bite. I end up trying to wait until later in the day to eat so I have less possible time to consume food, but I always end up binging. But I also don't feel like I can say \"I have an eating disorder\" because it's purely an emotional feeling. I just feel guilty and shameful when I eat anything. I don't even know if I'm looking for advice or validation, I just... haven't ever said this to anyone before.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k6ithf/request_when_is_it_an_eating_disorder/",
  "score": 61,
  "num_comments": 9,
  "comments": [
    {
      "id": "geltmpo",
      "author": "SkinnyPeach99",
      "body": "My general rule is “when it negatively affects your life everyday, then you have a serious problem and need help. When it negatively affects your life every week, then you have a moderate problem and need help. When it negatively affects your life every month, you have a mild problem and need help.”\n\nBasically if something is causing you issues, whatever it is, then you should speak to a doctor of some sort. Even if it isn’t an eating disorder, it’s better to start talking to someone before it becomes one.",
      "created_utc": 1607097596.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gelgjt7",
      "author": "Lotsoflove_bakery",
      "body": "Hi! Thanks for being so open. Eating disorders all look so different. I didnt know I had one for the longest time because I thought I had to be severely underweight. But for the longest time I was overweight, but I was doing many of the things you mentioned in your post. Waiting till late in the day to eat and binging in private. I think the point with these situations is that something needs to change - whatever you or I are doing isn't bringing peace and it's a hassle to wrestle with daily. \n\nI think you need to find out what you want next - is it to lose weight and keep it off? Is it to get a better relationship with food and more self confidence? \n\nName your goal and make the changes you need to - only you're going to know what's doable for your body. And also -- sooo much patience. It's going to be hard work,  but it's always worth the effort to work on yourself!",
      "created_utc": 1607090571.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gelo57i",
      "author": "enord11400",
      "body": "I’ve always considered it the same way I consider anxiety disorders. If it starts to impact your day to day life then it is a mental health problem that qualifies as a disorder. If you eating behaviors are distressing to you on a daily basis then you likely have an eating disorder. Look up the dsm 5 for eating disorders, but remember that most people do not fit into one of the “popular” eating disorders very nicely or at least they will eventually adopt symptoms of other disorders. ED behaviors can be easier to quantify by medical professionals so the diagnostic criteria can be a little more restrictive. \n\nThe only requirement for OSFED is significant impairment in major areas of your life. \n\nhttps://bodymatters.com.au/wp-content/uploads/2015/01/DSM_V_Diagnostic_Critera_for_Eating_Disorders.pdf",
      "created_utc": 1607094828.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gel8haz",
      "author": "None",
      "body": "I think eating disorders are mostly a mental and emotional feeling rather than a physical one. Try eating earlier in the day because you'll have more time when you're moving around to burn off the calories. If you starve yourself, you're going to want to binge later. Plan your meals or eat frequent snacks if meals are intimidating. Eat healthy options (but treat yourself too) and don't let yourself go into starvation mode. Working out for me helps my mental state and keeps my depression in check so I try to work out every 3 days or do something physical (long walks, dancing in my living room, weights, wii fit). \n\nMost importantly, nourish yourself and work on the guilt you feel from eating possibly with a therapist. There's lots of skills to help decrease guilt (radical acceptance, thought restructuring, gratitude), let me know if you want any further help or knowledge with them. Good luck! You rock for being open :)",
      "created_utc": 1607085363.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gel0a5k",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1607079354.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gem4xmd",
      "author": "heyobird",
      "body": "All of these previous replies hit the nail right on the head. The internet and DSM-5 diagnoses can be slightly misleading (and slightly invalidating) to what eating disorders can be. It’s much more than just a set of behaviors and physical appearance. Like everyone else has said, it’s mental and emotional too. If it’s interfering with your health and well-being, then it’s worth seeking recovery for. Best of luck OP- you deserve to feel better!!",
      "created_utc": 1607103014.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gep2z8u",
      "author": "Eli_Pop_1996",
      "body": "When you’re hesitant about the foods that you eat.  When you ask yourself “should I eat this”\nWhen you feel guilty about eating that food and begin restricting from eating it.\nWhen you start to distrust the food that you eat/that you need that is when it becomes a eating disorder.  When it’s not is when you start to see that food is something needed to keep your body going and not suffering.",
      "created_utc": 1607174462.0,
      "score": 1,
      "context": []
    },
    {
      "id": "geypcs4",
      "author": "None",
      "body": "whoa. it’s like i wrote this post. literally anything i eat makes me feel guilty. any exercise i do could always be enough. always tired. still overweight. don’t think it’s an ED though because i’m not thin!",
      "created_utc": 1607363822.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gely0yj",
      "author": "poopematic",
      "body": "That’s good advice ! \nTake out the problem before it becomes a problem",
      "created_utc": 1607099728.0,
      "score": 7,
      "context": [
        {
          "id": "geltmpo",
          "author": "SkinnyPeach99",
          "body": "My general rule is “when it negatively affects your life everyday, then you have a serious problem and need help. When it negatively affects your life every week, then you have a moderate problem and need help. When it negatively affects your life every month, you have a mild problem and need help.”\n\nBasically if something is causing you issues, whatever it is, then you should speak to a doctor of some sort. Even if it isn’t an eating disorder, it’s better to start talking to someone before it becomes one.",
          "created_utc": 1607097596.0
        }
      ]
    }
  ]
}