{
  "id": "k84m2f",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1607297139.0,
  "title": "Request: What damage did you do to your body? Please share your stories for those that need fear to heal",
  "selftext": "Please tell me about your ED story and what damage you inflicted on your body.\n\nSo many people continue their disordered eating habits because we usually see the weight loss and body shape changes long before we experience any symptoms of the serious damage we’ve caused. The immediate pay off seems to overshadow the long term issues we’re warned about. I know for me, I didn’t see anything bad happening and being so young I couldn’t even comprehend fully what it meant to be creating *eventual* damage.\n\nSo please, share your story and what it all did to your body. If I had seen enough genuine testaments to why I shouldn’t starve myself I may have never started in the first place. We can’t turn back time, but we can educate those struggling with the same demons we once were.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k84m2f/request_what_damage_did_you_do_to_your_body/",
  "score": 87,
  "num_comments": 63,
  "comments": [
    {
      "id": "gew0rzk",
      "author": "doncheche",
      "body": "Oh, kids. Am in my early forties with osteopenia, an early form of osteoporosis, and all sorts of bowel/urinary issues. I have to have regular bone scans and am risk for fracture. I piss myself on the regular, my kids know that I just don't eat and it's the worst modeling for them, and, for the last 30 years, I wake up thinking about food, go through my day thinking about food, and go to bed drunk so I'm not thinking about food. 0/10.",
      "created_utc": 1607298705.0,
      "score": 90,
      "context": []
    },
    {
      "id": "gew465v",
      "author": "moonbrows",
      "body": "a lot of the damage was in the immediate; lanugo was the worst and i felt like an absolute monster.   \n\n\ni think the longer effects were; no gag reflex. it ceased to exist, i couldn't b/p anymore and couldn't stop myself for years throwing up at random intervals, or i'd be eating food and suddenly it would all come up in front of my family or friends. it took years to right this but it was so embarrassing and humiliating.  \n\n\ni get heartburn and acid reflex really badly still and my metabolism is totally ruined, it's stressful and emotionally draining to still even in recovery have to be conscious of what you eat because your body can't process it properly. \n\ndamage to my teeth; i have pretty much no enamel left even though i always have and still brush like mad, they're so sensitive and when it's cold i get shooting pains, i've had them whitened once already because of the garish colour they turned from all the stomach acid. you don't know how important your smile is to you until you can't smile anymore.   \n\n\nbones; they're so fragile now, even though i've recovered i'm frightened if i fall i'll crack something. my joints would click and sometimes it hurt to get out of bed in the morning, i had to rub ointment and cream on my legs and arms because it just hurt so badly, and in the cold it actually made me ache and slowed me down to a snail pace.   \n\n\nheart; i never had heart problems, but i pushed my cardiovascular system to the absolute limit and i'm shocked i didn't get heart failure from the sheer stress i was putting on myself, but heart palpitations did become quite frequent for a long time and i never knew if it would become something more sinister without me knowing. a friend of mine actually went into cardiac arrest due to how low her weight was.  \n\n\nreproduction; my periods stopped and they've never ever been normal since, but this was during my time with bulimia, and now when i get periods they're either a day of spotting or 10 days of full blown cramping, lift doors opening in the shining, vomiting episodes. i couldn't have children for a long time and i'm one of the very lucky ones who's weight gain returned their fertility and it's not something i'd change for the world now. i didn't know i wanted children until i realized i couldn't.   \n\n\ni lost my eyesight at one point whenever i got up, i'd stumble around until it came back or cry until my father came into the room. i was eighteen and unable to get out of bed without falling over.   \n\n\nmy legs and arms tingle all the time even now, they go dead in a few seconds and take forever to wake up. you WILL have to put on weight at some point unless you're intent on dying that way and my god the stretch marks. i've always had matchstick legs and believe me - they aren't immune despite being small. when you care so deeply about your appearance - the damage you're going to be doing it to the future is definitely important imo. \n\nlaxative and diuretic abuse ruined my bodily functions for a long time and it can seriously inflame your colon so you can't even go to the toilet without assistance, and the damage can continue from there. \n\nmy voice breaks all the time because of the damage i did to my throat, i go from sounding high pitched and sweet to scratchy and like i smoke a twenty deck a day, it's humiliating and upsetting and brings me to tears from time to time. \n\nrashes; i had rashes so badly, i still get them now if i don't eat enough and have to powder myself with make up and hope no one notices. \n\ni don't think i'll ever be comfortable looking in the mirror, and i wish someone had told me this when it first started so i could get help. it went on for so long, undetected, and now it's permanently skewed my vision of myself. i won't ever be satisfied, i can't be satisfied. whether big or thin, normal or underweight - nothing is good enough for me. i hope one day it will be but i'm still waiting for that one to happen. \n\ni'm now insulin resistant, meaning i can't eat carbs (not diabetic, i try really hard to not let it get to that stage), else i might develop type 2 diabetes.  \n\n\ni'm still anaemic after over ten years. i bruise like mad, i'm scared if someone touches me i'll bruise, i usually come out in awful purple bruises too and you can't even hide them. \n\nand i'm also short because i denied my body the nutrients it needed to let me grow. \n\nthose are just the physical things, the mental damage i did to myself is something else all together. i won't go into detail because i can't really bring myself to do it, but years of my life have been spent in therapy, on medication, sick time off work, horrible scars, impulsive and stupid behaviour, drug taking, terrible family relationships, really rocky and turbulent relationships (you're vulnerable. bad people know this.)",
      "created_utc": 1607300431.0,
      "score": 46,
      "context": []
    },
    {
      "id": "gew2fuy",
      "author": "Solkvds",
      "body": "I'm 23 and am closing in on my 10th anniversary of struggling with bulimia, yay me. So this is not entirely solely on starvation. But might still be interesting. Something that had never even ocurred to me and I feel like a lot of people dont know is that repeated vomiting is actually quite heavy on your back. So apparently 10 years of hunching over a toilet mixed with some bad luck/genetics can cause you to have 2 herniated discs at the age of 20 (which is when I first started experiencing the pain). Sometimes its better, but other times when theres been some strain on my back I can hardly sleep from the pain because I cant even get in a comfortable position and my legs feel like they're sleeping all the time. I know there's probably a lot worse that can come from ed's but I thought I'd share a bit of an \"unusual\" one or one that people dont commonly think of.",
      "created_utc": 1607299544.0,
      "score": 44,
      "context": []
    },
    {
      "id": "gew22ou",
      "author": "speaking_moistly",
      "body": "I’ve lost a kidney, scarred my throat,which has altered my voice,and have caused myself to stop cycling for 7 years.  lanuga, low blood pressure, all the things that go with major electrolyte imbalance. It’s ugly. Oh and ruined my hair a few times",
      "created_utc": 1607299358.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gew85nu",
      "author": "Emmalea211",
      "body": "i developed Orthostatic hypertension, and i still have it to this day. alongside that, i lost most of my muscle mass and became very weak. My bowels stopped working, and i developed a concoction of constipation, hemorrhoids, and horrific abdominal pain. My hair became really thin, and I grew to be very pale and sickly looking. I never realized that my ED had caused all these things, and as a result I still struggle with the side effects today.",
      "created_utc": 1607302618.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gew6vuz",
      "author": "erinthefatcat",
      "body": "My metabolism is fuckedddd",
      "created_utc": 1607301904.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gew69o9",
      "author": "None",
      "body": "whenever i stood up i would feel like i was dying. lost all my hair. i felt weak all the time. my mind was groggy. headaches constantly.",
      "created_utc": 1607301561.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gew6cv0",
      "author": "ACatNamedLuna",
      "body": "My ED included severe purging (5+ times a day) over the course of about a year and the longest lasting effect has been that it has destroyed my teeth. I floss and brush, but at 26 I’ve had a root canal and at least 10 cavities. Probably more but I’ve lost track. Minimum 2-3 per visit every 6 months. My dentist said my bottom front teeth in particular are so damaged it’s likely I will need extensive work. \n\nI was lucky enough to get help quickly and most of the immediate damage has healed, so hopefully this is the only long-term damage. I’m glad my family forced me to get help and that my therapist and docs were awesome.",
      "created_utc": 1607301610.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gex1vn3",
      "author": "sarathedime",
      "body": "I had EDNOS for about six years and anorexia for one. TW >!I wasn’t even very underweight clinically- everyone told me I looked great, not sick!< and they were confused as to why I had a diagnosis... until I showed them my labs. \n\nKeep in mind I’m 21. My kidneys were failing, creatinine levels super high. Really bad iron deficient anemia, I couldn’t even walk up a flight of stairs without taking a break. I went to the doctor after exercising because I started feeling chest pain and palpitations all the time and he said I could have gone into cardiac arrest. I had swelling in my legs because my kidneys couldn’t filter the water and my circulation wasn’t strong enough to pump all the blood against gravity. My hair was falling out, my eyes had constant dark circles under them. I was freezing all the time and for *seven months* after weight restoration, I had severe night sweats and hot flashes every single night because my metabolism was just so messed up and trying to regulate. My EKG showed how hard my heart was trying to work to keep me alive. I’ve fainted in so many awful places: in the shower, at school, work, doctor’s office, *almost* while driving on the freeway. I’ve gotten mild concussions and cut my eye from fainting in inconvenient places. You can’t plan it. And fainting isn’t fun. My body shakes violently when I wake up and I’m numb and I can’t stop crying and it’s really scary. \n\nI also have nearly constant UTIs (but that might be from my awful water drinking habits, which is connected to my ED) and the antibiotics cause yeast infections so it’s a fun back and forth between the two. I was in a wheelchair for three months after being admitted to treatment, even though I didn’t feel sick or thin enough in any way. \n\nSLIGHT NSFW >!My reproductive system had shut down. Unfortunately, that also meant no sex because I couldn’t get lubricated. That was hard, I felt broken as a woman without my period but when it started up again during treatment, there was constant vaginal discharge from trying to catch up.!< I’ve seen people with permanent infertility or *permanent* gastroparesis (paralyzed stomach). My best friend went into cardiac arrest and was barely resuscitated in time, she’s also had seizures from her ED. \n\nMentally? It was *all I could think or talk about.* I didn’t have a real relationship with my now-husband and that got me into recovery. Everything I thought about lead back to the eating disorder. I couldn’t study or have any hobbies. *I did not have friends.* None. My whole life was my eating disorder, with my boyfriend on the side. Looking back at last year, even in treatment, everything was a blur because my brain wasn’t working properly. I don’t remember so much of what happened because my memory is so bad. My husband (bf at the time) had to hold his arms out *every time* I stood up because I would fall so often. I slept under 6 blankets and still wasn’t warm. I slept all day. I’d come home from work and school and just sleep in my free time, not study or have fun or do anything. \n\nWhat my husband says about my eating disorder days: hair was falling out, kidneys and heart were failing, bags under my eyes, almost passed out every time I stood up, sleeping all the time, my irritability (I was grumpy all the time), it was all I could think about, I had no friends. That’s what he took away from this and it was really hard on him, especially trying to keep me alive when my doctor told him I could die. \n\nI know I’m not unique and I don’t even feel like I was ever sick. Like “I could go back and do it again but safely and not have all the bad things happen”. But that’s not true, there is no “careful” with eating disorders. It’s a slippery slope you have no control over. I really really hope you can get the support you need from this, because you deserve it and I don’t want anyone to go through the hell of an eating disorder.",
      "created_utc": 1607320921.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gewezjh",
      "author": "duderancherooni",
      "body": "I went from a normal weight to obese because of my binge restrict cycles in the period of 9 months. It’s been 2 years and I’m still obese and I hate myself for it most of the time.",
      "created_utc": 1607306459.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gewilft",
      "author": "runfromitall29",
      "body": "I’m 24(F), and saw no big visible damage besides weakened nails/brittle hair/bad skin. But I work as an EMT, and last year I broke my arm lifting a patient. I have three other people lifting the stretcher with me for a patient just over 300lbs, I was at the foot of the stretcher, and I broke my damn arm. This took me out of the field for 4 months, and I hated it. By this time, I had been recovered for well over a full year, maybe even closer to 2 from the time I hit a healthy weight from my initial attempt at recovery. You can’t really feel healthy vs unhealthy bones, but I still have issues to this day from that injury because it never fully healed, and my recent relapse has made it worse. This incident cost me possibly my whole career in the healthcare field due to weak bones.",
      "created_utc": 1607308437.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gewg85q",
      "author": "fakeplasticturnips",
      "body": "My teeth have gone from Hollywood smile to loosing 2, including a front one and my canine might be next. I’ve had 3 root canals. I’ve spent $15,000 on repairs and am loosing down the barrel at another $10,000 to build up my teeth which have been so ground down and eroded the back ones are maybe 3mm tall. My front ones are now transparent to the point they look stained and my gums have receded severely. \n\nThe aesthetic damage happened swiftly all in one bang it seemed. After years of ‘getting away’ with b/p the damage is now something I see every time I look in the mirror.",
      "created_utc": 1607307125.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gew4m8v",
      "author": "Current_Selection",
      "body": "I'm 21 (22 this week) and I've had disordered eating for about 11 years, and around 16 it turned into full blown anorexia that caused me to go inpatient. While there I learned that I have permanently caused damage to my heart (honestly I don't remember the specifics), so much so that I have to see a cardiologist and when I did a stress echo (get your heart rate up and do an ekg/ultrasound) started having significant enough changes to the rhythm that I had to repeat the test and was told I was at risk for a heart attack during exercise this year when I did it. I relapsed for less than a year this time around and caused that much damage. I have also had abnormal liver enzymes after restarting recovery and have low bone density. Meanwhile, I was on the border of UW and normal, maintained a menstrual cycle the whole time, had some chest pain but it wasn't super concerning, and had normal electrolytes. When things go bad, they do so FAST. I managed to have disordered behavior for a long time with okay health but it went downhill within the span of a couple months and only found the extent of damage after testing that is not normally requested for a 16 or 21 year old.",
      "created_utc": 1607300660.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gewoxn9",
      "author": "taperj33ngirl",
      "body": "people are right that the damage can happen so quickly, much quicker than anyone would think. \nat my worst about 2 years ago, i was drinking my calories in alcohol more than anything else, 5-9 drinks a night of whatever i got my hands on. for 6 straight months i was drunk bc all i could think about was starving myself. i didn't care about living. but the love of my life said he couldn't live with me killing myself and i went to inpatient. i was 21.\n\nbut not before i started retaining water to the point of gaining 20lb and feeling the water being leeched out of my muscles, i was in pain everywhere. and i couldn't explain it. i still deal with this constant soreness and fatigue 2 yrs into recovery. shortly after treatment, i ended up in the hospital due to cyclic vomiting syndrome (i imagine it's no coincidence i have random episodes of intense nausea after 3 years of purging). while i was there the doctors told me i had a pretty enlarged liver and diagnosed me with potential alcoholic fatty liver disease, which i guess has something to do with the water retention? with time it can heal, so i've treated myself like an alcoholic and have managed to stay away. i smoke a lot. of weed. \n\nmore recently? after 2 years of recovery i forgot about my teeth. i feel like i'm losing them one by one. just had a molar literally crumble when i but down on an m&m. it's horrible, it's embarrassing. a lot of things still bring me to tears these days but i realize i'm lucky and genuinely happier in my life having made the decision to change the way i was living. there's never going to be a perfect time until it's too late",
      "created_utc": 1607312092.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gex4yh9",
      "author": "thetexangypsy",
      "body": "I'm 21.\n\nI'm ~$2k in on what is projected to be roughly $15k of dental work. I've already lost 3 teeth (they broke in half and had to be removed).\n\nI have an incurable stomach disorder usually found in diabetics and people with EDS. I am neither. Look up gastroparesis.\n\nI have Stage 3 Kidney Disease. Stage 4 is where dialysis and renal failure start.\n\nThat little cigarette habit a lot of us pick up because the whole nicotine/appetite suppressant thing? Yeah, I can barely breathe when I get up. I usually get winded walking up a flight of stairs.\n\nGet fucking help. Please.",
      "created_utc": 1607323488.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gewe9u9",
      "author": "probinluvwithu",
      "body": "Anybody with BED had problems other than weight gain? I'm trying to recover now but it's hard",
      "created_utc": 1607306062.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gex1wr4",
      "author": "seatangle",
      "body": "I am very very lucky that I did not damage my body more. I’m 30 now. When I was younger, I was told at various points that I could have a heart attack and die. I don’t know why, but it never scared me. I guess I didn’t care, because it’s not like I could just stop if I wanted to anyway. Obviously, I wish I had felt more afraid about what I was doing to my body, and also for how I was wasting my life.\n\nAnyway, I mainly had the binge-purge subtype of anorexia. I always had swollen glands, I think people thought that was just what I looked like. It started really affecting my skin in my early 20s (previously had no issues with acne). Now, my teeth are wrecked. I hate going to the dentist because I’m so ashamed, and my teeth are sensitive as fuck, so it’s very painful. I have bad acid reflux, like waking up hacking in the middle of the night and not being able to lay down without regurgitating. I had osteopenia at 18. I don’t know for sure if it’s related, but I started getting Reynaud’s syndrome when I was 19 (when I’m cold my fingers and toes go numb and look like they are dead, it’s very painful and has caused permanent tissue damage). I also fucked up my ankles from over doing running when I was 27, so I can’t run anymore. My ED also led me to becoming an alcoholic (I’m sober now). \n\nMy ED didn’t kill me but it took so much of my life away; so many nights spent alone, scared, binging and purging, and hiding it like a criminal. That’s no way to spend your teenage years and 20s. I missed out on a lot. If you are in that place now, do whatever you can to break out of it. I wish I had sooner.\n\neta: ooh I forgot how to mention how fucked up my digestive system is. It’s been 2 years since I have binged and purged and I still get painfully bloated from certain foods.",
      "created_utc": 1607320945.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gexgk0e",
      "author": "sonic2cool",
      "body": "i’m 17 & bulimic, i’ve been purging for about 4 years now (ever since i was 13). regardless of if i’m losing lots of weight or not i get bad rashes, my excema flares up where i get patches of dry bleeding skin (it’s horrible), i feel cold all the time, dizzy, i get pains, my heart races including right now for absolutely no reason.\n\ni look dead all the time, my cheeks are puffy, i look fat in the face, my eyes swell quite easily & i have dark eyes. i look really unwell & i’m not even underweight yet. i can’t go a day without purging & it’s even gotten to the point of getting urges to purge WATER because of the realise it gives me. it’s like once you start there’s no going back. \n\nevery time i purge i tell myself it will be the last time, but it never is. i’ve tried going 1 week purge free to then quit on day 1 as the urges are too strong. \n\nbecause of all of this, gaining, losing, rapidly losing & rapidly gaining my body is skinny fat. i have a huge stomach that looks like i’m bloated 24/7, visible collarbones & thin arms. my body is a mess & like i said earlier i have bad excema which is very unattractive. not cute at all. \n\nmy ed has basically ruined my work, i can’t function properly & i’m quite slow. i don’t have many friends now, i feel so lonely & it’s becoming me & my ed because of how bad this all is.",
      "created_utc": 1607335128.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gewci30",
      "author": "AubergineFougueuse",
      "body": "I'd never have any problems before and now I got pretty much all symptoms of IBS",
      "created_utc": 1607305062.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gex5fjn",
      "author": "bbyunderliined",
      "body": "I’m 16 and I’ve already started losing lots of hair, am anemic now, low iron, low ferritin, feeling out of breath even just walking fast. I’m recovering though and I wish everyone the best",
      "created_utc": 1607323904.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gew2tmv",
      "author": "sorry-oo",
      "body": "IBS which I can mainly deal with but I can't eat or drink certain things without triggering it. My teeth are gross and really sensitive. Blood pressure issues. Currently undergoing tests for chronic joint and muscle pain.",
      "created_utc": 1607299742.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gewjybj",
      "author": "None",
      "body": "13 solid years of bulimia, 2 spent in a cycle of relapse/recovery. Relapse free for over a year now. Extremely sensitive teeth, very thin enamel. The bottom ones are sharp and jagged along the edges and the top ones are translucent.... I also have chronic pain that can be tough to manage and I used to have a really clear and beautiful singing voice, it isn’t as clear sounding anymore but that’s ok. I have horrible acid reflux now and can’t eat anything that would trigger it. I struggle with digestion sometimes. I also somehow have scarring on my kidneys that causes pain from time to time.",
      "created_utc": 1607309194.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gewv1oo",
      "author": "ajioajio_",
      "body": "Fortunately I only struggled with anorexia and bulimia for a year and a half, however I do not feel satiation or the sensation of being full. I have to suck my stomach to get an idea of how much food my body can handle correctly. \nSending lots of love to all of those who still struggle with and the consequences of an eating disorder.",
      "created_utc": 1607315901.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gexrv5g",
      "author": "jeabgrenouille",
      "body": "I had anorexia as a child, but I was caught pretty early (my parents had me seeing a doctor after a few months, and they really figured out what was up after about 8 months and I was hospitalized after being really unwell for about 9 months.)\n\nI want to comment the damage that I had because there was damage even after less than a year of ED. For me though, it was all reversed. I don't comment that because I want people to think it's no big deal, but to add to what everyone else is saying about wishing they had stopped much, much sooner before things became permanent.\n\nFor me, the biggest thing was stunted growth. I have a twin sister who was easily a foot taller than me at my worst. After many years of eating enough, I slowly caught up and we are now (15 years later) close to the same height (I am maybe only an inch or two shorter now). \n\nI also had a delayed period. I didn't start until grade 11 of high school, but that was already 6 years into recovery and so when it came, it was pretty normal. \n\nI had a bone density test and I had a few different scans and ultrasounds and such (I don't know for sure), and they were all okay. If I remember right, I was headed down a bad path, but I stopped in time.\n\nOtherwise, I had some hair loss, and a very hairy body that also reversed themselves. I also had problems with dizziness and blacking out and that has gone away now. \n\nFood focus was a huge thing for many years. I couldn't stand not eating or being slightly hungry. It made me feel crazy. That went away after a few years.\n\nI add this comment to say, don't lose hope and think, meh, it's too late anyway, might as well keep going. Sometimes these things can be reversed if you stop early enough, and with persistent, patient effort. It took me many years to feel normal, but for me, that was possible. \n\nI'm very sorry to those who have had permanent damage and I wish you well <3",
      "created_utc": 1607346347.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gey4n8h",
      "author": "Mental_Chip9096",
      "body": "I've lost two teeth, and have fillings and crowns/root canals on many others. All very sensitive and in pain daily. Thousand of dollars of work done, and to be done. Osteoporosis of my hip, osteopenia of spine. Hair loss in huge hunks, and what's left is the diameter of about my thumb. Body skin so dry it burns, and face so dry it breaks out and peels. Exhausted yet I sleep 10/12 hours a day and nap. Reflux, constipated or diarrhea (no normal bm). No period for decades, even on oral birth control. Had covid in may (while in isolation) but no antibodies, and had covid-like illness again in sept (my Dr. Thinks my body was exposed and \"remembered\" the reaction). Sick a LOT. And I'm in recovery! 37/f.",
      "created_utc": 1607354387.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gewi97r",
      "author": "None",
      "body": "I was lucky I guess because fifteen years in one out of anorexia, and I only got diagnosed with osteopenia. I think the most damage to me was my mental health, and although it’s not as tangible as physical health, it’s so real as everyone here knows. The unhealthy mental state I was in has continued to mess with me long after I’m considered healthy physically. I’ve also lost my twenties, as I wasn’t dating or hanging out with friends or making experiences because I was too obsessed and fearful of food. I started my marriage off on a shaky foundation, I have more regrets than happy memories, and I have a lot of broken or rough relationships. My career sucks because I was unable to pursue anything with confidence and lacked focus on much else besides food and exercising. Even though I have learned a lot and become a smarter person in some ways because I have this extra challenge as a part of me, I would trade all I have gained from recovery to have never had an eating disorder. It took so much from my life and it will continue to be a challenge because I let it stay for far too long. It’s so not worth it...make healthy decisions for your future self. The less time you spend with an eating disorder, the more time you’ll have back with yourself and your loved ones",
      "created_utc": 1607308245.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gewxrj1",
      "author": "Coast-Loose",
      "body": "My teeth are forever ruined, they’re ugly, yellow, and brittle. I have hardly any enamel left. I’ve tried every whitening strip, toothpaste, and mixes. I was told by my dentist that not even professional whitening will help me.. my insides are weak because of bulimia and my metabolism has slowed down. Acid reflux’s is bad and my stomach is cramping every day. It is not worth it.",
      "created_utc": 1607317785.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gex3trn",
      "author": "headjones",
      "body": "Former Purger. I scarred up my throat something fierce, changed how I sounded entirely. My dentist says that the roots of my teeth got messed up (not sure how). My hair was coming in patchy when it was at its peak.\n\n&#x200B;\n\nP.S.\n\nDoes the brain count as the body lol",
      "created_utc": 1607322523.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gexb4hz",
      "author": "ssilvia1001",
      "body": "Well, at the beginning I lost weight. A lot of weight. My period stopped, my hair was falling, my whole body was hurting- each part of it. After that anorexic period I’ve gained a little. I was disgusted whit myself so I’ve tried to throw up food couple of times in order to become thin again. Thank God I was not my thing and I just stopped trying. Since September I’m suffering from binge eating disorder and I’ve gained weight drastically.\nMy body hates me but it is normal- I have done a lot of bad things to it.\n\n\n*sorry if there are any grammar or spelling mistakes*",
      "created_utc": 1607329296.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gexptxn",
      "author": "noodlebiitch",
      "body": "Got osteopenia at age 16 (am now 20). Already had ibs but managed to fuck yo my bowels even more. My metabolism slowed right down.",
      "created_utc": 1607344706.0,
      "score": 2,
      "context": []
    },
    {
      "id": "geyczqc",
      "author": "None",
      "body": "Besides the damage I did to my inside like f my metabolism, I lost so much of my hair, my nails started breaking and cracking very easily, I started sleeping horribly, and honestly, I think the most damage was done to my mind. ive just started recovery and the amount of hatred and f'ed up thoughts I have surrounding my ed and body is insane. you can't always see the worst damage being done.",
      "created_utc": 1607358623.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gew57pq",
      "author": "smol_lydia",
      "body": "Delayed puberty—my ED started at age 6 with ARFID and then later into anorexia hell. \nPOTS syndrome Aka permanent nervous system damage that leads to tachycardia, nausea, fatigue, low blood pressure\nShitty digestive system sometimes my body just straight up can’t digest stuff anymore \nMy hair used to fall out; it doesn’t anymore but it’s still thin \nI stunted my growth I’m the shortest person in my family \nAcid reflux \nNot to mention so many years of childhood/adolescence/early adulthood lost to this sad existence. \nI’ve been in recovery since 2017 and I’ve cycled through relapses like most but nowadays my body simply cannot tolerate restricting any longer it just shuts down. \nI also had a miscarriage in early 2017, one of the things that pushed me towards the treatment that saved my life.",
      "created_utc": 1607300980.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gex4yey",
      "author": "fia23",
      "body": "i’m not even 20 yet, i’ve struggled with my ED from age 15, although technically i’m in recovery now. my hair is so much thinner than it once was, still falls out in clumps in the shower. my face was so sunken in at one point, it looked like i had a hard drug habit. my skin is incessantly dry and flaky, like the peel you get after a sunburn but it never quite goes away. i have wrinkles and fine lines that my near 60 year old mother doesn’t. but i still feel prettier than i did when i was starving myself. \nedit: i also stunted my growth. i was predicted to be 5’10 as both my mother and father are 6 feet tall, yet i’m a lowly 5’4",
      "created_utc": 1607323487.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gex0whs",
      "author": "crestfallenshadow",
      "body": "I’m 16, \naged my body to that of a 30 year old from the constant periods of restricting.\nBradycardia\nEarly onset osteoporosis\nHair loss\nNo period\nThere’s no benefit or happiness in this disorder.",
      "created_utc": 1607320142.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gevxrkg",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1607297139.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gew84hh",
      "author": "None",
      "body": "I lost a gallbladder.",
      "created_utc": 1607302600.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gewgmhe",
      "author": "kkumas",
      "body": "I wouldnt shower for days because i could barely move and i would wake up in the night constantly because of heart palpitations.  I also went to the hospital several times for severe constipation and would have to take 4 doses of stool softener daily for months or else i couldnt go to the bathroom.",
      "created_utc": 1607307348.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gewle0n",
      "author": "Dalmare20",
      "body": "I've dealt with disordered eating basically all my life but I didn't start restricting until I was 17, I'm 24 now. My metabolism absolutely sucks, I get heart palpitations and have hypoglycemia. I have to eat something every few hours to control my blood sugars or else I get nauseous, shaky and risk passing out.",
      "created_utc": 1607310012.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gewmc38",
      "author": "uhwhydoifuckingexist",
      "body": "I overdosed on stool softeners. I know, hilarious way to start a story.\n\nI tried to kill myself so I took whatever pill bottle i could find in the cabinet, the pills were constipation pills, I think you can guess what happened. Whenever people ask about it, I just say sleeping pills so they can stfu.\n\nI have stomache problems still and it sucks. I wish I took different pills bc nothing changed",
      "created_utc": 1607310557.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gewo4mg",
      "author": "None",
      "body": "After being anorexic for 14 years, I have bone/teeth issues. I just lost a tooth a month ago and am getting more work done soon. I'm infertile. I still think about food all the time and struggle daily. Idk if it will ever be different for me.",
      "created_utc": 1607311611.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gewy4ap",
      "author": "coachavocado",
      "body": "i dont know if this is considered a disorder but\ni stuggle with trying to go the whole day eating little to nothing. and cuz im dumb, drank only teas and barely any water. i was super dehydrated, my hands were shaking and i felt super nauseated, also felt like i wanted to sleep but i couldnt. i made myself eat ice cream cuz i felt like my body needed sugar, and downed 4 bottles of water and a few apples just to feel ok again. these are the milder effects, it can get so much worse. please eat and be kind to yourself.",
      "created_utc": 1607318040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gexh8h3",
      "author": "mpwooo",
      "body": "Reflux! Terrible acid reflux that's damaging my throat and very painful. Orthostatic hypertension. Teeth problems like others have mentioned already.\n\nSending lots of love to all on their journey, you are not alone!",
      "created_utc": 1607335890.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gexzli0",
      "author": "None",
      "body": "I was nearly got my organs to fail. My kidney wasn't working right anymore. My skin was slightly yellow because of my liver and I wasn't able to speak properly, I slurred the words, and I couldn't concentrate for 30 s. I couldn't walk faster than a snail and even then not very far. I collapsed all the time and my body was full of bruises",
      "created_utc": 1607351523.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gezbjlz",
      "author": "ShiftProfessional508",
      "body": "It’s been 4 years and I still have hemorrhoids.",
      "created_utc": 1607372756.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gf00mhx",
      "author": "myredbandlife",
      "body": "I’m 25 and I have Stage 4 Chronic Kidney Disease (kidney failure), VUR and kidney stones. I can’t keep warm for the life of me and my hair is falling out so much that I have bald spots, everywhere. \n\nI have a high heart rate and my immune system is that of a newborn. My nails are blue due to lack of oxygen. My teeth are rotted away from the back and I had to have surgery on my sinuses / nose because the stomach acid destroyed them. I fucked my entire life up because of AN/BN. My back hurts constantly and my migraines never cease. Everything just sucks.",
      "created_utc": 1607385707.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gf0uu9p",
      "author": "kernalkernal",
      "body": "I would say so far I've gotten off easy. My teeth have no really bad visible damage, with the exception to receding gums and a bit of decay and some sensitivity. My heart has arrhythmia and me being anemic doesn't help. Heartburn is almost common and I'm 20 years old. My voice has changed because of the purging. Me tearing my esophagus is what made me turn around. The entire ordeal made me stop the purging at least. I still struggle with restricting and binging. It's a big decision to stop or at least cut-down, but get out of it somewhat unscathed",
      "created_utc": 1607402384.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gf57chh",
      "author": "Pais0513",
      "body": "Not sure if anyone else has had this experience, but I struggled with anorexia, I’d eat maybe a few carrots a day and work out for 2.5+ hours a day counting every calorie that I could smell. I stopped getting my period for over a year, constantly was dizzy and would faint, anemic and diagnosed with POTS at the age of 17. I still struggle to ensure I eat enough as I never seem to feel hungry but just feel sick instead. I’m 25 now and the lack of a period and proper nutrients in my teenage years caused my body to not fully develop. I have one breast that is what I call “stunted” due to lack of nutrients and hormones during crucial years of puberty. To this day I am self conscious to stand in front of my significant other of 5 years shirtless or with the lights on.",
      "created_utc": 1607495484.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gf7rper",
      "author": "vaultgirlmeg01",
      "body": "I have chronic fatigue. I can sleep 12 hrs straight and not wake up and still be exhausted. I get tired when I do anything. I have a hard time focusing still. I haven’t had a period in over a year and have a libido that swings back and forth uncontrollably. I am always dehydrated. I have such bad constipation no matter what to the point of being RX medicated and needing over the counter meds, but I either have constipation or I have diarrhea. My hair thinned out and I have a hard time eating because I get nauseated easily.",
      "created_utc": 1607552334.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfhog9y",
      "author": "smoodiequeen",
      "body": "I’ve been struggling with a mix of Anorexia and orthorexia lately. It’s been going on since maybe April? Wonderful timing due to covid, here we go. I’ve lost 30 lbs through intense starvation periods. Even on the less intense periods of me restricting I’m barely eating enough. I would run and run and run for 5-7 miles until my body was close to giving out— I’ve almost fainted a few times. My eating disorder has ruined a sport I used to love and cherish for years. My mind is basically at war with itself, all I think about is food to be honest. I’ve even had dreams stressing about the food I’m eating, it’s awful. My skin and nails have weakened. I used to have such pretty hands but all I see now is that they’re weak and dry, my nails crack so easily. Prior to my ED, I had low iron so the fatigue, constantly being cold, and bruising at the lightest touch has only intensified. I used to have lots of muscle, I used to have exercising as a passion but like I said before, I ruined the gym for myself as well as my passion for running like I said before. I’ve isolated myself from my friends because I feel ugly and gross 24/7. Since I’ve lost a good amount of weight as well, it hurts to sit or just put my body into any position I used to find comfortable, my ribs show now and if I lean back on something that’s a more solid surface, I ache and bruise. I’m sure there’s more to it, but that’s just the surface of what I can think right now.",
      "created_utc": 1607748670.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfhx406",
      "author": "Casslynnicks880",
      "body": "My bulimia has made me gain a lot of weight, I’m hungry more because I throw everything up so it ends up just putting weight on, I went from a size 12 to 18 in about two years. A back molar broke down and cracked from stomach acid. The worst thing is just hating my body and obsessing over it",
      "created_utc": 1607755465.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfrs0xt",
      "author": "itsdani3lla",
      "body": "*Trigger Warning*\n\nI turned 23 last month (I just started grad school) and I’ve had an eating disorder since I was 12 in middle school. I’ve been on/off (mostly off) but recently I feel like I got worse.\n\nI know I’m kind of late to this but I think I might’ve done damage to my digestive system. I’ve been using laxatives on/off from Octoberish 2018 to this past June 2020 (so like a year and a half). I relapsed this time last year (December 2019-February 2020) and lost some weight but was still in the “normal” range for my height. I also started purging more too during this time. \n\nI  somewhat “recovered” around when Covid started in March, but only because my sister who was roommates with me at the time wanted to go to the cafeteria and I felt bad about her going by herself across campus to the only one that decided to stay open. I ate only breakfast and dinner, but still used laxatives and puked after breakfast when my sister and I got back to the dorm. I waited for her to go to the library to do it. My sister and I had our own rooms but shared the common area and bathroom. \n\nAt the end of June I stopped using the laxatives only because the bottom of my legs and hands got tingly and I started feeling weird (idk how to describe it). \n\nIn July I started getting hemorrhoids (or that’s what the doctors think but I’m paranoid it’s something else). I get bright red blood on the toilet paper and they gave me some cream. It did help for a while but it started coming back again like last week. Between then and now, id have light bleeding but nothing big I guess. Last week my lower left side of abdomen started hurting when I poop too. \n\nI had jaw surgery for my underbite on Friday and I haven’t pooped since Thursday. Ever since June I’ve been using probiotics and in October I started using the psyllium husk in my smoothies that my parents have but I stopped using the husk. I haven’t pooped since Thursday like I said and idk if it’s because of my surgery or what. But I’m paranoid that I permanently damaged my digestive system and might need those pouch things to take my poop. I’m also suspicious that I can’t poop now w/o probiotics because I haven’t taken those since Thursday either. \n\nI have a doctors appointment on Tuesday and I’m gonna come clean and talk to her about this. I literally just told my mom earlier today about abusing laxatives for so long but I’m not sure if she understood me because my jaw’s still swollen from the surgery and I can’t really talk",
      "created_utc": 1607913197.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh1l70l",
      "author": "___bbygirl",
      "body": "i'm currently suffering from an ed and this message goes out to everyone that might be in a situation similar to mine. \nmy disorder has everything to make you think it's \"not that serious\". i haven't had extreme weight loss - yes, i've lost weight but i'm still at a \"healthy\" bmi. i have never starved myself for as long as some other people do it. i don't \"look sick\". if you relate to these things, you know the list goes on and on. your mind tricks you into thinking \"it's not that serious\" because you don't have all these physical symptoms everyone mentions, so you think 'well, i might as well keep going with this because i'm not actually that sick' \nbut let me tell you something: there are so many physical symptoms that you might be experiencing that you think are unrelated to your eating disorder but are actually early stages of problems that can become life-threatening. \ni'll give you some examples that i live through everyday: \ni wake up with my limbs numb every morning. i can't feel my legs or arms and they feel heavy, like blood isn't circulating properly. \nalso, my hands and feet start tingling at random times in the day. sometimes, after the tingling, my feet go numb and i fall. \ni have a very - and i mean VERY - hard time pooping. i know, no one likes to talk about this but it's true. i can't go to the bathroom and i poop very rarely, which is (needless to say) extremely uncomfortable.\ni have acid reflux almost after every meal.\ni get headaches very often.\ni dream about food every night. \n\nand i could continue. i hope this text was somewhat useful to people who can relate, and let me tell you: your disorder (whether it's been diagnosed or not) is never \"not that serious\". you always deserve help, phsyical symptoms or not, underweight or not. get the help that you need<3",
      "created_utc": 1608953742.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh2csf2",
      "author": "balaenopter",
      "body": "I needed two blood transfusions at the age of 23. Before being admitted to hospital I was unable to walk more than 10 meters without rest. I couldn't left home because I live at 4th floor and I couldn't walk up the stairs. Why? Because by throwing up multiplie times a week since I was 12 I have developed inflammation of my stomach and my gulp. It was bleeding repeatedly for years and led to huge blood loss. Normal hemoglobin level should be around 12-16 g/dl. My was 3,2. Doctor said that if I was 10 years older I would be dead by now or at least brain dead from hypoxia.\nPlease don't be like me and don't seek help only when you're unable to walk. You're valid and you deserve a better life.",
      "created_utc": 1608981957.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gew2at2",
      "author": "burn-fetish",
      "body": "I know it probably doesn’t mean much, but I’m sending you lots of love <3 if you were my mom, I’d hug you and never let go.",
      "created_utc": 1607299472.0,
      "score": 35,
      "context": [
        {
          "id": "gew0rzk",
          "author": "doncheche",
          "body": "Oh, kids. Am in my early forties with osteopenia, an early form of osteoporosis, and all sorts of bowel/urinary issues. I have to have regular bone scans and am risk for fracture. I piss myself on the regular, my kids know that I just don't eat and it's the worst modeling for them, and, for the last 30 years, I wake up thinking about food, go through my day thinking about food, and go to bed drunk so I'm not thinking about food. 0/10.",
          "created_utc": 1607298705.0
        }
      ]
    },
    {
      "id": "gewiybp",
      "author": "gorerella",
      "body": "My heart aches for you, and for myself too, since what you just described sounds like my future if I won’t get this disorder under control. I wish I could hug you and take away some of your pain. You deserve to wake up happy.",
      "created_utc": 1607308634.0,
      "score": 11,
      "context": [
        {
          "id": "gew0rzk",
          "author": "doncheche",
          "body": "Oh, kids. Am in my early forties with osteopenia, an early form of osteoporosis, and all sorts of bowel/urinary issues. I have to have regular bone scans and am risk for fracture. I piss myself on the regular, my kids know that I just don't eat and it's the worst modeling for them, and, for the last 30 years, I wake up thinking about food, go through my day thinking about food, and go to bed drunk so I'm not thinking about food. 0/10.",
          "created_utc": 1607298705.0
        }
      ]
    },
    {
      "id": "gf7ype5",
      "author": "None",
      "body": "I feel your pain. Keep sharing and stay strong! I received help at Canopy Cove in Tallahassee. Recovery is possible! ❤️💕",
      "created_utc": 1607555925.0,
      "score": 2,
      "context": [
        {
          "id": "gew0rzk",
          "author": "doncheche",
          "body": "Oh, kids. Am in my early forties with osteopenia, an early form of osteoporosis, and all sorts of bowel/urinary issues. I have to have regular bone scans and am risk for fracture. I piss myself on the regular, my kids know that I just don't eat and it's the worst modeling for them, and, for the last 30 years, I wake up thinking about food, go through my day thinking about food, and go to bed drunk so I'm not thinking about food. 0/10.",
          "created_utc": 1607298705.0
        }
      ]
    },
    {
      "id": "gew7mg0",
      "author": "Boosey0910",
      "body": "Oh I can relate to much of this.  Sending you love and support.  What a tough road it is.",
      "created_utc": 1607302317.0,
      "score": 14,
      "context": [
        {
          "id": "gew465v",
          "author": "moonbrows",
          "body": "a lot of the damage was in the immediate; lanugo was the worst and i felt like an absolute monster.   \n\n\ni think the longer effects were; no gag reflex. it ceased to exist, i couldn't b/p anymore and couldn't stop myself for years throwing up at random intervals, or i'd be eating food and suddenly it would all come up in front of my family or friends. it took years to right this but it was so embarrassing and humiliating.  \n\n\ni get heartburn and acid reflex really badly still and my metabolism is totally ruined, it's stressful and emotionally draining to still even in recovery have to be conscious of what you eat because your body can't process it properly. \n\ndamage to my teeth; i have pretty much no enamel left even though i always have and still brush like mad, they're so sensitive and when it's cold i get shooting pains, i've had them whitened once already because of the garish colour they turned from all the stomach acid. you don't know how important your smile is to you until you can't smile anymore.   \n\n\nbones; they're so fragile now, even though i've recovered i'm frightened if i fall i'll crack something. my joints would click and sometimes it hurt to get out of bed in the morning, i had to rub ointment and cream on my legs and arms because it just hurt so badly, and in the cold it actually made me ache and slowed me down to a snail pace.   \n\n\nheart; i never had heart problems, but i pushed my cardiovascular system to the absolute limit and i'm shocked i didn't get heart failure from the sheer stress i was putting on myself, but heart palpitations did become quite frequent for a long time and i never knew if it would become something more sinister without me knowing. a friend of mine actually went into cardiac arrest due to how low her weight was.  \n\n\nreproduction; my periods stopped and they've never ever been normal since, but this was during my time with bulimia, and now when i get periods they're either a day of spotting or 10 days of full blown cramping, lift doors opening in the shining, vomiting episodes. i couldn't have children for a long time and i'm one of the very lucky ones who's weight gain returned their fertility and it's not something i'd change for the world now. i didn't know i wanted children until i realized i couldn't.   \n\n\ni lost my eyesight at one point whenever i got up, i'd stumble around until it came back or cry until my father came into the room. i was eighteen and unable to get out of bed without falling over.   \n\n\nmy legs and arms tingle all the time even now, they go dead in a few seconds and take forever to wake up. you WILL have to put on weight at some point unless you're intent on dying that way and my god the stretch marks. i've always had matchstick legs and believe me - they aren't immune despite being small. when you care so deeply about your appearance - the damage you're going to be doing it to the future is definitely important imo. \n\nlaxative and diuretic abuse ruined my bodily functions for a long time and it can seriously inflame your colon so you can't even go to the toilet without assistance, and the damage can continue from there. \n\nmy voice breaks all the time because of the damage i did to my throat, i go from sounding high pitched and sweet to scratchy and like i smoke a twenty deck a day, it's humiliating and upsetting and brings me to tears from time to time. \n\nrashes; i had rashes so badly, i still get them now if i don't eat enough and have to powder myself with make up and hope no one notices. \n\ni don't think i'll ever be comfortable looking in the mirror, and i wish someone had told me this when it first started so i could get help. it went on for so long, undetected, and now it's permanently skewed my vision of myself. i won't ever be satisfied, i can't be satisfied. whether big or thin, normal or underweight - nothing is good enough for me. i hope one day it will be but i'm still waiting for that one to happen. \n\ni'm now insulin resistant, meaning i can't eat carbs (not diabetic, i try really hard to not let it get to that stage), else i might develop type 2 diabetes.  \n\n\ni'm still anaemic after over ten years. i bruise like mad, i'm scared if someone touches me i'll bruise, i usually come out in awful purple bruises too and you can't even hide them. \n\nand i'm also short because i denied my body the nutrients it needed to let me grow. \n\nthose are just the physical things, the mental damage i did to myself is something else all together. i won't go into detail because i can't really bring myself to do it, but years of my life have been spent in therapy, on medication, sick time off work, horrible scars, impulsive and stupid behaviour, drug taking, terrible family relationships, really rocky and turbulent relationships (you're vulnerable. bad people know this.)",
          "created_utc": 1607300431.0
        }
      ]
    },
    {
      "id": "gew4m2n",
      "author": "enord11400",
      "body": "My experience was similar (although less severe but my purging took up maybe 4 years out of the 7 that my ED was most active) Purging wrecks way more than your throat. The sort of explosive act of forcing vomiting via gag reflex creates a lot of pressure and in your head and abdomen. I think my hemorrhoids now are from purging tbh. I used to strain muscles in my back all the time as well. \n\nAnd for OP, hemorrhoids don’t ever go away completely without surgery. Not that they are the end of the world but they are really annoying. \n\nPurging also gave me chest pains for years even when I had stopped or rarely did it. I still get them sometimes. At least one of my teeth is visibly worn down from my hand going past it also. These things aren’t that bad but I went to treatment twice and I know I was headed for much worse if I hadn’t. BP and HR were totally messed up but I got help soon enough to reverse it fairly quickly. The sooner you get help the better chance you have of repairing damage.\n\nEdit: I added this as a comment on your post since it was related. This is mostly addressed to OP. So sorry about your back.",
      "created_utc": 1607300658.0,
      "score": 12,
      "context": [
        {
          "id": "gew2fuy",
          "author": "Solkvds",
          "body": "I'm 23 and am closing in on my 10th anniversary of struggling with bulimia, yay me. So this is not entirely solely on starvation. But might still be interesting. Something that had never even ocurred to me and I feel like a lot of people dont know is that repeated vomiting is actually quite heavy on your back. So apparently 10 years of hunching over a toilet mixed with some bad luck/genetics can cause you to have 2 herniated discs at the age of 20 (which is when I first started experiencing the pain). Sometimes its better, but other times when theres been some strain on my back I can hardly sleep from the pain because I cant even get in a comfortable position and my legs feel like they're sleeping all the time. I know there's probably a lot worse that can come from ed's but I thought I'd share a bit of an \"unusual\" one or one that people dont commonly think of.",
          "created_utc": 1607299544.0
        }
      ]
    },
    {
      "id": "gexehyx",
      "author": "HoneyAndSht",
      "body": "I was looking for this comment. This is indeed true. \nI am honestly more scared of never getting it back properly. It used to be sky high and now I can barely eat anything to maintain my weight. So I have to actually eat more and gain more to recover. Its harder.",
      "created_utc": 1607332854.0,
      "score": 6,
      "context": [
        {
          "id": "gew6vuz",
          "author": "erinthefatcat",
          "body": "My metabolism is fuckedddd",
          "created_utc": 1607301904.0
        }
      ]
    },
    {
      "id": "gewzvn1",
      "author": "crycry_chemtrails",
      "body": "Jesus our histories sound eerily similar. I’m like “oh I feel totally fine and I’m only 21”. Yeah I’m 21 with an ED history of 10 years. Good thing I’m going into treatment soon...",
      "created_utc": 1607319353.0,
      "score": 3,
      "context": [
        {
          "id": "gew4m8v",
          "author": "Current_Selection",
          "body": "I'm 21 (22 this week) and I've had disordered eating for about 11 years, and around 16 it turned into full blown anorexia that caused me to go inpatient. While there I learned that I have permanently caused damage to my heart (honestly I don't remember the specifics), so much so that I have to see a cardiologist and when I did a stress echo (get your heart rate up and do an ekg/ultrasound) started having significant enough changes to the rhythm that I had to repeat the test and was told I was at risk for a heart attack during exercise this year when I did it. I relapsed for less than a year this time around and caused that much damage. I have also had abnormal liver enzymes after restarting recovery and have low bone density. Meanwhile, I was on the border of UW and normal, maintained a menstrual cycle the whole time, had some chest pain but it wasn't super concerning, and had normal electrolytes. When things go bad, they do so FAST. I managed to have disordered behavior for a long time with okay health but it went downhill within the span of a couple months and only found the extent of damage after testing that is not normally requested for a 16 or 21 year old.",
          "created_utc": 1607300660.0
        }
      ]
    },
    {
      "id": "gewzcmh",
      "author": "cjx888x",
      "body": "I def do. I have issues with my throat because of the abuse on my esophageal sphincter- All that binging put severe stress on it, and now I deal with heartburn all the time but I also choke incredibly easily and often. Also have a chronic cough bc of it. My hunger cues are also permanently off, which is horrible in recovery. I can’t get my body to tell me what it needs even now that I want to listen. Its been *years* and none of that has returned to normal. I could go weeks on end and feel zero hunger, but I could also go just as long where nothing satiates me and I feel hungry all the time. Its infuriating. Especially when you are trying to enjoy your life and in the middle of something you just crash hard because you had no clues from your body that you needed food/water.\n\nI have chronic pain now too- my joints always hurt no matter what I do, and I still have heart palpitations even though I’ve been in recovery for years. Its terrifying.",
      "created_utc": 1607318950.0,
      "score": 7,
      "context": [
        {
          "id": "gewe9u9",
          "author": "probinluvwithu",
          "body": "Anybody with BED had problems other than weight gain? I'm trying to recover now but it's hard",
          "created_utc": 1607306062.0
        }
      ]
    },
    {
      "id": "gex1sal",
      "author": "probinluvwithu",
      "body": "Thank you for the info. BED is rarely talked about ❤️",
      "created_utc": 1607320845.0,
      "score": 6,
      "context": [
        {
          "id": "gewe9u9",
          "author": "probinluvwithu",
          "body": "Anybody with BED had problems other than weight gain? I'm trying to recover now but it's hard",
          "created_utc": 1607306062.0
        },
        {
          "id": "gewzcmh",
          "author": "cjx888x",
          "body": "I def do. I have issues with my throat because of the abuse on my esophageal sphincter- All that binging put severe stress on it, and now I deal with heartburn all the time but I also choke incredibly easily and often. Also have a chronic cough bc of it. My hunger cues are also permanently off, which is horrible in recovery. I can’t get my body to tell me what it needs even now that I want to listen. Its been *years* and none of that has returned to normal. I could go weeks on end and feel zero hunger, but I could also go just as long where nothing satiates me and I feel hungry all the time. Its infuriating. Especially when you are trying to enjoy your life and in the middle of something you just crash hard because you had no clues from your body that you needed food/water.\n\nI have chronic pain now too- my joints always hurt no matter what I do, and I still have heart palpitations even though I’ve been in recovery for years. Its terrifying.",
          "created_utc": 1607318950.0
        }
      ]
    },
    {
      "id": "gex2clr",
      "author": "cjx888x",
      "body": "Truth. It can fuck you upppp though. I really hope you find the strength to get through it! Feel free to pm if you ever want to talk.",
      "created_utc": 1607321301.0,
      "score": 5,
      "context": [
        {
          "id": "gewe9u9",
          "author": "probinluvwithu",
          "body": "Anybody with BED had problems other than weight gain? I'm trying to recover now but it's hard",
          "created_utc": 1607306062.0
        },
        {
          "id": "gewzcmh",
          "author": "cjx888x",
          "body": "I def do. I have issues with my throat because of the abuse on my esophageal sphincter- All that binging put severe stress on it, and now I deal with heartburn all the time but I also choke incredibly easily and often. Also have a chronic cough bc of it. My hunger cues are also permanently off, which is horrible in recovery. I can’t get my body to tell me what it needs even now that I want to listen. Its been *years* and none of that has returned to normal. I could go weeks on end and feel zero hunger, but I could also go just as long where nothing satiates me and I feel hungry all the time. Its infuriating. Especially when you are trying to enjoy your life and in the middle of something you just crash hard because you had no clues from your body that you needed food/water.\n\nI have chronic pain now too- my joints always hurt no matter what I do, and I still have heart palpitations even though I’ve been in recovery for years. Its terrifying.",
          "created_utc": 1607318950.0
        },
        {
          "id": "gex1sal",
          "author": "probinluvwithu",
          "body": "Thank you for the info. BED is rarely talked about ❤️",
          "created_utc": 1607320845.0
        }
      ]
    }
  ]
}