{
  "id": "k8gbvp",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1607346540.0,
  "title": "Request: Confusing hunger cues/ how I can respond to them properly",
  "selftext": "I’m a female in their mid teenage years with anorexia as an eating disorder. My doctor says I need to recover as quickly as possible if I want to start working out again (for my own enjoyment of course) but gaining weight is really triggering me and it leads to me having breakdowns almost every night. I take medication, and this medication I take makes my hunger cues come very often, which is quite hard to ignore so I respond to them normally. I know this isn’t considered over eating but honestly I’m not sure anymore, I just try and eat until I’m full, but ever since a young age I’ve always been a hungry kid, so I eat ALOT. Then I usually skip some meals the next day which I know is very unhealthy, it’s just going to lead me in an endless loop... is it normal for me to eat until I’m full/satisfied? I’m only satisfied when I’m full.\nAnd how long will my recovery take? I’ve been in recovery for a couple of months now but have only been able to put on maybe four pounds,,, please someone give me some insight on recovery and listening to hunger cues/ how to respond to them properly...",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k8gbvp/request_confusing_hunger_cues_how_i_can_respond/",
  "score": 49,
  "num_comments": 3,
  "comments": [
    {
      "id": "gezz1ed",
      "author": "None",
      "body": "I try to find a person you can trust, who is healthy and has normal hunger cues, and get them to tell u when they are eating and about how much (and you may need to add a snack or shift the timing of a snack here and there). \n\n&#x200B;\n\nSometimes u have to make adjustments; e.g. if they are a younger sibling who is a little smaller than you or an older adult who doesn't need to eat as much or isn't as active as your body is used to; you may need to eat more. \n\nTHIS CASE IS A LITTLE MORE TRICKY/RISKY; if it's for example a guy or boyfriend, who is larger than you/ir working out more, then yes, you probably don't need to eat as much as him when you are fully recovered. However, during recovery, you will likely need to eat MORE than him. And some days, if your body is feeling hungry, it's OK to eat more than him (e.g. when girls are on their period, yes there are cravings, but your body also needs extra calories cuz you are literally losing a ton of blood!). \n\n&#x200B;\n\nThis is really hard for me, but it helps you learn \"ok\" this is a normal time, I need to train my body to get hungry at. And (I would talk to your doctor about how much you should be eating tho) the more personal component is seeing; ok am I full yet? Have I eaten enough? It's going to be hard and takes a long time, but I believe in you!\n\n&#x200B;\n\nFINALLY: I know this is hard, but don't be afraid to put on a little extra. Im also an active person, and this terrified me. However, when I got back into working out (AND MAINTAINING A HEALTHY EATING SCHEDULE... in fact I had to eat a little more once I was working out again) I was able to get into a fit/health state in a decent amount of time. Again, the hardest part is waiting......",
      "created_utc": 1607384867.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gexs4ds",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1607346541.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gf1nife",
      "author": "None",
      "body": "Hey there\nFirst of all I’m sending you love as someone who has battled ed for 7 years and understands your pain.\nSecond, it is harder than people realize to do something as small as a few crackers can be the hardest and scariest thing. So don’t minimize what you feel but recognize it. Now with that, start small. If you’re scared of gaining weight you have to realize it is absolutely necessary. BUT doing it in a healthier way could help you feel better about it. That’s what I did and I know everyone is different but it definitely helped me when those thoughts of being mortified about gaining came, I would combat them with, well I’m eating healthily, taking care of my body and exercising some during the week, so the gained weight is good!!\nThat being said, much easier said than done. I still have a hard time with the feeling of being full, that’s what drove my bulimia for years. Honestly though the only way I got through that was to eat but not until I was full, just until I’d eat one plate or one or two portions. That way I was getting the nutrients I needed but wouldnt purge because of that dreaded feeling of being full. \nUnfortunately it is very easy to be stuck in that loop, for years even. But do what you can now to break it, and I know it’s so hard but please trust me when i say it’s worth it. It won’t happen overnight, recovery is a long road but every single day you eat a meal and every single day you don’t starve yourself or skip a meal is a VICTORY!!!! \nI’m sending you so much love and well wishes ❤️ hang in there",
      "created_utc": 1607428509.0,
      "score": 1,
      "context": []
    }
  ]
}