{
  "id": "k9prna",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1607510919.0,
  "title": "Request: Should I give ED treatment a shot?",
  "selftext": " \n\nI’m in my first year of grad school and have been going through many stress related issues. One of those issues is an extremely low appetite where I often find myself skipping meals or taking an entire day to eat a sandwich. The appetite issues are just one of many stress symptoms.\n\nI scheduled an appointment with our school counseling center and went through a few screenings to find out what type of care I need. I was surprised out of all the issues I came to talk about, they seemed to focus very heavily on the food issues. Which like I said, in my opinion, is stemming from severe anxiety issues from grad school.\n\nThe counseling center has decided my best course of treatment would be to get help from the Emily Program. I had never heard of it, but they apparently specialize in ED treatment and I could do outpatient care in my city.\n\nI’m just really surprised by this and I’m tempted to dismiss it. I truly don’t believe an ED is my problem, although I see how some of my stress symptoms appear this way.\n\nI’m just curious on peoples thoughts. Should I give this a shot? I know fixing the eating problems will reduce the stress in my life, but doesn’t feel like the real problem. Mg appearance hasn’t changed, if anything I’ve gained quite a bit weight because of the weird eating patterns. Or do I need to be more open minded about what an ED looks like?\n\nAny advice would be great!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/k9prna/request_should_i_give_ed_treatment_a_shot/",
  "score": 53,
  "num_comments": 9,
  "comments": [
    {
      "id": "gf5v5fo",
      "author": "Zelda_is_my_homegirl",
      "body": "TL;DR : Go to the doctor. \n\nSee a medical doctor and/or psychiatrist. A school counselor is not qualified to diagnose an eating disorder. Stress is only one of many medical conditions that could cause loss of appetite. You could certainly contact the eating disorder folks who could likely screen you, but I would get checked out for loss of appetite by a doctor first to rule out other conditions. \n\nTypically, traditional eating disorders are a mental health issue and would involve intentionally restricting, binging, purging or other disordered behaviors, rather than simply not feeling hungry. Now, if you’re toying with enjoying that feeling of emptiness or not wanting it to end, I would say you’d be catching a problem pretty early. \n\nI lost my appetite due to stress about a year ago. I was thrilled though, because I’ve always been overweight and had already severely restricted calories off and on for about 15 years to try and lose weight. After about 2.5 months on 200-600 calories per day, I had lost ~40lbs and my gallbladder was failing. I felt the worst I’ve literally felt in my life. I wanted to feel hungry but couldn’t and everything made me nauseous as soon as I tried to eat. So I didn’t. I put off medical care for the nausea for weeks, because despite how terrible it was I was so happy about not being able to eat. I liked that it forced me to starve with the level of commitment I’ve always wished for. \n\nAre you hesitant to seek medical care for stress or loss of appetite? Do you inwardly enjoy the weight loss or appetite changes? \nI would say to sit with those questions, but absolutely still see a doctor first and foremost.",
      "created_utc": 1607518239.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gf6q2ar",
      "author": "Current_Selection",
      "body": "I would say that yes- give it a shot. Eds come in all sorts of presentations and skipping meals due to anxiety is what made me relapse last time around. Eating disorders are a coping skill (a maladaptive one at that), so when you start treating it you need to also be in therapy or a program equipped to help with the stress that will come up from not using it. Also, stopping these behaviors now and earlier will save you years of struggle, I promise. My recommendations is to get into therapy and check out this program. They will also help you to figure out the best treatment plan for you, and tailor it to meet your needs. You may not relate to every single thing from the program, but you will get some information that will help you to deal with the underlying issues. And therapy will be helpful long-term with helping you to better process and manage anxiety, rather than using potentially maladaptive coping skills. Good luck with whatever you decide!",
      "created_utc": 1607534774.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gf7r7j4",
      "author": "None",
      "body": "\nZelda_is_my_homegirl\n\nalready said \n\neverthing,\n\nthat needs\n\nto \nbe\nsaid.\n\nGood luck!",
      "created_utc": 1607552079.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gf8gwdx",
      "author": "rikiheyd",
      "body": "I work with pediatric eating disorders of alllll types. Anorexia, bulimia, ARFID, and other non specified ed. If you don’t have any weight or shape concerns, you won’t get an eating disorder dx. You may have disordered eating patters but without any of the weight shape concerns, you won’t get an Ed diagnosis. It sounds like a side struggle of your anxiety. I would suggest, as others have, to schedule an appointment with a psychiatrist and possibly a therapist to learn good coping skills to manage! Best of luck and lots of love <3",
      "created_utc": 1607565860.0,
      "score": -1,
      "context": []
    },
    {
      "id": "gf5n770",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1607510919.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gf95cy7",
      "author": "tymopa",
      "body": "I disagree with Zelda.  1. What you got was a screening that directs you to take a course of action which is to go to TEP. 2. TEP does their own diagnostic to determine if and/or what kind of care you need. 3. They have psychiatric care knowledgeable about EDs on staff. 4. They have medical doctors knowledgeable about EDs on staff. 5. They have registered dietitians knowledgeable about EDs on staff. I went to the Emily Program for their intensive outpatient. It saved and changed my life. Hit me up if you want to chat more. I think you are getting such sound advice. Also, it doesn't hurt to go get a diagnostic and hear about the recommended options.",
      "created_utc": 1607581461.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfertp8",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1607706986.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfhlgc6",
      "author": "jacksreb",
      "body": "Thank you so much for your post! I’m the OP. You’ve given me a lot of things to think about and consider.\n\nTbh I’m extremely hesitant to reach out and seek any type of help. Going to the counseling service seemed like a big step to me. This is mostly because I go through these periods of extreme stress and anxiety and can’t eat for long periods of time. But then after some due dates and things calm down for a couple of days I snap out of these moods and my eating goes back to normal. Then I feel a little crazy and like I’m already better, so what’s the point of getting help? But the last anxiety episode I had was the longest it had gone and I could tell it took a real toll on my body. At this point I’m desperate to fix this and I think going to a doctor or psychiatrist needs to be the next steps.\n\nI was able to get an appointment with a therapist very quickly. So I think just talking about it and getting another opinion will help until I’m able to go see a doctor.\n\nOnce again, thanks so much for your advice!",
      "created_utc": 1607746638.0,
      "score": 1,
      "context": [
        {
          "id": "gf5v5fo",
          "author": "Zelda_is_my_homegirl",
          "body": "TL;DR : Go to the doctor. \n\nSee a medical doctor and/or psychiatrist. A school counselor is not qualified to diagnose an eating disorder. Stress is only one of many medical conditions that could cause loss of appetite. You could certainly contact the eating disorder folks who could likely screen you, but I would get checked out for loss of appetite by a doctor first to rule out other conditions. \n\nTypically, traditional eating disorders are a mental health issue and would involve intentionally restricting, binging, purging or other disordered behaviors, rather than simply not feeling hungry. Now, if you’re toying with enjoying that feeling of emptiness or not wanting it to end, I would say you’d be catching a problem pretty early. \n\nI lost my appetite due to stress about a year ago. I was thrilled though, because I’ve always been overweight and had already severely restricted calories off and on for about 15 years to try and lose weight. After about 2.5 months on 200-600 calories per day, I had lost ~40lbs and my gallbladder was failing. I felt the worst I’ve literally felt in my life. I wanted to feel hungry but couldn’t and everything made me nauseous as soon as I tried to eat. So I didn’t. I put off medical care for the nausea for weeks, because despite how terrible it was I was so happy about not being able to eat. I liked that it forced me to starve with the level of commitment I’ve always wished for. \n\nAre you hesitant to seek medical care for stress or loss of appetite? Do you inwardly enjoy the weight loss or appetite changes? \nI would say to sit with those questions, but absolutely still see a doctor first and foremost.",
          "created_utc": 1607518239.0
        }
      ]
    },
    {
      "id": "gfiinxz",
      "author": "Zelda_is_my_homegirl",
      "body": "Honestly it sounds like a really similar situation to where I was at mentally. This may not be you, but right around when I was dealing with the same stress related food issues, I was diagnosed bipolar. All my life I thought I had “depression and anxiety” when really I was having issues regulating my moods. Antidepressants and anxiety meds didn’t work for me and I thought they were bs. Then I went to a psychiatrist instead of a doctor and she immediately put me on mood stabilizers (lamictal). I still have episodes, but it’s much milder and the swings are less dramatic. \n\nSome telltale symptoms are mood swings, impulsivity that may cause harmful decisions (financial, sexual, relationships, etc- I shop when I don’t have money for example) and staying up for long stints without feeling tired. I’m in a manic episode rn and I’ve slept about 5 hours total in the last 4-5 days. \n\nAnyway I’m rambling. Check to see if your university has psychiatric services available, sometimes teaching hospitals will offer free or very cheap options. And good job. If this feels like a big step, then seeking help is definitely the right decision and therapy is a good idea for literally everyone. Good luck on your journey and feel free to pm if you have any other questions about my own experience.",
      "created_utc": 1607774594.0,
      "score": 1,
      "context": [
        {
          "id": "gf5v5fo",
          "author": "Zelda_is_my_homegirl",
          "body": "TL;DR : Go to the doctor. \n\nSee a medical doctor and/or psychiatrist. A school counselor is not qualified to diagnose an eating disorder. Stress is only one of many medical conditions that could cause loss of appetite. You could certainly contact the eating disorder folks who could likely screen you, but I would get checked out for loss of appetite by a doctor first to rule out other conditions. \n\nTypically, traditional eating disorders are a mental health issue and would involve intentionally restricting, binging, purging or other disordered behaviors, rather than simply not feeling hungry. Now, if you’re toying with enjoying that feeling of emptiness or not wanting it to end, I would say you’d be catching a problem pretty early. \n\nI lost my appetite due to stress about a year ago. I was thrilled though, because I’ve always been overweight and had already severely restricted calories off and on for about 15 years to try and lose weight. After about 2.5 months on 200-600 calories per day, I had lost ~40lbs and my gallbladder was failing. I felt the worst I’ve literally felt in my life. I wanted to feel hungry but couldn’t and everything made me nauseous as soon as I tried to eat. So I didn’t. I put off medical care for the nausea for weeks, because despite how terrible it was I was so happy about not being able to eat. I liked that it forced me to starve with the level of commitment I’ve always wished for. \n\nAre you hesitant to seek medical care for stress or loss of appetite? Do you inwardly enjoy the weight loss or appetite changes? \nI would say to sit with those questions, but absolutely still see a doctor first and foremost.",
          "created_utc": 1607518239.0
        },
        {
          "id": "gfhlgc6",
          "author": "jacksreb",
          "body": "Thank you so much for your post! I’m the OP. You’ve given me a lot of things to think about and consider.\n\nTbh I’m extremely hesitant to reach out and seek any type of help. Going to the counseling service seemed like a big step to me. This is mostly because I go through these periods of extreme stress and anxiety and can’t eat for long periods of time. But then after some due dates and things calm down for a couple of days I snap out of these moods and my eating goes back to normal. Then I feel a little crazy and like I’m already better, so what’s the point of getting help? But the last anxiety episode I had was the longest it had gone and I could tell it took a real toll on my body. At this point I’m desperate to fix this and I think going to a doctor or psychiatrist needs to be the next steps.\n\nI was able to get an appointment with a therapist very quickly. So I think just talking about it and getting another opinion will help until I’m able to go see a doctor.\n\nOnce again, thanks so much for your advice!",
          "created_utc": 1607746638.0
        }
      ]
    }
  ]
}