{
  "id": "kad1jr",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1607596010.0,
  "title": "Request: My parents don’t understand my binge eating.",
  "selftext": "My parents did a lot to try and help me but it wasn’t doing much so after awhile I asked to see a psychiatrist. It’s been less than a week since I’ve met with my psychiatrist and my parents got mad at me because I wasn’t improving even after everything they’ve done. I told them I was trying  but they said I wasn’t trying hard enough, I wasn’t following the psychiatrist’s advice, I kept skipping dinner, etc. For the past 3 days I’ve been exercising for hours trying to burn off the calories I consumed from a binge just so I they’d see me eat dinner. I feel like my binges have gotten much worse since now I know I’m capable of burning a lot of calories if I exercise multiple times throughout the day. The problem is that sometimes, like right now, my body just can’t take any more and I fall short on the calories burned. I only have 2 hours left until dinner and a lot more calories to burn but I’m too tired to carry on.\n\nI don’t know what to tell my parents. I feel like such a burden to them.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kad1jr/request_my_parents_dont_understand_my_binge_eating/",
  "score": 40,
  "num_comments": 6,
  "comments": [
    {
      "id": "gf9urfc",
      "author": "None",
      "body": "hey, i’m not an expert but i think that you have bulimia, over exercising after a binge is a form of purging. maybe you can say them this so they take you more seriously ?",
      "created_utc": 1607605699.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gfb235c",
      "author": "LilBpixi3",
      "body": "Maybe have your parents come with you to your psychiatrist one time so they can understand how serious this is and that it will take at least a year before you're fully recovered and have a healthy relationship with food.",
      "created_utc": 1607624306.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gfbarm4",
      "author": "hannacken",
      "body": "my parents were unsupportive and not understanding at the beginning of my recovery. however, i asked them to do research to understand what actually goes on in our heads and how hard recovery is and that made them understand a bit more. believe me when i say i recognize this and my heart hurts for you. you deserve to be taken seriously, but i will remind you that no matter how much or little they can see your small wins, i am so proud of you. any progress, big or small, is so good!! the small wins will turn into bigger ones in the future, i promise that it will get easier with time. but it does really take time, unfortunately. there is no quick fix which sucks, but man how much you will learn and grow during the process. \n\nand also, the binging might be a response to restriction or overexercise. i hope that you will find peace within yourself and know that your body will heal if you hold on. take one meal at a time, and try allowing yourself to rest. binging and compensating is a living hell, but as someone who has been there and is now almost fully recovered i can assure you that recovery is possible. it won’t always be this way <3 i wish you love and luck. i believe in you!!",
      "created_utc": 1607628455.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gfc5900",
      "author": "None",
      "body": "I understand you, sending you visual hugs",
      "created_utc": 1607645305.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gfdei7m",
      "author": "tymopa",
      "body": "Maybe you could read over this and see if it might be a helpful tool to share with your mother mom. I feel for you.",
      "created_utc": 1607672259.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gf9kcfx",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1607596010.0,
      "score": 1,
      "context": []
    }
  ]
}