{
  "id": "kb0kc2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1607683688.0,
  "title": "Request: My family often jokes about me eating a lot",
  "selftext": "I’m a 17 year old female and my family jokes about me eating a lot. I have started to not eat as much and I’m worried that I’ll start not eating at all. My sister even went through the same thing but she’s joining in on the jokes too. Every Wednesday my sister and I order food for lunch and on Tuesday night she asked me what I wanted to get, and I told her. I was smiling cause I asked to get food from one of my favorite restaurants, but then my mom said “oh Megan always smiles when it comes to food”. Should I feel bad about what they’re saying or am I just being sensitive?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kb0kc2/request_my_family_often_jokes_about_me_eating_a/",
  "score": 76,
  "num_comments": 12,
  "comments": [
    {
      "id": "gfdv7bj",
      "author": "None",
      "body": "I’ve found it really empowering to throw a comment back at my parents. In your situation, I’d say something like, “Well, you can imagine how excited I am to eat some decent food this week.” Or, you can take the explain it to me route and ask her what she means and keep asking questions until her joke clearly isn’t funny to anyone anymore.\n\nBy staying silent, we let them think what they say is okay. It’s not okay and I’m sorry you have to deal with that.",
      "created_utc": 1607688787.0,
      "score": 53,
      "context": []
    },
    {
      "id": "gfdq73w",
      "author": "Deep-Dig-9345",
      "body": "Omg same my mom always talk that sort of shit to me. I know it's difficult but try not giving a fuck. Like every body is different every body has different needs. And like you're a teenager still growing and developing so it's normal for u to feel hungrier than others totally NORMAL.",
      "created_utc": 1607683932.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gfecv1t",
      "author": "lthedp",
      "body": "I feel the same way. My mom has been commenting about my eating habits since I was young and even now that I lost a lot of weight she still pesters me and tells me I eat too much when I’m barely eating anything anymore. It’s kinda tiring and even if I tell her to stop she will for only a few days and start again.",
      "created_utc": 1607700150.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gfdzq1w",
      "author": "None",
      "body": "Same. My family always joked about me eating a lot as a kid and they are still joking. I feel bad and guilty every time I heard that:(.",
      "created_utc": 1607692353.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gfg21k4",
      "author": "o_elaine_g",
      "body": "it’s comments like these that led to my spiral in my ed. you need to say something about whether it be in a casual or serious manner. this is unhealthy behaviors on their part and you should not feel bad at all. food is nourishment and it’s good for you, you deserve to eat whenever you want to without the pressure of what others might say",
      "created_utc": 1607721951.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gffvz0a",
      "author": "tomhall44",
      "body": "Go full on fight mode and answer each of them back every time they make a comment. Prepare a list of comebacks in your head. You have to nip this toxic family behavior in bud. Best wishes!",
      "created_utc": 1607719699.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gfhp36q",
      "author": "sashavlr",
      "body": "You’re not being sensitive and it’s never okay to body shame. FUCK THAT. I agree with others and throw back-handed compliments back at them. Always listen to YOUR body. If you see your doctor and she tells you that you’re healthy, then continue doing what you’re doing! Don’t let family or friends or whoever get to you! I know 17 is a tough age and we take everything too personal but in a few years this won’t matter. Remember you are beautiful and loved! Sending light and love ❤️",
      "created_utc": 1607749120.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gfg6j9e",
      "author": "edie43",
      "body": "This is the main reason why I have an ED today. Don’t let them shame you into eating less. If you love food, it’s just going to make eating a compulsive thing and you might end up restricting and binging and your weight will fluctuate.",
      "created_utc": 1607724241.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfdpyoa",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1607683688.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfhercl",
      "author": "ooooooooooppppppppp",
      "body": "MY FAMILY DOES THIS TO MY LITTLE BROTHER AND ITS STUPID",
      "created_utc": 1607742504.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfhl0yd",
      "author": "None",
      "body": "There’s absolutely nothing wrong with enjoying food and looking forward to good food. And your family should enjoy seeing you excited and happy rather than berate you for it. You are a teenager it’s normal to have a larger appetite; I know I did in my teen years.",
      "created_utc": 1607746364.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfhmrc9",
      "author": "MoosieGoose",
      "body": "The \"I don't understand?\" or \"Could you explain that to me?\" is a game changer.\n\nUsually people know they are being hurtful with these comments. Forcing them to face the things they said to you is helpful for you & them.",
      "created_utc": 1607747504.0,
      "score": 12,
      "context": [
        {
          "id": "gfdv7bj",
          "author": "None",
          "body": "I’ve found it really empowering to throw a comment back at my parents. In your situation, I’d say something like, “Well, you can imagine how excited I am to eat some decent food this week.” Or, you can take the explain it to me route and ask her what she means and keep asking questions until her joke clearly isn’t funny to anyone anymore.\n\nBy staying silent, we let them think what they say is okay. It’s not okay and I’m sorry you have to deal with that.",
          "created_utc": 1607688787.0
        }
      ]
    }
  ]
}