{
  "id": "kbnqhb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1607772916.0,
  "title": "Request: Why is it literally impossible for me to stop binge eating",
  "selftext": " \n\nI don’t binge everyday but one day I just say fuck it and eat very bad. So I don’t keep anything sugary or unhealthy in large quantities. I still binge on some of my foods but it’s not as bad. Recently I got a carton of one of my favorite candies. I thought I had more control over my binging but I’ve almost the whole cart. I feel so sick. My tongue and mouth hurts from the sugar. I literally shiver at the thought of eating more yet I can’t stop my body. Like no matter how disgusted I am. How much I don’t want to eat it I end up eating it all. Why do I do this. It literally feels like I’m a drug addict from how sick I get and yet I continue eating.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kbnqhb/request_why_is_it_literally_impossible_for_me_to/",
  "score": 92,
  "num_comments": 14,
  "comments": [
    {
      "id": "gfiy97e",
      "author": "needsvyvanse-",
      "body": "So this isn’t the case for everyone, but I had very bad uncontrolled ADHD which is linked to binge eating. So for me, once I started treating my ADHD my binge eating disappeared. I understand how you feel completely. I thought I’d binge eat for the rest of my life! And go on these ups and downs, I was binging almost everyday especially after work and when I explained this to my doctor he explained the link between ADHD and binge eating. I thought it was because I was bulimic as a teen but that was also Lin linked to my ADHD I guess. I think seeing a doctor or therapist who specializes in eating disorders or binge eating specifically may benefit you. There’s a reason behind binge eating and once you crack that code you can free yourself.",
      "created_utc": 1607781313.0,
      "score": 26,
      "context": []
    },
    {
      "id": "gfjb8qk",
      "author": "Vessecora",
      "body": "I suggest looking into how moralising food relates to the restriction-binge cycle.",
      "created_utc": 1607785996.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gfiu2bs",
      "author": "macladybulldog",
      "body": "I’ve been there. Some days, I’m still there. The comparison to being a drug addict is real and hits me right in the feels. I’ve felt myself having a meltdown if I try to stop in the middle of a binge, especially if I thought that I had been doing really well about self-control in the previous days to weeks. That reliance on self-control actually makes my binging so much worse. There are both physiological and psychological reasons for this, but it does make you feel so out of control. You’re not alone. My doctor recommended a book for me called “Eating in the Light of the Moon.” It helps to dig into why our relationship with food is not the healthiest. I’m finding it super helpful, and you might too.",
      "created_utc": 1607779550.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gfkykck",
      "author": "Maggiemaccy",
      "body": "Do you still try to diet? If yes then that’s why. \nBinge eating is part of a cycle, this cycle relies on restriction. I had to stop dieting or trying to correct my binge eating with eating healthy. You feel like you’re helping or getting better but you’re really just playing a game of ‘how long can I go this time’.\n\n5 years ago I couldn’t keep food in my house at all. I’d eat until I physically hurt myself. I HAD to resolve that I was going to end restriction in my eating habits, I had to abandon the idea that doing better meant eating healthy or clean. I had to let the binge eating play out and eat whatever I wanted in between times. Yes I gained weight initially, a lot of it and fast. But it changed my life. About a year after I took this step I was back to a healthy weight and I could trust myself around food. I eat whatever I want but I never have to overeat because restriction is never around the corner. If I eat a reasonable amount now and want more later that’s fine. I’m not giving myself limited permission anymore where it’s like ‘okay I can eat this now but afterwards I’m back on plan’ that causes you to eat the whole cake or abuse what was supposed to be a ‘cheat day’ your brain knows that you have intentions to deprive yourself soon and it’s hard wired in that situation to stock pile.",
      "created_utc": 1607805545.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gflg92y",
      "author": "momunist",
      "body": "I would really suggest looking into intuitive eating. It sounds counterintuitive, but the more guilty you feel for bingeing, the more likely it is to keep happening. You basically have to accept however your body wants to eat for it to even out.",
      "created_utc": 1607811353.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gfmzxub",
      "author": "Garbage_Patch_Kid",
      "body": "It’s because of restriction. Restricting food and groups of food causes you to feel out of control around it and ends in a binge. Make sure you’re eating enough throughout the day. And I would recommend looking into intuitive eating and the f*ck it diet, I have a hard time reading whole books but listening to podcasts has been really helpful for me! And therapy if you can. \n\nAnd above all, be gentle with yourself. Your body needs food, it’s okay to eat, even a lot. And it’s okay to eat foods that you enjoy eating. Drink some water and do something that makes you feel nice and be gentle with yourself.",
      "created_utc": 1607831857.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfl03kl",
      "author": "None",
      "body": "I was a binge eater. The episodes came and go depending on circumstances. A couple of years ago when I realized I was binging, I started seeing a therapist. The only decent suggestion she had was to keep a food journal. But I’m not much of a tracker so it didn’t last long.\n\nI was on Sertraline for the whole summer and spring, and sertraline increased my appetite to an insatiable level. I could finished 3/4 of a cookie butter jar in a day. My teeth hurt from the sugar but I wouldn’t stop eating. I would change into something salty. Like cheese puffs and go back and forth between sweet and salty. Let alone how the terrible food was making my natural body odor repulsive to myself. One thing that triggered me was seeing thin women whether outside or in movies/series.\nOne thing that I felt was helpful was getting sugar from fruits. I would eat plenty of tangerines early in the morning. That would curb my cravings for a few hours. Also looking at my cart while grocery shopping made me realize I was probably eating 1500 extra unnecessary calories.\nSo I became officially overweight :( so overweight that red stretch marks covers my entire inner thighs and then my hips. I need to lose 6 kilos just to have a maxed out BMI. Seeing 70kg on the scale when you’re only 157cm is quite depressing considering how hard I tried to avoid getting this big and I was considered hot just a year before. None of my pants fit anymore ( thanks god for skirts and stretchy pants). The only thing that helped me  was changing medication. I can finally stop myself when I’m not even full yet. That never happened before until a few days ago. Being on Bupropion and Tianeptine was the only thing that helped me.\nIf you’re on some medication, talk to your doctor and look up other people experiences. If not, you should just look for the source of your triggers. \n\nP.S. recently, I realized popcorns are pretty good to stop me from eating anything else. Even though I like to add caramel sauce to them, they’re are pretty good for someone like me that doesn’t have enough fibers in her diet. Drinking water next to eat is a bonus for a faster BM🙈",
      "created_utc": 1607806065.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gfigev4",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1607772916.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfuj7us",
      "author": "Coeurahge",
      "body": "You're not alone. I struggle with my eating less now, but I still struggle. And I've been in support groups, and heard recordings of support groups, where people talk about doing everything under the sun with food. I know from experience how terrible it feels to lose control, but really, no matter what you do or have done, someone else has been there too. I don't know if this will help but thought it could.\n\nPeople have so many reasons for bingeing, and so few, in a way. For me it _is_ like a drug, but I don't think it's that way for everyone. The other posts have covered some likely reasons. I think it's usually the best solution the person believes they have to whatever challenge they are facing at the time. It may feel ungraceful or illogical, but it's completely human.",
      "created_utc": 1607977829.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gg2t3ak",
      "author": "45meatballs",
      "body": "I don't personally binge, but i heard that when your consistently starve yourself, your body basically freaks out and starts to think you're in a famine and that you need to eat EVERYTHING so you don't starve. Hope this helps.",
      "created_utc": 1608156995.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gflfz3y",
      "author": "momunist",
      "body": "This.",
      "created_utc": 1607811260.0,
      "score": 1,
      "context": [
        {
          "id": "gfjb8qk",
          "author": "Vessecora",
          "body": "I suggest looking into how moralising food relates to the restriction-binge cycle.",
          "created_utc": 1607785996.0
        }
      ]
    },
    {
      "id": "gfm6xjj",
      "author": "mimi9875",
      "body": "I second this.",
      "created_utc": 1607819395.0,
      "score": 1,
      "context": [
        {
          "id": "gfjb8qk",
          "author": "Vessecora",
          "body": "I suggest looking into how moralising food relates to the restriction-binge cycle.",
          "created_utc": 1607785996.0
        }
      ]
    },
    {
      "id": "gfmuxdg",
      "author": "SicilianWoman",
      "body": "What do you mean by \"moralising food\"?",
      "created_utc": 1607829168.0,
      "score": 1,
      "context": [
        {
          "id": "gfjb8qk",
          "author": "Vessecora",
          "body": "I suggest looking into how moralising food relates to the restriction-binge cycle.",
          "created_utc": 1607785996.0
        }
      ]
    },
    {
      "id": "gfmvtec",
      "author": "Vessecora",
      "body": "The binary categories of good vs bad food. Avoiding food that is believed to be \"bad\" is the same as restricting through diets.",
      "created_utc": 1607829623.0,
      "score": 6,
      "context": [
        {
          "id": "gfjb8qk",
          "author": "Vessecora",
          "body": "I suggest looking into how moralising food relates to the restriction-binge cycle.",
          "created_utc": 1607785996.0
        },
        {
          "id": "gfmuxdg",
          "author": "SicilianWoman",
          "body": "What do you mean by \"moralising food\"?",
          "created_utc": 1607829168.0
        }
      ]
    }
  ]
}