{
  "id": "kcvqg0",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1607944313.0,
  "title": "Request: took a step today",
  "selftext": "I made biscuits and gravy from scratch for the first time today and ate  at least \"my fill\" I'm about to cry because of it, it's not much to many  but to the ones who understand it's everything. I enjoyed the food but  it took me over 3 hours to eat the whole plate, but a steps a step  right?  Also thank you to everyone in this group. I felt like a fucking  piece of shit for saying what's going on and was met with nothing but  kindness. Where I live the only eating disorder people have is eating to  much. I'm one of the few males (20) around here, and honestly the more I  think about I feel like I'm not, that can't put on weight. When I was  little everyone made jokes about me eating slow and it turned out my jaw  is as fucked as a stock dodge and that's why it hurts to eat. And then  came the ridicule for eating slow and being small in a large family.  It's worse than being big in a small family IMO. Not that that isn't,  but people at least try to be polite when they said someone was getting a  little too big. Every single member of my family joked and laughed  about my size. Even the \"normally built\" found it \"funny and harmless\"  but it has fucked me up so much. The only person who has said \"dude  that's extremely fucked\" is my stepdad who never saw any of it. I'm  getting better and I'm crying right now. Sorry this turned into a rant  but I've been drinking with this meal but hey 3 hours is 3 hours lol.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kcvqg0/request_took_a_step_today/",
  "score": 91,
  "num_comments": 4,
  "comments": [
    {
      "id": "gfsviap",
      "author": "iamindanger",
      "body": "I am so proud of you! I know it takes a lot to be able to function in such family where people think it's okay to shame others based on their weight. You are doing great and I hope it gets better in the future.",
      "created_utc": 1607944630.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gftgbq3",
      "author": "hellac0pter",
      "body": "Huge congrats for taking that first step!! You're absolutely right - progress is progress! You're also so right that people think it's much more harmless to make jokes about people being small than about people being large. If you ever need someone to talk to, please feel free to DM me!",
      "created_utc": 1607959092.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gfuy8d6",
      "author": "None",
      "body": "Congratulations on your success! I really hope you can find more successes like this in the future and keep that positive spiral going!",
      "created_utc": 1607985100.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gfsv7fb",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1607944313.0,
      "score": 1,
      "context": []
    }
  ]
}