{
  "id": "kdjols",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1608029809.0,
  "title": "Request: What's a good way to stop using starvation as a punishment?",
  "selftext": "When I'm stressed with schoolwork or with a personal project, I force myself to starve in order to finish what I've been working on, sort of like a punishment for not having it complete. Let's say I have an assignment due soon or I just want to finish it that day, I tell myself not to eat until I finish it. Sometimes I'll go a whole day without eating. I'm so focused on what I'm doing, I learn to ignore the hunger. This conditioned me to stop recognizing when I'm actually hungry AND I WANT TO STOP. I'm tired of doing this to myself. I started eating very little and I recognize that I eat small amounts, I just can't stop it. I don't know where I could start.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kdjols/request_whats_a_good_way_to_stop_using_starvation/",
  "score": 73,
  "num_comments": 7,
  "comments": [
    {
      "id": "gfylflu",
      "author": "LearnedLemming",
      "body": "I'm certainly no expert on this, so don't take my word for it, but I think you have a thought distortion here. Not eating, in this case, is punishment for not getting work done/being unproductive. However, to function optimally, the brain needs glucose and a lot of it.\n\nBy not eating you are in effect stifling your productivity making it harder to complete your tasks and exacerbating the problem. This has the potential to become a cyclical issue. Worried about tasks >not eating as punishment > brain getting foggy > productivity reduced > worry more > eat less and so on.\n\nAs others have suggest, an eating schedule would maybe be helpful. In addition, make these breaks proper breaks, of at least 30mins, in which you try to forget about the work for that time. Recharging regularly will ultimately increase productivity.  \n\nLastly, some reading on self compassion theory may also be useful in overcoming the urge to self-punish.",
      "created_utc": 1608065498.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gfwx8yw",
      "author": "mixedmediamadness",
      "body": "Have you tried eating on a schedule? Setting an alarm for when you should eat something? It seems like the inverse of this is that you're holding food as a reward, something you can only get when you are finished with what you're doing. Take that away. Feed yourself throughout. My therapist told me to try to eat every 4 hours, and following that instruction helped me feel like I was in control of my eating in a healthier way.",
      "created_utc": 1608034001.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gfy4c14",
      "author": "ImaginaryGolden",
      "body": "Completely relatable.",
      "created_utc": 1608057841.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gfywv0s",
      "author": "cece_IVXX",
      "body": "so i started finding a few foods that made me want to stop working. there’s a basis to focus on here of “me and my health are more important than this work. and this food, wow i want this food, and i need this food to keep going !”\n\ni also try to switch the “shame’s” pointy lil finger away from me not eating so i can finish work, and redirect the shame to “you know how sick u feel when u don’t eat, please go eat”. eventually i started just getting excited to take a break i knew i deserved and ate food that made me feel excited. whatever that food is !\n\ni also agree with eating on a schedule, or at least checking in with yourself that way. it’s hard in a pandemic to eat like we used to if we aren’t using it like we used to. so just literally give ur body the mega phone at those times, and try to keep work/school from coming before food. \n\ni try to remember, this homework isn’t what my body needs to survive, that sandwich is ! and that changed the game for me. i’m no expert but just try to give urself things to look forward to that make breaking a cycle rewarding for more than just “okay i ate!”\n\nbest of luck to you during this hard time ! YOU GOT THIS ! ✨✨✨",
      "created_utc": 1608070929.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gfwt0x2",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1608029810.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gfwztmz",
      "author": "HoneyAndSht",
      "body": "Punishment: rubber band technique.",
      "created_utc": 1608036222.0,
      "score": -1,
      "context": []
    },
    {
      "id": "gg0mjwp",
      "author": "Ari3n3tt3",
      "body": "If you're using this to keep yourself on task then I feel like you might light to try to replace it with something else.. something healthier like not doing a hobby you like until its done or perhaps you could switch it up and replace the punishment with a reward at the end\n\n&#x200B;\n\nCan you snack while you work on these projects/schoolwork? If you've trained yourself in a way that you're relating working on a project with not eating you could help your body get those hunger cues back by forcing it a little at the beginning",
      "created_utc": 1608111338.0,
      "score": 1,
      "context": []
    }
  ]
}