{
  "id": "kfwchg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1608334030.0,
  "title": "Request: I’m really struggling I’ve tried getting help, I need advice on what to do",
  "selftext": "I’m 17 M, I’ve been really struggling with restrictive eating lately, I’ve been diagnosed with an Ed, but I’ve never been able to get actual treatment, I kept getting blown off my my local clinic when I requested outpatient instead of partial because I know that’d be better than me. And they gave me no resources then and I haven’t been back. It’s gotten pretty bad in the past month, I don’t know what to do, my mental health is also really bad. Idk if I should do inpatient, or is there anything I can do in the moment to encourage myself to eat like anything.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kfwchg/request_im_really_struggling_ive_tried_getting/",
  "score": 40,
  "num_comments": 3,
  "comments": [
    {
      "id": "ggbgrxz",
      "author": "sarathedime",
      "body": "I’m not sure where you live but definitely look into an ED therapist. They can refer you to a good treatment program that they trust:)",
      "created_utc": 1608342499.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ggcfd9x",
      "author": "tymopa",
      "body": "If you have the means I would get the most intensive option they suggest. This will allow you to really focus on giving yourself time to heal in a really deep way. The earlier you start the better opportunities you have to not let this take you down. I started at 15 and finally got help at 46. By that time things were unbearable. I wasted decades thinking I could do it on my own. Your investment in your healing is the best one you can make. Best of luck to you. This is such a beast but it is SO liberating when you get it behind you.",
      "created_utc": 1608368378.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggb23r8",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1608334030.0,
      "score": 1,
      "context": []
    }
  ]
}