{
  "id": "kgfcsj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1608408878.0,
  "title": "Request: I don’t look “sick” so no one will take me seriously. How do I stop feeling like an imposter? How/where do I get help?",
  "selftext": "I recently saw a post on social media describing what it was like (for that person) to have ARFID. Their description sounded similar to my life so I went on Google and did some research on that as well as selective eating disorder. It sounds fucked up but when I learned about selective eating disorder I felt relieved and happy because I have always just been ashamed of my very severely “picky” eating habits. I finally felt heard and hopeful that maybe I can eventually become a normal eater.\n\nI told my doctor hey I think I have this, so can you refer me to somewhere that will officially diagnose me and then help me with the treatment plan? And she looked at me like I was insane. To her credit, she simply asked why I thought I had it and then said she would have her assistant find somewhere for me... but she still gave me a look like why are you making this up, you’ve never said anything about this before and your weight and everything is normal.\n\nFast forward a few weeks and the assistant sends me the numbers to a couple general therapy places. Even though I don’t want that, I gave them a call and they said they didn’t have openings for months into next year. Fine. I get back to her and ask if I can do an outpatient program somewhere because I don’t think therapy will help as much as having someone qualified with eating disorders making a plan and working with me. No response for several weeks now.\n\n(INFO: yes I could do research and find somewhere on my own but it is such a hassle to find places your insurance will accept. I thought it would be easier for the doctors office to do it since they probably have a list of places like that just in case any patient needs to go, and they already have my insurance information so they could just shoot me a list of places they recommended that take my insurance. Apparently that’s a no go though)\n\nSo what should I do? I felt so good when I first found out that I’m not just crazy and weird, it’s an actual condition, but I am at a loss here because no one seems to be taking me seriously.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kgfcsj/request_i_dont_look_sick_so_no_one_will_take_me/",
  "score": 65,
  "num_comments": 12,
  "comments": [
    {
      "id": "gger20j",
      "author": "thanksfortalking",
      "body": "Sounds like you deserve a better doctor. Would you be willing to ask a different doctor? I know it can be hard though when you already mustered up your courage and got let down.",
      "created_utc": 1608416890.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ggelpmg",
      "author": "jjrosey",
      "body": "Call again. Pester her. Call her out for her extreme unprofessionalism. You are doing your part and possibly the hardest part is taking these first steps. Make her do her part as your doctor. If she really cares about bettering patients like we expect from doctors then bringing to light all the ways she has let you down should help. If you were underweight she would have already sent you a list of places and probably even checked up to see that you had contacted them and were being treated. This is unacceptable.",
      "created_utc": 1608414797.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ggf627l",
      "author": "madamelex",
      "body": "I would say you need to see a counsellor or psychiatrist , not a medical doctor. Call your local offices and check who accepts your insurance.  The medical doctor wouldn’t be helping you because this is more of a mental health problem than a physiological issue.",
      "created_utc": 1608422898.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gghypcn",
      "author": "batapult",
      "body": "I’m a nurse with an ED, from my personal experience working with docs and as a patient, here’s a take: the best you are gonna get from a doctor who isn’t in mental health is addressing any medical issues related to the ED if you have them and referral for therapy. And even many docs don’t clear that bar.\n\nThey see their job as addressing medical issues, and if you aren’t underweight by the BMI, have no conditions caused by restricting or purging, they just don’t see how they can help other than giving a referral or giving tips to find a therapist/dietitian. Many are also not very knowledgeable about EDs, so they stick to diagnostic criteria which are medical and not psychological, unfortunately. To them EDs are a medical issue AND a psychological issue and if there is nothing to do medically they need to refer you to someone who can help with the psych aspects. \n\nYour doc wasn’t very sensitive, but most MDs don’t have connections to or knowledge of ED treatment centers and specialists. The fact that they referred you to someone at all is better than most. You do have to do to your own research, but attending a group therapy meeting/support group in your area can help you get suggestions for specialists.",
      "created_utc": 1608486210.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gggfmyj",
      "author": "Trippy_trip27",
      "body": "well are you feeling bad at all? This is a job for a psychiatrist if there are no medical issues. I don't get why you're trying to get help at a treatment center, you're not going to follow diets and you don't sound like you need medical help. There's people 2 steps away from death who aren't being taken seriously, don't expect much.",
      "created_utc": 1608453791.0,
      "score": -1,
      "context": []
    },
    {
      "id": "gge8gpj",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1608408878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh9h0xz",
      "author": "RoutineRabbit500",
      "body": "I’m sorry your doctor was so dismissive, this sounds incredibly frustrating. One thing I only recently found out was an option is that if you call your health insurance carrier and tell them what kind of treatment you’re looking for, they can give you a list of facilities or mental health professionals to call that will take your insurance. I’d been spending hours calling offices and asking them about whether they take my insurance, and I was able to cut that down to about 20 minutes by calling my insurance carrier.\n\nI’m wishing you the best! Take care of yourself.",
      "created_utc": 1609132901.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggfdvcp",
      "author": "cetaceansituation",
      "body": "I do agree that a mental health professional is much better for referrals in this area. When you have a treatment team (which you deserve), you'll find that among them there will only be one medical doctor and/or nurse that you see whose really only purpose to to make sure you maintain medical stability throughout your treatment. In my experience, medical doctors are much more clueless in general about eating disorders than mental health professionals are.",
      "created_utc": 1608426895.0,
      "score": 3,
      "context": [
        {
          "id": "ggf627l",
          "author": "madamelex",
          "body": "I would say you need to see a counsellor or psychiatrist , not a medical doctor. Call your local offices and check who accepts your insurance.  The medical doctor wouldn’t be helping you because this is more of a mental health problem than a physiological issue.",
          "created_utc": 1608422898.0
        }
      ]
    },
    {
      "id": "gggliec",
      "author": "Zelda_is_my_homegirl",
      "body": "What a shitty response to someone who is already feeling invalidated about their eating disorder. \n\nEveryone should have their medical concerns taken seriously regardless of how many steps away from death they might be.",
      "created_utc": 1608460298.0,
      "score": 2,
      "context": [
        {
          "id": "gggfmyj",
          "author": "Trippy_trip27",
          "body": "well are you feeling bad at all? This is a job for a psychiatrist if there are no medical issues. I don't get why you're trying to get help at a treatment center, you're not going to follow diets and you don't sound like you need medical help. There's people 2 steps away from death who aren't being taken seriously, don't expect much.",
          "created_utc": 1608453791.0
        }
      ]
    },
    {
      "id": "ggfexi9",
      "author": "madamelex",
      "body": "Yes, agreed. Your medical doctors part in it would just be ensuring your physical health isn’t in danger and refilling prescriptions if so prescribed by whatever professional you seek. A mental health professional will be able to help. If your have a mobile app for your health insurance you may even be able to find a list of places you can go on there.",
      "created_utc": 1608427504.0,
      "score": 1,
      "context": [
        {
          "id": "ggf627l",
          "author": "madamelex",
          "body": "I would say you need to see a counsellor or psychiatrist , not a medical doctor. Call your local offices and check who accepts your insurance.  The medical doctor wouldn’t be helping you because this is more of a mental health problem than a physiological issue.",
          "created_utc": 1608422898.0
        },
        {
          "id": "ggfdvcp",
          "author": "cetaceansituation",
          "body": "I do agree that a mental health professional is much better for referrals in this area. When you have a treatment team (which you deserve), you'll find that among them there will only be one medical doctor and/or nurse that you see whose really only purpose to to make sure you maintain medical stability throughout your treatment. In my experience, medical doctors are much more clueless in general about eating disorders than mental health professionals are.",
          "created_utc": 1608426895.0
        }
      ]
    },
    {
      "id": "gggmyex",
      "author": "Trippy_trip27",
      "body": "Should is the right word. Doesn't happen much in real life. I want to apologise to op for commenting in this way, being harsh is not a good way to make someone reconsider their intentions. Even though my belief is that a treatment center would be a financial burden for op with little gain",
      "created_utc": 1608461930.0,
      "score": 2,
      "context": [
        {
          "id": "gggfmyj",
          "author": "Trippy_trip27",
          "body": "well are you feeling bad at all? This is a job for a psychiatrist if there are no medical issues. I don't get why you're trying to get help at a treatment center, you're not going to follow diets and you don't sound like you need medical help. There's people 2 steps away from death who aren't being taken seriously, don't expect much.",
          "created_utc": 1608453791.0
        },
        {
          "id": "gggliec",
          "author": "Zelda_is_my_homegirl",
          "body": "What a shitty response to someone who is already feeling invalidated about their eating disorder. \n\nEveryone should have their medical concerns taken seriously regardless of how many steps away from death they might be.",
          "created_utc": 1608460298.0
        }
      ]
    },
    {
      "id": "ggj2bsk",
      "author": "Zelda_is_my_homegirl",
      "body": "All kinds of treatment centers exist. I pay about $280/ month for treatment which includes my therapist, dietician, and overseeing physician. \n\nYou also don’t know how affected someone truly is. My BMI is in the overweight category and I lost my gallbladder because of starving myself last year. I read another story on Reddit where a woman about the same weight as me restricted on and off for less than a year and now has left ventricle failure. You never know how serious someone’s condition is, and if they are seeking treatment, no one here should discourage that. As you said, it’s already difficult for people to receive the care they need.",
      "created_utc": 1608505844.0,
      "score": 2,
      "context": [
        {
          "id": "gggfmyj",
          "author": "Trippy_trip27",
          "body": "well are you feeling bad at all? This is a job for a psychiatrist if there are no medical issues. I don't get why you're trying to get help at a treatment center, you're not going to follow diets and you don't sound like you need medical help. There's people 2 steps away from death who aren't being taken seriously, don't expect much.",
          "created_utc": 1608453791.0
        },
        {
          "id": "gggliec",
          "author": "Zelda_is_my_homegirl",
          "body": "What a shitty response to someone who is already feeling invalidated about their eating disorder. \n\nEveryone should have their medical concerns taken seriously regardless of how many steps away from death they might be.",
          "created_utc": 1608460298.0
        },
        {
          "id": "gggmyex",
          "author": "Trippy_trip27",
          "body": "Should is the right word. Doesn't happen much in real life. I want to apologise to op for commenting in this way, being harsh is not a good way to make someone reconsider their intentions. Even though my belief is that a treatment center would be a financial burden for op with little gain",
          "created_utc": 1608461930.0
        }
      ]
    }
  ]
}