{
  "id": "kgsjir",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1608463611.0,
  "title": "Request: Question: has anyone ever experienced distorted eating in relation to anxiety?",
  "selftext": "I struggle with anxiety and often when I feel anxious enough, I tend to not eat very much at all - well below what I should eat in a day. It's like I feel sick and can't bring myself to each hardly anything at all. This occurs at a varying rate, depending on my anxiety but when it happens, it can last for a few days to even a couple of months. I don't have any issues with food normally, or have any particular body issues or dysmorphia. I am a pretty small person, though, and not eating hardly anything for even a couple of days can make me drop in weight, which I don't desire. \n\nTo sum it up, I essentially have some sort of distorted eating that occurs as a side effect of anxiety and it's noticeable and concerning enough for me to be seeking advise. Has anyone ever experienced something like this?\n\nI have been in therapy for awhile now and my therapist doesn't seem to be that concerned about it or at least thinks that if we can help my anxiety we can fix my eating patterns. I'm wondering if it's more than that, though. It's something that really bothers me and I'm just trying to find any way that I can break out of this pattern and eat normally.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kgsjir/request_question_has_anyone_ever_experienced/",
  "score": 43,
  "num_comments": 10,
  "comments": [
    {
      "id": "gghbdkb",
      "author": "curlshowdotheywork",
      "body": "This happens to me too. When I'm extremely anxious or overwhelmed I feel too sick to eat. Forcing myself to eat even a little bit will give me a panic attack too. I can go from having an appetite to full blown panic attack. It's a struggle.",
      "created_utc": 1608475380.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gggt87a",
      "author": "shebloomsafterdark",
      "body": "I completely lost my appetite about a week ago for maybe 5/6 days. I had to almost force myself to eat and when I did I felt incredibly nauseous. I realized it was because I had been feeling really anxious. That’s never happened before, I usually over eat when I feel  anxious. \n\nI think you need to find a therapist who deals with eating disorders. The fact that you mentioned yours isn’t concerned is concerning. good luck🤍✨",
      "created_utc": 1608466113.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gghcgva",
      "author": "NoGender-justHooman",
      "body": "I have the exact same thing and I'm struggling with it. I have fights in my mind, one part of me knowing I should eat and the other part feeling too sick to eat. Because of stress. In these times I'm happy if I eat even a few bites.\nNot very useful info, just wanted to let you know you're not alone x",
      "created_utc": 1608475953.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gghsghe",
      "author": "yppypp",
      "body": "When I experience a lot of anxiety I tend to feel nauseous and unable to eat for a few days to a few weeks and eventually it stops on its own. However, your case my be different than mine, and although working on your anxiety can help, you should also find tricks to help u eat when you are feeling this way. I would also suggest making sure that your therapist understand that this is an issue you want to fix with them because it is making you feel unwell and nervous, which is probably not helping you. Maybe you could try changing therapist too and getting one who can focus on disordered eating and anxiety",
      "created_utc": 1608482993.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gght45w",
      "author": "banditohat",
      "body": "Well if I’m really anxious I’ll feel sick and wont want to go anywhere and do anything which might cause me to not eat anything for a few days depending on how bad it is. So yes",
      "created_utc": 1608483340.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggidm00",
      "author": "SafeSprinkles7",
      "body": "This has been happening to me. Except now I’m beginning to obsesses over my hip bones and clavicle :/ I don’t know what’s wrong anymore",
      "created_utc": 1608493534.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggjhq84",
      "author": "OhToBeSkinny",
      "body": "I get severe anxiety because of my weight, I won’t leave the house or see friends because of it. My anxiety forces me to restrict my food to try to eliminate the cause of the anxiety. The anxiety makes me feel incredibly guilty, shameful and nauseas. I tend to take advantage of the nauseas :/",
      "created_utc": 1608514041.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gggou5a",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1608463611.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggjzjg3",
      "author": "None",
      "body": "Hi there, I have had the same thing (this year in particular). What I’ve done is eat even just small more calorie dense snacks even if I don’t actively want food so that my stomach doesn’t make me regret eating a full meal later on. If there is any food you consistently enjoy try going with that to see if it will prompt your appetite a bit more than it has been. I’ve also seen my acupuncturist after a particularly rough panic day that prompted me to not really eat or sleep and by a few hours after the session I started to be able to eat and have an appetite again; acupuncture works for stress/ anxiety as well as digestion. \nI hope this helps in any way!",
      "created_utc": 1608524156.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggk09tw",
      "author": "cthrowww",
      "body": "when my anxiety is bad I lose my appetite",
      "created_utc": 1608524624.0,
      "score": 1,
      "context": []
    }
  ]
}