{
  "id": "kigcr4",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1608678196.0,
  "title": "Request: Need to stop being Vegan to save my health.",
  "selftext": "For the sake of my health my RD has suggested that I need to give up my vegan diet. I have ARFID and currently my main safe foods that I consume on an everyday basis is and only are white rice and pinto beans.\nI am lacking nutrients and refuse to take any type of pills/medication/oral supplement etc. due to my extreme fear of medication.\nI have discussed this with my RD before and she suggested that the first step in doing so is to try to consume dairy milk. I haven't had milk since I was a baby (literally) and I've gone by all these years avoiding it and any other types of beverages labeled as \"milk\".\nMy ARFID has turned me into a vegan and I see all animal products as dirty and unethical. The thought of consuming milk makes me uneasy because I am not a baby cow which is why I shouldn't drink cows milk. I also have this recurring thought and visual image about the fact that the milk is coming from cow udders and that makes me queasy. I can't see myself drinking anything other than water which is what I've been doing for the past five years.\nAny tips? Tricks? Advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kigcr4/request_need_to_stop_being_vegan_to_save_my_health/",
  "score": 38,
  "num_comments": 27,
  "comments": [
    {
      "id": "ggr393j",
      "author": "cburnard",
      "body": "uh. well what you're following isn't a vegan diet, i'll say that first. \n\nthat being said, i get your aversion to animal products from an ethical standpoint (i am a vegan, but it's completely unrelated to my ED and 100% for ethical/environmental reasons). \n\ni would honestly consider taking your RD's suggestions, but if milk seems unapproachable, [Ensure has a vegan option](https://ensure.com/nutrition-products/ensure-plant-based-protein/vanilla-shake) and maybe you'd consider that instead of milk. then you need to work your way up to more food items--other beans, chickpea pasta, avocados, nuts and seeds. smoothies with protein powder are the easiest way for me to get nutrients without excessive calories and without me tripping out about one individual food item.\n\nnow, this next part i want to word carefully b/c i don't want to make you feel bad, but if you want to maintain a diet free of animal products once you get a better handle on yr ARFID, you ***have*** to take supplements. idk if you know about B12 deficiency but it's a real thing and you need to supplement or you will get sick. most vegan food items are \"enriched\" meaning they are modified. it's not poison, it's vitamins.\n\na lot of people out in the world take on these super restrictive diets with no supplements and few nutrients and they call it vegan and then when they get sick from their super restrictive diet, everyone around them says \"see, i knew veganism was unhealthy\". veganism isn't about perfection, and it's not about restriction--it's about harm reduction for animals and it's a first world privilege. if you really care about the ethics, please reconsider the optics.",
      "created_utc": 1608686495.0,
      "score": 37,
      "context": []
    },
    {
      "id": "ggr1ey5",
      "author": "MaryContrary26",
      "body": "Remind yourself that it's medicine. You don't want osteoporosis, trust me. The most vile thing I ever had to drink was colonoscopy prep and the only way I could get it down was by holding my nose but it worked. You got this.",
      "created_utc": 1608685490.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ggqstmt",
      "author": "ayay0x",
      "body": "This is very hard. I have some friends who were vegan and have been forced to start consuming animal products again for health reasons and it’s been really tough for them to do, I can only imagine ARFID and your fear of medications make it so much more complicated. I would say maybe talk it out with a therapist or someone who’s an expert (but not another type of doctor cause they can sometimes be dismissive of mental health constraints in my experience). \n\nAs far as “tricks” go, I’m thinking maybe try very small doses, or have someone making your meals for you (assuming that’s a possibility) and including diary like cheese in them without you knowing? Like maybe they could do it at random times and at a certain time you realize your body got used to it and can try integrate them in your diet?\n\nOr maybe (if you can of course) try only purchasing ethically, like from farmers or local shops instead of supermarkets? It could maybe help knowing that at least the source is good and the animal exploitation is not there in the same way as it is with intensive farming!",
      "created_utc": 1608680839.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ggqqfpy",
      "author": "aellamarie",
      "body": "For milk specifically, try putting it in a smoothie maybe? Or use normal yogurt. The fruit will disguise it and it should taste really good!",
      "created_utc": 1608679509.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ggr9enp",
      "author": "booboobacon",
      "body": "I’m a vegan too. My ED dietician has told me that I can be vegan and be healthy however I need to increase my calorie intake and supplement with protein smoothies and calcium supplements. \n.",
      "created_utc": 1608689897.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ggrbvl0",
      "author": "porchdawg",
      "body": "Have you considered protein powders?  There are vegan varieties available that are easily added to fruit smoothies, etc.",
      "created_utc": 1608691295.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ggr250g",
      "author": "Veganchiggennugget",
      "body": "Is there a way you can get yourself to eat other foods? How about nuts, seeds, pasta, curries. My dietician told me to eat meat too, but she couldn't argue why. Wholegrain is good too. You can get your nutrients from other places then milk if you are really against the idea, I would be too. For calcium eat lots of leafy green vegetables, maybe a nice spinach curry? Delicious 😋",
      "created_utc": 1608685890.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggre90u",
      "author": "seravivi",
      "body": "Honestly first look into getting products that ensure fair animal treatment. \nSecond if cow milk absolutely freaks you out you can either pick a different animal, or think of something you have always wanted to try but couldn't before. \n\nI had to switch from vegan to consuming animal products a few years back. It really is hard, but go slow. You dont have to eat animal products constantly if it doesn't make you comfortable, but find ways to add a bit here and there.",
      "created_utc": 1608692652.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggr5vqx",
      "author": "ant_society",
      "body": "I’m going through a similar experience, I’m still figuring out things myself. I was vegan for maybe 2 years, but I really wasn’t getting enough intake because what I was okay to eat was so limited and I freak out when introduced to new foods. So I slowly began to eat vegetarian, I have been vegetarian again for about a year and I still feel guilty but I understand and accept that my health needs attention too. We have to consider our own lives too, it gets a bit intense. It’s okay to step back when you gotta look after yourself. \n\nI don’t drink dairy milk, I prefer soy or oat! So I still have those. I do eat cheese and egg, bringing these back into my diet really helped a lot, dishes that were complicated to make as vegan became a lot easier so I could make the meals I enjoy again with less time. \n\nAnd if you’re wanting to drink more than water I’m on a cranberry juice hype right now (especially when it’s cranberry and raspberry) it’s so good for you and it’s just great. Any fruit juice is great. Juice is precious life nectar.",
      "created_utc": 1608687946.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggr6fo3",
      "author": "Vessecora",
      "body": "This is just what might make me feel better about considering dairy: try considering a formulated diary drink like the hospital formula Sustagen. It's nutritionally complete but not straight milk so it may feel one step removed for you. And it's not quite medication so it might work in that regard.",
      "created_utc": 1608688255.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggrr33k",
      "author": "SpaceUnicorn756",
      "body": "Are you me? I did the exact same thing. I was a vegan for three years, and I got myself down to white rice, quick cooking oatmeal, pinto beans or chickpeas, and broccoli. Actually, I began avoiding chickpeas since they would upset my stomach too much.\n\nI have always had a fear of eating something that would not come back out. A lot of foods do this. Fruit, dairy, spicy foods, garlic, onions. Things that seem like they get inside you, and never leave, and make you feel miserable the entire time. Things that I would love to eat, but wouldn't dare because of the miserable consequences.\n\n\"I want that banana, but I can't because I will double in size afterwards.\"  \n\"I want that garlic, but I can't because I'll be bent over in pain afterwards.\"  \n\"I want that butternut squash, but I can't because I'll be able to feel it stuck inside me and it may never come out.\"\n\nThat's how I whittled my diet down to bland, miserable foods that I hated. *I did it in order to feel better, but I never did feel better.*\n\nVeganism appeals to both of us because it allowed an excuse for our restrictive food disorder. Most foods eaten at public gatherings or during social eating events have either meat or dairy, so it allowed us to politely decline with a legitimate reason that most people would accept or at least tolerate. We could avoid a charged subject (rich foods, overeating, stomach-upsetting/bloat foods, or social eating itself), without the guilt trips.\n\n\"Oh, no thank you. I'm actually a vegan,\" and the conversation would quickly end there.\n\nIt turns out that vegan Omega 3 is not absorbed by the body whatsoever. It takes years to become entirely depleted, but when you do there will be consequences. B12 may or may not absorb into your body, depending on your genetics and the source of the vitamin. You also don't receive any iron from your foods unless you combine them in a special way each time. Despite what Bernard, McDougall, YouTubers, Instagrammers, and others will lead you to believe, there are many vitamins and minerals that you simply cannot get on a vegan diet, and the vegan equivalents are inferior or are not reliably absorbed.\n\nDuring my second year as a vegan, I fainted at work. I was rushed to a hospital, where I was treated for malnourishment and dehydration. I refused to believe it could be because of my diet. It took another year before I left veganism for good. My hair was falling out, my nails were brittle, I had brain fog, I was constantly preoccupied with food, and I had pushed myself away from a lot of people that I loved in the process.\n\nVeganism itself is classified as an eating disorder, because of its restrictive nature. There are some people and organizations that may tell you otherwise, but statistically almost no one survives veganism after the fourth year. There's a reason for it.\n\nI wish you the best of health.",
      "created_utc": 1608700604.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggqo1ot",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1608678196.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggrohji",
      "author": "Zelda_is_my_homegirl",
      "body": "I’m having a very similar issue. I eat a much wider variety than you, but spent a long time eating only WFPB and have developed an aversion to protein in general. \n\nSome foods I’ve experimented with since entering recovery are eggs, dairy cheese (still can’t do milk for some reason though), and I had my first meat in 8 years yesterday (beef jerky). \n\nBasically, my nutritionist wants me to open myself up to it, but not force it. So if something like cheese on veggie burger sounds or looks good, I should try it. \n\nYour case might be a little more severe than mine, but tiny little steps and pushing myself to try things that scare me and challenge those thoughts is what really seems to be helping. \nBest of luck and feel free to hit me up if you need to chat with someone.",
      "created_utc": 1608698876.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggrwgbk",
      "author": "seatangle",
      "body": "It's tricky. I wanted to be vegan for a long time, but being in and out of treatment and fear of relapse kept me from doing it. I had to get to a place where I knew I was doing it for the right reasons (environmental and ethical reasons) rather than just because of my ED. I'm still not recovered completely and have a pretty rigid diet. However, I know it is possible to be healthy and vegan, as that is something I have been able to maintain in the past, albeit temporarily. You definitely don't need dairy milk to have a healthy diet, BUT (and this is a big one) if you are not taking supplements, you NEED to get B12 and iron from somewhere - and the only other place to get that reliably is from animal products. I think you are going to have to decide on a lesser of two evils - supplements or animal products. \n\nI'm not sure if this helps but there are forms of b12 that aren't medication-like, such as gummies and also liquid drops (so you can dissolve it in water).",
      "created_utc": 1608704644.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggs79gd",
      "author": "Connect_Peanut_7308",
      "body": "I am not a vegan but being Indian I can say that we have many vegetarian dishes where we add milk and yogurt. Maybe you can try that ?  For us Indians vegetarians includes only milk,  yogurt, butter and ghee but not eggs or other animal by products. Also, in market there are oat milks with lot of nutrients in it maybe you can try those . Please don’t buy food with non gmo tag because all the food we have right now are gmo ( including the normal bananas because bananas used to have seeds in them ).",
      "created_utc": 1608714958.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggsph6n",
      "author": "houston_veronica",
      "body": "I recommend seeking inpatient treatment. It really, really will be the most helpful thing to get you out of this mental loop.  It's extremely difficult to recover on your own, and the things you are saying really are so far gone. I understand you are already trying hard, and that is awesome - but you need support. This is bigger than you are, just as it has been for me. Hugs.",
      "created_utc": 1608732077.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggyrcg7",
      "author": "sko03",
      "body": "In addition to the RD, are you working with a therapist? I needed help to start eating again from a medical and mental health approach. \n\nSome things which help me: \n1. My health issues require a specialty diet which is restrictive, so I try to look at it as all of the foods I can/will eat rather than all the ones I can't/won't. \n\n2. I also started making a list of all the safe foods I can handle including snacks. If pinto beans and rice are safe for you, you can ask why they're safe and then try to find other foods which make you feel safe for similar reasons. (For example, if it's texture, maybe oatmeal with vegan protein powder and blueberries)\n\n3. Listen to music or something while eating to help make it more enjoyable especially if not eating your #1 safe food. I reserve special podcast or music that I can only listen to while eating to help increase the likelihood of following through. You could maybe talk to a friend or support person.\n\n4. Pack lunches and have some sort of game plan for the week. If I want to be successful and eat foods which are healthful and working toward my recovery goals, I have to plan for it.\n\n5. And I take vitamins... I found a company I like which is ethical and sources their products responsibly. For example they recreated their Vitamin D product so that it is vegan.",
      "created_utc": 1608873005.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh0dedu",
      "author": "the_good_nurse",
      "body": "I've been in in pt. Tx multiple times and no, food is still not medicine. Medicine is medicine. No one on my inpt. Team has ever used that phrase.",
      "created_utc": 1608925095.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggr6zif",
      "author": "Veganchiggennugget",
      "body": "You worded this beautifully thank you ♥️",
      "created_utc": 1608688564.0,
      "score": 7,
      "context": [
        {
          "id": "ggr393j",
          "author": "cburnard",
          "body": "uh. well what you're following isn't a vegan diet, i'll say that first. \n\nthat being said, i get your aversion to animal products from an ethical standpoint (i am a vegan, but it's completely unrelated to my ED and 100% for ethical/environmental reasons). \n\ni would honestly consider taking your RD's suggestions, but if milk seems unapproachable, [Ensure has a vegan option](https://ensure.com/nutrition-products/ensure-plant-based-protein/vanilla-shake) and maybe you'd consider that instead of milk. then you need to work your way up to more food items--other beans, chickpea pasta, avocados, nuts and seeds. smoothies with protein powder are the easiest way for me to get nutrients without excessive calories and without me tripping out about one individual food item.\n\nnow, this next part i want to word carefully b/c i don't want to make you feel bad, but if you want to maintain a diet free of animal products once you get a better handle on yr ARFID, you ***have*** to take supplements. idk if you know about B12 deficiency but it's a real thing and you need to supplement or you will get sick. most vegan food items are \"enriched\" meaning they are modified. it's not poison, it's vitamins.\n\na lot of people out in the world take on these super restrictive diets with no supplements and few nutrients and they call it vegan and then when they get sick from their super restrictive diet, everyone around them says \"see, i knew veganism was unhealthy\". veganism isn't about perfection, and it's not about restriction--it's about harm reduction for animals and it's a first world privilege. if you really care about the ethics, please reconsider the optics.",
          "created_utc": 1608686495.0
        }
      ]
    },
    {
      "id": "ggwr9zu",
      "author": "the_good_nurse",
      "body": "I agree! I don't practice veganism but this isn't a vegan diet. The headline is misleading. Veganism is having a diet so vast in produce and grains that you have crowded out all animal products. People who are vegan have a variety that far surpasses what omnivores eat. This RD has to make a suggestion like this because this \"vegan diet\" is unbelievably restricted.",
      "created_utc": 1608827508.0,
      "score": 2,
      "context": [
        {
          "id": "ggr393j",
          "author": "cburnard",
          "body": "uh. well what you're following isn't a vegan diet, i'll say that first. \n\nthat being said, i get your aversion to animal products from an ethical standpoint (i am a vegan, but it's completely unrelated to my ED and 100% for ethical/environmental reasons). \n\ni would honestly consider taking your RD's suggestions, but if milk seems unapproachable, [Ensure has a vegan option](https://ensure.com/nutrition-products/ensure-plant-based-protein/vanilla-shake) and maybe you'd consider that instead of milk. then you need to work your way up to more food items--other beans, chickpea pasta, avocados, nuts and seeds. smoothies with protein powder are the easiest way for me to get nutrients without excessive calories and without me tripping out about one individual food item.\n\nnow, this next part i want to word carefully b/c i don't want to make you feel bad, but if you want to maintain a diet free of animal products once you get a better handle on yr ARFID, you ***have*** to take supplements. idk if you know about B12 deficiency but it's a real thing and you need to supplement or you will get sick. most vegan food items are \"enriched\" meaning they are modified. it's not poison, it's vitamins.\n\na lot of people out in the world take on these super restrictive diets with no supplements and few nutrients and they call it vegan and then when they get sick from their super restrictive diet, everyone around them says \"see, i knew veganism was unhealthy\". veganism isn't about perfection, and it's not about restriction--it's about harm reduction for animals and it's a first world privilege. if you really care about the ethics, please reconsider the optics.",
          "created_utc": 1608686495.0
        }
      ]
    },
    {
      "id": "ggs3xi5",
      "author": "nacholicious",
      "body": "Exactly. Being vegetarian is hard, being vegan is ultra hard. You have to put in a lot of care both for your body and your food, and without that it's far healthier to just to keep eating meat.\n\nI've been vegetarian my whole life and ED free for a decade, but without iron supplements I still end up with iron deficiency which makes me feel like garbage.",
      "created_utc": 1608711487.0,
      "score": 2,
      "context": [
        {
          "id": "ggr393j",
          "author": "cburnard",
          "body": "uh. well what you're following isn't a vegan diet, i'll say that first. \n\nthat being said, i get your aversion to animal products from an ethical standpoint (i am a vegan, but it's completely unrelated to my ED and 100% for ethical/environmental reasons). \n\ni would honestly consider taking your RD's suggestions, but if milk seems unapproachable, [Ensure has a vegan option](https://ensure.com/nutrition-products/ensure-plant-based-protein/vanilla-shake) and maybe you'd consider that instead of milk. then you need to work your way up to more food items--other beans, chickpea pasta, avocados, nuts and seeds. smoothies with protein powder are the easiest way for me to get nutrients without excessive calories and without me tripping out about one individual food item.\n\nnow, this next part i want to word carefully b/c i don't want to make you feel bad, but if you want to maintain a diet free of animal products once you get a better handle on yr ARFID, you ***have*** to take supplements. idk if you know about B12 deficiency but it's a real thing and you need to supplement or you will get sick. most vegan food items are \"enriched\" meaning they are modified. it's not poison, it's vitamins.\n\na lot of people out in the world take on these super restrictive diets with no supplements and few nutrients and they call it vegan and then when they get sick from their super restrictive diet, everyone around them says \"see, i knew veganism was unhealthy\". veganism isn't about perfection, and it's not about restriction--it's about harm reduction for animals and it's a first world privilege. if you really care about the ethics, please reconsider the optics.",
          "created_utc": 1608686495.0
        }
      ]
    },
    {
      "id": "ggwqgpk",
      "author": "the_good_nurse",
      "body": "No, food is food and medicine is medicine. Using this fallacy of \"food is medicine\" promotes dangerous behaviors like people attempting to treat progressive cancer with a frutitarian diet. The diet aspect can be supportive but is NOT medicine. A Type 1 diabetic can control somethings with diet but they still have to have insulin.",
      "created_utc": 1608827045.0,
      "score": 1,
      "context": [
        {
          "id": "ggr1ey5",
          "author": "MaryContrary26",
          "body": "Remind yourself that it's medicine. You don't want osteoporosis, trust me. The most vile thing I ever had to drink was colonoscopy prep and the only way I could get it down was by holding my nose but it worked. You got this.",
          "created_utc": 1608685490.0
        }
      ]
    },
    {
      "id": "ggsmr71",
      "author": "jecrois222",
      "body": "There is a difference between selective breeding over many generations and GMOs.",
      "created_utc": 1608730156.0,
      "score": 1,
      "context": [
        {
          "id": "ggs79gd",
          "author": "Connect_Peanut_7308",
          "body": "I am not a vegan but being Indian I can say that we have many vegetarian dishes where we add milk and yogurt. Maybe you can try that ?  For us Indians vegetarians includes only milk,  yogurt, butter and ghee but not eggs or other animal by products. Also, in market there are oat milks with lot of nutrients in it maybe you can try those . Please don’t buy food with non gmo tag because all the food we have right now are gmo ( including the normal bananas because bananas used to have seeds in them ).",
          "created_utc": 1608714958.0
        }
      ]
    },
    {
      "id": "ggx9f77",
      "author": "MaryContrary26",
      "body": "Oh, I agree! You wouldn't treat cancer with diet but eating disorders? The treatment is literally eating food. And in treatment for eating disorders food is considered the clients' medicine.",
      "created_utc": 1608837818.0,
      "score": 1,
      "context": [
        {
          "id": "ggr1ey5",
          "author": "MaryContrary26",
          "body": "Remind yourself that it's medicine. You don't want osteoporosis, trust me. The most vile thing I ever had to drink was colonoscopy prep and the only way I could get it down was by holding my nose but it worked. You got this.",
          "created_utc": 1608685490.0
        },
        {
          "id": "ggwqgpk",
          "author": "the_good_nurse",
          "body": "No, food is food and medicine is medicine. Using this fallacy of \"food is medicine\" promotes dangerous behaviors like people attempting to treat progressive cancer with a frutitarian diet. The diet aspect can be supportive but is NOT medicine. A Type 1 diabetic can control somethings with diet but they still have to have insulin.",
          "created_utc": 1608827045.0
        }
      ]
    },
    {
      "id": "ggt468u",
      "author": "Connect_Peanut_7308",
      "body": "Please tell me more .. yes by selective breeding the chances of getting required traits are less compared to that by modern scientific methods and being scientist I can assure that most of the GMO food are actually good and safe.",
      "created_utc": 1608740651.0,
      "score": 1,
      "context": [
        {
          "id": "ggs79gd",
          "author": "Connect_Peanut_7308",
          "body": "I am not a vegan but being Indian I can say that we have many vegetarian dishes where we add milk and yogurt. Maybe you can try that ?  For us Indians vegetarians includes only milk,  yogurt, butter and ghee but not eggs or other animal by products. Also, in market there are oat milks with lot of nutrients in it maybe you can try those . Please don’t buy food with non gmo tag because all the food we have right now are gmo ( including the normal bananas because bananas used to have seeds in them ).",
          "created_utc": 1608714958.0
        },
        {
          "id": "ggsmr71",
          "author": "jecrois222",
          "body": "There is a difference between selective breeding over many generations and GMOs.",
          "created_utc": 1608730156.0
        }
      ]
    },
    {
      "id": "ggur02h",
      "author": "jecrois222",
      "body": "From my understanding, and correct me if I am misinformed, GMOs extract DNA from an organism and combine it with another completely different species that it would not fertilize in nature. Selective breeding over many generations is what most, likely all, of our produce is today, but that was done using the same species, just choosing certain plants with certain traits to reproduce, which over many generations creates a very different plant. \nIMO there is No way to tell the long term affects of extracting and combining DNA from two unrelated species.",
      "created_utc": 1608772048.0,
      "score": 1,
      "context": [
        {
          "id": "ggs79gd",
          "author": "Connect_Peanut_7308",
          "body": "I am not a vegan but being Indian I can say that we have many vegetarian dishes where we add milk and yogurt. Maybe you can try that ?  For us Indians vegetarians includes only milk,  yogurt, butter and ghee but not eggs or other animal by products. Also, in market there are oat milks with lot of nutrients in it maybe you can try those . Please don’t buy food with non gmo tag because all the food we have right now are gmo ( including the normal bananas because bananas used to have seeds in them ).",
          "created_utc": 1608714958.0
        },
        {
          "id": "ggsmr71",
          "author": "jecrois222",
          "body": "There is a difference between selective breeding over many generations and GMOs.",
          "created_utc": 1608730156.0
        },
        {
          "id": "ggt468u",
          "author": "Connect_Peanut_7308",
          "body": "Please tell me more .. yes by selective breeding the chances of getting required traits are less compared to that by modern scientific methods and being scientist I can assure that most of the GMO food are actually good and safe.",
          "created_utc": 1608740651.0
        }
      ]
    },
    {
      "id": "ggw0i9x",
      "author": "Connect_Peanut_7308",
      "body": "For making GM plants, the DNA or gene of interest is taken from the plant that has the required gene and inserted into the genome of the plant we want the final product to be. The method of inserting those genes varies and in some cases MIGHT  include use of bacteria and virus but now we have lot of up coming technologies including CRISPR-Cas. Also, lot of gm crops can actually solve hunger issues and bad crop issues but unfortunately there is so much hatred and misinformation available everywhere plus many people try to exploit and it ends up giving the science bad name.  It is very difficult to take genes from another organism and just insert it or make new organisms . Plus there are very strict rules and licenses for production and even experimentation for GMO. Till they don’t pass the evaluation that they are not allowed to be brought to the market and one can not just go ahead with any GMO making experiment there are lot of strict procedures, protocols and running around done plus if the facility where they are trying to do an experiment or go for productions doesn’t meet even just one criteria it will be not allowed to be carried out. Yes we are still understanding certain things but that doesn’t mean we aren’t careful especially when most of the scientists are aware about zoonosis and that’s the last thing anyone of us would want. Covid-19 , Ebola etc falls into the category of zoonosis. Ironically most of the zoonosis has happened due to how humans have come in contact with nature by themselves. That’s why it irks me when people who are not specialists try to go deep in to unknown territories of forest without any guidance and disobey rules plus don’t follow basic hygiene. It also annoys me when people out of curiosity go to the zones marked by government just for people belonging to a certain tribe that have no contact with outside world because the chances of us passing diseases to them they are not exposed to or vice versa becomes higher.",
      "created_utc": 1608806602.0,
      "score": 1,
      "context": [
        {
          "id": "ggs79gd",
          "author": "Connect_Peanut_7308",
          "body": "I am not a vegan but being Indian I can say that we have many vegetarian dishes where we add milk and yogurt. Maybe you can try that ?  For us Indians vegetarians includes only milk,  yogurt, butter and ghee but not eggs or other animal by products. Also, in market there are oat milks with lot of nutrients in it maybe you can try those . Please don’t buy food with non gmo tag because all the food we have right now are gmo ( including the normal bananas because bananas used to have seeds in them ).",
          "created_utc": 1608714958.0
        },
        {
          "id": "ggsmr71",
          "author": "jecrois222",
          "body": "There is a difference between selective breeding over many generations and GMOs.",
          "created_utc": 1608730156.0
        },
        {
          "id": "ggt468u",
          "author": "Connect_Peanut_7308",
          "body": "Please tell me more .. yes by selective breeding the chances of getting required traits are less compared to that by modern scientific methods and being scientist I can assure that most of the GMO food are actually good and safe.",
          "created_utc": 1608740651.0
        },
        {
          "id": "ggur02h",
          "author": "jecrois222",
          "body": "From my understanding, and correct me if I am misinformed, GMOs extract DNA from an organism and combine it with another completely different species that it would not fertilize in nature. Selective breeding over many generations is what most, likely all, of our produce is today, but that was done using the same species, just choosing certain plants with certain traits to reproduce, which over many generations creates a very different plant. \nIMO there is No way to tell the long term affects of extracting and combining DNA from two unrelated species.",
          "created_utc": 1608772048.0
        }
      ]
    }
  ]
}