{
  "id": "kiqwzo",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1608720265.0,
  "title": "Request: Am I anorexic if I don’t exercise?",
  "selftext": "When I’m binging and purging I exercise a lot but when I restrict i find myself not exercising that much does that mean that I don’t care about my body and I’m not qualified as an anorexic?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kiqwzo/request_am_i_anorexic_if_i_dont_exercise/",
  "score": 50,
  "num_comments": 11,
  "comments": [
    {
      "id": "ggscrad",
      "author": "Myechomyshadowandme",
      "body": "You can absolutely still have anorexia. I have it and I don’t exercise much. It’s just too exhausting for me. In my opinion, anorexia is more about the thoughts and feelings around food, body, weight and/or exercise than it is about specific behaviours and physical appearance and functioning. It’s a mental illness with varying physical and behavioural effects.",
      "created_utc": 1608720993.0,
      "score": 41,
      "context": []
    },
    {
      "id": "ggssun2",
      "author": "None",
      "body": "It's definitely harder to have energy to work out if you're not consuming energy. I agree that it's a mental disorder primarily. I really hope you get help, at least a therapist, to talk about it. It's really helped me.",
      "created_utc": 1608734249.0,
      "score": 10,
      "context": []
    },
    {
      "id": "ggsutut",
      "author": "jeabgrenouille",
      "body": "Yes! When I was my most ill with anorexia, I HATED any form of movement because I just did not have any energy, and my body felt so fragile. I was worried that I would die if I exercised. I would do anything to get out of gym class, and I was in a community sports program (that I loved before I got sick) and I would lock myself in the bathroom and refuse to go. I also hated walking. \n\nI did have some movement things like I refused to sit down between certain hours of the day, but otherwise, I didn't have any energy to exercise. When I was hospitalized, my roommate who also had anorexia, would walk around in circles on our floor and I thought she was being silly. I had no desire to do that.\n\nI'm just going to add that once I started eating regularly, I dealt with extreme hunger and at that time, I relied on exercise to keep me feeling okay about eating, and that was compulsive exercise and I had to break that in order to have the level of recovery that I have now.",
      "created_utc": 1608735441.0,
      "score": 7,
      "context": []
    },
    {
      "id": "ggt0g3v",
      "author": "Fatshywhore",
      "body": "Thank you guys so much you don’t know how much this helped me feeling better, but for those who say to get a therapist i have but because of where i live and the total uneducated people that live here, my therapist flat out didn’t know what an eating disorder was so yeah... i hated that so much I already felt misunderstood by the people who I’ve shared my story with",
      "created_utc": 1608738637.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggtb9o8",
      "author": "peachaleach",
      "body": "You can be, yes - I've never struggled with exercise and have been diagnosed with anorexia for several years.",
      "created_utc": 1608744346.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggsiwtt",
      "author": "Coffee-n-chardonnay",
      "body": "Absolutely, yes! Many children are diagnosed with anorexia regardless of sports or exercise. If you have a history of restriction or diet abuse or disordered eating (not to be confused with a diagnosed eating disorder) then yes, you absolutely would fall into the anorexia category. Please take care of yourself and be safe",
      "created_utc": 1608727061.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggtitqo",
      "author": "enord11400",
      "body": "I think this is pretty common. I relapsed hard into my ED and crossed into Anorexia territory with restriction (rather than bulimia which was my first diagnosis) because I couldn’t exercise after donating blood. (I don’t recommend donating blood as a minor at the bottom of the weight limit as an average height female.) I was using the exercise to rationalize eating enough. Exercise is viewed by many as a way to purge. (Ie I ate x so now I’m going to exercise to burn it off) Exercise can be good for many people but it is not good for someone who is actively struggling with a restrictive ED and can easily lead to injury as your body can’t heal itself as well. \n\nAlso if you think you have an ED you should talk to a doctor/therapist/psychiatrist/dietician.",
      "created_utc": 1608748267.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggvvih7",
      "author": "DamienandShayne",
      "body": "It’s a mental illness, you are still anorexic. I mainly restrict and then will exercise like a mad man in bursts of days. Everyone’s eating disorder is different but you don’t have to be a specific body weight, have certain routines, etc, to be struggling with an eating disorder.",
      "created_utc": 1608800930.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ggsc324",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1608720266.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggvepkp",
      "author": "Anaxiety1762",
      "body": "Yes, they’re are different branches of anoréxica. The basic one of just starving yourself and being very cautious of how much you’re consuming. There is a others: anorexia athletica and Orthorexia. These two are being obsessed with extreme exercise, dieting, binging/purging, and/or starving/fasting to achieve weight loss very fast and drastically.",
      "created_utc": 1608786040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ghaaoaq",
      "author": "Inevitable_Echo_4405",
      "body": "Yes, just because you don’t exercise doesn’t disqualify you from getting help and recovering from your ed. \nI also struggle with anorexia and when I was at my worst I never exercised if I could help it. It’s only now that I’ve started to change my mindset and try live a healthier lifestyle have I incorporated exercise, purely for health reasons and because it makes me feel good.",
      "created_utc": 1609161410.0,
      "score": 1,
      "context": []
    }
  ]
}