{
  "id": "kjpp5p",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1608855268.0,
  "title": "Request: Where are my binge eaters? I need support",
  "selftext": "Hello Everyone,\n\nSo I have binge eating disorder. Or at least I assume so, I was talking to a therapist prior to the Covid closure about my bad relationship with food. She told me to start intuitive eating and I have joined [r/intuitive](https://www.reddit.com/r/intuitive/) eating and started watching different intuitive eating youtubers. My only issue is that everyone in the ED community seems to be suffering with binging along with and additional disorder, commonly anorexia.\n\nI understand their struggle. They have a very dangerous ED but I feel like I can't relate to their stories. I do not think I have food guilt. That's is what I most often see people mention. Instead I describe my relationship with food like a toxic relationship. When I'm stressed or sad I go to food because I'm seeking comfort and temporary happiness. Instead I binge and feel like shit afterwards. I am not sure if it's guilt I'm feeling... Maybe. It's more of a physical discomfort.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kjpp5p/request_where_are_my_binge_eaters_i_need_support/",
  "score": 67,
  "num_comments": 16,
  "comments": [
    {
      "id": "ggy3xk0",
      "author": "PossibleCook",
      "body": "Hi! Fellow binge eater here, and I totally get what you say. For me it’s not so much about always being hungry as it is just.. dealing with my emotions by eating. This is a very common form of an eating disorder so your not alone!",
      "created_utc": 1608856498.0,
      "score": 22,
      "context": []
    },
    {
      "id": "ggy5vec",
      "author": "charrrrrlatte",
      "body": "I really want to validate what you are feeling. Binge eating is actually the most common eating disorder statistically, but is often cloaked in a lot of shame and isn't quite as acceptable to talk about as AN. The vast majority of online personalities with eating disorders talk about anorexia.\nWhat I'm hearing you say is you often turn to food for comfort to help cope with distressing emotions. This is actually a super normal and okay way to cope in itself. Emotional eating is not a sin. Finding other ways to self-soothe is critical though so that you have a variety of coping mechanisms to utilize rather than solely resorting to using food. I would encourage you to do some research on or talk to your therapist about self-soothe methods, focusing on using your senses. Good luck to you!",
      "created_utc": 1608857787.0,
      "score": 12,
      "context": []
    },
    {
      "id": "ggyii7s",
      "author": "Zelda_is_my_homegirl",
      "body": "r/bingeeatingdisorder might have more kindred spirits. \n\nI will say this however- if you feel like the foods you eat when binging are bad or you feel bad about the binges, other than being uncomfortably full, you might be experiencing some type of shame around it. Do you feel pressure to watch what you eat or compensate for binges? If not that’s perfectly ok and does not invalidate what you’re dealing with. There’s not a competition for whose behavior is the most disordered.",
      "created_utc": 1608866602.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ggyr4oj",
      "author": "Synchro_Shoukan",
      "body": "I'm that way too. I hate food because I love it so much. I hate eating because I'm always finished first if I even eat around others at all.\n\nI eat to feel full and taste good food. I always binge abd feel bloated and terrible afterwards. And I always seem to eat the same garbage. Pizza is my worst enemy, but I keep going back because it's easy to make.",
      "created_utc": 1608872841.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ggy6txq",
      "author": "610-Kat",
      "body": "My relationship with food is... a bit more complex, but I totally get your \"seeking comfort\" in it.",
      "created_utc": 1608858416.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ggz12y8",
      "author": "bikecrotchthrowaway",
      "body": "Here is what helped me after a literal lifetime of binge eating:\n+ Getting diagnosed with ADHD. turns out junk food gives your brain a little of the dopamine it is so desperately craving. Turns out that's not a sustainable way to live. Also going on meds makes it so that I can actually pay attention to my hunger/fullness cues\n+ Seeing a therapist who specializes in intuitive eating for binge eaters. If you restrict food or tell yourself you can't eat certain foods, it makes them more tempting and binge-able. If no food is Forbidden, there's nothing to binge on. Yes it seems COUNTER-intuitive but it works",
      "created_utc": 1608881623.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ggy22k8",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1608855269.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggz1b51",
      "author": "notacutecumber",
      "body": "Hello! As someone who also suffers from binging, I understand your struggle. Food and eating can sometimes appear to be very comforting sometimes until they aren't, and that's valid. All of your struggles are completely valid, and a lack of representation doesn't mean a lack of solidarity. Sending support your way!\n\n౧(*മ് ധമ്)੭ ๑)л✧ ૂ❤️",
      "created_utc": 1608881866.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggz26hn",
      "author": "__andrei__",
      "body": "Definitely in the same boat, and staying at home doesn’t help.",
      "created_utc": 1608882802.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ggzdyw0",
      "author": "FireBurnerAccount77",
      "body": "I am available if you wanna message me I struggle with the same thing.",
      "created_utc": 1608897389.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh2aiye",
      "author": "None",
      "body": "Hi! I’m in the same boat as you. I didn’t find intuitive eating to be helpful for me because if I “think” about what I feel like eating... it’s probably not going to be something healthy. There’s a really tricky line between watching what you eat and falling into the binge/ restrict pattern. I don’t have an answer for you because I still struggle with this but I hope I can help you out if you need anything x",
      "created_utc": 1608979080.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gha5bx1",
      "author": "throwawaycp97",
      "body": "Hello. I am 23 F and have been restricting and calorie counting obsessively for almost a year and lost a ton of weight and became obsessed with seeing the number on the scale continue to go down. I had a cheat day 2 months ago that ended up being a complete binge. Now I've been wanting to binge once every week and it has my anxiety and stress levels very high because I have gained some weight and gaining weight is terrifying for me. Especially after losing so much of it and actually being super thin once in my life and people saying I look good. \nI am so f***** angry wih myself for binging and I hate myself for it so much. Im so uncomfortable with my body now and how much my stomach is sticking out that I don't even wanna take my clothes off or shower because I don't want to see my stomach. :( it truly is traumatizing and hard and makes me wanna cry. Anybody else ever get that way?",
      "created_utc": 1609156427.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjxopg4",
      "author": "Stunning-Excuse7181",
      "body": "Agreed! I will binge but when I'm around other people I barely eat.",
      "created_utc": 1611142918.0,
      "score": 1,
      "context": [
        {
          "id": "ggyr4oj",
          "author": "Synchro_Shoukan",
          "body": "I'm that way too. I hate food because I love it so much. I hate eating because I'm always finished first if I even eat around others at all.\n\nI eat to feel full and taste good food. I always binge abd feel bloated and terrible afterwards. And I always seem to eat the same garbage. Pizza is my worst enemy, but I keep going back because it's easy to make.",
          "created_utc": 1608872841.0
        }
      ]
    },
    {
      "id": "ggz29oe",
      "author": "__andrei__",
      "body": "Would you mind sharing your experience of getting diagnosed with ADHD later in life? I suspect I’ve had it since childhood, but many doctors believe it’s a childhood only disease and don’t diagnose adults.",
      "created_utc": 1608882898.0,
      "score": 2,
      "context": [
        {
          "id": "ggz12y8",
          "author": "bikecrotchthrowaway",
          "body": "Here is what helped me after a literal lifetime of binge eating:\n+ Getting diagnosed with ADHD. turns out junk food gives your brain a little of the dopamine it is so desperately craving. Turns out that's not a sustainable way to live. Also going on meds makes it so that I can actually pay attention to my hunger/fullness cues\n+ Seeing a therapist who specializes in intuitive eating for binge eaters. If you restrict food or tell yourself you can't eat certain foods, it makes them more tempting and binge-able. If no food is Forbidden, there's nothing to binge on. Yes it seems COUNTER-intuitive but it works",
          "created_utc": 1608881623.0
        }
      ]
    },
    {
      "id": "gh3h2qk",
      "author": "bikecrotchthrowaway",
      "body": "Do you live in the US? that's where I am, so my advice might not apply elsewhere. My therapist and I figured out I had it just by discussing symptoms. He can't diagnose though. He sent me to a psychiatrist who pre-screened me just by talking to me and sent me out for neuropsych testing. Which is actually a shitty way to diagnose someone but it was the hoop I had to jump through to get medicated. \n\nMost current research shows that the vast majority of adults don't grow out of ADHD. You should be able to look for doctors who specialize in adult ADHD. \n\nAlso I grew up in a household where my mother literally didn't believe in mental healthcare, so I like to point that out. You'll also get asked about whether you had symptoms as a child so think about how you could answer that.\n\nThere are doctors out there who don't take ADHD in adults seriously, but they are shitty people who are endangering people's lives.",
      "created_utc": 1609011047.0,
      "score": 2,
      "context": [
        {
          "id": "ggz12y8",
          "author": "bikecrotchthrowaway",
          "body": "Here is what helped me after a literal lifetime of binge eating:\n+ Getting diagnosed with ADHD. turns out junk food gives your brain a little of the dopamine it is so desperately craving. Turns out that's not a sustainable way to live. Also going on meds makes it so that I can actually pay attention to my hunger/fullness cues\n+ Seeing a therapist who specializes in intuitive eating for binge eaters. If you restrict food or tell yourself you can't eat certain foods, it makes them more tempting and binge-able. If no food is Forbidden, there's nothing to binge on. Yes it seems COUNTER-intuitive but it works",
          "created_utc": 1608881623.0
        },
        {
          "id": "ggz29oe",
          "author": "__andrei__",
          "body": "Would you mind sharing your experience of getting diagnosed with ADHD later in life? I suspect I’ve had it since childhood, but many doctors believe it’s a childhood only disease and don’t diagnose adults.",
          "created_utc": 1608882898.0
        }
      ]
    },
    {
      "id": "gh3levo",
      "author": "__andrei__",
      "body": "Thanks! I really appreciate you taking the time.",
      "created_utc": 1609013554.0,
      "score": 2,
      "context": [
        {
          "id": "ggz12y8",
          "author": "bikecrotchthrowaway",
          "body": "Here is what helped me after a literal lifetime of binge eating:\n+ Getting diagnosed with ADHD. turns out junk food gives your brain a little of the dopamine it is so desperately craving. Turns out that's not a sustainable way to live. Also going on meds makes it so that I can actually pay attention to my hunger/fullness cues\n+ Seeing a therapist who specializes in intuitive eating for binge eaters. If you restrict food or tell yourself you can't eat certain foods, it makes them more tempting and binge-able. If no food is Forbidden, there's nothing to binge on. Yes it seems COUNTER-intuitive but it works",
          "created_utc": 1608881623.0
        },
        {
          "id": "ggz29oe",
          "author": "__andrei__",
          "body": "Would you mind sharing your experience of getting diagnosed with ADHD later in life? I suspect I’ve had it since childhood, but many doctors believe it’s a childhood only disease and don’t diagnose adults.",
          "created_utc": 1608882898.0
        },
        {
          "id": "gh3h2qk",
          "author": "bikecrotchthrowaway",
          "body": "Do you live in the US? that's where I am, so my advice might not apply elsewhere. My therapist and I figured out I had it just by discussing symptoms. He can't diagnose though. He sent me to a psychiatrist who pre-screened me just by talking to me and sent me out for neuropsych testing. Which is actually a shitty way to diagnose someone but it was the hoop I had to jump through to get medicated. \n\nMost current research shows that the vast majority of adults don't grow out of ADHD. You should be able to look for doctors who specialize in adult ADHD. \n\nAlso I grew up in a household where my mother literally didn't believe in mental healthcare, so I like to point that out. You'll also get asked about whether you had symptoms as a child so think about how you could answer that.\n\nThere are doctors out there who don't take ADHD in adults seriously, but they are shitty people who are endangering people's lives.",
          "created_utc": 1609011047.0
        }
      ]
    }
  ]
}