{
  "id": "kkhg2q",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1608983505.0,
  "title": "Request: I'm tired of eating disorders ruining my life",
  "selftext": "I was diagnosed with anorexia when I was a pre-teen, then bulimia when I was teen, and since then, I've been dealing with BED and emotional overeating. \nI'm obese now and it prevents me to do many stuff, like play with my kid, dress how I want, be invisible in the crowd if I want to. I can lose weight to get to the point where I'll have all that, but  I'm so tired of it all. \nI'm tired of obsessing over my body and how it looks. It's so much energy, time, money invested into something pointless, such as controlling your body. I already have limited time on this earth and THIS is what I decided to do with it. I'm in my late 30s now and I'm so scared that my life will just go by and I'll die and that's it. Without any significant contribution to the world or to my loved ones. On my grave stone it's going to say: \"She fought with eating disorders, lost and gained weight many times and... that's it\".\nI just don't want to be obsessed with all that anymore. I just want it to stop.\nDoes anyone has any useful advice?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kkhg2q/request_im_tired_of_eating_disorders_ruining_my/",
  "score": 85,
  "num_comments": 3,
  "comments": [
    {
      "id": "gh2flav",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1608985473.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gh2rjq0",
      "author": "thatlousyguitarist",
      "body": "This initial step rarely gets acknowledged but recognizing that you need to do some action is already a sign that you're doong great. I'm no professional but maybe you could put some thought into what you eat. I developed fast food addiction not so long ago but what really helped me was to make myself be aware by reassurance. I used to eat so much fastfood because I thought that I was  \"losing\" to something, then I tried reassuring myself whenever there was food infront of me that :\n\n\"  I'm not competing, it's eating— a basic requirement of living\" and that \"my whole world does not revolve around food, I have the power to control myself\"\n\nAlso, working out is a need. Start small and then just gradually build your workouts up.\n\nIt's also a good idea that when you're trying to avoid certain things or start on certain things, you have to have a good reason \"Why\" like:\n\n\"I'm gonna start exercising because I wanna be there for my loved ones\" instead of \"I'm gonna start exercising because I just feel bad because people make me feel bad.\"\n\nGoodluck! I'm rooting for you.",
      "created_utc": 1608995998.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gh2e09h",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1608983505.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gh2jdzn",
      "author": "LornWarbler",
      "body": "Couldn't have said it better, this ^",
      "created_utc": 1608989494.0,
      "score": 4,
      "context": [
        {
          "id": "gh2flav",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1608985473.0
        }
      ]
    }
  ]
}