{
  "id": "kl81a8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1609091935.0,
  "title": "Request: I just can’t put food into my mouth",
  "selftext": "I’m hungry, I can see my weight going down, I know it’s not good, I like food, I want to eat. But, I’m afraid of food, my stomach hurts when I eat, my stomach does like when there is food in there, I get diarrhea when I eat, I occasionally want to vomit when I eat. It is a recurring issue, happens like a cycle, few weeks fine, few weeks huge weight drop. It wasn’t a huge thing when I was younger, I have always been underweight and I have always been know as the person who doesn’t eat. I can go off not eating for days if I’m not forced to. But I was a kid, I have other disorders and I was paired with a kind of meds that makes me want to eat. Few years ago, my family moved and I no longer take any meds or see any professionals. This time, it came back worst, the process sounds like food poisoning, but I’m sure I can’t get food poisoning from all food I consume everyday one meal a day for 3 days. My parents, eating the same food, were fine \n\nMy parents doesn’t believe in eating disorders. How should I get help while being a minor? Who should I go to? What can I do to fight it?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kl81a8/request_i_just_cant_put_food_into_my_mouth/",
  "score": 40,
  "num_comments": 11,
  "comments": [
    {
      "id": "gh865nh",
      "author": "Ok-Tell8768",
      "body": "this sounds like it could be ARFID i’m not super educated on it but it’s possible that’s what you’re experiencing. you can research child and youth mental health centres near you to find free counselling and resources, i hope this helped🖤",
      "created_utc": 1609107218.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gh8bv81",
      "author": "sinawai",
      "body": "It sounds like you also have some gastrointestinal issues you should look at\n\nIf you get those figured out it would also help with your ed recovery given that you won't have as many food deterrents \n\nIf you can see a psychiatrist and want to get medication you don't have to tell your parents about taking medication, I didn't, they never noticed",
      "created_utc": 1609110176.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gh7jr5h",
      "author": "Deep-Dig-9345",
      "body": "Omg I relate to everything u said! It's so difficult... if u wanna talk I'm right here :)",
      "created_utc": 1609095886.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gh8g9qo",
      "author": "Ambystomatigrinum",
      "body": "Obviously nobody here can diagnosis you but I experienced this for a long time. It turns out the severe pain I was experiencing was from several food allergies. It’s not 100% better, but now that I can avoid the specific foods that cause pain, I don’t have nearly as much fear about eating.  \nSeeing an allergist or doctor would be ideal, but if that’s out of reach, an elimination diet could still help. If you’re interested I’d be happy to explain what I did though it won’t work perfectly for everyone.",
      "created_utc": 1609112480.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gh8ifcj",
      "author": "itsalexroxin",
      "body": "my heart aches for you. i know exactly what you are trying to cope with. i feel like i'm in the same spot as you. like some other said, it sounds like AFRID. i'm sending you love and reminders that you are not alone and even though it's all digital, we are all here to support you.",
      "created_utc": 1609113596.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gh8xt56",
      "author": "Zelda_is_my_homegirl",
      "body": "This happened to me and I lost my gallbladder from the starvation. By the time I went to a gastroenterologist it had hardened part of my intestines. Please go to the doctor.",
      "created_utc": 1609121793.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gh7c0ej",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1609091935.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ghao7ty",
      "author": "klydsp",
      "body": "I was going to suggest this as well. I had a fear of food because of the physical issues that came along with eating. Come to find but I have Crohns. I still struggle with it everyday and it became, at its worst, like a competition to see how little I could eat. I started purging what I did eat. It was a problem that meds helped me to recover, mostly. \n\nI started Crohn's meds and also meds for my Bipolar which helped me start to eat healthy again. Therapists never did much to help me, but thats not the case for everyone. I just see a psychiatrist now for med adjustments.",
      "created_utc": 1609170565.0,
      "score": 3,
      "context": [
        {
          "id": "gh8bv81",
          "author": "sinawai",
          "body": "It sounds like you also have some gastrointestinal issues you should look at\n\nIf you get those figured out it would also help with your ed recovery given that you won't have as many food deterrents \n\nIf you can see a psychiatrist and want to get medication you don't have to tell your parents about taking medication, I didn't, they never noticed",
          "created_utc": 1609110176.0
        }
      ]
    },
    {
      "id": "gh9wens",
      "author": "None",
      "body": "(This is my post) \n\n I never knew this can happen. I often think that the worst that could happen is a weaker body for a few weeks before I get back to wanting to eat. I never knew it can get that serious. Thank you for informing me of this.",
      "created_utc": 1609146814.0,
      "score": 1,
      "context": [
        {
          "id": "gh8xt56",
          "author": "Zelda_is_my_homegirl",
          "body": "This happened to me and I lost my gallbladder from the starvation. By the time I went to a gastroenterologist it had hardened part of my intestines. Please go to the doctor.",
          "created_utc": 1609121793.0
        }
      ]
    },
    {
      "id": "gqqj6x7",
      "author": "sinawai",
      "body": "I was thinking about something like this earlier. \n\nI just had my wisdom teeth removed, and I think before I got into recovery I would have been happy about how difficult it is to eat so that I would have another block to eating. \n\nToday in my recovery that is not the case. I'm actually very upset that it is difficult to eat, not an experience I had expected to have in my life about a year ago. I'm very happy about this shift in how I think about food. I never before thought I could trust my body again - which is of course a symptom of ED.",
      "created_utc": 1615585687.0,
      "score": 1,
      "context": [
        {
          "id": "gh8bv81",
          "author": "sinawai",
          "body": "It sounds like you also have some gastrointestinal issues you should look at\n\nIf you get those figured out it would also help with your ed recovery given that you won't have as many food deterrents \n\nIf you can see a psychiatrist and want to get medication you don't have to tell your parents about taking medication, I didn't, they never noticed",
          "created_utc": 1609110176.0
        },
        {
          "id": "ghao7ty",
          "author": "klydsp",
          "body": "I was going to suggest this as well. I had a fear of food because of the physical issues that came along with eating. Come to find but I have Crohns. I still struggle with it everyday and it became, at its worst, like a competition to see how little I could eat. I started purging what I did eat. It was a problem that meds helped me to recover, mostly. \n\nI started Crohn's meds and also meds for my Bipolar which helped me start to eat healthy again. Therapists never did much to help me, but thats not the case for everyone. I just see a psychiatrist now for med adjustments.",
          "created_utc": 1609170565.0
        }
      ]
    },
    {
      "id": "ghcc0u9",
      "author": "Zelda_is_my_homegirl",
      "body": "I didn’t know either. I’ve always struggled with starving myself on and off even though I am overweight so I never took starving/calorie cutting seriously. \n\nThere is another story similar except the woman experienced left ventricle (heart) failure as a result. \n\nI hope you get some care! Wishing you well!",
      "created_utc": 1609201787.0,
      "score": 3,
      "context": [
        {
          "id": "gh8xt56",
          "author": "Zelda_is_my_homegirl",
          "body": "This happened to me and I lost my gallbladder from the starvation. By the time I went to a gastroenterologist it had hardened part of my intestines. Please go to the doctor.",
          "created_utc": 1609121793.0
        },
        {
          "id": "gh9wens",
          "author": "None",
          "body": "(This is my post) \n\n I never knew this can happen. I often think that the worst that could happen is a weaker body for a few weeks before I get back to wanting to eat. I never knew it can get that serious. Thank you for informing me of this.",
          "created_utc": 1609146814.0
        }
      ]
    }
  ]
}