{
  "id": "kmdut5",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1609246354.0,
  "title": "Request: festive binge gain feel so guilty",
  "selftext": "Stopped tracking cals for the past 2 weeks I used the excuae of \"it's christmas\". I have been over eating and binging so bad having fast food every day and snacking constant in between. Feel so depressed today decided enough is enough and stepped on the scale i am almost a stone heavier than 2 weeks ago i knew it would be bad but not that much. I don't know why i do this to myself i wish i had control. Now i know the next few weeks will be me restricting myself to take away the guilt. I HATE THIS TIME OF YEAR! What are the chances a good chunk of the gain is water weight i really hope so",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kmdut5/request_festive_binge_gain_feel_so_guilty/",
  "score": 54,
  "num_comments": 10,
  "comments": [
    {
      "id": "ghe17v1",
      "author": "birdie0495",
      "body": "there's a huge chance it's just water weight! jut breathe, hug your body, take a walk even if its chilly bundle up, eat fresh fruit a lot, treat yourself to a bunch of yummy fresh fruit!! it'll energize you and its so yummy :) raspberries always cheer me up. and if you love sweets like me get some Theo dark chocolate for yourself for throughout the day or at night. treat yourself to some coconut water and sunlight exposure whenever you can :) you'll be okay. your body will start to feel better and healthier and lighter once you start to be kinder to it and gentle with yourself.",
      "created_utc": 1609247811.0,
      "score": 23,
      "context": []
    },
    {
      "id": "ghga5ry",
      "author": "jeabgrenouille",
      "body": "Indeed lots is water, glycogen, and food weight. I don't know if you need to hear this, but gaining weight is not a moral thing. You are not bad for eating more. You deserve compassion (from yourself) and happiness, and you deserve to be able to enjoy food around the holidays. \n\nYou do not need to restrict. You do not need to be punished for enjoying good food ever. \n\nIf you want to feel better, you know that restriction will not really do that. Restriction unequivocally makes us unhappy and it leads to us feeling like failures when we cannot maintain that restriction.\n\nPlease just think of one thing that you can do tomorrow that will genuinely make you feel proud of yourself. Something small and attainable to assure you succeed. Restriction is not that, I assure you. You can go for a walk with someone if possible) not to burn calories but to get fresh air), or spend time doing your favorite thing (puzzle, dance, game, favourite tv show, whatever), or drink some water, or eat a vegetable with one meal. \n\nYou know you need to eat consistently and not doing so will not help at all.",
      "created_utc": 1609290724.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ghestf5",
      "author": "None",
      "body": "Hey! So when I get into the mindset of the holidays, I started to relax when I accepted there’s going to be a lot more eating just because of meals. I stopped denying myself that third cookie or second plate of mashed potatoes because that’s what I wanted to celebrate. This year I splurged on Christmas Eve all day and Christmas dinner. But when those expected arranged meals were over, I made sure to go right back to my standard well rounded meals because in the long run it’s about consistency. If I had left overs, I’d make them into meal preps with additional Whole Foods (so say ham, mashed potatoes, half an apple and raw bell pepper) to make a balance without food going to waste. \n\nThat said, that’s what works for me. Find a routine for the holidays that helps you maintain healthy habits so you can splurge without the guilt, whether that’s meal prepping in advance, meal prepping leftovers, or have a conversation with yourself about what the line is for indulging versus binging. \n\nThat said, please don’t restrict after the holidays! Even if you gained weight, restricting will only cause harm to your body if it’s being bounced back and forth between binging and restricting. It’s okay to feel guilty, it’s okay to be unhappy about weight gain. But it’s not permanent and as long as you have a consistent meal/exercise schedule that *works for you* this is only blip.",
      "created_utc": 1609263702.0,
      "score": 9,
      "context": []
    },
    {
      "id": "ghf04ul",
      "author": "newo314",
      "body": "I feel this! What’s helped me is knowing that I won’t be eating all these fun and festive foods forever, I’ve lost the 5-10 lbs I’ve put on before, and once the holidays are over I won’t be as sedentary as I’ve been. \n\nI had a minor freakout at the doctor yesterday when they weighed me. I was 8 pounds heavier than I was 2 weeks ago! But, I had to rationalize with myself: I was wearing clothes, shoes, my purse, and a winter jacket, I had my phone and smart watch on me, and it was the end of the day. Taking all this into account really talked me off the ledge. It might help you too!",
      "created_utc": 1609267302.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ghewqur",
      "author": "twitchgirl98",
      "body": "Hey, I’m going through the same thing right now. I caved today and weighed myself and practically threw up on the spot because I’m almost 2kg heavier then I was before Christmas. \n\nFrom what everyone is telling me, the water weight/retention could last for about 2 weeks until your body goes back to its usual weight. We just have to wait it out while making sure we don’t restrict or harm ourselves! And do know that ur not in this alone. January is gonna be a toughy",
      "created_utc": 1609265648.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gheb339",
      "author": "None",
      "body": "Drinks lots of water and eat a lot of watermelon! It's very well likely that this is just fluid retention.",
      "created_utc": 1609254481.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ghg71ti",
      "author": "Garbage_Patch_Kid",
      "body": "I know the holidays are so rough but you are doing great. You enjoyed yummy holiday food and there is nothing wrong with that. And your body may be holding onto some weight but that’s okay too, it’s all part of healing from restriction. Your body is trying to protect you from starvation, it’s trying to help you survive. \n\nThat being said, you have a choice now. You can restrict and go through this cycle again, maybe lose the weight, maintain control, but would you be happy? Breaking the cycle is hard and scary but it’s the only way to heal. \n\nWishing you the best. You are doing great, even if it doesn’t feel like it!",
      "created_utc": 1609289107.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghdzgko",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1609246355.0,
      "score": 0,
      "context": []
    },
    {
      "id": "ghfvyyt",
      "author": "Bree-P123",
      "body": "It’s totally okay to bloat and gain weight during the holidays! I feel you! I have had a hard time these few weeks too. I just have to take a breath and remind myself that whatever I eat isn’t going to effect me long term. You can always get back to exercising and eating what you normally would after the holidays :) Give yourself some grace. It’s good to have breaks and it’s healthy! I agree with everyone else saying it’s water weight too. We forget to drink water during the holidays. \nKeep on going!!! You can do it!!!",
      "created_utc": 1609283207.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ghhebqa",
      "author": "edie43",
      "body": "> gaining weight is not a moral thing. \n\nI really needed to hear this.",
      "created_utc": 1609317292.0,
      "score": 2,
      "context": [
        {
          "id": "ghga5ry",
          "author": "jeabgrenouille",
          "body": "Indeed lots is water, glycogen, and food weight. I don't know if you need to hear this, but gaining weight is not a moral thing. You are not bad for eating more. You deserve compassion (from yourself) and happiness, and you deserve to be able to enjoy food around the holidays. \n\nYou do not need to restrict. You do not need to be punished for enjoying good food ever. \n\nIf you want to feel better, you know that restriction will not really do that. Restriction unequivocally makes us unhappy and it leads to us feeling like failures when we cannot maintain that restriction.\n\nPlease just think of one thing that you can do tomorrow that will genuinely make you feel proud of yourself. Something small and attainable to assure you succeed. Restriction is not that, I assure you. You can go for a walk with someone if possible) not to burn calories but to get fresh air), or spend time doing your favorite thing (puzzle, dance, game, favourite tv show, whatever), or drink some water, or eat a vegetable with one meal. \n\nYou know you need to eat consistently and not doing so will not help at all.",
          "created_utc": 1609290724.0
        }
      ]
    }
  ]
}