{
  "id": "knfged",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1609377028.0,
  "title": "Request: Seeking advice on dealing with body insecurity with boyfriend",
  "selftext": "As background, I am currently 25 (f) and I’ve always had a relatively unhealthy relationship with food and frequently have done very restrictive diets for short periods of time then gained weight back and repeated this cycle starting from when I was around 12. After college I gained more weight and I was never super overweight but just on the thicker side- like at the max weight for a “healthy” BMI. This year I decided I wanted to get back in shape and started dieting in Jan. It was up and down until May when a flip switched and I really committed to it. First I started restricting my eating which I was used to, then I started running ~6 miles per day 5 times a week, and then I eventually started purging about 1-2 times a week. I was the thinnest I’d been in my life and I met my current boyfriend during this period. Fast forward to now and I’ve relaxed more with food intake but I’ve gained weight over the holidays and haven’t been exercising regularly since October so my muscle has gone. My boyfriend is in great shape and just values a healthy lifestyle overall which makes me feel like he expects me to be skinny and in shape. Especially since I met him when I was thinner, I can’t help but feel like he must not be as attracted to me now and I’m really letting it get into my head and it’s affecting how I act towards him because I’m always feeling down about it now. He has never said anything to make me think like this and tells me I’m beautiful but all his ex girlfriends were very thin and I see him liking girls pictures with perfect bodies so it gets in my head that my body isn’t good enough for him. I’ve been starting to obsess over my weight again this week and have started to restrict eating and start running again. I was wondering if anyone has had this kind of experience and what did you do to regain confidence without going back down that path? I don’t know whether to let him know how I’m feeling but I’m terrified if I bring it up he would say something to confirm what I’ve been thinking in my head and make things even worse. He has no idea about my unhealthy relationship with food or body issues so I don’t really want to tell him about it.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/knfged/request_seeking_advice_on_dealing_with_body/",
  "score": 39,
  "num_comments": 8,
  "comments": [
    {
      "id": "ghk6rke",
      "author": "newo314",
      "body": "I'm so sorry you're experiencing all of this. It's a lot of different hard feelings, on top of the pandemic. I'm in the same boat of feeling bad about myself/my body after all the holiday goodies. What has helped me not go completely crazy is knowing that the holiday season is just that: a season. It, and along with all the fun foods and sedentary lifestyle, will not last. Giving myself grace during this period has helped me a whole lot (and not inspecting my body in the mirror has helped a ton!).   \n\n\nAs far as your boyfriend goes, I would absolutely tell him how you feel! If you see this man as a long-term guy, holding important things back will only hinder any future you two have. And, if he ever says \"your body isn't good enough for me,\" than his brain and soul aren't good enough for you. I totally understand that there has to be an initial attraction, but your body (and his) aren't always going to fit society's standard of beauty.   \n\n\nGood luck!! You are stronger than you think!",
      "created_utc": 1609378108.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ghk94n1",
      "author": "None",
      "body": "Hey! I completely understand and can relate to your issues with food and how you just be feeling right now. So please don’t think you’re alone.\n\nFirstly, please don’t compare yourself to his ex partners. Your boyfriend is with YOU right now, meaning he likes YOU and wants to be in a relationship with YOU. If he has not said anything about your body or weight to you, then you have nothing to worry about. I know you said you got together when you had a more active lifestyle, but he is still with you after your weight gain—it shows that he truly cares for you and did not just get with you for your thinness. Having said that, he shouldn’t be telling you what your body looks like anyway or imposing any expectations on you. That would not be sign of a healthy, mutually respectful relationship. \n\nI also think you need to have a conversation with your boyfriend about how your weight gain and your relationship with food is bothering you. It won’t be easy, but it’s important to share your concerns with your partner especially if they seem to be affecting you emotionally. It does not necessarily mean he’ll turn around and tell you that he dislikes your body now to confirm your worst fears. Based on what you’ve said about him, I am sure he will listen patiently to what you have to say and have empathy for you—remember, even the most fittest of people had to start from somewhere. He might even have experienced what you’re feeling to some level, and it might be really helpful for you to share this. \n\nWith regards to him liking other girls’ pictures, social media is an endless feed of continuous visuals and we have become so used to just double-tapping to like everyone’s pictures (soz hope I don’t sound like a boomer lol). This does not necessarily mean he lusts after those girls and their bodies, or that he desperately wishes you had their body instead.\n\nI hope this is helpful. Good luck, OP.",
      "created_utc": 1609379325.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ghk9ih7",
      "author": "ilikebigbooks98765",
      "body": "I'm sorry I don't really have any advice, but I just wanted to let you know you aren't alone. I'm in pretty much the exact same situation with my boyfriend and unsure of how to broach the subject of my ED with him or if I even want to. It's hard because I find myself restricting and going back to my unhealthy ED mindset when I'm with him because I'm terrified of gaining weight (he has repeatedly said he's attracted to really skinny girls). I know it's not good for my mental health or our relationship to keep it bottled up, but I'm also scared to talk to him about it because I'm afraid he'll judge me or think I'm stupid or something.",
      "created_utc": 1609379524.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ghk66wj",
      "author": "Ursupremacy",
      "body": "What you are facing is one of my biggest fears, I’m currently not in shape but I am also afraid of not being attractive enough due my weight. Maybe you should talk to him because the reality is that your weight will fluctuate because you are either going to get pregnant or your metabolism will slow down. Ask him if for him it is a deal breaker and if it is maybe you shouldn’t be with him.",
      "created_utc": 1609377817.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ghk4o0z",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1609377028.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ghkzobh",
      "author": "Babygirl_charliexxx",
      "body": "Oh my god I am in exactly the same situation as you! My boyfriend is into the gym and has got me into it. With all of the lockdowns my mental health has been absolutely everywhere, triggering my anorexia (even though I had been ok for 2 years). Since last lockdown my mindset completely changed and I have been hammering the gym and eating protein to gain weight and get strong again but obviously that means I have put weight on. My boyfriend is actually into girls with a more toned and strong look but I feel so crappy seeing the scales go up. He reassures me that he actually is much happier and fancies me more when I look healthy and strong but I can’t help but be insecure. All I’m trying to do is stay in this positive mindset and tell myself that I could double in size and he would still love me (I mean, I won’t let that happen haha).\n\nJust keep your head up and try and turn yourself into someone who values being healthy and strong, for yourself and your relationship!",
      "created_utc": 1609394935.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ghlg7u9",
      "author": "cococollegefit",
      "body": "Hi ! \n\nFirst off, so sorry you’re dealing with this, it’s incredibly stressful and all the feelings you have about it are completely valid. I was in a very similar situation where I met a boyfriend in the peak of my restriction and disordered eating. While I was thin, I wasn’t healthy. Meanwhile, he was the gym 6x a week, macro counting, body building type. Very confident. What I found was that when I opened up about feeling self conscious about gaining weight back in recovery, he was genuinely proud of me for overcoming the disordered behaviors and getting healthy, even if that meant gaining some weight. Skinny does not always equal healthy, and as someone who values health, I think chances are he cares more about your health than measurements. And as others have said, if he isn’t supportive and kind in this situation, you deserve a better man!! Best of luck !",
      "created_utc": 1609410945.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ghmi9ax",
      "author": "ergotofwhy",
      "body": "Every time I've ever felt this, it has turned out to be projection on my end. Our disorders (mine at least) distort our views of ourselves, and it distorts how we _think_ other people see us as well. \n\nI'm sorry you're feeling these things. It's a shitty experience :/",
      "created_utc": 1609437025.0,
      "score": 1,
      "context": []
    }
  ]
}