{
  "id": "kok686",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1609538626.0,
  "title": "Request: help, I wanna relapse",
  "selftext": "hi, I'm a 17 year old girl who has struggled with distored eating and ED behaviours (symptoms of anorexia yet I'm undiagnosed bcoz my parents don't believe in mental health ;;--;; ) since I was 12. 2018-2020 was the peak of my eating disorder and it was awful. Calorie counting, exercising till I felt like death, brain fog, refusing food, the familiar gut tugging feeling of your stomach contracting from lack of food, lapse in concentration. I shudder to think of it now.\nEven though now I'm sorta doing better, I stopped counting and I've faced my fear foods alot and am eating now in a unrestricted manner, I absolutely detest how I look. I know I've gained weight (I used to be really underweight but now I'm legit borderline healthy and I hate it). I hate weight gain so much, the way my face is puffy, the way that I can see every single pound I've gained in my face, stomach, arms, legs. It's a nightmare. I want to go back to my restriction, back to my calorie counter, back to my friend ana because even though I may be romanticising how I was before, it's better than this. \nWhat's even weirder is I've tried going back in my old habits but they don't work??? I can't commit?? And I hate that about me, it's a betrayal. I can't go back to how I was and it's so hard for me to find the motivation to continue.\n\nToday is the first day of the new year. I really want to end this negativity. If any of you have tips for getting over weight gain, refeeding syndrome, acceptance, remaining thin but also being healthy please let me know. I'm really struggling atm and I could use some help <3 \nI hope everyone else is doing okay.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kok686/request_help_i_wanna_relapse/",
  "score": 54,
  "num_comments": 11,
  "comments": [
    {
      "id": "ghrlhet",
      "author": "None",
      "body": "i am going through the EXACT same issues right now. Just know you aren’t alone and it looks like this is a very common occurrence in recovery. Let’s keep pushing through! We got this .",
      "created_utc": 1609539532.0,
      "score": 24,
      "context": []
    },
    {
      "id": "ghrlzso",
      "author": "MysticalWateryEye",
      "body": "The romanticizing of our eating disorders is unfortunately not unusual, and unfortunately, because it is a mental illness, there will be days like these and it sucks. So let's realize that this will unfortunately happen from time to time until you get that ED voice quieter and quieter. \n\nYou have to remind yourself of the negatives, the impact it has on your body, so that even if you did give back into your ED, you wouldn't be able to enjoy it, because there is nothing enjoyable about it, remember that? did you ever feel like \"ah yes! my body is perfect\" during your ED, ???? so why.... would you want to go back to that? (stuff i have to remind myself). Honest questions to continue to drill into your psyche.\n\nWas i happy? and if i was could i actually enjoy it in the moment? instead of fanaticizing about it years later?\n\nwas i able to concentrate? \n\nThe thoughts i have of food right now, and feeling that i'm spending too much time obsessing over / next meal/ what i just ate/ etc, any worse than when i was in the middle of my ED? and if so, when i thought about food when i had an ED was there ANY pleasure from it? or was it all just shame, guilt and fear? \n\nI know all of this might sound weird, but that's just some stuff you have to remind yourself, is the energy it takes from you to \"return\" to it, could be better spent towards self acceptance, or towards feeling just plain \"i'm okay\". and the \"i'm okay, not completely happy, but i'm able to not self loathe for 22 hrs of the day\" or whatever.... \n\nI fucked my body up each time i returned to ED, and it got me nowhere but a lot of chronic health problems and some old photos of myself where i look emotionally void. \n\nThen there's reminding yourself that no matter what, returning to the ED won't make you any happier, because it doesn't work that way, ED's thrive on control, misery and making you exhausted 24/7. \n\nI hope you continue to choose recovery, i wish you could get professional help, if you are still a student you can always try to contact the guidance counselor if possible, you shouldn't have to struggle alone, you've made SUCH improvements, and you've done so so much towards your own recovery, and that is AMAZING, can you give yourself some credit for fighting ED alone? but you don't have to be doing that alone, there's helplines, etc, and even just writing here is helping you lift some of that ED pressure.",
      "created_utc": 1609539799.0,
      "score": 17,
      "context": []
    },
    {
      "id": "ghrv2h4",
      "author": "Low-Euphoric",
      "body": "Hey, I’m so glad you’re seeking help instead of just perpetuating the cycle, that means you’re trying, and it makes all the difference. You should be very proud of yourself for that taking into account what you’ve been through. \n\nI relate to what you say so much. From the frustration of not being able to “commit” to\nold habits again, to rejecting the weight gain even though it’s better for you. The difficulty of going back to anorexia is very common. Actually after restricting for months, I started binging much more often, because my brain was trying to compensate for the restriction. It lead to purging (which I have been free of for about 5 months). I stopped binging when I stopped trying to stop binging, and it took a while but I got where I am now, so I know it was necessary for me to gain weight in order to understand that I don’t need to find myself beautiful to love myself. This is the most important thing I’ve learned by far this year; because of my low self esteem I probably won’t find myself attractive, but that shouldn’t stop me from caring for myself because I am more than my looks. Maybe this applies to you too? Sending you a lot of love your way, you are worthy of it whether you believe it or not, I wish you the best on your path to recovery. DM me if you want to vent, I’m here to listen ❤️",
      "created_utc": 1609544784.0,
      "score": 8,
      "context": []
    },
    {
      "id": "ghrksmk",
      "author": "cursedatmsu",
      "body": "I don’t have any tips but I’m struggling with the same issues you are, if you ever wanna talk my DMs are open💕",
      "created_utc": 1609539168.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ghrwl8y",
      "author": "SquargyBoi",
      "body": "Hey, I'm sorry you're going through this - ana is a stubborn bitch that will always tempt you back to old habits. I understand how you are feeling, and in a similar position.\n\nFirstly I think it is brilliant that you recognise that you want to relapse and are struggling and that you're talking about it here - accountability is so important and I'm proud of you! And I'm sorry that your family is unsupportive, but we are here for you!\n\nThis disorder will always romanticise being unwell, convince you that you looked better, you felt better, you were more in control.\n\nYou've said that you used to excersie until you felt like death and how you shudder to think about it now. Cling onto that feeling  - that is the reality of relapse. \n\nYou say that you feel like a failure for not being able to engage in old habits but I see that as the complete opposite - despite how you feel about yourself, and what ana is telling you, your strength to recover is stronger. Don't let ana tell you that is a sign of weakness it's shows an amazing amount of strength\n\nIn no way am I saying that is just as easy to think how bad you felt and carry on, and I understand that parts of your actions won't be in control. It's totally okay to struggle, to battle with these difficult and conflicting feelings, to prefer how you used to look and to take a few steps back in recovery. The important thing is that you keep picking yourself back up and try aim for recovery, keep talking about your struggles and celebrate every victory, no matter how small\n\nI believe in you, and believe that you can recover! I promise you that all this hard work will be worth it 💖",
      "created_utc": 1609545630.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ghszmdi",
      "author": "godofsweetpotato",
      "body": "There is no solution - I've had ED for ten years now and I never feel like I'm ever back to my 17 year old self, pre-ED. The good news though is that you don't have to be back to yourself pre-ED. You can be an even better version of every version of yourself so far.\n\nThat being said, you have to tough it through and eat healthier for yourself. It's SO tempting to relapse because that's what you're comfortable with but you know it isn't good for yourself at all! Don't seek to go back, please. Find a more comfortable eating method if that helps instead.\n\nYou are accepted and OK no matter your weight. You just have to learn to accept yourself. Very difficult process, but you have to. The only way through this is YOU! You can do it. Sending love and strength your way.",
      "created_utc": 1609568600.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ghtjn61",
      "author": "khaleesijune",
      "body": "I haven’t heard anyone else explain it in a way that made sense to me until now but this is something that I’ve been “wanting” to do too. I know it’s not healthy and I don’t want to go back to having a full blow eating disorder but I’ve gained a TON of weight since I recovered and I miss my eating disorder weight. I’ve tried going back to those habits but it’ll last a few days then I go back to regular/binging. \n\n“Can’t commit” summed it up quite well. \n\nI also struggle with starting any weight loss methods due to how easily a healthy way of loosing weight will turn into an obsession and right back into a ED for me. \n\nAnywho, know that weight doesn’t define us. We will always want to look better and have a different weight idea in mind but weight doesn’t equal happiness. No matter how bad our brain tried to tell us differently",
      "created_utc": 1609588698.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ghrjr5x",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1609538626.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gikx4vz",
      "author": "simberbimber",
      "body": "I haven’t read through the comments yet, but I’ve been lurking on this sub for the last few minutes because I’ve been feeling the same. \n\nWhat you said about seeing every single pound gained in your face, stomach, let’s - I see it too in mine. Especially the puffiness in your face. I literally just texted my best friend I feel like my face looks puffy. \n\nI’m at a healthy weight, that much I know, and I eat the three meals a day, all that. It’s a BIG deal I don’t skip meals or restrict like I used to - that’s a victory for me. \n\nBut I feel myself relapsing more in my thoughts. And I struggle when I’m at work (I work at a coffee shop) and see a girl come in who is the “thinness” I used to be. Again, I see in my head I’m not fat by any means, nor am I even close to being fat. \n\nBut I’ve begun to recognize my triggers are say when my old roommate would complain about her weight (who was a bit bigger than I) or my boyfriend about him eating “bad” food that day when I literally ate the same thing. \n\nI’m not sure if this helps, by providing personal experience, but if I may, here are some thoughts: \n\nGo for walks once a day, just so you feel like you’re moving around and not feeling stagnant on the couch or bed. \n\nAs for food, know your comfort foods and which ones are fueling to your body and which feel heavy (for instance, I just truly do not enjoy pasta, whereas maybe pancakes - both carbs, mind you - make me happy). \n\nMy bf says this mantra - “everything in moderation is good.” For literally everything in our lives. So where restricting is concerned, what’s helped me is when that very loud thought comes through my head that I should restrict, I say to myself that mantra, and then decide if it’ll make me feel nourished. \n\nIf I’m deeply craving something, I’ll get it. If I’m craving something but I’ve felt heavy and lethargic from the week if I haven’t eaten all the healthy foods, I decide to do something lighter feeling - again, the balance.",
      "created_utc": 1610138355.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ghrmc7d",
      "author": "MysticalWateryEye",
      "body": "OH! i forgot.\n\nWhen you are in recovery, your body is going to be doing some funky stuff! it's just what it does, it is finally getting food again, so it retains things for awhile, before making sure it's going to be consistently receiving food and nutrients, so bloating, face puffy all normal, including some AWFUL bowel movements. \n\nYour body is trying to readjust, and everyone recovers differently and bodies vary, but a lot of the puffiness is finally getting nutrients and trying to send them to all the right locations, then things will eventually settle. \n\nBut if anything is painful or unusual of course talk to a doctor! please!",
      "created_utc": 1609539985.0,
      "score": 10,
      "context": [
        {
          "id": "ghrlzso",
          "author": "MysticalWateryEye",
          "body": "The romanticizing of our eating disorders is unfortunately not unusual, and unfortunately, because it is a mental illness, there will be days like these and it sucks. So let's realize that this will unfortunately happen from time to time until you get that ED voice quieter and quieter. \n\nYou have to remind yourself of the negatives, the impact it has on your body, so that even if you did give back into your ED, you wouldn't be able to enjoy it, because there is nothing enjoyable about it, remember that? did you ever feel like \"ah yes! my body is perfect\" during your ED, ???? so why.... would you want to go back to that? (stuff i have to remind myself). Honest questions to continue to drill into your psyche.\n\nWas i happy? and if i was could i actually enjoy it in the moment? instead of fanaticizing about it years later?\n\nwas i able to concentrate? \n\nThe thoughts i have of food right now, and feeling that i'm spending too much time obsessing over / next meal/ what i just ate/ etc, any worse than when i was in the middle of my ED? and if so, when i thought about food when i had an ED was there ANY pleasure from it? or was it all just shame, guilt and fear? \n\nI know all of this might sound weird, but that's just some stuff you have to remind yourself, is the energy it takes from you to \"return\" to it, could be better spent towards self acceptance, or towards feeling just plain \"i'm okay\". and the \"i'm okay, not completely happy, but i'm able to not self loathe for 22 hrs of the day\" or whatever.... \n\nI fucked my body up each time i returned to ED, and it got me nowhere but a lot of chronic health problems and some old photos of myself where i look emotionally void. \n\nThen there's reminding yourself that no matter what, returning to the ED won't make you any happier, because it doesn't work that way, ED's thrive on control, misery and making you exhausted 24/7. \n\nI hope you continue to choose recovery, i wish you could get professional help, if you are still a student you can always try to contact the guidance counselor if possible, you shouldn't have to struggle alone, you've made SUCH improvements, and you've done so so much towards your own recovery, and that is AMAZING, can you give yourself some credit for fighting ED alone? but you don't have to be doing that alone, there's helplines, etc, and even just writing here is helping you lift some of that ED pressure.",
          "created_utc": 1609539799.0
        }
      ]
    },
    {
      "id": "ghtjqs7",
      "author": "khaleesijune",
      "body": "Love this.",
      "created_utc": 1609588803.0,
      "score": 3,
      "context": [
        {
          "id": "ghrlzso",
          "author": "MysticalWateryEye",
          "body": "The romanticizing of our eating disorders is unfortunately not unusual, and unfortunately, because it is a mental illness, there will be days like these and it sucks. So let's realize that this will unfortunately happen from time to time until you get that ED voice quieter and quieter. \n\nYou have to remind yourself of the negatives, the impact it has on your body, so that even if you did give back into your ED, you wouldn't be able to enjoy it, because there is nothing enjoyable about it, remember that? did you ever feel like \"ah yes! my body is perfect\" during your ED, ???? so why.... would you want to go back to that? (stuff i have to remind myself). Honest questions to continue to drill into your psyche.\n\nWas i happy? and if i was could i actually enjoy it in the moment? instead of fanaticizing about it years later?\n\nwas i able to concentrate? \n\nThe thoughts i have of food right now, and feeling that i'm spending too much time obsessing over / next meal/ what i just ate/ etc, any worse than when i was in the middle of my ED? and if so, when i thought about food when i had an ED was there ANY pleasure from it? or was it all just shame, guilt and fear? \n\nI know all of this might sound weird, but that's just some stuff you have to remind yourself, is the energy it takes from you to \"return\" to it, could be better spent towards self acceptance, or towards feeling just plain \"i'm okay\". and the \"i'm okay, not completely happy, but i'm able to not self loathe for 22 hrs of the day\" or whatever.... \n\nI fucked my body up each time i returned to ED, and it got me nowhere but a lot of chronic health problems and some old photos of myself where i look emotionally void. \n\nThen there's reminding yourself that no matter what, returning to the ED won't make you any happier, because it doesn't work that way, ED's thrive on control, misery and making you exhausted 24/7. \n\nI hope you continue to choose recovery, i wish you could get professional help, if you are still a student you can always try to contact the guidance counselor if possible, you shouldn't have to struggle alone, you've made SUCH improvements, and you've done so so much towards your own recovery, and that is AMAZING, can you give yourself some credit for fighting ED alone? but you don't have to be doing that alone, there's helplines, etc, and even just writing here is helping you lift some of that ED pressure.",
          "created_utc": 1609539799.0
        }
      ]
    }
  ]
}