{
  "id": "krlixt",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1609929927.0,
  "title": "Request: What can I tell my girlfriend when she’s going through rough days?",
  "selftext": "Hey everyone,\n\n&#x200B;\n\nI’ve been with my girlfriend for 8 months now and we love each other very much, but early on into talking she made it clear that he’s has mental issues and has fought with her ED for over a couple years now. She went through a massive weight change since over a year ago and has lost a lot of pounds but i’d rather not mention anything because I don’t want it to be triggering to anyone here.\n\n&#x200B;\n\nShe was obsessed with working out, counting calories, and losing weight in an unhealthy way and some days today can be worse than others. Sometimes she just doesn’t want to eat at all, some she worries about the repercussions, some days she seems fine and will enjoy her meals with me when we go out but i’m assuming those thoughts are still in her head. I just don’t want to push her into doing anything she doesn’t and thankfully she’s very comfortable with telling me about it.\n\n&#x200B;\n\nAt times, she’ll have bad days. A few days at a time where the voice is constantly in her head. She’s more than a body and she’s beautiful inside and out no matter what as i keep reminding her, and I know she knows that her body isn’t different to what she may be thinking in the moment, or that i would judge her which i’d never. I just want to know if there are any other things I could tell her at times when it’s bad or randomly to make her feel better. I try my best to console her and it works a lot of the time but I just want whats best. Thank you guys for everything.\n\n&#x200B;\n\nTLDR: What can I tell my girlfriend when she’s going through rough days and and struggling with her ED to console her? How do i make her feel better about herself sometimes, and can I?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/krlixt/request_what_can_i_tell_my_girlfriend_when_shes/",
  "score": 53,
  "num_comments": 19,
  "comments": [
    {
      "id": "giaj8r8",
      "author": "horsecockenergy",
      "body": "You seem like a really sweet partner. I would say keep going with telling her that her body doesn’t determine her worth, which usually is the recurring idea when someone has an eating disorder. Keep telling her that it’s okay to gain weight and that it doesn’t reflect on her as a person. Don’t focus too much on her looks but more of her worth, and don’t ever mention things like “you’ve gotten thinner” OR “you’ve gotten bigger”. Remove the stigma and anticipation of food, make it not a big deal  and don’t force her. Just be casual about it, teach her subtly that food is not a big deal and is to be enjoyed without worry. \n\nAgain, you seem like a really sweet person. Best of luck!",
      "created_utc": 1609930745.0,
      "score": 23,
      "context": []
    },
    {
      "id": "giajfq7",
      "author": "Babygirl_charliexxx",
      "body": "From my own experience of what I needed and still sometimes need from my boyfriend is just comforting but not in an obvious way. \n\nI struggled quite bad through one of the UK lockdowns and the gyms were closed, my mental health just went crazy. For two weeks I was in bed constantly, not moving or eating and I’m usually ok now (my focus has turned from bad eating habits to healthy ones weightlifting at the gym). \n\nMy boyfriend suggested doing fun things with food. Every weekend we set a weird cuisine we never tried before and made some traditional dishes from scratch. Granted sometimes they failed, but for me it was breaking that “all food is bad” mindset and we didn’t have to eat it, I was just having fun with my boyfriend. We bought matching aprons with dinosaurs on and played traditional music from the country while we cooked as well.\n\nInstead of focusing on her being sad and struggling, try suggesting things that’ll help in an indirect way. I hope I’ve helped, i know it’s really hard, I nearly caused my relationship to end. I really hope you two don’t end up in a circle of focusing on food all the time like we did. Good luck!",
      "created_utc": 1609930929.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gibxrdh",
      "author": "Me-thinks-I",
      "body": "Hey, so first thank you for asking and this is actually really really sweet of you. Because not everyone think about it and end up saying something triggering.\n\nSo onto the advices :\n-At all cost, and I mean AT ALL COST, refrain from giving her appearance related compliments. I know you mean we'll but when in recovery or simply on a bad day everything can be overturned by the Ed. \"You look beautiful\" May be translated as \"You look beautiful Now, but if you put on weight you wouldn't be anymore.\" it could even induce a relapse and a wish to loose weight again.\n-Ask her what she needs/wants\n-Let her vent, if she wants to anyways, stay open minded and listen to what she says, comfort her. This can make a huge difference\n-No food rated comments either (and this on a daily basis), because once again you may mean well but it has the opposite effect. \"You eat well\" or \"You're eating mroe that is good\" can be triggering comments.\n\nThat is all I cna think about :) And once again Bravo, you are an amazing boyfriend/girlfriend. I know dealing with an Ed is hard for people around Ed sufferers but I promise it can get better. One day it will be fine :) I hope the best for the two of you and have a lovely day!",
      "created_utc": 1609958850.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gibngl5",
      "author": "Low-Euphoric",
      "body": "Hey, I’m glad you’re looking for advice from a community that has experienced it firsthand. What has personally helped me the most is my bf making it clear that he was not judging me for any of it. No matter how worried you are for her health, never try to be controlling about her issues (« you shouldn’t do this, you know it’s not good for you » etc.) Make sure she knows you’re on her side, this means asking « could you tell me how I can help you? ». Validate her struggle, by telling her you understand why she would cope this way and that you love her no matter what, and that you’re willing to do what’s necessary to support her. Like I said, the most important is to make it clear you don’t judge her, no matter how mentally unhealthy she gets; shame is one of the biggest factors in an ED, so being loving to her while she feels the worst about herself can be very healing. \n\nReassure her when it gets bad that everything is temporary, and that many people who have suffered from the same problems have recovered, even after years of struggle. And that you will be holding her hand the whole time. Of course, only say those things if you mean it, because if you know you can’t handle it (which is totally understandable, it’s normal) then don’t commit like that. So if you do choose to commit, know that it won’t always be pretty and you have to learn how to be self nurturing. Also what you could do is research about her ED with her, it’ll show her you’re truly invested and have the best intentions towards her.\nHope this helps, wish you the best of luck, again thank you for taking her seriously.",
      "created_utc": 1609954313.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gic7t2i",
      "author": "None",
      "body": "For me, it is so comforting to know my BF loves me no matter my weight fluctuations. He’s def seen me as heavier and smaller and loves me just as hard. \n\nI’d be careful about commenting on her eating cause it can be triggering. This really depends on the person tho. For me, I feel very self conscious to receive praise about eating or any comment about the amount I’m eating. \n\nGet her her safe foods. She feel loved and understood. \n\nI think the best time to talk about eating disorder help is when I’m at rock bottom (sitting next to a toilet/purging), experiencing chest pains, ammenhorea, or just not around food. I feel desperate to get better when I’m at rock bottom but seldomly when I’m seeing weight loss.  \n\nI recommend expressing how scared it makes you feel to lose her but please don’t get her ultimatums to recover. EDs are an addiction/mental illness. We need support to get better.  Support her, not her illness. Ask her what you can do, what triggers her, what you can do to help her feel safe/loved. \n\nAlso, PLEASE don’t make it about weight. EDs aren’t just about being skinny. It’s about control a lot of the time and coping. I’d steer convos away from weight =/not = worth cause that’s triggering. Nobody wants to be told they’re just doing this to be skinny or for other people. This isn’t that simple.",
      "created_utc": 1609963316.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gickifq",
      "author": "deeforsaken1",
      "body": "As someone who has body dysmorphia and has struggled with an ED disorder for years, this is sweet.\nAnd some days with be hard as her partner, I know for sure have not made it easy on any of mine.\nI won’t eat most days, or I’ll eat but just once and pick or play with my food and not eat period, I’ve lost 50 over the past 4 yrs, but lost about 30-35 just in 2020. \nSo right now I feel weird in my skin.\nMy triggers are random, and I spiral down to absolutely hating everything about me, “my weight, my looks, the way my forehead looks, my toes look weird, I have no ass, my tummy is big”.\nThere will be days where she’ll push you away, don’t let her, hug her tight and be there for her on her bad days",
      "created_utc": 1609968700.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gicm4vr",
      "author": "ismybrainonthefritz",
      "body": "Sometimes it's more about the actions than the words.  For me, I've dealt with ED for many years and have lost a significand amount of weight in the last 2.  I'm finally at a healthy weight and struggling with body image issues.  My boyfriend doesn't always know the right things to say and he struggles with how to approach me about food.  BUT...he always knows how to touch.  He touches my stomach with its extra skin and folds, he caresses my flappy arms, he massages my wrinkly thighs.  There are so many things about me that are unattractive due to the effects of my ED and weight loss but he doesn't \"see\" all that.  He touches me and loves me in spite of all that.  So, my point here, is to touch her body\\* and reassure her with physical affection (all kinds - intimate, playful, casual) that you love her.  The more normalized you can make touch feel for her, the better she will feel about herself.\n\n\\*This should obviously be done with her consent, of course.",
      "created_utc": 1609969379.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gicxjw2",
      "author": "cjx888x",
      "body": "I think that a huge part of it is to help yourself learn how to adapt your language. Focus on learning how to speak about others in reference to who they are as a person, and not about their appearance. You can set the tone by not making bodies a topic of conversation, even about your own or the bodies of strangers. Talk about people as though their value isn’t attached to their body/appearance. You would be *shocked* how much of a difference it makes to be away from the toxicity of what is considered ‘normal’ to say about ourselves and other. \n\nIf you happen to feel very motivated to compliment somebodies appearance, go for something they had control/a choice over. Tell them you like their sweet new shoes/jacket/earrings/tattoo. Tell them their hair looks really cool the way they styled it that day. Tell them you love their style. \n\nWhen you are close with your girlfriend, you can compliment her smell, tell her you love the feeling of her skin against yours, that you love the way it feels to have your arms wrapped around her, the way it feels to have her hands against your skin. To heal, we need *new* experiences to connect with so we can lessen the connection with our old, unhealthy beliefs. Giving her language that drives home how it can feel to enjoy being present in your body and connecting with someone you trust who values you. \n\nFor me, having people try to ‘convince’ me that my body is fine, and they think I am beautiful, does absolutely nothing. Healing for me came from being physically close with people who genuinely believed in the value of my physical presence and the experience of my body in a way that was connected to intimacy, not beauty standards. \n\nTldr- I think everyone should stop trying to convince their girlfriend she is hot. Instead, work to change the culture of bodies.  We don’t need people to think we are beautiful. We need people to love and value who we really are, which is human.",
      "created_utc": 1609974342.0,
      "score": 2,
      "context": []
    },
    {
      "id": "giczkg7",
      "author": "Caterpillar978",
      "body": "from my experience, all you can really do is tell her that you love her and facilitate healthy working out or eating. it's a tough position to be in but you are not a doctor nor a therapist. good luck to you and your partner.",
      "created_utc": 1609975248.0,
      "score": 2,
      "context": []
    },
    {
      "id": "giaieft",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1609929927.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gic0c4j",
      "author": "Neemo53",
      "body": "This is OP btw, don’t mind using my public account. Thank you, that means a lot. Your words of advice are really helpful and i’m sure she’ll appreciate them since they are the truth after all. Thanks again.",
      "created_utc": 1609959977.0,
      "score": 3,
      "context": [
        {
          "id": "giaj8r8",
          "author": "horsecockenergy",
          "body": "You seem like a really sweet partner. I would say keep going with telling her that her body doesn’t determine her worth, which usually is the recurring idea when someone has an eating disorder. Keep telling her that it’s okay to gain weight and that it doesn’t reflect on her as a person. Don’t focus too much on her looks but more of her worth, and don’t ever mention things like “you’ve gotten thinner” OR “you’ve gotten bigger”. Remove the stigma and anticipation of food, make it not a big deal  and don’t force her. Just be casual about it, teach her subtly that food is not a big deal and is to be enjoyed without worry. \n\nAgain, you seem like a really sweet person. Best of luck!",
          "created_utc": 1609930745.0
        }
      ]
    },
    {
      "id": "gic0lc8",
      "author": "Neemo53",
      "body": "That’s a really sweet story. I’ll definitely give some fun alternatives a try and I know she’s all about that. Thank you! best of luck to you two!",
      "created_utc": 1609960092.0,
      "score": 2,
      "context": [
        {
          "id": "giajfq7",
          "author": "Babygirl_charliexxx",
          "body": "From my own experience of what I needed and still sometimes need from my boyfriend is just comforting but not in an obvious way. \n\nI struggled quite bad through one of the UK lockdowns and the gyms were closed, my mental health just went crazy. For two weeks I was in bed constantly, not moving or eating and I’m usually ok now (my focus has turned from bad eating habits to healthy ones weightlifting at the gym). \n\nMy boyfriend suggested doing fun things with food. Every weekend we set a weird cuisine we never tried before and made some traditional dishes from scratch. Granted sometimes they failed, but for me it was breaking that “all food is bad” mindset and we didn’t have to eat it, I was just having fun with my boyfriend. We bought matching aprons with dinosaurs on and played traditional music from the country while we cooked as well.\n\nInstead of focusing on her being sad and struggling, try suggesting things that’ll help in an indirect way. I hope I’ve helped, i know it’s really hard, I nearly caused my relationship to end. I really hope you two don’t end up in a circle of focusing on food all the time like we did. Good luck!",
          "created_utc": 1609930929.0
        }
      ]
    },
    {
      "id": "gic1ovr",
      "author": "Neemo53",
      "body": "Thanks so much for the sweet and kind words! Not talking about her looks or calling her beautiful is something I haven’t thought about as being triggering so thank you for the advice. Do you think there’s anything I could say as an alternative? Sort of like saying she’s always beautiful to me and that there’s no judgement at all? I just want to make sure I can compliment her the right way without it being triggering. Once again thank you for your kind words :)",
      "created_utc": 1609960588.0,
      "score": 2,
      "context": [
        {
          "id": "gibxrdh",
          "author": "Me-thinks-I",
          "body": "Hey, so first thank you for asking and this is actually really really sweet of you. Because not everyone think about it and end up saying something triggering.\n\nSo onto the advices :\n-At all cost, and I mean AT ALL COST, refrain from giving her appearance related compliments. I know you mean we'll but when in recovery or simply on a bad day everything can be overturned by the Ed. \"You look beautiful\" May be translated as \"You look beautiful Now, but if you put on weight you wouldn't be anymore.\" it could even induce a relapse and a wish to loose weight again.\n-Ask her what she needs/wants\n-Let her vent, if she wants to anyways, stay open minded and listen to what she says, comfort her. This can make a huge difference\n-No food rated comments either (and this on a daily basis), because once again you may mean well but it has the opposite effect. \"You eat well\" or \"You're eating mroe that is good\" can be triggering comments.\n\nThat is all I cna think about :) And once again Bravo, you are an amazing boyfriend/girlfriend. I know dealing with an Ed is hard for people around Ed sufferers but I promise it can get better. One day it will be fine :) I hope the best for the two of you and have a lovely day!",
          "created_utc": 1609958850.0
        }
      ]
    },
    {
      "id": "gic14n6",
      "author": "Neemo53",
      "body": "Very helpful advice here. Thank you so much. Since i’ve known about it for a while she herself told me what you have, that it’s an investment and can take a toll on me if i try to get involved but i’ve been handling it for a while now and am fully committed to helping in recovery. I’ll make sure she doesn’t feel judged ever and that i’m always by her side. Thanks again for the kind words and great advice.",
      "created_utc": 1609960332.0,
      "score": 2,
      "context": [
        {
          "id": "gibngl5",
          "author": "Low-Euphoric",
          "body": "Hey, I’m glad you’re looking for advice from a community that has experienced it firsthand. What has personally helped me the most is my bf making it clear that he was not judging me for any of it. No matter how worried you are for her health, never try to be controlling about her issues (« you shouldn’t do this, you know it’s not good for you » etc.) Make sure she knows you’re on her side, this means asking « could you tell me how I can help you? ». Validate her struggle, by telling her you understand why she would cope this way and that you love her no matter what, and that you’re willing to do what’s necessary to support her. Like I said, the most important is to make it clear you don’t judge her, no matter how mentally unhealthy she gets; shame is one of the biggest factors in an ED, so being loving to her while she feels the worst about herself can be very healing. \n\nReassure her when it gets bad that everything is temporary, and that many people who have suffered from the same problems have recovered, even after years of struggle. And that you will be holding her hand the whole time. Of course, only say those things if you mean it, because if you know you can’t handle it (which is totally understandable, it’s normal) then don’t commit like that. So if you do choose to commit, know that it won’t always be pretty and you have to learn how to be self nurturing. Also what you could do is research about her ED with her, it’ll show her you’re truly invested and have the best intentions towards her.\nHope this helps, wish you the best of luck, again thank you for taking her seriously.",
          "created_utc": 1609954313.0
        }
      ]
    },
    {
      "id": "gic8eu3",
      "author": "None",
      "body": "Also, walks personally help me (mentally). It’s often that people with EDs feel extra depressed if they’re not moving all day. \n\nSuggest resources to help her. Help her see why her behavior is unhealthy. I personally started my ED in the name of health but realized I needed help when it was relieved to me how unhealthy I was (although skinny)",
      "created_utc": 1609963583.0,
      "score": 2,
      "context": [
        {
          "id": "gic7t2i",
          "author": "None",
          "body": "For me, it is so comforting to know my BF loves me no matter my weight fluctuations. He’s def seen me as heavier and smaller and loves me just as hard. \n\nI’d be careful about commenting on her eating cause it can be triggering. This really depends on the person tho. For me, I feel very self conscious to receive praise about eating or any comment about the amount I’m eating. \n\nGet her her safe foods. She feel loved and understood. \n\nI think the best time to talk about eating disorder help is when I’m at rock bottom (sitting next to a toilet/purging), experiencing chest pains, ammenhorea, or just not around food. I feel desperate to get better when I’m at rock bottom but seldomly when I’m seeing weight loss.  \n\nI recommend expressing how scared it makes you feel to lose her but please don’t get her ultimatums to recover. EDs are an addiction/mental illness. We need support to get better.  Support her, not her illness. Ask her what you can do, what triggers her, what you can do to help her feel safe/loved. \n\nAlso, PLEASE don’t make it about weight. EDs aren’t just about being skinny. It’s about control a lot of the time and coping. I’d steer convos away from weight =/not = worth cause that’s triggering. Nobody wants to be told they’re just doing this to be skinny or for other people. This isn’t that simple.",
          "created_utc": 1609963316.0
        }
      ]
    },
    {
      "id": "giip63c",
      "author": "Neemo53",
      "body": "Beautiful words. Thanks so much for the advice.",
      "created_utc": 1610089798.0,
      "score": 2,
      "context": [
        {
          "id": "gicxjw2",
          "author": "cjx888x",
          "body": "I think that a huge part of it is to help yourself learn how to adapt your language. Focus on learning how to speak about others in reference to who they are as a person, and not about their appearance. You can set the tone by not making bodies a topic of conversation, even about your own or the bodies of strangers. Talk about people as though their value isn’t attached to their body/appearance. You would be *shocked* how much of a difference it makes to be away from the toxicity of what is considered ‘normal’ to say about ourselves and other. \n\nIf you happen to feel very motivated to compliment somebodies appearance, go for something they had control/a choice over. Tell them you like their sweet new shoes/jacket/earrings/tattoo. Tell them their hair looks really cool the way they styled it that day. Tell them you love their style. \n\nWhen you are close with your girlfriend, you can compliment her smell, tell her you love the feeling of her skin against yours, that you love the way it feels to have your arms wrapped around her, the way it feels to have her hands against your skin. To heal, we need *new* experiences to connect with so we can lessen the connection with our old, unhealthy beliefs. Giving her language that drives home how it can feel to enjoy being present in your body and connecting with someone you trust who values you. \n\nFor me, having people try to ‘convince’ me that my body is fine, and they think I am beautiful, does absolutely nothing. Healing for me came from being physically close with people who genuinely believed in the value of my physical presence and the experience of my body in a way that was connected to intimacy, not beauty standards. \n\nTldr- I think everyone should stop trying to convince their girlfriend she is hot. Instead, work to change the culture of bodies.  We don’t need people to think we are beautiful. We need people to love and value who we really are, which is human.",
          "created_utc": 1609974342.0
        }
      ]
    },
    {
      "id": "gic0r83",
      "author": "horsecockenergy",
      "body": "Absolutely no problem!!!! I wish you both all the best.",
      "created_utc": 1609960165.0,
      "score": 2,
      "context": [
        {
          "id": "giaj8r8",
          "author": "horsecockenergy",
          "body": "You seem like a really sweet partner. I would say keep going with telling her that her body doesn’t determine her worth, which usually is the recurring idea when someone has an eating disorder. Keep telling her that it’s okay to gain weight and that it doesn’t reflect on her as a person. Don’t focus too much on her looks but more of her worth, and don’t ever mention things like “you’ve gotten thinner” OR “you’ve gotten bigger”. Remove the stigma and anticipation of food, make it not a big deal  and don’t force her. Just be casual about it, teach her subtly that food is not a big deal and is to be enjoyed without worry. \n\nAgain, you seem like a really sweet person. Best of luck!",
          "created_utc": 1609930745.0
        },
        {
          "id": "gic0c4j",
          "author": "Neemo53",
          "body": "This is OP btw, don’t mind using my public account. Thank you, that means a lot. Your words of advice are really helpful and i’m sure she’ll appreciate them since they are the truth after all. Thanks again.",
          "created_utc": 1609959977.0
        }
      ]
    },
    {
      "id": "gic4tps",
      "author": "Me-thinks-I",
      "body": "No need to thank me, your post was actually really heart warming and I had to answer :)\nWell for an alternative you could compliment her about other things, like how smart, strong, sweet she is or how you love her no matter what she looks like. I know that this worked for me. And yes the thing about her always being beautiful to you is an amazing idea.\nThank you for being so considerate and take care!",
      "created_utc": 1609961988.0,
      "score": 2,
      "context": [
        {
          "id": "gibxrdh",
          "author": "Me-thinks-I",
          "body": "Hey, so first thank you for asking and this is actually really really sweet of you. Because not everyone think about it and end up saying something triggering.\n\nSo onto the advices :\n-At all cost, and I mean AT ALL COST, refrain from giving her appearance related compliments. I know you mean we'll but when in recovery or simply on a bad day everything can be overturned by the Ed. \"You look beautiful\" May be translated as \"You look beautiful Now, but if you put on weight you wouldn't be anymore.\" it could even induce a relapse and a wish to loose weight again.\n-Ask her what she needs/wants\n-Let her vent, if she wants to anyways, stay open minded and listen to what she says, comfort her. This can make a huge difference\n-No food rated comments either (and this on a daily basis), because once again you may mean well but it has the opposite effect. \"You eat well\" or \"You're eating mroe that is good\" can be triggering comments.\n\nThat is all I cna think about :) And once again Bravo, you are an amazing boyfriend/girlfriend. I know dealing with an Ed is hard for people around Ed sufferers but I promise it can get better. One day it will be fine :) I hope the best for the two of you and have a lovely day!",
          "created_utc": 1609958850.0
        },
        {
          "id": "gic1ovr",
          "author": "Neemo53",
          "body": "Thanks so much for the sweet and kind words! Not talking about her looks or calling her beautiful is something I haven’t thought about as being triggering so thank you for the advice. Do you think there’s anything I could say as an alternative? Sort of like saying she’s always beautiful to me and that there’s no judgement at all? I just want to make sure I can compliment her the right way without it being triggering. Once again thank you for your kind words :)",
          "created_utc": 1609960588.0
        }
      ]
    },
    {
      "id": "giihnfu",
      "author": "Babygirl_charliexxx",
      "body": "I’m seconding the walks! We’ve turned it into a whole thing and have started going on hiking weekends away (obviously when not in a lockdown). It’s helped me the most I think!",
      "created_utc": 1610084217.0,
      "score": 2,
      "context": [
        {
          "id": "gic7t2i",
          "author": "None",
          "body": "For me, it is so comforting to know my BF loves me no matter my weight fluctuations. He’s def seen me as heavier and smaller and loves me just as hard. \n\nI’d be careful about commenting on her eating cause it can be triggering. This really depends on the person tho. For me, I feel very self conscious to receive praise about eating or any comment about the amount I’m eating. \n\nGet her her safe foods. She feel loved and understood. \n\nI think the best time to talk about eating disorder help is when I’m at rock bottom (sitting next to a toilet/purging), experiencing chest pains, ammenhorea, or just not around food. I feel desperate to get better when I’m at rock bottom but seldomly when I’m seeing weight loss.  \n\nI recommend expressing how scared it makes you feel to lose her but please don’t get her ultimatums to recover. EDs are an addiction/mental illness. We need support to get better.  Support her, not her illness. Ask her what you can do, what triggers her, what you can do to help her feel safe/loved. \n\nAlso, PLEASE don’t make it about weight. EDs aren’t just about being skinny. It’s about control a lot of the time and coping. I’d steer convos away from weight =/not = worth cause that’s triggering. Nobody wants to be told they’re just doing this to be skinny or for other people. This isn’t that simple.",
          "created_utc": 1609963316.0
        },
        {
          "id": "gic8eu3",
          "author": "None",
          "body": "Also, walks personally help me (mentally). It’s often that people with EDs feel extra depressed if they’re not moving all day. \n\nSuggest resources to help her. Help her see why her behavior is unhealthy. I personally started my ED in the name of health but realized I needed help when it was relieved to me how unhealthy I was (although skinny)",
          "created_utc": 1609963583.0
        }
      ]
    }
  ]
}