{
  "id": "ks2udl",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1609984443.0,
  "title": "Request: How to handle being told to lose weight, post-recovery from anorexia?",
  "selftext": "Hi, I am feeling really lost. I'm 26F and have been in recovery from anorexia for the past 5 years. I'd come to really love being able to exercise in a healthy way, and have loved getting to enjoy food and intuitive eating.\nI gained some weight and lost my exercise routine over the course of COVID - I've been working at a hospital, it's been stressful. I've been aware of this, but have been optimistic that I'll be able to get back to a place where I feel comfortable sometime. Today I went for my yearly physical and my doctor remarked that I had gained weight, and gave me suggestions for how to lose weight and get back to the weight where I had been stable for the last few years. \nI'm really struggling, I haven't cried about what to have for dinner in years and am sitting here crying and totally paralysed. I have no idea how to lose weight in a nonrestrictive way and I'm very scared, both that I'll just be gaining weight forever, and that I'll lose weight and be right back in my eating disorder.\nAnd I'm so sad... I thought I was further along in my recovery than this...\nHas anyone here been through this? How have you coped?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ks2udl/request_how_to_handle_being_told_to_lose_weight/",
  "score": 81,
  "num_comments": 18,
  "comments": [
    {
      "id": "gidtkz1",
      "author": "sa-sha-",
      "body": "I hurt my back moving furniture earlier this summer after graduating college and moving back to my hometown. I went to a new doctor at the clinic I have been going to for years before I moved away for college. Instead of diagnosing me with a slipped disc or asking about my other activities she immediately brought up the fact that I had gained weight since my last visit at that clinic (four years ago when I was 18). She didn’t ask about my health or daily habits or my history of weight gain. Honestly, even after years of being mostly ‘recovered’ it really hurt. I had worked hard to maintain a steady weight throughout college and finally was at a point where I had stopped dropping and then regaining the same couple of pounds. If you feel like your current weight is impacting your health I would definitely recommend speaking with a doctor who knows how to treat people with ED’s. But you may not be in a place in your recovery to attempt weight loss in a healthy way, and it’s not worth risking relapse just because a doctor made a one size fits all recommendation that may not be helpful or healthy for you. In my opinion just telling someone with an ED (no matter how recovered they are!) to lose weight without any understanding of how that information may effect them or without any professional support is just irresponsible. I’m sorry that you had to go through that, if you need to talk feel free to DM me.",
      "created_utc": 1609989048.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gif4t5j",
      "author": "MaryContrary26",
      "body": "How do work in medicine and have zero awareness of eating disorders? That goes beyond being insensitive or ignorant into the category of medical negligence in my opinion.",
      "created_utc": 1610023895.0,
      "score": 33,
      "context": []
    },
    {
      "id": "gih3dtc",
      "author": "enord11400",
      "body": "When I was 17, I went for a “pre-op” appointment before going into day treatment for Anorexia for 4 months and my pediatrician had the nerve to say how great my weight looked (I was not underweight but had been dropping fast and started slightly overweight hence the diagnosis) and that I was basically the picture of health besides elevated cholesterol (which can happen when you are losing weight too fast). I later learned my mom had even called ahead and told the office not to say one damn thing about my weight but she kept going on about it anyway. 🙄 seriously non-specialized doctors seem to think eating disorders are only a thing if you are currently dying from them like just shut up. \n\nI would consider how you feel energy wise. Are you still able to do things you need to do or enjoy? If you had labs, were they normal? Are you actively dealing with any serious health conditions that have gotten worse where weight loss may be required to stay healthy? If the answers are no, then screw that doctor. It is normal to gain a little weight sometimes and you are under tons of stress so there is no issue. If you miss your workout routine then try and think of ways to be more active that you enjoy.\n\nI gained a little extra weight at the end of college as well and spent the last year trying to lose it. I lost a little but I am not going to restrict or force myself to exercise to exhaustion just to weigh a few pounds less. It is absurd. I have been trying to focus on staying active and making nutritious food choice covering all food groups. I can’t say I’ve made any total life changes and that is fine. Any effort you put it is great as long as it is not hurting your mental health but also know that you are fine as you are and doctors don’t know when to shut up.",
      "created_utc": 1610057664.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gie05m8",
      "author": "anonforlong",
      "body": "The first thing I want to say is that your weight does not determine your worth nor your health. As someone recovering from anorexia that may be hard to believe, but I swear it is true. Second of all, your doctor should not be bringing up your weight, unless absolutely necessary. SO many doctors are conditioned to believe that weight defines someone’s health and the fact of the matter is that that is completed BULLSHIT. There is actually no evidence correlating weight to health. Look into the podcast Food Psych by Christy Harrison. It may help reinforce pro-recovery thoughts and ideas that your doctor obviously failed to educate themselves on. Christy Harrison also has a book- I think it’s called Anti-diet and it is centered around intuitive eating and health at every size. Her ideology has made a big impact on me as someone who is currently struggling with an ED. I just want you to know that weight gain/loss is apart of life and you have NOTHING to be ashamed of. You are beautiful, and you are strong. Acknowledge those toxic thoughts, but try your best to understand that those thoughts are toxic for a reason- to bring you down and prevent you from growing as an individual. You are strong and you are beautiful. I hope something I said can help.",
      "created_utc": 1609992310.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gihd8yq",
      "author": "Zelda_is_my_homegirl",
      "body": "I’m not underweight and I gained a tiny amount (I’ve fluctuated that much in a day!) at the outset of my recovery. My endocrinologist asked me about it. So I told him the nutritionist had me stop counting calories because I’m in treatment for an ED. He got very pushy telling me how caloric deficits work while I sobbed begging him to tell me how many calories to eat since x amount wasn’t allowing me weight loss. He got uncomfortable, couldn’t give me a number, made a random number up out of thin air to represent my BMR and then offered me appetite suppressant injections. It was very predatory. \n\nI’m switching providers obviously. He prescribed the injections and I’m proud to say I never filled the prescription.",
      "created_utc": 1610062395.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gihlvye",
      "author": "Garbage_Patch_Kid",
      "body": "You do not need to lose weight. You need a new doctor. What an ass!! \n\nYou can request not to know your weight at the doctors in the future, they can weigh you backwards and not disclose it and that has helped for me. I’m so sorry this happened to you. Your doctor is an idiot and you deserve better. Unbelievable.",
      "created_utc": 1610066770.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gig8yip",
      "author": "momunist",
      "body": "Your doctor is flat out uneducated about eating disorders and weight science. I understand that finding a new doctor is easier said than done, but at the very least you should absolutely ignore everything this doctor said about your weight. Attempting weight loss as a person in recovery from an eating disorder is NEVER a good idea. What you CAN do (when you have more time/ less stress/ the emotional energy to handle changes in your routine) is try to increase your healthy habits, like eating vegetables and getting exercise you enjoy, but under no circumstances should you do these things with the intention of losing weight. You *might* lose weight if you pick up more healthy habits, you might not, but you will get benefits from increased healthy habits regardless of whether or not they cause weight loss. Attempting intentional weight loss, on the other hand, is very unlikely to make you any healthier.",
      "created_utc": 1610043997.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gieysrn",
      "author": "houston_veronica",
      "body": "It's my understanding from my own journey that - in order to truly be free - you have to see weight loss and anything other than very light exercise as \"your poison\". Just like some people can have salt at any level in their diet, a person with extremely high BP would not be able to have salt as it's like poison to their system (let's pretend that BP medication were not an option). \nAnorexia has no drug or medication to cure it, so the danger is that you get too close to the fire and will get burned again. \nMost crucial: have you clearly told your MD that you have AN in your history?  You have to be very clear about this, and very honest. If you've done that, then this doctor is extremely out of line to even suggest that you lose weight.\nMy guess is that they don't know your history; you have to keep in mind that all doctors *typically* see is problems with obesity. By far, that's the greater concern than being underweight.  They are used to giving people well-intentioned advice to ensure that they don't go overboard on weight gain. Trust me: YOU ARE NOT THAT PERSON! In other words, based on what you said here - you simply are not at all in danger of being overweight to the detriment of your health, but you can be certain that employing weight loss strategies would be playing Russian Roulette - and most likely, the odds would be stacked against you, I'm afraid.\nPlease talk to your MD sincerely; it is worth it to be open, and if she has not given it importance, get a new doctor ASAP.  Wishing you so much strength, OP!",
      "created_utc": 1610018768.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gigjnbj",
      "author": "Idrisnite",
      "body": "I feel for you. I would probably react the same way. I don't have advice but I wish you strength and I hope you take care of yourself. Please don't go below 1400 cal per day if you decide to lose weight.",
      "created_utc": 1610048697.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gidjhjj",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1609984443.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gihcptq",
      "author": "cinnamoslut",
      "body": "Oh no! I'm sorry you went through that, I know how hurtful that feels.\n\nFirst, probably best to get a new doctor if you can. It's important to have a GP who you really trust and feel comfortable with; one who is on the same page with you, and who you can make decisions with TOGETHER.\n\nIt can take time to find a good doctor that you click with. It's so beneficial for your health and so worth it.\n\nAnother thing that is very important if you don't have this already: Make sure your medical record says 'History of Anorexia Nervosa' or 'Anorexia Nervosa in Remission'.\n\nI have had this on my chart since I fully weight restored, and have at times gained weight to the point of being overweight. I think having that on my chart, as well as having a great relationship with my GP, has meant that the topic of weight has never come up except when I've lost weight. I was able to lose weight in a healthy steady way, and only then did my doctors bring it up. They wanted to make sure I was doing it in a healthy way, if I needed support, and then congratulated me when I explained how I'd done it.\n\nThe last thing I can think of that might be helpful, is if you have a psychiatrist or therapist, it might be helpful to ask them to talk to your GP or future GP so they better understand your mental health issues (eating disorder). My GP works with my psychiatrist and I find it really helpful for them to get the full picture of my health.\n\nI hope you find this helpful. I know that awful feeling in the pit of your stomach when a doctor says something harmful to your recovery. Sending you virtual hugs.",
      "created_utc": 1610062137.0,
      "score": 1,
      "context": []
    },
    {
      "id": "giho5yw",
      "author": "yellowposy2",
      "body": "Was your doctor aware of your ED history? I go to the same GP because she knows my history and never shows me weight or BMI, and rarely checks it (only once to make sure I wasn’t underweight and that was at the request of my therapist. It sucked, but I didn’t find out the number, and she told me I was strong and healthy and she was proud of my recovery after which was helpful). Anyway, sending you love and support. I’m so sorry that happened to you!",
      "created_utc": 1610067947.0,
      "score": 1,
      "context": []
    },
    {
      "id": "giht8wc",
      "author": "maesayshey",
      "body": "Ive been working in the health field too (I’m a lab tech) and I can say that my weight has fluctuated so much during all of this. Right now I’m the heaviest I’ve ever been and I’ve noticed myself relapsing back into old habits. Just remember that if you feel yourself slipping, reach out! Get help! I came clean to my fiancé and he makes me eat every time we’re together. It’s hard. If you live with someone, be honest with them and tell them to remind you to eat. If you don’t, talk to someone on the phone while you eat to hold yourself accountable!",
      "created_utc": 1610070596.0,
      "score": 1,
      "context": []
    },
    {
      "id": "giniuev",
      "author": "laverantal",
      "body": "Hi everyone, this is OP here and I want to thank all of you so very much for your support and sharing your stories. Wow, this has been SO helpful in my processing what happened the other day.\nI was so struck by that russian roulette comment, it's such a good analogy. My therapist has been really helpful in reminding me about intuitive eating and trusting my body here versus tacking onto triggers. I showed my partner this thread too and he has been wonderful in helping me to try and challenge this idea about losing weight and focusing on feeling good in my body and cheerleading me.\nAlso, to everyone who has had similar experiences, I so appreciate you sharing. I'm so sorry that you've had to go through these triggers, but know that your sharing with me has helped me feel a lot less alone. If anyone wants to PM and talk more one on one please feel free ♡",
      "created_utc": 1610198655.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gifwsai",
      "author": "seravivi",
      "body": "Imo a lot of physicians and therapists have very little awareness of EDs.\nI had one refer me to a nutritionist who told me to restrict and that it's okay because I binge so it's okay to go back to restriction.",
      "created_utc": 1610038688.0,
      "score": 21,
      "context": [
        {
          "id": "gif4t5j",
          "author": "MaryContrary26",
          "body": "How do work in medicine and have zero awareness of eating disorders? That goes beyond being insensitive or ignorant into the category of medical negligence in my opinion.",
          "created_utc": 1610023895.0
        }
      ]
    },
    {
      "id": "gifyq69",
      "author": "MaryContrary26",
      "body": "Unbelievable!",
      "created_utc": 1610039555.0,
      "score": 8,
      "context": [
        {
          "id": "gif4t5j",
          "author": "MaryContrary26",
          "body": "How do work in medicine and have zero awareness of eating disorders? That goes beyond being insensitive or ignorant into the category of medical negligence in my opinion.",
          "created_utc": 1610023895.0
        },
        {
          "id": "gifwsai",
          "author": "seravivi",
          "body": "Imo a lot of physicians and therapists have very little awareness of EDs.\nI had one refer me to a nutritionist who told me to restrict and that it's okay because I binge so it's okay to go back to restriction.",
          "created_utc": 1610038688.0
        }
      ]
    },
    {
      "id": "gigm3uv",
      "author": "seravivi",
      "body": "I honestly think it's a great example of how prevalent diet culture is and how normalized disordered eating is.",
      "created_utc": 1610049804.0,
      "score": 13,
      "context": [
        {
          "id": "gif4t5j",
          "author": "MaryContrary26",
          "body": "How do work in medicine and have zero awareness of eating disorders? That goes beyond being insensitive or ignorant into the category of medical negligence in my opinion.",
          "created_utc": 1610023895.0
        },
        {
          "id": "gifwsai",
          "author": "seravivi",
          "body": "Imo a lot of physicians and therapists have very little awareness of EDs.\nI had one refer me to a nutritionist who told me to restrict and that it's okay because I binge so it's okay to go back to restriction.",
          "created_utc": 1610038688.0
        },
        {
          "id": "gifyq69",
          "author": "MaryContrary26",
          "body": "Unbelievable!",
          "created_utc": 1610039555.0
        }
      ]
    }
  ]
}