{
  "id": "ks2v7c",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1609984515.0,
  "title": "Request: I need suggestions while searching for pro help for my daughter!!",
  "selftext": "So, I'll try to make this as brief as I can.  My daughter is 13, and very overweight.  I raised her as a single dad for most of her life, so I take full responsibility for her issues with food, as I have food issues, and am overweight myself.  In fact, the majority of my maternal family has food/weight issues.  They just say \"oh, we're just italian\". But that doesn't make it ok, for me.  \n\nMy daughter had been binge eating, I guess, and sneaking food.  Every time I turn around to get something to use for dinner or whatever, it's missing, or half the block of cheese is gone, or there's an empty container of something, with 1 left.  That's a trademark of hers.  Leaving 1 or 2 of whatever it is in the package.  Unfortunately, due to my work hours and her school hours, she is home for a little bit in the mornings and after school.  Maybe 2 hours combined.  I'm sure this is when she does most of it.\n\nI'm well aware professional help is needed, and we've been to a few therapists, who just didn't seem to care, and didn't make any progress, so I'm searching for another now.  However, I know that can take a long time to get under control, so I'm terrified for her, for the time being.  I've considered getting cameras in the house, I've considered putting locks on the fridge and cabinets, but both of these options seem like they could cause more harm than good.  I don't know what to do to control it for now.    \n\nPlease, I welcome ANY suggestions.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ks2v7c/request_i_need_suggestions_while_searching_for/",
  "score": 54,
  "num_comments": 23,
  "comments": [
    {
      "id": "gidky50",
      "author": "Zealousideal_Cake_78",
      "body": "I would recommend finding an eating disorders specialist to help her.  A psychologist if possible.  Not just a generic therapist.  And you can speak to her.  No shaming.  Maybe just ask her questions, like if it is upsetting for her, and if it is, what you could do to help... that sort of thing.  I guess I wouldn’t approach it like the problem is that she is overweight, but more that you are worried about her happiness.  And you could speak about your own experience with food as a touch point, that it makes you feel badly about yourself, or upsets or worries you, so you wonder if she feels that way?  And that it’s been hard for you to manage in your own life.  And that you love her and think she’s wonderful whatever she eats and whatever she weighs.",
      "created_utc": 1609985110.0,
      "score": 57,
      "context": []
    },
    {
      "id": "gidk6vy",
      "author": "rileyyj001",
      "body": "The absolute WORST thing you can do is install cameras and/or get locks. Please do NOT do that. I am horrified at the mere suggestion of it.",
      "created_utc": 1609984764.0,
      "score": 71,
      "context": []
    },
    {
      "id": "gidu56j",
      "author": "ccctee",
      "body": "As someone who has existed on every part of the eating disorder spectrum at one point or another, I URGE you not to lock food up, shame her or talk to her about being \"overweight\". If she is binge eating, there are multiple things to consider, including but not limited to:\n1. Speak with her about it from a supportive, non-judgemental place. Do NOT make it about her weight, the cost of food, etc etc. Shame/guilt is one of the WORST parts of eating disorders and it may just make things worse. \n2. Does she have an underlying medical issue ie. Celiac (any malabsorption disorder), PCOS, hyperthyroidism, etc. See your doctor and ensure there is nothing else going on before self diagnosing her. \n3. Is she restricting? It may not be intentional on her end or obvious to you (if you have your own difficulty with food). Maybe she has had food insecurity in the past or perhaps has felt guilty about her eating, which can lead to mental restrictions surrounding food even if she is not physically restricting herself... What I mean by this is that feeling guilty about eating certain types of food can actually feel like restriction to the brain, even if you are eating them or eating lots of other things. \n4. If your daughter needs help/support, find a WEIGHT neutral/body positive physician, therapist, or psychiatrist that specialize in EDs. Speak with them first and ensure their views align with your daughter's and yours. Ensure they are not focused on weight, BMI, \"health\". It won't help in the long term. \n\nHope this helps. Full transparency, I had an ED for 20 years. I'm now fully recovered and in the \"overweight\" BMI range. I have never felt healthier, more energetic or more happy. I have a completely normal relationship with food/body - I eat when I'm hungry, eat what I feel like (varies a lot) and stop when I'm full. I don't stress about food. I'm now a physician and I never could have got here with continuing restriction (which is the underlying cause of the majority of binges). This isn't meant to be medical advice AT ALL, just speaking from experience and it's important to point out that women with eating disorders often do not reach their potential in life and I feel SO grateful for my recovery so I can do what I love as a career and have the life I truly want.",
      "created_utc": 1609989319.0,
      "score": 46,
      "context": []
    },
    {
      "id": "giduepo",
      "author": "lunatua",
      "body": "You should NOT put cameras and locks up. In my experience that will only exacerbate the behavior. And it will likely only cause self hatred and more binge eating. I would recommend taking them to an eating disorder specialist who can help fix the underlying cause of the ED. I would have a discussion with her that does not include weight, numbers, or accusatory language. Try to be gentle with her. Maybe start keeping healthy snacks in the house and be open with her about the rules of the house.",
      "created_utc": 1609989448.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gido6bc",
      "author": "shimmysticks",
      "body": "I would try getting her into a treatment program. Look up IOP options for ed treatment in your area",
      "created_utc": 1609986573.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gidkja6",
      "author": "cburnard",
      "body": "not sure if you're doing this already but you should look for an eating disorder specialist and not just any therapist. and idk about how to manage it in the meantime other than locking food up? i wouldn't make that obvious b/c it might make her feel like shit.",
      "created_utc": 1609984921.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gidspkm",
      "author": "chai_latte_and_chill",
      "body": "My ED began at 12 and I was overweight at 13. I can remember how it felt to be overweight and the compulsion to binge is very difficult to control at such a young age as a child’s brain is not fully developed. A professional with experience dealing with children specifically would be able to give the best steps for your daughter. I had locks put in the house but this may not be the best approach for your daughter. I know it helped me, as my father explained to me calmly and with love that it was to help me and not to punish me. Definitely if you approach your daughter with patience and understanding, together you can help her get better. It may also be a case of outgrowing the behaviour. It is tricky for kids to implement skills learned in therapy, but do not give up. All the best ❤️",
      "created_utc": 1609988648.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gieq24s",
      "author": "ntagatf-dilligaf",
      "body": "When I was gripped by Binge eating, I felt like a volcano bubbling with stress, and the binging was like an eruption, letting out the stress and replacing it with food. If I couldn't get the opportunity to binge, the stress just built and built. If its anything similar for your daughter, then I hope this explains a little why the locks and cameras would be a bad idea.\nYou sound like a good dad, I'm sure you've got this.",
      "created_utc": 1610010167.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gidpxn7",
      "author": "None",
      "body": "Perhaps it isn’t that she binges but rather that she doesn’t understand nutrition and satiety? It could be BED sure but, it may be as simple as having a talk about what normal eating looks like especially since (no offense indented) that hasn’t been modeled for her. Most Americans truly don’t understand what a serving size is or how much *should* cause them to feel full or sometimes what the feelings of hunger or fullness even are. \n\nAs a parent of 2 similarly aged girls, if I noticed this, I would personally start with a nutritionist and let them then decide if we need to pursue ED specific treatment. You should visit the pediatrician for a referral 😊",
      "created_utc": 1609987377.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gievp8h",
      "author": "Zelda_is_my_homegirl",
      "body": "Disclaimer: Blame is not my goal simply awareness of potential triggers. \n\nI was sneaking food, because my mother had already started trying to control my weight. Every snack I’d attempt to eat would be scrutinized or shut down, so I stopped wanting people to know that I ate at all. The thought of you installing cameras or locks literally made me cry. The thought of how wrong it would make her feel for following probably very urgent-feeling urges she’s having is very upsetting. \n\nYour post is self critical, which is fine, but I would say one step you can take is to not criticize your daughter’s weight or make her feel guilty or wrong for being hungry or in a larger body. Also she’s a teenager! Many young women gain weight at the outset of puberty.\n\nOne of the most detrimental things for my eating disorder was my mother doing these things:\n\nA. Making me feel wrong for having extra body fat\nB. Equating happinesses with weight/size\nC. Stopping me from having things I wanted. \nD. Constantly analyzing both what I was eating and the way my body looked. \n\nSome phrases as a 13 year old that were triggering for me “you’re really getting kind of heavy.” “That’s not something girls your size should wear” “The kitchen is closed! No more snacks!” “Why are you eating? You can’t possibly be hungry” “she can afford to eat that. You can’t”\n\nYou’re a wonderful parent for trying to understand and get ahead of this. I STRONGLY recommend the book Anti-Diet by Chrissy Harrison (for your understanding, it’s a bit dry for a 13 year old). My therapist recommended it to me. It covers a lot of things regarding weight stigma/psychological, efficacy of diets, the dangers of weight cycling vs staying heavier, etc. \n\nSomething to remember is this. It is not morally wrong to have a larger body. It is not morally superior to have a smaller body. Trying to treat an eating disorder with “a healthy diet” or further limiting access to foods can literally just shift the type/manifestation of the disorder. \nMy experience at 13 sounds very similar to your daughter’s. Shortly after the binging, I began restricting/anorexic behaviors. Since then, I’ve spent 20 years cycling between binging, anorexic, orthorexic, and bulimic behaviors. Having a young girl thinking there is something wrong with her body is a recipe for continued disordered eating.\n\nEvery young girl is bombarded with the message that she has to be thin to be worthy. Some people are genuinely just genetically larger bodied. Be one of the voices in her life to let her know that her body is fine at whatever size it is and that she should never be ashamed or guilty about her body.",
      "created_utc": 1610015789.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gidjnc5",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1609984516.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gienuar",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1610008177.0,
      "score": -4,
      "context": []
    },
    {
      "id": "gif5bc5",
      "author": "LucyBlue16",
      "body": "Here are my recommendations based on my experiences:\n\nTell her you love her no matter what and that there’s nothing she could do to make you love her less. \n\nTell her she has value regardless of her outward appearance and is worthy of respect (self respect and respect from others) no matter what she looks like. \n\nBe careful to not indirectly or directly criticize or judge her body, your body, or others’ bodies. I internalized a lot of my mother’s comments about how she and others looked. \n\nTeach her about self compassion and self care. \n\nFocus on her strengths, like being a kind person or trying hard in school, etc \n\nBe honest with your struggles and work together as a team. Model the kind of thoughts and behaviors that you wish to see in her. \n\nI commend you for asking for help. I wish my parents had done the same! Approach yourself and your daughter with unconditional love, compassion, and respect and you can’t go wrong.",
      "created_utc": 1610024266.0,
      "score": 1,
      "context": []
    },
    {
      "id": "giftcug",
      "author": "tinykate25",
      "body": "Please be careful on how you word things to her or the way you bring it up , my mom constantly talked about my weight and eating habits as I was growing up and now have been dealing with bulimia for over 7 years .",
      "created_utc": 1610037160.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gifz6l3",
      "author": "daydreamer9876",
      "body": "I'm sure if you talked to your daughter about your health and how you want to get help for yourself and ask her if maybe she wants to join you on your journey maybe together you guys can fix it? I'm a binge eater and I'm 35 still trying to learn how to be ok with eating everything but I dont need to over eat as it will be there when I'm ready for it, boy is it hard, anywho good luck to you and her!",
      "created_utc": 1610039758.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gigahup",
      "author": "viribuskingdom",
      "body": "This isnt a cure but I think having open conversations about whats in the food and making meals together and getting her to help, may be a positive step for when she makes food on her own when you're not there so that she doesn't eat excessively. A bowl or cupboard of set snacks she could have in that time when shes home alone could be a good way to set that boundary too. Good luck and hope this helps",
      "created_utc": 1610044669.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gigmkis",
      "author": "captain_jayne",
      "body": "It sounds like you BOTH need a therapist and someone specializing in eating disorders. And maybe stop thinking about ways to **\"Control\"** her eating. It's food. Don't let controlling food/access to food/number on a scale come between you are your daughter. And please do not shame her. \n\nI really think you should see someone yourself, since you struggle with food. It's almost as if you are projecting. \n\nMaybe don't switch therapists and just try to find one who agrees with you/gets results the fastest, I would think the more important aspect would be finding a therapist that she is comfortable with and likes.",
      "created_utc": 1610050013.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gieqg9f",
      "author": "ladygagaisnice",
      "body": "THIS",
      "created_utc": 1610010541.0,
      "score": 5,
      "context": [
        {
          "id": "gidky50",
          "author": "Zealousideal_Cake_78",
          "body": "I would recommend finding an eating disorders specialist to help her.  A psychologist if possible.  Not just a generic therapist.  And you can speak to her.  No shaming.  Maybe just ask her questions, like if it is upsetting for her, and if it is, what you could do to help... that sort of thing.  I guess I wouldn’t approach it like the problem is that she is overweight, but more that you are worried about her happiness.  And you could speak about your own experience with food as a touch point, that it makes you feel badly about yourself, or upsets or worries you, so you wonder if she feels that way?  And that it’s been hard for you to manage in your own life.  And that you love her and think she’s wonderful whatever she eats and whatever she weighs.",
          "created_utc": 1609985110.0
        }
      ]
    },
    {
      "id": "gie3e56",
      "author": "kelsithegirlonfire",
      "body": "Therapist specializing in eating disorders here, and all of this information is gold. I would be honored to work with you as a physician.",
      "created_utc": 1609994032.0,
      "score": 13,
      "context": [
        {
          "id": "gidu56j",
          "author": "ccctee",
          "body": "As someone who has existed on every part of the eating disorder spectrum at one point or another, I URGE you not to lock food up, shame her or talk to her about being \"overweight\". If she is binge eating, there are multiple things to consider, including but not limited to:\n1. Speak with her about it from a supportive, non-judgemental place. Do NOT make it about her weight, the cost of food, etc etc. Shame/guilt is one of the WORST parts of eating disorders and it may just make things worse. \n2. Does she have an underlying medical issue ie. Celiac (any malabsorption disorder), PCOS, hyperthyroidism, etc. See your doctor and ensure there is nothing else going on before self diagnosing her. \n3. Is she restricting? It may not be intentional on her end or obvious to you (if you have your own difficulty with food). Maybe she has had food insecurity in the past or perhaps has felt guilty about her eating, which can lead to mental restrictions surrounding food even if she is not physically restricting herself... What I mean by this is that feeling guilty about eating certain types of food can actually feel like restriction to the brain, even if you are eating them or eating lots of other things. \n4. If your daughter needs help/support, find a WEIGHT neutral/body positive physician, therapist, or psychiatrist that specialize in EDs. Speak with them first and ensure their views align with your daughter's and yours. Ensure they are not focused on weight, BMI, \"health\". It won't help in the long term. \n\nHope this helps. Full transparency, I had an ED for 20 years. I'm now fully recovered and in the \"overweight\" BMI range. I have never felt healthier, more energetic or more happy. I have a completely normal relationship with food/body - I eat when I'm hungry, eat what I feel like (varies a lot) and stop when I'm full. I don't stress about food. I'm now a physician and I never could have got here with continuing restriction (which is the underlying cause of the majority of binges). This isn't meant to be medical advice AT ALL, just speaking from experience and it's important to point out that women with eating disorders often do not reach their potential in life and I feel SO grateful for my recovery so I can do what I love as a career and have the life I truly want.",
          "created_utc": 1609989319.0
        }
      ]
    },
    {
      "id": "gienwsk",
      "author": "godofsweetpotato",
      "body": "couldn't have said it better",
      "created_utc": 1610008239.0,
      "score": 7,
      "context": [
        {
          "id": "gidu56j",
          "author": "ccctee",
          "body": "As someone who has existed on every part of the eating disorder spectrum at one point or another, I URGE you not to lock food up, shame her or talk to her about being \"overweight\". If she is binge eating, there are multiple things to consider, including but not limited to:\n1. Speak with her about it from a supportive, non-judgemental place. Do NOT make it about her weight, the cost of food, etc etc. Shame/guilt is one of the WORST parts of eating disorders and it may just make things worse. \n2. Does she have an underlying medical issue ie. Celiac (any malabsorption disorder), PCOS, hyperthyroidism, etc. See your doctor and ensure there is nothing else going on before self diagnosing her. \n3. Is she restricting? It may not be intentional on her end or obvious to you (if you have your own difficulty with food). Maybe she has had food insecurity in the past or perhaps has felt guilty about her eating, which can lead to mental restrictions surrounding food even if she is not physically restricting herself... What I mean by this is that feeling guilty about eating certain types of food can actually feel like restriction to the brain, even if you are eating them or eating lots of other things. \n4. If your daughter needs help/support, find a WEIGHT neutral/body positive physician, therapist, or psychiatrist that specialize in EDs. Speak with them first and ensure their views align with your daughter's and yours. Ensure they are not focused on weight, BMI, \"health\". It won't help in the long term. \n\nHope this helps. Full transparency, I had an ED for 20 years. I'm now fully recovered and in the \"overweight\" BMI range. I have never felt healthier, more energetic or more happy. I have a completely normal relationship with food/body - I eat when I'm hungry, eat what I feel like (varies a lot) and stop when I'm full. I don't stress about food. I'm now a physician and I never could have got here with continuing restriction (which is the underlying cause of the majority of binges). This isn't meant to be medical advice AT ALL, just speaking from experience and it's important to point out that women with eating disorders often do not reach their potential in life and I feel SO grateful for my recovery so I can do what I love as a career and have the life I truly want.",
          "created_utc": 1609989319.0
        }
      ]
    },
    {
      "id": "gika15a",
      "author": "arl1286",
      "body": "This is the only correct answer.",
      "created_utc": 1610128243.0,
      "score": 1,
      "context": [
        {
          "id": "gidu56j",
          "author": "ccctee",
          "body": "As someone who has existed on every part of the eating disorder spectrum at one point or another, I URGE you not to lock food up, shame her or talk to her about being \"overweight\". If she is binge eating, there are multiple things to consider, including but not limited to:\n1. Speak with her about it from a supportive, non-judgemental place. Do NOT make it about her weight, the cost of food, etc etc. Shame/guilt is one of the WORST parts of eating disorders and it may just make things worse. \n2. Does she have an underlying medical issue ie. Celiac (any malabsorption disorder), PCOS, hyperthyroidism, etc. See your doctor and ensure there is nothing else going on before self diagnosing her. \n3. Is she restricting? It may not be intentional on her end or obvious to you (if you have your own difficulty with food). Maybe she has had food insecurity in the past or perhaps has felt guilty about her eating, which can lead to mental restrictions surrounding food even if she is not physically restricting herself... What I mean by this is that feeling guilty about eating certain types of food can actually feel like restriction to the brain, even if you are eating them or eating lots of other things. \n4. If your daughter needs help/support, find a WEIGHT neutral/body positive physician, therapist, or psychiatrist that specialize in EDs. Speak with them first and ensure their views align with your daughter's and yours. Ensure they are not focused on weight, BMI, \"health\". It won't help in the long term. \n\nHope this helps. Full transparency, I had an ED for 20 years. I'm now fully recovered and in the \"overweight\" BMI range. I have never felt healthier, more energetic or more happy. I have a completely normal relationship with food/body - I eat when I'm hungry, eat what I feel like (varies a lot) and stop when I'm full. I don't stress about food. I'm now a physician and I never could have got here with continuing restriction (which is the underlying cause of the majority of binges). This isn't meant to be medical advice AT ALL, just speaking from experience and it's important to point out that women with eating disorders often do not reach their potential in life and I feel SO grateful for my recovery so I can do what I love as a career and have the life I truly want.",
          "created_utc": 1609989319.0
        }
      ]
    },
    {
      "id": "gidpune",
      "author": "monkeysareeverywhere",
      "body": "IOP?",
      "created_utc": 1609987340.0,
      "score": 2,
      "context": [
        {
          "id": "gido6bc",
          "author": "shimmysticks",
          "body": "I would try getting her into a treatment program. Look up IOP options for ed treatment in your area",
          "created_utc": 1609986573.0
        }
      ]
    },
    {
      "id": "gieqogb",
      "author": "ladygagaisnice",
      "body": "I wouldn't call it actions, it's an eating disorder, ur not choosing it or anything, it's mental",
      "created_utc": 1610010761.0,
      "score": 2,
      "context": [
        {
          "id": "gienuar",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610008177.0
        }
      ]
    },
    {
      "id": "gidt43y",
      "author": "magpieslikesparkles",
      "body": "Intensive Outpatient Program",
      "created_utc": 1609988830.0,
      "score": 3,
      "context": [
        {
          "id": "gido6bc",
          "author": "shimmysticks",
          "body": "I would try getting her into a treatment program. Look up IOP options for ed treatment in your area",
          "created_utc": 1609986573.0
        },
        {
          "id": "gidpune",
          "author": "monkeysareeverywhere",
          "body": "IOP?",
          "created_utc": 1609987340.0
        }
      ]
    }
  ]
}