{
  "id": "ktgsm5",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1610155456.0,
  "title": "Request: Question post: recovering anorexic GF wants to lose some weight",
  "selftext": "\nFirst off I’m going to give as much info as possible and I apologize if any of it seems insensitive to others eating disorders or somehow triggering. So my girlfriend (21) of 7ish months is recovering from anorexia, she started doing a bit better a month or two before we started dating but has made great progress since that time. Her anorexia didn’t appear to be as severe as it can be for some individuals but she was certainly malnourished. \n\nI am a very health conscious person, extremely active (sports/lifting) after our first couple months she was doing much better, she had gained a few pounds. She was feeling better and having less health problems, most of those weird aches and pains and health issues that she seemed to have 5 days out of 7 were almost gone. Shortly after that she decided she wanted to start going to the gym with me, she had always wanted to go but never had the confidence to learn everything you need to know to lift by her self. It’s been a few months and she has gone up another few lbs. She looks great but she wants to trim down a few lbs of fat which she is being nitpicky but I can confirm that there is some fat she can lose that would be within a healthy range. She’s at healthy body fat percentage and I know this because we went to take a body analysis test shortly after starting to workout which I know may not seem like a good idea for many with an ED but I try to be very sensitive to the situation and she has handled it very well (I think numbers can be useful and cool to help see progress and growth with muscle and other factors). \n\nSo what I am worried about is if her body has had enough time to recover, her energy levels are as high as they have been in years and she is healthy and feels good 98% of days. But does her body still need more time to regulate? Could cutting down a few  lbs be harmful to her at this stage? I’ve tried researching what happens after recovering from Anorexia and I can not figure out if this would be ok or if her body would even allow it? I’ve read some things, and it makes sense intuitively to me, that the body in an anorexic situation tries to store as much body fat as it can as a response since it knows it may be a minute before the individual provides it with more fuel. So could it take months to a year for the body to transition to storing and utilizing energy the way healthier bodies do? The only reason I am considering agreeing with the situation and not fighting her a bit on it is because we are planning on getting married in a few months and I get that and want her to feel like she’s at her most beautiful.\n\n\nTLDR: recovering anorexic GF wants to lose a few lbs to look her best for wedding stuff. Is that healthy? What is the bodies response to recovering from anorexia throughout the first year?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ktgsm5/request_question_post_recovering_anorexic_gf/",
  "score": 40,
  "num_comments": 22,
  "comments": [
    {
      "id": "gim3l30",
      "author": "cinnamoslut",
      "body": "It doesn't sound like she's been in recovery long enough to healthily lose weight. You need at least one full year of being weight restored imo to make good decisions about weight loss. Possibly longer.\n\nIt's a good idea to work with a doctor who is knowledgeable about eating disorders and sensitive enough. Even better if she has a treatment team with doctor, therapist and dietitian all working together to help her make the best, healthiest choices.\n\nShe should try to focus on exercise goals that aren't related to weight.",
      "created_utc": 1610159104.0,
      "score": 47,
      "context": []
    },
    {
      "id": "gimikhi",
      "author": "Zelda_is_my_homegirl",
      "body": "To me this is kinda like saying “my alcoholic gf wants to have a drink again? Is she recovered enough that it’s safe?”\n\nWeight control is addicting. Especially if she hasn’t been a gym person, this might feel like a new door opening up to her eating disorder. A new opportunity to change her body. \n\nI would suggest you try to shift the gym and diet practices away from consoling/shaping the body. Help her work out for strong musculoskeletal system and heart. Eat food so that you feel satiated and energized. \n\nIntentional weight loss for an anorexic in recovery is not the best of ideas. It sounds like while she’s eating normally at this point that she’s still not over the body acceptance piece yet, which is truly the heart of the disorder. \n\nWishing you and her health and happiness!",
      "created_utc": 1610167259.0,
      "score": 28,
      "context": []
    },
    {
      "id": "gim51py",
      "author": "Medical_Swimming_955",
      "body": "As someone who has been in recovery for 8 years(I developed severe anorexia at age 15), I can nearly 100% guarantee you that she is NOT at place in her recovery where she has the wiggle room to lose even a few pounds. \n\nIt's actually amazing how quickly the brain responds to the slightest manipulation of weight in somebody who has had a prolonged ED. I know that any time my weight starts to trend downwards, even by just a couple of pounds, my body responds physiologically(fatigue, increased hunger, heart palpitations). When I get low enough to a certain weight, my mind starts to go...and that's when shit hits the fan. The ED thoughts come back and it can be a STRUGGLE to get myself back on the right track. \n\nThis isn't all to say that your girlfriend's situation is exactly like mine and that her experience with her ED is as engrained as mine, but I would HIGHLY advise that you sit down with her and express your concern. 7 months into recovery is simply way too early... If she is not seeing a counselor or therapist who specializes in ED's, I would also recommend that she should be talking to somebody.",
      "created_utc": 1610159862.0,
      "score": 26,
      "context": []
    },
    {
      "id": "gim35xb",
      "author": "1cecream4breakfast",
      "body": "Have you told her she is beautiful right now? If you are agreeing with her out loud that she could lose a few pounds, that might not be helpful to a recovering anorexic. Telling her she’s beautiful at this size might not fix everything either. But going along with her negative thoughts about her body can be harmful.",
      "created_utc": 1610158886.0,
      "score": 52,
      "context": []
    },
    {
      "id": "gims63d",
      "author": "makeupyourworld",
      "body": "hello. you sound like you mean well and i know you think that you can help her reach her goals and stuff, but i must forewarn you, this is dangerous territory. eating disorders are not just something you get over. they are extraordinarily deadly diseases. your girlfriend sounds like she is sort of in \"remission\" but her thoughts are still there, and once she starts acting on these behaviors, it can go from \"healthy weight loss\" to death by ed. \n\nher body is not nearly recovered enough. it's been less than a year and this us a dangerous time. i do not think it is a good idea despite the fact that for your healthy brain, numbers are a great progress tracker- for her they are not. \n\nyou should not be out loud agreeing with her desire to lose weight as it affirms her current insecurities. the low end of healthy is not the only healthy weight or body fat percentage. she sounds to be in a healthy range at this moment and disrupting that and risking a relapse is not worth it. \n\nin addition, the comment \"her anorexia didn't appear as severe as it can be for some individuals,\" is irrelevant here. people of ed's die at all different weights. some people with bulimia hide it for years and die of heart failure while being at a perfectly healthy bmi, because their muscle is so damaged from their ed behaviors. \n\ni was in the same position your gf was in a few years ago. i started recovery and was doing great, got a boyfriend who was health conscious and treated me kindly. i expressed that i wanted to lose weight despite being a healthy weight and he loved working out with me. -- i will not continue the story or blame him because the relapse was out of his hands, but within a few months i was about 66 pounds and unable to control my bowels anymore. i was a 19 year old who could not control my ability to pee or use the restroom the other way. \n\nit spirals so quickly and is such a dangerous disease. it sounds like you love her very much and losing these few pounds could put her in a lot of danger. i encourage you to support her through her continued nourishment and assurance that she is worthy and valuable no matter what she weighs or her body fat percentage. none of those numbers matter to you as much as she does. make sure she remembers that and best of luck to you both on health and happiness.",
      "created_utc": 1610173589.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gimb87b",
      "author": "None",
      "body": "In my experience, anorexia and disordered eating is a lifelong addiction. Always in recovery until a crisis hits and can slip back into controlling patterns. Perhaps never as severe in the level of control but always there. I have been in relationships and married and I can honestly say that I was only ever in a relationship with my body and my disorder. Everything and everyone else were participants of my life but, sadly, it was just me and my illness primarily. Therapists could only help me to a degree and I had to take steps after YEARS of struggling, at my own pace and in my own way towards progress/recovery. And recovery was - and is - never linear. My poor husband had to be dragged through my hells and heavens but was never actually a participant in facilitating recovery cos it can only happen when a person is ready to change. I am 37 now and it all started at 14 years old. I then turned to binge and purge or overexercising...it is an illness of the mind and runs the show. It is an ADDICTION. The ED acts like a comforting best friend who lives on secrecy and denial and control. I feel so bad for every guy I was ever with because they never really had a wife or a girlfriend. An actor playing a role while the real me was hiding so much from reality.... I don't actively starve myself now but I definitely still cannot live without weighing my food and exercising. I very easily relapse into wanting to exercise a lot. My illness just takes different forms throughout the years. Your partner will likely always hide a part of themself / illness from you because of the shame it all....",
      "created_utc": 1610163100.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gimjudu",
      "author": "heyobird",
      "body": "It is awesome that you care so much and are trying to be as sensitive to her disorder history while also trying to support her in current goals. However, I have to agree with others and say that this could put her recovery at risk. I of course don’t know her story, and everybody’s eating disorder can present different with different triggers, but pursuing weight loss, even the slightest amount, can be incredibly triggering. Even if she is okay in the beginning, she would need to be incredibly devoted to monitoring her thoughts and emotions in case she finds herself slipping into old disordered thoughts and behaviors. Losing weight is addictive. And triggers can be incredibly overwhelming- I personally can’t do certain types of exercise like running or heavy gym workouts because they almost instantly cause me to obsess about my weight and appearance, and I’ve been recovered from anorexia for 4 years. \n\nLike I said, I don’t know her ED personally or how she’ll react to losing weight in a “healthy” manner, but just be prepared. I hope the best for both you and your girlfriend.",
      "created_utc": 1610168021.0,
      "score": 4,
      "context": []
    },
    {
      "id": "ginlpn0",
      "author": "jeabgrenouille",
      "body": "The only thing I will add to these comments is that if you have so recently been eating more after a long period of restriction, your body will not allow you to be in a calorie deficit. Often, trying to force even a slight calorie deficit after finally eating after a period of restriction will trigger a binge and then a binge-purge cycle. It's ugly.",
      "created_utc": 1610200802.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gim6yhh",
      "author": "enord11400",
      "body": "The largest risk here is of course that she will completely relapse and that risk is pretty significant. One factor is how long she was sick for both in terms of the physical and mental risks. The longer it was then the higher the risk. If she wants to lose weight to “look good” then I would say that does not sounds good. Is she in therapy right now? She probably needs to be to explore these feelings with a neutral party. Most resources you can find online suggest it takes 5-7 symptom free years to be fully recovered from an ED. That sounds long and it is. The behavior of someone with an ED can resemble that of an addict. Little things that might not have bad intentions can build up over time until you slide very far back. The thing is that there may not be much you can do about this besides tell her you love her the way she is and all you want is for her to be happy and get any support she may need. If she does not truly want to get/stay better then she won’t and the reasons someone may not want that are very personal and complex and have nothing to do with you. It’s also not totally impossible that things will be fine and she will figure out how to balance her mental health with exercise especially if that is something you do together. \n\nBottom line, this probably isn’t the best idea for her to attempt but you can not stop her and should focus on being supportive. She is an adult and this is her life after all, but also prepare emotionally yourself in case things go downhill.",
      "created_utc": 1610160837.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ginn2a8",
      "author": "dealsme15",
      "body": "You've only been dating her seven months and you are already engaged to be married?",
      "created_utc": 1610201729.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gioqm0b",
      "author": "rhetoricsleuth",
      "body": "There are very few reasons someone should intentionally lose weight.",
      "created_utc": 1610222430.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gilwk8u",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1610155457.0,
      "score": 1,
      "context": []
    },
    {
      "id": "giv4dbe",
      "author": "momunist",
      "body": "If she still has a desire to lose weight, that’s a BIG red flag that she isn’t fully recovered from eating disorders. There is not a way to safely lose weight without triggering an eating disorder. Dieting is the number one predictor for developing an eating disorder, even in people who have never had an eating disorder before. I would absolutely not encourage her to lose any weight.",
      "created_utc": 1610361270.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gimnq72",
      "author": "cetaceansituation",
      "body": "2nd the doctor comment, in particular. \n\nWhen in doubt, consult a eating disorder specialist who, I can virtually guarantee, will say that making a conscious attempt to lose weight will not be good for her at this stage.\n\nAdditionally, exercising this much so early into recovery is generally discouraged. For many reasons, of course, both physical and mental. It can be very easy to redirect disordered thoughts into a fixation on working out and it's actually not  uncommon for people to develop a different eating disorder while recovering from their initial one.\n\nDo not: discuss calories, weight, body fat, etc.\nDo: support her, listen to her, be patient with her.\n\nRecovery is different for everyone and it's -never- linear. There will be slip ups, there will be mini relapses, there may be major relapses. How those obstacles are handled makes all the difference in achieving her long term goals. \n\nAgain, consult an eating disorder specialist. If she doesn't have a team she's working with, I definitely recommend finding one. Self recovery is doable, but it can be much harder, and being accountable to someone whose knowledge is limited (you - not your fault, of course) is much different than being accountable to someone who knows their s*** (doctor).",
      "created_utc": 1610170453.0,
      "score": 19,
      "context": [
        {
          "id": "gim3l30",
          "author": "cinnamoslut",
          "body": "It doesn't sound like she's been in recovery long enough to healthily lose weight. You need at least one full year of being weight restored imo to make good decisions about weight loss. Possibly longer.\n\nIt's a good idea to work with a doctor who is knowledgeable about eating disorders and sensitive enough. Even better if she has a treatment team with doctor, therapist and dietitian all working together to help her make the best, healthiest choices.\n\nShe should try to focus on exercise goals that aren't related to weight.",
          "created_utc": 1610159104.0
        }
      ]
    },
    {
      "id": "gimnsbq",
      "author": "cetaceansituation",
      "body": "Sorry for hijacking your comment! I intended to just agree with you, but then I found this nice soap box to stand on.....",
      "created_utc": 1610170491.0,
      "score": 4,
      "context": [
        {
          "id": "gim3l30",
          "author": "cinnamoslut",
          "body": "It doesn't sound like she's been in recovery long enough to healthily lose weight. You need at least one full year of being weight restored imo to make good decisions about weight loss. Possibly longer.\n\nIt's a good idea to work with a doctor who is knowledgeable about eating disorders and sensitive enough. Even better if she has a treatment team with doctor, therapist and dietitian all working together to help her make the best, healthiest choices.\n\nShe should try to focus on exercise goals that aren't related to weight.",
          "created_utc": 1610159104.0
        }
      ]
    },
    {
      "id": "gimcwaz",
      "author": "None",
      "body": "If she is desiring to \"look good\" and \"wants to lose a few\"... ? The answer is clear. Self esteem tied to \"looking good\" is the actual trigger here. She doesn't feel like she looks \"good enough\" even though she is becoming healthier. Therein lies the problem my friend ;-) she doesn't believe she is beautiful now so she feels the need to change herself. Once the weight starts to drop off, she could relapse into the hands of the addiction. I got REALLY thin before my wedding day simply because I was just so scared of gaining weight and not fitting into my dress!!",
      "created_utc": 1610164018.0,
      "score": 8,
      "context": [
        {
          "id": "gimb87b",
          "author": "None",
          "body": "In my experience, anorexia and disordered eating is a lifelong addiction. Always in recovery until a crisis hits and can slip back into controlling patterns. Perhaps never as severe in the level of control but always there. I have been in relationships and married and I can honestly say that I was only ever in a relationship with my body and my disorder. Everything and everyone else were participants of my life but, sadly, it was just me and my illness primarily. Therapists could only help me to a degree and I had to take steps after YEARS of struggling, at my own pace and in my own way towards progress/recovery. And recovery was - and is - never linear. My poor husband had to be dragged through my hells and heavens but was never actually a participant in facilitating recovery cos it can only happen when a person is ready to change. I am 37 now and it all started at 14 years old. I then turned to binge and purge or overexercising...it is an illness of the mind and runs the show. It is an ADDICTION. The ED acts like a comforting best friend who lives on secrecy and denial and control. I feel so bad for every guy I was ever with because they never really had a wife or a girlfriend. An actor playing a role while the real me was hiding so much from reality.... I don't actively starve myself now but I definitely still cannot live without weighing my food and exercising. I very easily relapse into wanting to exercise a lot. My illness just takes different forms throughout the years. Your partner will likely always hide a part of themself / illness from you because of the shame it all....",
          "created_utc": 1610163100.0
        }
      ]
    },
    {
      "id": "gime0cs",
      "author": "None",
      "body": "I agree. I replied in a very similar fashion. I am honest and real about it and I would rather be hated for showing the ugly side of the illness than give a false positive comment about the situation. Thank you for also be real about it all. :)",
      "created_utc": 1610164639.0,
      "score": 3,
      "context": [
        {
          "id": "gim6yhh",
          "author": "enord11400",
          "body": "The largest risk here is of course that she will completely relapse and that risk is pretty significant. One factor is how long she was sick for both in terms of the physical and mental risks. The longer it was then the higher the risk. If she wants to lose weight to “look good” then I would say that does not sounds good. Is she in therapy right now? She probably needs to be to explore these feelings with a neutral party. Most resources you can find online suggest it takes 5-7 symptom free years to be fully recovered from an ED. That sounds long and it is. The behavior of someone with an ED can resemble that of an addict. Little things that might not have bad intentions can build up over time until you slide very far back. The thing is that there may not be much you can do about this besides tell her you love her the way she is and all you want is for her to be happy and get any support she may need. If she does not truly want to get/stay better then she won’t and the reasons someone may not want that are very personal and complex and have nothing to do with you. It’s also not totally impossible that things will be fine and she will figure out how to balance her mental health with exercise especially if that is something you do together. \n\nBottom line, this probably isn’t the best idea for her to attempt but you can not stop her and should focus on being supportive. She is an adult and this is her life after all, but also prepare emotionally yourself in case things go downhill.",
          "created_utc": 1610160837.0
        }
      ]
    },
    {
      "id": "gip4ts8",
      "author": "None",
      "body": "I thought the same thing, too!! I wasn't sure if I was reading it right??...",
      "created_utc": 1610229336.0,
      "score": 4,
      "context": [
        {
          "id": "ginn2a8",
          "author": "dealsme15",
          "body": "You've only been dating her seven months and you are already engaged to be married?",
          "created_utc": 1610201729.0
        }
      ]
    },
    {
      "id": "gimom66",
      "author": "cinnamoslut",
      "body": "No problem! Your comment was great.",
      "created_utc": 1610171046.0,
      "score": 2,
      "context": [
        {
          "id": "gim3l30",
          "author": "cinnamoslut",
          "body": "It doesn't sound like she's been in recovery long enough to healthily lose weight. You need at least one full year of being weight restored imo to make good decisions about weight loss. Possibly longer.\n\nIt's a good idea to work with a doctor who is knowledgeable about eating disorders and sensitive enough. Even better if she has a treatment team with doctor, therapist and dietitian all working together to help her make the best, healthiest choices.\n\nShe should try to focus on exercise goals that aren't related to weight.",
          "created_utc": 1610159104.0
        },
        {
          "id": "gimnsbq",
          "author": "cetaceansituation",
          "body": "Sorry for hijacking your comment! I intended to just agree with you, but then I found this nice soap box to stand on.....",
          "created_utc": 1610170491.0
        }
      ]
    },
    {
      "id": "gimefu9",
      "author": "None",
      "body": "Oh and whenever I dated a health conscious person, it was always really bad for me cos the health conscious person made me feel more self conscious because they themselves were self conscious lol. I always did better when I dated the guys who ate naturally and just did un-routine exercise. ;-)",
      "created_utc": 1610164880.0,
      "score": 8,
      "context": [
        {
          "id": "gimb87b",
          "author": "None",
          "body": "In my experience, anorexia and disordered eating is a lifelong addiction. Always in recovery until a crisis hits and can slip back into controlling patterns. Perhaps never as severe in the level of control but always there. I have been in relationships and married and I can honestly say that I was only ever in a relationship with my body and my disorder. Everything and everyone else were participants of my life but, sadly, it was just me and my illness primarily. Therapists could only help me to a degree and I had to take steps after YEARS of struggling, at my own pace and in my own way towards progress/recovery. And recovery was - and is - never linear. My poor husband had to be dragged through my hells and heavens but was never actually a participant in facilitating recovery cos it can only happen when a person is ready to change. I am 37 now and it all started at 14 years old. I then turned to binge and purge or overexercising...it is an illness of the mind and runs the show. It is an ADDICTION. The ED acts like a comforting best friend who lives on secrecy and denial and control. I feel so bad for every guy I was ever with because they never really had a wife or a girlfriend. An actor playing a role while the real me was hiding so much from reality.... I don't actively starve myself now but I definitely still cannot live without weighing my food and exercising. I very easily relapse into wanting to exercise a lot. My illness just takes different forms throughout the years. Your partner will likely always hide a part of themself / illness from you because of the shame it all....",
          "created_utc": 1610163100.0
        },
        {
          "id": "gimcwaz",
          "author": "None",
          "body": "If she is desiring to \"look good\" and \"wants to lose a few\"... ? The answer is clear. Self esteem tied to \"looking good\" is the actual trigger here. She doesn't feel like she looks \"good enough\" even though she is becoming healthier. Therein lies the problem my friend ;-) she doesn't believe she is beautiful now so she feels the need to change herself. Once the weight starts to drop off, she could relapse into the hands of the addiction. I got REALLY thin before my wedding day simply because I was just so scared of gaining weight and not fitting into my dress!!",
          "created_utc": 1610164018.0
        }
      ]
    },
    {
      "id": "gipobov",
      "author": "dealsme15",
      "body": "It's especially problematic since he doesn't understand ED very well.",
      "created_utc": 1610239320.0,
      "score": 2,
      "context": [
        {
          "id": "ginn2a8",
          "author": "dealsme15",
          "body": "You've only been dating her seven months and you are already engaged to be married?",
          "created_utc": 1610201729.0
        },
        {
          "id": "gip4ts8",
          "author": "None",
          "body": "I thought the same thing, too!! I wasn't sure if I was reading it right??...",
          "created_utc": 1610229336.0
        }
      ]
    },
    {
      "id": "gipql9a",
      "author": "None",
      "body": "Agreed!! Amen to that as you've read my mind!! :-)",
      "created_utc": 1610240474.0,
      "score": 2,
      "context": [
        {
          "id": "ginn2a8",
          "author": "dealsme15",
          "body": "You've only been dating her seven months and you are already engaged to be married?",
          "created_utc": 1610201729.0
        },
        {
          "id": "gip4ts8",
          "author": "None",
          "body": "I thought the same thing, too!! I wasn't sure if I was reading it right??...",
          "created_utc": 1610229336.0
        },
        {
          "id": "gipobov",
          "author": "dealsme15",
          "body": "It's especially problematic since he doesn't understand ED very well.",
          "created_utc": 1610239320.0
        }
      ]
    }
  ]
}