{
  "id": "kwhv2r",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1610549368.0,
  "title": "Request: How to deal with peoples positive comments about my unhealthy weight loss ?",
  "selftext": " \n\nRecently had a relapse in  my eating disorder. Very heavily restricting has led to a significant  weight loss. I wasn’t overweight but higher end of a healthy weight to  start and I am rather muscular, so I guess now outwardly I appear “fit.”  I want to recover and I am actively trying to but I do not know how to  respond when people make comments like “omg what did you do to lose  weight” “you look so good what are your tricks” or ask for my  diet/routines. I have struggled with this off and on for years but never  received so many comments on my body, and I really just need a good way  to respond to these comments of praise for destroying my body. I am  tired of society glorifying thinness and associating skinny with healthy  . I am very sick and want to get better. Any good responses to these  type of comments?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kwhv2r/request_how_to_deal_with_peoples_positive/",
  "score": 91,
  "num_comments": 21,
  "comments": [
    {
      "id": "gj535bz",
      "author": "cburnard",
      "body": "you could just say \"unfortunately i'm sick so i can't help you\" or just \"i'm sick\" and leave it at that. you don't owe anyone any explanations.",
      "created_utc": 1610563955.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gj4pi4q",
      "author": "drippingrubies",
      "body": "At one point I just gave up and decided to make people uncomfortable by saying \"Thanks. It's the Anorexia. 10/10 would not recommend\" in a super dry tone. Alternatively, \"severe mental illness\" works.",
      "created_utc": 1610557939.0,
      "score": 57,
      "context": []
    },
    {
      "id": "gj4ya3f",
      "author": "enord11400",
      "body": "Just say you are have an illness (which you do) that you have been dealing with for a long time which has flared up recently. Most people will probably just leave it at that. Some might pry and try and ask what is wrong or want to offer suggestions and depending on your relationship with them you can say you would rather not talk about it, it is private, or you can get more specific. People don’t need to know what is happening in your life if you don’t want them to but I think this is the easiest way to communicate that they need to shut up about it. \n\nOf course there is also the chance they will make some stupid remark like “I wish I had that” at which point feel free to just disagree or make a snarky comment about how great all the other side effects of this disease are. Most people aren’t stupid enough to wish an illness on themselves though unless they already have a pretty messed up relationship with weight loss. \n\nIf you aren’t comfortable sharing any info you could just allude to the fact that “some people” wouldn’t want to hear that because they are dying of cancer or suffering a severe mental issue and you can’t usually tell who. You could make it a more general discussion about society and whatnot depending on how open minded the commenter is. They might think you are just trying to make them feel bad though, but most people would would realize this probably applies to you or someone you care about and back off. People can be really dumb though so brace yourself for whatever kind of screwed up response they might have to your totally reasonable request to not discuss it.",
      "created_utc": 1610561812.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gj5w091",
      "author": "lazyycalm",
      "body": "You have to understand that those ppl are brainwashed into thinking thinner=better like the rest of society. I was floored by how much better ppl treated me when I was underweight than like an average sized person. I think it’s best to say something like “yeah a lot of ppl have mentioned my weight loss, but I’ve been struggling w/ an eating disorder (or I’m sick) and I’m actually not that happy abt it.” Alternately if you say “I preferred how I looked before” they might feel guilty about implying that thinner is inherently better",
      "created_utc": 1610576687.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gj4r60z",
      "author": "None",
      "body": "I mean, a lot of people are commenting simply because they themselves are insecure & are trying to shed some pounds (healthily, lol). My wonderful coworker commented on my weight (I know she herself has been trying to lose weight) so instead of making it seem like my shitty method was the only way I said to her “yeah I’ve been watching what I eat and making sure I get exercise” - even though this isn’t 100% transparent it’s better than distorting a well-meaning comment into something that could make her feel really bad/lower her mood., and even though I’m not following my own advice it’s better to give them motivation towards healthy weight loss than saying “it’s because of my ED”   The comment seems rude but 99/100 times they are well-meaning - better to promote something healthy in response than over sharing being snarky. Idk if this makes sense lol.",
      "created_utc": 1610558685.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gj53k1g",
      "author": "HippyPrincess42",
      "body": "I normally just say something along the lines of \"bad habits, I wouldn't recommend it. Thanks though\". Most of my friends know I struggle with eating so that helps too.",
      "created_utc": 1610564137.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gj57no8",
      "author": "nodaybuttoday__",
      "body": "Directly say: I don’t really want to talk about my body right now, thanks.",
      "created_utc": 1610565942.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gj4eu85",
      "author": "iamkatwhite",
      "body": "I would suggest to just be honest and say that you would rather not receive such comments/questions for various reasons. If they have respect for you, they’ll listen and understand, but if they continue, distance yourself from them, that’s gonna be the best choice.",
      "created_utc": 1610553069.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gj61ju1",
      "author": "Lilith-Rising",
      "body": "Be honest. If you want to shed the idea that weight loss results in better health universally, you can share your story.",
      "created_utc": 1610579280.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gj6q65l",
      "author": "beezells",
      "body": "Like other people are saying, use the comment as opportunity to spread awareness. While the comment is well-meaning, they don’t realize that the compliments and attention encourage deadly behaviors and thoughts. People admire vulnerability and transparency. You have the power to help those around you think deeply about what they are saying.",
      "created_utc": 1610591823.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gj5ev0j",
      "author": "snooksbk",
      "body": "Yeah I hate this. I work in fitness and it's the worst when I relapsed and everyone is like \\*\\*what are you doing?!\\*\\*. Like not eating all day and drinking one single beer for dinner babe! It's the latest fitness trend! I'm really sorry you're experiencing that. I even had a close friend who is generally pretty conscious about that stuff say I was \\*\\*the fittest she'd ever seen me\\*\\* But I know I was exhausted and strung out. I had one client tell me I looked ten years younger...I was 27 hahaha. And was not overweight either before restricting again, but like you at the top of healthy. But i'm 5'2 so alas, there's also that.\n\nThe best advice I can give you is to have a really clear relationship with yourself and about what you are experiencing internally. It sounds like you do and you know this isn't how you want to feel. I wish I had better answers on how exactly to respond, but maybe try simply saying \"I've actually been sick and it isn't healthy for me! I'm working on getting healthier.\" That way they have to reckon on their OWN with the fact that they are conflating skinniness with health and you dont have to share anything further.",
      "created_utc": 1610569141.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gj479oe",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1610549369.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gj61w72",
      "author": "smashley1994",
      "body": "This exact thing happened to me last year. I lost a lot if weight really quickly and got so many comments, mostly positive, some concerned. I was at a healthy weight when I started losing and now my BMI teeters around 19 to 18.5. I have fallen below 18.5 which is where the underweight mark is. It's hard to hear encouragement when you know what you're doing is not good for you. Maybe just respond with saying your weight loss wasnt wholly intentional and that you are actually trying hard to not lose anymore. You dont have to go into detail if they ask, just say its personal. Good luck. Once your weight stabilizes the comments will stop, so keep fighting the good fight!",
      "created_utc": 1610579446.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gj7j0th",
      "author": "Maskionyt",
      "body": "I had the same issue. In August I started a very restrictive diet and lost about 12 kg in a month. But at one point it got so bad that I thought a handful of blueberry's per day was making gain weight. Some days I didn't eat at all. That all went on until one day I got enough of being tired all the time and having to take naps multiple times a day. So I contacted a nutritionist and, granted, it took me a couple of months to get back, but now I feel better than ever. And I know how it is with being judged. Before, when I ate an entire pizza, people would judge me a lot, telling me that's why I looked like that. Now, when I eat a crap ton of food, people don't say anything anymore. It's disappointing to know that your loved ones are those kind of people. But I cannot recommend you more to go to a nutrionist. Please, take care of your body and mind!",
      "created_utc": 1610611453.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjbearz",
      "author": "ZLCer",
      "body": "OMGoodness I remember being so mad when people were saying those same things to me  as a 5'7\"  92 pounds adult -- and at the same time almost elated that at least someone \"saw\" me. What a living hell that was.\n\nMind if I ask you a question? After reading all the comments, have you come up with an answer of your own of what you'd like to tell people?\n\nWhatever it is...say THAT!",
      "created_utc": 1610689029.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glnvj95",
      "author": "None",
      "body": "So sorry you're going through this. It's sad but I think a lot of people have this experience - for me, the only time I've ever had positive comments about my physical appearance was when I was at my lowest weight because I was heavily restricting my calorie intake and was very underweight. \n\nI think you've just got to learn to value your health over other people's opinion on your appearance. It's hard but you will get there. I wish I had better advice but I'm still learning myself! Hang in there ❤️",
      "created_utc": 1612220685.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gj6zy13",
      "author": "HappilyGia",
      "body": "I sometimes would say “cancer, thanks for asking”",
      "created_utc": 1610597243.0,
      "score": 6,
      "context": [
        {
          "id": "gj4pi4q",
          "author": "drippingrubies",
          "body": "At one point I just gave up and decided to make people uncomfortable by saying \"Thanks. It's the Anorexia. 10/10 would not recommend\" in a super dry tone. Alternatively, \"severe mental illness\" works.",
          "created_utc": 1610557939.0
        }
      ]
    },
    {
      "id": "gjc5mzy",
      "author": "SpecialSeasons",
      "body": "Hahaha oh man... Honestly, theres a bit of art to be found in making people uncomfortable for asking the wrong questions. If they didn't truly want to know, they shouldn't have asked.\n\n¯\\_(ツ)_/¯",
      "created_utc": 1610713927.0,
      "score": 2,
      "context": [
        {
          "id": "gj4pi4q",
          "author": "drippingrubies",
          "body": "At one point I just gave up and decided to make people uncomfortable by saying \"Thanks. It's the Anorexia. 10/10 would not recommend\" in a super dry tone. Alternatively, \"severe mental illness\" works.",
          "created_utc": 1610557939.0
        }
      ]
    },
    {
      "id": "gjc61oa",
      "author": "SpecialSeasons",
      "body": "Truth. I gained weight during covid and people have been treating me much differently. Definitely does nothing to help with recovery.",
      "created_utc": 1610714256.0,
      "score": 1,
      "context": [
        {
          "id": "gj5w091",
          "author": "lazyycalm",
          "body": "You have to understand that those ppl are brainwashed into thinking thinner=better like the rest of society. I was floored by how much better ppl treated me when I was underweight than like an average sized person. I think it’s best to say something like “yeah a lot of ppl have mentioned my weight loss, but I’ve been struggling w/ an eating disorder (or I’m sick) and I’m actually not that happy abt it.” Alternately if you say “I preferred how I looked before” they might feel guilty about implying that thinner is inherently better",
          "created_utc": 1610576687.0
        }
      ]
    },
    {
      "id": "gj7j1dt",
      "author": "converter-bot",
      "body": "12.0 kg is 26.43 lbs",
      "created_utc": 1610611468.0,
      "score": 1,
      "context": [
        {
          "id": "gj7j0th",
          "author": "Maskionyt",
          "body": "I had the same issue. In August I started a very restrictive diet and lost about 12 kg in a month. But at one point it got so bad that I thought a handful of blueberry's per day was making gain weight. Some days I didn't eat at all. That all went on until one day I got enough of being tired all the time and having to take naps multiple times a day. So I contacted a nutritionist and, granted, it took me a couple of months to get back, but now I feel better than ever. And I know how it is with being judged. Before, when I ate an entire pizza, people would judge me a lot, telling me that's why I looked like that. Now, when I eat a crap ton of food, people don't say anything anymore. It's disappointing to know that your loved ones are those kind of people. But I cannot recommend you more to go to a nutrionist. Please, take care of your body and mind!",
          "created_utc": 1610611453.0
        }
      ]
    },
    {
      "id": "gj7eqdl",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1610607504.0,
      "score": 9,
      "context": [
        {
          "id": "gj4pi4q",
          "author": "drippingrubies",
          "body": "At one point I just gave up and decided to make people uncomfortable by saying \"Thanks. It's the Anorexia. 10/10 would not recommend\" in a super dry tone. Alternatively, \"severe mental illness\" works.",
          "created_utc": 1610557939.0
        },
        {
          "id": "gj6zy13",
          "author": "HappilyGia",
          "body": "I sometimes would say “cancer, thanks for asking”",
          "created_utc": 1610597243.0
        }
      ]
    },
    {
      "id": "gjba5hl",
      "author": "drippingrubies",
      "body": "I'm very glad to hear that you're cancer free! My older brother had osteosarcoma as well and he's been cancer free for more than 20 years.",
      "created_utc": 1610686277.0,
      "score": 3,
      "context": [
        {
          "id": "gj4pi4q",
          "author": "drippingrubies",
          "body": "At one point I just gave up and decided to make people uncomfortable by saying \"Thanks. It's the Anorexia. 10/10 would not recommend\" in a super dry tone. Alternatively, \"severe mental illness\" works.",
          "created_utc": 1610557939.0
        },
        {
          "id": "gj6zy13",
          "author": "HappilyGia",
          "body": "I sometimes would say “cancer, thanks for asking”",
          "created_utc": 1610597243.0
        },
        {
          "id": "gj7eqdl",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1610607504.0
        }
      ]
    }
  ]
}