{
  "id": "kyam02",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1610766418.0,
  "title": "Request: Falling back into restrictive habits while boyfriend can’t eat solid food",
  "selftext": "I’m 24f and would consider myself recovered from anorexia, or at least I did. I was treated for the disorder five years ago during my second year of college. Since then I’ve been doing well, eating three times a day, keeping balanced nutrition, getting a healthy level of low impact exercise, and maintaining a healthy weight. \n\nRecently I put on a few pounds, and have been feeling absolutely awful about it, even though I’m still well within the healthy range. I have been trying to maintain a healthy diet regardless of my disordered thoughts. To do this, I told myself I had to eat when my boyfriend eats. We live together, so encouraging that we eat meals together has really kept me motivated to eat enough to stay healthy. \n\nThe problem is that over time this subconsciously shifted from “I have to eat if my boyfriend is eating”, to “I can’t eat if my boyfriend isn’t eating”, and I didn’t even notice the shift. He recently had his wisdom teeth taken out and can’t eat regular meals. I have been spiraling into my eating disorder since. \n\nI have a hard time getting myself to eat in front of him if he’s not also eating. But I am aware that I need food to survive and remain in recovery. I went from eating a well balanced three meals per day to the last few days where I’ve only drank coffee. Today I forced down a small salad and a few chips. But I can’t keep up like this. I have tremendous guild whenever I feel hungry, I have noticed that I’m checking my body frequently, and I can’t stop wondering how much I weigh. \n\nHow do I get control of my disorder again? I feel so stupid, because it almost feels like it never left. I can’t really talk to my boyfriend about how I’ve been feeling. I have been in recovery for our entire relationship. He knows I had an eating disorder years ago, and that health is important to me, but we don’t really talk about it. I also have panic disorder and ptsd, so my ed wasn’t really a top concern for a long time. \n\nThank you to anyone who took the time to read this. I would love to hear what you think.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kyam02/request_falling_back_into_restrictive_habits/",
  "score": 53,
  "num_comments": 11,
  "comments": [
    {
      "id": "gjfbtie",
      "author": "anitacina",
      "body": "Sadly, even after years of recovery, you can still get triggered and fall into bad habits. All you can is avoid the triggers or ignore them.",
      "created_utc": 1610773989.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gjg050l",
      "author": "whatabouttheclouds",
      "body": "you probably should tell you boyfriend too, he can't cure you but he can probably help you a little. like reminding you to eat or sit with you for a while. how long is he supposed to eat special foods? Once he can eat normal again and you can eat together it could become easier for you. its good that you realise your behavior, that's one step towards the better! Good luck, I believe in you♡",
      "created_utc": 1610795429.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gjezr6i",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1610766418.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjgjk4x",
      "author": "MissRiss918",
      "body": "I had a very similar experience! My boyfriend at the time (now fiancé) and I would eat at the same times which was helpful, but then it slowly turned into me not eating if he wasn’t. It was almost as if he was giving me “permission” to eat, by eating. \n\nWhat I did, that has been helpful, is have the conversation with him. Since my last time in treatment (2015-2016) the thing that has helped THE MOST is being completely honest with him about food. It has made everything different (in the best way).\n\nHope this helps! You aren’t alone!",
      "created_utc": 1610805843.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjgka6d",
      "author": "Kryssa_lys",
      "body": "This can happen when the underlying beliefs that first triggered you to restrict you're diet intake and obsess over the size and weight of your body are still in there. \n\nIt's like that function of autocorrect where your keyboard mislearns a word and keeps \"correcting\" it to the wrong word every time you try to type it... And you certainly CAN retype it the correct way every time it pops up but until you go into the programming and correct it at that deeper level, it's just going to keep popping up as the wrong one. Mindfully correcting it works but it's exhausting and easy to not notice so it sometimes slips on by you. \nI work with people with eating disorders every day and I've found that anorexia often has a deep self-belief component of being afraid to grow up, and/or wanting to be invisible and overlooked. \nWhen I'm able to help my patients recover whatever memory it was that first formed this belief in their unconscious mind, they can finally release it and we can rewrite the programming together. It's always such a huge shift for them to acknowledge the difference between maintaining a healthy weight and eating habits with conscious effort and simply loving themselves and their bodies so much that it automatically translates into honoring their body naturally and effortlessly in everything they do... Which includes what they feed it \nI wish you all the best on your healing journey! I struggled with anorexia myself for several years. Sadly for me, when in thought I'd healed from it back then, I didn't and over time it morphed into bulimia instead. I lived with they for decades. It wasn't until I became a hypnotherapist that I fully understood what was going on with my own unconscious programming. \nI am now finally free of all eating disorders! 🥳",
      "created_utc": 1610806185.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjf8wcp",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1610772006.0,
      "score": -23,
      "context": []
    },
    {
      "id": "gjfahe2",
      "author": "harry_styles0",
      "body": "What the fuck. You don’t say that to somebody.",
      "created_utc": 1610773064.0,
      "score": 6,
      "context": [
        {
          "id": "gjf8wcp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1610772006.0
        }
      ]
    },
    {
      "id": "gjfhmlp",
      "author": "PineappleSn0wflake",
      "body": "What is wrong with you??",
      "created_utc": 1610778282.0,
      "score": 5,
      "context": [
        {
          "id": "gjf8wcp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1610772006.0
        }
      ]
    },
    {
      "id": "gjge51m",
      "author": "None",
      "body": "this sub is created for people who gives a shit",
      "created_utc": 1610803237.0,
      "score": 3,
      "context": [
        {
          "id": "gjf8wcp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1610772006.0
        }
      ]
    },
    {
      "id": "gjfb0gi",
      "author": "mulatto_malik",
      "body": "yea get him >:(",
      "created_utc": 1610773430.0,
      "score": 2,
      "context": [
        {
          "id": "gjf8wcp",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1610772006.0
        },
        {
          "id": "gjfahe2",
          "author": "harry_styles0",
          "body": "What the fuck. You don’t say that to somebody.",
          "created_utc": 1610773064.0
        }
      ]
    }
  ]
}