{
  "id": "kzfnj7",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1610919514.0,
  "title": "Request: How to break a toxic binge cycle in lockdown?",
  "selftext": "Hi!\n\nI (25, M) have had incredibly disordered eating for a number of years now. Very long story short, I was a thin child from a fat family, used to be a ballet dancer, quit ballet, put on a lot of weight to the point I was clinically morbidly obese, spiralled into alcoholism (I'm 2 years sober now and in a 12 Step Program), then in 2017 I had a break from university (took \"leave\" in February 2017 to restart that academic year in September 2017, because of the aforementioned addiction issues) and I decided that I wanted to lose weight, I decided to do this with extreme calorie restriction (aided by a particular phone app that counts calories in food) and more than quadrupling my exercise (the same app also uses step count on your phone to work out how many calories you're burning, I passed out at the gym multiple times, had ketone breath, everything, but I didn't think I had an ED because, in my mind at the time, people with ED don't think about food, they think about weight, also, I was objectively, medically still overweight, so I told myself that I couldn't have an ED, I just like to get things done fast and not by half measures). \n\nWithout going too heavy on this and glorifying it or using numbers, the amount of weight I lost in such a short space of time meant that when I went back to my university just to visit for the end of year ball, people genuinely didn't recognise me, I felt great etc etc. The problem is that ever since late 2017 and now, and especially since I got sober at the end of 2018, I have lost and regained the same *amount* in weight about 10 times through a mix of unhealthy secret binging and then extreme restricting, when I stopped losing weight I was actually underweight in BMI. \n\nLockdown has been awful, I have been binging full on most days and I'm now back at a weight that I haven't seen since 2017, I'm only a few pounds away from being technically overweight again. I'm in the UK and we're currently in our third national lockdown, and now that I don't have the emotional support blanket of alcohol (a blanket that I do not want back, my life is so much better sober) I just can't stop myself binging until I feel sick, hating myself, then doing extreme home workouts during the day and then binging at night and body checking, my particular issue is with my chest, one of the reasons I wanted to lose weight in the first place is that I had a lot of fat on my chest and now after I binge, I feel like I can feel my chest expanding- which I know logically is ridiculous, but such is disordered binge eating haha. \n\nI don't know if anyone in here knows how to break the toxic cycle of this? I've been struggling with this immense self hatred, and I really want to break the cycle. I actually logged onto my laptop today to try and trigger myself into restricting massively tomorrow, but I know that if I heavily restrict, I'll just end up binging again and i really don't want to spend another night feeling so full that I feel sick or trying to avoid my reflection in shiny surfaces or not getting undressed before bed because I can't bring myself to look at my body etc etc etc.\n\nI'm so sorry for the long post, I've literally never talked to anyone about this before and it's been going on since 2017, everyone I know sees me as some beacon of weight loss and turning your life around, when really, I'm a fraud in that regard. The closest I've come to any help is that I've watched a couple of YouTube videos (Of Herbs and Altars and Chris Henrie) and I watch their videos like \"ooh damn, I used to do x... I used to do y too... Omg, I thought I was the only one crazy enough to z\"\n\nThanks for making it through that mammoth post haha.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kzfnj7/request_how_to_break_a_toxic_binge_cycle_in/",
  "score": 49,
  "num_comments": 7,
  "comments": [
    {
      "id": "gjni6ez",
      "author": "None",
      "body": "Hi there! Have you checked out Dave Chawner? He is a comedian who struggled with EDs and has several routines, a book, and a documentary on his experience as well as the experience of men with EDs. His book is called Weight Expectations and the documentary is called Millstone. I hope this helps!",
      "created_utc": 1610920032.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gjnqsop",
      "author": "Adventurous_Eye1560",
      "body": "For me something that really helps with preventing the binge cycle is allowing yourself to eat small, frequent meals throughout the day. Portion yourself out a smaller, healthy meal and eat more meals throughout the day compared to your standard 3 meals a day. Focus on meals with plenty of protein, fiber, and healthy fats. These are the three key nutrients to achieve satiation. I don’t know if this is your case but when I heavily restrict, eventually I get so hungry that it will trigger a binge that I will give into. I unfortunately still really control my caloric intake but I’m trying to focus on giving myself more frequent meals and smaller meals throughout the day. I also try to make sure that I have plenty of healthy foods to eat a lot of, such as lots of vegetables, or other healthy snacks. Basically, if I feel the need to eat, I don’t avoid it until it’s too late. I hope this helps.",
      "created_utc": 1610923828.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gjnzaxe",
      "author": "ChocoMustachy",
      "body": "I can't offer you any advice but I wish you all the best, and I hope you get better 💕💕",
      "created_utc": 1610928072.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjojngk",
      "author": "reasonableidentity_",
      "body": "hey! i went through something very similar and did therapy for 2 years which helped me so much and now i have  almost recovered! have you considered therapy ? i think it definitely helps you to put things into perspective and understand what you are feeling. what helped me get out of those cycles was first therapy and secondly is to see each day as a new day. for example, if i had a bad binge attack yesterday, the next day would be new day and i wouldnt beat myself over it. being able to do this gets so much easier with therapy and the wonderful thing is once you allow yourself to be and accept what has happened yesterday etc, your weight and also your health and mindset (more helpful!!) will find its normal. i wish you all the best! i remember when i was doing therapy my therapist telling me that it will be over and i will get past this. that almost seemed impossible back then but it does happen!!! it will happen for you too <3",
      "created_utc": 1610938739.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjnh0m8",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1610919515.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjokyer",
      "author": "anonforlong",
      "body": "Hey, first off- you mentioned this is your first time telling anyone about this, and I just want to say that you are brave for sharing, even if it’s just on Reddit. It took me a long time to speak up about my ED, and Reddit was the first place I did. Second, I would honestly recommend therapy. It can really help to vocalize this to someone, especially someone with a professional background in ED. It’s okay to reach out to people, you deserve it! Something I have been focusing more and more on has been the idea of intuitive eating. I would recommend listening to podcasts such as Food Psych by Christy Harrison. This podcast hasn’t “cured” my issues with food, but it’s made a tremendous impact on the ways in which I view eating, diet culture, fat phobia, eating disorders, and SO much more. Idk if my comment will help you, but I just want you to know that you are not alone. COVID and lockdown has triggered my ED in immense ways, and I really feel the struggle. I wish you luck❤️",
      "created_utc": 1610939462.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjp5tau",
      "author": "skakkuru",
      "body": "Hi there! First of all, thanks for sharing your personal story. Do you have the possibility of talking to a therapist about this?",
      "created_utc": 1610953388.0,
      "score": 1,
      "context": []
    }
  ]
}