{
  "id": "kztxah",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1610973637.0,
  "title": "Request: How to get over bingeing, have a healthy relationship w food, etc, while still being healthy??",
  "selftext": "I’m just wondering if anyone has done this and maybe gone from overweight to healthy weight while also conquering bingeing/chronic dieting/restricting. it’s my biggest problem and idek where to start solving it. I’m not into those methods that are like “yeah just eat however much you want of whatever you want”. Like yeah i’m sure that works great but if I do that for any extended period of time I bet my life that I will end up extremely obese. And no matter how you put it, being overweight is not healthy, and to go from overweight to a healthy weight, you obviously have to eat less, aka diet. So basically I’m asking how to overcome BED and everything associated with it while still maintaining body goals and a healthy weight/losing weight??? Any insight is much appreciated",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/kztxah/request_how_to_get_over_bingeing_have_a_healthy/",
  "score": 48,
  "num_comments": 12,
  "comments": [
    {
      "id": "gjqi03g",
      "author": "None",
      "body": "What’s helped for me is not buying any snacky, ready-to-eat foods (granola bars, crackers, etc.) If I want to eat, I have to prepare it. That’s been quite a deterrent for me lol",
      "created_utc": 1610989648.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gjpvrpn",
      "author": "AnaDion94",
      "body": "I think the common thought (and probably the right one) is to not focus on weight loss during this stage of your recovery. And I agree, because I'm doing the same thing and it is a constant struggle.\n\nThat being said, this is what worked for me (for about a month before relapsing since the new year): eating *really* healthy meals and working out. That helped disrupt the b/p cycle because I didn't feel as much guilt after eating. Working out helped because burning all that energy made my body desperate enough for energy that I was GOING to eat. It's easy to starve yourself of nutrients if you then just lay in bed all day; it's harder if you're maintaining a somewhat active lifestyle.\n\nMy meals were usually a meat, a cooked vegetable, and some sort of huge salad with cheese, craisins, whatever crispy toppings i like, and a homemade dressing (so i could control the amount of salt, fat, and sugar). I tried to minimize saturated fats and sugar, but not shy away from them if needed (like, i don't need butter on broccoli, but I didn't want to hold myself back from adding a bit of honey, cheese, or EVOO to something if i know I'll really enjoy it). As my workout intensity increased I noticed I was getting lots of headaches and tried integrating more carbs, which definitely helped; for me that meant a plain, baked sweet potato or sometimes brown rice. I snacked on fruits and had greek yogurt with granola, dark chocolate, and craisins for when i was caving something sweet. Or a cup of hot chocolate. Or cookies and milk if I felt like living dangerously  :) \n\nFor exercise I literally just jogged in place in my apartment. Sometimes while watching TV. Sometimes listening to the Hamilton soundtrack. Sometimes fast, sometimes just walking. Not necessarily hitting a number of steps, but trying to beat my lowest number over the previous seven days. AND I didn't weigh myself. Weight loss was based on how my clothes fit and comparing my overall fitness (i.e. only being able to jog for like 20 seconds vs 10 minutes)\n\nFor me, this was the healthiest I'd been since the pandemic causing ALL my ED behaviors to flair up in the worst way, and I'm trying to fall back into it. I liked being able to enjoy food and enjoy my body without fighting the urge to punish it every time I ate something. \n\nGood luck with all the things!",
      "created_utc": 1610977185.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gjqblig",
      "author": "sweet_ging",
      "body": "Exercising everyday really helps. I go rollerblading for 10 km most days and the days I don’t I feel really depressed and anxious about my food intake. But when I exercise I feel much less anxious and in control and even excited to keep making my body stronger.\n\nOf course this doesn’t fix everything, you can still over eat, be unsatisfied with your weight/ look... but for me I feel much less scared about feeling that way for long because I know how satisfied I feel once I start working my body",
      "created_utc": 1610986434.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjr4szj",
      "author": "Lilith-Rising",
      "body": "Yes it is possible and I’ve done it. If someone told be I couldn’t recover from BED and successfully lose weight from my painful obesity, I would just choose to never recover. It’s definitely possible but I do agree the effort needs to be in feeding your emotional needs. Weight comes off if you burn more energy than you ingest, regardless of whether you obsess over it or not. But instead of focusing on this fact and weight, make a conscious effort to become more in tune with your body and practice healthy/feel good habits and get a routine down. This lays the foundation for a healthier lifestyle and after you have spent less time thinking about weight you may have already seen yourself improve in other areas which builds confidence, and it may only require minor tweaks in your habits to reach future goals. So yes, you can have it all but it’s a matter of prioritizing your mental health enough right now to set numbers aside and build habits and hobbies instead. Progress will come with patience and care. Also I want to add that eating nutritious meals routinely helped disrupt b/p cycles as another poster has mentioned. Getting what you needs daily helps emotionally and physically.",
      "created_utc": 1611000713.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjqf0ss",
      "author": "iamtryingtobehappy",
      "body": "It is almost impossible to overcome BED while still maintaining body goals/losing weight/maintaining weight (to use your words). \nI understand how that will make you panic. Hold on, there’s a reason for what I’m saying. I promise it’ll be okay. \n\nBED stems from restriction. most EDs are a form of restriction. When you binge, you spiral and tell yourself what a horrible thing you’re doing, and you beat yourself up afterward. Even the release of the binge is mitigated after by the horrible self-hate that always follows. This is still a form of restriction. If you are binging, you are restricting. \n\nThat might sound paradoxical, because it is. But when you binge, you are trying to cram as much in as you can because you are in survival mode and you will tell yourself in an hour or so that you will never. Do that. again. That is restriction. \nThe only way you can stop binging is by eating what you want. And when you first start this Avenue of recovery, you will want A LOT of it. Who wouldn’t, after being told you can’t have it, etc. ? It’s normal. Uncontrollable hunger is so normal in recovery. Your body is saying, finally!!! Food!!!... the only thing different about this, that makes it not a binge, is that you are kind to yourself afterwards and you sit with yourself as you eat. You don’t black out, you just savor what you have and love yourself. Think about what love looks like, give it back to yourself. \n\nyou might gain weight during this time. That’s normal. Recovery leads to weight gain and body changes. You might gain weight and lose some and gain some back. It’s a process that takes years. I’ve been recovering for a few years and my body shape is changing. I’ve gained weight, lost some, gained it again, gained more muscle. This thing is not linear. And I know what I’m saying can be really difficult to absorb. But you have to leave this mindset of “body goals” and “healthy weight” behind. \n\nPlease trust me sweetie, I KNOW that’s so hard. Even as I write, there’s a part of my brain that laughs at what I said. But know it’s true and good for you. Society’s definition of healthy needs to change and become broader. Sending lots of love and strength and luck. 💗💜💙💚",
      "created_utc": 1610988179.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gjqqoz4",
      "author": "eaklv",
      "body": "I'm in this spot as well after trying to recover last year. I tried the whole eat whatever your body needs thing and it was a shit show. I had extreme hunger that lasted until I went from very underweight to slight overweight and it was traumatizing and caused really bad relapses with subsequent huge binges and eventually constant b/p. I regret not seeking treatment when I was underweight because eating a lot of calories caused refeeding syndrome and it was a truly painful experience on my body and psyche.\nThe only time I consistently did well with both recovery of some sort and weight loss is when I did a paleo style diet. I ate meat, eggs, lots of veggies and seeds and even made desserts sometimes. I did limit my calories and exercised quite a bit but I actually ate more calories than I would have ever felt comfortable with in the past while trying to lose and the binges almost stopped completely and I lost a lot of weight in like a month.\n\nI think paleo worked for me because I have a lot of dietary sensitivities and really never crave grains anyway. I ate til I was stuffed everyday with rooty vegetables, protein, fruit and seeds and I just felt content all the time. It was also the best way to eliminate processed foods which I find both addictive and too stimulating for me personally and I will overeat them and purge, so it really helped with that. The bloating was not pleasant in the first two weeks because I wasn't used to eat so much volume, but it settled and I saw massive changes in my body. I was happy, I only relapsed because I'm still dealing with water retention and purging makes it go away, but before this relapse doing things this way was the longest I was ever ed behaviour free.",
      "created_utc": 1610993832.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjpr8p6",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1610973637.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjswasq",
      "author": "None",
      "body": "Eat lots of veggies, good fats and protein. Get a couple pieces per day of fruit. Reduce salt intake and sodium rich foods. Get daily physical exercise of at least 30 mins, get adequate sleep, get some sunshine 10 mins per day, reduce refined sugars and processed foods, journal out difficult emotions.\n\nResearch recommended protein, carb and fat requirements for your age and activity levels and find out healthy portion sizes to use as a guide. Each meal/snack requires protein, carb and good fats.\n\nListen to hunger signals and satiety signals.\n\nExercise helps with weight control and blood sugar level stability.\n\nReduce stress / find coping mechanisms that don't involve food, etc.\n\nBeing overweight is a symptom of malnutrition. When the body gets the right BALANCE of nutrition required, and adequate daily movement, excess weight is naturally shed. EDIT: ***provided you don't have an underlying medical condition, food intolerance, etc.***\n\nAnd drink lots of water. Hydration is very important.",
      "created_utc": 1611034841.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjqgr8p",
      "author": "2020202838",
      "body": "Do you think it's normal to think that you're going to become obese if you try to recover (even if you never were clinically obese)? When I started recovery, I ate more food than I could imagine (without restriction). Now, I'm still eating without restriction but I'm not obese like I thought I would be?\n\n I know this stems from fear of weight gain and diet culture, but do you think it is normal to feel like you are eating more food than you think you need/deserve? It's hard to justify eating so much/so often when literally no-one else does it around you. I've been deeply ingrained in diet culture and the fitness community for so long that I find it so hard to think about what 'normal people' feel like around food. \n\nSorry for my long ramble. I just don't know how to put in words how I exactly feel right now. Thanks for reading.",
      "created_utc": 1610989043.0,
      "score": 3,
      "context": [
        {
          "id": "gjqf0ss",
          "author": "iamtryingtobehappy",
          "body": "It is almost impossible to overcome BED while still maintaining body goals/losing weight/maintaining weight (to use your words). \nI understand how that will make you panic. Hold on, there’s a reason for what I’m saying. I promise it’ll be okay. \n\nBED stems from restriction. most EDs are a form of restriction. When you binge, you spiral and tell yourself what a horrible thing you’re doing, and you beat yourself up afterward. Even the release of the binge is mitigated after by the horrible self-hate that always follows. This is still a form of restriction. If you are binging, you are restricting. \n\nThat might sound paradoxical, because it is. But when you binge, you are trying to cram as much in as you can because you are in survival mode and you will tell yourself in an hour or so that you will never. Do that. again. That is restriction. \nThe only way you can stop binging is by eating what you want. And when you first start this Avenue of recovery, you will want A LOT of it. Who wouldn’t, after being told you can’t have it, etc. ? It’s normal. Uncontrollable hunger is so normal in recovery. Your body is saying, finally!!! Food!!!... the only thing different about this, that makes it not a binge, is that you are kind to yourself afterwards and you sit with yourself as you eat. You don’t black out, you just savor what you have and love yourself. Think about what love looks like, give it back to yourself. \n\nyou might gain weight during this time. That’s normal. Recovery leads to weight gain and body changes. You might gain weight and lose some and gain some back. It’s a process that takes years. I’ve been recovering for a few years and my body shape is changing. I’ve gained weight, lost some, gained it again, gained more muscle. This thing is not linear. And I know what I’m saying can be really difficult to absorb. But you have to leave this mindset of “body goals” and “healthy weight” behind. \n\nPlease trust me sweetie, I KNOW that’s so hard. Even as I write, there’s a part of my brain that laughs at what I said. But know it’s true and good for you. Society’s definition of healthy needs to change and become broader. Sending lots of love and strength and luck. 💗💜💙💚",
          "created_utc": 1610988179.0
        }
      ]
    },
    {
      "id": "gjswzgc",
      "author": "None",
      "body": "Just FYI - I'm a qualified Personal Trainer with a passion for nutrition and wellbeing. I have studied Health Sciences at university, too.",
      "created_utc": 1611035306.0,
      "score": 1,
      "context": [
        {
          "id": "gjswasq",
          "author": "None",
          "body": "Eat lots of veggies, good fats and protein. Get a couple pieces per day of fruit. Reduce salt intake and sodium rich foods. Get daily physical exercise of at least 30 mins, get adequate sleep, get some sunshine 10 mins per day, reduce refined sugars and processed foods, journal out difficult emotions.\n\nResearch recommended protein, carb and fat requirements for your age and activity levels and find out healthy portion sizes to use as a guide. Each meal/snack requires protein, carb and good fats.\n\nListen to hunger signals and satiety signals.\n\nExercise helps with weight control and blood sugar level stability.\n\nReduce stress / find coping mechanisms that don't involve food, etc.\n\nBeing overweight is a symptom of malnutrition. When the body gets the right BALANCE of nutrition required, and adequate daily movement, excess weight is naturally shed. EDIT: ***provided you don't have an underlying medical condition, food intolerance, etc.***\n\nAnd drink lots of water. Hydration is very important.",
          "created_utc": 1611034841.0
        }
      ]
    },
    {
      "id": "gjqku0x",
      "author": "iamtryingtobehappy",
      "body": "Yes it’s normal to think that. And you’re not obese because it’s what your body needs. Once you start listening to your body, it also tells you when to stop. After recovering for a while, you begin to develop and hear your hunger cues again. \nAnd yes it completely stems from diet culture and our societal obsession w being thin and small and generally “accepted.” It’s hard to justify eating that way, but just know it IS VALID. Eat for yourself and your body. If anyone gives you shit for it, try to ignore them. They probably just don’t understand. \n\nMany times my parents have commented on the amount I eat. I try to brush it off because I know that if I want that second spoonful of pb, I should have it. It’s not going to kill me. If I *dont* have it, I’ll keep thinking about it ... thinking about it... and will eventually binge. \n\nAnd don’t apologize. You weren’t rambling at all!! :)",
      "created_utc": 1610991017.0,
      "score": 3,
      "context": [
        {
          "id": "gjqf0ss",
          "author": "iamtryingtobehappy",
          "body": "It is almost impossible to overcome BED while still maintaining body goals/losing weight/maintaining weight (to use your words). \nI understand how that will make you panic. Hold on, there’s a reason for what I’m saying. I promise it’ll be okay. \n\nBED stems from restriction. most EDs are a form of restriction. When you binge, you spiral and tell yourself what a horrible thing you’re doing, and you beat yourself up afterward. Even the release of the binge is mitigated after by the horrible self-hate that always follows. This is still a form of restriction. If you are binging, you are restricting. \n\nThat might sound paradoxical, because it is. But when you binge, you are trying to cram as much in as you can because you are in survival mode and you will tell yourself in an hour or so that you will never. Do that. again. That is restriction. \nThe only way you can stop binging is by eating what you want. And when you first start this Avenue of recovery, you will want A LOT of it. Who wouldn’t, after being told you can’t have it, etc. ? It’s normal. Uncontrollable hunger is so normal in recovery. Your body is saying, finally!!! Food!!!... the only thing different about this, that makes it not a binge, is that you are kind to yourself afterwards and you sit with yourself as you eat. You don’t black out, you just savor what you have and love yourself. Think about what love looks like, give it back to yourself. \n\nyou might gain weight during this time. That’s normal. Recovery leads to weight gain and body changes. You might gain weight and lose some and gain some back. It’s a process that takes years. I’ve been recovering for a few years and my body shape is changing. I’ve gained weight, lost some, gained it again, gained more muscle. This thing is not linear. And I know what I’m saying can be really difficult to absorb. But you have to leave this mindset of “body goals” and “healthy weight” behind. \n\nPlease trust me sweetie, I KNOW that’s so hard. Even as I write, there’s a part of my brain that laughs at what I said. But know it’s true and good for you. Society’s definition of healthy needs to change and become broader. Sending lots of love and strength and luck. 💗💜💙💚",
          "created_utc": 1610988179.0
        },
        {
          "id": "gjqgr8p",
          "author": "2020202838",
          "body": "Do you think it's normal to think that you're going to become obese if you try to recover (even if you never were clinically obese)? When I started recovery, I ate more food than I could imagine (without restriction). Now, I'm still eating without restriction but I'm not obese like I thought I would be?\n\n I know this stems from fear of weight gain and diet culture, but do you think it is normal to feel like you are eating more food than you think you need/deserve? It's hard to justify eating so much/so often when literally no-one else does it around you. I've been deeply ingrained in diet culture and the fitness community for so long that I find it so hard to think about what 'normal people' feel like around food. \n\nSorry for my long ramble. I just don't know how to put in words how I exactly feel right now. Thanks for reading.",
          "created_utc": 1610989043.0
        }
      ]
    },
    {
      "id": "gjqmmbn",
      "author": "2020202838",
      "body": "Thank you :)",
      "created_utc": 1610991869.0,
      "score": 3,
      "context": [
        {
          "id": "gjqf0ss",
          "author": "iamtryingtobehappy",
          "body": "It is almost impossible to overcome BED while still maintaining body goals/losing weight/maintaining weight (to use your words). \nI understand how that will make you panic. Hold on, there’s a reason for what I’m saying. I promise it’ll be okay. \n\nBED stems from restriction. most EDs are a form of restriction. When you binge, you spiral and tell yourself what a horrible thing you’re doing, and you beat yourself up afterward. Even the release of the binge is mitigated after by the horrible self-hate that always follows. This is still a form of restriction. If you are binging, you are restricting. \n\nThat might sound paradoxical, because it is. But when you binge, you are trying to cram as much in as you can because you are in survival mode and you will tell yourself in an hour or so that you will never. Do that. again. That is restriction. \nThe only way you can stop binging is by eating what you want. And when you first start this Avenue of recovery, you will want A LOT of it. Who wouldn’t, after being told you can’t have it, etc. ? It’s normal. Uncontrollable hunger is so normal in recovery. Your body is saying, finally!!! Food!!!... the only thing different about this, that makes it not a binge, is that you are kind to yourself afterwards and you sit with yourself as you eat. You don’t black out, you just savor what you have and love yourself. Think about what love looks like, give it back to yourself. \n\nyou might gain weight during this time. That’s normal. Recovery leads to weight gain and body changes. You might gain weight and lose some and gain some back. It’s a process that takes years. I’ve been recovering for a few years and my body shape is changing. I’ve gained weight, lost some, gained it again, gained more muscle. This thing is not linear. And I know what I’m saying can be really difficult to absorb. But you have to leave this mindset of “body goals” and “healthy weight” behind. \n\nPlease trust me sweetie, I KNOW that’s so hard. Even as I write, there’s a part of my brain that laughs at what I said. But know it’s true and good for you. Society’s definition of healthy needs to change and become broader. Sending lots of love and strength and luck. 💗💜💙💚",
          "created_utc": 1610988179.0
        },
        {
          "id": "gjqgr8p",
          "author": "2020202838",
          "body": "Do you think it's normal to think that you're going to become obese if you try to recover (even if you never were clinically obese)? When I started recovery, I ate more food than I could imagine (without restriction). Now, I'm still eating without restriction but I'm not obese like I thought I would be?\n\n I know this stems from fear of weight gain and diet culture, but do you think it is normal to feel like you are eating more food than you think you need/deserve? It's hard to justify eating so much/so often when literally no-one else does it around you. I've been deeply ingrained in diet culture and the fitness community for so long that I find it so hard to think about what 'normal people' feel like around food. \n\nSorry for my long ramble. I just don't know how to put in words how I exactly feel right now. Thanks for reading.",
          "created_utc": 1610989043.0
        },
        {
          "id": "gjqku0x",
          "author": "iamtryingtobehappy",
          "body": "Yes it’s normal to think that. And you’re not obese because it’s what your body needs. Once you start listening to your body, it also tells you when to stop. After recovering for a while, you begin to develop and hear your hunger cues again. \nAnd yes it completely stems from diet culture and our societal obsession w being thin and small and generally “accepted.” It’s hard to justify eating that way, but just know it IS VALID. Eat for yourself and your body. If anyone gives you shit for it, try to ignore them. They probably just don’t understand. \n\nMany times my parents have commented on the amount I eat. I try to brush it off because I know that if I want that second spoonful of pb, I should have it. It’s not going to kill me. If I *dont* have it, I’ll keep thinking about it ... thinking about it... and will eventually binge. \n\nAnd don’t apologize. You weren’t rambling at all!! :)",
          "created_utc": 1610991017.0
        }
      ]
    }
  ]
}