{
  "id": "l06p06",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1611012518.0,
  "title": "Request: Just a Question",
  "selftext": "Is it possible to be overweight and still have an ED?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l06p06/request_just_a_question/",
  "score": 46,
  "num_comments": 19,
  "comments": [
    {
      "id": "gjrztlw",
      "author": "emmachambers100",
      "body": "Definitely. Eating disorders can happen to anyone no matter their weight, despite what the media portrays. You can be underweight and have an ED, you can be a healthy weight and have an ED, and you can be overweight and have an ED. It's a mental illness, so even though weight loss/gain is a side effect, it is primarily something you suffer with in your head that manifests physically.",
      "created_utc": 1611016636.0,
      "score": 29,
      "context": []
    },
    {
      "id": "gjs1xfx",
      "author": "Mental_Chip9096",
      "body": "The vast majority of people who suffer from EDs are \"normal\" weight and over weight.",
      "created_utc": 1611017799.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gjrsdrj",
      "author": "melaine18",
      "body": "Yes , thats how it started for me and I still am",
      "created_utc": 1611012575.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gjs89tc",
      "author": "sp-1213",
      "body": "for sure. i started starving myself when i was 14 and overweight. i’m no longer overweight but i’m still starving myself. it wasn’t healthy then, and it’s not healthy now.",
      "created_utc": 1611021185.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gjsycj1",
      "author": "Greentom12345",
      "body": "It’s called an “eating “ disorder,,not a “weight” disorder so yes",
      "created_utc": 1611036285.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gjub4g7",
      "author": "None",
      "body": "as others have said, yes. i personally had BED which made me overweight. but regardless of that i still struggle to see why anorexia has such a strict diagnostic criterion of being underweight. as others said, you have to start somewhere, and the behavior is the same regardless of weight. it’s like diagnosing someone with “depression not otherwise specified” until they have suicidal thoughts, and then it’s officially Depression. just doesn’t make sense to me. why do you have to be seriously in trouble before you can even get the first step of a diagnosis?",
      "created_utc": 1611072352.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gjsckgp",
      "author": "clairefrann",
      "body": "Eating disorders are not determined by weight. Anyone of any size can experience disordered eating.",
      "created_utc": 1611023442.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gjtgwpy",
      "author": "None",
      "body": "Yes. I’d argue it’s the hardest form of ED to deal with.\n\nEdit: to add - not all EDs are restrictive / purging. BED is real and serious.",
      "created_utc": 1611053049.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gjt48ok",
      "author": "tragicvenom",
      "body": "Yes it’s very possible and many over weight ppl do have eating disorders. Eating disorders aren’t a weight thing their based on your relationship, mood, and habits when it comes to food. There are eating disorders that might involve weight as being a motivating factor but there are others that don’t have it as a factor at all. Either way if you feel like you may have some type of eating disorder try to seek medical help if able☺️",
      "created_utc": 1611041032.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gjtbbtx",
      "author": "Me-thinks-I",
      "body": "YES IT IS. An ED is a MENTAL ILLNESS and you can be anorexic while being overweight or at a healthy weigh for instance.",
      "created_utc": 1611047497.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gjuhkv0",
      "author": "nataliejuliet",
      "body": "Yes! EDs don’t have one specific look or size. Anyone of any weight or size can have an ED :)",
      "created_utc": 1611075334.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gjujsrx",
      "author": "anonforlong",
      "body": "Yes. The medical industry, diet culture, and the media have all perpetuated the misconception that eating disorders have a “size” or “look”. They don’t. You deserve support for you eating disorder no matter how you look.",
      "created_utc": 1611076332.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gjrs9yy",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1611012518.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjsuphj",
      "author": "None",
      "body": "Yep!",
      "created_utc": 1611033748.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gju2q12",
      "author": "imaginary_idiot",
      "body": "Yes, 1000%. BED is a thing, and all anorexics / bulimics / any other ED start somewhere. In fact, the diagnosis EDNOS can encompass overweight individuals with EDs.",
      "created_utc": 1611068281.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjuty9u",
      "author": "None",
      "body": "Yes definitely. Eating disorders are mental illnesses and physical aspects are solely an indicator of certain eating disorders. Someone overweight can have nutrient deficiency and face the same deadly results of eating disorders. They may also have BED or EDNOS so eating disorders don’t have a certain look. It is more about the mind than the body.",
      "created_utc": 1611080910.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjvci3r",
      "author": "None",
      "body": "Yes, I was overweight at the onset of mine. And regardless of your weight, eating disorders are a *mental* illness and exist *regardless* of what you look like. Atypical anorexia is just anorexia. Etc.",
      "created_utc": 1611089313.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gjvfgw7",
      "author": "None",
      "body": "absolutely",
      "created_utc": 1611090605.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gk0iyik",
      "author": "CuratorOfYourDreams",
      "body": "Yes",
      "created_utc": 1611193646.0,
      "score": 1,
      "context": []
    }
  ]
}