{
  "id": "l16vji",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1611139802.0,
  "title": "Request: Seeing food as a punishment ? - hypnotherapy",
  "selftext": "So I kinda did this hypnotherapy thing - where I actually found that I associate food with punishment. Not like I restrict myself with food but sometimes I'll eat more than what I need or even want to because I hate myself. \n\nI go like you're awful anyway so you should eat more and get fat and ugly. \n\nAny advice on how to cope or see this/reframe this perspective in a healthy way haha? \n\n\n\n^^kinda wanted post this",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l16vji/request_seeing_food_as_a_punishment_hypnotherapy/",
  "score": 40,
  "num_comments": 3,
  "comments": [
    {
      "id": "gjya6u2",
      "author": "consort_oflady_vader",
      "body": "Possibly try your best and reframe your thinking? I'm the opposite, I have to sometimes force myself to eat. You could always cook for friends, so you start to associate food with making other people happy? But I get your frustration though. I get into a \"why ever bother mood\" too at times.",
      "created_utc": 1611156400.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gjxlc8i",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1611139802.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gk0a1ai",
      "author": "None",
      "body": "you need therapy",
      "created_utc": 1611189063.0,
      "score": 1,
      "context": []
    }
  ]
}