{
  "id": "l2ldte",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1611312990.0,
  "title": "Request: Developing hate towards people who eat less than mw",
  "selftext": "I'm currently on a diet. Unhealthy, but I'm overweight and want to have normal weight. And nothing else works form me, I can't loose weight slowly because I loose motivation.\n\nAnyway, when I'm on a diet I like to see other people eat unhealthy food, or large portions. Eg, I eat my super small lunch with friends who eat a lot and wait for the comments \"you eat too little\" etc etc.\n\nBut, when someone eats less than me, just because they are busy or forget about eating (how TF is this possible) I am furious. I start to lecture them on unhealthy habits, and what it could lead to. When my bf does it I even prepare food for him, just to be sure he ate way more than me.\n\nIt happens also when I am in remission and eat normally. Does anyone have similar problems and how do you fight it?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l2ldte/request_developing_hate_towards_people_who_eat/",
  "score": 80,
  "num_comments": 13,
  "comments": [
    {
      "id": "gk5ybzs",
      "author": "Fungus666",
      "body": "I’m underweight and always make sure I eat less than others, because it makes me feel somehow better about myself. It is really toxic for me because even when I’m very hungry I don’t let myself eat more than others. It gives me satisfaction when others tell me “You eat so little! No wonder you’re so small” but I always play it off as in it’s just how I’m built and not an ED. I started eating less than I should because my mum is naturally very thin and when I would eat more than her she would make nasty remarks about it or joke. This eating thing is always a competition for me and it makes me so unhealthy. I don’t “look” anorexic and I don’t go to the extreme but I have an obsession with keeping my thinness. Just be careful with this because it can escalate very quickly. xxx",
      "created_utc": 1611313919.0,
      "score": 29,
      "context": []
    },
    {
      "id": "gk652q9",
      "author": "MaryContrary26",
      "body": "Well yeah, restrictive ED's are competitive by nature. Also hypersensitivity to what other people eat. How do you fight it? I really couldn't until I recovered and my body was well fed. Then  I stopped caring about what other people ate if that helps.",
      "created_utc": 1611319631.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gk6cu9b",
      "author": "edie43",
      "body": "Yeah, I’ve built up resentment towards my bf because he eats less than me while I’m working on treating my ED. I’m bulimic so I’m not even restricting but it drives me insane.",
      "created_utc": 1611324234.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gk6geai",
      "author": "anitacina",
      "body": "Yes I’ve been there. I reached a point where I couldn’t eat in front of others because I didn’t want to feel “wrong” for eating as often and as much as normal people. \n\nYour behavior is totally “normal” in your situation. Even when I’m at my best (almost recovered) I still have this habit of eating less than others. I guess you can’t really get over it but you learn it to make it less extreme with time and dedication.",
      "created_utc": 1611325382.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gk7dcnb",
      "author": "highlowletgo",
      "body": "I struggled with this for a long time when I was in the peak of my ED. I kept a journal for a few months when I was really struggling and so many of the entries are like \"xxxx didn't finish their food etc etc\"... it's really hard to deal with, but what helped me was to remember that even if we ate the same things, we would not look the same. Also all of our bodies have different needs so just because I eat one thing doesn't mean I should eat less or healthier. Good luck, I know it is hard.",
      "created_utc": 1611335409.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gk7vi1g",
      "author": "Idrisnite",
      "body": "I can kinda relate but instead of hate or anger it's pure jealousy and guilt and disgust with myself for not eating even less. Like wow, look at the self control they have. And they're not even obsessive about it. I need to do better. Feels terrible.",
      "created_utc": 1611340600.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gk8b3v3",
      "author": "None",
      "body": "i loveeee it when people eat more than me, it makes me feel small and valid and just generally better, and when people eat less than me, i get raging jealousy and self hatred and feel like a pig. ed's are just competitive things. in hospital, all the patients had this silent competition (lit no one admitted to or talked about it - in fact lots of people actually acted all pious about it and publicly condemned the behaviour) of who can eat the slowest or who's the most ill/who's been through the most because of their eating disorder. it's just a sucky side effect of the illness - i combat it very badly most of the time so i can't really offer any advice, but i can tell you that you're not alone in this in the slightest",
      "created_utc": 1611345476.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gk8vyl8",
      "author": "quidd_witch",
      "body": "Hi! First of all, I'm sorry that you're struggling with this – ED's are super competitive and unfortunately it's a hard mindset to break. I've definitely struggled with this myself, and it's hard, but I would suggest trying not to wait for the affirmations of \"you eat too little\" as you described. When someone *does* eat less than you, try working on recognizing that emotion, but not taking it out on them (they're not doing it because of you! I totally understand how personal it feels but it's up to us to combat that).\n\nUnfortunately, the only way to really get over this is to stop comparing yourself to other people's eating habits, and to work on not restricting. Remember that it's likely that nobody is paying as close attention to their food as you are, they're just eating to satiety. It's really about getting rid of the connotation of \"good\" eating and \"bad\" eating.",
      "created_utc": 1611352376.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gk9h6wr",
      "author": "NameyMcnamerson0003",
      "body": "Great news is that you are aware of it so you’re already a big step forward. I was bullimic for 14 years so can relate to the envy of others seemingly having more control over themselves around food. Control, gosh darn control is all I wanted and while I still work on this each and every day, I do think I’ve found control for the most part but I was always focusing on the wrong thing, food!\n\nThe only thing that’s ever helped me is to LET GO of control. Even the act of letting go is still control in the end. For example, if you’re holding onto a pencil in your hand that’s a choice but you can actively choose to let go of that pencil too. In the end it’s up to me as to whether I decide to let it go or keep holding on. I kept thinking about what I was afraid of, what am I holding onto so tightly? \n\nFor me, I realized that I was afraid of getting fat because it meant my parents would reject me or be disappointed. This is because in all actuality, their love felt conditional to me. I felt I had to be perfect and couldn’t make mistakes (‘get fat’- I know that isn’t a mistake now though). \n\nTo make a long story short, I decided that ‘fuck them’ that’s their issue and I still deserve love no matter what. So I bought a scale and I binged for the 27 millionth time and struggled all night to keep it down, I wanted to accept my action and see the damage. All night the voices came, telling me to purge, that I was a pig, I have no self control. On and on Negative Nancy went and normally I would give in except that first time.\n\nThe next day I checked my weight and barely put on a pound. Moving forward I decided to continue trying to forgive myself each time I binged and to just keep it down and try again the next day. My progress wasn’t linear and each time the voice would come Negative Nancy (the ED) and I (another voice I name Positive Polly) would remind her that ‘it’s ok, you’re still worthy of love even if you over eat. If anything, go ahead, eat the donut cuz you know it won’t add a million pounds. Just enjoy it as tho it were your last donut on earth’. Every meal it would be this tennis match in my head but slowly Positive Polly started getting louder and more trustworthy. \n\nIt’s very different for everyone so I can only speak for myself but I think what anyone with an ED has in common are those damn ED rooted voices in our head encouraging us to do whatever behavior it asks of us or makes us feel like shit. Realizing and hearing that Negative Nancy voice helped me learn that I could control the volume and turn it down. It’s never going to go away for me but at least I know when she’s talking instead of Positive Polly.\n\nThat was a rant, a purge of words (pun intended lol) but hopefully that can somewhat help to know you’re not alone. Next time your Negative Nancy comes in your head and starts comparing quantities of food, treat that voice like a scared bully and tell them ‘I see you but I got this, I’m allowed to eat however much I want. I am always in control, even if I choose to let go of it. If I let go, it’s because I want to.’ Or something like that.\n\nSometimes it takes a NegAtive Nancy to help us realize that we can control our minds and it just takes practice to make that Positive Polly voice louder!",
      "created_utc": 1611360648.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gk5xdiq",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1611312990.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gk9ivc1",
      "author": "the_good_nurse",
      "body": "Please be mindful that your lecturing others on eating habits could be causing them detriment. You don't know that they don't truly have disordered eating. None of us with an ED want attention called to what we're eating and how much. It doesn't matter how resentful or angry any of us get because of the disorder we all have to think about the impact that our behaviors have on others.",
      "created_utc": 1611361296.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gknrsnh",
      "author": "tofukillerr",
      "body": "It sounds like your needs aren’t being met. When you lecture someone else, what you’re really wanting is for someone to lecture you. Comparison is part of the competitive nature of ED’s. When you feel the anger coming try to take a moment and ask yourself what you think you need. Fulfilling your needs is going to help. Taking care of yourself can be extremely challenging. Start with just being gentle with yourself and don’t compare yourself to others.",
      "created_utc": 1611538495.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gk8hn4g",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1611347488.0,
      "score": 2,
      "context": [
        {
          "id": "gk7vi1g",
          "author": "Idrisnite",
          "body": "I can kinda relate but instead of hate or anger it's pure jealousy and guilt and disgust with myself for not eating even less. Like wow, look at the self control they have. And they're not even obsessive about it. I need to do better. Feels terrible.",
          "created_utc": 1611340600.0
        }
      ]
    },
    {
      "id": "gk8k9b5",
      "author": "Idrisnite",
      "body": "Oh geez I know how you feel. My mom does the same thing. We both look the same weight and she acts like I'm more overweight than her. Dieting feels like a competition between us. Oh but I can't imagine my whole family doing that to me, that must be so rough. I hope you can find the strength to ignore them. My own ED is at full control right now so I literally can't offer you anything but support and sympathy. I hope you don't starve yourself but since I'm doing that, I understand if you are too and I wish we'd just stop.",
      "created_utc": 1611348657.0,
      "score": 3,
      "context": [
        {
          "id": "gk7vi1g",
          "author": "Idrisnite",
          "body": "I can kinda relate but instead of hate or anger it's pure jealousy and guilt and disgust with myself for not eating even less. Like wow, look at the self control they have. And they're not even obsessive about it. I need to do better. Feels terrible.",
          "created_utc": 1611340600.0
        },
        {
          "id": "gk8hn4g",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611347488.0
        }
      ]
    }
  ]
}