{
  "id": "l32qhp",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1611367428.0,
  "title": "Request: About to admit into a treatment center and my boyfriend is leaving me",
  "selftext": "So I’ve struggled for a bit now with anorexia. It’s been going on long enough that I now need to get checked into an ED treatment facility. I didn’t want to go at first because I didn’t think I was bad enough to warrant that yet.\n\nMy boyfriend gave me the ultimatum of get help there or I’ll break up with you. Fair enough. I’m almost done with the process and I’m being admitted Tuesday. I told him I’ll do my best. I want to get better so we can have a future together. He promised he would stay through this first bit of treatment, which will be over the next 10-12 weeks.\n\nNext thing I know a friend of ours is telling me that he’s planning on breaking up with me pretty soon after I admit. Like the first time I get visitations (1-2 weeks after admitting) he’s ending it. I don’t know what to do. He was a big part of my motivation to get better and this is the worst possible time for it to happen. We’ve been together 3 years and it’s all coming crumbling down. He doesn’t believe I’ll get better long term and that I’ll always be a anorexic. I feel very given up on.\n\nI’m more so looking for advice on how to deal with it, not really on how to make him stay. I was scared enough going into treatment, but now I have to do it alone? I’m wondering if there is even a point to getting better now.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l32qhp/request_about_to_admit_into_a_treatment_center/",
  "score": 85,
  "num_comments": 14,
  "comments": [
    {
      "id": "gka98tj",
      "author": "nodaybuttoday__",
      "body": "You’re not doing it alone. We got you. Do it for yourself and it will last, trust me. If you are your #1 motivation, your recovery can and will sustain long term. You don’t need to recover for anyone else, and it sounds like he was just looking for a reason to leave. It hurts like hell I’m sure, but if someone’s not happy, that’s their own shit that they can and will need to reckon with. You have a battle ahead of you that you’re more than strong enough to fight—you just have to be anchored in your reason to do so. You are worth this, and everything you need to be in remission is already within you; always has been. If you need anything EVER, my messages are open. You can do this.",
      "created_utc": 1611370446.0,
      "score": 52,
      "context": []
    },
    {
      "id": "gka7gv3",
      "author": "kathahitas",
      "body": "I don't have advice, but sending you love and good vibes. So proud of you for healing. <3",
      "created_utc": 1611369798.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gkadvzw",
      "author": "smol_lydia",
      "body": "I’ve been there. My ex broke up with me because my anorexia was “too much” for him. I did nine months in treatment and now, 3 years later, I’m engaged to a wonderful partner who supports my recovery. \nThe pain is incredibly intense at first and I empathize with you. But you deserve someone who wants to see you as your best self without using threats or ultimatums",
      "created_utc": 1611372664.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gkaj50h",
      "author": "None",
      "body": "I dealt with a similar situation about a year ago and I want you to know that you honestly dodged a bullet. A partner who is unsupportive when you are dealing with a serious mental health issue is not someone you want to spend the rest of your life with. The best thing you can do is recover for yourself and leave behind the people who are unreliable and not worth your energy and time",
      "created_utc": 1611375106.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gkb9rhn",
      "author": "BrowncoatIona",
      "body": "I'll share a bit of my own experience: I broke up with my fiance about a month before going into ED treatment for the first time (which was definitely part of it). They had also been my best friend for nearly 14 years and we had been engaged for over a year. \n\nIt was a bad breakup. \n\nHowever, honestly?? It was probably one of the best times we could've ended it. \nIn treatment (especially residential), you (should hopefully) have many people to talk at almost any hour. Not saying you will right away, but having that knowledge alone helps a lot. It took a lot of time for me to talk to the staff about what was going on, but I did get there. \nAnd there are people to keep you accountable, to help you from slipping too far. I shudder to think about how I would've dealt with that breakup outside of treatment. \n\nTreatment was really, really hard. And having that happen beforehand only makes it harder. \nBut I'm still unbelievably thankful that it happened right before.\n\nFor reference, we broke up over 5 years ago. I didn't gain this perspective for a long time. \n\nTake advantage of your resources and be proud of yourself for entering treatment. You'll be better for it.",
      "created_utc": 1611385990.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gka9qbd",
      "author": "DootDootFella",
      "body": "Hey, I hope this doesn’t sound weird or mean, but he doesn’t deserve you. If he can’t deal with it then he shouldn’t be with you at your best. Don’t worry about him, I’m sure you’ll find someone a lot better for you that will treat you better. Your not alone in this! If you need anyone to talk to, my messages on here are open, and I know people that care about you are here for you too. I know how hard ED’s can be. You got this!",
      "created_utc": 1611370619.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gkd432o",
      "author": "TravelbugRunner",
      "body": "I’m sorry you’re really struggling. \n\nI’ve been inpatient, too and it’s really stressful so I completely understand where you’re coming from. \n\nThe main thing about recovery is: \n\nYou have to do it for yourself. \n\nDon’t try to do it for your family, boyfriend, or job. Because you’re health and life are yours not theirs. \n\nIt’s important that you recover for yourself. \n\nThis is really hard to do. And it’s best not to think of it as “all or nothing”. Recovery is usually going to be a slow, incremental thing that takes time. \n\nI just hope you know that there are other people here that know what it’s like. \n\nI know you can recover and I wish you well! 💜",
      "created_utc": 1611407322.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gkb3mqn",
      "author": "sarathedime",
      "body": "I’ve dated people who give up on me because of my eating disorder. Looking back, they had a lot of their own flaws like commitment issues where they were looking for the perfect woman. One guy, who was actively cheating on me, said I wouldn’t be a good wife and mother because of this. \n\nThere were so many times I thought I was alone or wasn’t good enough. I really loved them because I love deeply. \n\nI wish I could give you the answer. I wish I could tell you how to recover without support from someone that close. But it’s worth it. You *deserve* it- a life without obsessing over the eating disorder where you can finally relish in the little moments of life.",
      "created_utc": 1611382656.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkfjjdt",
      "author": "ccctee",
      "body": "Hey, \n\nSorry this is happening. It's definitely not an ideal time but I suppose there's no good time for heartbreak. \n\nI think it's incredible that you've decided to go to treatment. It's a huge step and a difficult one, I know. It's tough that much of your motivation has come from your partner but, regardless, it's a positive thing that you're pursuing recovery. \n\nI know it is hard to see now but this will all be for the best. Breakups are SO hard. I remember my last breakup ... It was around the 4yr mark and I was finally commiting to recovery. He had said he wanted me to recover ALL along but I was too scared. Part of me \"couldn't\" recover because I was scared he would leave me when I gained as much weight as I needed to. I thought \"he was attracted to me when he met me at this weight... He can't possibly be attracted to me when I gain 30, 40, 50+ pounds\". This was legit my GREATEST fear at the time. \n\nSo I started recovery. I gained weight. I gained A LOT of weight. It was really hard but I kept going. I was super motivated to change my life and, yes, part of that was related to him and our future together. However, once my weight plateaued a few months later and I was feeling MUCH better (not in terms of body image but in terms of my freedom with food, energy levels, personality, etc.), he decided \"he wasn't in love with me anymore\". You can imagine my anger, shame, disgust. It was so hard - literally my worst nightmare coming true. And it was hard for a long time. \n\nHowever, it's two years later now and I can HONESTLY say it's the best thing that ever happened to me. It made me realize that I had MY OWN motivation to recover. It made me realize he was an ass hole if he didn't want me in his life at my healthiest because I am so much better of a person overall when I'm recovered. It made me realize how selfish he was to do that when he did. Now, I look back and I'm so glad he ended it so I could find someone who loved me for my personality and my true strengths, not because I looked a certain way. I also don't know if my recovery could have lasted because our relationship started when I was much under my healthy bodyweight and I don't know that I could have felt attractive to him at a bigger size. I have since found a partner that loves me so much more than that man could have. My current partner thinks I am beautiful, encourages me to eat, loves my soft belly, grabs my bigger bum/thighs with the cutest boyish grin and, most importantly, loves me for my sense of humour, kindness and values. \n\nI know it may be hard to see now but you will make it through this. You deserve recovery for YOU. If you want to, you'll meet someone who loves you at your healthiest and they will love you for all that you are. If this guy can imagine a life without you in it, and be okay with that, he doesn't deserve any more of your time. Focus on yourself and your recover for now and, I guarantee you, your life will open up to countless opportunities and amazing people/experience. \n\nRooting for you, friend ♥️.",
      "created_utc": 1611430300.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkfypca",
      "author": "houston_veronica",
      "body": "Agree on all the other wise comments here, and wanted to mainly say: this dude would leave for any of the problems that Future You would have. It's not the anorexia...it's him. \nIt's okay - not everyone is equipped to be an adult! But there is someone wonderful for you, who will love and appreciate you as you are, will be, or could be. Things are never perfect in any relationship; your own struggle is this ED, but every human has a struggle.Ed's just happen to be more evident on the outside (not always) - so people judge. But never you mind! You are going to be so much stronger, happier and truly ready to live life if you give treatment a true chance. Try your best - take advantage of every single program and moment.  Believe me - you  have so many reasons  to recover. \nPS: It's always possible that the person isn't totally accurate in your BF's plans - it seems odd that they would know his plans, unless you guys are very  young in age-- in which case, it may be even better to be free of any relationships that could weigh you down. Also: you may feel like ED's make you feel lighter or more free, but you are dragging around a huge ball and chain. If you are willing to trust the process, you're going to be feeling light as a feather - free   and full of hope. Not perfect, but so much better.",
      "created_utc": 1611434993.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gka0ulc",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1611367428.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkg9z6o",
      "author": "Desperate-Elk1833",
      "body": "People come into your life for a reason just as much as people leave your life for a reason , you may not see it now but this is a beautiful new beginning for you . You seem smart enough to know that anyone who would ride in a limo with you but not walk with you if need be, is definitely not worth a second thought. In order to completely love someone ; you first have to love your self : only then can you love someone else. I’m so proud of your courage to go to treatment. My daughter also has an eating disorder and she is struggling . I don’t usually write long comments but this one touched me . The most important thing for you to think about is your own well being and you have taken the first step by seeking help. Take your days one at a time. If anyone would be so cowardly to leave a person they care about in such a vulnerable moment ; they are trash. My mom always told me that “you have to kiss a few frogs before you get a prince” and your prince will come. Please update us ; I’ll be so happy to hear how treatment goes. YOU can do this girl !",
      "created_utc": 1611438481.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkfrulx",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1611432904.0,
      "score": 7,
      "context": [
        {
          "id": "gka98tj",
          "author": "nodaybuttoday__",
          "body": "You’re not doing it alone. We got you. Do it for yourself and it will last, trust me. If you are your #1 motivation, your recovery can and will sustain long term. You don’t need to recover for anyone else, and it sounds like he was just looking for a reason to leave. It hurts like hell I’m sure, but if someone’s not happy, that’s their own shit that they can and will need to reckon with. You have a battle ahead of you that you’re more than strong enough to fight—you just have to be anchored in your reason to do so. You are worth this, and everything you need to be in remission is already within you; always has been. If you need anything EVER, my messages are open. You can do this.",
          "created_utc": 1611370446.0
        }
      ]
    },
    {
      "id": "gkaxlp5",
      "author": "ilikebananabread",
      "body": "Seconded! Never try to make a man “stay”. I know you love him and I have been there too... but if you have started to wonder how to get him to stay, then he is not worth your time (in my opinion..). You are not your eating disorder! You are much more and things will change. You have everything in you to pull through and make your life what you want to make it. And you deserve to be with someone who cheers you on every step of the way and believes in you, as much as or more than how much you believe in yourself. I can’t imagine how hard it must be right now. But just remember that every day is a new potentially sunnier day. I was in ED hell for years before I pulled through, and having my ED feels like a dream of the past. It doesn’t come to mind at all now, for weeks at a time. I forget about that part of my life more often than I could ever imagine. I never thought I would get through, but it’s possible! And I have met partners along the way who would’ve stuck by me and believed in me :) good luck, you got this!! We are cheering you on!! :)\n\nEdit: so sorry, I’m very tired and must have misread your post. I misunderstood but I see now you are not trying to make him stay! So sorry :’( But yeah, if you need any other advice on how to handle the situation, feel free to PM me!",
      "created_utc": 1611380241.0,
      "score": 7,
      "context": [
        {
          "id": "gka9qbd",
          "author": "DootDootFella",
          "body": "Hey, I hope this doesn’t sound weird or mean, but he doesn’t deserve you. If he can’t deal with it then he shouldn’t be with you at your best. Don’t worry about him, I’m sure you’ll find someone a lot better for you that will treat you better. Your not alone in this! If you need anyone to talk to, my messages on here are open, and I know people that care about you are here for you too. I know how hard ED’s can be. You got this!",
          "created_utc": 1611370619.0
        }
      ]
    },
    {
      "id": "gkftz3i",
      "author": "nodaybuttoday__",
      "body": "Some people help us by showing us we can’t count on them. Even those who hurt us are in our lives to teach us something.",
      "created_utc": 1611433531.0,
      "score": 2,
      "context": [
        {
          "id": "gka98tj",
          "author": "nodaybuttoday__",
          "body": "You’re not doing it alone. We got you. Do it for yourself and it will last, trust me. If you are your #1 motivation, your recovery can and will sustain long term. You don’t need to recover for anyone else, and it sounds like he was just looking for a reason to leave. It hurts like hell I’m sure, but if someone’s not happy, that’s their own shit that they can and will need to reckon with. You have a battle ahead of you that you’re more than strong enough to fight—you just have to be anchored in your reason to do so. You are worth this, and everything you need to be in remission is already within you; always has been. If you need anything EVER, my messages are open. You can do this.",
          "created_utc": 1611370446.0
        },
        {
          "id": "gkfrulx",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611432904.0
        }
      ]
    }
  ]
}