{
  "id": "l49old",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1611528396.0,
  "title": "Request: The difficulty of losing weight naturally makes me want to go back to my ED.",
  "selftext": "So I consider myself 3 years recovered. However, right now I'm overweight. Im not confident with my body and I've been working hard to get to where I want to be. Im working out daily and calorie counting. But progress is so slow for the amount of work I think I'm putting in. I know this is the healthy and normal way to lose weight. But I keep wishing I could go back to my ED habits to just shed it off fast. Can any one offer advice or relate to this? How do you get on shape in a healthy way without constantly wanting to go back to your old ways?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l49old/request_the_difficulty_of_losing_weight_naturally/",
  "score": 131,
  "num_comments": 30,
  "comments": [
    {
      "id": "gknbewa",
      "author": "CherrySlushee",
      "body": "in the long run it’s better to lose weight slowly, it’s easier to keep off and your body has more time to adapt (less loose skin, etc.)",
      "created_utc": 1611530399.0,
      "score": 35,
      "context": []
    },
    {
      "id": "gknch2h",
      "author": "witchinn",
      "body": "Im in the same boat, had atypical anorexia from the time i was 12-19 so im almost 3 years recovered but now im overweight and constantly think about falling back into old habits to watch the weight fall off. I dont know how to help you just wanted to let you know i relate.",
      "created_utc": 1611530850.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gkndhf4",
      "author": "my_catsbestfriend",
      "body": "For me it’s knowing that it’s change that’ll last and is healthy and isn’t hurting me in the process. The pounds I do lose come off naturally with my lifestyle change instead of rapid weight loss through my ED behaviors, and are more likely to remain off and not come back like they did when I had first recovered. (I gained a lot because of my stressful life circumstances, a bad therapist, and college, but have lost enough to where I’m at a healthy weight for me)",
      "created_utc": 1611531323.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gko38p9",
      "author": "MissRiss918",
      "body": "I am in this space so often. SO SO often. I would say that I have been “practicing recovery” for just about five years now. Within this time, based on life and other health circumstances my weight has gone up. My weight has gone down. My weight has mostly stayed the same, give or take a few pounds, for the last year or so.\n\nI am at the higher end of a healthy weight for my height, but am not at a weight in which I feel my best. I currently do not feel 100% in mind or body because of my weight, so I would like to lose weight by means of healthy lifestyle changes.\n\nIt doesn’t seem to work the same way it does for others. Then again, I am the absolute WORST judge of all things when it comes to my body and food. It is still something I am practicing I suppose.\n\nThe thing that keeps me in line, refusing to return to my eating disorder: \n\nRemembering. I remember what I was like. I remember how insufferable I was, not only for the people around me, but also insufferable to be in my own skin. I wanted to die. There was no joy. Relationships were shit.\n\nNow? I can truly say, for the first time that I can remember, I am happy. So what if I am not at a number that makes me FEEL happy? That number won’t make me happy. Feelings aren’t facts. \n\nI need to be reminded this. Daily. Because it is so tempting to chase the feeling. I’m romanticizing the entire experience of being terribly terribly ill. How perverse. How heartbreaking. But when reminded this is not truth, it is easier to continue practicing recovery.\n\nNot sure if any of this makes sense or helps. You aren’t alone though!",
      "created_utc": 1611544305.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gkogy5g",
      "author": "None",
      "body": "Disordered eating will increase anxiety and the stress hormone cortisol in your body.\n\nYou'll feel irritable, won't sleep the best and will likely start binge/starve cycles....\n\nCortisol promotes fluid retention and also promotes fat storage.\n\nYou'll get there quicker but you'll be an absolute wreck of a human. And, when will you stop? Once the habits form again, it is very difficult to stop because your anxiety will be so high that you FEAR stopping.\n\nMaybe only weigh yourself or look in the mirror naked once a month. Keep doing the daily work then check progress once a month. You're establishing habits and lifestyle changes that will last, so you'll have lasting weight loss and never have to do it again. The time will pass anyway.... Just plod along and keep chipping away... Focus on changes you CAN see.. Let that keep you on the straight and narrow.\n\nAsk yourself:\nWhy did you start doing it the healthy way to begin with ?? There might be your own answer :-)",
      "created_utc": 1611552896.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gknf6qh",
      "author": "paradoxrevel",
      "body": "This is a tough place! Is a relapse really worth it for that short-lived gratification of weight loss? (I'm asking myself this most days, too.) It's helped me to look into HAES and what the actual research says about diet outcomes. In truth, the best predictor of weight gain in the long term is dieting. For most people, dieting works short term, but there is no evidence that it works past 2 years. At the 5 year mark, most dieters have regained all the weight they lost and many have gained more. Anti-diet research and intuitive eating are saving my sanity. It's not easy, but it's a better quality of life than living with an eating disorder. Take care of yourself, friend!",
      "created_utc": 1611532159.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gko65k1",
      "author": "akfireandice",
      "body": "I was just crying over this last night. It's all I can think of right now. I hate that I gained weight over quarantine after I had lost a bunch from a battle with medical anorexia. Now I'm eating a little less than a normal human, dancing 3-9 hours a week, and doing yoga every couple of days, and it feels like I just keep gaining weight, even though I know that's not necessarily true. It's so discouraging, but thankfully I have a husband who keeps me accountable, makes sure I maintain healthy eating habits, and works out with me. \n\nYou're not alone, but don't take that as a sign that these are good ideas to hold onto! I think accountability is helpful. Having someone who knows what you struggle with and who can help you maintain healthy habits will make it a lot easier. Do you have someone like a roommate, parent, or sibling who you spend a lot of time with and trust to be able to help you?",
      "created_utc": 1611545920.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gko8efh",
      "author": "absfae",
      "body": "I feel this. I gained quite a bit of weight last year from medications and drinking too much and am finally close to what I was before I gained, which was a healthy weight. It’s taken me a lot of time to lose this the healthy way. Although at the height of my poor body image I did slip back into ED behaviors. I have made a lot of changes, including changing my mental health medications. Moderate-intense exercise and balanced eating is all you can do and expect of yourself if you don’t want to get too intense. \n\nIt is easy to go back to behaviors, but those are not only bad for your physical and mental health, but they are not sustainable. You will inevitably burn out. Focus on moving your body in ways that make you feel good and eat foods that make you satisfied. Not need to go to extremes. Also finding health and fitness professionals that are good at educating diet and exercise in healthy, conscious ways that don’t promote ED behaviors or unrealistic results has been so helpful for me!\n\nEdited: I should also say sometimes it’s necessary to gain weight in recovery. I do not at all believe it is necessary to lose weight when considered “overweight”. Plenty of people can be healthy and overweight. If you able to talk to a RD or nutritionist that would probably be super helpful.",
      "created_utc": 1611547234.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gkoldz4",
      "author": "sweetparamour79",
      "body": "Lord preach!! I've had a coach for over a year (recovered for pretty much 4 years). Learning about macros and doing weights. It's sooooo hard to be patient. I know my shape looks better but my god it is hard. I recently started skipping (something I do to lose weight) and she told me off lol \nSometimes having someone to make you stick to the plan is a good thing.",
      "created_utc": 1611556357.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkonxk2",
      "author": "Emptyfulfillment",
      "body": "It is so much harder but it is worth it and also the weight will stick more rather than I eat a grape and I’m bloated and gained 3 pounds over night \nHonestly the more often you let yourself eat the better  and I’ve been at this 10 years mah dude",
      "created_utc": 1611558522.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gko7i00",
      "author": "Queenofwands1212",
      "body": "I feel the same but the paradox is that the Ed will continue to fuck up the metabolic rate causing metabolic damage and digestion issues or hormonal imbalance. I feel like I can’t win. But I know that the restrict purge over eat cycle will not help me lose weight it’ll make me gain",
      "created_utc": 1611546701.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkorohy",
      "author": "None",
      "body": "Losing weight fast doesn't necessarily mean you'll be able to keep it off in the long term. The best way (based on my research so this is just my **non**\\-professional opinion) to permanently lose fat is to gain muscle. Important to note that losing weight is not the same as losing fat. Progress might be slow because you may not be giving your body time to recover and repair muscles. The attached link to this post is a video by a youtuber who can explain it much more than I ever can. Natacha bases everything she says on science and not bullshit/diet culture. She's helped me so much - I've had a history of overtraining and extreme calorie restriction and I sincerely hope she'll be able to help you too. [https://www.youtube.com/watch?v=WTpjQs0atxs](https://www.youtube.com/watch?v=WTpjQs0atxs)",
      "created_utc": 1611561945.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkpmbqd",
      "author": "heyitsfranklyn",
      "body": "I’m glad you posted this. I have been feeling the same way. I’m overweight in my opinion and every time I start to healthily loose weight I get discouraged and wish I could start back with my ED habits. I have a scale and count calories so I am aware what I am consuming but it is taking forever snd I am having a hard time loosing any weight. I am working out, drinking almost a gallon of water a day, eating healthy. Some times I wish I could go back to my ED. It’s hard but hearing from other people gives me hope and makes me feel like I’m not alone. Good luck snd hope your weight loss journey goes well and makes you happy and healthy!",
      "created_utc": 1611586155.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gkqykfv",
      "author": "sylvia-plant",
      "body": "I’m in the same exact boat as you. I had an ED for a year or two, and now I’ve been in recovery for about a year, and I’ve gained weight since I’ve been in recovery. Now, I’m overweight, whereas I was underweight during my ED. I can’t even calorie count or else I’ll start relapsing, but what I’m telling myself is that I’m much happier to be eating regularly again instead of not eating at all. I don’t have a grand solution for you, but I do want you to know you’re not alone",
      "created_utc": 1611607264.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gl5zwfe",
      "author": "wednesdaycatmeow",
      "body": "I feel this so much. I’m going through the same thing, it’s so much healthier for us to do it slowly even though it’s difficult. \nI’m trying to spend less time online and just focus on other things in my daily life. I’ve been making myself go for a “nature walk” to the parks nearby and sometimes I find myself walking for longer than I thought. This helps me feel like ok I’m gonna go look at the birds vs mindlessly run just to burn calories.",
      "created_utc": 1611878191.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gko53t8",
      "author": "Vessecora",
      "body": "The slow progress may be healthy but coming from a dietetics perspective, a person in recovery from an eating disorder should avoid calorie counting and exercising for the sole purpose of losing weight. Both can trigger relapse and neither are healthy in the long term, even for people without a history of eating disorders.",
      "created_utc": 1611545335.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkn6rul",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1611528396.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gljidiv",
      "author": "Gillilandk",
      "body": "As I read your post I felt like I was writing it myself. I cried to my husband tonight because I worked so hard to overcome my ed three years ago without help outside of my husband. I just went to my Dr last week for an unrelated reason but asked him for a referral to a dietitian or nutritionist because I was afraid that if I started calorie counting again I would fall back into my old habits. He suggested trying to count calories to see how many I am normally eating/day but not to cut any the first week, then cut 15% for a few weeks, ultimately slowly decreasing the amount to what I *should* be eating. But all I heard and what has stuck with me is \"cut calories\".  It's only been 5 days and I've slipped so quickly back into old habits and as much as I hate to admit it, it feels so good. I don't want it to feel good but it's hard to let go of that feeling.",
      "created_utc": 1612140378.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gnor55d",
      "author": "DrDrama19",
      "body": "Totally get you! It makes me wonder if i'll ever be gully recovered cuz am ED is not obly behviour but thoughts also 🥺",
      "created_utc": 1613508203.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gko78en",
      "author": "burningfirelily",
      "body": "This is wonderful and super helpful. I needed this so much, really. Thank you! I need to remember that I do feel happier now than I ever did when I was going through it with my ED. And this is sustainable and gives me a better chance at long term success and happiness. Things you'll never get by going back to ED tendencies.",
      "created_utc": 1611546543.0,
      "score": 7,
      "context": [
        {
          "id": "gko38p9",
          "author": "MissRiss918",
          "body": "I am in this space so often. SO SO often. I would say that I have been “practicing recovery” for just about five years now. Within this time, based on life and other health circumstances my weight has gone up. My weight has gone down. My weight has mostly stayed the same, give or take a few pounds, for the last year or so.\n\nI am at the higher end of a healthy weight for my height, but am not at a weight in which I feel my best. I currently do not feel 100% in mind or body because of my weight, so I would like to lose weight by means of healthy lifestyle changes.\n\nIt doesn’t seem to work the same way it does for others. Then again, I am the absolute WORST judge of all things when it comes to my body and food. It is still something I am practicing I suppose.\n\nThe thing that keeps me in line, refusing to return to my eating disorder: \n\nRemembering. I remember what I was like. I remember how insufferable I was, not only for the people around me, but also insufferable to be in my own skin. I wanted to die. There was no joy. Relationships were shit.\n\nNow? I can truly say, for the first time that I can remember, I am happy. So what if I am not at a number that makes me FEEL happy? That number won’t make me happy. Feelings aren’t facts. \n\nI need to be reminded this. Daily. Because it is so tempting to chase the feeling. I’m romanticizing the entire experience of being terribly terribly ill. How perverse. How heartbreaking. But when reminded this is not truth, it is easier to continue practicing recovery.\n\nNot sure if any of this makes sense or helps. You aren’t alone though!",
          "created_utc": 1611544305.0
        }
      ]
    },
    {
      "id": "gkom2n2",
      "author": "GuessIllGoFuckMyself",
      "body": "So don’t diet or modify your life to try to get to a healthy weight that makes you feel good? I get HAES has value in certain aspect but telling people to not bother even TRYING to diet and get healthy is so defeatist.",
      "created_utc": 1611556934.0,
      "score": 4,
      "context": [
        {
          "id": "gknf6qh",
          "author": "paradoxrevel",
          "body": "This is a tough place! Is a relapse really worth it for that short-lived gratification of weight loss? (I'm asking myself this most days, too.) It's helped me to look into HAES and what the actual research says about diet outcomes. In truth, the best predictor of weight gain in the long term is dieting. For most people, dieting works short term, but there is no evidence that it works past 2 years. At the 5 year mark, most dieters have regained all the weight they lost and many have gained more. Anti-diet research and intuitive eating are saving my sanity. It's not easy, but it's a better quality of life than living with an eating disorder. Take care of yourself, friend!",
          "created_utc": 1611532159.0
        }
      ]
    },
    {
      "id": "gko7nyx",
      "author": "burningfirelily",
      "body": "Yes my boyfriend helps me out actually. But I dont communicate enough with him so I think that would be really good too. Hes my workout buddy as well and that has kept me on track so far :)",
      "created_utc": 1611546799.0,
      "score": 4,
      "context": [
        {
          "id": "gko65k1",
          "author": "akfireandice",
          "body": "I was just crying over this last night. It's all I can think of right now. I hate that I gained weight over quarantine after I had lost a bunch from a battle with medical anorexia. Now I'm eating a little less than a normal human, dancing 3-9 hours a week, and doing yoga every couple of days, and it feels like I just keep gaining weight, even though I know that's not necessarily true. It's so discouraging, but thankfully I have a husband who keeps me accountable, makes sure I maintain healthy eating habits, and works out with me. \n\nYou're not alone, but don't take that as a sign that these are good ideas to hold onto! I think accountability is helpful. Having someone who knows what you struggle with and who can help you maintain healthy habits will make it a lot easier. Do you have someone like a roommate, parent, or sibling who you spend a lot of time with and trust to be able to help you?",
          "created_utc": 1611545920.0
        }
      ]
    },
    {
      "id": "gkqf1dy",
      "author": "p00pingcat",
      "body": "Is the weight gain from hormone imbalances and insulin resistance ? Worth going to an endocrinologist to check it out",
      "created_utc": 1611598647.0,
      "score": 2,
      "context": [
        {
          "id": "gko65k1",
          "author": "akfireandice",
          "body": "I was just crying over this last night. It's all I can think of right now. I hate that I gained weight over quarantine after I had lost a bunch from a battle with medical anorexia. Now I'm eating a little less than a normal human, dancing 3-9 hours a week, and doing yoga every couple of days, and it feels like I just keep gaining weight, even though I know that's not necessarily true. It's so discouraging, but thankfully I have a husband who keeps me accountable, makes sure I maintain healthy eating habits, and works out with me. \n\nYou're not alone, but don't take that as a sign that these are good ideas to hold onto! I think accountability is helpful. Having someone who knows what you struggle with and who can help you maintain healthy habits will make it a lot easier. Do you have someone like a roommate, parent, or sibling who you spend a lot of time with and trust to be able to help you?",
          "created_utc": 1611545920.0
        }
      ]
    },
    {
      "id": "gkqbj2h",
      "author": "burningfirelily",
      "body": "I'll take a look at this, thank you :)",
      "created_utc": 1611597131.0,
      "score": 3,
      "context": [
        {
          "id": "gkorohy",
          "author": "None",
          "body": "Losing weight fast doesn't necessarily mean you'll be able to keep it off in the long term. The best way (based on my research so this is just my **non**\\-professional opinion) to permanently lose fat is to gain muscle. Important to note that losing weight is not the same as losing fat. Progress might be slow because you may not be giving your body time to recover and repair muscles. The attached link to this post is a video by a youtuber who can explain it much more than I ever can. Natacha bases everything she says on science and not bullshit/diet culture. She's helped me so much - I've had a history of overtraining and extreme calorie restriction and I sincerely hope she'll be able to help you too. [https://www.youtube.com/watch?v=WTpjQs0atxs](https://www.youtube.com/watch?v=WTpjQs0atxs)",
          "created_utc": 1611561945.0
        }
      ]
    },
    {
      "id": "gkqbwmy",
      "author": "burningfirelily",
      "body": "Same to you. One thing that helps me stay hopeful and resilient is that even though I dont \"see\" results as fast, I do FEEL them. I feel more energetic, accomplished, and overall happier and healthier.",
      "created_utc": 1611597291.0,
      "score": 3,
      "context": [
        {
          "id": "gkpmbqd",
          "author": "heyitsfranklyn",
          "body": "I’m glad you posted this. I have been feeling the same way. I’m overweight in my opinion and every time I start to healthily loose weight I get discouraged and wish I could start back with my ED habits. I have a scale and count calories so I am aware what I am consuming but it is taking forever snd I am having a hard time loosing any weight. I am working out, drinking almost a gallon of water a day, eating healthy. Some times I wish I could go back to my ED. It’s hard but hearing from other people gives me hope and makes me feel like I’m not alone. Good luck snd hope your weight loss journey goes well and makes you happy and healthy!",
          "created_utc": 1611586155.0
        }
      ]
    },
    {
      "id": "gkq1zjv",
      "author": "None",
      "body": "Intuitive eating and not trying to eat healthy is just as bad, it's almost like a different kind of ed, imo. I totally agree that's defeatist. I wish so many people didn't give in to just giving up in order to \"recover\". That isn't what I would ever call recovering.",
      "created_utc": 1611593018.0,
      "score": 4,
      "context": [
        {
          "id": "gknf6qh",
          "author": "paradoxrevel",
          "body": "This is a tough place! Is a relapse really worth it for that short-lived gratification of weight loss? (I'm asking myself this most days, too.) It's helped me to look into HAES and what the actual research says about diet outcomes. In truth, the best predictor of weight gain in the long term is dieting. For most people, dieting works short term, but there is no evidence that it works past 2 years. At the 5 year mark, most dieters have regained all the weight they lost and many have gained more. Anti-diet research and intuitive eating are saving my sanity. It's not easy, but it's a better quality of life than living with an eating disorder. Take care of yourself, friend!",
          "created_utc": 1611532159.0
        },
        {
          "id": "gkom2n2",
          "author": "GuessIllGoFuckMyself",
          "body": "So don’t diet or modify your life to try to get to a healthy weight that makes you feel good? I get HAES has value in certain aspect but telling people to not bother even TRYING to diet and get healthy is so defeatist.",
          "created_utc": 1611556934.0
        }
      ]
    },
    {
      "id": "gko7yuv",
      "author": "akfireandice",
      "body": "That's good! Take it from someone who's been on the less communicative side - communication is KEY. Not just for your physical and mental health, but for every part of your relationship. As you get farther in your relationship and develop trust, start communicating about EVERYTHING. It'll make life go much more smoothly. Good luck on losing weight healthily and on your relationship!",
      "created_utc": 1611546979.0,
      "score": 3,
      "context": [
        {
          "id": "gko65k1",
          "author": "akfireandice",
          "body": "I was just crying over this last night. It's all I can think of right now. I hate that I gained weight over quarantine after I had lost a bunch from a battle with medical anorexia. Now I'm eating a little less than a normal human, dancing 3-9 hours a week, and doing yoga every couple of days, and it feels like I just keep gaining weight, even though I know that's not necessarily true. It's so discouraging, but thankfully I have a husband who keeps me accountable, makes sure I maintain healthy eating habits, and works out with me. \n\nYou're not alone, but don't take that as a sign that these are good ideas to hold onto! I think accountability is helpful. Having someone who knows what you struggle with and who can help you maintain healthy habits will make it a lot easier. Do you have someone like a roommate, parent, or sibling who you spend a lot of time with and trust to be able to help you?",
          "created_utc": 1611545920.0
        },
        {
          "id": "gko7nyx",
          "author": "burningfirelily",
          "body": "Yes my boyfriend helps me out actually. But I dont communicate enough with him so I think that would be really good too. Hes my workout buddy as well and that has kept me on track so far :)",
          "created_utc": 1611546799.0
        }
      ]
    },
    {
      "id": "gkqaxaw",
      "author": "GuessIllGoFuckMyself",
      "body": "Exactly... I’m trying to recover and if I have into every whim I’d be 300lbs. I know I’m going to gain SOME during recovery but the goal is to have a healthy relationship with food to make my body happy not give into every desire. Imagine doing that with your budget.",
      "created_utc": 1611596872.0,
      "score": 3,
      "context": [
        {
          "id": "gknf6qh",
          "author": "paradoxrevel",
          "body": "This is a tough place! Is a relapse really worth it for that short-lived gratification of weight loss? (I'm asking myself this most days, too.) It's helped me to look into HAES and what the actual research says about diet outcomes. In truth, the best predictor of weight gain in the long term is dieting. For most people, dieting works short term, but there is no evidence that it works past 2 years. At the 5 year mark, most dieters have regained all the weight they lost and many have gained more. Anti-diet research and intuitive eating are saving my sanity. It's not easy, but it's a better quality of life than living with an eating disorder. Take care of yourself, friend!",
          "created_utc": 1611532159.0
        },
        {
          "id": "gkom2n2",
          "author": "GuessIllGoFuckMyself",
          "body": "So don’t diet or modify your life to try to get to a healthy weight that makes you feel good? I get HAES has value in certain aspect but telling people to not bother even TRYING to diet and get healthy is so defeatist.",
          "created_utc": 1611556934.0
        },
        {
          "id": "gkq1zjv",
          "author": "None",
          "body": "Intuitive eating and not trying to eat healthy is just as bad, it's almost like a different kind of ed, imo. I totally agree that's defeatist. I wish so many people didn't give in to just giving up in order to \"recover\". That isn't what I would ever call recovering.",
          "created_utc": 1611593018.0
        }
      ]
    },
    {
      "id": "gkqxqf0",
      "author": "paradoxrevel",
      "body": "It’s a fairly common misconception that people have about HAES and intuitive eating not aligning with health. It’s frustrating because we’ve all been fed the lie that health has a “look” when in reality, you can tell very, very little about someone’s health based on their appearance. Weight loss is not a behavior - it’s a potential outcome of pursuing health. And for someone in recovery from an ED, pursuing weight loss is almost a guaranteed relapse or path to pseudo-recovery/quasi-recovery. \n\nHAES means that regardless of body size, humans deserve to be treated with respect and given access to health treatment without a side of weight-stigma (which has been shown to be more harmful to health than living in a larger body). I don’t know how anyone with a heart who genuinely understands this philosophy could be against HAES. It’s cruel to judge and dismiss people bc of their weight. An example is how ED treatment is sometimes withheld from people in bigger bodies. \n\nIntuitive eating is not at all about eating unhealthily or giving in to every urge. It’s about listening to your body. Hunger, fullness, satiety, even learning ways to cope with your emotions are all principles of this practice. \n\nWhich is why I said to look into these philosophies. For me, my ED was a lot about control. Trying to recover from it with more control never yielded any results. Surrendering to my body and learning more about diet culture, HAES, and IE helped. ",
      "created_utc": 1611606890.0,
      "score": 2,
      "context": [
        {
          "id": "gknf6qh",
          "author": "paradoxrevel",
          "body": "This is a tough place! Is a relapse really worth it for that short-lived gratification of weight loss? (I'm asking myself this most days, too.) It's helped me to look into HAES and what the actual research says about diet outcomes. In truth, the best predictor of weight gain in the long term is dieting. For most people, dieting works short term, but there is no evidence that it works past 2 years. At the 5 year mark, most dieters have regained all the weight they lost and many have gained more. Anti-diet research and intuitive eating are saving my sanity. It's not easy, but it's a better quality of life than living with an eating disorder. Take care of yourself, friend!",
          "created_utc": 1611532159.0
        },
        {
          "id": "gkom2n2",
          "author": "GuessIllGoFuckMyself",
          "body": "So don’t diet or modify your life to try to get to a healthy weight that makes you feel good? I get HAES has value in certain aspect but telling people to not bother even TRYING to diet and get healthy is so defeatist.",
          "created_utc": 1611556934.0
        },
        {
          "id": "gkq1zjv",
          "author": "None",
          "body": "Intuitive eating and not trying to eat healthy is just as bad, it's almost like a different kind of ed, imo. I totally agree that's defeatist. I wish so many people didn't give in to just giving up in order to \"recover\". That isn't what I would ever call recovering.",
          "created_utc": 1611593018.0
        }
      ]
    },
    {
      "id": "gkqxpt4",
      "author": "paradoxrevel",
      "body": "It’s a fairly common misconception that people have about HAES and intuitive eating not aligning with health. It’s frustrating because we’ve all been fed the lie that health has a “look” when in reality, you can tell very, very little about someone’s health based on their appearance. Weight loss is not a behavior - it’s a potential outcome of pursuing health. And for someone in recovery from an ED, pursuing weight loss is almost a guaranteed relapse or path to pseudo-recovery/quasi-recovery. \n\nHAES means that regardless of body size, humans deserve to be treated with respect and given access to health treatment without a side of weight-stigma (which has been shown to be more harmful to health than living in a larger body). I don’t know how anyone with a heart who genuinely understands this philosophy could be against HAES. It’s cruel to judge and dismiss people bc of their weight. An example is how ED treatment is sometimes withheld from people in bigger bodies. \n\nIntuitive eating is not at all about eating unhealthily or giving in to every urge. It’s about listening to your body. Hunger, fullness, satiety, even learning ways to cope with your emotions are all principles of this practice. \n\nWhich is why I said to look into these philosophies. For me, my ED was a lot about control. Trying to recover from it with more control never yielded any results. Surrendering to my body and learning more about diet culture, HAES, and IE helped. ",
      "created_utc": 1611606882.0,
      "score": 2,
      "context": [
        {
          "id": "gknf6qh",
          "author": "paradoxrevel",
          "body": "This is a tough place! Is a relapse really worth it for that short-lived gratification of weight loss? (I'm asking myself this most days, too.) It's helped me to look into HAES and what the actual research says about diet outcomes. In truth, the best predictor of weight gain in the long term is dieting. For most people, dieting works short term, but there is no evidence that it works past 2 years. At the 5 year mark, most dieters have regained all the weight they lost and many have gained more. Anti-diet research and intuitive eating are saving my sanity. It's not easy, but it's a better quality of life than living with an eating disorder. Take care of yourself, friend!",
          "created_utc": 1611532159.0
        },
        {
          "id": "gkom2n2",
          "author": "GuessIllGoFuckMyself",
          "body": "So don’t diet or modify your life to try to get to a healthy weight that makes you feel good? I get HAES has value in certain aspect but telling people to not bother even TRYING to diet and get healthy is so defeatist.",
          "created_utc": 1611556934.0
        },
        {
          "id": "gkq1zjv",
          "author": "None",
          "body": "Intuitive eating and not trying to eat healthy is just as bad, it's almost like a different kind of ed, imo. I totally agree that's defeatist. I wish so many people didn't give in to just giving up in order to \"recover\". That isn't what I would ever call recovering.",
          "created_utc": 1611593018.0
        },
        {
          "id": "gkqaxaw",
          "author": "GuessIllGoFuckMyself",
          "body": "Exactly... I’m trying to recover and if I have into every whim I’d be 300lbs. I know I’m going to gain SOME during recovery but the goal is to have a healthy relationship with food to make my body happy not give into every desire. Imagine doing that with your budget.",
          "created_utc": 1611596872.0
        }
      ]
    }
  ]
}