{
  "id": "l4znmr",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1611614616.0,
  "title": "Request: I (19F) Think My Boyfriend (21M) Has an Eating Disorder",
  "selftext": "Hi everyone, this is something that has been bothering me for a while now but I can't tell if something is really off or if I'm just overly cautious because I have a history of not having healthy eating habits.\n\nMy boyfriend is currently living in a college home with his close friends and the culture of the house is not the healthiest :( I know they're all broke college students but they seriously are living in the worst conditions... the fridge is full of moldy food and the kitchen is all broken and barely works and they don't really cook much other than mac and cheese or the occasional ramen. They drink a couple of times a week and just sort of chill all day because they're graduating college this semester.\n\nMy boyfriend especially has been putting on a little bit of weight this year and I still think he is well within the healthy range, but it's clearly making him insecure. For example, yesterday I was at his house all day and all he had was a ramen packet and some shrimp and later in the night, he had a can of Truly with his friends :( That is not enough food to sustain anyone and it's seriously unhealthy. I even ordered extra food in and hoped he would eat some but he didn't :/ I went to bed first and noticed he wasn't next to me and then when he came back he told me he went to work out :( After that, I could hear his stomach grumbling all night and it was seriously breaking my heart. This has also been going on since like the summer.\n\nI spend a lot of time with him so I see him not eat a single meal until like 7pm and then he will eat and complain about how bloated he is and how he wishes he didn't eat so much. I'm really getting worried about him and I don't know how to express it because he's not taking it seriously at all! Yesterday I sort of put my foot down and told him it's seriously upsetting me and I need him to eat but I don't know if this was the best move or if that's how these things are to be handled. When I look online for resources most of them tell me to just sit down and talk to him or speak to a family member but these aren't really applicable to the situation because 1. his family comes from a culture that doesn't believe in such things 2. he is not taking it seriously enough to have a genuine conversation.\n\nI'm just so worried about him... I really don't know how to get through to him that not only is this super damaging to his health but he also won't really be meeting his fitness goals if he doesn't eat enough food or protein!!!\n\n\n\nTL;DR : My boyfriend is not eating a sustainable amount of food and nothing I say is getting through to him. His living situation is not helping at all as all of his housemates are super laidback due to graduating college soon.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l4znmr/request_i_19f_think_my_boyfriend_21m_has_an/",
  "score": 50,
  "num_comments": 11,
  "comments": [
    {
      "id": "gkrfgap",
      "author": "None",
      "body": "I have an eating disorder and when people tell me it upsets them it makes me feel bad. I don't really have any advice so you can help him eat more, but I don't think you should put your foot down, but gently coax him. When people try to force me to eat when I'm not ready I get this sick feeling in my stomach and I begin to panic. Maybe you could take him out for lunch or buy him something you know he'd enjoy. It can make a person feel bad when they have disordered eating and you act hastily towards their eating decisions. I hope your boyfriend doesn't have an eating disorder and that he feels a bit better soon. ☺️",
      "created_utc": 1611615170.0,
      "score": 34,
      "context": []
    },
    {
      "id": "gkrsljv",
      "author": "deeforsaken1",
      "body": "He needs to understand that starving himself will not help in losing weight. It will actually make it very difficult since it will mess up your metabolism.\nIt could be depression from his living situation, and the weight.\nConsider his roommates his family and have a talk with them please. Since they’re the ones that probably see him the most.\nAnd remind him to eat and drink water. Even if it annoys him.\nI don’t know his financial situation, whether he or his roommates work, but they have to buy proper food.\nSometimes they just need a wake up call to get there shit together.",
      "created_utc": 1611621967.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gks4yzc",
      "author": "None",
      "body": "Aw I’m so sorry!! You’re doing an amazing job by noticing the warning signs. When talking abt it, make sure to come from a place of love, not authority, tell him you care about him and that u want him to live a happy and healthy life. As someone who struggles with ED tendencies, I tend to avoid and/or manipulate conversations around my diet so having a talk may not help. Instead, help him eat healthier. Maybe pick up a pre-made salad at the grocery store instead of getting takeout. Tell him to get frozen veggies to throw in ramen as it cooks. Ask him to cook a healthy food for you (I like broccoli, chicken breast, and zucchini). These are just ideas btw no pressure haha. I always appreciate when people get me healthy food or keep my interests in mind when eating. \n\nAnother separate thing I want to mention is that EDs aren’t always about food, they’re more about control. He may feel out of control in the environment so maybe helping him regain control will help him be more healthy. Ask if you can help him decorate his room or help clean the kitchen. DO NOT insult the place he lives - this always always makes people feel like shit. Talk positively about his place and he’s going to move forward much faster. Establishing a healthy routine can also establish a sense of control too, like wake up, drink a smoothie, study till 12, eat, read, workout, shower, eat. Sry that was a lot of info but I hope this helps :)",
      "created_utc": 1611628477.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gkrhn50",
      "author": "Idrisnite",
      "body": "Sorry, I don't have advice, just wish you guys well. I feel him.",
      "created_utc": 1611616253.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gks1zlz",
      "author": "enord11400",
      "body": "You could try talking with him about nutrition first. A shocking number of people think crash dieting is an acceptable weight loss method and don’t realize it has been widely proven to not work long term or they think they can force themselves to be the exception. However plenty of people also fall into an eating disorder this way so it really is a slippery slope. Many of those people also do not realize they have an eating disorder until someone tries to tell them they have to stop or they might die. Personally I can’t relate as I knew exactly what I was doing to myself from day one, but a close friend of mine was laying in the hospital still insisting that she just accidentally took a diet too far. She had a bmi of about 20 at the time so you are right to be concerned now. You do not have to be underweight to be at risk of serious complications from an ED. If he just wants to lose weight he should see if his school has any nutritional counseling services or something of that sort. If he starts acting differently like more withdrawn, significantly more or less emotional, sleeping a lot more or a lot less then those might be signs this may be more or a mental health situation. You could try asking his roommates if they’ve noticed anything different about him. It could still be a mental health issue even if nothing seems wrong. You’re right to remain vigilant but if he’s suffering from a mental illness then it is cruel to try and make him feel bad about it. I know that probably wasn’t your intention at the time, but try and be mindful that he isn’t trying to hurt you and all you can do is let him know you care about him the way he is and let him know you will help him however you can. Also remember that you can not help someone who doesn’t want your help and that’s not your fault.",
      "created_utc": 1611626915.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gkreb0z",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1611614616.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkscz4m",
      "author": "None",
      "body": "He also might not even think it's an issue. Maybe helping him realize that this isn't healthy or normal and talk about why his eating habits are like this would help.",
      "created_utc": 1611632748.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gksr40n",
      "author": "throwaway-m1",
      "body": "A few things:\nHe definitely had a problem of some kind. Keep in mind that you don’t know exactly what it is. He could have ARFID, he could be struggling with depression or digestive issues that make it hard to eat. Though it does sound like it is likely body image related - that’s just something to keep in mind. \n\nIf you haven’t already, I would strongly consider sitting him down and saying that you need to talk about something serious, what he is doing is not normal and could harm his health, and he needs to get help. Maybe find some resources he could use: a dietitian, a therapist, a mental health center, etc. If I where you, I would tell him that it is really important to you that he gets help - here are a few places he could go, or he could find some place himself. \n\nGood luck ❤️",
      "created_utc": 1611641921.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkuoze2",
      "author": "FoxiiFighter",
      "body": "You mentioned he has fitness goals --- what are those goals specifically? \n\nHe's definitely displaying some disordered behaviors, but I wouldn't say he has a full blown eating disorder yet (He's definitely moving in that direction though).  And the reason I am making that distinction is because there is still a huge stigma that \"men don't get eating disorders.\" We all know that's not true, but if you flat out tell him you think he has an eating disorder verbatim, he won't see a problem because that's not something men \"get\" ...so you really can't approach it from that angle -- that's probably why you didn't get a response when you did try to speak up. \n\nDepending on what his fitness goals are, you may be able to work that angle into addressing how he is eating.",
      "created_utc": 1611686310.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkrph60",
      "author": "tuckerlyn",
      "body": "Highly agree. I also suffered with disorderes eating and when my friends/professors would try to coax me into eating I would get worse. I needed to make the decision for myself.",
      "created_utc": 1611620303.0,
      "score": 12,
      "context": [
        {
          "id": "gkrfgap",
          "author": "None",
          "body": "I have an eating disorder and when people tell me it upsets them it makes me feel bad. I don't really have any advice so you can help him eat more, but I don't think you should put your foot down, but gently coax him. When people try to force me to eat when I'm not ready I get this sick feeling in my stomach and I begin to panic. Maybe you could take him out for lunch or buy him something you know he'd enjoy. It can make a person feel bad when they have disordered eating and you act hastily towards their eating decisions. I hope your boyfriend doesn't have an eating disorder and that he feels a bit better soon. ☺️",
          "created_utc": 1611615170.0
        }
      ]
    },
    {
      "id": "gkskco7",
      "author": "HoneyAndSht",
      "body": "This !!! \nOP I recently got worried my friend had an eating disorder because of how much xxxx cals he would post on twitter or call himself a f**ass and talked so much about working out. So I reached out to him and told him that’s he’s still okay and he still has a chance to not suffer this he’ll hole of an eating disorder. I was right he was becoming anorexic but he didn’t know enough. I said that his metabolism will get fucked up and from then on it’ll get less and less and less and less until there’s nothing left. That it will be all he’ll think about day in and day out. From the moment he wakes up planning the entire day to the moment he sleeps regretting what he ate or didn’t eat. This won’t ever make him happy. \n\nYou can tell him that too. Tell him how you had suffered. Tell him you’ll be there to help. You both can go to a real nutritionist together and he can start eating what’s good for him and he’ll believe it because it’s a professionals opinion. He can try out bulking at the gym. Yes he can be broke but healthy food can still be easy to come by. Vegetables are cheaper, even frozen veggies. Or canned veg and fruit. \n\nBut also reassure him that no matter the struggle you’ll be there for him, lest he start hiding the disorder from you.",
      "created_utc": 1611637119.0,
      "score": 6,
      "context": [
        {
          "id": "gkrsljv",
          "author": "deeforsaken1",
          "body": "He needs to understand that starving himself will not help in losing weight. It will actually make it very difficult since it will mess up your metabolism.\nIt could be depression from his living situation, and the weight.\nConsider his roommates his family and have a talk with them please. Since they’re the ones that probably see him the most.\nAnd remind him to eat and drink water. Even if it annoys him.\nI don’t know his financial situation, whether he or his roommates work, but they have to buy proper food.\nSometimes they just need a wake up call to get there shit together.",
          "created_utc": 1611621967.0
        }
      ]
    }
  ]
}