{
  "id": "l61ved",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1611743979.0,
  "title": "Request: eating on a normal schedule?",
  "selftext": "History: father used to binge eat and would eat all of my food when I was a child growing up. I was considered servery underweight according to my doctors. Because of what my dad would do, I would hoard food secretly but never eat it. Later in my teen years when there was enough food in the house for me to eat, I would actually eat the food. When my father was on his weight loss journey he would then comment on my eating habits. At the time (age 15) I was slightly underweight, but I started to restrict my food from that point on. When I was 19 I was at my lowest adult weight. My family complemented me despite me being incredibly ill. \n\nToday, I fortunately am a healthy weight. I'm proud of it but every day there is a struggle to come to terms with my body since my family comments on my supposed bad eating habits. I still live with them currently for the time being. The only way I've been able to cope and gain weight is by eating out. I have a fear that the food that I bring home and pay for myself, will get eaten. It has happened many times before even though I've requested for them to not touch my food. When my father does eat my food it spins me back into the cycle of buying a lot of food, hoarding it and then not eating it....and today it stated again. I'm not sure what to do, but I have a feeling this is a type of eating disorder. I'm essentially begging at this point for help to understand what I'm supposed to do. I don't like the idea of only being able to eat fast food or eating out in order to maintain some sort of weight. Please help.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l61ved/request_eating_on_a_normal_schedule/",
  "score": 50,
  "num_comments": 11,
  "comments": [
    {
      "id": "gkxz326",
      "author": "Vessecora",
      "body": "Please look into the effects of food insecurity. Your responses are completely normal coping mechanisms for the horrible situation you were put in.",
      "created_utc": 1611753068.0,
      "score": 30,
      "context": []
    },
    {
      "id": "gkylhj3",
      "author": "CraftsAndSass",
      "body": "Definitely ask a therapist who specializes in EDs. This could be an eating disorder that resulted from food insecurity. People can and do develop EDs after periods of food insecurity. You definitely need some family therapy; I would venture to say that your experiences with food insecurity are a result of complex family issues. Your difficulties with eating make sense considering your experiences. You found ways to survive an environment where your basic needs were not met. If you're able to buy your own food, do so and get a mini fridge like u/fickle_orchid suggested. Look up recipes for one so you don't have to store leftovers all the time. As hard as it is, you need to set boundaries with your parents about food. If you can't buy your own food, talk with your parents about them giving you $X a week/month for food that is only for you and stored in your room. You can validate your dad's ED and protect yourself with strict boundaries. If you have extended family or close family friends who know the situation, having them present when you set those boundaries may give you some moral support and leverage. I really hope you can find ways to start developing a healthy relationship with food. You've been through a lot, and you deserve to leave that behind.",
      "created_utc": 1611762752.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gkyho8a",
      "author": "Fickle_Orchid",
      "body": "Could you get a mini fridge and a hot plate for your room?",
      "created_utc": 1611761383.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gkyolsj",
      "author": "green-egg-and-ham",
      "body": "I had a period of time where I was homeless/had a lot of food insecurity and I also do this. I literally have a whole set of drawers filled with food \"in case I need it sometime\" but I never eat it. I don't think this is an ed but it could be possibly some disordered habits.",
      "created_utc": 1611763838.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gkyhno6",
      "author": "None",
      "body": "My practical advice would be to follow some sort of meal-plan with foods you buy, store and prepare at home. Keep yourself accountable to following it and eating regularly while working through some of your issues with the experience of food insecurity. A good start could be 3 meals a day and snacks made from foods at home where possible",
      "created_utc": 1611761378.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gkxmtje",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1611743979.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gkzg5tw",
      "author": "therealdildoexpert",
      "body": "Fortunately, soon in a few months I'll be moving out with my partner which we've talked about my eating habits a lot so I'm hoping things will settle down. However I am worried that my eating habits will get worse from previous food insecurity. I did have a mini fridge at one point when I was a kid but I ended up hoarding food in it and never eating because I was scared I wouldn't get more.",
      "created_utc": 1611773096.0,
      "score": 5,
      "context": [
        {
          "id": "gkyho8a",
          "author": "Fickle_Orchid",
          "body": "Could you get a mini fridge and a hot plate for your room?",
          "created_utc": 1611761383.0
        }
      ]
    },
    {
      "id": "gkzgafr",
      "author": "therealdildoexpert",
      "body": "any good books or sites you suggest?",
      "created_utc": 1611773142.0,
      "score": 1,
      "context": [
        {
          "id": "gkyhno6",
          "author": "None",
          "body": "My practical advice would be to follow some sort of meal-plan with foods you buy, store and prepare at home. Keep yourself accountable to following it and eating regularly while working through some of your issues with the experience of food insecurity. A good start could be 3 meals a day and snacks made from foods at home where possible",
          "created_utc": 1611761378.0
        }
      ]
    },
    {
      "id": "gkzgvt2",
      "author": "Fickle_Orchid",
      "body": "I was thinking you would just use that as a stop gap measure until you, thankfully, can move out. I'm so relieved to hear you'll be in a better place in a few months. Doing a little \"college dorm room\" set up with a mini fridge and a rice cooker or a hot plate in the meantime so you don't have to worry about people taking your food or commenting on your eating was my suggestion. Though you definitely shouldn't have to do secret eating in your own home",
      "created_utc": 1611773368.0,
      "score": 3,
      "context": [
        {
          "id": "gkyho8a",
          "author": "Fickle_Orchid",
          "body": "Could you get a mini fridge and a hot plate for your room?",
          "created_utc": 1611761383.0
        },
        {
          "id": "gkzg5tw",
          "author": "therealdildoexpert",
          "body": "Fortunately, soon in a few months I'll be moving out with my partner which we've talked about my eating habits a lot so I'm hoping things will settle down. However I am worried that my eating habits will get worse from previous food insecurity. I did have a mini fridge at one point when I was a kid but I ended up hoarding food in it and never eating because I was scared I wouldn't get more.",
          "created_utc": 1611773096.0
        }
      ]
    },
    {
      "id": "gl00q0d",
      "author": "None",
      "body": "https://www.nacac.org/resource/healing-from-food-insecurity/",
      "created_utc": 1611781680.0,
      "score": 1,
      "context": [
        {
          "id": "gkyhno6",
          "author": "None",
          "body": "My practical advice would be to follow some sort of meal-plan with foods you buy, store and prepare at home. Keep yourself accountable to following it and eating regularly while working through some of your issues with the experience of food insecurity. A good start could be 3 meals a day and snacks made from foods at home where possible",
          "created_utc": 1611761378.0
        },
        {
          "id": "gkzgafr",
          "author": "therealdildoexpert",
          "body": "any good books or sites you suggest?",
          "created_utc": 1611773142.0
        }
      ]
    },
    {
      "id": "gkzh9rf",
      "author": "therealdildoexpert",
      "body": "I really really do appreciate that. Any suggestions helps me a lot and it's comforting to know that at least there's some sort of solution and support system out there, thank you.",
      "created_utc": 1611773513.0,
      "score": 3,
      "context": [
        {
          "id": "gkyho8a",
          "author": "Fickle_Orchid",
          "body": "Could you get a mini fridge and a hot plate for your room?",
          "created_utc": 1611761383.0
        },
        {
          "id": "gkzg5tw",
          "author": "therealdildoexpert",
          "body": "Fortunately, soon in a few months I'll be moving out with my partner which we've talked about my eating habits a lot so I'm hoping things will settle down. However I am worried that my eating habits will get worse from previous food insecurity. I did have a mini fridge at one point when I was a kid but I ended up hoarding food in it and never eating because I was scared I wouldn't get more.",
          "created_utc": 1611773096.0
        },
        {
          "id": "gkzgvt2",
          "author": "Fickle_Orchid",
          "body": "I was thinking you would just use that as a stop gap measure until you, thankfully, can move out. I'm so relieved to hear you'll be in a better place in a few months. Doing a little \"college dorm room\" set up with a mini fridge and a rice cooker or a hot plate in the meantime so you don't have to worry about people taking your food or commenting on your eating was my suggestion. Though you definitely shouldn't have to do secret eating in your own home",
          "created_utc": 1611773368.0
        }
      ]
    }
  ]
}