{
  "id": "l7d7wp",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1611878506.0,
  "title": "Request: Request - My fiancée left after discovering I had an eating disorder, how do I eat again?",
  "selftext": "My fiancé left on Christmas day after being told about my ED, how do I eat food again?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l7d7wp/request_request_my_fiancée_left_after_discovering/",
  "score": 68,
  "num_comments": 40,
  "comments": [
    {
      "id": "gl67ey8",
      "author": "Oblique_Ocean",
      "body": "If she left after learning more about the real you, she was never meant to stay.\n\n\\^Edited for correct gender pronoun.",
      "created_utc": 1611881504.0,
      "score": 89,
      "context": []
    },
    {
      "id": "gl6myxd",
      "author": "None",
      "body": "My SO of four years left me after I had a mental break down and went to therapy for suicidal thoughts. Said he couldn’t cope. Trust me, you’re better off now without them. You’re whole and valid and deserve a supportive partner. Keep trying everyday.",
      "created_utc": 1611888559.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gl6g5c8",
      "author": "None",
      "body": "❤️🧡💛💚💜🖤🤍🤎❣️💕💞💓💗💖💘💟 to you! You deserve better:)))",
      "created_utc": 1611885448.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gl68b4q",
      "author": "wendy125",
      "body": "You have to do it for you.  Life is amazing and you deserve to live it.  \nHonestly, it sounds like you dodged a bullet.  Maybe that was the universe's way of telling you to focus on yourself for right now.  Someone better will come along.  \nWishing you all the best!",
      "created_utc": 1611881909.0,
      "score": 31,
      "context": []
    },
    {
      "id": "gl69q2n",
      "author": "MysticalWateryEye",
      "body": "There's that whole \"if you don't love me at my worst you don't deserve me at my best\" quote that i know is totally overdone, but for real. Your Fiance did you a favor, because imagine managing an ED and a person who would leave you over getting sick?! Eating disorders are a mental illness, and i'm so sorry that that jerk did that to you.\n\nYou deserve happiness and treatment to help you find what makes you happy again, and that helps you fight that ED voice. Fighting your ED will take energy and i hope you have a support system, if not there are online support groups, subs, and a few online listener websites that will help if you cannot afford therapy. But there's also some options for therapy at low cost etc.",
      "created_utc": 1611882548.0,
      "score": 34,
      "context": []
    },
    {
      "id": "gl6cwjs",
      "author": "spocksgotfeelings",
      "body": "You deserve so much better, and in the wake of a breakup it is hard to accept, and im sure there is a lot about the relationship that was amazing and that you'll have to grieve. Just remember that thats not the person you want in your corner.\n\n If you need help to get int/stay in recovery you should get it because you are worth it and deserve peace. I'd like to slash his tires. I won't because like I dont know if he has a car. But id like to. \n\nThis is a chance (not the last chance but a good one) to take care of you. That should not have happened to you and it is not your fault.",
      "created_utc": 1611883983.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gl99q4i",
      "author": "green-egg-and-ham",
      "body": "As someone with an Ed and a partner with an Ed, I had to be the one in your fiancees place. I think the comments above are great and really supportive but I’d like to put in there that not everyone is bad for leaving someone bc of their mental illness. Sometimes if both people are toxic and codependent it’s better for both people to find a more stable partner that can handle their illness. I helped my partner into treatment and then ended things so he could have support during the tough time tho so if yours just left you in the wind than i guess you are better off without him. Sorry if this is a salty post, I hope you find support and feel better soon 💚💚💚💚",
      "created_utc": 1611939199.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gl8krvt",
      "author": "None",
      "body": "forgive me, but what a complete dick. you deserve far better than that person and it sounds like you dodged a bullet! if it was me, i would just pair each bite of future food with an imaginary encounter in which i repeatedly whacked this pathetic and cruel excuse for a  human being in the face with something heavy. what a horrible thing to do to the person you're supposed to be in love with - there is a reason wedding vows include the phrase 'in sickness and in health' and if someone can't even try to stick with you during your lowest moments, then there is no way they deserve to be with you during your happiest ones. i'm so sorry you had to go through this but seriously, screw them.",
      "created_utc": 1611930237.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gl83eg8",
      "author": "None",
      "body": "You're worthy of love!!\n\nYour fiancé has done you a favour!! I've heard of partners making it hell for the other person to recover. Why would you want him to stay if he is opposed to your issues?\n\nBetter off alone in this case. Better to have left now, than after the wedding or after kids!! Eek.\n\nNow is the time to take steps to recover, not spiral by not eating. Don't feed them more evidence why they did a good thing by leaving - get better, babe... Get WAY better then snag the perfect partner of your dreams!! <3",
      "created_utc": 1611920767.0,
      "score": 2,
      "context": []
    },
    {
      "id": "glc4g43",
      "author": "Pyrrhuras",
      "body": "I am sorry that your fiancé left you because of the ED. \n\nMy advice to start eating normally again is to forget about restrictions and just eat what you want when you’re hungry. Basically, just try and ignore any type of worrying thoughts about food and dismiss them as ridiculous and harmful to your health. For example, if you want a cookie then go get one. If you want some chips then go get some. It’s ok to get fast food and to have it guilt free. And eat healthy foods like fruits veggies and meats if you want. Food is meant to be enjoyed and enjoying food is a part of life. I used to eat intuitively (just ate what I wanted when the time came, til I was full and not in excess) and I was not even close to being overweight (not like being overweight is anything super horrible, but just saying that if you don’t restrict you won’t gain 10000 pounds and eventually your body will be self regulating and at a happy and healthy weight). \n\nI’m no expert in EDs whatsoever but I just wanted to give you my advice in case it helps. \n\nBtw after a while you won’t even think of food, and when you do think of food allow yourself to have it in moderation and til you are full and satisfied. \n\nIf anyone doesn’t like my advice lemme know and I’ll delete it cuz I don’t want it to cause harm in some way if its wrong",
      "created_utc": 1611982222.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gl7lx5l",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1611907299.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gl9peq2",
      "author": "body_acceptance",
      "body": "I struggled with an eating disorder and let me tell you, it isn't easy and it takes time. You need to think what is best for you and do what's best for you. Start slowly introducing foods and eat when hungry. if you don't feel like eating start off with 3 small meals a day and gradually your body will get use to the routine. don't put any restrictions on yourself, that lead me back to square one. Eat what you want and when you want. Remember that you are strong, beautiful and you can recover from this! Do this for you and no one else! Following eating disorder and body acceptance accounts on facebook and instagram really help so you are part of a community and don't feel so alone. Also you should consult with a professional and therapist that helps. If he can't love you through this than that really says a lot about him and you don't need that toxic behaviour in your life especially at a time like this!",
      "created_utc": 1611944740.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gla8g2f",
      "author": "gordonramseysgooch",
      "body": "One bite at a time babe ❤️ eat to prove him wrong xxx",
      "created_utc": 1611951379.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glaao2g",
      "author": "Weird-Ad-6316",
      "body": "Honestly. Fuck that guy. \nI got engaged when I was at the lowest I had ever been, and my fiance helped me with my recovery and still continues to help me with my recovery.\nIf they are the one they will stick with you no matter what, they should love everything about you (even the ugly parts).\nI'm so sorry that this happened to you, and I'm sure you'll find a better person out there.",
      "created_utc": 1611952156.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gl60ncd",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1611878506.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glb0lba",
      "author": "None",
      "body": "Hi guys! I am the individual who sent the post in! Thank you so much for your kind messages, but I am in fact a male! It doesn't change the situation, but the female was the one who left me! I hope that doesn't change any of your opinions!",
      "created_utc": 1611962452.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glwmam0",
      "author": "StubbornYEti",
      "body": "Your fiancée was not ready or able to deal with a loved one who has an eating disorder. You deserve a loved one who can support you, love you, care for you at all times especially in times of weakness!\n\nBe your own supporter. Talk to yourself as you would talk to a friend! Be kind and patient with yourself! Look after yourself as if you were a different person!\n\nMy friends helped me greatly by saying that I wouldn't treat them the way I treat myself. And it's true. So please be kind and compassionate to yourself!",
      "created_utc": 1612384707.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gnivc2q",
      "author": "Ed_Taste_9231",
      "body": "\"The trash took it'self out\" she was a very week person she couldn't  be there fr ur recovery u deserve sooo much better than that ur sooo much better ,that girl didn't deserve u at all 🖤",
      "created_utc": 1613386430.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glbdnc7",
      "author": "dcdemirarslan",
      "body": "Why assume the op is a woman?",
      "created_utc": 1611968679.0,
      "score": 1,
      "context": [
        {
          "id": "gl67ey8",
          "author": "Oblique_Ocean",
          "body": "If she left after learning more about the real you, she was never meant to stay.\n\n\\^Edited for correct gender pronoun.",
          "created_utc": 1611881504.0
        }
      ]
    },
    {
      "id": "glczx0h",
      "author": "None",
      "body": "Thank you, I'm coming to learn this, slowly. It'll get there.",
      "created_utc": 1612008520.0,
      "score": 1,
      "context": [
        {
          "id": "gl67ey8",
          "author": "Oblique_Ocean",
          "body": "If she left after learning more about the real you, she was never meant to stay.\n\n\\^Edited for correct gender pronoun.",
          "created_utc": 1611881504.0
        }
      ]
    },
    {
      "id": "gld07hh",
      "author": "None",
      "body": "I'm so sorry that you went through this, this shouldn't happen to anyone, especially at their lowest. One day we will both be happy, with people who accept us, even when we need support the most.",
      "created_utc": 1612008782.0,
      "score": 1,
      "context": [
        {
          "id": "gl6myxd",
          "author": "None",
          "body": "My SO of four years left me after I had a mental break down and went to therapy for suicidal thoughts. Said he couldn’t cope. Trust me, you’re better off now without them. You’re whole and valid and deserve a supportive partner. Keep trying everyday.",
          "created_utc": 1611888559.0
        }
      ]
    },
    {
      "id": "gld0294",
      "author": "None",
      "body": "Thank you so very much! ❤",
      "created_utc": 1612008651.0,
      "score": 2,
      "context": [
        {
          "id": "gl6g5c8",
          "author": "None",
          "body": "❤️🧡💛💚💜🖤🤍🤎❣️💕💞💓💗💖💘💟 to you! You deserve better:)))",
          "created_utc": 1611885448.0
        }
      ]
    },
    {
      "id": "glczyze",
      "author": "None",
      "body": "Thank you so much. I believe it was the universe, just had to do it in the most painful way possible!",
      "created_utc": 1612008570.0,
      "score": 1,
      "context": [
        {
          "id": "gl68b4q",
          "author": "wendy125",
          "body": "You have to do it for you.  Life is amazing and you deserve to live it.  \nHonestly, it sounds like you dodged a bullet.  Maybe that was the universe's way of telling you to focus on yourself for right now.  Someone better will come along.  \nWishing you all the best!",
          "created_utc": 1611881909.0
        }
      ]
    },
    {
      "id": "gld01im",
      "author": "None",
      "body": "Thank you so much. I'm coming to realise that she was never going to support me through this, as she wanted me for her own gain, rather than wanting to actually be with me for who I am! We'll get there!",
      "created_utc": 1612008633.0,
      "score": 3,
      "context": [
        {
          "id": "gl69q2n",
          "author": "MysticalWateryEye",
          "body": "There's that whole \"if you don't love me at my worst you don't deserve me at my best\" quote that i know is totally overdone, but for real. Your Fiance did you a favor, because imagine managing an ED and a person who would leave you over getting sick?! Eating disorders are a mental illness, and i'm so sorry that that jerk did that to you.\n\nYou deserve happiness and treatment to help you find what makes you happy again, and that helps you fight that ED voice. Fighting your ED will take energy and i hope you have a support system, if not there are online support groups, subs, and a few online listener websites that will help if you cannot afford therapy. But there's also some options for therapy at low cost etc.",
          "created_utc": 1611882548.0
        }
      ]
    },
    {
      "id": "gld05c6",
      "author": "None",
      "body": "I appreciate the offer of slashing tyres 😂 But thank you so much, its hard coming to terms that the person you thought would be there when you got better, doesn't want to go through the stages of getting there. Shows the real side of people, unfortunately.",
      "created_utc": 1612008728.0,
      "score": 2,
      "context": [
        {
          "id": "gl6cwjs",
          "author": "spocksgotfeelings",
          "body": "You deserve so much better, and in the wake of a breakup it is hard to accept, and im sure there is a lot about the relationship that was amazing and that you'll have to grieve. Just remember that thats not the person you want in your corner.\n\n If you need help to get int/stay in recovery you should get it because you are worth it and deserve peace. I'd like to slash his tires. I won't because like I dont know if he has a car. But id like to. \n\nThis is a chance (not the last chance but a good one) to take care of you. That should not have happened to you and it is not your fault.",
          "created_utc": 1611883983.0
        }
      ]
    },
    {
      "id": "gld0cya",
      "author": "None",
      "body": "Don't apologise! It is always fantastic to have another point of view! I think with my SO, she left as soon as I told her, rather than even give me the chance to get better, just a flick of the switch, and I never got a reason for it, since she blocked me on everything afterwards! So we'll never know! Maybe she was going through something, but unfortunately we'll never know!",
      "created_utc": 1612008920.0,
      "score": 1,
      "context": [
        {
          "id": "gl99q4i",
          "author": "green-egg-and-ham",
          "body": "As someone with an Ed and a partner with an Ed, I had to be the one in your fiancees place. I think the comments above are great and really supportive but I’d like to put in there that not everyone is bad for leaving someone bc of their mental illness. Sometimes if both people are toxic and codependent it’s better for both people to find a more stable partner that can handle their illness. I helped my partner into treatment and then ended things so he could have support during the tough time tho so if yours just left you in the wind than i guess you are better off without him. Sorry if this is a salty post, I hope you find support and feel better soon 💚💚💚💚",
          "created_utc": 1611939199.0
        }
      ]
    },
    {
      "id": "gld0mwx",
      "author": "None",
      "body": "I'm sure in some days I'll be imagining that, to help quash the feeling of missing her 😂 But thank you so much, you're so right about wedding vows, you accept people for every part of them, not just the good side. If you can't put up with people when they need support the most, you don't deserve them when they recover.",
      "created_utc": 1612009163.0,
      "score": 1,
      "context": [
        {
          "id": "gl8krvt",
          "author": "None",
          "body": "forgive me, but what a complete dick. you deserve far better than that person and it sounds like you dodged a bullet! if it was me, i would just pair each bite of future food with an imaginary encounter in which i repeatedly whacked this pathetic and cruel excuse for a  human being in the face with something heavy. what a horrible thing to do to the person you're supposed to be in love with - there is a reason wedding vows include the phrase 'in sickness and in health' and if someone can't even try to stick with you during your lowest moments, then there is no way they deserve to be with you during your happiest ones. i'm so sorry you had to go through this but seriously, screw them.",
          "created_utc": 1611930237.0
        }
      ]
    },
    {
      "id": "gld0saq",
      "author": "None",
      "body": "I love it! Thank you so much. Step by step, and then the perfect person will come! But being healthy on your own is the most important thing, and being with someone who doesn't accept your faults and doesn't want to help you, shouldn't be your partner. We'll get there! ❤",
      "created_utc": 1612009295.0,
      "score": 1,
      "context": [
        {
          "id": "gl83eg8",
          "author": "None",
          "body": "You're worthy of love!!\n\nYour fiancé has done you a favour!! I've heard of partners making it hell for the other person to recover. Why would you want him to stay if he is opposed to your issues?\n\nBetter off alone in this case. Better to have left now, than after the wedding or after kids!! Eek.\n\nNow is the time to take steps to recover, not spiral by not eating. Don't feed them more evidence why they did a good thing by leaving - get better, babe... Get WAY better then snag the perfect partner of your dreams!! <3",
          "created_utc": 1611920767.0
        }
      ]
    },
    {
      "id": "gld0ovw",
      "author": "None",
      "body": "Thank you so much! There has been tough days, but slowly im coming to terms that I deserve better, and ill get healthy for me, not for someone who doesn't want me.",
      "created_utc": 1612009210.0,
      "score": 1,
      "context": [
        {
          "id": "gl7lx5l",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1611907299.0
        }
      ]
    },
    {
      "id": "gld0i63",
      "author": "None",
      "body": "Thank you so much, I'll take this advice in my stride! Any food is better than no food right? In time, we'll get there, baby steps! Its a shame that these illnesses show the real intentions of people, its sad!",
      "created_utc": 1612009048.0,
      "score": 1,
      "context": [
        {
          "id": "gl9peq2",
          "author": "body_acceptance",
          "body": "I struggled with an eating disorder and let me tell you, it isn't easy and it takes time. You need to think what is best for you and do what's best for you. Start slowly introducing foods and eat when hungry. if you don't feel like eating start off with 3 small meals a day and gradually your body will get use to the routine. don't put any restrictions on yourself, that lead me back to square one. Eat what you want and when you want. Remember that you are strong, beautiful and you can recover from this! Do this for you and no one else! Following eating disorder and body acceptance accounts on facebook and instagram really help so you are part of a community and don't feel so alone. Also you should consult with a professional and therapist that helps. If he can't love you through this than that really says a lot about him and you don't need that toxic behaviour in your life especially at a time like this!",
          "created_utc": 1611944740.0
        }
      ]
    },
    {
      "id": "gld08a7",
      "author": "None",
      "body": "Thank you! ❤",
      "created_utc": 1612008803.0,
      "score": 2,
      "context": [
        {
          "id": "gla8g2f",
          "author": "gordonramseysgooch",
          "body": "One bite at a time babe ❤️ eat to prove him wrong xxx",
          "created_utc": 1611951379.0
        }
      ]
    },
    {
      "id": "gld0enf",
      "author": "None",
      "body": "I'm so happy you found someone that gave you so much support! ❤ Thank you, I hope so too! One day at a time!",
      "created_utc": 1612008963.0,
      "score": 1,
      "context": [
        {
          "id": "glaao2g",
          "author": "Weird-Ad-6316",
          "body": "Honestly. Fuck that guy. \nI got engaged when I was at the lowest I had ever been, and my fiance helped me with my recovery and still continues to help me with my recovery.\nIf they are the one they will stick with you no matter what, they should love everything about you (even the ugly parts).\nI'm so sorry that this happened to you, and I'm sure you'll find a better person out there.",
          "created_utc": 1611952156.0
        }
      ]
    },
    {
      "id": "glbxtqk",
      "author": "Oblique_Ocean",
      "body": "Hey!! I am so sorry! I just saw this and changed the gender pronouns for my comment above! Of course it doesn't change any of the opinions; please do feel free to reach out if you'd like to chat with someone!!",
      "created_utc": 1611978599.0,
      "score": 1,
      "context": [
        {
          "id": "glb0lba",
          "author": "None",
          "body": "Hi guys! I am the individual who sent the post in! Thank you so much for your kind messages, but I am in fact a male! It doesn't change the situation, but the female was the one who left me! I hope that doesn't change any of your opinions!",
          "created_utc": 1611962452.0
        }
      ]
    },
    {
      "id": "glctg2h",
      "author": "None",
      "body": "Oh my gosh.. I've learned that fiancée and fiancé indicate male or female partner!! I looked it up!! I didn't know..my whole life I have never known this simple thing! Omg lol\n\nJust reverse all my statements that indicate the wrong gender. Lol ;-)",
      "created_utc": 1612002446.0,
      "score": 1,
      "context": [
        {
          "id": "glb0lba",
          "author": "None",
          "body": "Hi guys! I am the individual who sent the post in! Thank you so much for your kind messages, but I am in fact a male! It doesn't change the situation, but the female was the one who left me! I hope that doesn't change any of your opinions!",
          "created_utc": 1611962452.0
        }
      ]
    },
    {
      "id": "glctm4d",
      "author": "None",
      "body": "Further to my reply below:\n\n .. Wait...you used both spellings... lol.. It's all your fault haha ;-)",
      "created_utc": 1612002613.0,
      "score": 1,
      "context": [
        {
          "id": "glb0lba",
          "author": "None",
          "body": "Hi guys! I am the individual who sent the post in! Thank you so much for your kind messages, but I am in fact a male! It doesn't change the situation, but the female was the one who left me! I hope that doesn't change any of your opinions!",
          "created_utc": 1611962452.0
        }
      ]
    },
    {
      "id": "glby0ly",
      "author": "Oblique_Ocean",
      "body": "Hey thanks! Just edited.",
      "created_utc": 1611978697.0,
      "score": 1,
      "context": [
        {
          "id": "gl67ey8",
          "author": "Oblique_Ocean",
          "body": "If she left after learning more about the real you, she was never meant to stay.\n\n\\^Edited for correct gender pronoun.",
          "created_utc": 1611881504.0
        },
        {
          "id": "glbdnc7",
          "author": "dcdemirarslan",
          "body": "Why assume the op is a woman?",
          "created_utc": 1611968679.0
        }
      ]
    },
    {
      "id": "glfn57m",
      "author": "None",
      "body": "You're most welcome!!\n\nYES - You've got this!!\n\n*happy dance*",
      "created_utc": 1612058102.0,
      "score": 2,
      "context": [
        {
          "id": "gl83eg8",
          "author": "None",
          "body": "You're worthy of love!!\n\nYour fiancé has done you a favour!! I've heard of partners making it hell for the other person to recover. Why would you want him to stay if he is opposed to your issues?\n\nBetter off alone in this case. Better to have left now, than after the wedding or after kids!! Eek.\n\nNow is the time to take steps to recover, not spiral by not eating. Don't feed them more evidence why they did a good thing by leaving - get better, babe... Get WAY better then snag the perfect partner of your dreams!! <3",
          "created_utc": 1611920767.0
        },
        {
          "id": "gld0saq",
          "author": "None",
          "body": "I love it! Thank you so much. Step by step, and then the perfect person will come! But being healthy on your own is the most important thing, and being with someone who doesn't accept your faults and doesn't want to help you, shouldn't be your partner. We'll get there! ❤",
          "created_utc": 1612009295.0
        }
      ]
    },
    {
      "id": "gldoc16",
      "author": "body_acceptance",
      "body": "Exactly! Just make your main focus to eat, no matter what it is! You got this, it's hard but i'm proud that you're taking steps to improve yourself and recover!",
      "created_utc": 1612023845.0,
      "score": 1,
      "context": [
        {
          "id": "gl9peq2",
          "author": "body_acceptance",
          "body": "I struggled with an eating disorder and let me tell you, it isn't easy and it takes time. You need to think what is best for you and do what's best for you. Start slowly introducing foods and eat when hungry. if you don't feel like eating start off with 3 small meals a day and gradually your body will get use to the routine. don't put any restrictions on yourself, that lead me back to square one. Eat what you want and when you want. Remember that you are strong, beautiful and you can recover from this! Do this for you and no one else! Following eating disorder and body acceptance accounts on facebook and instagram really help so you are part of a community and don't feel so alone. Also you should consult with a professional and therapist that helps. If he can't love you through this than that really says a lot about him and you don't need that toxic behaviour in your life especially at a time like this!",
          "created_utc": 1611944740.0
        },
        {
          "id": "gld0i63",
          "author": "None",
          "body": "Thank you so much, I'll take this advice in my stride! Any food is better than no food right? In time, we'll get there, baby steps! Its a shame that these illnesses show the real intentions of people, its sad!",
          "created_utc": 1612009048.0
        }
      ]
    },
    {
      "id": "glc2vum",
      "author": "None",
      "body": "Hey! Don't you worry at all! You weren't to know! Just thought I'd say something! 😂 Thank you so very much, it means the world!",
      "created_utc": 1611981336.0,
      "score": 1,
      "context": [
        {
          "id": "glb0lba",
          "author": "None",
          "body": "Hi guys! I am the individual who sent the post in! Thank you so much for your kind messages, but I am in fact a male! It doesn't change the situation, but the female was the one who left me! I hope that doesn't change any of your opinions!",
          "created_utc": 1611962452.0
        },
        {
          "id": "glbxtqk",
          "author": "Oblique_Ocean",
          "body": "Hey!! I am so sorry! I just saw this and changed the gender pronouns for my comment above! Of course it doesn't change any of the opinions; please do feel free to reach out if you'd like to chat with someone!!",
          "created_utc": 1611978599.0
        }
      ]
    },
    {
      "id": "glcxpbq",
      "author": "None",
      "body": "Oh gosh, now thats why there are two spellings??? I thought it was just how my phone felt that day..feel very dumb rn 😂",
      "created_utc": 1612006478.0,
      "score": 2,
      "context": [
        {
          "id": "glb0lba",
          "author": "None",
          "body": "Hi guys! I am the individual who sent the post in! Thank you so much for your kind messages, but I am in fact a male! It doesn't change the situation, but the female was the one who left me! I hope that doesn't change any of your opinions!",
          "created_utc": 1611962452.0
        },
        {
          "id": "glctm4d",
          "author": "None",
          "body": "Further to my reply below:\n\n .. Wait...you used both spellings... lol.. It's all your fault haha ;-)",
          "created_utc": 1612002613.0
        }
      ]
    },
    {
      "id": "glcz49h",
      "author": "None",
      "body": "Lol, please don't!! We're both learning new things today haha. ;-)",
      "created_utc": 1612007788.0,
      "score": 1,
      "context": [
        {
          "id": "glb0lba",
          "author": "None",
          "body": "Hi guys! I am the individual who sent the post in! Thank you so much for your kind messages, but I am in fact a male! It doesn't change the situation, but the female was the one who left me! I hope that doesn't change any of your opinions!",
          "created_utc": 1611962452.0
        },
        {
          "id": "glctm4d",
          "author": "None",
          "body": "Further to my reply below:\n\n .. Wait...you used both spellings... lol.. It's all your fault haha ;-)",
          "created_utc": 1612002613.0
        },
        {
          "id": "glcxpbq",
          "author": "None",
          "body": "Oh gosh, now thats why there are two spellings??? I thought it was just how my phone felt that day..feel very dumb rn 😂",
          "created_utc": 1612006478.0
        }
      ]
    }
  ]
}