{
  "id": "l8zevb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1612051259.0,
  "title": "Request: I fainted and got my wake up call",
  "selftext": "(F18) A few days ago I fainted while I was walking my dog. I hit my head on the ground and it still hurts. I skipped breakfast and didn’t drink much. I’m underweight and been struggling with an ED since I was 15 and my family doesn’t know I control my weight because I don’t “look” typically anorexic. I never thought of it as a problem because I never got to the extreme with not eating. I had phase of counting calories but I still keep a careful track of what I eat. Nobody knows I panic when I see the numbers grow on the scale and can’t see the bones on my chest.\n\n&#x200B;\n\nThis is the first time I understood it has a direct affect on my health. My mum noticed I should eat more and now she forces me to eat. She knows I have had some mental health issues in the past so each time a new problem emerges she pushes it away by telling me I’m seeking attention. She is naturally underweight and always hated this about herself but also comments on other people when they’re overweight. She judged me when I ate more than her and she judges my appearance a lot which makes me feel terrible about myself. When I confront her about this, she tells me that I shouldn’t be so “fragile”, because it’s only her opinion. When she does sometimes notice I don’t eat normally she gets aggressive.\n\n&#x200B;\n\nI know I should get some help but on the other hand I’m afraid to tell anybody because they’ll think I’m seeking attention, but on the other hand I’m afraid that when I move out it’ll get out of hand.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l8zevb/request_i_fainted_and_got_my_wake_up_call/",
  "score": 66,
  "num_comments": 9,
  "comments": [
    {
      "id": "glfhlxx",
      "author": "fishonfire2213",
      "body": "please don’t let anyone, especially your mom, invalidate your experience. what you’re struggling with is incredibly difficult and deserves to be treated as such. as you try to heal, maybe try framing it as something you’re doing for yourself. your mom doesn’t seem to have a healing or helpful approach and as hard as it sounds, you might try to block her out. eat for you, not for her- it is not her body or her health that’s in question here, it’s yours and it matters. Also, talking to someone could make a world of difference. sending lots of positive vibes your way, I believe in you!",
      "created_utc": 1612055187.0,
      "score": 21,
      "context": []
    },
    {
      "id": "glfcsjy",
      "author": "None",
      "body": "I'm glad you've had an epiphany. If your head is still hurting it might be a good idea to visit a doctor and tell them about your head injury\n\nThe way our parents shape us can be hard to shake and I'm sorry you've gone through that. I hope you can find your way to a healing place",
      "created_utc": 1612052699.0,
      "score": 6,
      "context": []
    },
    {
      "id": "glg7vfu",
      "author": "teriyakigirl",
      "body": "It is so hard when a parent, someone who should be your safe place, makes you feel like you are not enough. Your concerns are very legitimate and you should seek help before your mental health gets worse. Your mother's comments and the way she judges you is NOT okay. It will continue to wear on you. It is a very good step you took in making this post. Please remember that you have so much more to offer the world than just your appearance. Best of luck moving forward <3",
      "created_utc": 1612069410.0,
      "score": 7,
      "context": []
    },
    {
      "id": "glia7pj",
      "author": "thatonegirl469",
      "body": "Hey, I recently fainted this week while I was showering and it was my sort of wake up call that somethings wrong even if I don’t really want to accept it. It’s always hard coming to accepting that there’s a problem and it’s good that you’ve realized. I’m also like you who panics when the numbers go up on the scale and can really impact how I feel about myself but I also try to convince myself that weight naturally fluctuates and although it doesn’t always work somedays it works and those baby-steps are all that matter.\n\nI feel like some people, like your mom, may not realize that this mentality that a lot of people suffer from doesn’t get fixed my forcing us to eat because that’s only a fraction of the problem since it’s more about the thoughts, at least it is for me. I always feel like I’m going to seem like I’m making this up or seeking attention when I desperately want to cry out for people but I have confided to two of the closest people to me who have made me accept that there’s a problem and that I’m not making it up. Finding people who will support you is important to trying and move towards getting better. I’m not in recovery yet but if you need someone to talk to feel free to message me :)",
      "created_utc": 1612119670.0,
      "score": 2,
      "context": []
    },
    {
      "id": "glfa08z",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1612051259.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glh5iij",
      "author": "Fungus666",
      "body": "Thank you ❤️ I’m eating more, it just makes me feel very insecure and guilty. I try to tell myself that eating normally is good and my weight does not define my worth but then I go to the kitchen to have something sweet and my mum tells me „haven’t you had enough of sweets? Leave some for us!” And it triggers it again and makes me feel like shit. I told my mum a couple of times that these comments make me feel bad about myself but she never listens and just says it’s her opinion. Anyway, thank you for the kind words ❤️",
      "created_utc": 1612098104.0,
      "score": 2,
      "context": [
        {
          "id": "glfhlxx",
          "author": "fishonfire2213",
          "body": "please don’t let anyone, especially your mom, invalidate your experience. what you’re struggling with is incredibly difficult and deserves to be treated as such. as you try to heal, maybe try framing it as something you’re doing for yourself. your mom doesn’t seem to have a healing or helpful approach and as hard as it sounds, you might try to block her out. eat for you, not for her- it is not her body or her health that’s in question here, it’s yours and it matters. Also, talking to someone could make a world of difference. sending lots of positive vibes your way, I believe in you!",
          "created_utc": 1612055187.0
        }
      ]
    },
    {
      "id": "glh5qi3",
      "author": "Fungus666",
      "body": "The headache is gone thanks :) It took a few days but I feel alright. Thank you ❤️",
      "created_utc": 1612098278.0,
      "score": 1,
      "context": [
        {
          "id": "glfcsjy",
          "author": "None",
          "body": "I'm glad you've had an epiphany. If your head is still hurting it might be a good idea to visit a doctor and tell them about your head injury\n\nThe way our parents shape us can be hard to shake and I'm sorry you've gone through that. I hope you can find your way to a healing place",
          "created_utc": 1612052699.0
        }
      ]
    },
    {
      "id": "glh5pqu",
      "author": "Fungus666",
      "body": "Thank you ❤️ I’ll seek therapy and try to get better",
      "created_utc": 1612098262.0,
      "score": 1,
      "context": [
        {
          "id": "glg7vfu",
          "author": "teriyakigirl",
          "body": "It is so hard when a parent, someone who should be your safe place, makes you feel like you are not enough. Your concerns are very legitimate and you should seek help before your mental health gets worse. Your mother's comments and the way she judges you is NOT okay. It will continue to wear on you. It is a very good step you took in making this post. Please remember that you have so much more to offer the world than just your appearance. Best of luck moving forward <3",
          "created_utc": 1612069410.0
        }
      ]
    },
    {
      "id": "glifwvc",
      "author": "Fungus666",
      "body": "Hi! Thank you for your comment ❤️ I’m glad you also realised that there’s a problem and got support from the people close to you.",
      "created_utc": 1612122282.0,
      "score": 1,
      "context": [
        {
          "id": "glia7pj",
          "author": "thatonegirl469",
          "body": "Hey, I recently fainted this week while I was showering and it was my sort of wake up call that somethings wrong even if I don’t really want to accept it. It’s always hard coming to accepting that there’s a problem and it’s good that you’ve realized. I’m also like you who panics when the numbers go up on the scale and can really impact how I feel about myself but I also try to convince myself that weight naturally fluctuates and although it doesn’t always work somedays it works and those baby-steps are all that matter.\n\nI feel like some people, like your mom, may not realize that this mentality that a lot of people suffer from doesn’t get fixed my forcing us to eat because that’s only a fraction of the problem since it’s more about the thoughts, at least it is for me. I always feel like I’m going to seem like I’m making this up or seeking attention when I desperately want to cry out for people but I have confided to two of the closest people to me who have made me accept that there’s a problem and that I’m not making it up. Finding people who will support you is important to trying and move towards getting better. I’m not in recovery yet but if you need someone to talk to feel free to message me :)",
          "created_utc": 1612119670.0
        }
      ]
    }
  ]
}