{
  "id": "l9ac3p",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1612091428.0,
  "title": "Request: Want to recover but extremely scared of gaining fat.",
  "selftext": "[16M] - I’ve recently began attempting recovery from my second spell of bulimia.  I’m a athlete and have a very low body fat percentage and a somewhat decent amount of muscle.  However I am scared that the increase in food will cause me to get fatter  I am avoiding the scale completely and was just wondering if there are any other tips that I could follow to help me get over this fear?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/l9ac3p/request_want_to_recover_but_extremely_scared_of/",
  "score": 57,
  "num_comments": 8,
  "comments": [
    {
      "id": "glhdj6d",
      "author": "Mason385",
      "body": "(24M) I was a high school and college athlete (Track and XC) I struggled with an ED throughout high school, a big thing for me was Telling myself that in order to be the athlete that I want to be, recovery is necessary. Adding on weight will allow me to be happier, stronger, faster, and have more energy. Participating in sports at such a low weight can lead to injury for athletes. You can do this",
      "created_utc": 1612103642.0,
      "score": 19,
      "context": []
    },
    {
      "id": "gli7ate",
      "author": "None",
      "body": "In high school, I was captain of the men’s water polo team and ate SO MUCH FOOD, ALL THE TIME. I felt strong, played really well, and never looked fat in the slightest. \n\nIn college, I started the swim team, developed a restrictive eating disorder with compulsive exercising, and lost a lot of weight, like 30 pounds. I also stopped being able to perform athletically and felt like shit.\n\nFor a few years I had the same fear as you and would not allow myself to gain back some weight. Yet, I eventually got fed up, sought out therapy, and started gaining again— trusting that the outcome my ED was saying would happen wasn’t true. Low and behold, I’ve gained 20lbs, feel much better, and do not look fat in the slightest (even if I did WHO CARES because I have energy again).\n\nYou gotta trust that your ED is trying to scare you into being underweight. It’s showing you your most feared outcome, not reality. You got this.",
      "created_utc": 1612118344.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gli1aj2",
      "author": "mlschaffnit",
      "body": "I completely understand how you feel, I am in the process of recovering from ED’s as well. I used to be so obsessed with exercise, weight, and calorie counting. I am still unlearning behaviors even after months of recovery... you are an athlete with a high muscle percentage. Your body needs food. I am also athletic and I could never stop obsessing about food until I allowed myself to have it. I know it’s hard and when you see other people’s recovery journeys sometimes it makes it feel impossible and you have no idea how they had the strength to do it. But you have the ability to recover. If you ever need someone to talk to just message me.",
      "created_utc": 1612115657.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gliw6yr",
      "author": "katopage",
      "body": "You're so close!! Wanting to recover is the hardest part. \n\nI always tell myself, \"new body, new me\" when I feel those body image thoughts come in. You're opening yourself to less pain, more health, and greater self love and if three, five pounds creep up in there it is completely worth it. It is ultimately only you who is noticing and feeling it. \n\nAvoid checking your body in the mirror, avoid looking at the other athletes' food consumption, and continually remind yourself what your life will look like in five years if you continue your disorder, or if you can recover",
      "created_utc": 1612129831.0,
      "score": 3,
      "context": []
    },
    {
      "id": "glgy6r4",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1612091428.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gllhanb",
      "author": "peachypokes",
      "body": "I think it’s important to work with a therapist who will help you do the work to unravel this fear. The fear of fat and weight gain is instilled in us by a culture that profits off of that fear. You’re going to have to learn to stop equating fat with moral and personal failure, because weight and body shape is not something that is in anyone’s control. Once you’ve done this work, and you know that weight or fat gain isn’t a result of some deep personal failure but rather a result of a body doing its job to try to keep you alive, you will feel so much more free in your recovery, and you’ll have much more compassion for others too. \n\nLots of good reads to help with this, but something like Anti-Diet by Christy Harrison may be a good place to start, especially if you can’t do therapy right away.",
      "created_utc": 1612186550.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glur11e",
      "author": "shizzymccreepy69",
      "body": "\nI had the same fear when I seriously considered recovering. It definitely takes a lot of work and persistence to change your mindset about what gaining weight really means. For me, ditching the scales permanently was the first step. I have not weighed myself in over a year. I don’t avoid mirrors, I think it’s important to recognise the process visually so it’s less daunting. I began to think of food as something that would either fuel my body to function or something that would just be really delicious to enjoy. Tbh, for the first few months of recovery I baked cookies three times a week and just let myself have at them. Cooking is a nice way to acknowledge all the amazing, nutritious elements of a meal and help you feel more connected to food in a positive way. I can’t tell you you’re not going to gain weight but I can promise you that recovery is the best path you will ever take. I like the way I look more now than I ever did with an ED. And more importantly, I get to live a fulfilling life without constantly feeling terrible mentally, physically and emotionally. Plus, I still fit into all my old clothes - not that it matters and it’s different for everyone, but I’m sure that may be something that could be reassuring to you.",
      "created_utc": 1612355297.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gn305h4",
      "author": "None",
      "body": "27m, I've been a competitive cyclist for years, and throughout I've struggled with anorexia. Back in the thick of my disorder, I was competing in races and time trials, but I was performing like absolute garbage. My lizard brain couldn't make the connection that eating 1000kcal while training and racing = no bueno. Being under 110lbs as a 5'9 male is not good from any medical perspective, but strictly from an athletic point of view it's absolutely terrible for performance.\n\nNow I still train, but I eat 3000 and sometimes over 3000kcal without guilt. I'm about 10x better now that I treat my body right by feeding it what it needs to perform at its best. If you look at it from a perspective of eating more will equal better performance, it could help. I'm not saying that process will be easy, but I guarantee you'll be happier with your performance in the end.",
      "created_utc": 1613153151.0,
      "score": 1,
      "context": []
    }
  ]
}