{
  "id": "la1hdx",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1612180621.0,
  "title": "Request: Pregnancy",
  "selftext": "I recently was pregnant. I just had an abortion not because of my eating disorder but because me and my partner are not ready to have a child. But I know I am terrified of being pregnant and carrying a child full term because I don’t want to get fat. I see people I went to high school with lose them selves after having a baby and I fear that the most. I am in a good relationship where we work out together I haven’t purged in 5 years. And I’m at a healthy weight. My partner and I work out together and I’m at a healthy weight. But I know I constantly worry about gaining weight. Weighing myself is something I avoid because I focus too much on the number I lift weights and I know I’m suppose to gain weight, that’s all I focus on is that I am exercising so the number doesn’t matter. It helps me.\n\n&#x200B;\n\nThis post is all over the place. But I just want to get it out that I’m scared to have kids. I’ve talked to some friends about this same fear they tell me it’ll be different when I’m pregnant because “I’ll be carrying a life” but no that doesn’t matter to me. I am so selfish with my body. And it’s a constant fear I have.. right now anyway. Maybe when I’m ready to have kids it’ll be different. 🤷🏻‍♀️ can anyone relate? Does anyone have words of wisdom for me?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/la1hdx/request_pregnancy/",
  "score": 50,
  "num_comments": 19,
  "comments": [
    {
      "id": "gll8p7l",
      "author": "None",
      "body": "I'm pretty sure you're supposed to be \"selfish\" with your body, it does belong to you after all.",
      "created_utc": 1612180955.0,
      "score": 37,
      "context": []
    },
    {
      "id": "gllasrv",
      "author": "OneDay95",
      "body": "Your body is yours. You don’t have to have a child for any reason at all. I also had this fear for a long time and I’m completely fine with it now. I’m almost anti-natal now LOL. The words of wisdom I offer are simple: stop living for other peoples expectations of YOUR life! If pregnancy scares you because of the body changes DONT HAVE A CHILD! There’s never a “bad reason” to not want a kid. Any reason is valid if you don’t want one. Who gives a fuck. Worry about yourself, not the possibility. I will never form an attachment to a child because of my body dysmorphia (ALOOOT of women resent their kids because of this) and so I just don’t want kids. Dont force yourself if you don’t want to go through the changes. Even when you want kids, because theyeir are people who do, it doesn’t mean you want the horrible and “interesting” changes you go through with your body. Please just worry about yourself rather than bringing something else into the world.",
      "created_utc": 1612182494.0,
      "score": 25,
      "context": []
    },
    {
      "id": "glluseo",
      "author": "TravelbugRunner",
      "body": "Don’t let other people try to talk you into having kids just because it’s the “normal thing to do”. \n\nSome of us aren’t meant to be parents and that should be ok. \n\nIf we have enough insight into ourselves then we should take the route that’s best for us and not one that’s best for someone else. \n\nI’m not having kids because: \n\n*I have 4 severe mental illnesses and I’m unable to hold down a job or attend university. \n\n*I live in poverty and wouldn’t have the financial resources to adequately take care of a kid. \n\n*I have a personality disorder (Schizoid personality disorder) that makes it difficult for me to be attached to other people. I would probably have very little or no emotional attachment to my child. And that’s really not good. I’d probably be neglectful and I can’t bear the thought of hurting a child in anyway. \n\n* And I have been suffering with Anorexia purging subtype for 12 years and I don’t really see myself ever really recovering (fully). \nIt would probably be hard for me to get pregnant in the first place and then there’s the strong likelihood that my child could also develop learning disabilities, mental illnesses, or eating disorders just like me. \n\nI don’t want to bring a child into the world knowing that he or she might turn out like me or have a very difficult and miserable life. \n\nI don’t want to bring a child into the world and then have them crying about how much they wish they were dead. \n\nI feel that by not having kids I’m saving someone from the difficulties of life and the eventual future of sickness, old age, and death. \n\n***The above statement is just my own personal opinion.***\n\nThere are people who are better suited for parenthood: psychologically, emotionally, and financially. \n\nAnd that’s ok, too. \n\nI just feel like people really need to make sure they know themselves and have a clear sense of their circumstances in order to make the best choice for them. \n\nThe thing to keep in mind is: “Will I be able to take care of this child, have resources necessary for their life, not hurt them, and help them develop into a self sufficient adult?” \n\nBecause that’s the bottom line. It’s not solely about the parents it’s about the future life of a child.",
      "created_utc": 1612192479.0,
      "score": 7,
      "context": []
    },
    {
      "id": "glmg2bo",
      "author": "cjx888x",
      "body": "1) The story that you ‘have’ to gain a bunch of weight to carry a child is rooted in myths about the fragility of women during pregnancy, plus a lot of male doctors. Unless you have complications, women *can* eat healthy AND work out pretty much through the entire pregnancy. I know a lot of women who are gym rats, pilates instructors, outdoor-sports enthusiasts, or just other types of act fit folks, who had zero issue with this and who’s body fat was relatively unchanged. The ‘weight’ you ‘have’ to gain is not body fat. The number on the scale has to go up bc of the weight of the baby, and all the other additional expanding tissues/fluids inside your uterus and breasts. Also combined with some swelling, which I hear is super common especially in the hands and face, but could be all over anywhere. But It is absolutely possible to weight the same after giving birth and stopping milk production. \n\nYes, you do have to eat more calories, bc your body is basically doing what is essentially having a higher metabolism. Your body will use more calories to grow a baby. So you have to eat more, in the same way a young child needs food while they are growing. It doesn’t mean you ‘have’ to gain body fat. \n\n2) Don’t have a baby if you don’t want to. For any reason. Any reason is valid. ‘I don’t want the risk of stretch marks’ is valid. ‘I just don’t want a child’ is valid. ‘I work hard to care for my mental health and I don’t want anything that might interrupt that.’ is valid. You don’t ever have to have kids, and any reasons is valid. I am 35, and was surgically sterilized last year after a lifetime of trying to find a doc to do it, because I simply do not want kids and never have!\n\n3) If you long to carry a child but fear for your ED and mental health, find a support group, a therapist, a nutritionist/trainer, whatever you need. A team that can help you set goals and address fears in advance and make a game plan help you keep on track during the process in regards to staying in shape but *also* in regards to monitoring your ED and wellbeing. \n\n4) If you are torn bc you long for a child but simply don’t want to carry one, adopt or get a surrogate! You don’t have to carry a child, and any reason for not wanting to is valid. Your body, your life, your choice 100%.\n\n5) At the end of the day, your choice about what your want from your body is what matters. You are allowed to have ideas about what you want to look like! Without discounting that: I feel that its still important to say that having your body change during pregnancy is totally ok, and the world loves to spend huge amounts of energy obsessing and scrutinizing over womens bodies and what they look like before/during/after literally *anything*. Our bodies can and will change for so many reasons, and the rest of the world can quite literally fuck off. If what you want is the freedom to feel good about yourself and your body regardless of the way it might change from pregnancy, you should absolutely make space for that. Our culture is obsessed with imagery of women that implies that being young, thin, and actually virginal or otherwise ‘untouched’ by other men, is the only way to be truly attractive. Think about it. Our culture constantly demonizing women looking like anything else.... it freezes the idea of ideal female beauty at an age when we can more easily be imagined as a possession rather than a powerful autonomous being. Childlike but still sexually developed. New and untouched. It’s pretty sick actually. \n\nWhatever you choose to do- I wish you the best luck!",
      "created_utc": 1612200519.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gllvm1u",
      "author": "Kikicutie",
      "body": "(Warning: Possibly triggering for some) \n\nI have undiagnosed anorexia and when I was pregnant with my latest baby (I have 2 kids now) I was at my lowest emotional state that I had ever been in my life and even rhough I knew that it was possibly hurting my baby by restricting I still couldn't bring myself to meet my essential calorie intake. Everytime I went in for a check up the doctor would freak out about my lack of weight gain and have an ultrasound done. By some miracle my baby boy was completely fine and gaining weight perfectly - but I was still losing weight. I was literally dropping pounds while my baby gained and my overall weight stayed basically the same for the last 2 trimesters of my pregnancy. People where surprised to hear that I was due in a few weeks because I hardly looked pregnant at all. \n\nI will forever be thankful and guilty that my baby was born healthy with no complications, no thanks to me. He took a bottle as my body couldn't produce enough to breastfeed. This is a mental illness. I know that I will not be having any more kids and my anorexia is the number one reason why. \n\nIt's been a year and a half since then and my body dysphoria is still telling me that I have pregnancy fat to lose even though I KNOW that I hardly gained anything in the first place. EDs are a BITCH.",
      "created_utc": 1612192787.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gll89bw",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1612180621.0,
      "score": 2,
      "context": []
    },
    {
      "id": "glmhyj3",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1612201247.0,
      "score": 2,
      "context": []
    },
    {
      "id": "glnhs2a",
      "author": "bab_101",
      "body": "No words of wisdom but I can relate! It’s terrifying.",
      "created_utc": 1612214969.0,
      "score": 2,
      "context": []
    },
    {
      "id": "glmmiel",
      "author": "ladysoup666",
      "body": "Okay so this will be in two parts; one for if you’d like to have a child and two for if you wouldn’t. \n\n1. I have struggled with anorexia and purging since I was 11. I have been to treatment and I now see a therapist that specializes in ED’s weekly. When my husband and I decided to talk about kids this was my biggest fear. I was (sometimes still can be) obsessed with the numbers and I also didn’t want to look like an awful mom for fearing the inevitable that comes with making a person. \n\nWe started working on preparing my brain for that change for weeks before my husband and I started trying and I am now 32 weeks pregnant. I made sure to eat what I needed to make sure that my baby was getting enough, but I absolutely wasn’t “eating for two” which is kind of a myth. I was in a butt load of prenatal vitamins and continued to see my therapist weekly. \n\nYup, some days are hard, especially when I found out I had gestational diabetes and had to start tracking what I was eating. But I MADE SURE to talk to my husband, therapist and midwife about how I was feeling at all times. I’ve stayed healthy during this pregnancy and learnt a lot about recovery and if anything it has made recovery much more meaningful. I continue going to the gym and staying active and i feel great. I kicked this ED’s butt not just for me but for my family and I’m very proud of that. And coming from a very vain place in my head... my body honestly doesn’t look THAT different. I don’t know if it was genetics because my mom stayed small with hers or if it’s just from eating well and working out.\n\n2. If you do not want kids (because of the ED or not) don’t do it. Completely 100% your choice and if it will not make you happy or it will be detrimental to your mental health DO NOT DO IT. Your choice! \n\nGood luck with everything 💕",
      "created_utc": 1612202981.0,
      "score": 2,
      "context": []
    },
    {
      "id": "glmkrqe",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1612202315.0,
      "score": -6,
      "context": []
    },
    {
      "id": "glnaiix",
      "author": "tokpie21",
      "body": "I have a ED and was recently pregnant and carried to full term, it effected my life and perception of myself massively, but I found with having the correct support and things, it had helped with not purging and setting yourself a meal plan throughout the pregnancy which helped me and baby. So my body didn't change to much. \n\nBut if you're not ready for a baby and have concerns about being pregnant with a ED it might help talking to a professional who can also offer advice. \n\nI hope this helps as its from my own experience with pregnancy and having a ED.",
      "created_utc": 1612212221.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glotfbl",
      "author": "kizeltine",
      "body": "I can totally relate in the sense of not wanting to bare a child because you don’t want it to destroy your body. That’s a major reason why I don’t want to have a child. Whether it’s selfish or not so be it because at the end of the day it’s my body and my life. \n\nDon’t push yourself to have kids if you aren’t ready. And your reasons of not wanting to have kids, or fear of having them, are totally valid because their your reasons. Because it’s your life, your body, you get to be selfish.\n\nThe reality is you may never be ready to have a child because of the fear of what it may bring on your body and that’s OK. Because remember, there’s more than one way to have a child in this day and age. Get a surrogate or adopt. In fact, if I were to have a child I’d adopt because why bring in a life when there’s so many children out there already who need the love and support and protection? \n\nThe take away to this is don’t feel bad or guilty. It’s your life and you have the right to be selfish with your body. Just worry about living your life and when the topic of children come up again, deal with it accordingly.",
      "created_utc": 1612236694.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glzosgb",
      "author": "lonelydays416",
      "body": "This is so hard. I am currently almost 6 months pregnant and I have gained 6lbs. I cry every time I step on the scale. I am also a runner so I run daily but sometimes I cave into cravings and binge but I feel disgusting afterwards. I hate gaining weight and I hate eating and also not eating. It’s so hard to find a balance for the health of the baby. I have preemie babies for various reasons. My body is not meant to have kids so I am trying to eat to ensure this baby has a good birth weight but hell this is so hard",
      "created_utc": 1612449480.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glmlbew",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1612202521.0,
      "score": -5,
      "context": [
        {
          "id": "glmhyj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612201247.0
        }
      ]
    },
    {
      "id": "gln0tiv",
      "author": "emimagique",
      "body": "What a horrible thing to say to someone who is struggling",
      "created_utc": 1612208438.0,
      "score": 2,
      "context": [
        {
          "id": "glmkrqe",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612202315.0
        }
      ]
    },
    {
      "id": "gln0r26",
      "author": "thanksfortalking",
      "body": "Hi there! How's it going? I hope that life has been good to you lately and that you're having an awesome day.\n\nI would really appreciate it if you deleted your comment and comment replies on this post. OP made this post because she's struggling with some difficult things. She's asking for help so \nI think we need to be sensitive to that. I hope that others have and will always do that for you when you need it.\n\nI'm also more pro-life/anti-abortion than most people. However, what is done is done and making OP feel terrible won't change it. I actually think that when harsh language is used, some people feel attacked and then get defensive. It seems counterintuitive, but this can make them less likely to change their opinion or behavior in the future.\n\nIf you are feeling angry about abortion or something else, that's okay, but it's probably best that you express that in a separate thread or sub where you will get more support.",
      "created_utc": 1612208410.0,
      "score": 1,
      "context": [
        {
          "id": "glmkrqe",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612202315.0
        }
      ]
    },
    {
      "id": "glmmahg",
      "author": "AmyShroomer888",
      "body": "Fuck YOU. No woman is ever obligated to bring a child into existence. You are a despicable human.",
      "created_utc": 1612202897.0,
      "score": 6,
      "context": [
        {
          "id": "glmhyj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612201247.0
        },
        {
          "id": "glmlbew",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1612202521.0
        }
      ]
    },
    {
      "id": "gln06i9",
      "author": "Ambystomatigrinum",
      "body": "Well, thank god there's thousands of other kids out there you could have adopted instead! Its not as if you don't have a child because that one specific fetus isn't available to you. But you're not trying to make a logical argument, you're just being an asshole.",
      "created_utc": 1612208187.0,
      "score": 1,
      "context": [
        {
          "id": "glmhyj3",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612201247.0
        },
        {
          "id": "glmlbew",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1612202521.0
        }
      ]
    },
    {
      "id": "gln22ij",
      "author": "None",
      "body": "I deleted.  I do apologize to OP.  I understand your struggles, I'm deeply sorry for what you've been through.  I am actually jealous of those who can conceive so easily.  I cannot.  I hope you can put this behind you and recover in a healthy way.",
      "created_utc": 1612208933.0,
      "score": 2,
      "context": [
        {
          "id": "glmkrqe",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612202315.0
        },
        {
          "id": "gln0r26",
          "author": "thanksfortalking",
          "body": "Hi there! How's it going? I hope that life has been good to you lately and that you're having an awesome day.\n\nI would really appreciate it if you deleted your comment and comment replies on this post. OP made this post because she's struggling with some difficult things. She's asking for help so \nI think we need to be sensitive to that. I hope that others have and will always do that for you when you need it.\n\nI'm also more pro-life/anti-abortion than most people. However, what is done is done and making OP feel terrible won't change it. I actually think that when harsh language is used, some people feel attacked and then get defensive. It seems counterintuitive, but this can make them less likely to change their opinion or behavior in the future.\n\nIf you are feeling angry about abortion or something else, that's okay, but it's probably best that you express that in a separate thread or sub where you will get more support.",
          "created_utc": 1612208410.0
        }
      ]
    },
    {
      "id": "glnt8ev",
      "author": "thanksfortalking",
      "body": "Thank you so much for deleting it and being open. I'm sorry. I know that can be a giant struggle.",
      "created_utc": 1612219712.0,
      "score": 1,
      "context": [
        {
          "id": "glmkrqe",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1612202315.0
        },
        {
          "id": "gln0r26",
          "author": "thanksfortalking",
          "body": "Hi there! How's it going? I hope that life has been good to you lately and that you're having an awesome day.\n\nI would really appreciate it if you deleted your comment and comment replies on this post. OP made this post because she's struggling with some difficult things. She's asking for help so \nI think we need to be sensitive to that. I hope that others have and will always do that for you when you need it.\n\nI'm also more pro-life/anti-abortion than most people. However, what is done is done and making OP feel terrible won't change it. I actually think that when harsh language is used, some people feel attacked and then get defensive. It seems counterintuitive, but this can make them less likely to change their opinion or behavior in the future.\n\nIf you are feeling angry about abortion or something else, that's okay, but it's probably best that you express that in a separate thread or sub where you will get more support.",
          "created_utc": 1612208410.0
        },
        {
          "id": "gln22ij",
          "author": "None",
          "body": "I deleted.  I do apologize to OP.  I understand your struggles, I'm deeply sorry for what you've been through.  I am actually jealous of those who can conceive so easily.  I cannot.  I hope you can put this behind you and recover in a healthy way.",
          "created_utc": 1612208933.0
        }
      ]
    }
  ]
}