{
  "id": "laca54",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1612209081.0,
  "title": "Request: Not worthy of recovering",
  "selftext": "You ever feel like you can’t even consider recovery until you physically look like you’re dying because mentally I’m already dying and that should be all that matters because this is a MENTAL DISORDER but no..I think people associate eating disorders with being shallow and they forget it’s a mental sickness so how I look on the outside shouldn’t make you question me at all even eating disorder clinics won’t admit you if you’re not underweight like they’re supposed to be the experts in this they should know more than anyone it’s not about your weight it’s about what’s going on in your mind..I’m so tired of feeling like this but I still feel obligated to keep going",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/laca54/request_not_worthy_of_recovering/",
  "score": 93,
  "num_comments": 9,
  "comments": [
    {
      "id": "gln59m2",
      "author": "None",
      "body": "I feel this way all the time--like I was never \"sick enough\" to have started recovery in the first place. The bottom line is that these thoughts are just another way that our eating disorders try to take over our lives. ED tells us lies and we have to fight harder than ever to get past them.",
      "created_utc": 1612210191.0,
      "score": 15,
      "context": []
    },
    {
      "id": "glo15ek",
      "author": "yosrah43_",
      "body": "Preach. I was literally talking to my ED today telling it to shut up, I'm so exhausted of always battling these thoughts. And it is such bullshit about the weight thing. Larger bodies, smaller bodies, and medium bodies all equally get ED and all equally deserve help.",
      "created_utc": 1612223180.0,
      "score": 7,
      "context": []
    },
    {
      "id": "glovtkp",
      "author": "meilz0nwhe3lz",
      "body": "I so understand this, it’s so hard to deal with when even the medical industry is perpetuating the idea that to receive help, be heard and/ or feel loved you need to be sicker and thinner but eating disorders are so much more then that and it in rages me how few people seem to understand this.  That it doesn’t matter if you’re over or under weight, if you’re eating or fasting you have to work so hard to complete the simplest of tasks because you can’t stand to look at you’re body when you have a shower or been seen when you go outside worst of all every time you eat your have to battle this horrible bitch Ana, Ed, Mia, who ever tf screaming at you to stop you have to spend so much mental energy justifying every bite of food you take and then cope with the reproductions that inevitably come after.  If you feel like you’re not sick enough, you are.",
      "created_utc": 1612237918.0,
      "score": 3,
      "context": []
    },
    {
      "id": "glpful3",
      "author": "LevelSkullBoss",
      "body": "I have felt like that so many times. I have lost people I cared about too because they couldn’t understand that you don’t have to be at a low BMI to be sick and actively encouraged me to return to my ED (which had been killing me!) because I had gained weight in recovery and you can only do that up to a certain weight and actually I never had an eating disorder because I wasn’t thin enough, it was unhealthy to gain weight, etc etc, you know the deal - and you know what? I’m still here to talk about it and I wouldn’t be if I’d listened to one word of their BS. In recovery - real recovery, not half-ass recovery - I’ve found peace with myself and so can you! It’s not always easy to live in a body that society deems unworthy and therefore some sort of statement on your worth as a person, and it’s hard not to internalize baseless pseudoscience about weight and eating and bodies and eating disorders, but you can do this. There’s a ton of good information out there to help you get your freedom around food back and a lot of people rooting for you! \n\nDon’t give up just because you’re not “sick enough,” because you will never be sick enough. The best time to recover is always right now.",
      "created_utc": 1612250983.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gln2g24",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1612209081.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gloqz9r",
      "author": "Billie_Eilish_Fan_14",
      "body": "The sooner you seek treatment, the easier it will be to get better. The longer you wait, the farther you will fall into the cycle of the ED, making it harder and harder to get out of. Keep that in mind.\n\nAnd you‘re right! Everyone with an ED needs help, no matter what.  \nStay strong, okay? You can always message me if you need anything. 💙",
      "created_utc": 1612235467.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glpaq5r",
      "author": "CeylonSiren",
      "body": "I had a therapist who looked at me and just said ‘can’t you just stay like this?’ When I was trying to lose weight due to my ED and she thought I looked ‘normal’ then.",
      "created_utc": 1612247111.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glqctsv",
      "author": "metempsychosis99",
      "body": "Most people don't understand eating disorders man. Unless you look emaciated there's not so much wrong with you and you're not worth checking on. That's the mentality. That you should suffer in silence until your mental struggle shows on the outside.",
      "created_utc": 1612275529.0,
      "score": 1,
      "context": []
    },
    {
      "id": "glpfv60",
      "author": "auto-xkcd37",
      "body": "> half ass-recovery\n\n***\n\n^(Bleep-bloop, I'm a bot. This comment was inspired by )^[xkcd#37](https://xkcd.com/37)",
      "created_utc": 1612250996.0,
      "score": 1,
      "context": [
        {
          "id": "glpful3",
          "author": "LevelSkullBoss",
          "body": "I have felt like that so many times. I have lost people I cared about too because they couldn’t understand that you don’t have to be at a low BMI to be sick and actively encouraged me to return to my ED (which had been killing me!) because I had gained weight in recovery and you can only do that up to a certain weight and actually I never had an eating disorder because I wasn’t thin enough, it was unhealthy to gain weight, etc etc, you know the deal - and you know what? I’m still here to talk about it and I wouldn’t be if I’d listened to one word of their BS. In recovery - real recovery, not half-ass recovery - I’ve found peace with myself and so can you! It’s not always easy to live in a body that society deems unworthy and therefore some sort of statement on your worth as a person, and it’s hard not to internalize baseless pseudoscience about weight and eating and bodies and eating disorders, but you can do this. There’s a ton of good information out there to help you get your freedom around food back and a lot of people rooting for you! \n\nDon’t give up just because you’re not “sick enough,” because you will never be sick enough. The best time to recover is always right now.",
          "created_utc": 1612250983.0
        }
      ]
    }
  ]
}