{
  "id": "lc1iko",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1612394902.0,
  "title": "Request: What can I do to so I’m not a trigger for my SO recovery",
  "selftext": "My SO and I have been together for 8 months. I’m  underweight and she’s overweight and is recovering from ED. I made a goal to gain muscle mass this year and I’ve been going to the gum every evening and drinking protein shakes and making sure to eat like 4 times a day and stuff like that.  She says she want me to be happy but that my new habits has made her feel more uncomfortable and ashamed. \n\nI want to reach my body goals but I also don’t want to see my SO feeling down because of my actions and getting depressed and anxious. Any advice on how we can both coexist in the same household when we have different “food goals”? Thanks for the advice.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lc1iko/request_what_can_i_do_to_so_im_not_a_trigger_for/",
  "score": 49,
  "num_comments": 11,
  "comments": [
    {
      "id": "glxaqtv",
      "author": "Monkeyfighter13",
      "body": "It might be good advice to do some research to nutritionists and therapists that specialize in EDs. You should be able to reach your own goals without the fear of triggering her. This is her battle, and what you’re doing isn’t bad. It seems like she would benefit to a healthy relationship with food and exercise, and if she’s ready to get well and seek professional help then you both can progress mentally and physically together",
      "created_utc": 1612395297.0,
      "score": 28,
      "context": []
    },
    {
      "id": "glxkrjc",
      "author": "Carrie_Mc",
      "body": "As someone who has had to recover around people who understand very little about eating disorders, it's a battle that she has to do.\n\nUnfortunately the world is just triggering, whether it's people, internet, celebrities, or even just food packaging - there will always be something to trigger us and make us feel like we can't do it bc it's too hard and it's easier to place the blame elsewhere.\n\nAll I can say is that you keep doing what you're doing as long as you are 100% it's healthy and sustainable for you and reassure your SO that you have to do this for yourself and it's not a reflection on them or the way you think they should live or get better.\n\nIt may also be able for them to look into resources that can help them cope with triggers and separate themselves from it.",
      "created_utc": 1612400210.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gly7twp",
      "author": "tymopa",
      "body": "One thing people haven't mentioned (and I agree with nearly everything they have said) is that you need to be careful with talking about what and when you are eating and when you are exercising. Also, pointing out what someone else (stranger or otherwise) is or is not eating or doing is equally troublesome. Even the slightest comments are burdensome to someone with an ED because society constantly obsesses over it. My husband is an avid exerciser and he will often come home and tell me how exhausted he is because he worked out so hard. In general, just don't.\n\nI would also refer you to NEDA and read up and possibly ask them some questions. Your partner needs to know that the path she is taking is honored and that all you care about is that she feels mentally and physically strong. Tough stuff but good on you for asking.",
      "created_utc": 1612411755.0,
      "score": 10,
      "context": []
    },
    {
      "id": "glye58k",
      "author": "Special_Cabinet",
      "body": "I’m trying to recover from anorexia and my boyfriend is very into fitness and bodybuilding. It is super triggering to me when I suggest something for dinner and he says he doesn’t want it because it’s “too much this” or “not enough that” and things like that. I imagine for any ED those kinds of things would be triggering. Its caused a lot of problems for our relationship honestly. I would say the biggest thing is please just be patient with her and understand how hard it is for her to combat all the negative thoughts.",
      "created_utc": 1612415353.0,
      "score": 9,
      "context": []
    },
    {
      "id": "glxme2p",
      "author": "None",
      "body": "Your SO is going to have to make progress on her own, unfortunately. It's not something you can do for her. But it's commendable and very kind that you want to make her journey a bit easier.\n\nYou didn't say what eating disordered behaviors and thinking she struggles most with, so my advice is going to be pretty general. I wouldn't talk about calories. Your needs and her needs will be different, so she doesn't need to hear about your calorie or protein goals. I think it's ok for her to know you're working out, but if you want to talk about it, I would emphasize the progress you're making in gaining strength, which is your goal. It's ok to be happy that you doubled your bench press, or whatever goal you're working on. I wouldn't pressure her to go to the gym with you or to workout, which can be hard when you're feeling good about exercising and your gains. If she struggles with binge eating certain foods, it's probably helpful not to keep a lot of them around.",
      "created_utc": 1612401004.0,
      "score": 7,
      "context": []
    },
    {
      "id": "glx9x8u",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1612394902.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gm3wyz8",
      "author": "TailsMcleod",
      "body": "I can only talk from my experiences but going to a gym was actually really helpful in my recovery. My boyfriend (who've I known for 10 years) is a big gym bunny and going along with him and having him there to show me how to do certain exercises and helping me to plan workouts helped us both. He could see what issues I found most triggering and adapt to them and I didn't feel so self conscious in the gym because I had him to go to if I started to feel overwhelmed or upset by it.\n\nAs a general rule too we don't really discuss calories or macros or any of that. We also learnt to be quite blunt with our own goals: he's doing xyz and I am doing abc. We are there to support each other, not compare, and we also listen to each others plans quite objectively. \n\nI can't imagine how hard it is for you to deal with, but it is also her recovery to take responsibility of. All you can do is support her through whatever steps she decides to take.",
      "created_utc": 1612528341.0,
      "score": 2,
      "context": []
    },
    {
      "id": "glxhe9w",
      "author": "He_who_humps",
      "body": "We make sacrifices for the ones we love. If your SO is struggling my opinion is that you should modify your eating habits to help the situation - within reason. That being said, you should do it in a healthy way.",
      "created_utc": 1612398535.0,
      "score": -7,
      "context": []
    },
    {
      "id": "gm1wor2",
      "author": "edie43",
      "body": "One thing that you can do is just give her some reassurance that her recovery journey is right for her. Make sure she understands that you’re doing this for your own health and that it isn’t comparable to what’s best for her. Also letting her know that you love her the way she is now does help. Other than that I agree with all the other conments.",
      "created_utc": 1612482096.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gly8kd1",
      "author": "pinkblot7",
      "body": "totally agree with needing to be be more cautious about what you say around meals or work out times! both can be very triggering",
      "created_utc": 1612412161.0,
      "score": 8,
      "context": [
        {
          "id": "gly7twp",
          "author": "tymopa",
          "body": "One thing people haven't mentioned (and I agree with nearly everything they have said) is that you need to be careful with talking about what and when you are eating and when you are exercising. Also, pointing out what someone else (stranger or otherwise) is or is not eating or doing is equally troublesome. Even the slightest comments are burdensome to someone with an ED because society constantly obsesses over it. My husband is an avid exerciser and he will often come home and tell me how exhausted he is because he worked out so hard. In general, just don't.\n\nI would also refer you to NEDA and read up and possibly ask them some questions. Your partner needs to know that the path she is taking is honored and that all you care about is that she feels mentally and physically strong. Tough stuff but good on you for asking.",
          "created_utc": 1612411755.0
        }
      ]
    },
    {
      "id": "gm1w0nf",
      "author": "edie43",
      "body": "Yes!! Thank you! All of this!",
      "created_utc": 1612481790.0,
      "score": 2,
      "context": [
        {
          "id": "gly7twp",
          "author": "tymopa",
          "body": "One thing people haven't mentioned (and I agree with nearly everything they have said) is that you need to be careful with talking about what and when you are eating and when you are exercising. Also, pointing out what someone else (stranger or otherwise) is or is not eating or doing is equally troublesome. Even the slightest comments are burdensome to someone with an ED because society constantly obsesses over it. My husband is an avid exerciser and he will often come home and tell me how exhausted he is because he worked out so hard. In general, just don't.\n\nI would also refer you to NEDA and read up and possibly ask them some questions. Your partner needs to know that the path she is taking is honored and that all you care about is that she feels mentally and physically strong. Tough stuff but good on you for asking.",
          "created_utc": 1612411755.0
        }
      ]
    }
  ]
}