{
  "id": "ld8uza",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1612537129.0,
  "title": "Request: I feel like i'm developing an eating disorder",
  "selftext": "Hello! I'm 19(F) and have always been tall and underweight, as a kid I used to get force fed by my parents and I even got beaten if I don't eat (Which severely traumatised me) the doctors never figured out why I didn't want to eat, I just didn't feel hungry. I got over that in my teen years but lately (For almost a year now), I've been avoiding eating or just breadcrumbing myself (letting myself eat a piece of chocolate or something sweet), sometimes it's because I don't feel hunger and sometimes because I just don't want to eat and I don't know why. After I eat I usually feel sick to my stomach and the amount of food i've been eating has reduced severely. Eating makes me anxious and even depressed (but i usually struggle with depression and anxiety too) and sometimes I feel like i'm restricting myself with thoughts like \"You can eat if you finish this school work, but not before that\". I don't know what's wrong with me.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ld8uza/request_i_feel_like_im_developing_an_eating/",
  "score": 47,
  "num_comments": 8,
  "comments": [
    {
      "id": "gm4fc7a",
      "author": "Avalon_Anime",
      "body": "Yeah that kind of sounds like disordered eating. Have you thought about maybe going to a therapist about this?",
      "created_utc": 1612538021.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gm4hhfq",
      "author": "None",
      "body": "Sounds like you went through a lot of trauma related to food. I would say that your eating habits are disordered, which is understandable considering what you've been through. I would definitely seek out the help of an eating disorder trained therapist who will be able to properly diagnose you and recommend a course of treatment.",
      "created_utc": 1612538901.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gm54x2n",
      "author": "freedomofit",
      "body": "Its hard for me to understand the reason for the sickness after eating? Is it guilt - mentally? or physical sickness of the stomach? \n\nWhat ever it is - I feel like the fact that you acknowledge that something is off, gives you much strength to face this.",
      "created_utc": 1612548739.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gm593f8",
      "author": "LucyBlue16",
      "body": "It seems to me you’ve experienced so much trauma around eating and it’s negatively impacted your relationship with food. Completely understandable! But it may be worth seeking out a professional therapist or dietitian who can help you process all you’ve been through and start to change your thoughts and behaviors around eating. I’m so sorry this happened to you :(",
      "created_utc": 1612550509.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gm4d2kp",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1612537129.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gm5swy6",
      "author": "hannahmjarmbruster",
      "body": "As a therapist and someone who has an eating disorder, I definitely think this is disordered eating. Most likely stems from your childhood trauma. I’m extremely sorry your parents did that to you. That’s horrible. I recommend seeking therapy for this to determine what the root cause of this is. Best of luck 💜",
      "created_utc": 1612559217.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gm69jpz",
      "author": "Past_Discipline569",
      "body": "Im assuming the physical/emotional abuse was not limited to your eating habits?\n\nIt is incredibly difficult to get an eating disorder under control, without addressing the trauma that has led to you feeling like your life is so out of control, that you NEEDED this in order to have SOMETHING to control, that you actually could control. Especially now that your parents aren’t there to force you. That’s hard to untangle from when, in a way, it gives you a sense of security to know that you can actually choose to minimally eat (comparatively).",
      "created_utc": 1612567139.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmjny57",
      "author": "ZLCer",
      "body": "It hurts my heart that your parents forced treated you so horribly. It's never okay when their issues are forced on you, and I'm so proud of you for speaking up.\n\nI was anorexic and bulimic, suicidal, and depressed because I was taught my best would never be good enough, and the only thing that couldn't be taken away and from me and gave me an identity was bulimia.\n\nPlease, please, please talk to someone. You're not meant to go through this alone, and it's nearly impossible to unlearn what you've so wrongly been taught if you don't have someone to show you a healthier way. If you don't know of anyone safe to talk to, let me recommend calling the loving, non-judgmental people at 855-382-5433 who have helped me when I didn't know where to turn.\n\nIn the meantime, here's something I'd like to share with you that helped me get started healing. I wrote it from the other side of the EDs. I share it often on this platform because it's what I know like I know like I know is the start to healing.\n\n\"You. Reading this right now.\n\nYes...YOU!\n\nI’m going to tell you something, and I need you to pay close attention.\n\nI need you to tune out every distraction, and I need you to be here with me right now.\n\nAre you ready?\n\nThis is huge.\n\nThis is life-changing.\n\nThis might also be terrifying for you, but you need to hear it.\n\nIT’S NOT YOUR FAULT.\n\nI don’t care what it is you’re blaming yourself for. Whether it’s for your best never being good enough or your life not turning out the way you wanted it to, it doesn’t matter.\n\nIT’S NOT YOUR FAULT.\n\nYou’ve made mistakes you based solely on the information you had to go on at the time,\n\nIT’S NOT YOUR FAULT.\n\nIf you’ve never been taught the truth of who you are or how to unapologetically show up in life, how can you blame yourself for not knowing?\n\nOr maybe you’re blaming yourself for knowing better, but you’ve never been taught the skills to actually do better.\n\nMaybe you’ve tried a few (hundred) self-help books, courses, seminars, but nothing ever sticks.\n\nIT’S NOT YOUR FAULT.\n\nWe live in a very selfish, hurried, distracted, society that’s set up for surviving rather than thriving. Segregation over community. Judgment instead of understanding. Conclusions without conversations.\n\nIf you’ve never had anyone speak life into you, to pay attention to you and acknowledge you for just you being you, it’s really hard to believe you’re worthy of anything good happening to you. It becomes a struggle to want to try.\n\nI’ll say it again...\n\nIT’S NOT YOUR FAULT.\n\nThere are no longer boundaries, and morals are faded shades of grey. We’ve all become masterful dancers as we try to avoid stepping on anyone’s feeling all in the name of “love.”\n\nSo IT’S NOT YOUR FAULT you don’t know how to use your own voice, to confidently offer your wisdom, or to just get through a day without hearing the voices of your past reminding you of all your flaws and shortcomings.\n\nIT’S NOT YOUR FAULT you didn’t even know you HAVE a voice. And IT’S NOT YOUR FAULT you didn’t know you have a CHOICE.\n\nSo the first thing I want you to do for me right now is say something out loud. I don’t care where you are, who you’re with, or how stupid you might feel.\n\nI’ll give you another three seconds to quit fighting with me and yourself about doing it. Ready?\n\nOne.\n\nTwo...\n\nThree!\n\n“IT’S NOT MY FAULT, AND I FORGIVE MYSELF FOR NOT KNOWING WHAT I DIDN’T KNOW!”\n\nOkay, now I want you to actually say it out loud.\n\nDO IT.\n\nGO!\n\n“IT’S NOT MY FAULT, AND I FORGIVE MYSELF FOR NOT KNOWING WHAT I DIDN’T KNOW!”\n\nAnd then I’d start journaling. I’d get all the lies, blame, hurt, and gunk out of my head and onto paper…and I’d burn it! Then I’d “lather, rinse, repeat.” I’d do this as many times as I needed to in order to get all the emotions and anger out so I could make space for truth and my real self to show up, unpack, and take up residence. I’d stick with it until I started to believe, then almost believed, then believed a little more, then believed enough to try it out, then believed enough to trust that I have a purpose and I was created for such a time as this.\n\nYou know how why I’d give my younger self this advice? Because it’s what I did to now be free from depression, bulimia, and the \"lie-dentity.\"\n\nRabbi Daniel Lapin says, “The opposite of depression is not happiness. The opposite of depression is purpose.”\n\nFind your voice. Speak your truth with love and respect. Renew your mind. Refresh your perspective. Restore your true identity. Walk in your purpose (which will become more and more clear the more you embrace your true self.\"\n\nI'm so proud of you, and I know your heart is so amazingly beautiful and loving or you wouldn't be in so much pain.\n\nYou're not meant to fit into this crazy world.\n\nYou're meant to BLEND OUT!",
      "created_utc": 1612756076.0,
      "score": 1,
      "context": []
    }
  ]
}