{
  "id": "lel566",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1612698980.0,
  "title": "Request: Finally been diagnosed!",
  "selftext": "After 17 years of not knowing I have now finally been diagnosed with ARFID. Does this change anything in my life? No. It is just nice to be finally able to give this issue of mine a name.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lel566/request_finally_been_diagnosed/",
  "score": 68,
  "num_comments": 5,
  "comments": [
    {
      "id": "gmf4smv",
      "author": "LucyBlue16",
      "body": "I felt the same way when I was finally diagnosed. It was validating and and suddenly I didn’t feel so alone.",
      "created_utc": 1612701462.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gmfxsw1",
      "author": "None",
      "body": "I have ARFID too! I was just living my life struggling to eat and had absolutely no inclination that it might be an eating disorder because no one ever tells you ED’s take on more forms than a person who is obsessed with weight and looking skinny.",
      "created_utc": 1612709152.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gmgbk0q",
      "author": "flowersaregrowin",
      "body": "Well being diagnosed is actually really helpful cause you can receive more specific and effective help! Good luck",
      "created_utc": 1612712033.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmhc05j",
      "author": "pura-cera",
      "body": "I have ARFID too. Took me forever to figure it out and get help but now it's so much easier to approach knowing I'm not just \"weird\" or \"crazy\" and that there are things out there designed to help people like me.",
      "created_utc": 1612720422.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmeug7c",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1612698980.0,
      "score": 1,
      "context": []
    }
  ]
}