{
  "id": "lg0ji1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1612868653.0,
  "title": "Request: Not hungry enough ti eat after cooking",
  "selftext": "Does anyone else have this problem where you start cooking with an empty stomach, really excited for the meal, and when it is finally done, you are suddenly so tired and not hungry anymore?\n\n&#x200B;\n\nFirst time here...(lil extra weight thanks to home office. I am happy that i get to try out more cooking/baking, but i am also a bit stressed about how it affects my eating habits) I enjoy cooking, moreso when i get to cook for more than just myself. I like trying out new things, i like cutting all the veggies, marinade the meat/fish if i have some, season while everything is boiling etc...... But when i finally stand in front of the finished meal on my plate, i am suddenly not hungry anymore? I am just suddenly soo tired, and i dont know why. It smells delicious, and i know it will taste good, but i am just not up to eating anymore. \n\nIs there a trick/should i force myself to eat?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lg0ji1/request_not_hungry_enough_ti_eat_after_cooking/",
  "score": 56,
  "num_comments": 8,
  "comments": [
    {
      "id": "gmopyxy",
      "author": "crystaldmb41",
      "body": "This happens to everyone, ED or not. You smell the food intensely as you cook, and you kind of get sick of it when it is time to eat. (There are articles online about it.) My suggestion would be to take breaks away for just a few short moments when cooking to clear the senses with different air. Also put something on the plate that you didn’t cook that time and maybe you’ll eat it since it smells differently.",
      "created_utc": 1612868991.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gmovr3z",
      "author": "Hanhohanho",
      "body": "This happens to me all the time, thought i was the only one..Haven't got any tips sadly but as already mentioned you are definitely not alone with this Problem!",
      "created_utc": 1612873828.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gmoy8h8",
      "author": "randomdolphinishappy",
      "body": "Never usually reply.\nI've been in recovery for around 5/6 months now.\nAt first, couldn't eat more than 2 to 3 bites - and that too with the will to recover. I wanted to live my life.\nJust slowly, eat a small thing extra at each meal time and snack time. Add something small. Keep adding till it becomes better, and you start feeling hungry around the same time everyday.\nSlowly, but surely you will realise that you want to eat, and that's about when I hit extreme hunger.\nI still eat a lot, and remember to eat in regular intervals (something that helped me was to make it a rule to eat atleast every 2-2.5hrs). This will regulate your hunger signals mentally, and help digestion physically. Recovery is a mixed process, trust yourself and choose to live your life.\nAll the best!",
      "created_utc": 1612875593.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmpbl2o",
      "author": "xxCh3ck3r3d-R4txx",
      "body": "i usually just put it in the fridge afterwards. then come back when i'm hungry again and heat it up :P",
      "created_utc": 1612882994.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmopluy",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1612868653.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmqqt0g",
      "author": "goldonfire",
      "body": "me! i find if i start cooking when im not hungry/could eat but dont need to, by thr time im done cooking im hungry enough to eat",
      "created_utc": 1612905016.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmrl5wf",
      "author": "ahchava",
      "body": "The only solution I have had to this is to get delivery or have someone else cook.",
      "created_utc": 1612919728.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmro7sg",
      "author": "None",
      "body": "Have you tried eating a snack while you cook so you don’t go to the hunger that is past hunger?",
      "created_utc": 1612921328.0,
      "score": 1,
      "context": []
    }
  ]
}