{
  "id": "lgqugl",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1612952608.0,
  "title": "Request: I don’t know how to be active or eat healthy without taking it too far.",
  "selftext": "I’m an all or nothing type of person. Any advice on moderation?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lgqugl/request_i_dont_know_how_to_be_active_or_eat/",
  "score": 94,
  "num_comments": 8,
  "comments": [
    {
      "id": "gmto5ev",
      "author": "Maggiemaccy",
      "body": "I’d say it’s a pretty common trait amongst ED sufferers. I have an all or nothing personality. I’ve been in recovery for going on 10 years now and I’m only just starting to restore balance in my life after many years of nothing. Not just in terms of diet and exercise, I’ve been pretty much just existing for all this time because I taken literally everything too far.\n\nI work with a timetable and I set timers while I complete my tasks. I allow 30 mins each morning for exercise, 1 hour of reading, 1 hour personal care etc. It works for me because it limits my time at each but when I ‘complete’ my timetable I still get than sense of accomplishment",
      "created_utc": 1612970334.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gmudy51",
      "author": "dunzle",
      "body": "I am also an all or nothing person. I eat everything, no exercise, or nothing and tons of exercise. I’m still trying to figure out the whole moderation thing because whenever I go from nothing to all I just end up ruining all my progress",
      "created_utc": 1612981296.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmswt41",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1612952609.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmubt0a",
      "author": "hercoconutmilk",
      "body": "The only way I know how to be active is by having fun with it. If it starts to feel like a chore, I take a step back and either take a day off to reevaluate my goals or try another activity.\nAs for eating healthy, I go through phases of overeating a restriction — right now I’m in a restriction phase, but I’m trying to focus less on the whole eating part of it and just how I’m feeling physically (training myself to acknowledge hunger cues). I suppose just making sure you actively check in with yourself, preventing the whole “taking it too far” is possible and easier to accomplish.",
      "created_utc": 1612980402.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmv3jq0",
      "author": "mosephis13",
      "body": "This. I would love to lose 10-15 lbs, but it’s a challenge. “Just eat better” or “count calories” turns into an obsession.",
      "created_utc": 1612992084.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmv5yqc",
      "author": "momunist",
      "body": "I can’t recommend intuitive eating enough. If you’re interested, some books to look into are Intuitive Eating, Body Respect, and The F*ck It Diet. It will really help to address that all-or-nothing mindset that usually plagues people with eating disorders. If you want to stay in recovery, you’ll probably have to give up dieting while you work on this. Best of luck!!",
      "created_utc": 1612993121.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gmw6rqy",
      "author": "Ammaranthh",
      "body": "Same. I struggle very hard NOT to go overboard. For me, I have to absolutely 100% FORBID myself from counting calories. As soon as I start doing that it's game over.",
      "created_utc": 1613010864.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gmur7e6",
      "author": "ZorBa812",
      "body": "Yes same!!",
      "created_utc": 1612986828.0,
      "score": 3,
      "context": [
        {
          "id": "gmudy51",
          "author": "dunzle",
          "body": "I am also an all or nothing person. I eat everything, no exercise, or nothing and tons of exercise. I’m still trying to figure out the whole moderation thing because whenever I go from nothing to all I just end up ruining all my progress",
          "created_utc": 1612981296.0
        }
      ]
    }
  ]
}