{
  "id": "lh9cg8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1613006373.0,
  "title": "Request: husband and brother are eating all my safe food (community post)",
  "selftext": "I'm not entirely sure what to do and I know a lot of people with ED have experienced this before. I have a weird mix of ARFID and anorexia that makes eating food a living hell. But slowly over time with the help of my therapist I gathered a list of safe food. Every week I choose a new food to try and add that to my list. \n\nI don't have a very big list right now. And I feel really bad for being upset but I went grocery shopping two days ago and I opened the fridge, finally ready to eat and my safe food was gone. \n\nI don't know how to keep the food safe or whatever. I grew up in extreme poverty so having food go missing is sort of a trigger for me. Spending money on food is a trigger for me. It's all very overwhelming. \n\nI don't want to sound insane but... should I start hiding food? I feel like that's a slippery slope. Or should I just buy more food? I don't want to restrict anyone.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lh9cg8/request_husband_and_brother_are_eating_all_my/",
  "score": 66,
  "num_comments": 8,
  "comments": [
    {
      "id": "gmw0yfj",
      "author": "Fickle_Orchid",
      "body": "If you ask them to leave specific food alone, will they listen?  If you ask and they do it anyway, then I wouldn't \"hide\" the food but I would definitely put it in a place that's off limits to them. Either that or putting reminder sticky notes on it so there's a visual deterrent/ reminder for them",
      "created_utc": 1613007943.0,
      "score": 40,
      "context": []
    },
    {
      "id": "gmwiiqp",
      "author": "chillychinchillada",
      "body": "If you didn’t specifically tell them that it’s your safe food then how would they know? If they tend to forget, I would create a fridge shelf that is only for you and write your name in a sticky note there or something. But still definitely explain it to your husband and brother. Don’t have to go into too many details, just explain to them that the food was for you and if they want the same food you are happy to buy it for them but they have to request it ahead of time.",
      "created_utc": 1613017076.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gmwtnsl",
      "author": "CNicoleee",
      "body": "I think that it starts with a conversation and i know it’s a bit intimidating but I do hope you can just tell them how you’re feeling. Now if you can’t, or if they brush you off and don’t take you seriously I would suggest hiding the food. It isn’t about doing it because you’re greedy or anything, you’re looking out for yourself. You gotta keep that mindset that you’re doing it for you because it’s what’s good for you. This is something I struggle with daily because I put myself last believing everyone else deserves to be put first. You have to literally tell yourself you’re worth taking care of and by whatever means it takes, you gotta do it. For you.",
      "created_utc": 1613024365.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gmx8r9g",
      "author": "None",
      "body": "My fam has a system. If you don’t tell the family “Yo, this shit mine, back off” or write your name on it, or put it in your own drawer (My sister’s the only one who has that tho so that only applies to her) it’s on you if it gets eaten. That’s the rule at our house. Nobody eats anyone else’s stuff. If you try that at your house maybe it could help? And if it doesn’t, if you’d be comfortable with it, explain why it’s so important.",
      "created_utc": 1613037729.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gmxlwla",
      "author": "Boosey0910",
      "body": "Perhaps getting a small \"dorm sized\" fridge for your safe foods could be an option?",
      "created_utc": 1613048567.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gmwroww",
      "author": "notbingeworthy",
      "body": "Hide the food well and far from the kitchen.",
      "created_utc": 1613022897.0,
      "score": -1,
      "context": []
    },
    {
      "id": "gmvxrle",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1613006373.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gmyc8a7",
      "author": "None",
      "body": "I get where you are coming from, some big triggers for me are spending money on food and running out of running low on food, I grew up hiding food too. I wouldn't recommend hiding it from them, you don't really want to jeopardize your recovery with a different unhealthy food habit. I do think it is a good idea to let them know you really need those foods avaliable to eat and label them in the fridge, my husband has recently been asking me permission to eat any leftovers I cook and I find that really reassuring. I have 1 \"emergency food\" that I do keep out of the kitchen and away from my husband so he doesn't eat it accidentally, but I am working on food trust and not hiding things anymore. I don't think that is the same as hiding all of your food, so if it would reassure you to have some emergency crackers (my safe snack) in a different place so you always know you have 1 safe option to eat go for it, but recognize that it's maybe a safety net you will have to get rid of in the future. \nOverall setting boundaries is the way to go here, teamwork for easier recovery!",
      "created_utc": 1613061133.0,
      "score": 1,
      "context": []
    }
  ]
}