{
  "id": "li1wlb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1613098297.0,
  "title": "Request: stop counting calories (relatively long post thank you for reading)",
  "selftext": "At the beginning of my diet journey I downloaded myfitnesspal, and like all others I spiralled down into a routine of tracking my calories nonstop into the app to meet the daily requirements. After noticing I was beginning to develop the symptoms of ED, I deleted most diet apps off my phone. But the habit has already been ingrained in me. I can stop looking at nutrition labels wherever I go now. I need my food to have exact measurements (so I constantly use measuring spoons in all my cooking) less or exact is fine but I never go over the serving size stated. I’ve looked up my TDEE and I’ve been trying to eat at my maintenance calories. Even without the app my brain automatically begins to mentally calculate how much I’ve eaten and totalling it up and I stop once I hit the limit for the day. When I eat out and I don’t have the exact calorie count for the food I’m eating I find myself googling the calorie counts of similar dishes on the internet, assuming the worst and taking the highest number and just running with it. At the same time, I’ve been trying to eat back my fear foods (like sugar and fast food) in an attempt to recover but it has ended up backfiring because whenever I’ve a craving for maybe a sweet (like cakes or tarts) I end up skipping a whole meal just to have enough calorie space for that one dessert. I think because of this I end up eating less than I should and I’m losing instead of gaining weight. This mental block and my fear of gaining combined has completely halted my recovery and I don’t know how to get over it because I can’t find the willpower in myself to correct this even though I know they are bad habits\nIs there a way to stop this mental caloric calculator in my head that has become instinctual and second nature. Are there resources and self help for fear of gaining weight (my bmi, body fat percentage and weight is completely normal and at the higher end) even when you’re not underweight.  Any advice on how I can eat my fear foods and foods I like again without intentionally skipping meals just to make space for it?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/li1wlb/request_stop_counting_calories_relatively_long/",
  "score": 58,
  "num_comments": 7,
  "comments": [
    {
      "id": "gn1klwg",
      "author": "highacidcontent",
      "body": "I've been battling AN on and off for years. The way I deal with it is that I talk to myself while eating because usually, I'll do the \"I'm so fat, I'm so stupid\" etc. So I changed that to \"this is okay, this tastes good\" (I know it might sound strange, but it works for me at least). It kind of keeps the thoughts out of my head because I have to think about something else. Then after a meal, I watch some TV or play videogames to distract myself from the worst thoughts.\n\nI hope this helps a little. Feel free to message me :)",
      "created_utc": 1613123122.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gn2jthq",
      "author": "SorchaNB",
      "body": "\"I end up skipping a whole meal just to have enough calorie space for that one dessert. \\[...\\] Is there a way to stop this mental caloric calculator in my head that has become instinctual and second nature?\"\n\nSigh. Sigh. Sigh. Introducing a numeral element - be it calorie counting, weighing scales, what-have-you - is the single most disastrous thing you can do for someone with a propensity for disordered eating, especially if it's OCD-based/overlapping. \n\nPart of the instinctual habit you're describing is the learnt association between \"keep my calories low ---> lose/maintain weight\". In order to break this, you must recognise that this not a perfect association. \"It's all well and good \\*telling\\* myself that\", you'll say, and I get it. You need to make it experiential in order for it to factor into your habit-making. What would be ideal is if you could force yourself to have a few days \"off\" where you eat whatever you want within reason and see for yourself that you wont gain weight. However, THAT'S EASIER SAID THAN DONE FOR SOMEONE WITH AN ED. \n\nPeople who struggle with problems like yours often employ Cognitive Behavioural Therapy. Is this an option for you?",
      "created_utc": 1613146047.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gn2bf5w",
      "author": "MissPamplemousse",
      "body": "I’ve been there- I went from basically starving myself, to becoming paleo to allow myself to eat, to adding in fear foods (rice, sugar) while calorie counting. It’s a prison. \nYou’re not going to forget your calorie counting overnight. I frequently redownloaded and deleted myfitnesspal for months after saying I wanted to stop counting calories. This isn’t a matter of willpower— that’s part of what makes eating disorders so horrible— they’re MEAN. They tell you something’s wrong with you and make you feel bad about yourself. \nYour BMI, fat percentage, etc, don’t matter. Your fear of gaining weight and the coping mechanisms you use to deal with that fear are what matter. The eating disorder is mental. It’s hard to navigate all this without a therapist. Before I sought help, I would try to recover, but my thoughts were so disordered that I constantly relapsed. So number one- get professional help from someone who specializes in this; you don’t have to recover alone. Your therapist will be able to help you break down your fears and learn techniques that will help you cope.\nWhen you start spiraling and thinking negative thoughts, it helps me to think of them as something a bully is saying to someone else. Like, it’s so easy to tell yourself, “you’re disgusting,” and think it’s just a truth. But what if you heard someone say that to your friend?",
      "created_utc": 1613142138.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gn3tbz0",
      "author": "RoutineRabbit500",
      "body": "Hi! I just wanted to say that I also struggled for years with the fact that I knew how many calories were in everything, and felt like I couldn’t stop counting (even during recovery). It felt like a curse, like once I had the knowledge it would never go away and never stop haunting every meal I ate.\n\nI’m a few years into recovery, and I can now get a plate of food without automatically counting, and its so freeing. It‘ll probably take a while and a lot of practice, but it’s possible. Something that helped me was a gradual transition away from counting calories - I couldn’t go completely cold turkey, but baby steps seemed more feasible. A nutritionist was a lifesaver for me, and we went from a super structured meal plan to a “portion size” meal plan to intuitive eating, and that slow path to a less structured meal time helped me immensely. \n\nA last note: no calculator can really tell you for sure how much is healthy for you to eat. I found out the hard way that I needed to eat way more than the amount I thought I needed to in order to maintain a healthy weight, function, and have energy. My weight fluctuated up and down a bit as my body figured this out, but it eventually settled and my appetite adjusted accordingly. Each body has a different set point, metabolism, and needs, so I would encourage you by saying that if you still feel hungry after eating the amount a calculator tells you to eat, then that’s probably your body trying to keep you healthy and get you the energy and fuel you need.\n\nTake care of yourself and good luck!",
      "created_utc": 1613166381.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gn24yov",
      "author": "FoxiiFighter",
      "body": "I don't think its a matter of willpower - at this point its compulsory, almost like an addiction. If you aren't in therapy yet, you definitely should look into it. Cognitive Behavioral Therapy might be a good thing to try.",
      "created_utc": 1613138880.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gn0lopx",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1613098297.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gn3oaay",
      "author": "deeforsaken1",
      "body": "I do this religiously, i account for everything I consume, and only eat 1,200 calories a day, I had no idea it was an ED",
      "created_utc": 1613164016.0,
      "score": 1,
      "context": []
    }
  ]
}