{
  "id": "liqpnb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1613181845.0,
  "title": "Request: Chew/Spit",
  "selftext": "Hi --\n\nI've never been diagnosed with an eating disorder, but I've always used food and exercise as a means for control in my life.\n\nTwo years ago, I started chewing and spitting on occasion. This past year, full of stresses, I now chew and spit everyday. I keep saying I'll stop and I specifically avoid buying indulgent foods, but I end up just chewing and spitting the foods I have. I'm 34 and it's difficult to believe that I may have developed an eating disorder, well into adulthood. I also feel tremendous guilt about the wasting food and the long-term health effects this may have on my body.\n\nThere's not a lot of information on the internet about this as an eating disorder, although I strongly believe it is. \n\nDoes anyone else have experience with this? I know stress and the felt need for indulgence while being restrictive is at play, but are there other motives that you've experienced? Have you been able to successfully quit? And if so, how?\n\nThank you for being here!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/liqpnb/request_chewspit/",
  "score": 37,
  "num_comments": 13,
  "comments": [
    {
      "id": "gn53jgb",
      "author": "microscopicwheaties",
      "body": "you're definitely not alone in this <3 what made me quit is the fact that you still ingest some of the calories and what's more terrifying than that is you don't know exactly how much. not sure if calories are an issue for you but it is for me. also it can affect your teeth a lot, pretty sure it messes with your salivary stuff too, and digestion, your brain thinks you're eating so it'll be in that state it should be in when actually eating, don't take everything as fact though. but ik it can cause stomach ulcers and it's not worth it. emotionally and mentally you feel good, but it'll hit you big time on the physical side of things.",
      "created_utc": 1613191595.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gn4qwh4",
      "author": "Wooliesworld73",
      "body": "Of course this is an eating disorder, it is a form of bulimia but you're just not swallowing. Honestly there's not a lot of info online about it bc it gives people who suffer from \"typical e.d\" new ideas. Anyone qualified in the ed field will be familiar with this and help you with diagnosis and treatment. Also please delete this post once you've gotten the answers you need so someone doesn't take on this as a new restrictive habit",
      "created_utc": 1613184100.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gn51zxk",
      "author": "Queenofwands1212",
      "body": "Yes, you’re not alone, chewing and spitting is very common especially in anorexia because it provides some sort of eating sensation without the feeling of fullness. It’s stressful, and comforting at the same time. I go through phases... l occasionally find myself chewing and spitting very randomly too even when I’m cooking . It’s something to be mindful of and don’t beat yourself up for it. Just gradually try to decrease how much you do it each day and week",
      "created_utc": 1613190628.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gn6dlj0",
      "author": "freedomofit",
      "body": "Youre not alone. Ed has lots of faces. It can be restricting, chewing spitting, binging and pruging and so on and on. Basically it is the fear of consumimg lots of calories without any expenditure. It can be physical activity, vomiting and so on. Though this may sound horrible, in the mind of a disordered person, it is just lifestyle. This is the way to be. But, that doesnt mean you cant fight it. I think it all can come from you. And the first thing that could help is realizing the consequences. For example, osteoporosis. Pls do yourself a favor, dont drag yourself there. This is a nightmare. Believe me. Any other support and motivation, feel free to contact me any time. ❤",
      "created_utc": 1613210247.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gn82opy",
      "author": "akacarou",
      "body": "You are definitely not alone. My mom actually had the same issue. It often seemed to me like she used this behavior to help soothe herself during times of stress. If that's the case for you, maybe there are other ways you can soothe yourself. I would also encourage you to find a professional who specializes in eating disorders who can help you with this issue, which is something my mom never did.",
      "created_utc": 1613228716.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gn8af6g",
      "author": "None",
      "body": "I went from very typical bulimia to doing c/s binges instead and I 1,000% know how you feel as far as the guilt. After all, you're buying all this delicious food and not even swallowing it! For me, if I really feel the need to \"binge\" I'll force myself to wait 30min and if I still want to, I will. But usually, the urges come and go. It is a type of eating disorder (I would normally class it under EDNOS) but there's so little information online about it. Good luck, and I hope your relationship with food gets better.",
      "created_utc": 1613230683.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gn5jddz",
      "author": "Abstractbarbie",
      "body": "Chewing and spitting is valid type of eating disorder. \n\nIt was very difficult to break because like you, I hate wasting food, and of course, restrictive EDs ads very controlling. \n\nI have finally broke free from chewing and spitting through residential treatment and forcing myself to swallow. Learning “mindful eating” tips are very helpful such as, acknowledging the taste, the benefits of the particular food, the memories you have with this food before your ED, etc. \n\nNot taking as long to chew and swallow quickens the process, and eventually becomes second nature after enough practice. Before, I hated getting caught chewing and spitting, so I hope you can feel the relief soon as well.\n\nI am lapsing a bit, but I very rarely engage in this behavior and always correct myself. I wish you so much luck!",
      "created_utc": 1613201083.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gn7lxgc",
      "author": "None",
      "body": ">I'm 34 and it's difficult to believe that I may have developed an eating disorder, well into adulthood.\n\nI think you'll find r/EDAnonymousADULTS particularly helpful. There are many adults with eating disorders so you're definitely not alone.\n\nIt sounds very likely that you have a form of bulimia nervosa, the only way to know for sure is to get diagnosed by a psychiatrist specializing in eating disorders. They'll also referr you to the appropriate treatment. I wish you the best of luck in your new journey :)",
      "created_utc": 1613223456.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gn4mu72",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1613181846.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hqfo18k",
      "author": "No_Dragonfly8440",
      "body": "Ive too have had an obsessive relationship w food. With everything. \nIm a 25 yr bodybuilder. I’ve been struggling w body dysmorphia and ED for what seems like forever. My younger sister actually was diagnosed w anorexia nervosa a few yrs back in which she got treatment for. She now luckily has an amazing relationship w food. Seeing her struggle made me stop but now that we’re very independent i kinda slowly spiraled down. \n\nI too would do this occasionally. But recently it’s been an every day thing. I’d do this thing where I’d ensure i had calories left to compensate for any of the calories that weren’t spitted out. I’ll stop some days other days i find my self doing boxes of poptarts (which in my case is my drug of choice). \n\nI was in denial for quite some time. Some say that lifting and having a gym routine saved their lives, helped their self esteem, made them healthier etc. However ppl don’t really talk about the negative aspects of bodybuilding. Sure it’s a source of therapy however it has made me so much more critical of my body. Constantly chasing for something unobtainable w out the use of enhancing drugs. This constant comparison. The not enough. Yup definitely hasn’t helped. \n\nIt’s nice to know that I’m not alone. Although that it’s also at the expensive of your mental health :/ \nIm sorry and i hope we find recovery soon",
      "created_utc": 1640800028.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gn6t14k",
      "author": "None",
      "body": "THIS ^",
      "created_utc": 1613214873.0,
      "score": 4,
      "context": [
        {
          "id": "gn53jgb",
          "author": "microscopicwheaties",
          "body": "you're definitely not alone in this <3 what made me quit is the fact that you still ingest some of the calories and what's more terrifying than that is you don't know exactly how much. not sure if calories are an issue for you but it is for me. also it can affect your teeth a lot, pretty sure it messes with your salivary stuff too, and digestion, your brain thinks you're eating so it'll be in that state it should be in when actually eating, don't take everything as fact though. but ik it can cause stomach ulcers and it's not worth it. emotionally and mentally you feel good, but it'll hit you big time on the physical side of things.",
          "created_utc": 1613191595.0
        }
      ]
    },
    {
      "id": "gn4r0bt",
      "author": "Wooliesworld73",
      "body": "There can also be other sensory disorders at work here. Find a specialist! Good luck dear <3",
      "created_utc": 1613184162.0,
      "score": 4,
      "context": [
        {
          "id": "gn4qwh4",
          "author": "Wooliesworld73",
          "body": "Of course this is an eating disorder, it is a form of bulimia but you're just not swallowing. Honestly there's not a lot of info online about it bc it gives people who suffer from \"typical e.d\" new ideas. Anyone qualified in the ed field will be familiar with this and help you with diagnosis and treatment. Also please delete this post once you've gotten the answers you need so someone doesn't take on this as a new restrictive habit",
          "created_utc": 1613184100.0
        }
      ]
    },
    {
      "id": "gnbhd9w",
      "author": "annaschmitz95",
      "body": "Yes I used to do this often with things like sweets.",
      "created_utc": 1613259766.0,
      "score": 2,
      "context": [
        {
          "id": "gn51zxk",
          "author": "Queenofwands1212",
          "body": "Yes, you’re not alone, chewing and spitting is very common especially in anorexia because it provides some sort of eating sensation without the feeling of fullness. It’s stressful, and comforting at the same time. I go through phases... l occasionally find myself chewing and spitting very randomly too even when I’m cooking . It’s something to be mindful of and don’t beat yourself up for it. Just gradually try to decrease how much you do it each day and week",
          "created_utc": 1613190628.0
        }
      ]
    }
  ]
}