{
  "id": "lj2mus",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1613230413.0,
  "title": "Request: My partner asked me to lose weight and then left me for my friend who is much smaller.",
  "selftext": "I am having a huge ED flare up and constant panic attacks over food. Constant intrusive thoughts and feeling I want to disappear. Either advice or support would be helpful.\n\nI have struggled with mostly restricting and binging cycles since I was 9. I was in recovery for the last few years. I have always been either a “healthy” weight or slightly overweight but I guess because of the shape of my body I don’t really look overweight but I am clearly on the curvy/chubby side (am I allowed to say that here? Remove if not!). I say this because basically it’s not easy for people around me to notice when I’m restricting because they see both weight loss and weight gain as socially acceptable for my weight and body type, if that makes sense. I also have body dysmorphia. I’m a woman btw.\n\nLast summer my wife of 7 years who knows about my history basically got into a bit of an argument with me where she asked me to lose weight. I had gained a bit over the years and the pandemic but when I was thinking healthily I didn’t think it was noticeable to anyone except me. I was really shocked that she said that as she’s always been extremely complimentary about my body before. She is very athletic and slightly underweight by BMI and said I could be more like her if I ate more like her and exercised more. I was really upset and went for a walk and when I came back she was crying and apologized a lot and never mentioned it again so I forgave her. However the seed was planted and I started to have more issues with food than I had in a long time and obsessing and trying to lose weight. I actually did lose some but she didn’t mention it or notice anything was up.\n\nAround this time she started hanging out with a friend of ours a lot more. Something about the friendship felt off to me but my wife said I was being jealous and imagining it. They would go out skating and come back to our house and sometimes sort of preen and compliment their own bodies, like pointing out their leg muscles etc. This friend has a very conventionally attractive slim body and I couldn’t stop comparing myself to her and feeling jealous, but I didn’t say anything out loud. The friend also made a couple of comments to me that I really think were meant to be insults about my body but subtle enough that my wife didn’t pick up on them.\n\nWell, fast forward to December. My wife left me very suddenly and then confessed she had feelings for the friend. She cut her off and said she would never see her again. She spent January making me think we were going to reconcile and then I found out she had been with the friend the entire time. Since I found out she stopped speaking to me.\n\nI am really struggling. I can’t stop thinking that I had been thinner she wouldn’t have left me. She didn’t even really seem to like this person that much and would complain about her personality often, I suspect it is largely a physical attraction. I am having literally constant intrusive thoughts about my ex-friends body and my wife admiring it so much more than mine. I keep picturing them laughing about how ugly I am together.\n\nIt’s the worst when I’m trying to eat or buy groceries. But then other times I cave and eat something really unhealthy and then have a meltdown over it. I know we’re not supposed to talk about numbers but I have lost a significant amount of weight since she left. Weight loss is all I can focus on. I know it’s not healthy but at the same time I like my body so much more the more weight I lose so it motivates me to keep going. I’m so hungry right now because I had a bad breakfast and lunch and skipped dinner and I am just so tired and I feel horrible. I miss my wife so so badly and I can’t shake off the feeling that I fucked up my whole life by being too big.\n\nI don’t have anyone I can really talk to about this except my therapist so I thought maybe if I posted in here it would help.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lj2mus/request_my_partner_asked_me_to_lose_weight_and/",
  "score": 107,
  "num_comments": 6,
  "comments": [
    {
      "id": "gn8vzr3",
      "author": "Fickle_Orchid",
      "body": "Your partner is unhappy with herself and projected that on you.  There would never have been a weight, a hair style or a fashion you could perform that would make her happy with herself.  I hope you seek a body positive therapist for support. You're a lovely person and should be with someone who recognizes and cherishes that.",
      "created_utc": 1613236518.0,
      "score": 43,
      "context": []
    },
    {
      "id": "gn9a8c1",
      "author": "None",
      "body": "god i am SO sorry you’ve dealt with this. this situation is like worst nightmare material for anyone with any type of ED and i cannot imagine the pain and rejection you’re experiencing right now. as difficult as it is not to internalize shit that “validates” your ED, please know that from an outside perspective it is clearly your wife and her friend who are fucked up and potentially disordered, especially with the preening and body comments and whatever else. the shit your wife said to you the first time the weight thing came up, fully knowing your ED history, is absolutely unconscionable and in my opinion would have been grounds for divorce by itself. you can’t come back from feeling like you’re not enough for your partner! they should be the person to lift you up and deliver tough truths when needed, not bring you down and emotionally cheat on you and flaunt someone “better” right in front of you. that is just nuts. i know you love your wife but she doesn’t respect you and strung you along. you deserve sooo much more than this. sending you love and light",
      "created_utc": 1613240154.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gn9xls1",
      "author": "yellowposy2",
      "body": "I’m so sorry that happened to you; I can’t imagine the pain you’re in. Firstly, I’d recommend therapy. You deserve to have a safe space to talk with someone you can trust, who can help you to heal. Personally I like to find therapists with eating disorder experience, but I know that’s not possible for everyone. \n\n\nLike the other commenters said, this isn’t about you, it’s about her. It can be so hard to recognize and accept that, but it’s true. When partners project, it’s so hard to not feel personal, because they make it seem like it’s your fault. In reality, she sounds deeply unhappy with herself, and she was extremely unkind and unfair to you. \n\n\nYou deserve a partner who loves you, respects you, and finds you beautiful. Sending you love and support ❤️",
      "created_utc": 1613245850.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gndtzvs",
      "author": "Emyrbl",
      "body": "Hang on in there, not sure what to say or how any words could help here.. but your post touched me and i just want to show support. You'll get through this even if \"rejection\" (especially after false reassuring words and hopes) is tough...",
      "created_utc": 1613298938.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gn89eqg",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1613230413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqqsdfw",
      "author": "MarriedMocha",
      "body": "Sending you love and light from UT! Take care of your soul by finding friends that support you. Message me if you wanna talk! 💜",
      "created_utc": 1615590439.0,
      "score": 1,
      "context": []
    }
  ]
}