{
  "id": "lolhbg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1613869660.0,
  "title": "Request: Recovered physically from anorexia and pregnant..mentally struggling",
  "selftext": "I used to be very ill for the past 10 years, recovered physically and in July of 2020 found out I was pregnant. That was a shock because I had been told I would most likely be infertile due to amenorrhea for 9 years. Anyway, I'm due in 5 weeks with a baby girl. I have had literally no physical complications with this pregnancy and baby is very healthy and growing great. Mentally I have been really struggling lately, with depression and fear. My past coping mechanism would be to just hardcore focus on weight and all that to not have to think about crappy things in my life. I'm happily married and I'm so terrified I will relapse after the baby is born. I have been in treatment with women who have relapsed and have had to be hospitalized when their babies are very young. I don't want to disappoint my husband or anything. I have a dietian but I lost my therapist a few months ago and am having a super hard time trying to find a new one. Anyone relate or have advice? It's hard to move on from being so used to being very sick and all that. It's very surreal.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lolhbg/request_recovered_physically_from_anorexia_and/",
  "score": 51,
  "num_comments": 6,
  "comments": [
    {
      "id": "go6sk1k",
      "author": "ThestralBreeder",
      "body": "I am in clinical psychology with a focus in perinatal depression, anxiety, and eating disorders. Please feel free to reach out with questions. I would also ask your OBGYN for a referral to a perinatal psychologist who can assess you for risk factors. Just remember that your body has carried your baby, it has sustained you through years of disordered eating and through into a happy marriage. You deserve compassion and grace. Talk to your husband about your worries and come up with a game plan BEFORE you have the baby. Schedule meals, make sure you are going into the fresh air, timed socialization etc. Now is the time to make the game plan. Sending warm wishes for your continued recovery and for a peaceful birthing experience.",
      "created_utc": 1613876984.0,
      "score": 11,
      "context": []
    },
    {
      "id": "go6ozgu",
      "author": "MissRiss918",
      "body": "I think it is very normal to fear relapse, especially as time lengthens between being in the disease and actively practicing recovery. But that is just it, and it took me a long time to realize it.\n\nI don’t believe I will ever be recovered. To me that is too definite. I cannot make that promise. However what I can say is that I am currently practicing recovery to the best of my ability. \n\nWe all know that eating disorders can be very sneaky. I have often feared that maybe my eating disorder would creep back into my life, which for all intents and purposes, is VERY good right now. Yeah, I have my occasional stressors.\n\nMy fiancé tells me when I am in doubt that it is a very normal feeling to have. I have to agree. \n\nI think that it is normal to fear relapse. I know that is my biggest fear about pregnancy as well. The only advice I can give is to keep being honest. Keep talking about your fears. For me, that is the biggest difference about practicing recovery. I am open and honest about all of it. I feel it all. I listen to the emotions and feelings. I talk about them.\n\nIf I were engaging with my eating disorder I would be doing the exact opposite. I think the fact that you are here, asking, and expressing your fears is a sign that you are doing what you are supposed to be doing! Keep doing it. Talk about the fears. Sit with it. Try to understand why you are feeling the way you are. Maybe your body is trying to tell you something important.\n\nI am not sure if any of this was helpful. Hopefully you were able to understand most of it. My edible is kicking in (haha). Best of luck to you! If you ever want to talk, I’d be happy to! Good luck with this next exciting step in your life, and congratulations on your healthy baby girl!",
      "created_utc": 1613874909.0,
      "score": 5,
      "context": []
    },
    {
      "id": "go6j2pb",
      "author": "g0yito",
      "body": "My wife and I are both survivors and suffered through serious bouts of bulimia and anorexia. Dark days and we know that it feels like things just enclose and everything hurts, but nothing matters. All I can say is Life is truly amazing and this can be beaten. You just have to convince yourself you are stronger. My wife did almost pass away from this, but fast forward, she is an advocate to “beat ED”. And she published this story, Motivence has the rights, and I hope it helps you. \n\nWe now have a family - something we never knew it was possible. And yeah it’s scary always, but you are stronger than this. Trust me, if we can beat it, and it had us possessed, you can go through it as well. \n \nImagine a world where everyone is the same; looks the same, speaks the same, dresses the same. You know what the name of this world is - Perfection. Perfection is a myth. It is an illogical impossibility and an ideology that lacks feasibility.   It is described by having no flaws or defects. It is supposed to describe a world where everyone is the same. However, the chase for perfection can come at a high cost, and that could be your life.\n\nWhat is currently happening with our people aiming to be perfect? In the hunt for perfection, we find an evil force; a disguised force that penetrates our mind. Evil that changes our appearances, our acts, our thoughts and dreams, and our way of living. Eating Disorders, a disease that attacks our way of thinking, is the evil which we call ED.\n\nEven though they all have different names, they could all lead to one thing: death. Currently, we are living in a world where all people put pressure on themselves to look and act a certain way. This pressure can cause for our ED to come. Women and men want to look skinny or buff at the cost of their own lives and their own health.\n\nTypes, Methods, and Effects: \n· It may come in many forms: (1) Anorexia, (2) Bulimia, and (3) Bingeing\n· In order to achieve this “look”, in search for “perfection”, they go through extremes such as: (1) Starvation, (2) Purging,   (3) Over-exercising, (4) Drug consumption to suppress hunger, and (5) Diuretics and laxative consumption\n\n· Effects: (1) Decrease in heart rate, (2) Loss of bone density, (3) Inflammation, (4) Tooth Decay, (5) Baldness, (6) Muscle   Loss, (7) Starvation, and (8) complete shutdown of your system (coma)\n\nReal Story:\nImagine, a smart girl in her first year of high school. She had all the attention she ever wanted, but it was not for her looks, or for her wits, but it was for her weight. At 186 pounds, she was made fun of; the mocking did not stop and it led for her to become friends with ED. She wanted to be perfect just so kids would not bother her. She started watching modeling shows to see how these people ate in order to mimic them. Her first goal was to reach 145 pounds. She fasted, ate very little and exercised for three hours a day. After only two months, her goal was accomplished. You might think the story ends here, but she defined a second goal for herself; reach 115. After 4 months, only living off lettuce, chicken breast, and a piece of bread a day, she lost 30 pounds. However, ED kept telling her it was not enough; therefore, she decided to keep losing, this time without any goals, just until she is happy with her looks. All meat was cut out from her diet; all water was reduced in case of bloating. All she lived off were apples and rice cakes. However, her life took another turn for the worst. Even just feeding herself those two items, she decided this was not good enough. As a result, she started throwing up.\n\nInitially, it started with the finger, but then, since she wanted to feel pain, she stuck a toothbrush down her throat. She would throw up all the little food she ate until she started bleeding. The blood did not stop her, but rather encouraged her. She did this until she reached her ideal self—80 pounds. At 80 pounds, she started to feel like she was worth something. Days without eating made her focus more on her schoolwork and it made her perfect; that was her goal perfection. ED was next to her all the time until one day she realized that this needed to stop. Unfortunately, she had to learn in the worst way ever.\n\nHer kidneys were giving her issues and she was taken to the emergency room. The girl was sick, but her mind was worse. As per the doctor, if she was to lose another 5 pounds, her heart would have shut down completely. ED did not want to let her go, but with the help of her family, ED was able to leave her alone. This story just sums up what could happen if we obsess over perfection. ED might show up to your doorstep and might not ever want to leave. However, if you know someone that might be facing this issue, please help them. ED can grow stronger the longer it stays, it will be harder for it to leave.\n\nSolution To Help Someone: \n1. Support them. Most of the time, they need others to tell them that they are great human beings.\n2. Do not comment on their weight\n3. Be a friend, not a parent.\n4. Teach them that perfection is non-existent\n5. Let your beloved ones know they are beautiful in their own and unique way\n6. Encourage them to eat healthy (not eating=not good)\n7. Lend a shoulder to cry on\n8. Be strong, be patient, it takes a while\n\nTakeaway:\nLet us share this simple advice to anyone, before ED has a chance to enter their lives. Remember, be patient and caring, and love yourself for who you are. Your beauty is not defined by what size you wear or by your looks. It is not defined by the definition of your body structure. Be healthy inside and out. We, as a society, can change the outcome of eating disorders. ED can hurt our society, but if we stop them, ED and perfection will no longer be an issue in our society.",
      "created_utc": 1613871634.0,
      "score": 6,
      "context": []
    },
    {
      "id": "go85pkr",
      "author": "Maggiemaccy",
      "body": "Girl! This is me 7 months ago.\nBeen in recovery for around 10 years, I had an ED since childhood and never had a period except a few here and there over the years, so we were really shocked that I was pregnant 6 months after we stopped all birth control. We anticipated years and probably some medical intervention needed.\n\nPregnancy was hell. The weight gain was not the issue at all, it was loss of my main coping mechanism. I felt disgusting, due to all the standard pregnancy stuff plus HG. That’s where my disorder behaviour stems from, I’d get this awful feeling of disgust that makes me wants to rip my skin off and the only way I could make it go away was starving myself. And quite often the feeling of my skin touching my skin causes it, so my under boob touching my rib cage, if I sat a certain way and could feel my thighs touch each other or a roll on my stomach touching the skin underneath. So pregnancy was just rife with my biggest trigger and I wasn’t able to starve myself to cope obviously. It was hell, I was suicidal for the vast majority of it and I worried a lot about how I’d cope post pregnancy. \n\nI was lucky in a lot of ways, my recovery was swift. I was in no pain, no tearing, felt physically great immediately. My baby was very unwell when he came along so that part obviously caused a lot of trauma. But overall now that he’s home and doing well I have coped really well. I’m incredibly happy and thankfully I never suffered any PPD but keeping in mind this could have been a different story depending on my body post pregnancy. \n\nI can’t speak for anyone but myself and my own experience. But I’ve luckily dodged any issues post and my pregnancy issues were off the charts. I have no advice but just to know that just because you feel this way now doesn’t mean you’re heading for relapse post pregnancy.",
      "created_utc": 1613915837.0,
      "score": 2,
      "context": []
    },
    {
      "id": "go6fgb1",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1613869661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "go9qbh1",
      "author": "ladysoup666",
      "body": "Our due dates are very close! I’m also 35 weeks. I definitely feel you. I was trying to get pregnant and it took no time at all but I kept my midwife, therapist, nutritionist, and doula in the loop at all times. I would definitely suggest doing your best to find a new therapist before birth. Obviously we are not the same person but my therapist has been more worried about postpartum than anything. Just make sure to keep telling everyone how you’re feeling, and what’s going on. Never be worried about asking for help!",
      "created_utc": 1613943406.0,
      "score": 1,
      "context": []
    }
  ]
}