{
  "id": "ls3k3a",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1614248713.0,
  "title": "Request: Flatmate has started eating a lot less and I don’t know how to help",
  "selftext": "My flatmate has recently opened up to me about her eating habits. She said that she aims to eat less than xx calories a day (very low) as it is something she can control amongst many things in her life which she feels she cannot control such as an unhealthy relationship with her family, depression and suicidal thoughts. \n\nThe lack of food she eats combined with her doing a fair bit of exercise everyday means she has lost a lot of weight, which she says she likes as it is a physical indicator that what she is doing is ‘working’. \n\nThis has been really difficult to see happen and I want to help in any way I can. She is currently going through a process of getting diagnosed but this process is slow and I fear that by the time she does get diagnosed then she may be in a critically bad state. \n\nI know she should be eating more but the idea of trying to force her to eat more food seems like it won’t work and could make things worse? Any advice is massively appreciated as I don’t have any experience with this and I don’t know how to help. Thank you :)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ls3k3a/request_flatmate_has_started_eating_a_lot_less/",
  "score": 35,
  "num_comments": 7,
  "comments": [
    {
      "id": "gooxyi4",
      "author": "uwuvirgogirl",
      "body": "I was in the position of the roommate before and I just want to say you’re a really caring roommate, and I know sometimes it would help if I got invited out to eat or just eating together! But I also don’t want that to trigger purging or anything so approach with caution... I’m sorry you’re in this situation! I know it’s a tough spot, I always felt my roommates worrying about me but I would hide it with a “diet”",
      "created_utc": 1614250225.0,
      "score": 12,
      "context": []
    },
    {
      "id": "goqhnhj",
      "author": "None",
      "body": "Unfortunately you can’t make someone get help or even listen to good advice; they need to *want* to do that of their own volition to have any hope of reaching them. That being said, being a supportive and non-judgmental friend can work wonders. Make sure your friend knows they can talk to you about their struggles as EDs can be very isolating by nature. Remember that self care - both theirs and yours - is important; make sure to treat yourself gently as well, as you can’t help someone very well if you yourself are suffering. Shared trauma can lead to bonding but it can also lead to co-dependence. Just take care and try your best; I’m sure your friend appreciates having you in their life.",
      "created_utc": 1614278177.0,
      "score": 4,
      "context": []
    },
    {
      "id": "goqqimq",
      "author": "lborecki",
      "body": "At this stage, I might do two things. First, if they have others friends or family you know of, this would be a good time to bring them in the loop about your concerns. Until your roommate is aware of her disordered eating and exercising, and interested in changing course, it's scary and hard to watch the downward spiral- you don't have to be the sole keeper of this knowledge or responsibility! Second, I might \"get on her side,\" so to speak. Perhaps offer encouragement that wanting to be healthy and confident in one's body is a great thing to work toward, and also that diet culture is really complex. Encouraging her to chat with a nutritionist or doctor about her goals so that she can meet her \"long term goals\" while still meeting her energy and nutrient needs! Having a doctor look at labs like iron, zinc, Magnesium, leptin, and cortisol are a way for doctors to be cued into nutritional deficit problems and for the person who's been only seeing \"positive\" weight loss gains see another side of what's going on. Good luck, you're a great roommate for looking for how you can help!",
      "created_utc": 1614281451.0,
      "score": 4,
      "context": []
    },
    {
      "id": "goqi0ig",
      "author": "eusicorn",
      "body": "can someone please tell me how much calories is too low? :( and how much calories should i eat to lose weight if im 5'1??",
      "created_utc": 1614278312.0,
      "score": -4,
      "context": []
    },
    {
      "id": "goowce0",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1614248713.0,
      "score": 1,
      "context": []
    },
    {
      "id": "goqann8",
      "author": "HoneyAndSht",
      "body": "Ah well. Long story short for when I found out my friend was becoming anorexic I scared him. I opened up to him about myself and told him my suffering, the torture and how fucked my metabolism is. That, food just turns into numbers and I’m the end there’s nothing I can control. How it costed me friendships because I didn’t want to go out to eat or became an asshole because I was always hungry. How I lose sleep, how I almost died because of it. He’s doing okay right now because he doesn’t wanna end up like me. And he still has a good metabolism which I am jealous of.",
      "created_utc": 1614275613.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gou7z6z",
      "author": "alienatemebaby",
      "body": "Random people on the internet can’t possibly know what you’re asking. \n\nIt depends on your age, gender, weight and activity level too. Find out for yourself here https://tdeecalculator.net/",
      "created_utc": 1614354124.0,
      "score": 0,
      "context": [
        {
          "id": "goqi0ig",
          "author": "eusicorn",
          "body": "can someone please tell me how much calories is too low? :( and how much calories should i eat to lose weight if im 5'1??",
          "created_utc": 1614278312.0
        }
      ]
    }
  ]
}