{
  "id": "ludie8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1614510905.0,
  "title": "Request: food aggression",
  "selftext": "I am mostly recovered from my eating disorder (anorexia). The main issue I struggle with is sharing food. It has to be on my own terms, and if I think someone is going to take my food, I hide it. I get really anxious until I know my food is safe. Today, my bf gave his family my box of doughnuts without thinking about it, and I'm trying to resist the urge to go get them back. I can't sleep knowing my food is being eaten. How do I cope with this?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ludie8/request_food_aggression/",
  "score": 65,
  "num_comments": 12,
  "comments": [
    {
      "id": "gp71gg5",
      "author": "None",
      "body": "I have food insecurity issues from a combination of extreme poverty growing up and an ED that started in 2018. I’m trying to build up a “tolerance for sharing” (for lack of a better term) by clearly delineating which foods in the house are mine (I have my own cupboard) and then sharing if - and *only* if - I feel 100% comfortable and un-coerced in doing so. I have asked my partner to *never, under any circumstance* mention my food or ask to have some of it. If I want to share, I share...but it is wholly my choice to do so, never coerced. I set hard limits so I don’t go (more) mental. Idk if that helps, but I’ve found clear limits to help me explore widening my tolerance for sharing my food with others. It requires everyone in the household to be on board 100% and respectful of your needs, tho, which might take some finagling. Hope that helps.",
      "created_utc": 1614533623.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gp64m6i",
      "author": "None",
      "body": "I still have this issue and have for a very long time. I currently stock my cupboards now that we bought a house with a ridiculous amount of “supplies”. I even keep lots in the fridge even knowing I’ll need up trashing a lot of it once it spoils. But that “food scarcity” thing my brain does has not gone away. It will just take a lot of time to retrain your brain. Maybe make it clear to your bf that certain food is off limits, even label it, and if it must be used/given away have a plan for the person who does that to replace it immediately if possible.",
      "created_utc": 1614519322.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gp610e1",
      "author": "throwaway9876595732",
      "body": "I thought this was just me!! I’m sorry tho I don’t know how to cope, I just wanted to let you know you aren’t alone",
      "created_utc": 1614516516.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gp9i8zd",
      "author": "mandy_miss",
      "body": "Ive never heard this feeling in words before. My food aggression hit when someone without food (e.g. work breakroom) sees me eating something and they say “that looks good” or “what is that” and i get incredibly irritated and i get this weird paranoid feeling. And i get very possessive over food as well. Like food being passed around at thanksgiving, i know there is plenty for everyone but i get anxious if someone gets something before i do",
      "created_utc": 1614570435.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gp62d8f",
      "author": "peachypokes",
      "body": "It’s totally normal to have fears around food availability and feel protective of your own food when your body and brain have experienced restriction in the form of an eating disorder. Your brain is just trying to keep you alive during or after a big scary famine.\n\nI don’t know for sure, so someone with more experience may have different advice, but the best thing I can think to do is just continue to feed yourself enough of the foods you want and are craving, and do your best to have enough food available to you at any given time (as much as is financially possible for you). I think it will take some time, but eventually you should feel less afraid of your food going away because you have access to more. Intuitive eating is based on these principles essentially, so if you haven’t already looked into it in recovery, I would encourage you to do a little reading about it maybe! Books like Anti-Diet by Christy Harrison or Intuitive Eating by Evelyn Tribole should provide a good introduction.\n\nIf you find this too challenging to overcome on your own, cognitive behavioral therapy is always an excellent resource to help tackle anxieties of any kind. And it’s okay if this is hard to overcome!! This is an anxiety that can have deep roots since it’s around one of the most basic but crucial of our biological survival needs.",
      "created_utc": 1614517610.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gp93o3e",
      "author": "ewe-of-death",
      "body": "Oh my god I relate to this so much! Mine started before I struggled with anorexia, but I would always get really weird about people eating my food like a deranged dog. I haven't found a good way to cope, in all honesty, but one thing that does help is possibly buying / making more than usual of a food that you really want to have around. That way in case someone takes some you can be like \"oh well there is a ton so I still have plenty of opportunities to have some.\" I don't know if that's helpful, best of luck to you!",
      "created_utc": 1614562105.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gp9mehp",
      "author": "babbygreengirl",
      "body": "I've had this problem for the longest time while in the grips of an ed and now in recovery. I had long  restrictive periods and then long binge periods. Sharing food such as a pizza, cheese and crackers, fruit tray etc with someone made me super anxious and I would panic eat \"my deserved portion\" even when I wasnt hungry or wanted to because I felt they were going to eat more than their share. I would get super possessive even if I didnt voice it out loud. It's crazy to say it out loud, but know that you arent alone hun. Practice is key. Find someone you feel safe with and try sharing even simple things like a pack of fruit snacks. maybe something with uneven numbers(that was big for me). Its still so hard, but the more you do it, and the more you remind yourself it isnt a competition, they arent trying to \"steal\" your food and are just enjoying the fact they are sharing it with you, the easier it gets. Easier said than done I know. I wish you the best. As for the specific donuts, dont go get them but voice to your boyfriend why that made you uncomfortable, even if you cant explain it descriptively.",
      "created_utc": 1614573035.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gp9o4ir",
      "author": "christinamatteson",
      "body": "Yes! I keep a crazy amount of food in the house now (as I can afford) with plenty of options. For some reason inevitably someone will eat my “safe” food that I’ve hidden and it makes me irrationally angry. Like to the point where I just won’t eat anything for the rest of the day. Another frequent happening, someone wants a bite of what I’m eating. Why?! I’ve measured and calculated everything, can’t they just get their own? Nope. I don’t know why I’m like this, I know it’s wrong and petty, but I can’t help it.",
      "created_utc": 1614574186.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gpa1dc6",
      "author": "Mimolette_",
      "body": "I felt like this for a while. I think what helped me the most was first working on accepting food that others offered to share. That was pretty scary because it wasn’t measured and I didn’t know the calories. But it was also nice because I got little manageable tastes of new foods. And once I got comfortable with that my desire to share my own food just naturally emerged. Now I feel chill and generous. So it’s totally possible to change!",
      "created_utc": 1614584602.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gpacjwu",
      "author": "therealdildoexpert",
      "body": "I also hide my food, or I won't eat my food in fear of running out. I understand it's not practical and I also understand it's food aggression but I've learned to respect it and understand why I am the way I am. I think it would be a good idea to give yourself some nurturing and empathy and understand it's okay to be feeling these feelings and that they're there for a reason. I think it would be a good idea to talk to the person who gave away your food about how that triggers your eating habits and that, going forward there needs to be more mindfulness.",
      "created_utc": 1614595613.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gpmi74l",
      "author": "nala8888",
      "body": "Not sure but I can share my experience... firstly you bf should have asked permission and you should prolly speak to your bf about the boundaries first. It seems overwhelming. \n\nI have food aggression for years, sharing was not in my dictionary and I would get crazy mad if someone took my food. But for the past 6 months it has slowly subsided. It began when I started sharing with the people I trust. Little by little. If they would ask me (cause I cook my own food) if they can try a little. I initially would give them a suspicious stare hahah but I would give them a spoon or two at first. \n\nIf any food doesn't make you happy or like it's too bitter give them half or something. That's what I did (if you are comfortable). It takes a while. Just take step by step and someday you can cook for your friend or family member and share it. \n\nHope you are doing okay! And hope you boyfriend reimburse you those donuts. (uncool man hahaha)",
      "created_utc": 1614836996.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gp5tnc8",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1614510905.0,
      "score": 1,
      "context": []
    }
  ]
}