{
  "id": "lwf4io",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1614726458.0,
  "title": "Request: How to exercise without falling back to bad habits.",
  "selftext": "I have a history of disordered eating, though because I don't have a diagnosis I don't feel comfortable calling it an eating disorder. I'm trying to cut down on my body fat percentage, but am super worried about relapsing. I'm not in a supporting environment (ie parents encouraging me losing weight too fast), and I due to quarantine I have less healthy influences from outside my family. I don't know what a healthy body looks like, and I don't know what healthy expectations are. Thank you for your time.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lwf4io/request_how_to_exercise_without_falling_back_to/",
  "score": 48,
  "num_comments": 11,
  "comments": [
    {
      "id": "gphe5dh",
      "author": "pistolpxte",
      "body": "Without some sort of intervention from a specialist it’s really hard to wing stuff like this. It’s easy to go overboard on exercise or “safe food”, but it is very possible to incorporate and use exercise as a tool to center yourself and be comfortable in your own skin. Utilize YouTube for tips on overcoming eating disorders and exercising to strengthen your body. Meditate, get your mental stability healthy alongside your body as well. I’d suggest reaching out for help if possible.",
      "created_utc": 1614733973.0,
      "score": 10,
      "context": []
    },
    {
      "id": "gphewcx",
      "author": "None",
      "body": "Truthfully, when you are looking at exercise as something that is healthy, enjoyable, and helpful for you and not as a way of burning calories, that is probably when you are ready to exercise. Disordered eating should be treated like a behavioral addiction-and over exercise and obsessive exercise is abusive and falls into disordered behavior also. I would encourage you to try to find some professional help that can guide you better than well meaning people who may not understand disordered eating thoroughly. Also, I would encourage you to think about why you think you need to lose weight...your goal should be to be healthy not look healthy. So that would include your mental health also. I have struggled with an eating disorder and over exercise for years and years and what I have found is that I can’t be trusted much to exercise in a healthy way. When I finally stopped, a lot fell into place that couldn’t when I was still focused on continual exercise as a way to maintain my weight. I hope you find some peace with your mind and body sooner instead of later! It takes sooo much more work than any effort you could ever put in at some gym.",
      "created_utc": 1614734365.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gpjbfw5",
      "author": "FoxiiFighter",
      "body": "Health looks different on everyone.  Here's a really awesome, empowering podcast about defining health for you and nobody else: [https://www.stitcher.com/show/the-thick-thighs-save-lives-podcast/episode/ep115-defining-health-82066130](https://www.stitcher.com/show/the-thick-thighs-save-lives-podcast/episode/ep115-defining-health-82066130)\n\nThe best thing you can do focus on activity/exercise that you genuinely love doing, and identify the ones that you know you are only going to use to burn calories - you want to avoid those. \n\nExample: At the height of my disorder, running was my go to. Miles and Miles. I didn't actually enjoy it though. Now, I do a shit ton of strength training, and a little cross fit because it makes me happy and it makes me feel strong. I also love going on walks on trails.\n\nThat's the easiest way to avoid slipping - if you change the why behind your movement. And you'll still be exercising so it should keep your parents off your back.",
      "created_utc": 1614781705.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gph7imv",
      "author": "AnaDion94",
      "body": "Maybe just start out with gradually increasing your moment in light ways while focusing on making your body healthier and stronger instead of weight loss? I like to go of leisurely walks and upping my steps a little bit each day and focus on the benefit of my legs and lungs being stronger.",
      "created_utc": 1614730555.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gpidnt0",
      "author": "seravivi",
      "body": "Tallrye has some good info on moving intuitively.\nI dont think you can go into working out with a desire to lose fat and not risk a relapse. \nThe reasons I work out are completely outside of how I physically look. \nAsk yourself why you want to workout seriously?\nWhy do you want to lose fat?\nWhat type of workouts are you looking at?\nDo you enjoy how you feel doing these workouts?\nWould you do this workout even if it didn't change your appearance?",
      "created_utc": 1614755056.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gpivdm2",
      "author": "mgrohow",
      "body": "Great question. I think about this every day. I have been in treatment for 3 months and have cut back my exercise but not stopped because it helps so much with my mental health and happiness. I don't trust myself with exercise. I always abuse it. I started following a training plan and that has helped me take rest days and do less miles/workouts. I am not sure how long this good streak will last, but I am trying to take it a day at a time. It is good advice to try seeking out information from good media. A podcast has been life-changing for me \"The eating disorder recovery podcast\" and the episode \"PHIT Queens on Exercise\" from July 15, 2019\" is really really helpful on exercise with an eating disorder. I hope it helps.",
      "created_utc": 1614771579.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gpjitgj",
      "author": "purpleelephant77",
      "body": "I started with doing classes because they’re time limited so I couldn’t go overboard freestyling things on my own.",
      "created_utc": 1614785122.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gpk5i5r",
      "author": "None",
      "body": "Getting fit (no aesthetic vibes) plus intuitive eating.  \n\nIdk why I’m commenting when I’m all over the place but I know this works.",
      "created_utc": 1614794888.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gpgzh5n",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1614726459.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gpkf0dm",
      "author": "None",
      "body": "i’ve been recovered for quite some time now and exercising still isn’t a healthy option for me because i just fall right back into that old mindset. my advice is don’t rush it. don’t feel inclined to exercise if you aren’t ready yet. give your body & mind all the time it needs to heal :-)",
      "created_utc": 1614799002.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gpkun7e",
      "author": "paradoxrevel",
      "body": "Hi there! I have a few thoughts. 1) an absence of a diagnosis doesn't mean your experience isn't just as sensitive, valid, and precarious. I'm wondering if you're in a bigger body and therefore dealing with weight stigma as a barrier to treatment in addition to from your parents. I'd tell your parents that comments on your body are unwelcome and unhelpful. 2) healthy bodies exist in many shapes and sizes (check out Body Respect and Health at Every Size by Lindo Bacon). I've found [Meg Boggs](https://www.instagram.com/p/CLksxHHgB_g/?utm_source=ig_web_copy_link) and [Emily Decker](https://www.instagram.com/p/CLnB9SOJIvW/?utm_source=ig_web_copy_link) on Instagram to be helpful. Also, [300 pounds and running](https://300poundsandrunning.com/about-300-pounds-and-running/) does a great job busting the fitness \"look\" stereotype. 3) you don't owe your health to anyone, not even yourself. Healthy people aren't morally superior or better than anyone else. And mental health is just as important to consider (if not more so!)",
      "created_utc": 1614805742.0,
      "score": 1,
      "context": []
    }
  ]
}