{
  "id": "lx9c0l",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1614821037.0,
  "title": "Request: Seeking advice for managing my ED when I'm are drinking or gonna drink?",
  "selftext": " \n\nI’m wondering what techniques or things  people do to avoid binging or purging if they are drinking alcohol.  Thinks like eating before, preparing food etc.\n\nI’m a diagnosed bulimic and have only ever relapsed because of alcohol and would like some advice. Thank you",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lx9c0l/request_seeking_advice_for_managing_my_ed_when_im/",
  "score": 42,
  "num_comments": 13,
  "comments": [
    {
      "id": "gpm2oxo",
      "author": "oddtentacle",
      "body": "My advice would be to set yourself a drink limit. And I'd personally eat something light beforehand. Maybe have a glass of water in between each alcoholic drink? Help with the hangover and keep you from being too drunk!",
      "created_utc": 1614827746.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gpn3bg9",
      "author": "crystaldmb41",
      "body": "I am a recovering alcoholic who is actively in my eating disorders. I would often use drinking as an excuse to eat normally. I went to rehab in July 2020 and have been sober for 249 days. People with EDs often have substance issues too. That said, make a plan. Set a drink limit, have water in between, and scoop the menu before the event. Maybe set an alarm in your phone part way to remind you to eat or to stop drinking.\n\nSorry if I went full Mom, anorexic at 42 on you lol.",
      "created_utc": 1614855956.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gpmc7z9",
      "author": "Reversephoenix77",
      "body": "I have a few rules for myself like not keeping sweets like cookies or ice cream in the house, make sure I eat before I'm super hungry and no food past 6PM. Those are all triggers for me. Booze could be one too so if I do drink I am cautious. I've struggled with both anorexia, bulimia and binge eating disorder for years and I feel like I have no idea how to eat \"normally.\" I don't know if anyone can relate but having those rules in place really helps, especially the no eating after 5/6PM. Night eating was really triggering for me. I hope you figure out yours and wish you well on your road to recovery",
      "created_utc": 1614833059.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gpnd1xt",
      "author": "nodaybuttoday__",
      "body": "I had to stop drinking entirely bc I found that alcohol consumption increased my ED behaviors. Everyone’s different, but maybe try not drinking if you find it triggering?",
      "created_utc": 1614863280.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gposojw",
      "author": "speakloudly",
      "body": "I had to stop drinking as it would trigger my ED. I was diagnosed bulimic as well and it would make things much worse for me. I ended up completely abusing alcohol.\nI would say stay away but I understand how hard it is to be sober. \nEat something before you drink, a couple hours before, and limit yourself.",
      "created_utc": 1614886582.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gpp0sm5",
      "author": "Tea-rex-",
      "body": "I am in recovery from bulimia and the one thing that has caused me to have minor relapses is when I’m drunk so I had to stop drinking. This didn’t bother me, I’ve never needed to drink and I’m happy not drinking. I’m now able to have a couple but I try not to have more. I’m also aware that because I think alcohol might make me purge, that in turn is more likely to make me purge because the worry is already there (a bit like self sabotage). I think the best thing is to simply not drink and reintroduce it in stages",
      "created_utc": 1614889979.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gply89t",
      "author": "ILOVECAT",
      "body": "Alcohol impairs decision making abilities. The more you drink, the more likely you are to make a decision you would not if you were sober.",
      "created_utc": 1614825491.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gpq2lmh",
      "author": "Divine-Butterfly16",
      "body": "I’m also a diagnosed&disguised bulimic (hate the way that term sounds but idk how else to put it haha) and struggle with this often as well. What has helped me to keep my tendencies to a minimum is sticking to the same drinks that I know won’t get me too drunk or out of control cognitively (in my case this is the Cottage springs vodka water) and I sip 2-4 throughout the night with a straw and ice so that I have a small but kinda constant buzz. This way I can still enjoy the pleasures of feeling warm and fuzzy from alcohol but knowing that if I do get a feeling I’m less likely to act on it RIGHT AWAY because I am still socially aware of my surroundings. I hope this helped, and I want you to know that I am ROOTING FOR YOU <3",
      "created_utc": 1614907911.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gprgt45",
      "author": "ningyizhuo",
      "body": "If you only relapse because of alcohol, then it would probably be best to stop drinking it. Or setting yourself some limits. For example, only a glass or two at a dinner reception and none if you're going to party. I don't know for you, but personally even though I don't drink ever, I would be less likely to get drunk and relapse at a family dinner than at a club.",
      "created_utc": 1614943755.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gpnyhsg",
      "author": "updown27",
      "body": "This one is actually an easy fix - stop drinking. I have different ED symptoms but they were so significant when I drank that I quit drinking and putting myself in situations where drinking would be tempting for almost a year. Since doing that I am much more able to moderate my drinking and it also gave me time to strengthen my coping skills so I can avoid relapses on the occasions when I do drink.",
      "created_utc": 1614873796.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gplpcly",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1614821037.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gpu9539",
      "author": "Happy-Service-5464",
      "body": "Hey I’m the one who asked this question and wow It’s crazy to hear someone going through the same thing as me. I’d say I’m disguised as well and I’m especially good at it when I’m drinking... thanks for the support, rooting for you too😁",
      "created_utc": 1614992647.0,
      "score": 2,
      "context": [
        {
          "id": "gpq2lmh",
          "author": "Divine-Butterfly16",
          "body": "I’m also a diagnosed&disguised bulimic (hate the way that term sounds but idk how else to put it haha) and struggle with this often as well. What has helped me to keep my tendencies to a minimum is sticking to the same drinks that I know won’t get me too drunk or out of control cognitively (in my case this is the Cottage springs vodka water) and I sip 2-4 throughout the night with a straw and ice so that I have a small but kinda constant buzz. This way I can still enjoy the pleasures of feeling warm and fuzzy from alcohol but knowing that if I do get a feeling I’m less likely to act on it RIGHT AWAY because I am still socially aware of my surroundings. I hope this helped, and I want you to know that I am ROOTING FOR YOU <3",
          "created_utc": 1614907911.0
        }
      ]
    },
    {
      "id": "gpvu78h",
      "author": "Divine-Butterfly16",
      "body": "We got this. One week at a time for me 😫",
      "created_utc": 1615015798.0,
      "score": 2,
      "context": [
        {
          "id": "gpq2lmh",
          "author": "Divine-Butterfly16",
          "body": "I’m also a diagnosed&disguised bulimic (hate the way that term sounds but idk how else to put it haha) and struggle with this often as well. What has helped me to keep my tendencies to a minimum is sticking to the same drinks that I know won’t get me too drunk or out of control cognitively (in my case this is the Cottage springs vodka water) and I sip 2-4 throughout the night with a straw and ice so that I have a small but kinda constant buzz. This way I can still enjoy the pleasures of feeling warm and fuzzy from alcohol but knowing that if I do get a feeling I’m less likely to act on it RIGHT AWAY because I am still socially aware of my surroundings. I hope this helped, and I want you to know that I am ROOTING FOR YOU <3",
          "created_utc": 1614907911.0
        },
        {
          "id": "gpu9539",
          "author": "Happy-Service-5464",
          "body": "Hey I’m the one who asked this question and wow It’s crazy to hear someone going through the same thing as me. I’d say I’m disguised as well and I’m especially good at it when I’m drinking... thanks for the support, rooting for you too😁",
          "created_utc": 1614992647.0
        }
      ]
    }
  ]
}