{
  "id": "lyr9j3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1614995126.0,
  "title": "Request: Question post: How do I balance a doctor's prescription of exercise for me with my wife's recovery?",
  "selftext": "So title basically says it all, I have ADHD and my doctor prefers that I increase exercise instead of my dose of adderall. How do I balance that need with the fact that exercise triggers my wife's eating disorder? It's not like I can hide it from her. I have seen her grow and recover so much in the past year, I don't want her to lose any progress on my behalf.\n\nFeel free to edit this as you see fit, I'm certainly no expert in verbiage around ED.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/lyr9j3/request_question_post_how_do_i_balance_a_doctors/",
  "score": 39,
  "num_comments": 8,
  "comments": [
    {
      "id": "gpv7wxf",
      "author": "LotusRG",
      "body": "Its extremely loving of you to not want to trigger her.\n\nYou absolutely need to take care of your health tho too. I would have an honest and open conversation with her. \n\nAs long as you aren't exercising around her she will need to work through, cope and process any feelings or triggering thoughts regarding your exercising. If you are exercising outside or at a gym she wont see it. If you do it at your place you can either work out a schedule with her etc\n\nShe alone is responsible for her health. I say that as someone who struggles with these things and also has a substance abuse issue. You can and should be considerate and not talk about it with her or do it right in front of her but ultimately she has to be responsible for not falling back into those old patterns of behaviors",
      "created_utc": 1615005598.0,
      "score": 17,
      "context": []
    },
    {
      "id": "gpv0m7l",
      "author": "miniblinds123",
      "body": "You are super thoughtful to consider her reaction, but (IMO) her health isn’t the only one that matters; yours does too.  Go enjoy your workouts, come home feeling good, shower and move on with your day.  I’m sure you’ll be cautious not to make it a big deal or whatever, and she will be okay.",
      "created_utc": 1615002502.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gpyg2mg",
      "author": "mgrohow",
      "body": "Echoing the others my advice is not to talk about mileage or weights or whatever might be triggering. But I agree with the others that you must take care of your mental health too. If you don't, you can't care for your wife.\n\nSorry, does she know about this prescription/ advice? Obviously don't hide it from her. Explain it to her. Talk/discuss it. Ask her how that makes her feel.",
      "created_utc": 1615040962.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gpw1lg0",
      "author": "None",
      "body": "Maybe try and avoid talking about exactly what workout you're doing- especially if its some form of cardio and you can talk about thr gym being your adhd medicine dose rather than ever emphasis working out for health or your body",
      "created_utc": 1615017385.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gq155w4",
      "author": "weekndprince",
      "body": "Don’t ask her to go with you but don’t exclude her, don’t be super rigid about it if you can help it, focus on non-physique related topics of conversation around it. Also I hope she is in treatment and/or getting ED-recovery support!",
      "created_utc": 1615070362.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gpug89k",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1614995126.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gpzqyd0",
      "author": "roses269",
      "body": "To add onto others comments, it might help if you make it clear that you’re exercising to help with your ADHD not for weight loss.  Movement and exercise are a necessary part of life and eating disorder recovery includes finding ways to exercise without it becoming obsessive or being about weight loss.",
      "created_utc": 1615054995.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gq149uv",
      "author": "weekndprince",
      "body": "Yes! This is a great point. To me exercise with focus on body image or physical performance is most triggering. Exercise to “wake up” or “get the blood flowing” or even “heart health” is generally not triggering for me.",
      "created_utc": 1615070098.0,
      "score": 3,
      "context": [
        {
          "id": "gpzqyd0",
          "author": "roses269",
          "body": "To add onto others comments, it might help if you make it clear that you’re exercising to help with your ADHD not for weight loss.  Movement and exercise are a necessary part of life and eating disorder recovery includes finding ways to exercise without it becoming obsessive or being about weight loss.",
          "created_utc": 1615054995.0
        }
      ]
    }
  ]
}