{
  "id": "m16eag",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1615296581.0,
  "title": "Request: Post Request: Dealing With Period Bloat as a Trigger",
  "selftext": "I'm currently recovering from anorexia (with the help of a counselor).  I've noticed that bloating during my periods acts like a trigger that makes me want to start restricting again, and sometimes I'll find myself slipping because of it.  I know that the bloating isn't actual weight gain and it is temporary but when I look in the mirror it causes anxiety. Does anyone have any tips for coping with this, or experienced similar feelings?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/m16eag/request_post_request_dealing_with_period_bloat_as/",
  "score": 58,
  "num_comments": 11,
  "comments": [
    {
      "id": "gqcgpba",
      "author": "robobrat",
      "body": "this isnt the advice i’d want either, but i wear baggy clothes. i wish there was a ‘better’ way to REALLY manage it, like to get rid of the anxiety, but i cant, i just need to force myself not to look",
      "created_utc": 1615308242.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gqchjz9",
      "author": "LucyBlue16",
      "body": "I’ve definitely experienced this. I just try to not look in the mirror and remind myself that it will pass and I’ll be uncomfortable but I’ll live.",
      "created_utc": 1615308545.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqcsjdh",
      "author": "None",
      "body": "I get bloated the week before my period and I can’t stand it. What I do is drink lots and lots of water and reduce my salt intake for the week (bc of water retention) which I find really helps with the bloating. I’m in recovery as well and the past couple months I’ve been doing this and I find myself feeling much less anxious during those weeks",
      "created_utc": 1615313198.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqdwp65",
      "author": "mgrohow",
      "body": "Ditto! I am literally experiencing this in this very moment. \n\nI just keep body checking and trying to breathe and like the others are saying \"this is temporary.\" But this is so hard. Thanks for posting this because I'm right there with you and it's so nice to know we're not alone!",
      "created_utc": 1615331604.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gqegk4k",
      "author": "lej_",
      "body": "before i got my paragard (copper iud) bloating wasnt too much of a problem for me, but after getting it inserted i bloat like CRAZY every time i get my period which triggers me a lot (still better than being pregnant tho ig). i started taking magnesium at night which helped little, but then i switched to the bye bye bloat vitamins by Love Wellness (i found it at target) and to my surprise it actually worked pretty well! Although there still is a bit of bloating so i hide my scale and avoid mirrors as much as i can for the duration of my period",
      "created_utc": 1615342087.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqbpjcb",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1615296581.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqdpqxm",
      "author": "tears_of_an_angel_",
      "body": "I just remind myself that it’s temporary and I apologize in advance if this is really bad advice but I tell myself I have to wait 2 weeks first and then if it still doesn’t go away then I’ll take action",
      "created_utc": 1615328244.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqdtpfn",
      "author": "None",
      "body": "I have been having this issue. I literally could have wrote this today. I just ordered this gummy called Flo. It’s suppose to be here this week. I am hoping it works. It’s suppose to help with bloating and help make all period symptoms be subtle. It is also suppose to help with hormonal acne. The reviews seem hopeful.",
      "created_utc": 1615330121.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqehdv6",
      "author": "ElloKodo",
      "body": "This is me every 4 weeks. I sob about how fat I have suddenly gotten, and the distorted connection between my eyes and brains blows me up like a balloon. Are you married to the scale? One of my biggest mistakes during these weeks is getting on the scale.... I am trying to figure out a way to keep myself off on these weeks. If you’re able to resist the scale these weeks, my hat is off to you",
      "created_utc": 1615342537.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqylpel",
      "author": "twilyyyy",
      "body": "water pills help",
      "created_utc": 1615766490.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqee0cp",
      "author": "coolofmetotry",
      "body": "i do that, if i feel slightly bloated i stay away from mirrors and wear baggy clothes. sadly there’s not much to do about anxiety except feeling it :(",
      "created_utc": 1615340719.0,
      "score": 2,
      "context": [
        {
          "id": "gqcgpba",
          "author": "robobrat",
          "body": "this isnt the advice i’d want either, but i wear baggy clothes. i wish there was a ‘better’ way to REALLY manage it, like to get rid of the anxiety, but i cant, i just need to force myself not to look",
          "created_utc": 1615308242.0
        }
      ]
    }
  ]
}