{
  "id": "m2eqej",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1615426484.0,
  "title": "Request: am I developing an eating disorder or am I just in some sort of diet depression",
  "selftext": " \n\nHi. Let me start this off  by saying i’m a 16 year old girl who’s trying to lose weight for the  summer. I already don’t have the best relationship with food because i’m  autistic and there’s a lot of foods that bother me. For the past year  or so i’ve been a little overweight and insecure about my looks so i  finally decided to take action and try to lose weight. i’ve been dieting  for about a month and it was going well at first. But now I feel like  i’m becoming too obsessive with it. Like I even started worrying about  the calories in the vitamins i take. My mom also makes comments about my  weight whenever she gets the chance and constantly reminds me that I  need to expand my palette and start liking more foods, or i’m gonna get  diabetes. So that isn’t really helping me either. My biggest concern is  that for the past 2-3 days, i’ve lost a lot motivation to eat and  haven’t really had much in the past few days. And today I just can’t  bring myself to eat at all and i don’t like that. So my question is, am I  developing an eating disorder or am I just in some sort of diet  depression? (idk what to call it)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/m2eqej/request_am_i_developing_an_eating_disorder_or_am/",
  "score": 47,
  "num_comments": 4,
  "comments": [
    {
      "id": "gqjs9yg",
      "author": "highacidcontent",
      "body": "If possible, please get help with this. Even though it's not a full-blown eating disorder yet, it is a potential eating disorder and you definitely have disordered eating habits. I'm also autistic so I relate to the feeling of not being motivated to eat and that's how my ED started.\n\nTry to focus on eating regularly and six times a day/eat once every three hours if you can (I'm not a dietician or anything like that, but that is what my dietician at the hospital has told me is what a human should eat).\n\nIf you have any safe foods (such as the all-time autistic favorite: buttered noodles) try to eat that. I know it's difficult to find the motivation to eat, especially when you're autistic.\n\nAgain, please seek help from a health professional if possible. It's always better to be early than too late. Better safe than sorry.\n\nIf you need anything, feel free to DM me :)",
      "created_utc": 1615449793.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gqkm0c3",
      "author": "ultra_violetttttt",
      "body": "From personal experience with ED and being autistic, it's possible but I cannot diagnose you (I encourage you to reach out to a doctor or therapist) Being autistic can lead us to hyper focus on one thing and become excessive. I know for me, health and nutrition has become one of my special interests and I need to be extremely careful not relapse into ED. The food restriction from obsessiveness leads to the ED (and then the ED fuels the restriction, it becomes a cycle). The are traits about autistics that are similar to those who have an ED, including being goal oriented. These traits are not inherently good or bad, but when our brains (whether you are autistic or neurotypical) learn that an ED behavior is satisfying and relieving anxiety, it uses those traits against you. Also autistics do often get diagnosed with an ED. The casual link isn't clear but there is a strong correlation. \n\nLong story short-it is NOT your fault, and you should definitely reach out for help while you are still aware of the problem.",
      "created_utc": 1615470730.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqky3kj",
      "author": "None",
      "body": "Worrying about the kcal in vitamins is a pretty solid sign of disordered eating (if not a full blown ED). Please seek help, don’t fall into the trap. It will bring you NOTHING but issues <3",
      "created_utc": 1615476610.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqiotae",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1615426485.0,
      "score": 1,
      "context": []
    }
  ]
}