{
  "id": "m3eyzf",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1615545458.0,
  "title": "Request: HA recovery, gaining weight, losing pretty privilege",
  "selftext": "I've lost my period for some months because of calorie restriction for only a year. I've been trying to get into recovery for a few weeks now and I'm seeing changes in my body. My stomach and face is bloated all the time and I tend to binge eat and feel and uncomfortable all day. My weight is definitely increasing and I guess that's the goal but a part of me is still so scared of gaining weight. I feel like I'm not even sick enough to go through this even though I lost my period as I look normal, I'm not underweight and I've not restricted as long as other people going through recovery. \n\nThis is going to sound so vain but I'm also especially terrified of overshooting my original weight because I actually really LIKE how I look after losing weight and people tell me I look good and I know I'm gonna look worse if I put on more weight. It really affects my self esteem. What if I become so fat that people start treating me differently? Pretty privilege from being thin (in my country, thin is preferred way more than curvy/chubby) is REAL and I have experienced it. It's mostly subconscious but humans just tend to treat pretty people better. They get the benefit of doubt, they get served better in healthcare or even just retail/F&B, they get more opportunities for social and career advancements and people just want to be around them more. I'm not discounting personality and hard work but being pretty sure helps in life. And comparing myself and how others treat me before and after weight loss, I guess I only look pretty when I'm thin. I don't know how to let go of my current appearance and am dreading how much worse I'm going to look if I continue with recovery. Sure I might get my period back sure I might not feel cold anymore but there are downsides too due to this pretty privilege thing and my country just views thin as pretty. \n\nI'm filled with anxiety and I don't want to socialize and this is even affecting my grades. Why does going through recovery feel worse than when I was restricting? I could deal with fatigue and hunger but this fear of judgement is truly crushing me. Please help give some advice or reassurance...I don't know how to be positive about this when all I do is worry about how others may subconsciously treat me differently if I get to a point of looking worse just to get my period back. I'm afraid to go all in in my recovery and give in to hunger cues even though I know I have to. I wish I was in a country where there's a more diverse opinion on what's beautiful but not here.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/m3eyzf/request_ha_recovery_gaining_weight_losing_pretty/",
  "score": 61,
  "num_comments": 6,
  "comments": [
    {
      "id": "gqog6ql",
      "author": "_ghostli_",
      "body": "I feel this.. The different treatment we get is the truth and I hate it so much like, “Why am I feeding these people with ‘what’s good to their eyes’” and then continue to fall back in.. These mixed feelings I have like, “Who cares if I’m not beautiful to some, there must be those who would still like me..” then I remember how the people around me telling me, “I think you’ll look prettier sKinNeH..” and had it wired in my head thinking that everyone thinks the same.. I don’t get compliments back then with a bonus of getting bullied for my weight, and now that I’ve lost so much; people start noticing me and I get a lot of compliments.. Like, I am worthy now and why would I wanna lose it ? It’s debilitating.. I’ve considered recovery, but I just don’t wanna go back man.. I guess it all depends on ourselves like, this is going to sound really bad but, I don’t really have anything else and to at least feel likeable is something special to me..\nI’m sorry I couldn’t say much, but to have someone who feels the same is nice..",
      "created_utc": 1615547427.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gqomkml",
      "author": "Enilodnewg",
      "body": "Eating a healthy diet, I think, should take priority over weight goals. In my opinion, it could be triggering going that route and result in relapses and so I don't fall into a different kind of ED\n\nI've had more success focusing on eating recommended foods, wheat bread vs white, emphasis on fruit, veg (leafy greens) and protein to give my body what it needs with vitamins and minerals. No real calorie counting. But wanting stuff that is better as fuel.\n\nMy way works for me, managing and trying to overcome ED is an ongoing thing.\n\nAnd unfortunately we can't change much about society's preference for body type :( I see doctors a fair amount for a neuromuscular condition I have and whenever I weighed in, the female nurses comment 'wow, I wish' when they take my weight and it reinforces bad thoughts. So I've asked my doctors office not to weigh me anymore, my weight has been about the same for the years I've been seeing them and they're ok with me giving an estimate. I don't own a scale, because I focus so much on the numbers, it's just not healthy for me.\n\nAs much as there's societal pressure, I find it most helpful to focus on my personal health and wellbeing. \n\nTalking to a therapist might help with societal pressure. I think a lot of people struggle with that, ED or not. Hard to accept we can't change how others think, all we can control is how we feel about it/ourselves. Self love is surprisingly hard to learn and get the hang of.",
      "created_utc": 1615552705.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gqonc98",
      "author": "RazanTmen",
      "body": "I wish I had something helpful, but I couldn't leave this post without another comment. I feel you on the \"leaning into hunger cues\" mental issue; Again, wishing I had something helpful to add aside from empathy. Been bigger all my life until Covid (3 year relationship fell apart just before the plague, so a perfect excuse to restrict for months on end) - just to add some experience to this.\n\nSomething I'm thinking of leaning into is reverse engingeering my shitty self-image based on comparisons to others. Remember thinspo/bonespo (ugh, 2013 tumblr was gross)? While avoiding the HAES community (b/c it's toxic af), I might try looking for people with my body type who're WERKIN it. Just to remind your subconcious, negative gremlin  brain, especially if you're in a \"comparison\" mindset, that beauty standards are so much more fluid, variable, and subjective than your brain is used to. \n\nIt may sound hollow (probs b/c my own poor self esteem), especially since we don't live in a vacuum (ayyy, #Society TM C R, right?), but you ARE doing so damn well and I'm so proud of you.",
      "created_utc": 1615553240.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gqqopwp",
      "author": "hollyymcknight",
      "body": "Just fully recovered about 3 months ago! For me, it was just shifting my thinking to: “yes, maybe I won’t love the body I end up in as much as I love my current, eating-disordered body, but...... I have two choices. Live a life in a smaller body and feel glad about it, but have to continually think about food, restrict, live a life that is NOT in line with my values. OR. I can live life in a bigger body that allows me to do all the things I want to do Eg social activities, drinking & eating with friends, spend time on my career & other areas that are important to me. \n\nI live in Australia. Thin privilege is a thing. Pretty privilege is a thing. But the life I want to live is much more important to me.",
      "created_utc": 1615588501.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqoe5w0",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1615545458.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gqpvr13",
      "author": "angry-eel",
      "body": "i totally understand the motivation behind prioritizing health over aesthetics! and im happy its working for you! i'd like to add, however, that if you (generally speaking, not directed at this reply in particular) are in a bad headspace regarding weight gain, control, food anxiety, etc then you may risk falling back on \"healthy foods\" as a compromise to your ED. while you may be eating more in volume, if venturing outside of whole foods/diet-y foods is still scary, then you havent truly resolved your restrictive eating habits :( just speaking from experience, because i tried to recover from restriction by getting super into fitness but eating even the tiniest bit of sugar would send me into an anxiety spiral. i'm personally working on self love and being more forgiving towards myself, because i think thats the only way i can overcome my fear of societal judgment from my appearance :) best of luck to everyone who is in, or wants to be, in recovery!",
      "created_utc": 1615574682.0,
      "score": 7,
      "context": [
        {
          "id": "gqomkml",
          "author": "Enilodnewg",
          "body": "Eating a healthy diet, I think, should take priority over weight goals. In my opinion, it could be triggering going that route and result in relapses and so I don't fall into a different kind of ED\n\nI've had more success focusing on eating recommended foods, wheat bread vs white, emphasis on fruit, veg (leafy greens) and protein to give my body what it needs with vitamins and minerals. No real calorie counting. But wanting stuff that is better as fuel.\n\nMy way works for me, managing and trying to overcome ED is an ongoing thing.\n\nAnd unfortunately we can't change much about society's preference for body type :( I see doctors a fair amount for a neuromuscular condition I have and whenever I weighed in, the female nurses comment 'wow, I wish' when they take my weight and it reinforces bad thoughts. So I've asked my doctors office not to weigh me anymore, my weight has been about the same for the years I've been seeing them and they're ok with me giving an estimate. I don't own a scale, because I focus so much on the numbers, it's just not healthy for me.\n\nAs much as there's societal pressure, I find it most helpful to focus on my personal health and wellbeing. \n\nTalking to a therapist might help with societal pressure. I think a lot of people struggle with that, ED or not. Hard to accept we can't change how others think, all we can control is how we feel about it/ourselves. Self love is surprisingly hard to learn and get the hang of.",
          "created_utc": 1615552705.0
        }
      ]
    }
  ]
}