{
  "id": "m56x1j",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1615763556.0,
  "title": "Request: Eating to cope with stress",
  "selftext": "I've been struggling with food habits since I was a teenager. When stressed, I tend to eat whatever I crave in the moment, and it's almost always fast food. I don't cook myself, I end up ordering a lot of food from outside. Besides the weight fluctuations these eating patterns have often given me food poisoning. A huge amount of my income is spent on just these meals.\n\nI've only recognised this pattern in the past two years after seeking therapy for depression and anxiety. I try to let the craving for a certain food pass by but after a few hours, despite being full on a different meal, I end up eating whatever it was I was craving. It is as if I cannot let the thought of it go away until I have it. Lately I don't even feel the satisfaction I think I will after having the meal. \n\nI would like to know if there are any helpful tips that you could share.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/m56x1j/request_eating_to_cope_with_stress/",
  "score": 49,
  "num_comments": 4,
  "comments": [
    {
      "id": "gqzxxbt",
      "author": "Zelda_is_my_homegirl",
      "body": "Are you open to learning to cook? You could pick a food you really like and learn to make it really well. Maybe pick one dish per week to try cooking. There are lots of excellent YouTube videos even for basics like how to boil water. \n\nAlso, fighting cravings doesn’t work. You will eventually cave. I’ve found that trying to hit the same craving with stuff at home helps me. I’m a sucker for fast food tacos. As soon as the craving hits, I’ll make some microwave burritos with some added cheese and hot sauce to make it satisfying. It hits that same craving for a high sodium spicy fast food style meal, but the burritos are $.40 each. If you just eat the thing you crave when the craving hits, you may find you eat less eventually because you’re satisfied more often. It’s the best way to stop the binge cycle even though it can be a little scary. Check out the book Intuitive Eating or The Anti-Diet. I cycle between restrictive and binge behaviors (as most of us do) and it’s like a pendulum. The more you pull over to trying to restrict your eating, the further it will swing in the binge direction.",
      "created_utc": 1615803010.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gqzz3uz",
      "author": "mgrohow",
      "body": "Hello friend, sending a virtual hug to let you know you are not alone and that I can sense your pain. \n\nI do not have any tips because I am not sure advice is what you need. What I think you need is compassion. And I feel a lot of that for you. \n\nDo you like to read or listen to podcasts? I have found some clarity in hearing ED experts discuss ED stuff. They give advice. \n\nOne thing I am trying to learn is that the \"food is a metaphor\" for something emotional or mental we are trying to bury. A thought, memory, or emotion we do not want to feel. I am trying to understand what it is I do not want to feel when I want to reach for food. But that brings up a lot of pain, so I have learned that I have to find other ways to cope--other than the food. Which is not easy and is different for everyone. I am still trying to find coping strategies that are not destructive. \n\nMy only advice is to be kind and gentle with yourself. The food is a way for you to cope that used to work. But it doesn't serve you anymore (or so you say). It is time for us to learn a new way to cope. May you find that way.",
      "created_utc": 1615804206.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gr1dc0o",
      "author": "lavendertheory",
      "body": "Hi! I have this same issue. One helpful tip for me is getting a food subscription to places like HelloFresh. I learn to cook, feel like I'm \"eating out\" because it's not something I'd usually make, and subscription means same cost each time. That's only one suggestion that covers the \"I don't cook myself\" part. I definitely have the craving and lack of satisfaction at the end. Another helpful tip may be to log the amount you spend on meals every time you do it an excel. Seeing the numbers add up always bothered me.",
      "created_utc": 1615831627.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gqygfqi",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1615763556.0,
      "score": 1,
      "context": []
    }
  ]
}