{
  "id": "m7no0n",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1616062238.0,
  "title": "Request: Wife seemingly has an eating disorder but will not acknowledge or talk about it.",
  "selftext": "Years ago my wife (then girlfriend) took an interest in fitness, as did I. We changed our eating habits and started going to the gym regularly. It went well. I lost about 80 pounds and she got in great shape as well. I did not pressure her at all. She started working out first and then I took a good look at my health and decided to commit myself. \n\nIt got to the point where she was going to the gym for 1-2 hours per day and often she would also go to yoga and spinning. That’s not in and of itself a problem but I noticed that she was not maintaining an athlete’s diet, in fact I would classify her eating habits at the time as bizarre, to put it nicely. She ate massive quantities of microwave popcorn. She preferred it burned. If we ordered pizza or something she would put hers in the oven to burn it. The only time I ever saw her eat normal food would be at restaurants and since we had no kids at the time we ate out fairly often. She was really skinny, like to the point where I was not sexually attracted to her. People were asking me if she was OK. Finally I asked her if she was OK. I said “people are saying you have an eating disorder.” She said she’s fine. She kept this up for a long time but eventually the super-odd eating habits (like eating burned food) went away. She continued to exercise 1-3 hours per day, every day. I am aware that “exercise anorexia” is a form of eating disorder but I could not make any headway with her no matter how I approached the subject. \n\nFast forward to when we are married and trying to have a baby. One day I am looking for the source of a plumbing leak so I have to move a lot of things in her bathroom cabinet. I found tampons in there. Like hundreds of them. The oldest were so old they had expired. I talked to her again and she said she has not had a period in “years.” Also, during all this time she refused to go to any doctor other than to get a Pap smear and mammogram. Finally, though, I was able to get her to go to the doctor. They did tests and found hormone issues. She started going to acupuncture. There was this one really strange day where I was sick with norovirus (it makes you vomit) and I told her that my whole system just feels bad for days after a norovirus bout. She asks why. I explain how vomiting effects multiple physiological systems. It throws your whole body out of whack. She got really quiet for a second and asked me why I would say that. I just said I was explaining how I felt and why. I left it at that.\n\nI swear, from that day on she started to gain a little weight (yay) and her periods came back about a month later. She gained enough weight that she had to get rid of all her extra small clothes. Not long after she got pregnant and as far as I could tell maintained perfect nutrition and healthy eating habits. She looked healthy and our daughter was born healthy and perfect. \n\nThings seemed normal while our daughter was breast feeding. We let her self-wean so she occasionally took breast milk all the way until she was 22 months. March 2020. The pandemic started, my wife’s job became 100% WFH. My job is 100% not WFH. It’s like a switch was flipped and everything started all over. We had gotten a Peloton which she would use maybe 1-2 hours a week. That turned into 1-2 hours per day. Her eating habits aren’t as bizarre but I never see her eat anything between the hours of 6am and 8pm. She does not eat breakfast, lunch, or dinner with myself and our daughter. The only foods I see her eat are kale salads with no dressing, black beans, cereal, and cheese-its. That’s not the only food she eats, however. If there are ANY kind of sweets in the house she eats them in secret. One time she went through an entire bottle of maple syrup in 1 week (she was putting it on black beans or cereal.) If I make a frozen pizza she eats whatever is left of it as soon as I go upstairs to give our daughter a bath.\n\nOK, I concede she needs a lot of calories due to the amount and intensity of her workouts. The thing is she looks very unhealthy again to the point where one of her friends asked me if she was OK. \n\nSo I decide I need to have the talk. Turns out an opportunity soon arose. I go upstairs to go to bed a short time after she has gone up. Right away in the bathroom I know something is wrong. It smells like vomit. I look in her sink and it has vomit in it. I go to her and ask if she’s OK. She says yes, of course, why even ask? I say “because there’s vomit in the sink. You threw up.” \n\nShe said it was “colored spit” from brushing her teeth, not vomit. I tell her I don’t believe that. I brush my teeth the same way and my sink does not look like that. She says “I don’t know what to tell you.” \n\nAnother time I came home from work, went to use the bathroom, opened the toilet and it was full of what looked like vomit. If her bowel movements look like what I saw then she needs to see a doctor. Same conversation...same result. Denial. Won’t see a doctor. Won’t go for a checkup (she’s 38.) \n\nLast night I came downstairs from putting our daughter to bed at 9:30 and my wife ate cereal, popcorn, crackers, and black beans continually until 10:15. Seriously, she ate without pause and it was making me uncomfortable after awhile. Just bowl after bowl of food. Furthermore, if I ate like that she would check me over it.\n\nI don’t know what needs to happen here. I need to add that my wife does not respond to authoritative rhetoric. She grew up with a “my way or the highway” type of stubborn asshole for a father and if I take that kind of line with her she shuts down. \n\nShe’s highly educated and intelligent. If she has an eating disorder she fully knows it and is choosing to continue. My opinion is strongly that she has an eating disorder but I don’t have any proof other than what I’ve observed now and in the past. I am trying to give her a wide berth and be supportive because she is under a lot of duress from the social isolation and from work stress. \n\nI am just totally lost and mentally exhausted. I do most of the housework and chores. I do all the cooking. I do all the dishes. I do 80% of the childcare including all bedtimes, baths, and naps. I work a full time director-level job. I want to help her but I just feel like I do not have the mental energy to be the one who puts the puzzle pieces together to reach any kind of solution with her. Sometimes I feel like she left the vomit out for me to find as a cry for help but when I went right to her about it she just denied, denied. \n\nAny help or support would be appreciated. I am aware this is a mental illness and not a choice and I want to help her get treatment.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/m7no0n/request_wife_seemingly_has_an_eating_disorder_but/",
  "score": 128,
  "num_comments": 10,
  "comments": [
    {
      "id": "grchfm4",
      "author": "ThatUnicornPrincess",
      "body": "There's no way in my mind she doesn't have an ED. The only really kind thing my ex husband did for me was confront me about this. He went about it the wrong way with a friend who attacked and shamed me, but he helped me in the process after. Maybe a couples therapy session? There's a lot of internal shame around eds, guilt, denial, feelings of helplessness ans hopelessness. I still have bad body dyspmorphia, but don't binge/ purge, or restrict. At the peak of my bulimia/ anorexia, what I would let myself have and not throw up was apples, salads, and occasionally a turkey sandwich. I ate a lot more food than that, mostly unhealthy, but would purge at least 5 x a day. Over 10 years later I still struggle with dental health and metabolism, and am terrified ill have throat/ esophageal cancer when im older. Please please please reach out to a mental health professional to help your wife. Therapy is the only way out of this. Im wishing you and your wife strength and success. In addition, I found out my mom was bulimic before she had me and restricted while she was pregnant with me. The attitudes towards her body have a very good possibility of being passed on to your daughter by the way your wife views and might talk about herself. Even unspoken things can effect your daughter's attitude toward herself. Wishing your family the best!!",
      "created_utc": 1616069945.0,
      "score": 48,
      "context": []
    },
    {
      "id": "grchn29",
      "author": "houston_veronica",
      "body": "I am so sorry, OP. I can see that your wife is not well, and while I am not an MD, I am an adult who has struggled with severe restrictive AN for about 16 years. About 3 years ago, almost, my fam. did an intervention - I was at a gravely low weight, and they were honestly fearful for my life. I myself am not sure how I did not collapse or die. It was like a miracle that I lived, but my only \"good\" factor was that I still ate, even though it was every 2.5-3 days, and I also grew up perfectly healthy with regard to food/etc. My marriage was the cause of the stress that I believe opened the ED path for me. The \"gun\", as they say, was loaded, but my stressful marriage which has been emotionally abusive, was the trigger. In your wife's case, there is something that she is struggling to deal with, and this ED has become a coping tool. (I say \"ED\", but that really needs an MD diagnosis). These things are possible hallmarks of EDs:\n\n* Denial, refusal to see a problem;\n* eating strange things, strange combo's, serious extreme flavor methods like vast amounts of salt or pepper, burning foods is not uncommon; for ex, I ate a lot of dark chocolate powder on everything.\n* souping food: adding water to foods to make it go further\n* overexercise, refusal to take a break day, refusal to miss routine to the point that if someone were to be rushed to the hospital for an accident, the ED'd person would still complete their workout before caring for the person that fell ill. (just an example)\n* missing out on all meal opportunities with people\n* ritualizing food\n* angry, irritable\n* no periods  (BUT a period is still possible if people have AN or any ED).\n* binge-eating, throwing up are possible (bulimic behaviors)\n* insanely angry if someone raises the concern; total denial\n* feels they are in jeopardy of being overweight, flabby, or \"still have to get their \\[name a body part\\] in better shape\".\n\nOP, you are not responsible, nor are your circumstances; this is a MENTAL illness. Likewise, your use of the word \"choosing\" is misguided, with all due respect; she cannot quit this alone, it's bigger than she is. Help is needed. You're not required to stay married to her, but if you are willing to support her in any capactiy, your gift could save her life.\n\nPlease contact any of the resources provided on this link:\n\n[https://www.nationaleatingdisorders.org/help-support/contact-helpline](https://www.nationaleatingdisorders.org/help-support/contact-helpline)",
      "created_utc": 1616070033.0,
      "score": 31,
      "context": []
    },
    {
      "id": "grchf68",
      "author": "rcishannah",
      "body": "I would defiantly have a moment where you just sit down with her and let her know it's alright- really mention how you are concerned and worrying about her.",
      "created_utc": 1616069940.0,
      "score": 13,
      "context": []
    },
    {
      "id": "grcm8tf",
      "author": "brokenautonomy",
      "body": "So it sounds like she knows she’s struggling but hasn’t accepted that she needs help yet. There aren’t a lot of options right now, especially with quarantine limiting social interaction, but I’d say your best bet to get through to her would be emotional appeal. For example(simplified): “I need to sit down and have a conversation with you and I’d really appreciate if you could listen until the end before responding. I’m really worried about you because (reasons) and I’m not the only one who’s noticed. People are asking if you’re okay, and I don’t think you are. I know we both want to be there for our daughter as she grows up, and be there for each other as spouses. For our family’s sake, I need things change, and I know it won’t be instant, but I want to help you get there.” Obviously not word for word, but these are some ideas that she’ll probably care about more than just her own health or wellbeing. Also make sure she knows that you love her, that you know she’s independent, intelligent and capable as a person, but that this can’t stand.",
      "created_utc": 1616071739.0,
      "score": 10,
      "context": []
    },
    {
      "id": "grdj36d",
      "author": "ClickedUnsend",
      "body": "I am so sorry you are going through this. I had restrictive anorexia and very extreme binge/bulimia for years (though I ate everything), my husband was mostly silently complicit - he did occasionally challenge me over discoveries very similar to yours, but I would always explain them away, or cop to an isolated incident (he was aware I had been treated for eating disorders through my teens and early 20s). Truthfully, during COVID I began to feel trapped by my own behaviours and aware that they were taking me away from the people I loved (EDs take a lot of time to maintain) it was almost a relief when he physically caught me.  I got treatment over the end of 2020 and am doing much better (though I may never be recovered - I consider myself in recovery). \n\nI could not have been pushed to recover before I was ready and before I was in ownership of the process. You can make someone go to therapy, or residential treatment but you can’t make them recover - that has to be on them. You are not responsible for her health or happiness and you may have to find a way to healthily detangle yourself from her emotional state. This does not mean you shouldn’t care, but more you need to protect your own health and happiness too. The more you try to fix her and enable her, the less likely she will have to confront the misery and consequence of her own actions. \n\nIt sounds like your wife may have some form of AFRID that is driving her behaviours. You may get some traction talking to her about that - bulimia is so shameful to individuals that discussing it will always be the most difficult path. Food fear is easier. Say you are sad to see her missing out on so many foods that are healthy and delicious, ask her how she feels about it. Always ask about the emotional state and not the behaviour. If she owns to becoming more narrow in her food choices out of fear - it could open a dialogue into “safe foods” and perhaps she may be able to create more balanced meals that she can always have without question.\n\nStop doing all the chores. She is a responsible adult. Whilst ever you “save” her from facing the consequences of her actions on her own she will not find the desire to change. If things get left undone, leave them undone and remind your wife of her responsibilities. Set consequences and stick to them. Always stick to them. This doesn’t mean ultimatums but reasonable measures to protect you and your child. (I cannot continue to do all the childcare and work, I love you and I care about your health. if things continue undone I will take our daughter and stay with relatives to provide the care she and I need and give you the space to focus on your health) (I am concerned about the food behaviours being modelled to our child, if you are feeling compelled to eat in a fashion you would not like to see our daughter copy, in future I ask that you let me know and I will make arrangements to remove her at that time) etc. \n\nIt seems harsh but it should be done in a loving and respectful way. \n\nOther than that I am just so sorry for you and your family and I hope your wife finds some measure of peace, EDs are NEVER really about food. I hope she finds her root.",
      "created_utc": 1616083177.0,
      "score": 9,
      "context": []
    },
    {
      "id": "grdv5e3",
      "author": "smthingconspicuous",
      "body": "Hi OP - so sorry to hear you're going through this with your wife. It seems like she is really struggling and therefore so are you. \n\nAlthough I agree with [houston\\_veronica](https://www.reddit.com/user/houston_veronica/) in saying that I am also not an MD and therefore cannot give a diagnosis, this sounds like a textbook ED. You are observant to notice some of these things, and to that I give you major credit. You sound like you really care for you wife a lot and are doing the right thing by seeking help and advice. Just so you are prepared, you probably know that you have an uphill battle in front of you by confronting your wife and challenging her on her habits. This will cause some resentment for a time (maybe not, but with most it does because of the difficulty it takes to acknowledge an ED) but you are doing her a great service. The burning of food and weird combinations is almost a dead giveaway (this is usually rationalized by thinking that by burning the food, you are reducing the caloric intake). There is something that happens in the brain of those that have had ED's where they rationalize and only pair certain foods together and becomes very ritualistic (for example, I would time when I would drink my water as to not get bloated and would only drink broccoli water after steaming it and eat the broccoli - super weird). \n\nTherapy is a must for both you and her to work through this. I truly give you the best of luck and hope your wife gets better!",
      "created_utc": 1616087946.0,
      "score": 4,
      "context": []
    },
    {
      "id": "grgq55s",
      "author": "Rheevalka",
      "body": ">She’s highly educated and intelligent. If she has an eating disorder she fully knows it and is choosing to continue.\n\nNo one chooses to continue an eating disorder, it's because they feel like they have to. EDs happen to substitute for something they're missing. Like overeating can be because they don't get food often and don't know when their next meal is, so they stuff themselves to protect themselves; or it can be that they don't receive a lot of affection and replace food as comfort. Under-eating is a reaction to a lack of control or severe body dysphoria. No one does these things because it's a hoot and a half to, they do it because in their minds, if they don't, will lose whatever they wanted to replace with their control over food.\n\nAlso, your wife may be educated, but not seeking help or not knowing you have an ED is not a sign of stupidity.",
      "created_utc": 1616147817.0,
      "score": 2,
      "context": []
    },
    {
      "id": "grc5bu6",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1616062238.0,
      "score": 1,
      "context": []
    },
    {
      "id": "grf99hv",
      "author": "Total-Guava",
      "body": "Just be supportive ❤️\n\nMaybe talk to her mother?",
      "created_utc": 1616111075.0,
      "score": 1,
      "context": []
    },
    {
      "id": "grftj64",
      "author": "Spicy_burrito107",
      "body": "I’m sorry you’re going through this and she definitely seems to struggle with an eating disorder. I think you need to take care of yourself too and I think secrecy and the unknown seems to be a problem for you. Being open and honest about everything to my partner relieves most of the stress, but she needs help. She has a mental illness you have to remember and the behaviors and physicality is just a symptom of a lot of pain. Sickness and health is the vow I believe, listening and trying to be someone who she can come to and not worry about being scolded for it is a huge big step. Does she feel comfortable coming to you with problems? mentioning you’re worried and should get help is most you can do until she decides to get better, then you can support more with that but for now if you want to truly know her inside and out you have to dive deep into the disorder and its roots, start by listening and knowing that it’s not her, it’s the illness and that’s not her fault. Support and constant love and forgiving can help someone get to that point. A lot of people with eating disorders feel lonely, sad, unheard, invalid.. so try to validate. It’s not an easy journey for sure... especially not for you, I’m sure it’s so so hard to see. For the chores and stuff, she’s probably exhausted and maybe it’s too a point where she needs inpatient to be able to function more, and children do see and pick this stuff up. It’s a tough situation for sure. Hang in there",
      "created_utc": 1616121762.0,
      "score": 1,
      "context": []
    }
  ]
}