{
  "id": "ma1gp3",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1616347585.0,
  "title": "Request: meeting up with my husband's friend and his wife that we haven't seen in years",
  "selftext": " \n\nI  am thinking of meeting up with my husband's friend and his wife that we  haven't seen in years. We had issues in the past with jealousy that she  had towards me and it was during a stressful time in my life with my  ED. I had an extreme ED that kept me very thin but also very ill. No one  knew about the ED, they just saw a very thin woman. We moved away and I  gained a lot of weight back once I sought help for the ED. The weight  gain changed my appearance dramatically and my self-esteem got much  lower. I have since lost some of the weight that I gained but still am  much heavier than when I last saw my husband's friend and his wife. I am  worried to see them again after all these years because I have since  gained a lot of weight and no longer feel like the 'catch' that I once  felt. I feel better now that my ED is under control, but I still feel  apprehensive about seeing them again because I don't want to be made fun  of. This anxiety of seeing them again doesn't necessarily make me want  to relapse with the progress I made with the ED, but it definitely makes  me consider it sometimes. How would you handle meeting with people from  your past that only knew you as thin because of your ED? Would you be  embarrassed to meet with people due to extreme weight gain? Is it common  for people to feel this way after gaining weight from an ED? I just  feel so hopeless and nervous.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ma1gp3/request_meeting_up_with_my_husbands_friend_and/",
  "score": 42,
  "num_comments": 6,
  "comments": [
    {
      "id": "grq787q",
      "author": "Zelda_is_my_homegirl",
      "body": "Hi OP! I totally understand those thoughts, and our diet culture society reinforces them. \n\nI think that people are less concerned than you might believe about your weight. It is a big deal to you, because it is you. They will probably notice you look different if it’s a significant change, but I don’t think making fun of you would be the response you’d receive. In fact you may find that she feels more comfortable around you, because unfortunately, many women feel threatened by someone who is thinner than them. \n\nYou may also not realize that you probably also look happier and full of life. \n\nAt my sickest I wasn’t really thin, but it was thin for me. When I entered recovery, I gained some weight. I am what some people would consider “overweight” at this point, and my boyfriend has told me how much healthier and vibrant I look. My skin, hair, nails. My smile, my lower stress, etc. \n\nYou are so much more than your weight, and many people will be able to see those things. If she can’t see past it or holds it against you in some way it is because they are fatphobic and can’t properly cope with those feelings. That is not on you and the body you live in. That is on her and her own insecurities.",
      "created_utc": 1616352151.0,
      "score": 22,
      "context": []
    },
    {
      "id": "grq2nld",
      "author": "alltheraeeupinyou",
      "body": "Hi there!! Firstly, I just want to send you hugs and some love and light. Because I haven’t found recovery yet, I’m unsure my answers will be most fitting for your situation. I too often feel embarrassed and nervous even seeing family (well, especially family because weights a huge issue), but it’s something I’m still not comfortable with. My biggest suggestion would be to speak to your husband prior to the gathering. Make him aware of some vulnerability and anxiety you’re feeling. I have learned that being open with my partner as I’m trying to navigate new feelings emerging, has helped, and allows him to offer better support. Regardless, I hate that you feel uncomfortable and wish you the best in whatever you decide!! Xx",
      "created_utc": 1616349928.0,
      "score": 9,
      "context": []
    },
    {
      "id": "grs40r9",
      "author": "anonymousmrtaco",
      "body": "This is my first ever post/reply on here so I doubt you will see this but... I feel this same way. I was super thin in college because I would not eat anything, I couldn’t. Now that I found a great guy, I gained all my weight back, plus some. I don’t hang out with any of my college friends anymore cause I don’t want them to see me like this. We make plans but then I cancel right before because I get too worked up about how I look. I am looking forward to these responses that people give OP because I am hoping to take something from the responses as well. \n\nI want to tell you this because no one ever tells me this.. I don’t know who you are, I don’t know what you look like. But please know you are more beautiful now than ever!",
      "created_utc": 1616388888.0,
      "score": 6,
      "context": []
    },
    {
      "id": "grpxpis",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1616347585.0,
      "score": 2,
      "context": []
    },
    {
      "id": "grq6a2o",
      "author": "Zelda_is_my_homegirl",
      "body": "From someone in recovery, this is great advice! Being open about vulnerabilities during those situations is incredibly helpful. \n\nHope you find your way to recovery in the future. <3",
      "created_utc": 1616351687.0,
      "score": 5,
      "context": [
        {
          "id": "grq2nld",
          "author": "alltheraeeupinyou",
          "body": "Hi there!! Firstly, I just want to send you hugs and some love and light. Because I haven’t found recovery yet, I’m unsure my answers will be most fitting for your situation. I too often feel embarrassed and nervous even seeing family (well, especially family because weights a huge issue), but it’s something I’m still not comfortable with. My biggest suggestion would be to speak to your husband prior to the gathering. Make him aware of some vulnerability and anxiety you’re feeling. I have learned that being open with my partner as I’m trying to navigate new feelings emerging, has helped, and allows him to offer better support. Regardless, I hate that you feel uncomfortable and wish you the best in whatever you decide!! Xx",
          "created_utc": 1616349928.0
        }
      ]
    },
    {
      "id": "grqtbsq",
      "author": "alltheraeeupinyou",
      "body": "🥺thanks so much",
      "created_utc": 1616363243.0,
      "score": 3,
      "context": [
        {
          "id": "grq2nld",
          "author": "alltheraeeupinyou",
          "body": "Hi there!! Firstly, I just want to send you hugs and some love and light. Because I haven’t found recovery yet, I’m unsure my answers will be most fitting for your situation. I too often feel embarrassed and nervous even seeing family (well, especially family because weights a huge issue), but it’s something I’m still not comfortable with. My biggest suggestion would be to speak to your husband prior to the gathering. Make him aware of some vulnerability and anxiety you’re feeling. I have learned that being open with my partner as I’m trying to navigate new feelings emerging, has helped, and allows him to offer better support. Regardless, I hate that you feel uncomfortable and wish you the best in whatever you decide!! Xx",
          "created_utc": 1616349928.0
        },
        {
          "id": "grq6a2o",
          "author": "Zelda_is_my_homegirl",
          "body": "From someone in recovery, this is great advice! Being open about vulnerabilities during those situations is incredibly helpful. \n\nHope you find your way to recovery in the future. <3",
          "created_utc": 1616351687.0
        }
      ]
    }
  ]
}