{
  "id": "mb18xk",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1616456585.0,
  "title": "Request: Afraid and discouraged to workout due to people constantly telling me I have an ED",
  "selftext": " \n\nI did struggle an ED when I was a kid but that was only because I hated my body and had no nutrition knowledge at all so I did what was logical to me at the time which was restriction and over exercising . I no longer think like that and understand I need food to function. Im able to eat like \"normal\" even things that I would've considered bad foods before without feeling guilty.\n\nI do however still struggle with my body in the fitness sense, Im trying to improve my performance and strength. But everybody is always so negative to me and treats me like Im still deep into an ED and Im hardcore restricting when it simply isnt true. It makes me really doubt myself and overeat till the point where I feel sick because Im scared I might still be restricting without realizing.\n\nThe effects it has on my exercise habits are the worst tho. I really love dancing and I used to do it all the time as my main source of cardio but also because it was fun and I could just spend the whole day doing it. But now whenever Im bored and I get the urge to dance I stop myself from doing it because I dont want to slip back into my ED. I've been told that exercising all day is just unhealthy no matter how much I might enjoy it.\n\nHow the hell do I break free of this mindset? It makes me so depressed to not workout or to just do the bare minimum.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mb18xk/request_afraid_and_discouraged_to_workout_due_to/",
  "score": 59,
  "num_comments": 7,
  "comments": [
    {
      "id": "grvdze8",
      "author": "holiday_armadillo21",
      "body": "Nobody else understands what is healthy or disordered for YOU. People make the mistake of thinking that \"healthy\" looks the same for everyone. This is exactly the kind of behavior that contributes to eating disorders. \n\nListen to your body. There are ways to know if you are eating enough. Do you have the energy to carry out your everyday lifestyle? Do you feel satisfied at meals? At no point do you need to ask yourself, \"would X person consider this enough?\"\n\nAnd about exercising too much: yes, sometimes exercising too much can be a sign of disordered eating or a similar issue. But that's for you to evaluate. Why do you dance all day? Do you feel the need to dance all day in order to eat without guilt? Because that may not be healthy. But are you dancing all day because it gives you joy? There's nothing wrong with spending hours doing the things that give you true joy. \n\nMy school principal gave us this little nugget: \"God has given us two ears. Take the noise in through one ear, send it out the other.\" Listen to yourself and not others who don't know you, your body, or your mind.",
      "created_utc": 1616457211.0,
      "score": 19,
      "context": []
    },
    {
      "id": "grw37qo",
      "author": "None",
      "body": "If you would enjoy the activity and you're not using it as a way to purge calories, you should be able to do it! Obviously you may want to consult with your doctor, but it sounds like your motivation for it has changed and you should be able to move your body in a way that feels good and makes you happy\n\nI feel like getting past the attitude would require you to know yourself and your motivation. So asking yourself, am I eating when I'm hungry or am I ignoring my body's signals? Do I want to move because I enjoy it or because I feel guilty?",
      "created_utc": 1616470627.0,
      "score": 3,
      "context": []
    },
    {
      "id": "grwsrcl",
      "author": "houston_veronica",
      "body": "I think the advice offered is so sound, but my one thought is that you may need support -- whether it's a person you see professionally, or just a mentor at school, or perhaps in church or another place that you feel has people of like mind and values.\nI think you are being so strong, but also very hard on yourself! I admire your resolve against the demon known as ED, but you are doing SO well -- to be this staunchly against any potential relapse means you are kicking the butt of ED! And that is to be celebrated -- now be confident, and yes, be cautious - but talk to people who can give you perspective. There HAS to be someone who isn't all about \"are you relapsing!?\" -- \nOn the other hand: if you think there is a kernel of truth in their concerns, be willing to think about what moderation in exercise - even dance - will be like for you, and set some boundaries. It's so hard, but you can do this. You are incredibly brave.",
      "created_utc": 1616491744.0,
      "score": 2,
      "context": []
    },
    {
      "id": "grvcr5d",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1616456585.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gry2wr4",
      "author": "Reality_Rose",
      "body": "Dance to your heart's content. I'm sorry other people are making you overthink your love of dance. \n\nI am a pole dancer and aerialist struggling with bulimia and I struggle with hiding when I'm over exercising. For me, the key is to focus on why I'm doing it (training new tricks, working on a routine, or prepping for class VS because I binged or am feeling bad about my body) and focusing on how my body feels. I work not to push myself to the point of exhaustion because it will lead to injury and not to exercise as a way to purge. As long as I'm managing those two, I try not to overthink working out.\n\nI hope it helps to know you're not alone. If you ever want to vent, feel free to message me. I think it would also help to be able to surround yourself with people who support your passion for dance while also understanding how to do it in a healthy way.",
      "created_utc": 1616517787.0,
      "score": 1,
      "context": []
    },
    {
      "id": "grwsk6i",
      "author": "houston_veronica",
      "body": "Beautifully stated. Thank you for this comment!",
      "created_utc": 1616491542.0,
      "score": 3,
      "context": [
        {
          "id": "grvdze8",
          "author": "holiday_armadillo21",
          "body": "Nobody else understands what is healthy or disordered for YOU. People make the mistake of thinking that \"healthy\" looks the same for everyone. This is exactly the kind of behavior that contributes to eating disorders. \n\nListen to your body. There are ways to know if you are eating enough. Do you have the energy to carry out your everyday lifestyle? Do you feel satisfied at meals? At no point do you need to ask yourself, \"would X person consider this enough?\"\n\nAnd about exercising too much: yes, sometimes exercising too much can be a sign of disordered eating or a similar issue. But that's for you to evaluate. Why do you dance all day? Do you feel the need to dance all day in order to eat without guilt? Because that may not be healthy. But are you dancing all day because it gives you joy? There's nothing wrong with spending hours doing the things that give you true joy. \n\nMy school principal gave us this little nugget: \"God has given us two ears. Take the noise in through one ear, send it out the other.\" Listen to yourself and not others who don't know you, your body, or your mind.",
          "created_utc": 1616457211.0
        }
      ]
    }
  ]
}