{
  "id": "mcmpy4",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1616636542.0,
  "title": "Request: Triggered by a Treatment Provider",
  "selftext": "Has anyone ever been triggered by  a treatment provider?  I see a nutritionist who specializes in eating disorders. She and I have butted heads before because her inability to acknowledge that when I am significantly overweight (from binge eating) I am not able to physically do the activities that make me feel happiest and most powerful.  This has led to me, in the past, hiding things from her.  I use a lot of her strategies, but sometimes I also listen to myself and my own needs.\nThis worked very well, and I was very regulated, until a number of life stressors came up and general wear down of the pandemic. An area that we have been working on (while I was regulated) was drinking more water, since I only ever drank Coke Zero.  In order to help this goal, I bought this super tech-y water bottle that weighs what you drink so you know when you achieve a water goal. This made me feel super good about myself, and I was drinking water for the first time in my life (at 28). It was a measurable accomplishment each day, and my physical problems due to not drinking water (head aches, exhaustion, cravings) were mitigated.\nIn my session with my nutritionist, I was so excited to tell her about the whole water bottle development, and her response was super disappointing. She said, \"Well I don't want you to fixate too much on the number.\" I totally get why this strategy is good for eating disorder when we're talking about calories and weight, but really? Water? Imo, striving to drink water when I literally drank zero water before was a big win in terms of my overall health.\nAnyway, this was the straw that broke the camels back. After that session, the water bottle use immediately tapered off and I am going days without drinking water again.  Binges and even purging started again, and my weight started to climb. I know this isn't her fault, but I am so frustrated by her attitude and how she could have thought that was the right thing to focus on.\nHas anything similar happened to anyone else? I am going to work to get myself more regulated (therapy tomorrow!), but I just don't know how I can continue with that nutritionist.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mcmpy4/request_triggered_by_a_treatment_provider/",
  "score": 52,
  "num_comments": 13,
  "comments": [
    {
      "id": "gs4uwgw",
      "author": "Frosty-Dragonfruit80",
      "body": "I think she was coming from wanting you to avoid rigidity and numbers which eating disorders thrive off. It’s not that water is bad at all and that’s awesome you were making real progress with that, she probably wants it to be more intuitive but tbh you don’t sound like that is where you are at atm (and that’s fine!). You have to be super honest and explain when things hurt your feelings- whenever something rubs me the wrong way with a dietician or psychiatrist or psychologist I immediately bring it up as often it’s just miscommunications. All the best x",
      "created_utc": 1616645414.0,
      "score": 31,
      "context": []
    },
    {
      "id": "gs52r59",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1616651052.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gs5q1js",
      "author": "houston_veronica",
      "body": "OP, I am really sorry you went through this. It's so deflating, and she should be proud of you - expressly so. If she had trouble reconciling the fact that you'd be potentially fixated on numbers, she could have said it really objectively. \"OP, that's awesome that you are drinking more water - what an accomplishment, considering you were so into DC for so long. YAY! Let me just mention that there CAN be a potential caveat if using metrics that provide specific data like your bottle: they can sometimes  re-ignite those tendencies to focus solely on numbers, which can build rigidity. I have no problem and am in fact proud of you for this development, and I trust you to  be balanced. Great job.\"",
      "created_utc": 1616671920.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gsm2rnx",
      "author": "shahbothe",
      "body": "I definitely relate with you. I ghosted my old psychologist because anytime I would bring up even small accomplishments, he would bring up what I'm still not doing and constantly remind me of what I need to fix. He did try to encourage me, but I found myself leaving these sessions feeling worse. I agree with the others that if you do want to continue seeing this provider, it would benefit you to let them know their approach is not working for you. They probably say these same things to their other clients and it doesn't affect them the same way. That doesn't mean how they make you feel isn't valid, it is. It's very much like when a guardian disregards your good grades and only focus on your poor ones, it's discouraging and counter productive. You're the one in treatment, you are in control here. Don't be afraid to speak up and steer the sessions in a direction that benefits you. Good luck ♡",
      "created_utc": 1616961601.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gs4s9xi",
      "author": "anagramqueen",
      "body": "\"I know this isn't her fault\"\n\nOn the contrary, I would say that it is her fault. She hurt you by failing to validate something that was exciting to you. That led you to return to previous behaviors.\n\nI understand why she said what she did. Fixating on numbers can definitely become a problem, but that's the key phrasing here: \"can become.\" It hadn't become a problem yet and there was no guarantee that it ever would. She was doing something I call pre-treating. Approaching someone about a problem that doesn't even exist yet. In my experience this can be especially hurtful because it lands somewhere on the spectrum between insulting and condescending. The insult comes from the assumption that it will become a problem. The condescension comes from the assumption that you need her to point this out; that you wouldn't be perfectly capable of recognizing the problem yourself. And in your case, I think a lot of the lingering hurt probably comes from the fact that she took away your water bottle joy. \n\nIf you're up for it, I would try to have a conversation with her. Chances are she genuinely has no idea that what she said hurt you. The conversation might be helpful to patch up wounds and prevent similar events from happening in the future. If not, if she doesn't react well, you might want to start searching for a new therapist/nutritionist. I know the process of therapist hunting can be stressful, but in the long run you really need someone who's going to set you forward in your treatment, not back. \n\nBasically, she was wrong to say what she did and I'm really sorry she took away your water bottle joy. For what it's worth, I think the water bottle was a great idea! It sounds fun, too. I really like the idea of tracking water intake throughout the day. I need to be better about that myself haha. I hope you're able to start it up again. Sending hugs.",
      "created_utc": 1616643768.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gs4royd",
      "author": "CreditAnxious",
      "body": "I feel like my binge eating gets dismissed bc I don’t look fat when in reality I am. I look skinny with clothes on but I have a high body fat percentage",
      "created_utc": 1616643412.0,
      "score": -5,
      "context": []
    },
    {
      "id": "gs4f38l",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1616636543.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gs56viv",
      "author": "Carodactyl",
      "body": "That’s interesting, while I was in treatment they told us the expected minimum number of ounces we had to drink every time we sat at the table and we had to meet that goal in order to get up. That was the only number we were allowed to know, actually, and it was helpful for me to see what a healthy body might actually need in a measured out way. I’ve never seen someone say not to focus on the number with water before, I wonder why she thinks it’s a bad thing? Other than rigidity, which is probably something to work out w a therapist instead of her if it’s occurring (which it didn’t sound like it was anyway). Anyway, I think that’s odd of her and I’m sorry it happened! Your water bottle sounds cool and I high key want one, I’m not great at drinking enough",
      "created_utc": 1616654592.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gs6d1oj",
      "author": "Quarter_Straight",
      "body": "Yeah she called me obese but said I don’t look like it but my BMI said I was, this really bummed me out and I have since been struggling with my own ED",
      "created_utc": 1616683870.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gs52uxk",
      "author": "rghaddar",
      "body": "Yes to this! Big time. We need to normalize discussing our feelings toward the people that are literally hired to help us feel better.",
      "created_utc": 1616651141.0,
      "score": 18,
      "context": [
        {
          "id": "gs4uwgw",
          "author": "Frosty-Dragonfruit80",
          "body": "I think she was coming from wanting you to avoid rigidity and numbers which eating disorders thrive off. It’s not that water is bad at all and that’s awesome you were making real progress with that, she probably wants it to be more intuitive but tbh you don’t sound like that is where you are at atm (and that’s fine!). You have to be super honest and explain when things hurt your feelings- whenever something rubs me the wrong way with a dietician or psychiatrist or psychologist I immediately bring it up as often it’s just miscommunications. All the best x",
          "created_utc": 1616645414.0
        }
      ]
    },
    {
      "id": "gs6y16z",
      "author": "Simplicityobsessed",
      "body": "Do you have any experience working with individual with a history of ED and GI issues? I’ve been thinking about seeing a nutritionist or dietician to help my weight gain, esp since my ED has been triggered but I am hesitant since I can never see one that can validate both sets of complicating factors.",
      "created_utc": 1616692368.0,
      "score": 1,
      "context": [
        {
          "id": "gs52r59",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1616651052.0
        }
      ]
    },
    {
      "id": "gs55wck",
      "author": "OnMyHighHorse13",
      "body": "Especially because they are also human beings who have bad days and make mistakes. Training and experience for them to make them better, a bit of understanding from the patients too",
      "created_utc": 1616653729.0,
      "score": 8,
      "context": [
        {
          "id": "gs4uwgw",
          "author": "Frosty-Dragonfruit80",
          "body": "I think she was coming from wanting you to avoid rigidity and numbers which eating disorders thrive off. It’s not that water is bad at all and that’s awesome you were making real progress with that, she probably wants it to be more intuitive but tbh you don’t sound like that is where you are at atm (and that’s fine!). You have to be super honest and explain when things hurt your feelings- whenever something rubs me the wrong way with a dietician or psychiatrist or psychologist I immediately bring it up as often it’s just miscommunications. All the best x",
          "created_utc": 1616645414.0
        },
        {
          "id": "gs52uxk",
          "author": "rghaddar",
          "body": "Yes to this! Big time. We need to normalize discussing our feelings toward the people that are literally hired to help us feel better.",
          "created_utc": 1616651141.0
        }
      ]
    }
  ]
}