{
  "id": "miheuj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1617358584.0,
  "title": "Request: I fell into a hole of binge eating, and I just wanna dump my thoughts somewhere sorry",
  "selftext": "disclaimer : this post is going to be all over the place, i don't even know why i'm writing it or what i want to say. i guess i just wanna dump my thoughts lmao sorry in advance I've (21F) always had a really unhealthy relationship with food but it's been getting worse lately. I either completely stop eating and survive on a couple of coffees a day, or I eat big portions all throughout the day (even when i'm not hungry). Last year, when covid first started and my country went through its first lockdown, I was going through one of the worst periods of my life. I was suicidal and could barely do anything. Naturally, I wasn't eating at all. I live in a muslim country though, and it coincided with ramadan (fasting month), so my family wasn't really worried. I was also working on my capstone and could only work with a nocturnal sleeping schedule, so they just assumed I was eating when they were asleep. I was also obsessively working out. I lost xx kgs during that period and i've never gotten so many compliments. Neighbors i've never spoken to and distant acquaintances were telling me how better I looked after losing the weight. I happily took the compliments and ignored the fact that not eating fucked up my body and my physical and mental health. Fast forward a couple of months, I'm done with my capstone, I'm doing a master's and I'm heavily stressed. I stopped working out. I kept the weight for a bit, and I stupidly thought \"maybe my metabolism is working great now\". But the more stressed I got, the more I ate, and the more weight I gained. I started to hide food in my closet and binge eat it in hiding and then cry afterwards (this is one of those instances rn). It is now a year later after i lost the weight and I gained more than half of it back. I've never hated my body more. And I have no one to talk to about it. Every single one of my friends (even my boyfriend) is skinny. I have a best friend with whom I had shared my struggles last year, but I can't bring myself to talk to her about this right now. I know she would never judge me but I'm so terrified of her thinking that i'm a disgusting pig that i would just rather her think that i'm still starving myself. Ramadan is in 2 weeks and all i can think about is \"maybe I can get back on track !! maybe i'll be able to lose that weight again!!\" (disclaimer : pls no one make any comments about how this month is not about weight loss. i know. leave me be.). I made an appointment with a psycho-nutritionist to help me lose weight in a \"healthy way\" (???), but it's not until mid-may, i don't know what to do til then.\n\n&#x200B;\n\nidk what i'm expecting from this post, i'm just in a really bad place rn idk",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/miheuj/request_i_fell_into_a_hole_of_binge_eating_and_i/",
  "score": 46,
  "num_comments": 3,
  "comments": [
    {
      "id": "gt4vhqk",
      "author": "Megals13",
      "body": "Oh honey, you sound like me. I have an eating disorder. You need to find a dietitian and therapist specialized in eating disorders and maybe go to an eating disorder clinic for a program. I don’t know how much you know about eating disorders, but binging comes from deprivation. You’re not eating enough frequently enough and that’s why you eat tons. You have an illness and you need to focus on body image/eating pattern stabilization before you worry about weight. Feel free to DM me And I can share some podcasts/resources where they talk about this. You will get better though. You are smart and capable.",
      "created_utc": 1617367018.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gt4wp9y",
      "author": "thewayiam1999",
      "body": "I'm experiencing the same thing right now. Calm down and take a breath, you need to trust your friend and share your feelings with her. She won't judge you. But talking to your friends will only ease your anxiety right now. To change this bad habit, you need to start controlling and disciplining yourself. You should eat at the same time with your families or classmates. And of course, appropriate portions. Go outside and enjoy the fresh air once you have the idea of binge eating immediately.",
      "created_utc": 1617367840.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gt4lpb4",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1617358584.0,
      "score": 1,
      "context": []
    }
  ]
}