{
  "id": "miqtiz",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1617389396.0,
  "title": "Request: I need help forcing myself to take a rest day.",
  "selftext": "Background:I think I have an eating disorder. I am addicted to exercising and burning calories. I always try to burn just as many if not more calories than the previous day. It started off fairly innocently after I got my Apple Watch, I would try to get xxx calories burned but it’s now at the point where I feel like I need to burn yyy calories each day, and zzz before I can actually do stuff like homework. I’ve almost had a few rest days but I start looking at my watch, see that I’ve hardly burned any calories and then worry that I won’t be able to make myself a good dinner because I have to restrict myself because I didn’t exercise.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/miqtiz/request_i_need_help_forcing_myself_to_take_a_rest/",
  "score": 47,
  "num_comments": 8,
  "comments": [
    {
      "id": "gt6hacf",
      "author": "updown27",
      "body": "Get rid of the watch. There is no excuse you could possibly give that is more important than saving your life (and yes, you are risking your life by letting this behavior continue). If that doesnt work or you are unable to do it you need to get into an ED clinic right away. Spoiler alert: no watches or phones allowed.",
      "created_utc": 1617397086.0,
      "score": 32,
      "context": []
    },
    {
      "id": "gt6n7x9",
      "author": "yeahhhhscience",
      "body": "U still burn calories even if you don’t workout! If Apple Watch says u burnt only 100 calories if u do minimal things, your whole body over the course of the day burns anywhere from 1400ish- 2200ish depending on ur height and weight just by doing nothing. This should give you an excuse to not workout trust me. Ur body burns calories by doing nothing , make sure u eat bc ur still burning cals!",
      "created_utc": 1617400191.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gt6mlye",
      "author": "SellimarieTomsen",
      "body": "So Why are you exercising? Because its good for your body. You are doing it because you are making your body stronger and improvibg your health, but the only way for this to happen is for you to let it recover<3  you need rest beacuse your body needs to rebuild itself.\n\nAlso if the Apple watch making you obsessive, you should probably consider to take a break from it and see if it helps:) plus the estimated energy expenditure is probably very inaccurate so its not something you should stress about.\nWish you all the best<3",
      "created_utc": 1617399875.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gt73j1h",
      "author": "Downtown-Cookie471",
      "body": "The first rest day you take is the hardest but it gets easier, trust me I have been there but you can do it! Echoing other people but take off the watch. It's not even that accurate so you are basing your life on an arbitrary calorie counter, your body knows how much energy you need intuitively and is more accurate in determining how much food you need. I have used a watch in the past and when I would work out it would consistently say I burned way less than I actually did (I use a power meter for training so it is the most accurate measure of literally how much energy I am outputting). So if I used my watch's estimate of calories I would be seriously underfueling every day. Listen to your body it knows way more than any watch does!",
      "created_utc": 1617409220.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gtb39i5",
      "author": "spinenthusiast",
      "body": "As others said, I would take off the watch. That probably sounds terrifying/impossible but I would start small. Maybe go a couple hours without it, then a few days later, then go half a day without it, then a few days after that do 3/4 of a day, then the whole day. As someone who is 7 years recovered from anorexia/OCD with a former addiction to exercise (thankfully the watches weren’t a thing back then but other trackers were), I just wanna say that your body needs rest. If you never take a rest day, your body is just going to continue to break itself down without any chance to rebuild and make yourself stronger. I now do spin class for exercise now and am looking at becoming an professional instructor but I always make sure I have *at least* one rest day a week (if not more), and will take a week or so off every couple months to really let my body reset. Nothing horrible will happen from a rest day. In fact, if you exercise compulsively and at way too long/high a rate, your performance will go down because your output is outpacing your input drastically and you’ll have zero energy. You don’t have to earn the right to eat. Take care of yourself, OP. It’s a hard road but you’ve got this. xx",
      "created_utc": 1617502555.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gt6wjjx",
      "author": "april__92",
      "body": "I’m in the same boat as you. I’ve always struggled with food but this past year I’ve become overly obsessive with counting steps and tracking calories to the point if I don’t do 10k+ steps daily then I beat myself up about it and worry about what I could eat without gaining weight. It’s actually become a huge fear unfortunately and I hate it",
      "created_utc": 1617405259.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gt76nyo",
      "author": "Emotional_Relation38",
      "body": "turn the watch off or give it to someone who understands your disorder for a day and plan out something that you enjoy doing ! i’ve been walking so much and restricting and fasting so often recently but for my birthday i’ve decided to watch a bunch of studio ghibli movies and eat some of my favorite safe foods",
      "created_utc": 1617411081.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gt621qh",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1617389396.0,
      "score": 1,
      "context": []
    }
  ]
}