{
  "id": "mjt65h",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1617529336.0,
  "title": "Request: A side effect that I never considered",
  "selftext": "I’ve struggled with bulimia off and on for about 30 years. I’m 43. Now, both of my children have disordered eating and body image issues. They are 17 and 19 (boys). They learned this behavior by watching me struggle. I feel so badly about not getting treatment earlier in life.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mjt65h/request_a_side_effect_that_i_never_considered/",
  "score": 92,
  "num_comments": 7,
  "comments": [
    {
      "id": "gtc4jbv",
      "author": "dienachdenkliche",
      "body": "Everyone does mistakes! That's human nature. But the one thing that matters and you can control is the present and the future. Go and find them AND YOURSELF a therapist! Asap !",
      "created_utc": 1617534040.0,
      "score": 41,
      "context": []
    },
    {
      "id": "gtc9z0y",
      "author": "tymopa",
      "body": "Ugh....so sorry to hear this and I know it's probably not going to help but it's not your fault. You are ill. I didn't get serious therapy until I was 46 (started at 15) and by then so much baggage had built up. I agree with the other responder who said to get you all in therapy asap because that is how they can get redirected for a heathy future AND it will hopefully stop the cycle. However, not all therapy is equal. It is essential you get an ED therapist. There are men ED therapists as well. Check out NEDA for some resources too. You'll feel better once this all gets rolling. Hugs to you.",
      "created_utc": 1617538770.0,
      "score": 16,
      "context": []
    },
    {
      "id": "gtdkjis",
      "author": "PsychadelicSpaceCat",
      "body": "I'm the child of a mother with an eating disorder. My sister and I both have diagnosed EDs and have gone through cycles of recovery & relapse. When we were your boys' age, we definitely talked about our mom in a more critical way and saw her as the cause of a lot of our problems. \n \nNow that I'm an adult, I feel nothing but love and gratitude for my mom. She was struggling  with an illness she couldn't control, any more than I feel in control of my disorder now. She still protected us as much as she possibly could, encouraged us to love ourselves, got us both treatment when we reached out, I could go on. The point is my mom always did her best for us. I couldn't always see it as a teen, but I absolutely recognize now what she went through. I hope there's a good chance your kids will learn the same with time!\n \nAlso...I don't know if this encourages or discourages you, but it's pretty accepted now that eating disorders have a genetic + a behavioral component. Even if you recovered early in life and showed zero disordered behaviors around your kids, maybe there's a chance they just carry a gene that makes them vulnerable. Research into this has helped me come to terms with the pattern of EDd in my own family, particularly it helped the relationship between me and my mom.",
      "created_utc": 1617564610.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gteqtod",
      "author": "thisisfine23",
      "body": "This has been the driving motivation in my recovery. Even more so now that I’m pregnant with my first child, my daughter.",
      "created_utc": 1617587688.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gth2lcv",
      "author": "pattispieg",
      "body": "Good morning, my friend.  \n\nWe can't change the past but only learn from our mistakes.  Are you getting treatment and counseling now?  If not you need to do so asap. If you call this number 855-382-5433 you can have a free phone consultation with a licensed counselor and they can assist you in finding someone in your location. \n\nYou need to be 100% honest and completely transparent with your sons.  No one is perfect and let them know you greatly regret your mistakes when you were younger and also that you are still battling it. They will respect you for talking opening about it. \n\nAnd congratulations on your pregnancy and your daughter!!! How exciting to you!!\n\nPatti",
      "created_utc": 1617643081.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gtbztrb",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1617529337.0,
      "score": 0,
      "context": []
    }
  ]
}