{
  "id": "ml7t4j",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1617701638.0,
  "title": "Request: Partner of someone with an ED",
  "selftext": "I recently started dating someone who is recovering from an ED. For background information, I’m overweight and have been almost my whole life. Ofc I’m insecure about it now and then and I have a tendency to overthink, and I’ve noticed since getting with my partner I have a fear they are disgusted by my weight. Don’t get me wrong I know they aren’t actually, and that EDs have to do with how they view themselves and not others, but it’s a little fear I can’t seem to escape. Does anyone have any advice for avoiding this kind of thinking? And if anyone reading this happens to have had the same concerns about their partner pls feel free to tell me! It makes me feel better when I know I’m not the only one who worries about something. \nMy partner is a sweetheart and has never given me any reason to think they would find me unattractive, I just unfortunately overthink way too much",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ml7t4j/request_partner_of_someone_with_an_ed/",
  "score": 43,
  "num_comments": 8,
  "comments": [
    {
      "id": "gtkk3r3",
      "author": "spinenthusiast",
      "body": "Hi, so 7 years recovered ED survivor here. You’re right that EDs have nothing to do with other people. And to let you in on a secret, the ED itself, while it causes people to obsess over physical appearance, weight, etc., is not really about the physical appearance, weight, etc. EDs are coping mechanisms, albeit really crappy and dangerous ones. They allow the sufferer to fixate on that and numb everything out, providing the illusion of control while really spiraling out of control. I don’t know your partner, but I’m going to go out on a limb and say they’re not vain. Your partner picked you, if they didn’t like you, they wouldn’t have, so that’s really awesome news! And having met dozens and dozens of other ED sufferers and recovered survivors over the years and all over the country, I just wanna vouch for them and say that they are incredibly kind and non-judgmental, especially towards people they love. If you’re really worried and overthinking it, I would maybe consider sitting down and talking about it, making sure to say that it’s your feelings and not anything they are deliberately doing, so maybe you can get some reassurance and not hold it all in (I know I would want my fiancé to say something if he were feeling that way) but to steal from Shakespeare’s Othello, Act 3, Scene 3, “For she (or he) had eyes and chose me.” And that’s beautiful.",
      "created_utc": 1617717975.0,
      "score": 23,
      "context": []
    },
    {
      "id": "gtkh3wg",
      "author": "brettybangsrosin",
      "body": "from the perspective of someone who had an ED and was dating: he was worried about what was i thinking about his body, if every time i called myself \"gross\" was directed to him too, and since i did not have much patience and everything was painfully frustrating at the time, we had a fight over it. yeah, its part of having an ED the mood swings. but maybe it was my personality too - i was really bothered that he was reflecting the problem i had with myself ON him. but i had a hard time realizing that. \nbut that was just my story, my personality, and how things went for me. so, my advice is: tell your partner how it is affecting you (ofc respectfully, never blaming their ED), and ask how does it affect to them. listen and learn from each other's perspective. \ni know that overthinking may feel like its a personal problem, like having an ED is - but this two are kinda mixed up, so i propose communication to untangle it :) hope this helps!",
      "created_utc": 1617716530.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gtkhvis",
      "author": "catchingnails",
      "body": "Idk if this will actually help, but I tend to be attracted to slim guys (bulimic for 10 years woohoo) and the one guy I dated who I thought was absolutely up and down perfect made me SO self conscious. And when he started gaining weight and was still comfortable with himself, I realized I felt better about myself, because for the first time I was intimately seeing someone be okay with a few extra pounds. I stopped being so nervous that if I gained 3 pounds after the holidays that he would become disgusted with me and leave. I bet she feels the same way, she probably feels safe with you. You’re right, it’s muchhhh more how she feels about herself than anything else. Perfection is nice but it’s a lot of damn work. Accepted imperfection feels like a vacation sometimes.",
      "created_utc": 1617716907.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gtkw3qt",
      "author": "ginmonty",
      "body": "Newly single woman recovering from an ED here. I'm currently online dating and will actually approach very \"fit\" people with extreme caution (as in, I will rarely swipe right). They are likely on a very rigid, limited diet. That doesn't interest me in any way. Good for them, not for me. I know it's too much of a slippery slope for me. I'm attracted to all body types, it's the person in the body. I'm sure that's exactly how your partner feels. She is attracted to you, regardless of what the number on the scale says.",
      "created_utc": 1617723395.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gtkqag2",
      "author": "modifiedmedusa",
      "body": "Honestly from my perspective, as someone long in recovery, EDs are not really about being disgusted by fat. We feel we have no power over anything in our lives, so we cope by controlling the one thing we know we have complete power over, our food intake. I've mostly dated people heavier, sometimes significantly heavier than me, and never found myself judging them the way I judge myself. My partner is built like a tank, think linebacker in American football, and I like that about him. I appreciate his strength and have never once been disgusted by his body. EDs are coping mechanisms for overwhelming emotion. There's pretty much no reason to project onto our partners because it can't give the same feelings of control. \n\nI would share how you've been feeling with your partner and give them a chance to reassure you. It sounds like you are wonderfully supportive, its ok to lean on them a little and get some support yourself.",
      "created_utc": 1617720793.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gtmh5jd",
      "author": "National_Pianist_904",
      "body": "I am 21 yo a ever- recovering bulimic, and not having the oportunity to treat my ed 6 years ago really deformed my perception of myself and others. I still have periods where i have a tendency to be atracted to people just bc they are skinny, and have a first mini rejection impulse when i see someone that does not fit that tiny tiny mold in my head. And everytime that happens i feel like a bag of sh\\*t. The judging voice that react like that / tries to label my loved ones and friends, it is so painful.\n\nHowever, it is not as dark as it sounds, people who are recovering/ recovered recognise this for what it is. ***Deformed perception and standards, in the form of intrusive thoughts/judgements.*** This is also not the case for most people, its just how my ed works bc of where i grew up (catholic elite all girls school) and it results on me screening my insecurities into others.\n\nWhen i started seeing my now 3 year bf, he was a skinny tall guy, really charming, very sweet and he gave me the hots. I used to think it was bc he was thin, but time passed we got into college and we have both put on weight. And guess what. **He still is the most atractive, sexiest man alive for me. I have discovered that**  ***no matter what he looks like and what the ed says,*** **the feeling at the end of the day of looking at him and having my breath taken away is what lingers.**\n\nWhat i mean is, even if her ed makes her judge sometimes (still probably not the case), if she chose you, it will never matter. Ed is rarely stronger than a loving healthy relationship.",
      "created_utc": 1617748792.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtn5bho",
      "author": "autistmouse",
      "body": "Maybe you can take a page from your partners recovery and check out radical radical acceptance. It is a wonderful tool for what you are struggling with. I hope it serves you.",
      "created_utc": 1617761094.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtjvg81",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1617701638.0,
      "score": 1,
      "context": []
    }
  ]
}