{
  "id": "mlynp9",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1617789320.0,
  "title": "Request: Post request: how do we support my husband’s sister in in-patient treatment?",
  "selftext": "My (29F) husband (35M) never had a relationship with his father (50sM), who went on to have 2 additional kids (15F and 19M). \n\n\nLate last year, his half sister (15F) reached out to him and they’ve been talking regularly ever since. He’s thrilled to have the opportunity to get to know her and she seems like a really smart, sweet girl. \n\n\nShe really opened up to my husband about her depression and anxiety, which he has also dealt with. She also recently told him that she has been struggling with anorexia and has been in the hospital because of issues with her heart. We want to be as supportive as possible.\n\n\nShe was just moved to an in-patient treatment program and does not have her phone to keep in touch. We’d like to send her some care packages to help ease her nerves and make her feel more comfortable in a strange place. \n\n\nI feel like food probably isn’t a good idea, so we’re trying to come up with other things we can send her instead. I was thinking maybe some nail polish, face masks, a cozy blanket, maybe a game. Just some basic creature comforts. \n\n\nIf anyone has experienced what she is going through and has some suggestions for things that may have made their treatment a little easier, we would really appreciate it!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mlynp9/request_post_request_how_do_we_support_my/",
  "score": 41,
  "num_comments": 14,
  "comments": [
    {
      "id": "gtojyb9",
      "author": "itsalwayssadboihours",
      "body": "i have been to psych ward when i was 17 and also was not allowed to have a phone, so here is what i think of.\nfirst of all, if you're able to, look into what she's allowed to have in the facility. there was a lot of stuff we were not allowed to have because we could harm ourselves with it or because of hygiene reasons.\nbut as others said, plushies or blankets and other comfort objects are a great idea, or clothes that provide sense of safety and comfort (i lived in big sweaters and hoodies, this might be especially helpful because people with eds are usually cold a lot). there is also a lot of time to kill, in my hospital we actually did a lot of crossword puzzles, read a lot of books and magazines, so she could also appreciate that, as well as journals or sketchbooks etc. \nin the end, i believe that whatever you send her, even if it is just words of encouragement, will help cheer her up.",
      "created_utc": 1617799393.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gtomcz5",
      "author": "ohsnapihaveocd",
      "body": "Wow she is so lucky to have you. Honestly, having someone like you guys in my life while I was really struggling would’ve made all the difference and the fact you want to do more is phenomenal. You have no idea how much you guys being there, listening, and supporting is doing for her. As for things to give, I have never been in an inpatient ward but know a few people who have so i may not be too knowledgeable on the rules but a stuffed toy reminding her of you guys would be great or even sending letters (if allowed) I’m sure would make her day!",
      "created_utc": 1617800694.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gtoglow",
      "author": "AffectionateMistake7",
      "body": "Teddy plush.",
      "created_utc": 1617797423.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gtovvdo",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1617805324.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gtr3hu2",
      "author": "None",
      "body": "The responses posted were wonderful. That’s very thoughtful of you to want to send her something. Also, when I was in intensive outpatient (never inpatient) I was around a lot of inpatient people in group therapy and one thing that always stressed them was having to leave and everyone expecting them to be normal, some people even came home to a welcome home party (with food of course). It sounds counter intuitive but most people coming out of inpatient with EDs don’t want that. They just want support as they continue focusing on recovery.",
      "created_utc": 1617841217.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gto63nx",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1617789322.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtohxec",
      "author": "None",
      "body": "This is so sweet of you! I remember my time in treatment there was a big focus on things to help either distract or regulate, so things like coloring books, fidget toys or slime, essential oils (specifically calming or refreshing ones like lavender or orange,) weighted blankets or plush toys, journals. It sounds like you’ll likely already be doing this but I remember it was really helpful too to have words of affirmation that I’m still lovable from my outside supporters! So a letter to read might be a good idea. \n\nI’d stay away from anything triggering, like food that you mentioned. Be careful as well if anything you send has a picture on it of a person meeting western beauty standards or anything promoting ideas of how to look that way. \n\nThat’s all I can think of! Hope this helps!",
      "created_utc": 1617798229.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gtpdgjw",
      "author": "ClickedUnsend",
      "body": "Stress putty is a big fave, art supplies, colouring books and markers, slipper socks! You have a LOT of time in a program and honestly anything to help pass that constructively is so appreciated. My husband sent me a huge pack of fancy “brush” markers and rude colouring books and they lit up my days 😂 beads for jewellery making and cord is also great! My favourite things were the letters and photos though, it’s great to be able to hear from those you love (and with some stationary) reply. So that also could be nice, a letter set and stamps? Honestly it’s so sweet of you to want to support her - anything will be appreciated. Steer clear of anything with “edges” even LEGO, and any reading material, anything like that will likely be confiscated or have to go through an approval process.",
      "created_utc": 1617813071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gtqx56l",
      "author": "Ironicbanana14",
      "body": "Socks especially, books to read or coloring books and crayons (if allowed), maybe if she is allowed certain things like shampoo/conditioner in a bag cuz inpatient toiletries suck!",
      "created_utc": 1617837935.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gts47o9",
      "author": "seatangle",
      "body": "I went inpatient when I was a teen. I loved getting mail. It would get so boring in there and sometimes a letter or package would make my day. Books, art supplies, stationary, coloring books, and crafts like beading or whatever were all popular.",
      "created_utc": 1617863021.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gtsbi2h",
      "author": "itsjojosiwa",
      "body": "Late to this thread as usual - It's a bit pricey but she might like an Oodie, it's like a giant blanket hoodie. Just check what the ward will allow.",
      "created_utc": 1617869565.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gtopdoz",
      "author": "DisastrousTrash",
      "body": "Thank you! They did say we can’t sent anything sharp or metal, or anything with drawstrings so we are making sure to stay away from those.",
      "created_utc": 1617802220.0,
      "score": 2,
      "context": [
        {
          "id": "gtojyb9",
          "author": "itsalwayssadboihours",
          "body": "i have been to psych ward when i was 17 and also was not allowed to have a phone, so here is what i think of.\nfirst of all, if you're able to, look into what she's allowed to have in the facility. there was a lot of stuff we were not allowed to have because we could harm ourselves with it or because of hygiene reasons.\nbut as others said, plushies or blankets and other comfort objects are a great idea, or clothes that provide sense of safety and comfort (i lived in big sweaters and hoodies, this might be especially helpful because people with eds are usually cold a lot). there is also a lot of time to kill, in my hospital we actually did a lot of crossword puzzles, read a lot of books and magazines, so she could also appreciate that, as well as journals or sketchbooks etc. \nin the end, i believe that whatever you send her, even if it is just words of encouragement, will help cheer her up.",
          "created_utc": 1617799393.0
        }
      ]
    },
    {
      "id": "gtopho4",
      "author": "DisastrousTrash",
      "body": "Thank you so much, it really means to much to hear that. We feel a little helpless in this situation and just want to make sure she feels supported and loved.",
      "created_utc": 1617802275.0,
      "score": 3,
      "context": [
        {
          "id": "gtomcz5",
          "author": "ohsnapihaveocd",
          "body": "Wow she is so lucky to have you. Honestly, having someone like you guys in my life while I was really struggling would’ve made all the difference and the fact you want to do more is phenomenal. You have no idea how much you guys being there, listening, and supporting is doing for her. As for things to give, I have never been in an inpatient ward but know a few people who have so i may not be too knowledgeable on the rules but a stuffed toy reminding her of you guys would be great or even sending letters (if allowed) I’m sure would make her day!",
          "created_utc": 1617800694.0
        }
      ]
    },
    {
      "id": "gu2nghj",
      "author": "Ok-Firefighter72",
      "body": "I love this 💕 i wish the time i visited a psych ward you would of been in there to help me relate!",
      "created_utc": 1618083018.0,
      "score": 1,
      "context": [
        {
          "id": "gtovvdo",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1617805324.0
        }
      ]
    },
    {
      "id": "gtop8rw",
      "author": "DisastrousTrash",
      "body": "Thank you! Those are great suggestions!",
      "created_utc": 1617802154.0,
      "score": 2,
      "context": [
        {
          "id": "gtohxec",
          "author": "None",
          "body": "This is so sweet of you! I remember my time in treatment there was a big focus on things to help either distract or regulate, so things like coloring books, fidget toys or slime, essential oils (specifically calming or refreshing ones like lavender or orange,) weighted blankets or plush toys, journals. It sounds like you’ll likely already be doing this but I remember it was really helpful too to have words of affirmation that I’m still lovable from my outside supporters! So a letter to read might be a good idea. \n\nI’d stay away from anything triggering, like food that you mentioned. Be careful as well if anything you send has a picture on it of a person meeting western beauty standards or anything promoting ideas of how to look that way. \n\nThat’s all I can think of! Hope this helps!",
          "created_utc": 1617798229.0
        }
      ]
    }
  ]
}