{
  "id": "mmocsh",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1617875596.0,
  "title": "Request: Anyone else deal with orthorexia?",
  "selftext": "My therapist made me aware of this eating disorder since I show a lot of the traits. It’s basically an obsession with healthy eating and the idea that a food must be “pure” and healthy in order for me to be able to eat it. I get so scared about going out to eat because none of the options are going to be healthy. It makes me want to avoid social events. If I eat any kind of junk food i spiral, thinking that I’m going to have a heart attack and die because I’m so unhealthy, etc. (I am very young, heart disease doesn’t run in my family, and I am normal weight if not a little under). And then the next day I feel the need to restrict and only eat the cleanest foods possible. \nI know logically that a heart attack won’t happen, but because this ED often goes hand in hand with OCD I can’t get my brain to believe differently. I never hear of anybody else with orthorexia and just wanted to ask.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mmocsh/request_anyone_else_deal_with_orthorexia/",
  "score": 63,
  "num_comments": 13,
  "comments": [
    {
      "id": "gtt35s3",
      "author": "None",
      "body": "Hi, my half brother almost died of orthorexia years ago but has recovered fully. Him and I inherited severe OCD from our father and this is what caused much of my brothers obsession with clean / healthy eating. I was young when it happened but I remember he would not touch anything with even one gram of sugar in it, not even something natural like fruit. At its worst point he only ate protein powder mixtures... like no solid food. I remember for one of his birthdays my parents knew if they made him a cake he wouldn’t eat it. So they put candles in a banana. We aren’t very close so I haven’t been able to talk to him much about it, but it got to a point where he was so incredibly weak and my parents forced him into the hospital, where the doctors were shocked he was still alive. \nAll I know (according to my parents) is that something “snapped” inside him and he “woke up” and realized he had to fight against his mind so that he could survive.\nToday, he is point blank the healthiest person I know - not obsessively, but actually HEALTHY. He turned his obsession with healthy eating into a genuine interest for the way the body works in relation to food and nutrition; he got his degree in nutrition. he is extremely active and also one of the most physically strong people I know. He has provided a healthy environment for his wife and kids, where he encourages eating that fuels the body and mind while also understanding that humans aren’t meant to eat a perfect diet all of the time and that healthy amounts of calories, sugar, etc are needed for well-being. \nI wanted to respond to your post because I have struggled with anorexia and have always differentiated between my struggles and his struggles because they are very different. I only just found out that orthorexia was a thing, and that this is what my brother had, not anorexia. I understand that there seem to be way less resources surrounding orthorexia, so it may seem like there’s not many people who have it versus other EDs. If you want I could ask him for any information regarding how he healed and recovered. I know he read a lot of books to help him abandon his obsessive mindset.\nSince I haven’t had orthorexia myself I can’t offer you any resources on my end but I just want you to know other people do struggle with it and hoped sharing my brothers story of recovery might let you know there is hope for healing. Best wishes xo",
      "created_utc": 1617888321.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gtsitc8",
      "author": "abirdinthebluenight",
      "body": "I go through phases of orthorexia and i get the same thoughts except instead of heart attack i believe i will get diabetes as soon as i eat something sweet or not pure like anything thats not a raw vegetable or fruit i panic and start researching about diabetes symptoms 🙇🏻‍♀️ logically i know it’s ridiculous as it also doesnt run in the family but yeah EDs have a tendency to not be logical so...",
      "created_utc": 1617875824.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gtst5q8",
      "author": "Parking_Pineapple440",
      "body": "I have orthorexia as well as some other disorders. I always panic about heart attacks and stuff actually.",
      "created_utc": 1617882963.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gtt2v0b",
      "author": "vernpdx",
      "body": "I feel like when i started \"recovering\" from anorexia my orthorexia started developing, but it's all so confusing because I was also recently diagnosed with OCD so I'm not sure if it's orthorexia or an obsession around my health. I feel like these things are always fighting with each other. I'm hyper focused on my stomach. Like I know I'm skinny. Kind of like a stick. I'm very small, but when I get bad I'll panic about how my stomach is bigger or all of a sudden feel like I have to start restricting due to a fear of becoming fat. It's such a stupid fear and it's completely irrational but it's more like I'm scared that all of a sudden I'll be fat and it will be my fault for not paying attention. So this fuels ruminations about food/ compulsions to go to the gym. My brain will literally start cataloguing what i can eat that won't make me gain weight but also get me optimal nutrition. It's a losing battle. I have specific foods I avoid like sugar, gluten, grains, ingredients i don't recognize, non whole-foods, beer, etc etc. But then I also try to eat as much fat and protein as possible because I'm trying to give my body everything it possibly needs to be as healthy as possible. I also get weirdly fixated on moving my body and going to the gym. I get really upset if I can't go to the gym or hike. In the past I have gone to the gym sick and injured in order to carry out my compulsions so that I could give myself permission to eat. I also have obsessions surrounding money & my bank account and used to have existential ocd really bad. Also have lots of health related obsessions and skin picking issues. Sometimes it gets so bad that i just want to sleep through it so i don't have to deal with the ruminations/compulsions but other days I'm chill and feel like I didn't even struggle with these things. It's so confusing sometimes. I usually feel like I'm faking all of it because it literally doesn't make sense sometimes. I hope that helps. lol.",
      "created_utc": 1617888173.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtu0575",
      "author": "sundays23",
      "body": "I’m currently staying with my grandparents who love country cooking. I’m having a meltdown all the time. I have so much anxiety around any meal that I don’t cook. I don’t like going out to eat because there’s almost never anything I want to eat. It seems like a waste of money to go out to just panic and hate what I’m eating. I’d prefer to make my every meal and know exactly what’s in it. My grandma asked me yesterday while I was making my lunch if I always eat like this. She was kind of shocked that I don’t eat like her",
      "created_utc": 1617902808.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtupei2",
      "author": "summerinsummerisle",
      "body": "yes! although i have ednos, lots of my disordered eating is orthorexic in nature. i was a varsity rower for 3 years and avoided junk like the plague. i ate just enough “healthy” food to avoid passing out in the middle of the lake lol. \n\nI’m in recovery now but have been relapsing into orthorexic habits, didn’t realize until today bc i work out much less and eat (very little) but more than I used to. \n\nit’s pretty hard to kick since it often presents as someone eating well and working out like you should, except it of course is unhealthy when taken too far. everyone but close friends assume I’m recovered bc “you eat so healthy!”",
      "created_utc": 1617913682.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtuwptb",
      "author": "SellimarieTomsen",
      "body": "Hi! I went trough this in 2018. It started as «wanting to eat a little healthier» but became very obsessive, and i started viewing certain foods as «bad», and decided i would never ever have them again, Because they contained something i refused to put in my body. The thought of ever eating them again almost disgusted me in a way that i cant explain. This caused me to isolate myself Because i felt like it was better to avoid any situation where i might have to eat anything that wasnt healthy enough. Long story short, i was practically Forced into recovery by my mom, and she would make me eat foods that were waaay out of my comfortzone, and she would often confront me about Why i wasnt eating certain foods in a very aggressive way. Im doing much better now, and i treat myself with foods that i used to think of as «bad» if i want to Because I know that eating something i am craving wont do any harm to my body as long as i eat nutritious foods most of the time. The truth is that no foods are good or bad, there are just some foods that have more nutrients, while other have less, but even if they are not that nutritious, you deserve to treat youself with the foods you love, Because it wont  do harm, and you only live once, so you should enjoy it and not restrict. \nI know this is hard to understand when you are battling orthorexia, but its the truth. I did not want to accept this in 2018 when i was 14, but I have learned that everything is okay in moderation🥰 wish you all the best",
      "created_utc": 1617916891.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtsijyd",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1617875596.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gtv6ddh",
      "author": "None",
      "body": "Can’t wait until my brother can tell this story about me. Thanks for sharing and congrats to your brother!",
      "created_utc": 1617921327.0,
      "score": 2,
      "context": [
        {
          "id": "gtt35s3",
          "author": "None",
          "body": "Hi, my half brother almost died of orthorexia years ago but has recovered fully. Him and I inherited severe OCD from our father and this is what caused much of my brothers obsession with clean / healthy eating. I was young when it happened but I remember he would not touch anything with even one gram of sugar in it, not even something natural like fruit. At its worst point he only ate protein powder mixtures... like no solid food. I remember for one of his birthdays my parents knew if they made him a cake he wouldn’t eat it. So they put candles in a banana. We aren’t very close so I haven’t been able to talk to him much about it, but it got to a point where he was so incredibly weak and my parents forced him into the hospital, where the doctors were shocked he was still alive. \nAll I know (according to my parents) is that something “snapped” inside him and he “woke up” and realized he had to fight against his mind so that he could survive.\nToday, he is point blank the healthiest person I know - not obsessively, but actually HEALTHY. He turned his obsession with healthy eating into a genuine interest for the way the body works in relation to food and nutrition; he got his degree in nutrition. he is extremely active and also one of the most physically strong people I know. He has provided a healthy environment for his wife and kids, where he encourages eating that fuels the body and mind while also understanding that humans aren’t meant to eat a perfect diet all of the time and that healthy amounts of calories, sugar, etc are needed for well-being. \nI wanted to respond to your post because I have struggled with anorexia and have always differentiated between my struggles and his struggles because they are very different. I only just found out that orthorexia was a thing, and that this is what my brother had, not anorexia. I understand that there seem to be way less resources surrounding orthorexia, so it may seem like there’s not many people who have it versus other EDs. If you want I could ask him for any information regarding how he healed and recovered. I know he read a lot of books to help him abandon his obsessive mindset.\nSince I haven’t had orthorexia myself I can’t offer you any resources on my end but I just want you to know other people do struggle with it and hoped sharing my brothers story of recovery might let you know there is hope for healing. Best wishes xo",
          "created_utc": 1617888321.0
        }
      ]
    },
    {
      "id": "gtuh25v",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1617910088.0,
      "score": -5,
      "context": [
        {
          "id": "gtsitc8",
          "author": "abirdinthebluenight",
          "body": "I go through phases of orthorexia and i get the same thoughts except instead of heart attack i believe i will get diabetes as soon as i eat something sweet or not pure like anything thats not a raw vegetable or fruit i panic and start researching about diabetes symptoms 🙇🏻‍♀️ logically i know it’s ridiculous as it also doesnt run in the family but yeah EDs have a tendency to not be logical so...",
          "created_utc": 1617875824.0
        }
      ]
    },
    {
      "id": "gtxajim",
      "author": "None",
      "body": "That day is coming! Best wishes to you <3",
      "created_utc": 1617972349.0,
      "score": 1,
      "context": [
        {
          "id": "gtt35s3",
          "author": "None",
          "body": "Hi, my half brother almost died of orthorexia years ago but has recovered fully. Him and I inherited severe OCD from our father and this is what caused much of my brothers obsession with clean / healthy eating. I was young when it happened but I remember he would not touch anything with even one gram of sugar in it, not even something natural like fruit. At its worst point he only ate protein powder mixtures... like no solid food. I remember for one of his birthdays my parents knew if they made him a cake he wouldn’t eat it. So they put candles in a banana. We aren’t very close so I haven’t been able to talk to him much about it, but it got to a point where he was so incredibly weak and my parents forced him into the hospital, where the doctors were shocked he was still alive. \nAll I know (according to my parents) is that something “snapped” inside him and he “woke up” and realized he had to fight against his mind so that he could survive.\nToday, he is point blank the healthiest person I know - not obsessively, but actually HEALTHY. He turned his obsession with healthy eating into a genuine interest for the way the body works in relation to food and nutrition; he got his degree in nutrition. he is extremely active and also one of the most physically strong people I know. He has provided a healthy environment for his wife and kids, where he encourages eating that fuels the body and mind while also understanding that humans aren’t meant to eat a perfect diet all of the time and that healthy amounts of calories, sugar, etc are needed for well-being. \nI wanted to respond to your post because I have struggled with anorexia and have always differentiated between my struggles and his struggles because they are very different. I only just found out that orthorexia was a thing, and that this is what my brother had, not anorexia. I understand that there seem to be way less resources surrounding orthorexia, so it may seem like there’s not many people who have it versus other EDs. If you want I could ask him for any information regarding how he healed and recovered. I know he read a lot of books to help him abandon his obsessive mindset.\nSince I haven’t had orthorexia myself I can’t offer you any resources on my end but I just want you to know other people do struggle with it and hoped sharing my brothers story of recovery might let you know there is hope for healing. Best wishes xo",
          "created_utc": 1617888321.0
        },
        {
          "id": "gtv6ddh",
          "author": "None",
          "body": "Can’t wait until my brother can tell this story about me. Thanks for sharing and congrats to your brother!",
          "created_utc": 1617921327.0
        }
      ]
    },
    {
      "id": "gtuwjgg",
      "author": "to6be9continued",
      "body": "Do you not understand eating disorders? THEY CANT CONTROL IT. Like they said, EDs aren’t logical.",
      "created_utc": 1617916810.0,
      "score": 2,
      "context": [
        {
          "id": "gtsitc8",
          "author": "abirdinthebluenight",
          "body": "I go through phases of orthorexia and i get the same thoughts except instead of heart attack i believe i will get diabetes as soon as i eat something sweet or not pure like anything thats not a raw vegetable or fruit i panic and start researching about diabetes symptoms 🙇🏻‍♀️ logically i know it’s ridiculous as it also doesnt run in the family but yeah EDs have a tendency to not be logical so...",
          "created_utc": 1617875824.0
        },
        {
          "id": "gtuh25v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1617910088.0
        }
      ]
    },
    {
      "id": "gtv0ojy",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1617918659.0,
      "score": 0,
      "context": [
        {
          "id": "gtsitc8",
          "author": "abirdinthebluenight",
          "body": "I go through phases of orthorexia and i get the same thoughts except instead of heart attack i believe i will get diabetes as soon as i eat something sweet or not pure like anything thats not a raw vegetable or fruit i panic and start researching about diabetes symptoms 🙇🏻‍♀️ logically i know it’s ridiculous as it also doesnt run in the family but yeah EDs have a tendency to not be logical so...",
          "created_utc": 1617875824.0
        },
        {
          "id": "gtuh25v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1617910088.0
        },
        {
          "id": "gtuwjgg",
          "author": "to6be9continued",
          "body": "Do you not understand eating disorders? THEY CANT CONTROL IT. Like they said, EDs aren’t logical.",
          "created_utc": 1617916810.0
        }
      ]
    },
    {
      "id": "gtv29ze",
      "author": "xvelvetdarkness",
      "body": "I have a hard time understanding how you can have degrees related to mental health and not have at least some empathy here. As OP said, it's related TO OCD. OCD is literally characterised by irrational fears and intrusive thoughts. We all know that rationally nothing bad will happen if someone doesn't flip this lightswitch x number of times or wash their hands until they bleed, and yet thousands of people with OCD perform compulsions like this all the time, with fears that if they don't something catastrophic will happen. Mental illnesses based in anxiety are by definition irrational, any mental health practitioner NEEDS to understand and be empathetic of that",
      "created_utc": 1617919394.0,
      "score": 3,
      "context": [
        {
          "id": "gtsitc8",
          "author": "abirdinthebluenight",
          "body": "I go through phases of orthorexia and i get the same thoughts except instead of heart attack i believe i will get diabetes as soon as i eat something sweet or not pure like anything thats not a raw vegetable or fruit i panic and start researching about diabetes symptoms 🙇🏻‍♀️ logically i know it’s ridiculous as it also doesnt run in the family but yeah EDs have a tendency to not be logical so...",
          "created_utc": 1617875824.0
        },
        {
          "id": "gtuh25v",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1617910088.0
        },
        {
          "id": "gtuwjgg",
          "author": "to6be9continued",
          "body": "Do you not understand eating disorders? THEY CANT CONTROL IT. Like they said, EDs aren’t logical.",
          "created_utc": 1617916810.0
        },
        {
          "id": "gtv0ojy",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1617918659.0
        }
      ]
    }
  ]
}