{
  "id": "mn2xy0",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1617920046.0,
  "title": "Request: Do I have an eating disorder?",
  "selftext": "Hi, I’m a 15 year old male and I’m slightly overweight. I’ve been struggling hard with my body image and I can’t even stand to look at myself in the mirror. A few months ago, I decided I wanted to start my journey to weight loss. I’ve lost weight but I still hate my body. In the past week, I’ve struggled to eat. Every time it’s time for me to eat I feel like crying and throwing up. I skip breakfast and lunch and don’t eat until dinner. I’ve been consuming half the amount of recommend calories in the past week and I feel physically exhausted. I just want to eat without feeling the guilt and self hatred. Can someone help me?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mn2xy0/request_do_i_have_an_eating_disorder/",
  "score": 46,
  "num_comments": 12,
  "comments": [
    {
      "id": "gtvdath",
      "author": "banana-itch",
      "body": "Hey man, what you're describing sounds really worrying. It is really good that you are recognising what is going on and reaching out. Your problems are definitely real and you deserve support. The earlier you get help for this the better, so you can work on your self-esteem, body image and other issues you may have and which might play into this. Working with a dietician could also help you make a meal plan that is right for you, and help you recognise appropriate portion sizes as well as hunger and fullness, so you can ideally work your way to a healthy and intuitive way of eating.\nBut you need to get a therapist. Eating disorders don't discriminate between genders, weight or body or size and if you're struggling you're valid.\nHave you ever talked to someone in your life about this?",
      "created_utc": 1617924786.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gtw9pq5",
      "author": "yikes-aghost",
      "body": "That absolutely sounds like you have an ED and if you don’t yet you will develop one soon if you don’t get help ASAP. Please get help as soon as possible. Your brain will gaslight you and tell you you’re overreacting. You’re not. I’m 20 and I’ve been doing this shit for 7 years now. It doesn’t ever just go away on its own and the longer you wait the harder it is to get out of. Please please please seek help of some kind.  Because youre male people might try to dismiss your concerns. Don’t let them. They’re wrong. Your struggle is never invalid because of ignorant people. Sending support and my DMs are open to you💕",
      "created_utc": 1617942610.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gtvza50",
      "author": "AdelaideJane",
      "body": "I’m going through the same thing right now. But because I’m considered a “normal weight” nobody is really trying to help. :(\nI would definitely talk to your doctor or a therapist.",
      "created_utc": 1617936298.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gtxsn3t",
      "author": "National_Pianist_904",
      "body": "(im a 21 yo female) Sounds like what could be the beggining of an ed, since thats how mine started 6 years ago; but making a diagnosis would not be right. Take care of this right away, talk to an adult of trust  and do your best to get to a specialized therapist. \n\nFor now, try unrestricted eating, its hard at first and it hurts to eat so much when you can only think about weight, but its the only way to keep the self-restrictive impulses at bay. Not looking at the mirror, ditching the scale and wearing comfortable clothes is also a soft way to comfort the pain of not feeling beautiful and worthy. This things have helped me, but they never replace profesional assistance.\n\nIve been trough what you describe and i want to tell you i undestand exactly how you feel. I need you to know that not being perfectly skinny or fit will not get you what you really want. Sound obvious, but for me being skinny meant acceptance and validation. And to some point, it did work. But there was nothing after that. The people that just accepted you bc you lost weight dont really care about who you are, how much of a good friend or date you can be. \n\nSo please open your eyes and try to see yourself from outside. Im sure you have so much to offer to the world, whether that is kindness, talent, loyalty or a million other things. You are enough no matter the number. You are valuable allways. \n\nPlease take care and message me if you feel like talking.",
      "created_utc": 1617981049.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gtv3own",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1617920046.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtxm71a",
      "author": "Sea-Smoke-9498",
      "body": "As none of us are professionals, we are unable to diagnose anything apart from suggesting things. I’d recommend going to see a doctor or therapist and they should be able to help.",
      "created_utc": 1617978135.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gty16py",
      "author": "kauzige",
      "body": "I've had an eating disorder since I was a kid, but only had it diagnosed this year. The best advice I can give you is to eat as many whole foods as possible and it's better to eat more for breakfast or lunch than later. A bigger, 600+ calorie, planned breakfast is better than an impulsive, 1000+ snack in the evening. Your body is telling you to eat more for a reason. Nip it in the bud before you're 25 and need to go to a clinic for months",
      "created_utc": 1617984796.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gu0qvo1",
      "author": "None",
      "body": "hey. your experience is very similar to what i had gone through, without knowing that it was extreme body dysmorphia and ed in progress. if you couldn’t or can’t see the changes in your body and nothing satisfies you then yes it is an issue ... an eating disorder is a mental state and is not defined by whether you’re at a healthy weight or not. talk to someone please, my dms are open for any questions or advice ❤️",
      "created_utc": 1618037669.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gtx1f9d",
      "author": "None",
      "body": "Hey man, I’m struggling with an eating disorder too. I don’t know how to help, but I wish you well. It’s good you recognize it early. I destroyed my body for years and was in denial. Take the silver I hope it cheers you up. I want you to know there are always people who love you and are willing to help you. It was hard opening up, and at first I got laughed at and dismissed. But eventually they saw how horrible it was, and now I’m getting the help I need. You are never alone. If you feel alone and helpless, come to this sub. Believe me  everyone here is nice and willing to help. Sorry for long rant. It might be really hard, but try and have a nice day 👍.",
      "created_utc": 1617966547.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gtyj6mo",
      "author": "None",
      "body": "Hey stranger! I sympathize with what you are going through. Just know that there is no “sick enough” to get help. It sounds like a strong support system would really help you out. Reaching out to a loved one or a professional is a hard step to take but it will help you so much in the long run. I wish I had reached out to someone when I was in my lowest low of my ED.",
      "created_utc": 1617992645.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gu0qzqd",
      "author": "None",
      "body": "your eating disorder is not defined by your weight like society convinces you :( please acknowledge it and validate it to make the recovery easier in the future. you are seen",
      "created_utc": 1618037778.0,
      "score": 2,
      "context": [
        {
          "id": "gtvza50",
          "author": "AdelaideJane",
          "body": "I’m going through the same thing right now. But because I’m considered a “normal weight” nobody is really trying to help. :(\nI would definitely talk to your doctor or a therapist.",
          "created_utc": 1617936298.0
        }
      ]
    },
    {
      "id": "gubc71u",
      "author": "userrr018",
      "body": "i would recommend getting rid of your mirror entirely if possible or covering it with a blanket/sheet/tapestry. sometimes not focusing on your appearance or even seeing and perceiving yourself on a daily basis can be helpful in not fixating on weight or size. but definitely also seem professional help from a dr or parent!",
      "created_utc": 1618271731.0,
      "score": 3,
      "context": [
        {
          "id": "gtxsn3t",
          "author": "National_Pianist_904",
          "body": "(im a 21 yo female) Sounds like what could be the beggining of an ed, since thats how mine started 6 years ago; but making a diagnosis would not be right. Take care of this right away, talk to an adult of trust  and do your best to get to a specialized therapist. \n\nFor now, try unrestricted eating, its hard at first and it hurts to eat so much when you can only think about weight, but its the only way to keep the self-restrictive impulses at bay. Not looking at the mirror, ditching the scale and wearing comfortable clothes is also a soft way to comfort the pain of not feeling beautiful and worthy. This things have helped me, but they never replace profesional assistance.\n\nIve been trough what you describe and i want to tell you i undestand exactly how you feel. I need you to know that not being perfectly skinny or fit will not get you what you really want. Sound obvious, but for me being skinny meant acceptance and validation. And to some point, it did work. But there was nothing after that. The people that just accepted you bc you lost weight dont really care about who you are, how much of a good friend or date you can be. \n\nSo please open your eyes and try to see yourself from outside. Im sure you have so much to offer to the world, whether that is kindness, talent, loyalty or a million other things. You are enough no matter the number. You are valuable allways. \n\nPlease take care and message me if you feel like talking.",
          "created_utc": 1617981049.0
        }
      ]
    }
  ]
}