{
  "id": "mpz157",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1618307432.0,
  "title": "Request: Questions about how i’ve ate past 3-4 years",
  "selftext": "so for going on about 3-4 years now i’ve barely eaten anything at all. to elaborate if i woke up around 8 am and so happened to get hungry enough to eat i’d eat around 5-6 pm. NORMALLY id take a few bites and literally be so sick i didn’t wanna eat anymore so i’d stop. if i SOMEHOW managed to finish all of what i was eating, then i’d be fine till the next day and the same process. so say i stay up all night cause my sleep schedules are fucked off and i wake up at 5 pm, i probably wouldn’t eat anything at all that day. if i did, it’d be at like 3-4 am and by that time if it made me sick and my stomach started hurting, i’d then go to sleep. and so on. i imagine you get the picture. not only have i not been eating, my sleep schedule has been fucked off as well. BEFORE all this i was like 18 and xxx lbs (normal bmi) 5’11 (male)\nNOW i’m just 22 a constant xx-yy lbs same height (underweight bmi). i don’t have health care or anything like that but i’m honestly wondering if there’s anything i should be seriously concerned about. (of course i drank liquids, but hardly ever water. i was 90% dr pepper 24/7) genuinely concerned here lol",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mpz157/request_questions_about_how_ive_ate_past_34_years/",
  "score": 38,
  "num_comments": 5,
  "comments": [
    {
      "id": "gucrmwv",
      "author": "None",
      "body": "Do you work?",
      "created_utc": 1618307784.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gudpl76",
      "author": "seaserpents",
      "body": "Obviously, no one here can offer any sort of medical advice/opinion when it comes to whether you should be seriously concerned about your eating or not, but as someone who has gone through an eating disorder, your eating habits do sound concerning. I can't imagine eating just a few bites here and there with Dr. Pepper is enough to properly sustain you, and feeling sick and unable to continue eating even after so little food is of course not normal and something that shouldn't be overlooked.\n\nYou say don't have healthcare. Is there anyone close to you at all who might be able to help you contact a doctor or arrange some sort of payment plan/help you pay for the appointment? I think it'd be really important for you to get a checkup done, especially since this has been going on for years now. The doctor could also be able to guide you in the right direction when it comes to managing your eating in a way that would sustain you better.",
      "created_utc": 1618327880.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gug7dpj",
      "author": "anivoux",
      "body": "I have a friend who is going through something similar.  For years he didn't eat more than a single meal a day, if that, coupled with Brisk tea and carbonated drinks.  He doesn't want to see a doctor about it cause of Healthcare costs and while he is underweight, he's not deathly ill  nor is he severely underweight.  We've been working together to meet up and eat and build up his appetite.  \n\nThough for him it's his relationship with food is pretty poor:  there aren't things he likes or craves much of (which is slowly changing)  \nAnd I get it but for different reasons.  \nMy exp was more similar to yours where I couldn't eat without feeling sick most of the time nor sleep properly or on a schedule. (But I was a health maniac so I only drank tea and water)  I got a big kick to the gut when I moved in with my partner who is a big foodie and loves to cook and when I wasn't finishing my plate and going for seconds, they made it their life goal to build up my relationship with food (that was 5 years ago)  \nI've gotten a lot better, it just takes time,  dedication and consistency.  Don't push your stomach too hard but don't go too easy on yourself either. \nSomeone above mentioned the supplement and that'd be a good option if you're up for it.   I personally used over the counter vitamins nutritional supplements. A good cheat is to find a preferred \"old people\" drink. Full of protein, vitamins and designed to be easy on the stomach.  Mine was mostly ensure though some days it wasn't as easy to digest as others",
      "created_utc": 1618371369.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gucracv",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1618307432.0,
      "score": 1,
      "context": []
    },
    {
      "id": "guf7b6d",
      "author": "None",
      "body": "I saw a nutritionist recently about my own health, part of our couple hour consultation was a big thing on food health and explaining why starvation is so dangerous, I can share some of this with you if you'd like.\n\nBut as an immediate concern, when you say xx-yy pounds, is this to suggest less than 100 pounds?\n\nAlso, just asap, so that you get nutrients, there is this thing called sustagen, at least there is where I live. It's given to people with eating disorders as a bit of a primer to make sure you get everything you need vitamin wise. It has next to nothing calorie or kilohoule wise, but has half of you recommended daily intake of vitamins and stuff per serve. I'm not a doctor, but at least start with this. It's a powder you mix into a glass of water.\n\nAlso, don't just start eating again, that's something you need to wean onto. Your stomach will have grown so small now that any large portions seriously just can't fit or be digested properly.",
      "created_utc": 1618352297.0,
      "score": 5,
      "context": [
        {
          "id": "gudpl76",
          "author": "seaserpents",
          "body": "Obviously, no one here can offer any sort of medical advice/opinion when it comes to whether you should be seriously concerned about your eating or not, but as someone who has gone through an eating disorder, your eating habits do sound concerning. I can't imagine eating just a few bites here and there with Dr. Pepper is enough to properly sustain you, and feeling sick and unable to continue eating even after so little food is of course not normal and something that shouldn't be overlooked.\n\nYou say don't have healthcare. Is there anyone close to you at all who might be able to help you contact a doctor or arrange some sort of payment plan/help you pay for the appointment? I think it'd be really important for you to get a checkup done, especially since this has been going on for years now. The doctor could also be able to guide you in the right direction when it comes to managing your eating in a way that would sustain you better.",
          "created_utc": 1618327880.0
        }
      ]
    }
  ]
}