{
  "id": "mrstq6",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1618536313.0,
  "title": "Request: Relapse every single time my life changes. 10+ years of this, and I'm so tired of it.",
  "selftext": "I've had eating disorders in various forms for 10+ years. I'm a lot better than what I used to be, and I have phases (prolonged, occasionally) where I'm reasonably healthy. Overall, I can generally control the behaviours but not the thoughts, and I've made my peace with that. I don't think I'll ever be \"normal\" towards my body or food.\n\nWhat I can't make my peace with, is that I seem to have a mini-relapse EVERY time I go through big changes in my life. I've recently moved across the country for a PhD, and sure enough, I initially lost a load of weight. Sure enough, I was (suspiciously) happy about that. Then, sure enough, I started binging. I've taken laxatives again for the first time in 1-2 years, and I've purged again for the first time in months. I've regained the weight, I feel disgusting, and I'm at the point where I'm binging on anything (butter, as one embarrassingly low example) so now I can't even trust myself to have basic household items around. \n\nI usually snap out of it by going to the gym more - I can't lift weights if I'm eating badly, and it motivates me to get back on track. I can't do that right now due to the pandemic. I'm seeing the university's counselling service but I can't afford ED-specific treatment. I'm so tired of this shit. It would be great to hear from anyone who has overcome similar, or if anyone has any advice on dealing with a relapse. Thank you.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mrstq6/request_relapse_every_single_time_my_life_changes/",
  "score": 47,
  "num_comments": 5,
  "comments": [
    {
      "id": "guokucb",
      "author": "anagramqueen",
      "body": "Two pieces of advice. \n\nFor me, most of the reason big life changes lead to relapses - specifically changes where I'm moving to a new area, starting a new job, new environment, etc. - are because my routines are off and/or there's no one to keep me accountable. Changing those two things really helps. \n\nSo first suggestion would be to let a few friends or otherwise-trusted-persons into the loop. Let them know that you're struggling and need support. If you don't have any friends yet where you moved and you're struggling to keep in contact with your faraway support group (I mean, let's face it, long-distance relationships are hard), try to make some in-person friends. Join a running group. Get a gym buddy. There are good, supportive people out there. The trick is finding them. \n\nSecond piece of advice is finding a new food routine. You moved recently - that's a lot of change in a very short period of time. All the stores are new. The buildings are different. Your schedule is different. The people are different. All the comfy little food routines you'd built for yourself without even realizing it, from the layout of your cabinets to the available brands of fruit, have been suddenly overturned. So, find a new food routine. Spend a while just wandering the grocery store, familiarizing yourself with the layout. Arrange the contents of your cabinets in a way that pleases you. Make a cooking plan. Doesn't have to be anything complicated, just a short list of recipes you like. \n\nAnyways, no one should have to struggle alone. I really hope this helps!",
      "created_utc": 1618541789.0,
      "score": 10,
      "context": []
    },
    {
      "id": "guw60db",
      "author": "ZLCer",
      "body": "I had to check twice to see if I was reading something I wrote about my life with ED.\n\nI wrote this to someone else who's like us, so it's probably the easiest way for me to explain my journey through the process:\n\n“You. Reading this right now.\n\nYes...YOU!\n\nI’m going to tell you something, and I need you to pay close attention.\n\nI need you to tune out every distraction, and I need you to be here with me right now.\n\nAre you ready?\n\nThis is huge.\n\nThis is life-changing.\n\nThis might also be terrifying for you, but you need to hear it.\n\nIT’S NOT YOUR FAULT.\n\nI don’t care what it is you’re blaming yourself for. Whether it’s for your best never being good enough or your life not turning out the way you wanted it to, it doesn’t matter.\n\nIT’S NOT YOUR FAULT.\n\nYou’ve made mistakes you based solely on the information you had to go on at the time,\n\nIT’S NOT YOUR FAULT.\n\nIf you’ve never been taught the truth of who you are or how to unapologetically show up in life, how can you blame yourself for not knowing?\n\nOr maybe you’re blaming yourself for knowing better, but you’ve never been taught the skills to actually do better.\n\nMaybe you’ve tried a few (hundred) self-help books, courses, seminars, but nothing ever sticks.\n\nIT’S NOT YOUR FAULT.\n\nWe live in a very selfish, hurried, distracted, society that’s set up for surviving rather than thriving. Segregation over community. Judgment instead of understanding. Conclusions without conversations.\n\nIf you’ve never had anyone speak life into you, to pay attention to you and acknowledge you for just you being you, it’s really hard to believe you’re worthy of anything good happening to you. It becomes a struggle to want to try.\n\nI’ll say it again...\n\nIT’S NOT YOUR FAULT.\n\nThere are no longer boundaries, and morals are faded shades of grey. We’ve all become masterful dancers as we try to avoid stepping on anyone’s feeling all in the name of “love.”\n\nSo IT’S NOT YOUR FAULT you don’t know how to use your own voice, to confidently offer your wisdom, or to just get through a day without hearing the voices of your past reminding you of all your flaws and shortcomings.\n\nIT’S NOT YOUR FAULT you didn’t even know you HAVE a voice. And IT’S NOT YOUR FAULT you didn’t know you have a CHOICE.\n\nSo the first thing I want you to do for me right now is say something out loud. I don’t care where you are, who you’re with, or how stupid you might feel.\n\nI’ll give you another three seconds to quit fighting with me and yourself about doing it. Ready?\n\nOne.\n\nTwo...\n\nThree!\n\n“IT’S NOT MY FAULT, AND I FORGIVE MYSELF FOR NOT KNOWING WHAT I DIDN’T KNOW!”\n\nOkay, now I want you to actually say it out loud.\n\nDO IT.\n\nGO!\n\n“IT’S NOT MY FAULT, AND I FORGIVE MYSELF FOR NOT KNOWING WHAT I DIDN’T KNOW!”\n\nAnd then I’d start journaling. I’d get all the lies, blame, hurt, and gunk out of my head and onto paper…and I’d burn it! Then I’d “lather, rinse, repeat.” I’d do this as many times as I needed to in order to get all the emotions and anger out so I could make space for truth and my real self to show up, unpack, and take up residence. I’d stick with it until I started to believe, then almost believed, then believed a little more, then believed enough to try it out, then believed enough to trust that I have a purpose and I was created for such a time as this.\n\nYou know how why I’d give my younger self this advice? Because it’s what I did to now be free from depression and the lack of identity.\n\nRabbi Daniel Lapin says, “The opposite of depression is not happiness. The opposite of depression is purpose.”\n\nFind your voice. Speak your truth with love and respect. Renew your mind. Refresh your perspective. Restore your true identity. Walk in your purpose.\n\nIf I can do it, I KNOW without a doubt you can do it…and you no longer have to do it alone.”\n\nEven though we haven’t met, I see you. I believe in you. You matter. You are loved.",
      "created_utc": 1618689579.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gus40a9",
      "author": "Ironrunner16",
      "body": "Are you me? I'm afraid I have no solution. The only thing that helped so far has been living with a person who has a health-ish routine (without being a fitness freak) so we can have our meals and hang out together. Living alone has made a lot of damage. I'm sending a hug, OP.",
      "created_utc": 1618614231.0,
      "score": 2,
      "context": []
    },
    {
      "id": "guoak52",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1618536314.0,
      "score": 1,
      "context": []
    },
    {
      "id": "guqat0z",
      "author": "Moneybags313131",
      "body": "I'm sorry to hear about your struggles, but yes -- that's pretty human -- you might be a little hard on yourself, eh? I think it might be helpful to have a support group and work a program that addresses the \"why\" for you. Life changes are incredibly stressful and it's very human to  fall back on our past behaviors that give us comfort. For example, I'm a few hours from home on vacation by myself and I got lonely the first night and I immediately bought a pack of cigarettes to have my comfort accessible. Now it's Day 6 and I'm back to not smoking anymore. Try your best to think about 'today' and what you can do to make today better. Yes, the gym is an obstacle during the Pandemic, but are there other alternative workout methods you can think of that you can do in lieu of going to a gym?",
      "created_utc": 1618584642.0,
      "score": 1,
      "context": []
    }
  ]
}