{
  "id": "mtpp0s",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1618793933.0,
  "title": "Request: what do you do when you come across pictures of you when you were at your worst with your ED?",
  "selftext": "Hey y’all, what do you do when you come across pictures of you when you were at your worst with your ED. I remember still thinking I was too “chubby” at the time and looking at that picture and looking at myself now makes me feel sick. I’m currently the biggest and heaviest (a relatively normal or healthy weight)I’ve ever been and seeing myself at my smallest is devastating. I deleted the picture I saw but it didn’t get rid of this feeling. It’s been almost 5 years now but recently it’s like the struggle is worse.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mtpp0s/request_what_do_you_do_when_you_come_across/",
  "score": 58,
  "num_comments": 16,
  "comments": [
    {
      "id": "gv17ql1",
      "author": "AzerothVarrock",
      "body": "I very much relate to this :( except I wasn't strong enough to delete the pictures. \n\nI havent looked at them in a long time, but yeah. \n\nI think deleting them is the best choice for your mental health, but it is totally understandable to have those gut wrenching feelings linger. \n\nHow long ago did you see the picture? Also, do you do therapy? \n\nI recommend you spend time doing some hobbies that involve creating something or finishing tasks. This can help build confidence a lot and is really good for alleviating this type of feeling. Hobbies like that would be stuff like art, gaming, cooking a new recipe, crafts, etc.",
      "created_utc": 1618795997.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gv1it5f",
      "author": "charlessedwick",
      "body": "I’d love to know how you handle this. I enjoyed how I looked when I stopped eating. Now I hate what I look like.",
      "created_utc": 1618802487.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gv25npf",
      "author": "Farquar-lazs",
      "body": "I came across some old photos of me when sorting Christmas stuff out last year....WOAH! what a shock it was.\n\nI sat and looked at them for a while. I felt sad, that at the time I had no idea how underweight and poorly I was. And then I felt proud to be normal weight now and fit and healthy.\n\nI'll always keep them, I put them back away in the box but I would never destroy them. \nThey are a reminder of how far I've come",
      "created_utc": 1618820127.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gv28m8w",
      "author": "haddles77",
      "body": "OP, I think the struggle you are articulating is that you are having the very real conflicting feelings of seeing yourself at a very small weight and feeling some sort of nostalgia for it. Is that correct?",
      "created_utc": 1618822935.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gv140b5",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1618793933.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gv1pz5f",
      "author": "dreamyai",
      "body": "I relate to this a lot. Seeing myself bone thin scares the hell out of me because I was so close to death. I used to look through the family album to smile and see how I grew up but I haven't touched those books in over ten years. I'm scared to look at them. I'm at a very much healthier weight but seeing those pictures are a big nono for me.",
      "created_utc": 1618807203.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gv3ecpi",
      "author": "spinenthusiast",
      "body": "I definitely recommend getting rid or shelving old pics/videos if they’re triggering. I also think it helps to look back and think about how you really felt back then. I look back and even if my face was smiling, you could see I was dead behind the eyes. If any nostalgia pops up, I immediately go back to reminding myself that I was miserable, constantly fighting with family, lying about my actions, constantly numb and/or irritable, missed out on loads of events, trips, and memories, felt suicidal, etc., and then I don’t want it anymore. It also helps to remember what you have now with recovery. Is life perfect? No. Do I have cellulite? Yes. But I have a life now. My family and I are on great terms, I met and am about to marry my fiancé, I have energy to take all of the good and bad of life and face it head-on, even when it sucks. So yeah, reflection helps and don’t glamorize the past. There is SO much more to look forward to and life to live, and you need to be healthy to do it.",
      "created_utc": 1618847696.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gv1fs8m",
      "author": "grumpycatt4",
      "body": "i totally know how you feel, as i have recently come across old photos of myself as well. i think deleting them was a great decision, as it eliminates the temptation and opportunity for you to look at them again. try to think about how you felt in the time that those photos were taken, and how you feel now. personally, i feel a whole lot better and more human than i ever did during the depths of my ED. also, something that helps me is that i try to remind myself that bodies are meant to change. you will not have the same body that you had ten years ago, five years ago, hell, even one year ago. reflect on all of the great things that recovery has given you, not just focusing in on how your body has changed in that time. sending you lots of love <3",
      "created_utc": 1618800642.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gv2vj53",
      "author": "SellimarieTomsen",
      "body": "I really relate to this. I was looking trough my snap memories and I saw a mirrorselfie from when i in a very bad place. It was so weird Because my body looked completly different to me back then.\nSo i try to not look at the pictures from back then, but i want to keep them, Because its an important part of my life in a way. One day I can look back and remember that i got past it, even when i didnt thing there was a way out.\nBut my brother actually send me a video recently of me when i was extremly skinny, and it nearly made me cry. Idk What his intentions were tbh. I feel like he kinda did it to show me «How sick i was» or «How big i am now compaired to then», and it really hurt, and i dont even think he realised What he did so..\nBut i wish you all the best:)",
      "created_utc": 1618839298.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gv2x4c1",
      "author": "tourmente",
      "body": "Now those pictures really make me feel bad, sick, and happy for no really want that. It was hard to feel like this, but sometimes when i feel bad for gained weight i see those pictures and it's like a reminder of how bad i was. I liked my old body, but i really understand that it's not good for me and i don't want that anymore, i want to be free and happy, see the pictures reminds me why i don't want that",
      "created_utc": 1618840094.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvamysw",
      "author": "space_outer",
      "body": "There have been times where I am scrolling though old things and one appears. I just stare at it forever, hard to look away. Cant remember how upset I was at that time, wish we could get those memories so we don’t get sucked back in",
      "created_utc": 1618984854.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gv1802w",
      "author": "AzerothVarrock",
      "body": "Oh! Im sure you know this, buttttt.....\n\n\nAvoid the scale. Avoid at all costs. Don't take pictures or videos to body check yourself. Maybe even avoid mirrors for a little while just till you can get a handle on the emotions. This is stuff my therapist told me to do when my body dysmorphia pops up and I feel hideous and triggered. It does help! It used to take monthhssss of doing coping skills like this till I felt better. Now it takes about 1 week to 1 month\n\n\nYou got this!!",
      "created_utc": 1618796141.0,
      "score": 8,
      "context": [
        {
          "id": "gv17ql1",
          "author": "AzerothVarrock",
          "body": "I very much relate to this :( except I wasn't strong enough to delete the pictures. \n\nI havent looked at them in a long time, but yeah. \n\nI think deleting them is the best choice for your mental health, but it is totally understandable to have those gut wrenching feelings linger. \n\nHow long ago did you see the picture? Also, do you do therapy? \n\nI recommend you spend time doing some hobbies that involve creating something or finishing tasks. This can help build confidence a lot and is really good for alleviating this type of feeling. Hobbies like that would be stuff like art, gaming, cooking a new recipe, crafts, etc.",
          "created_utc": 1618795997.0
        }
      ]
    },
    {
      "id": "gv2pj9r",
      "author": "Impressive-Young-759",
      "body": "Yes. I was underweight and unhealthy. But honestly I never looked “bone thin”. I have a very athletic body type and coupled my ED with physical training so I look back and I think I looked great compared to how I look now. And I know it was never going to be enough and if I go down this road of thinking again, even if I returned to that weight or size I still wouldn’t be happy and I’d be sick. I just don’t know how to deal with seeing pictures like that and feeling like I failed? Even though I won? I fought so hard to get to where I am but sometimes it feels like I did the opposite and “let myself go” if that makes sense.",
      "created_utc": 1618836082.0,
      "score": 4,
      "context": [
        {
          "id": "gv28m8w",
          "author": "haddles77",
          "body": "OP, I think the struggle you are articulating is that you are having the very real conflicting feelings of seeing yourself at a very small weight and feeling some sort of nostalgia for it. Is that correct?",
          "created_utc": 1618822935.0
        }
      ]
    },
    {
      "id": "gv1mpy4",
      "author": "None",
      "body": "I should maybe recommend this to my wife. She still has an ED but is doing a lot better. She was showing me pictures of herself via Fb of before we started dating when she was really bad. I didn't really think much of it till I saw ops post and the comments here.",
      "created_utc": 1618804988.0,
      "score": 6,
      "context": [
        {
          "id": "gv1fs8m",
          "author": "grumpycatt4",
          "body": "i totally know how you feel, as i have recently come across old photos of myself as well. i think deleting them was a great decision, as it eliminates the temptation and opportunity for you to look at them again. try to think about how you felt in the time that those photos were taken, and how you feel now. personally, i feel a whole lot better and more human than i ever did during the depths of my ED. also, something that helps me is that i try to remind myself that bodies are meant to change. you will not have the same body that you had ten years ago, five years ago, hell, even one year ago. reflect on all of the great things that recovery has given you, not just focusing in on how your body has changed in that time. sending you lots of love <3",
          "created_utc": 1618800642.0
        }
      ]
    },
    {
      "id": "gv1n74c",
      "author": "grumpycatt4",
      "body": "i think any way you can support her is wonderful! the ED can sneak in whenever it finds the opportunity to, so i’m sure having someone like yourself to keep her focused on the present would be helpful!",
      "created_utc": 1618805309.0,
      "score": 2,
      "context": [
        {
          "id": "gv1fs8m",
          "author": "grumpycatt4",
          "body": "i totally know how you feel, as i have recently come across old photos of myself as well. i think deleting them was a great decision, as it eliminates the temptation and opportunity for you to look at them again. try to think about how you felt in the time that those photos were taken, and how you feel now. personally, i feel a whole lot better and more human than i ever did during the depths of my ED. also, something that helps me is that i try to remind myself that bodies are meant to change. you will not have the same body that you had ten years ago, five years ago, hell, even one year ago. reflect on all of the great things that recovery has given you, not just focusing in on how your body has changed in that time. sending you lots of love <3",
          "created_utc": 1618800642.0
        },
        {
          "id": "gv1mpy4",
          "author": "None",
          "body": "I should maybe recommend this to my wife. She still has an ED but is doing a lot better. She was showing me pictures of herself via Fb of before we started dating when she was really bad. I didn't really think much of it till I saw ops post and the comments here.",
          "created_utc": 1618804988.0
        }
      ]
    },
    {
      "id": "gv1nrj4",
      "author": "None",
      "body": "Doing what I can to help her.",
      "created_utc": 1618805691.0,
      "score": 3,
      "context": [
        {
          "id": "gv1fs8m",
          "author": "grumpycatt4",
          "body": "i totally know how you feel, as i have recently come across old photos of myself as well. i think deleting them was a great decision, as it eliminates the temptation and opportunity for you to look at them again. try to think about how you felt in the time that those photos were taken, and how you feel now. personally, i feel a whole lot better and more human than i ever did during the depths of my ED. also, something that helps me is that i try to remind myself that bodies are meant to change. you will not have the same body that you had ten years ago, five years ago, hell, even one year ago. reflect on all of the great things that recovery has given you, not just focusing in on how your body has changed in that time. sending you lots of love <3",
          "created_utc": 1618800642.0
        },
        {
          "id": "gv1mpy4",
          "author": "None",
          "body": "I should maybe recommend this to my wife. She still has an ED but is doing a lot better. She was showing me pictures of herself via Fb of before we started dating when she was really bad. I didn't really think much of it till I saw ops post and the comments here.",
          "created_utc": 1618804988.0
        },
        {
          "id": "gv1n74c",
          "author": "grumpycatt4",
          "body": "i think any way you can support her is wonderful! the ED can sneak in whenever it finds the opportunity to, so i’m sure having someone like yourself to keep her focused on the present would be helpful!",
          "created_utc": 1618805309.0
        }
      ]
    }
  ]
}