{
  "id": "mw0wnq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1619083314.0,
  "title": "Request: am i developing an ed? or am i just overreacting?",
  "selftext": "every time i eat, i feel guilty. regardless if it's considered \"healthy\" or \"trash\". i don't necessarily starve myself however. and i don't binge eat or stress eat either. or make myself throw up or anything. but i do weigh myself frequently and check my body in the mirror and want to be at a certain weight. but i always feel guilty when i eat. so i don't know if this is symptoms of some sort of ED starting or i'm just overreacting or?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mw0wnq/request_am_i_developing_an_ed_or_am_i_just/",
  "score": 52,
  "num_comments": 13,
  "comments": [
    {
      "id": "gvgbzc7",
      "author": "biggaylikewoman",
      "body": "It sounds more like disordered eating rather than an ED. However, this doesn't mean it's not serious, as disordered eating can easily become an ED. I suggest seeking help sooner rather than later.",
      "created_utc": 1619104948.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gvfp6mm",
      "author": "MunificentManatee",
      "body": "It sounds like you might not have one yet but are certainly moving in that direction. This is how many disorders start so do consider getting professional help and taking steps to actively combat the progression of these thought patterns and behavior! Stay healthy ❤️",
      "created_utc": 1619093870.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gvgizjy",
      "author": "Mizzi_38",
      "body": "It seems like this behavior is on the milder spectrum of disorderly eating. But your reaching out and asking is a great positive sign!! Good luck and try to get therapy or at least reach out for resources as soon as you can in order to set yourself up for future success. Good luck.",
      "created_utc": 1619107893.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gvh164i",
      "author": "matcha_milfshake",
      "body": "Hey there, thank you for sharing your story. Keeping in mind that I’m not a clinician, nor do I think all ED stories are the same—my teen years looked a lot like this prior to developing anorexia in my early 20s. You’re so smart to be thinking ahead and asking questions. Don’t hesitate to reach out and get therapy if you feel like it’s something you want to talk about. I wish I would’ve talked about my eating in my teen years!",
      "created_utc": 1619115409.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvh9wxp",
      "author": "lucidbaby",
      "body": "that’s how mine started :( please get some help before it progresses",
      "created_utc": 1619119114.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gvhhr6p",
      "author": "JRose2396",
      "body": "I'm sorta in the same place...I will binge eat though....I don't throw up tho. I feel guilty for everything I eat....I try to starve myself but it doesn't last long which makes me even more guilty and I dont dare weigh myself tho...it's not even a question that I'm overweight I've always been plus size I just hate my body hate myself hate food....when I eat though I start feeling sick like if I tried I could throw it up so idk I guess I'm on the verge of having an eating disorder.",
      "created_utc": 1619122512.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvftpk4",
      "author": "insecurecrossiant",
      "body": "seems like its starting, get help before its too late",
      "created_utc": 1619096491.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gvhbcvh",
      "author": "enaregee",
      "body": "listen to the redditors and seek some help. asking for help is the bravest thing you can do. wish you the best!",
      "created_utc": 1619119748.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gviabox",
      "author": "beigesheets",
      "body": "sounds like disordered eating or a distorted view towards weight! please reach out before it becomes more its a really dark path but it is such a huge step that you have realised you have a problem! id recommend therapy or a doctors appointment as well as distracting yourself with things straight after meals or creating a journal with healthy affirmations around food.",
      "created_utc": 1619135517.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvgqxn6",
      "author": "None",
      "body": "That's how my ED started",
      "created_utc": 1619111203.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gvgrhcl",
      "author": "LornWarbler",
      "body": "Yes you are DEFINETELY developing an ED, exactly how i started. Unless you want to be depressed and anxious all day and think exclusively about food all day i'd suggesting getting help now. A therapist or open up to a love done if possible",
      "created_utc": 1619111430.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvjigqp",
      "author": "speakingtruth12345",
      "body": "Honeslty I have been down this road. It starts innoccent. it starts with just simply cutting out \"bad foods\" and then it turns into cutting out almost all foods. It is a viscious cycle. I started having weekend binges because i restricted all week I was so hungry when it came to thee ed of the week. This turned into bulimia. I am now recovering from my ED and working on self love. Please, just know that you are perfect the way you are and you do not need to feel guilty about what goes into your body. For me, it was an obession. Honeslty, it was all I cared about. I lost a lot of weight a first, and then friends, and then hobbies and even some family members. It really takes a mental toll on you.",
      "created_utc": 1619162097.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvfc5rz",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1619083314.0,
      "score": 1,
      "context": []
    }
  ]
}