{
  "id": "mwzjig",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1619196398.0,
  "title": "Request: Craving calories",
  "selftext": "Hi everyone, usually I try to power through things like these alone, but I'm a bit at wits end. Over the course of the last year I've dieted down and build muscle to the point where I was easily in the best shape of my life. Bodyfat percentage was low and I had a really good physique in general. I was really happy with my diet and it was not restriction as much as just a general lifestyle change. Now since january I've lost myself a bit in this whole thing. After two or three days of decent overeating I went on another cut and dieted down to about xx - normal bmi range - (I'm 185cm). Since then I've started having the urge to cheat on my diet with highly palatable calorically dense food. At first the urges were weeks apart, but while I was on a break from Uni I've changed my daily routine. Before I wrote the bike to and from work (about 25min each) monday through friday and worked out every other day. During the break, I added bike rides on saturday and sunday and walked at least 10000 steps a day, which often blew up to about 25000. In hindsight I realize a problem with that behaviour, but back then I did not really see it. So the urges become stronger and appeared more often. When I had them, I literally could not stop eating at all. No matter how hard I tried I could not stop and consumed 6-8 thousand calories easily in a day. When I realized the context of the problem I dialed the fitness back to a normal amount again, but the hunger would not go. When I got it, it was bad, but would usually be gone after a day. The reason I'm writing this is that its wednesday today and it has not stopped since sunday. I've drastically overeaten four days in a row and I don't know if it'll stop. I'm so tired of food, but I can't stop eating. Does anyone have advice on what I should do? I think this might be hyperphagia as a result of going too low in bodyfat. I usually love my diet and I eat lower calorie high volume food, which satisfies me.\n\nRight now I am only craving high calorie food items. No matter how much I eat, I don't feel satisfied, even if I feel sick from it. No matter what I've tried the feeling won't go away. I'm exhausted mentally and physically. Would it be a good idea to see a doctor about this? Maybe get my hormones checked.\n\n&#x200B;\n\n \n\nThanks for your time! Any advice would be appreciated (but please no  general how to stop binging stuff. I've tried it all and I don't think  its due to classic binging reasons.)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mwzjig/request_craving_calories/",
  "score": 41,
  "num_comments": 7,
  "comments": [
    {
      "id": "gvl7tn3",
      "author": "ermagawd",
      "body": "I went through this after years of overexercising and restricting. Your body kinda hits a point where it NEEDS calories, and basically overrides your brain. It's a natural response to starvation. My ED doctor told me to ride it out. No restricting. I was eating 10k calories a day at one point. My weight overshot my \"setpoint\" by a few pounds but my cravings and weight went back to normal over the course of a few months. Look up the Minnesota starvation experiment. Also the minniemaud approach to eating disorder recovery. Both explain the science behind this. Your body knows best!",
      "created_utc": 1619198913.0,
      "score": 26,
      "context": []
    },
    {
      "id": "gvlk391",
      "author": "catchingnails",
      "body": "What ermagawd said^^ great explanation. In terms of advice, I’d just say “binge” on semi-healthy satisfying snacks. Apples and peanut butter make me feel like I just binged (I like to heat the peanut butter for like 30 seconds in the microwave and completely drench the apple slices in it.) along with like one or two more strips of chicken than usual, the entire can of asparagus instead of a portion, grapes and cheese feel like a charcuterie board, sweet potato dices, rice, grits, oatmeal... WINE. Just LET your body consume the calories, just try to use your logical brain instead of emotional brain to do the grocery shopping and don’t even look at the unhealthy isles. I’ve had bulimia for 10 years and that’s what I have to do to get myself out of a bad binge cycle. Just make my grocery list ahead of time, let myself binge and become totally satiated but only on foods that aren’t going to completely fuck me over in the end, and have tunnel vision going through the grocery store, literally just look straight ahead or at the floor if I have to so I don’t see anything that will tempt me for even a second. But yeah that’s just what happens when your body isn’t having delicious satiating things on the daily. Make sure you’re getting enough carbs and a little sugar to curb the crazy pendulum swing.",
      "created_utc": 1619204297.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gvm7vah",
      "author": "Ev_Do_",
      "body": "Just want to reiterate what other folks have said. \n\nFeed yourself! \n\nIt’s hard, and the ED mind is going to be yelling at you. \n\nAnd also. Think of how AMAZING your body is- this human house that you have. At any given moment, you’re regenerating cells that keep you alive, your neurons are interpreting a million different informational inputs. Your lungs are able to expand and contract to let you breathe- your bones are strong enough to support you as you move through space- your muscles and tendons and ligaments give you the ability to dance, to walk, to smile, to laugh, to nourish your beautiful home. Your stomach and intestines are able to extract exactly what you need to fuel all of these amazing systems.\n\nYour body needs to be fueled, and right now, your body is self-correcting.\n\nThe same thing happened to me when I stopped my binge/purge cycle. I was HUNGRY and ate a TON and it sucked, and yes, I gained some weight, but I needed to. And now my body is recalibrated. And it’s a vessel that allows me to live. \n\nRooting for you! Best of luck! 🧡",
      "created_utc": 1619215317.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gvll5k7",
      "author": "hannu30",
      "body": "Your body is reacting in a pretty normal way, I would say.   \nIt's gone through extremes and is trying to keep you alive.\n\nThere is no harm in going to a doctor/dietitian and trying to solve this if you feel you can't get a grip on it yourself.\n\nIt can be so many things, hard to assess from here :)",
      "created_utc": 1619204776.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gvlnpub",
      "author": "tinaa26",
      "body": "It's because you've been restricting for so long and your body can't handle it anymore. It needs calories. Just listen to your body and don't feel guilty.",
      "created_utc": 1619205928.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvml9ir",
      "author": "None",
      "body": "Ooft. I have been in a similar boat. I used to eat a restrictive amount of calories easy enough but it just got harder and harder. At the end of the day, your body is in it to save itself. You may need a break. I’ve gained 33lbs as my body reclaims vengeance. I don’t binge nearly as hard or as much as when I was almost UW. I can honestly say, I couldn’t be in the drivers seat even if I wanted to. My body was HUNGRY. My period had stopped. My skin was yellow. My anxiety was so bad. I was starving. \n\nYour body may be starving. I highly recommend looking into Stephanie Buttermore. She never had an ED (that she was aware of) but def experienced extreme hunger like you describe. She helped inspire me to give into letting my body ride out it’s need for food. \n\nIt’s HARD. omg it’s so emotionally hard. But you’re not alone.",
      "created_utc": 1619222228.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvl1yhb",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1619196398.0,
      "score": 1,
      "context": []
    }
  ]
}