{
  "id": "mx7xpo",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1619220832.0,
  "title": "Request: How to handle cravings while depressed",
  "selftext": "I have BED and finally accepted that my body needs way more calories than one might think in order to lose weight. I am eating all food groups and healthily without extreme restrictions (for ex. I can eat mac and cheese once in a while lmao), and I succeeded losing a healthy amount  in 3 weeks \n\nThe problem is that I live with my family, and my family keeps bringing very  calorie dense and unhealthy foods that can easily trigger  a binge session for me. I already talked to them, and it's like talking to a wall. I'm  already an adult, too, so I can't  blame anyone and force anyone to not bring what they want.\n\nDiverting my thoughts onto something else is very difficult for me because my depression just makes me unmotivated and fatigued most of the time (I'm  not excusing it either, and most of the time I do try to push it through, it's  just to let you know how I generally feel).\n\nI just want to know if any of you have any tips and tricks that can help with the anxiousness that cravings produce. Yesterday I binged on cookies that made me go WAY past my calorie deficit  and I almost had an anxiety attack over it. I legit don't  know how to handle these cravings other than to bite my lip and hope someone eats it quickly lmao.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/mx7xpo/request_how_to_handle_cravings_while_depressed/",
  "score": 38,
  "num_comments": 21,
  "comments": [
    {
      "id": "gvnn6wr",
      "author": "h0bbitha",
      "body": "Hey fren. Sorry you are going thru this. I also tend to binge. What helps me is setting a routine for when I feel like stuffing my face. If it’s late at night, I chug a bunch of water, blast some music on my earphones, brush and floss my teeth thoroughly, and read a chapter of a book. \n\nLiterally anything to get my mind off food. Distract yourself but have fun at the same time. If that doesn’t help, I’ll binge on guilt free snacks like fruit (frozen grapes yum) or low cal popsicles. It’s really all a mental battle. Sometiems it feels like I’m playing chess with myself lol. Hope this helps",
      "created_utc": 1619246494.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gvo7gjm",
      "author": "kodkuzen",
      "body": "honestly? whenever i feel like binging i masturbate. it's not for everyone, but it's really effective for me and i can do it anytime of the day.",
      "created_utc": 1619261760.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvodq8c",
      "author": "Caroline_Flores",
      "body": "The problem is certainly not so simple and I'm afraid our advice will not solve it. I strongly advise you to go to a psychologist, at the time it helped me a lot. I was constantly eating high-calorie food and was stressed about my excess weight. The psychologist helped me a lot then...",
      "created_utc": 1619263949.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvohaev",
      "author": "Mizzi_38",
      "body": "Meditation can be an extremely powerful tool for confronting and handling feelings. Rather than distracting form them, meditation will have you face them directly, which can be challenging, but ultimately might help you overcome those feelings and even become less suceptible to them.",
      "created_utc": 1619265185.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvrg1h6",
      "author": "Zelda_is_my_homegirl",
      "body": "Have you heard of intuitive eating? The root of binging is actually restricting. Think of it like a pendulum. If we restrict during the day, the pendulum will swing the other way and trigger a binge because you’re not feeding yourself enough. People think they’re “uncontrollable” but really our body is just trying to protect us.\n\nPerhaps check out the book intuitive eating be Elise Resch and Evelyn Tribole. Or check out Anti-Diet by Christy Harrison. The IE book focuses more on the process while Anti-diet focuses a little more on the science behind weight loss/gain, dieting, and intuitive eating. \n\nAll that being said. “Healthy” intentional weight loss has never been shown to be possible or effective long term in any scientific study. Each time we lose weight our body adjusts to prevent it in the future, so people are just weight cycling (yo-yoing) 98% of the time. Around 2% of people can keep weight off by being religious about maintaining restricting behaviors. \nThat is not to say weight loss doesn’t happen naturally. If you neutralize your relationship to food, you can find your body’s stable weight (though it may be higher than what you’d like).  \n\nI’d recommend repairing your relationship to food and your body rather than trying to lose weight and “stop binging”. I know several folks with BED that have found recovery only by giving up dieting and eating whatever their body asked for.",
      "created_utc": 1619306737.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gvqh16r",
      "author": "Lilith-Rising",
      "body": "I connect with this and have also been diagnose with BED, among other things. I think routine helps. Really once you are in your own you can decide what comes in your house, but for now you gotta work with being surrounded by all these triggers which sucks. Establishing prepared routine meals that make you feel good and satiate you will leave the triggers and cravings weaker, you will have the nutrients that day to prevent the desperate feeling of needing to eat something and binge, and you will have the energy in your system to stop when you feel like it if you do decide to indulge. Routine meals also help lower the amount of variables during weight monitoring so you won’t be in the dark about what caused any changes.",
      "created_utc": 1619288739.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvqu2rl",
      "author": "ohsnapihaveocd",
      "body": "There’s a girl I watch on YouTube who suffers with BED and is currently a personal trainer. She has really great advice for people with BED and often gives tips about how she deals with her struggle with it in basically every video. Here’s a link to a vid of hers specifically talking about it:\n\nhttps://youtu.be/kyaj9sa5dMI",
      "created_utc": 1619295292.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvminpt",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1619220833.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gw0gksc",
      "author": "iiwrench55",
      "body": "Honestly, chewing gum helps a lot for me. I find that the simple act of chewing and the flavors help distract me from whatever food I might be considering eating.",
      "created_utc": 1619495181.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvqe262",
      "author": "boqueteazul",
      "body": "Those are amazing ideas! I do need to find a routine to help me through it, I didn't  think of it that way. Also....frozen grapes sound so good ahaha. I'll  have to try those. Thanks  a lot!!",
      "created_utc": 1619287289.0,
      "score": 3,
      "context": [
        {
          "id": "gvnn6wr",
          "author": "h0bbitha",
          "body": "Hey fren. Sorry you are going thru this. I also tend to binge. What helps me is setting a routine for when I feel like stuffing my face. If it’s late at night, I chug a bunch of water, blast some music on my earphones, brush and floss my teeth thoroughly, and read a chapter of a book. \n\nLiterally anything to get my mind off food. Distract yourself but have fun at the same time. If that doesn’t help, I’ll binge on guilt free snacks like fruit (frozen grapes yum) or low cal popsicles. It’s really all a mental battle. Sometiems it feels like I’m playing chess with myself lol. Hope this helps",
          "created_utc": 1619246494.0
        }
      ]
    },
    {
      "id": "gvqev3f",
      "author": "boqueteazul",
      "body": "I'm  not gonna lie, that does sound like a really good idea to divert any thoughts. Unfortunately, it is not much for me but I find it to be a splendid idea! More power to you!",
      "created_utc": 1619287682.0,
      "score": 2,
      "context": [
        {
          "id": "gvo7gjm",
          "author": "kodkuzen",
          "body": "honestly? whenever i feel like binging i masturbate. it's not for everyone, but it's really effective for me and i can do it anytime of the day.",
          "created_utc": 1619261760.0
        }
      ]
    },
    {
      "id": "gvqeho0",
      "author": "boqueteazul",
      "body": "Yeah, I always intended to get myself professional help, and I'm  saving up money for that. Though, I've  heard that psychotherapy would be better to help with deeper issues than a nutritional therapist, but I'm  not exactly  sure.",
      "created_utc": 1619287501.0,
      "score": 1,
      "context": [
        {
          "id": "gvodq8c",
          "author": "Caroline_Flores",
          "body": "The problem is certainly not so simple and I'm afraid our advice will not solve it. I strongly advise you to go to a psychologist, at the time it helped me a lot. I was constantly eating high-calorie food and was stressed about my excess weight. The psychologist helped me a lot then...",
          "created_utc": 1619263949.0
        }
      ]
    },
    {
      "id": "gvqepdw",
      "author": "boqueteazul",
      "body": "I should start incorporating that, I've  never tried meditation before, but I've  heard many good things about it. Any tips that helped you out when meditating?",
      "created_utc": 1619287607.0,
      "score": 1,
      "context": [
        {
          "id": "gvohaev",
          "author": "Mizzi_38",
          "body": "Meditation can be an extremely powerful tool for confronting and handling feelings. Rather than distracting form them, meditation will have you face them directly, which can be challenging, but ultimately might help you overcome those feelings and even become less suceptible to them.",
          "created_utc": 1619265185.0
        }
      ]
    },
    {
      "id": "gvrpz86",
      "author": "boqueteazul",
      "body": "I've  heard about  intuitive eating many times before, and the \"intuitive vs mindful eating\" debacle somewhat. I wish I could just use my intuition to eat correctly (I recognize that it is something you need to work upon), but, I haven't  mentioned that I have never learned how to eat properly since I was 8 years old (I'm currently 22), and I had problems with how I viewed my body even before then. I've  tried a couple of times to eat whatever I wanted without counting calories, but I don't  think I can do that at the moment since I am in a precarious weight. \n\nI am simply scared for how long will my body survive by eating what it asks for until it gives. What I'm  doing right now is eating things that are mostly healthy, but also allowing myself to eat foods that are usually unhealthy if taken in big doses (I ate a healthy amount of waffles today, for example) and avoiding going hungry as much as I can. \n\nI just need to practice to feel \"ok\" with being around food without feeling it needs to be eaten. Part of the problem stems from my family  constantly  saying \"this will be the last time you eat x\", and the obligation to finish the plate. So, the feeling of \"I must eat this or I will never see it again\" persist (I've  been coping with that by telling myself: \"hey, you can literally drive to the store anytime to buy this, it won't  disappear, you don't need it right now.\" ) Doesn't  justify  my current actions of course, but it's a bit of explanation as to why I haven't  continued on to use my intuition.\n\nAnd just  to add, I might change my mind about intuitive eating once I get a professional to help me since I will finally have someone to turn to when I need it. I'm not against intuitive eating, just scared lmaooo.",
      "created_utc": 1619312209.0,
      "score": 1,
      "context": [
        {
          "id": "gvrg1h6",
          "author": "Zelda_is_my_homegirl",
          "body": "Have you heard of intuitive eating? The root of binging is actually restricting. Think of it like a pendulum. If we restrict during the day, the pendulum will swing the other way and trigger a binge because you’re not feeding yourself enough. People think they’re “uncontrollable” but really our body is just trying to protect us.\n\nPerhaps check out the book intuitive eating be Elise Resch and Evelyn Tribole. Or check out Anti-Diet by Christy Harrison. The IE book focuses more on the process while Anti-diet focuses a little more on the science behind weight loss/gain, dieting, and intuitive eating. \n\nAll that being said. “Healthy” intentional weight loss has never been shown to be possible or effective long term in any scientific study. Each time we lose weight our body adjusts to prevent it in the future, so people are just weight cycling (yo-yoing) 98% of the time. Around 2% of people can keep weight off by being religious about maintaining restricting behaviors. \nThat is not to say weight loss doesn’t happen naturally. If you neutralize your relationship to food, you can find your body’s stable weight (though it may be higher than what you’d like).  \n\nI’d recommend repairing your relationship to food and your body rather than trying to lose weight and “stop binging”. I know several folks with BED that have found recovery only by giving up dieting and eating whatever their body asked for.",
          "created_utc": 1619306737.0
        }
      ]
    },
    {
      "id": "gvrmgqu",
      "author": "boqueteazul",
      "body": "Someone else mentioned routines as well, and I really do need to get back into that. My parents hate it when I cook (too long to explain why lmao), so I might as well make prep meals for multiple days since  it's  the safest shot. It might  help remove the need to constantly  need to think about  what to do for the next meal.",
      "created_utc": 1619310241.0,
      "score": 1,
      "context": [
        {
          "id": "gvqh16r",
          "author": "Lilith-Rising",
          "body": "I connect with this and have also been diagnose with BED, among other things. I think routine helps. Really once you are in your own you can decide what comes in your house, but for now you gotta work with being surrounded by all these triggers which sucks. Establishing prepared routine meals that make you feel good and satiate you will leave the triggers and cravings weaker, you will have the nutrients that day to prevent the desperate feeling of needing to eat something and binge, and you will have the energy in your system to stop when you feel like it if you do decide to indulge. Routine meals also help lower the amount of variables during weight monitoring so you won’t be in the dark about what caused any changes.",
          "created_utc": 1619288739.0
        }
      ]
    },
    {
      "id": "gvrmsxt",
      "author": "boqueteazul",
      "body": "Omggg I LOVE her videos! I binged watched most of them already, and I do agree that she does give amazing advice! It's actually partially thanks to her that I am allowing myself to intake higher calories haha. I like that she was in a same position I am currently in, and I give her props for improving  her life!",
      "created_utc": 1619310430.0,
      "score": 2,
      "context": [
        {
          "id": "gvqu2rl",
          "author": "ohsnapihaveocd",
          "body": "There’s a girl I watch on YouTube who suffers with BED and is currently a personal trainer. She has really great advice for people with BED and often gives tips about how she deals with her struggle with it in basically every video. Here’s a link to a vid of hers specifically talking about it:\n\nhttps://youtu.be/kyaj9sa5dMI",
          "created_utc": 1619295292.0
        }
      ]
    },
    {
      "id": "gvrh3p9",
      "author": "Zelda_is_my_homegirl",
      "body": "I recommend a dietician trained in eating disorders and intuitive eating. I have a lot of baggage when it comes to food and that type of dietician almost works like a counselor to talk you through food-specific issues. \n\nLike I wasn’t eating frequently enough during the day which was making me eat a lot more during meals and binge at night.",
      "created_utc": 1619307318.0,
      "score": 2,
      "context": [
        {
          "id": "gvodq8c",
          "author": "Caroline_Flores",
          "body": "The problem is certainly not so simple and I'm afraid our advice will not solve it. I strongly advise you to go to a psychologist, at the time it helped me a lot. I was constantly eating high-calorie food and was stressed about my excess weight. The psychologist helped me a lot then...",
          "created_utc": 1619263949.0
        },
        {
          "id": "gvqeho0",
          "author": "boqueteazul",
          "body": "Yeah, I always intended to get myself professional help, and I'm  saving up money for that. Though, I've  heard that psychotherapy would be better to help with deeper issues than a nutritional therapist, but I'm  not exactly  sure.",
          "created_utc": 1619287501.0
        }
      ]
    },
    {
      "id": "gy624le",
      "author": "Mizzi_38",
      "body": "There are many different approaches and ways of thinking about mediation, but I would say that it can be very helpful to make it a regular (perhaps daily) practice. The biggest piece of advice I have is to meditate when you feel good and neutral in addition to when you feel bad. That way, it can be easier to get into it and won't necessarily feel like such a chore. The other thing is that while 10 minutes a day is a helpful model for some, meditation can be done with just 10 seconds. Even just pausing to take a single, mindful breath can help set you in a good direction. I like to incorporate meditation flexibly into my day, and it doesn't happen every day for me right now. I hope you are able to keep caring for yourself.",
      "created_utc": 1621041370.0,
      "score": 1,
      "context": [
        {
          "id": "gvohaev",
          "author": "Mizzi_38",
          "body": "Meditation can be an extremely powerful tool for confronting and handling feelings. Rather than distracting form them, meditation will have you face them directly, which can be challenging, but ultimately might help you overcome those feelings and even become less suceptible to them.",
          "created_utc": 1619265185.0
        },
        {
          "id": "gvqepdw",
          "author": "boqueteazul",
          "body": "I should start incorporating that, I've  never tried meditation before, but I've  heard many good things about it. Any tips that helped you out when meditating?",
          "created_utc": 1619287607.0
        }
      ]
    },
    {
      "id": "gvs0svz",
      "author": "Zelda_is_my_homegirl",
      "body": "It’s really hard. I have never eaten correctly either. I have had issues with dieting, starvation, binge eating and purging for about 22 years. \n\nIntuitive eating was terrifying and incredibly difficult in the beginning. I’ve been at it about 5 months and am finally starting to feel relaxed around food. \n\nWhen you don’t feel like there’s scarcity around food (mentally or physically) that last supper mentality you mentioned starts to go away and you don’t feel like you have to “get it while you can”. \n\nI definitely recommend seeking a professional though. It sounds like you have a lot to deal with around food.",
      "created_utc": 1619318281.0,
      "score": 3,
      "context": [
        {
          "id": "gvrg1h6",
          "author": "Zelda_is_my_homegirl",
          "body": "Have you heard of intuitive eating? The root of binging is actually restricting. Think of it like a pendulum. If we restrict during the day, the pendulum will swing the other way and trigger a binge because you’re not feeding yourself enough. People think they’re “uncontrollable” but really our body is just trying to protect us.\n\nPerhaps check out the book intuitive eating be Elise Resch and Evelyn Tribole. Or check out Anti-Diet by Christy Harrison. The IE book focuses more on the process while Anti-diet focuses a little more on the science behind weight loss/gain, dieting, and intuitive eating. \n\nAll that being said. “Healthy” intentional weight loss has never been shown to be possible or effective long term in any scientific study. Each time we lose weight our body adjusts to prevent it in the future, so people are just weight cycling (yo-yoing) 98% of the time. Around 2% of people can keep weight off by being religious about maintaining restricting behaviors. \nThat is not to say weight loss doesn’t happen naturally. If you neutralize your relationship to food, you can find your body’s stable weight (though it may be higher than what you’d like).  \n\nI’d recommend repairing your relationship to food and your body rather than trying to lose weight and “stop binging”. I know several folks with BED that have found recovery only by giving up dieting and eating whatever their body asked for.",
          "created_utc": 1619306737.0
        },
        {
          "id": "gvrpz86",
          "author": "boqueteazul",
          "body": "I've  heard about  intuitive eating many times before, and the \"intuitive vs mindful eating\" debacle somewhat. I wish I could just use my intuition to eat correctly (I recognize that it is something you need to work upon), but, I haven't  mentioned that I have never learned how to eat properly since I was 8 years old (I'm currently 22), and I had problems with how I viewed my body even before then. I've  tried a couple of times to eat whatever I wanted without counting calories, but I don't  think I can do that at the moment since I am in a precarious weight. \n\nI am simply scared for how long will my body survive by eating what it asks for until it gives. What I'm  doing right now is eating things that are mostly healthy, but also allowing myself to eat foods that are usually unhealthy if taken in big doses (I ate a healthy amount of waffles today, for example) and avoiding going hungry as much as I can. \n\nI just need to practice to feel \"ok\" with being around food without feeling it needs to be eaten. Part of the problem stems from my family  constantly  saying \"this will be the last time you eat x\", and the obligation to finish the plate. So, the feeling of \"I must eat this or I will never see it again\" persist (I've  been coping with that by telling myself: \"hey, you can literally drive to the store anytime to buy this, it won't  disappear, you don't need it right now.\" ) Doesn't  justify  my current actions of course, but it's a bit of explanation as to why I haven't  continued on to use my intuition.\n\nAnd just  to add, I might change my mind about intuitive eating once I get a professional to help me since I will finally have someone to turn to when I need it. I'm not against intuitive eating, just scared lmaooo.",
          "created_utc": 1619312209.0
        }
      ]
    },
    {
      "id": "gvrm5s3",
      "author": "boqueteazul",
      "body": "Thank you for letting me know your experience with someone that specializes in eating disorders. I needed to hear what ppl thought about them. I'll  take your opinion into consideration because I am aware that my ED stems from past issues.",
      "created_utc": 1619310074.0,
      "score": 1,
      "context": [
        {
          "id": "gvodq8c",
          "author": "Caroline_Flores",
          "body": "The problem is certainly not so simple and I'm afraid our advice will not solve it. I strongly advise you to go to a psychologist, at the time it helped me a lot. I was constantly eating high-calorie food and was stressed about my excess weight. The psychologist helped me a lot then...",
          "created_utc": 1619263949.0
        },
        {
          "id": "gvqeho0",
          "author": "boqueteazul",
          "body": "Yeah, I always intended to get myself professional help, and I'm  saving up money for that. Though, I've  heard that psychotherapy would be better to help with deeper issues than a nutritional therapist, but I'm  not exactly  sure.",
          "created_utc": 1619287501.0
        },
        {
          "id": "gvrh3p9",
          "author": "Zelda_is_my_homegirl",
          "body": "I recommend a dietician trained in eating disorders and intuitive eating. I have a lot of baggage when it comes to food and that type of dietician almost works like a counselor to talk you through food-specific issues. \n\nLike I wasn’t eating frequently enough during the day which was making me eat a lot more during meals and binge at night.",
          "created_utc": 1619307318.0
        }
      ]
    },
    {
      "id": "gvuvad5",
      "author": "boqueteazul",
      "body": "First  of all, congrats on going for so long in providing  your body what it wants and needs! It's  amazing that you are able to fight through  it, it isn't  easy but I'm  proud of you for coming this far 💕 \n\nI want my body to know that I won't miss out on anything. For now, I am only tracking the general amount of calories I consume (I try to not be exact with  numbers either) so that I can learn to eyeball how much is ok for me.Regardless, I'll have to implement  intuitive eating in the future, because no one should live their whole lives tracking anything. Your body is supposed  to do that for you. \n\nThank you so much for your input, though! I'll  make sure I check out those books since I do need to educate myself  more in regards to intuitive eating, and the science behind it. And once again, I'm  super happy for your improvement! Keep fighting!",
      "created_utc": 1619383746.0,
      "score": 2,
      "context": [
        {
          "id": "gvrg1h6",
          "author": "Zelda_is_my_homegirl",
          "body": "Have you heard of intuitive eating? The root of binging is actually restricting. Think of it like a pendulum. If we restrict during the day, the pendulum will swing the other way and trigger a binge because you’re not feeding yourself enough. People think they’re “uncontrollable” but really our body is just trying to protect us.\n\nPerhaps check out the book intuitive eating be Elise Resch and Evelyn Tribole. Or check out Anti-Diet by Christy Harrison. The IE book focuses more on the process while Anti-diet focuses a little more on the science behind weight loss/gain, dieting, and intuitive eating. \n\nAll that being said. “Healthy” intentional weight loss has never been shown to be possible or effective long term in any scientific study. Each time we lose weight our body adjusts to prevent it in the future, so people are just weight cycling (yo-yoing) 98% of the time. Around 2% of people can keep weight off by being religious about maintaining restricting behaviors. \nThat is not to say weight loss doesn’t happen naturally. If you neutralize your relationship to food, you can find your body’s stable weight (though it may be higher than what you’d like).  \n\nI’d recommend repairing your relationship to food and your body rather than trying to lose weight and “stop binging”. I know several folks with BED that have found recovery only by giving up dieting and eating whatever their body asked for.",
          "created_utc": 1619306737.0
        },
        {
          "id": "gvrpz86",
          "author": "boqueteazul",
          "body": "I've  heard about  intuitive eating many times before, and the \"intuitive vs mindful eating\" debacle somewhat. I wish I could just use my intuition to eat correctly (I recognize that it is something you need to work upon), but, I haven't  mentioned that I have never learned how to eat properly since I was 8 years old (I'm currently 22), and I had problems with how I viewed my body even before then. I've  tried a couple of times to eat whatever I wanted without counting calories, but I don't  think I can do that at the moment since I am in a precarious weight. \n\nI am simply scared for how long will my body survive by eating what it asks for until it gives. What I'm  doing right now is eating things that are mostly healthy, but also allowing myself to eat foods that are usually unhealthy if taken in big doses (I ate a healthy amount of waffles today, for example) and avoiding going hungry as much as I can. \n\nI just need to practice to feel \"ok\" with being around food without feeling it needs to be eaten. Part of the problem stems from my family  constantly  saying \"this will be the last time you eat x\", and the obligation to finish the plate. So, the feeling of \"I must eat this or I will never see it again\" persist (I've  been coping with that by telling myself: \"hey, you can literally drive to the store anytime to buy this, it won't  disappear, you don't need it right now.\" ) Doesn't  justify  my current actions of course, but it's a bit of explanation as to why I haven't  continued on to use my intuition.\n\nAnd just  to add, I might change my mind about intuitive eating once I get a professional to help me since I will finally have someone to turn to when I need it. I'm not against intuitive eating, just scared lmaooo.",
          "created_utc": 1619312209.0
        },
        {
          "id": "gvs0svz",
          "author": "Zelda_is_my_homegirl",
          "body": "It’s really hard. I have never eaten correctly either. I have had issues with dieting, starvation, binge eating and purging for about 22 years. \n\nIntuitive eating was terrifying and incredibly difficult in the beginning. I’ve been at it about 5 months and am finally starting to feel relaxed around food. \n\nWhen you don’t feel like there’s scarcity around food (mentally or physically) that last supper mentality you mentioned starts to go away and you don’t feel like you have to “get it while you can”. \n\nI definitely recommend seeking a professional though. It sounds like you have a lot to deal with around food.",
          "created_utc": 1619318281.0
        }
      ]
    }
  ]
}