{
  "id": "myaabi",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1619363682.0,
  "title": "Request: I’m not thin enough to feel loved",
  "selftext": "My mom is extremely critical of my weight. Even when I was a child and growing up my mom would always tell me “you need to stop eating before you gain weight” or that “you can’t let yourself get fat”. One day I asked her if she would love me more if I was thinner and she replied “I only want my children to be healthy” and avoided the real answer. When I was 18 I became chronically ill due to my restrictive eating (in and out of hospitals) and I lost a lot of weight. My moms response was to tell me how jealous she was of me and that she “loved that I lost weight, it just sucks it had to be this way”. I’m now 23 and obviously, no longer chronically ill, and have gained some weight back. But now I’m back to believing that because I’m not bone skinny, I can’t be accepted... I keep having dreams of cutting out my stomach or getting a gastric bypass surgery just so I don’t have to eat... I lay in bed all day and cry. I’m in a spiraling cycle and I need help.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/myaabi/request_im_not_thin_enough_to_feel_loved/",
  "score": 103,
  "num_comments": 11,
  "comments": [
    {
      "id": "gvttwqg",
      "author": "Fickle_Orchid",
      "body": "Please reach out to your doctor.  Your mom has her own issues that are actively harming you, and you need support to get away from that.",
      "created_utc": 1619366046.0,
      "score": 27,
      "context": []
    },
    {
      "id": "gvtx6dv",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1619367609.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gvvdiss",
      "author": "Iamtrulyhappy",
      "body": "Okay. So please see your doctor. This is a lot of your moms issues. \n\nMy mom was like this. \n\nI told her this: \n\nMy weight is not up for discussion, DO NOT bring it up again. \n\nYou are valued and loved. I want you to write down any good/nutural things about you that you like. No weight related.",
      "created_utc": 1619392892.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gvuaffz",
      "author": "Zelda_is_my_homegirl",
      "body": "I know it’s hard. I lost my Gallbladder due to starvation and then lost even more. It was the worst I had felt in my life. Like every day I was literally dying and wanted to eat and couldn’t. \n\nMy mom would not stop gushing about it. I stayed with her overnight for 2 days after my gallbladder removal and she kept saying “oh my god. Look at you! You barely even have a tummy. “ or something of that nature about every 3 hours while there. If I’m honest, her acting that way along with how I felt while sick, and my feelings about my body still being negative even after losing a ton is what made me seek recovery. \n\nI have gained a good portion of the weight back, but I’m also much happier and freer now. More mental clarity and room for other thoughts, more time for myself, and less hating myself. It’s extremely difficult but so worth it. \n\nI strongly recommend you seek help from a professional skilled with eating disorders and trauma.",
      "created_utc": 1619373810.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvw06a2",
      "author": "iactuallyruntho",
      "body": "Your mom is horrible. \n\nShe’s engineering a situation which could actually kill you and what gives her the right??! Horrible, just horrible.\n\nFind the strength block out her cruelty (ear plugs are fantastic!).. you can also try some behavior modification techniques- e.g. walking away the second she make comments like these (no matter where you are or what you’re doing- straight up LEAVE, immediately). Explain later you will not tolerate backhanded or insensitive comments related to your weight and that it’s a zero tolerance issue for you. She fucks up, you leave that second and disengage.\n\nBecause honestly, no matter how dumb she might play, she KNOWS what she’s doing.\n\nAnd how fucking dare she.\n\n\nETA my dad is exactly like your mom so it’s bit of a sore spot for me. Sorry for the forcefulness of my post, reading the things she said to you rang too familiar and 🤯 ..",
      "created_utc": 1619405572.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gvw82rj",
      "author": "ChessPlayer_07",
      "body": "Self love is such challenging journey.  It can be a long and hard journey but its worth every step you have to travel to get there.     Make it your goal and your passion to learn it.   Read what you can on the subject, join support groups, get professional help if you can.      God bless.",
      "created_utc": 1619410481.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gvtp4zt",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1619363682.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gvwnxzf",
      "author": "None",
      "body": "My mom is also like that! A while ago I was asking for a sauce but she refused and told me that \"No!you are fat\". She also told me that I have a body of a mother who had just given birth. I always cry because of her and she keeps on telling me that when she was young she was only 45 kg",
      "created_utc": 1619423214.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwdzgkt",
      "author": "battleaxe_rat",
      "body": "I'm 19 and female and 5'6 height. \nI was 178 lbs at my highest. I'm 136 now. I want to reach 120 or 115. My guy friends said they liked my booty, and when I bounced when I walked. \"You've lost too much weight. You're too skinny. I can see your ribs. It looks like you dropped two bra sizes. We (straight men) like curves, they're what makes a woman look appealing and cute and snuggly.\"\n\nI feel so crappy about my weight. Whenever a bf would gently grab my flank/hips and pull me into him or feel me up in a really cute way, it was embarrassing to feel fat. It made me cry because someone else liked my body for what it was even though I'm ashamed of it. But it was also really sweet and felt so... kind. How could anyone be so kind? \n\nAll I can say is, in terms of romantic love, it's hard to snuggle a bony twig without being scared of literally breaking them. Try to think of how nice it'd feel to have someone laying on your chest, snuggling their head into your boobs [*assuming you're female] and just enjoying your feminine curves and squishy softness. I know it feels so, so good to be wanted, to be appreciated. To feel worth something.\n\nTry watching some commentary videos on the effects of eating disorders. They can be pretty bad and totally fuck your body up for the rest of your life. The testimonials serve as a deterrent from letting things get out of hand with my ED.",
      "created_utc": 1619756858.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwunlkr",
      "author": "arianabanana30",
      "body": "I dont know what advice to give since Ive been dealing with the same my entire life but I can definitely relate. My whole life my parents have told me that I need to lose weight or that my butt is too big or that Im getting fat or that I am fat, etc. Its led to me hating my body and constantly obsessing over how and look and never being happy with my body. I even avoid mirrors and am currently eating once a day and really tiny portions so I can lose weight. It really sucks and parents do not realize that this really messes with us badly. No matter what you are loved and you are beautiful. Do not let your mother make you feel like you shouldnt be loved. I understand you when it comes to this....",
      "created_utc": 1620089053.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwuno9y",
      "author": "arianabanana30",
      "body": "Same.",
      "created_utc": 1620089089.0,
      "score": 2,
      "context": [
        {
          "id": "gvtx6dv",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1619367609.0
        }
      ]
    },
    {
      "id": "gvwo0f1",
      "author": "None",
      "body": "I actually lost a few kg during quarantine but they notice I am gaining it all back",
      "created_utc": 1619423280.0,
      "score": 1,
      "context": [
        {
          "id": "gvwnxzf",
          "author": "None",
          "body": "My mom is also like that! A while ago I was asking for a sauce but she refused and told me that \"No!you are fat\". She also told me that I have a body of a mother who had just given birth. I always cry because of her and she keeps on telling me that when she was young she was only 45 kg",
          "created_utc": 1619423214.0
        }
      ]
    }
  ]
}