{
  "id": "n09pfz",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1619596199.0,
  "title": "Request: I want to stop caring and love food again",
  "selftext": "Hi all! \n\nI’m writing this because I honestly don’t know what to do. I’ve been struggling to eat.. honestly anything for the last month/last 2 months. I don’t really know what triggered me so badly, but I feel guilty whenever I eat. I don’t see food as ‘oh yummy, food!’ anymore but as carbs, calories and sugar that will make me fat and I hate that I think about food this way. \n\nI am very good at hiding it, whenever I’m with other people I just eat, doesn’t matter how much or if it’s healthy or unhealthy, but all I can think about when I eat (especially something with a lot of sugars/calories/carbs) is how this will affect my weight and my body. Let’s just say that if I would be alone 24/7, I would probably only eat breakfast for the entire day and that’s it (which is so dangerous). \n\nI also just feel guilty when thinking about things I love (or loved) to eat, like chocolate and I can’t imagine people eating something just because they like it. For example, my friend was eating a chocolate bar while we were in a Zoom meeting, and all I could think about is how she could eat something like that without feeling guilty. That’s when I realized there’s something very wrong and dangerous about my mindset, not with her just enjoying her food. \n\nI downloaded this one app a few days ago that gives you advice on how many calories you should have, and I’ve been tracking it like CRAZY, almost obsessive, so I think that triggered me even more. I absolutely hate myself when I eat more than the recommended amount of calories and wanna punish myself the day after.\n\nSo, I know this is very complicated, maybe too complicated for a simple Reddit post, but can someone please give me some advice on how I can stop caring so so so much about carbs, sugars and calories so I can eat whatever I want. I’m afraid I’m losing control and that I’ll ACTUALLY only eat breakfast, instead of only thinking about it.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/n09pfz/request_i_want_to_stop_caring_and_love_food_again/",
  "score": 54,
  "num_comments": 11,
  "comments": [
    {
      "id": "gw5mxd5",
      "author": "Dingdongdiddykong69",
      "body": "Im not a professional and currently struggle with ED as well but from my experience with obsessive tracking and guilt from eating this is what helped me.\n\nGet rid of the scale. And definitely don’t use those tracking apps like myfitnesspal because since you have this relationship with food, it will only make things worse. Delete it. \nTry not to count calories, and instead focus on eating regular, balanced meals..\n\nRemember that your body will burn calories from just existing (TDEE) so i just eat 3 meals with some snacks (including “unhealthy” things from time to time) and try to block food tracking from my mind throughout the day. I think you should get a dietician to give you a food plan of what your body needs exactly. (Will probably be eat 2-3 hours, 3 meals and 2-3 small snacks) because remember that it pretty much averages out to have your body burn those calories anyway when you eat this way. \n\nI added a bit of strength training and a bit of cardio just so i can eat more and increase metabolism lol... but important not to overexercise, obsessively count how much you burn, not weigh yourself. I try to close my eyes and trust the process mindlessly and focus on other things\n\nMay seem weird but I just tell myself that people without EDs eat regular meals and snacks, enjoy carbs and sugar, and exercise moderately and live their lives fine with stable weight without restricting... \n\nDefinitely seek professional help cause i know that food guilt mindset is difficult to deal with by yourself:( they will help you improve much faster and make sure you stay on track. and this is my experience after a lot of time with a dietician, eating disorder specialists and a therapist. I still feel guilty after eating sometimes and have negative thoughts about my body but its a process",
      "created_utc": 1619605191.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gw734kf",
      "author": "None",
      "body": "I'm sorry to hear that your going through this. The first thing you should do is delete that app. Right now. The second thing you should do is find a therapist who specializes in eating disorders.  You can go on psychologytoday.com and sort by location, specialty,  gender, and can even reach out to them. You CAN and deserve to love and appreciate food again and not stress over it, you just need a little help.",
      "created_utc": 1619631530.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gw8333d",
      "author": "punkrocklibrarian",
      "body": "Please know that you're not alone, and the programming from our society has really messed up a lot of people on what to eat, and how we're supposed to look. It can take a long time to undo that and find what's right for you. Try to have some compassion for yourself. \n\nThere are two ideas that have helped me recently. First, letting go of the identity of being a thin person. I realized how much suffering was caused by my need for others to perceive me that way. Without trying to unpack all the reasons WHY I have that identity, I simply ask myself, \"what would I do if I didn't have the identity of a thin person?\" and it has helped me through a lot. \n\nThe second is asking myself how I'll physically feel after I eat something. Meals are relatively short, but they're followed by many hours of having that food in your body, energizing you. I tell myself I can eat whatever I want, but to at least consider how I'll feel afterward. Sometimes that means eating processed sugar, because I truly feel it will be satisfying and my body is asking for it. Other times it means eating an apple. The point is, try letting your body tell you what it wants, simply by asking how you'll feel afterward, without prejudgment. \n\nI hope that provides some help. I don't know much, but I've been struggling with this for a long time and have made some progress here and there. Feel free to send me a message if you ever want to talk through more of this.",
      "created_utc": 1619646760.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gw5di6e",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1619596199.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gw80e8t",
      "author": "tinaa26",
      "body": "What helped me is simply eating. Even though you feel guilty, keep on eating normal amounts of food (at least 3 meals + snacks). I did this and at the beginning I felt so guilty and wanted to cry after every meal. Then the guilt simply disappeared. I still have some bad days but it's so much better. Also I didn't gain weight at all, but even if you do it's okay. If you need to work so hard to maintain a certain weight then it's not the healthy weight for you, also it's not sustainable and it ruins you mentally. You can also check @millyg_fit on ig.",
      "created_utc": 1619645558.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwe1f5s",
      "author": "battleaxe_rat",
      "body": "Start small with drinks or something. I LOVE green tea lemonade and make myself a pitcher of it whenever I have time on my days off (I work full time). Hot tea with milk or cream is also pretty nice and calming in the evenings.\nYou're obviously tense from the ED (I know I am from my own), so I think the hot tea will help you relax a little, plus milk is supposed to make you sleepy. If you're well rested you'll likely feel better.\n\nBoth these drinks are mostly water, so I don't find them especially intimidating, but they also just make me feel good.\n\nWhat I also do is make food at home like cheesecake and steak n whatnot.\nIt's easier when the calorie count isn't on a label, and I know what all is going into the dish so I'm not paranoid about unhealthy added sugars.\nTrust me, I internally freak out when I see added sugars on food labels. \n\nI've lost 50 lbs in 5 months from hardly eating and working so many hours and I get so hungry every few weeks I HAVE to get meat in my diet so I buy my own steak even tho my fam is making whatever else for dinner.\n\nAlso Greek yogurt with honey and blueberries is tasty. And cottage cheese with some blackberry jam mixed in is another favorite.",
      "created_utc": 1619758174.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gw5o7ng",
      "author": "yayo-motels",
      "body": "op here. Thank you so so much for your response and for sharing your experiences with me. Everything you described makes so much sense, so I hope I can find someone who can help me with this issue + give me an idea of what my body needs, I (clearly) really need it. Myfitnesspal can’t do that for me (so I’m going to delete it right after I reply to your message. It’s hard, but it’s a great (but also a big step, since I currently depend on it so much)). Thank you again, it means a lot to me :).",
      "created_utc": 1619606315.0,
      "score": 4,
      "context": [
        {
          "id": "gw5mxd5",
          "author": "Dingdongdiddykong69",
          "body": "Im not a professional and currently struggle with ED as well but from my experience with obsessive tracking and guilt from eating this is what helped me.\n\nGet rid of the scale. And definitely don’t use those tracking apps like myfitnesspal because since you have this relationship with food, it will only make things worse. Delete it. \nTry not to count calories, and instead focus on eating regular, balanced meals..\n\nRemember that your body will burn calories from just existing (TDEE) so i just eat 3 meals with some snacks (including “unhealthy” things from time to time) and try to block food tracking from my mind throughout the day. I think you should get a dietician to give you a food plan of what your body needs exactly. (Will probably be eat 2-3 hours, 3 meals and 2-3 small snacks) because remember that it pretty much averages out to have your body burn those calories anyway when you eat this way. \n\nI added a bit of strength training and a bit of cardio just so i can eat more and increase metabolism lol... but important not to overexercise, obsessively count how much you burn, not weigh yourself. I try to close my eyes and trust the process mindlessly and focus on other things\n\nMay seem weird but I just tell myself that people without EDs eat regular meals and snacks, enjoy carbs and sugar, and exercise moderately and live their lives fine with stable weight without restricting... \n\nDefinitely seek professional help cause i know that food guilt mindset is difficult to deal with by yourself:( they will help you improve much faster and make sure you stay on track. and this is my experience after a lot of time with a dietician, eating disorder specialists and a therapist. I still feel guilty after eating sometimes and have negative thoughts about my body but its a process",
          "created_utc": 1619605191.0
        }
      ]
    },
    {
      "id": "gw86hss",
      "author": "yayo-motels",
      "body": "Thank you so much for your message. I deleted the app and it was relieving, but also a little scary not knowing how many calories my dinner was that I had a few hours ago (+ I didn’t cook it myself so didn’t even get the chance to check the packages, such a big step for me tbh) but it’s okay, and I hope I’ll be too. I’m not in the usa though, so I don’t know if psychologytoday.com will work for me, but I’m going to search for options that are available in my country, because I think I really need a little help with everything, just like you said. Thank you so much again :).",
      "created_utc": 1619648337.0,
      "score": 1,
      "context": [
        {
          "id": "gw734kf",
          "author": "None",
          "body": "I'm sorry to hear that your going through this. The first thing you should do is delete that app. Right now. The second thing you should do is find a therapist who specializes in eating disorders.  You can go on psychologytoday.com and sort by location, specialty,  gender, and can even reach out to them. You CAN and deserve to love and appreciate food again and not stress over it, you just need a little help.",
          "created_utc": 1619631530.0
        }
      ]
    },
    {
      "id": "gwa5oso",
      "author": "yayo-motels",
      "body": "Thank you so much. You’re so right about the society part. Maybe it’s nothing, but I unfollowed all influencers on IG yesterday who are basically the perfect example of what society wants us to look like. It’s weird not seeing them on my timeline anymore, but I don’t wanna look at their workouts, what-I-eat-in-a-day-to-stay-in-shape-hihi and croptops anymore. I hope it will help me a little, so I can’t compare myself to them anymore. \n\nSecond of all, that’s such good advice. I indeed feel like I have to be thin so others won’t ‘judge me’ or something like that, which is... bizarre. If I feel fine, who are they to criticize me...? It sucks that other people have such a big influence on us, that big that we’re allowing ourselves to suffer this much. \n\nThank you so much again.",
      "created_utc": 1619693533.0,
      "score": 1,
      "context": [
        {
          "id": "gw8333d",
          "author": "punkrocklibrarian",
          "body": "Please know that you're not alone, and the programming from our society has really messed up a lot of people on what to eat, and how we're supposed to look. It can take a long time to undo that and find what's right for you. Try to have some compassion for yourself. \n\nThere are two ideas that have helped me recently. First, letting go of the identity of being a thin person. I realized how much suffering was caused by my need for others to perceive me that way. Without trying to unpack all the reasons WHY I have that identity, I simply ask myself, \"what would I do if I didn't have the identity of a thin person?\" and it has helped me through a lot. \n\nThe second is asking myself how I'll physically feel after I eat something. Meals are relatively short, but they're followed by many hours of having that food in your body, energizing you. I tell myself I can eat whatever I want, but to at least consider how I'll feel afterward. Sometimes that means eating processed sugar, because I truly feel it will be satisfying and my body is asking for it. Other times it means eating an apple. The point is, try letting your body tell you what it wants, simply by asking how you'll feel afterward, without prejudgment. \n\nI hope that provides some help. I don't know much, but I've been struggling with this for a long time and have made some progress here and there. Feel free to send me a message if you ever want to talk through more of this.",
          "created_utc": 1619646760.0
        }
      ]
    },
    {
      "id": "gw8uqs7",
      "author": "None",
      "body": "Good for you!! I know that the anxiety can be very tough to deal with and you should be very proud of yourself for overcoming it ! Best of luck to you,  take care of yourself",
      "created_utc": 1619660035.0,
      "score": 2,
      "context": [
        {
          "id": "gw734kf",
          "author": "None",
          "body": "I'm sorry to hear that your going through this. The first thing you should do is delete that app. Right now. The second thing you should do is find a therapist who specializes in eating disorders.  You can go on psychologytoday.com and sort by location, specialty,  gender, and can even reach out to them. You CAN and deserve to love and appreciate food again and not stress over it, you just need a little help.",
          "created_utc": 1619631530.0
        },
        {
          "id": "gw86hss",
          "author": "yayo-motels",
          "body": "Thank you so much for your message. I deleted the app and it was relieving, but also a little scary not knowing how many calories my dinner was that I had a few hours ago (+ I didn’t cook it myself so didn’t even get the chance to check the packages, such a big step for me tbh) but it’s okay, and I hope I’ll be too. I’m not in the usa though, so I don’t know if psychologytoday.com will work for me, but I’m going to search for options that are available in my country, because I think I really need a little help with everything, just like you said. Thank you so much again :).",
          "created_utc": 1619648337.0
        }
      ]
    }
  ]
}