{
  "id": "n0yon5",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1619679016.0,
  "title": "Request: I have atypical anorexia, but wish I was sicker. Now I understand the cruel competitiveness of EDs.",
  "selftext": "After years of restrictive eating, into laxative abuse, diet fads, pills, fasting, purging while restricting, and bingeing without purging (never felt full, always just felt empty — it was depression emptiness and I didn’t know then), I got diagnosed with atypical anorexia yesterday. \n\nFor a moment, it made sense. I finally had a name to the awfulness that I consistently felt about my body and weight, after long last, over 15 years later. I had eating and body image issues for the longest time, except I felt it was normal seeing as I was a fat person. My stomach constantly grew in size (in my perspective). As a 23 year old, I haven’t been in a healthy weight range nor underweight (per BMI) for maybe 15 of those years. I still am not, today. \n\nIt was last year, in the midst of deep depression and watching way too much youtube in bed, that i started to realise how my meals in a day were much less than normal. I would see What I Eat In A Day videos and realise that a person’s one single meal out of three would still amount to more than everything that I’d let myself eat in an entire day. And even then, I still felt the need to starve myself even more. \n\nBut very quickly after the words ‘atypical anorexia’ came out, did the competitiveness start. I started thinking — what a failure, i couldn’t even lose enough weight to have ‘actual’ anorexia. My ECG results showed sinus tachycardia and borderline right axis deviation, which was otherwise considered normal, and I was frustrated that I hadn’t ruined myself enough to have low blood pressure, bradycardia, risk of heart failure (i struggle with suicide too, and it seemed inviting) — was I not starving myself enough? Even when I knew that my higher blood pressure and tachycardia is possibly the result of being on the riskiest dose of Effexor XR (at 350mg, where it increases blood pressure), I felt so disappointed that I couldn’t even get sick enough. \n\nI’d lost 21% of my body weight within a year, but yet have still been well above the healthy BMI range. 21% is significant, I guess, but I’m also still in an 82% surplus of my ideal weight (less than half of my highest weight), and still want to lose more. \n\nI feel like such a disturbed person for feeling like I need to be doing worse, despite anorexia being one of the illnesses with the highest morbidity and mortality rate. The competitiveness is ridiculous. And even after saying all this, and being told by my ED psychiatrist that I should remind myself to eat more, I can’t help but feel even more determined to eat even less, because I’m so mad that I’m not doing worse than I already am. \n\nBut I have a dietician and a physiotherapist to see now. I don’t know how it’s supposed to work. What if the dietician wants me to eat more meals, and that makes me gain weight again? What would a physiotherapist do in this case? I have such trouble exercising after building a really bad relationship with it years back, only made worse by depression and absolute lethargy (walking for a few minutes already makes my back and legs and core feel painfully sore). I don’t know what to expect from seeing a dietician and physiotherapist in this case. \n\nI’m just so confused, and discouraged, and the competitive ED voice is just so annoyingly loud right now.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/n0yon5/request_i_have_atypical_anorexia_but_wish_i_was/",
  "score": 100,
  "num_comments": 11,
  "comments": [
    {
      "id": "gw9wqlf",
      "author": "endlesslistofthought",
      "body": "“What a failure-I couldn’t even lose enough weight to have ‘actual’ anorexia”\n\nThat hit home for me because I felt that way for so long when I was bulimic. I never got thin enough for anyone to even notice I had an ED. \n\nIt’s a weird feeling to want to be recognized and validated as someone who is able to suppress biological needs enough to face damages. \n\nI don’t know how to help you get rid of that feeling, but I can say you’re not alone one bit. An ED is feeling like you aren’t skinny enough, and it is quite evident that you experience that just like anyone else with an ED. You hit every mark for having anorexia, and I honestly feel like “atypical” anorexia should be called “anorexia.” It’s all the same behaviors, same experiences, and same treatment. Fuck the labels. \n\nI wish you the best and really hope it gets better from here.",
      "created_utc": 1619685418.0,
      "score": 34,
      "context": []
    },
    {
      "id": "gw9trli",
      "author": "None",
      "body": "I honestly feel for you, it’s a vicious illness. However, the competitiveness never stops, even if you do reach a very low BMI. Even if you do get hospitalized. Even if you’re NG tubed. No matter how unwell your illness makes you, it well never feel like you’ve proven you’re ill enough. It’s easy to give into the illness and let yourself become more ill because it’s what you think you’re supposed to do but at the end of the day the weight loss isn’t going to make you happier or make you feel more worth it. No matter the weight you’re at, you deserve to be happy and healthy. You deserve to be in control of your life, not your eating disorder. I hope you find the help you need and that you can have a full recovery because you are worth it. Good luck!",
      "created_utc": 1619682643.0,
      "score": 22,
      "context": []
    },
    {
      "id": "gwa4fx7",
      "author": "Uplanapepsihole",
      "body": "I’m very similar. It’s frustrates me a lot because people around me, who know I have it don’t really understand.  So they’ll talk about weight and body issues in front of me because to them, since I’m not scarily thin, I’m all better",
      "created_utc": 1619692535.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gwalxct",
      "author": "Tea-rex-",
      "body": "I relate to this a lot. I suffered from bulimia for 10ish years and all the time I wished I had been typically anorexic. I found that I idolised it because there was a lot of shame in my ED. I found myself jealous of those who had anorexia which just made me feel even more ashamed and caused many spirals in recovery. \n\nI never dropped severely underweight and felt like people didn’t really understand the true extent of my ED so sometimes I think I wanted to be iller just so people would understand/appreciate how ill I was. I do believe because I wasn’t underweight my family especially didn’t seem to understand I needed help and therefore were generally unhelpful and did triggering things during recovery. \n\nBut that was something I had to work hard on and address in recovery. Being compassionate towards myself and recognising my illness was still valid and I still deserved help was a big step. It takes a long time, and I found being nice to myself so hard, but try take it day by day and give yourself rest when you need it (recovery is so exhausting mentally).",
      "created_utc": 1619703346.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gwa71vh",
      "author": "Turnover-Party",
      "body": "Atypical anorexia is still anorexia. Anorexia is still the same disease at a normal or high BMI, or without obvious physical consequences like hair loss or syncope (but there are always consequences even if you don't see them).\n\nAs for getting upset at your ED psych, I still get upset when my husband reminds me to feed myself, but I accept that my disorder makes me react that way and I don't tell myself that the feelings are wrong (but I still do what I need to do to stay in recovery despite the feelings).\n\nFeeling like you want to get worse instead of better is part of this. It's all of it, really. I don't have advice for that part, but you are valid.",
      "created_utc": 1619694583.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwariql",
      "author": "ennaxanne",
      "body": "**(OP here)**\nThank you all lovely, lovely people. For the encouragement, words of strength, and for sharing your own stories that help to remind me that I’m not alone in this. \n\nI guess I’m struggling with 3 different illnesses (treatment resistant depression, this eating disorder, and also post-sexual violence trauma + the resulting sex-as-self-harm hypersexual behaviour which has been incredibly distressing) at the same time, all kind of interconnected in a bad way, so everything is just all so confusing and overwhelming to me at the moment. It’s like all 3 illnesses are pushing me to destroy myself completely. \n\nUnfortunately this means also being under the care of various specialisations / clinics. My ED psychiatrist asked me to consider moving my psychiatric and psychological care (for trauma and depression) here to the ED-specialised hospital (so they can take care of the ED too), but I’m not sure if I should because I’m currently under mood & trauma-specialised care. It’s 4 different clinics at the moment — \n\n- 1 mood-specialised psychologist for depression / general health\n- 1 mood-specialised psychiatrist for depression / general health, \n- 1 crisis centre EMDR therapist for sexual trauma (as my main therapist isn’t EMDR trained), and \n- 3 ED-specialised clinicians (psychiatrist, dietitian, physiotherapist). \n\nIt’s rather messy so I understand ED psychiatrist’s concerns. If anyone else also has experience trying to work out the structure of their mental healthcare team amid treatment for co-morbid disorders, appreciate if you could share some insight on how you chose who to keep seeing? This feels like a big mess right now and quite discouraging 😔\n\nTIA.",
      "created_utc": 1619705941.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gwb6sjs",
      "author": "LevelSkullBoss",
      "body": "God, same. I’ve been hospitalized, I’ve struggled for years, but I’ve never been at a low BMI, to the point where I’ve seriously lost friendships because I went back to (and slightly above) my normal (obese) BMI in recovery. The endless “don’t you think you’ve recovered now” “you need to stop gaining weight” “you have binge eating disorder now” “it’s not healthy to eat this much at your weight” “yes it would be normal to gain weight if you had actual anorexia but you don’t, you can’t just call your crash diet anorexia”... it’s enough to make a person desperate.\n\nThere’s a reason sufferers of “atypical” (what bs) anorexia are more medically compromised by the time they seek care, and it’s because of fatphobia and prejudice. Thankfully among professionals, the belief that you can’t have a restrictive eating disorder at any given BMI is falling away, but the cultural shift is taking longer and that poisons us as survivors.\n\nIf your new dietician is good, which I hope they are, they will work with you to overcome your disorder and try to give you a way to eat that will let you live your life. I can’t tell you that you’ll be thin, because you probably won’t. I will never be. But you can be happy and recovered. You can eat without worry; you can exercise in healthy and well-adapted ways that make you feel good and strong, not beaten up. You can live a healthy and fulfilling life without food and your weight controlling your every thought. It’s possible and I believe in you!\n\nSomething that helped me is the homeodynamic recovery method from edinstitute.org. It helped me understand the science behind what was going on inside me and why eating disorders are the same - and equally deadly - no matter your BMI. \n\nTake care of yourself and stay strong",
      "created_utc": 1619712390.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwb283m",
      "author": "yellowposy2",
      "body": "Sending you lots of love ❤️ I was diagnosed with A/N, b/p subtype and thought there was something wrong me with because I couldn’t stop b/p-ing and I felt that wasn’t what “real anorexics” did. All the labels can get in the way sometimes but I’m so proud of you that you’ve found help and have the support you need. EDs are mental illnesses with physical side effects, not the other way around. Sending love and support ❤️",
      "created_utc": 1619710499.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwdhz14",
      "author": "Wagglewood",
      "body": "I feel this in my bones. I am the closest to recovery than I’ve been in years, but I still feel this every. Single. Fucking. Day. If I was “good” at my eating disorder I’d be a “good” anorexic. But I couldn’t even do that right, so bulimia was the only option. I wish I had something helpful to say; some tips or tools, but all I can offer you is comfort in that you’re not alone!",
      "created_utc": 1619747608.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gw9pl8f",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1619679016.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwa3qpb",
      "author": "Sea-Smoke-9498",
      "body": "It is soo competitive isn’t it???????",
      "created_utc": 1619691953.0,
      "score": 1,
      "context": []
    }
  ]
}