{
  "id": "n2exgm",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1619861106.0,
  "title": "Request: Can my college legally force students with eating disorders onto the meal plan?",
  "selftext": "Hi all. College student somewhere on the east coast.I was recently diagnosed with an eating disorder. I've noticed that my condition noticeably improves when I can prepare my own food and eat in private. My school is now requiring everyone to eat dining hall food. In the past it was optional and if you had an eating disorder or special diet you didn't have to pay for the meal plan and could make your own food. They've said the new rule applies to everyone and we all HAVE to eat on campus. Is this legal? It feels like an ADA violation but I don't know if eating disorders are protected the same way as mental illnesses. Any advice or thoughts is appreciated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/n2exgm/request_can_my_college_legally_force_students/",
  "score": 62,
  "num_comments": 9,
  "comments": [
    {
      "id": "gwiwwn8",
      "author": "None",
      "body": "Have you spoken with your university's disability resources coordinator? They may be able to assist you with a formal accomodation.",
      "created_utc": 1619862002.0,
      "score": 47,
      "context": []
    },
    {
      "id": "gwix32r",
      "author": "None",
      "body": "I’d talk to the campus dining department. I feel like they need to be understanding of these situations. Goodluck!",
      "created_utc": 1619862179.0,
      "score": 18,
      "context": []
    },
    {
      "id": "gwlpj20",
      "author": "TravelbugRunner",
      "body": "That seems a bit unconstitutional. \n\nThere are lots of people who have dietary restrictions because of religion, culture, or health issues. \n\nJewish people, Hindus, Vegans, people with EDs, diabetics, and those with severe food allergies should have the right to eat according to their culture or health needs. \n\nYou should be able to have some sort of exemption or an alternative plan if you need it.",
      "created_utc": 1619913098.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gwjdrar",
      "author": "bot_hair_aloon",
      "body": "Wtf your an adult, why are they trying to controll you like that",
      "created_utc": 1619875576.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gwjcj9q",
      "author": "lebaneseflagemoji",
      "body": "Yes, if they require all students regardless of circumstances to purchase one. They don’t really care if you eat it or not, as long as they can say they provided you with it. I would contact your university’s disability counselor, like the other Redditor said.",
      "created_utc": 1619874807.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gwksv4s",
      "author": "baronessblockage",
      "body": "They can require students to be on a meal plan if it is a private college and you are living on the college grounds.",
      "created_utc": 1619898186.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gwkzt67",
      "author": "WearingBaskets",
      "body": "I went to a private university that required everyone to purchase a meal plan until they had taken junior year amount of course hours. I purchased the least expensive option that essentially converted real money into \"dining dollars\". I have always seen this as a way to milk more money out of you, and I really think it is absurd.",
      "created_utc": 1619901278.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwiw10q",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1619861107.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwk8vzm",
      "author": "houston_veronica",
      "body": "Excellent advice; OP, if you live on campus, it's just a requirement like being required to pay for parking if you own a car. It's not to control you, but simply because they would be irresponsible to not infer that your living on campus dictates the necessity of food availability. Without a reliable grocery store right near your housing, they cannot presume you'd have access to food. It would be hard for them to explain, if something happened to you, how they ignored your not purchasing a meal plan. \nAlso, it's likely required for insurance (insurance that protects the school/liability).  \nhttp://www.collegecounselorservices.com/faq/do-college-students-have-to-purchase-meal-plans/",
      "created_utc": 1619889545.0,
      "score": 10,
      "context": [
        {
          "id": "gwiwwn8",
          "author": "None",
          "body": "Have you spoken with your university's disability resources coordinator? They may be able to assist you with a formal accomodation.",
          "created_utc": 1619862002.0
        }
      ]
    }
  ]
}