{
  "id": "n2tk3q",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1619909469.0,
  "title": "Request: Has a doctor ever dismissed your eating disorder?",
  "selftext": " \n\nQuick medical background: I have been suffering from various eating disorders since I was 12, from anorexia to bulimia with great weight fluctuations due to binges as a result. I was never clinically underweight at any point in my life but I finally sought treatment about two years ago and thanks to the care of the therapists and nutritionists at the clinic I've been recovering pretty well. I now have a normal healthy eating pattern (which is primarily vegan, but I do indulge in animal products sometimes) and quit alcohol and caffeine. I go to the gym every other day where I focus on muscle gain for strength, which my diet also reflects My weight however is currently still sitting in the overweight range because as we all know, with recovery usually comes weight gain even if you weren't underweight to begin with, and falling back into calorie restriction is a no go.\n\nSo today I went to see a cosmetic surgeon to ask for an opinion on my droopy eyelids. Instead this woman took it upon herself to question me on my eating pattern and weight. She literally had my file in front of her that displays my medical background and she still forced to weigh me (which already sent me into a panic attack) and despite protesting and asking her what this all has to do with my eyelids (she claims that being overweight causes droopy eyelids) she started questioning me on my diet. She made me tell her what I ate that day (a protein shake, some oatmeal and a banana for breakfast, 4 slices of bread with hummus and bell pepper for lunch) and she insisted that I was eating way too much and that I should not be eating any carbs at this weight. Mind you, I've done keto diets and they made me sick and only triggered starvation patterns but she wouldn't hear it, just talked right over me and I couldn't even begin to explain how wrong she was before she accused me of lying about my dieting history. In the end it turns out she was trying to sell me some overpriced protein diet that she makes a profit of... I left the place in tears since I never felt so humiliated before by anyone, let alone a doctor. She claimed that I couldn't have had an eating disorder and I'm probably eating way more than I was admitting otherwise I wouldn't be so fat (her words). She singlehandedly tried to undo years of therapy just to try and sell me some snake oil diet.\n\nAnyway, I've already reported her to the medical board but I'm not sure if she will face any consequences for this. I just wanted to share this experience with others and ask if you ever had this happen to you before and if there were any repercussions for a doctor stepping out of line like this.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/n2tk3q/request_has_a_doctor_ever_dismissed_your_eating/",
  "score": 59,
  "num_comments": 7,
  "comments": [
    {
      "id": "gwngqi1",
      "author": "juliecaesar",
      "body": "Glad you reported her",
      "created_utc": 1619956600.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwmjgaf",
      "author": "SLaurent132",
      "body": "I’m so sorry you had to have this experience but great thinking to report her immediately. I hope she doesn’t impact your recovery since it sounds like you’ve put a lot of hard work into it. \n\nI’ve never had an experience quite like yours but I went to my family doctor with quite a few general health concerns (fatigue, dizziness, loss of period, etc) that are all pretty commonly associated with ED. This was pretty early on and I wasn’t ready to admit to myself or anyone else that I was struggling with eating, but when I told my doctor about these symptoms, her first question was about my weight. I told her I had lost a significant amount of weight over the past six months and she could not have been more happy, even though I was already a healthy weight. I also described what I know now as some pretty orthorexic and restrictive behaviours and she encouraged me to keep doing them! Safe to say I have not been back since and am searching for a new doctor. Unfortunately a lot of doctors aren’t good with mental illness in general, but especially EDs, so you’re not alone in dealing with a bad apple of a doctor.",
      "created_utc": 1619930831.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gwnp3dd",
      "author": "atheista",
      "body": "It's amazing how unhelpful and even detrimental some doctors can be.  I once saw a doctor to get a referral to a psychologist to treat my binge eating disorder.  When I told her what I was there for she looked me up and down with a judgemental snear and said \"you don't *look* like you have an eating disorder.\"  Amazing that a doctor can be so ignorant to the fact that there are many types of eating disorders, not just restrictive ones (and be such a bitch about it).  Another time a male psych told me he knew I'd be okay because I have a pretty face (the fuck!?).  And another doctor I spoke to about my eating disorder told me to just stop eating so much (Wow...I hadn't thought of trying that!).",
      "created_utc": 1619961017.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwomm9m",
      "author": "canyonlands2",
      "body": "Glad you reported. Write a Yelp review calling her out too. But as long as the rest of the staff was nice, make sure it focuses on the doctor.\n\nI’ve noticed that doctors sometimes can’t believe a person that isn’t severely underweight as an eating disorder that isn’t binge eating.",
      "created_utc": 1619975337.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gwpk9v6",
      "author": "jenjifer998",
      "body": "My therapist after telling her I had anorexia said “are you sure?”",
      "created_utc": 1619989439.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gwpr2zw",
      "author": "dumb-daisy",
      "body": "I haven’t read everyone’s responses yet, but this makes me so fucking angry. Like what’s her damage? She’s not your doctor! A plastic surgeon has no business discussing what they think qualifies as an eating disorder, especially after you said you were uncomfortable to do so!\n\nI’m sorry that this happened to you, I really am. Keep up the good work! You’re definitely fighting the good fight!",
      "created_utc": 1619992834.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwlitzd",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1619909470.0,
      "score": 1,
      "context": []
    }
  ]
}