{
  "id": "n3rzrf",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1620034282.0,
  "title": "Request: How do I change the fact that food is the thing I look forward to most/my biggest joy at the end of every workday?",
  "selftext": "How do I change the fact that food is the thing I look forward to most/my biggest joy at the end of every workday?\n\n&#x200B;\n\nI think I should pursue a hobby that would bring me joy and purpose. However, literally nothing in the world sounds better than plopping myself in front of the TV and eating after a long day of work. I don’t feel motivation to try a new hobby. I feel like I deserve to do what brings me the most happiness and relaxation at the end of the day. However, it is really starting to pose a problem for my health. I’m obese for the first time in my life and really need to get this under control. I just have no idea how…",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/n3rzrf/request_how_do_i_change_the_fact_that_food_is_the/",
  "score": 150,
  "num_comments": 23,
  "comments": [
    {
      "id": "gwrlr8a",
      "author": "None",
      "body": "just boosting this because I struggle with the exact same shit. depression is a bitch and food is such an instant comfort.",
      "created_utc": 1620037775.0,
      "score": 40,
      "context": []
    },
    {
      "id": "gwrox87",
      "author": "waterandicethrowaway",
      "body": "And then I feel worthless about it, like i'm a lowlife for having food as the only joy in life.",
      "created_utc": 1620040005.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gwrnjd0",
      "author": "Signal_Account",
      "body": "This question is so important.",
      "created_utc": 1620039053.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gws43ik",
      "author": "jeabgrenouille",
      "body": "I felt like this for about a decade when I was semi-recovered. I thought I was fully recovered, and I had been obsessed with food for so long that I was no longer even aware of it and it just became normal for me to not be able to focus on anything or find joy in anything, and to think about food constantly. I had to leave university early often because I couldn't handle not being home and near food. Whenever I was anywhere where I didn't have access to food, I was feel really anxious and uncomfortable. \n\nWhen I reached the next level of recovery, all that went away. When I started eating the things I had been afraid of, and in quantities that I was afraid of, consistently, and I stopped my weird eating rituals, my mind became freed.\n\nIt was not about needing to gain weight for me (though for some it will be) because I had been at a higher, healthy weight for many years already and was still obsessed with food. In my specific case, letting go of disordered habits actually made me lose weight because I became less food focused, and I wasn't doing my food rituals that I had been doing that made me feel deprived and starving.",
      "created_utc": 1620048586.0,
      "score": 13,
      "context": []
    },
    {
      "id": "gwsi1mt",
      "author": "RedVelvet1108",
      "body": "Just throwing this in: volunteering might not be for everyone, but it gives you a purpose and something to kill time with while doing something for your community. Whether you like giving out food, helping elders, help the red cross oder your local railway mission, you can try it out. People are thankful for every helping hand and it's not costly (opposite to fancy hobbies).",
      "created_utc": 1620054906.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gws0kf5",
      "author": "Uplanapepsihole",
      "body": "Yeah I’m very much the same and it’s taken over my life since I was 15.",
      "created_utc": 1620046859.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwt6y3r",
      "author": "Bassplayer1776",
      "body": "I am struggling with the same thing. For a long time I ate the same 3 foods, was eating 600 calories a day and I’m 6’3 and a 17 year old male. I got down to 140 pounds before realizing I had a problem. I commited to eating enough and eventually food became such a part of my life that it was all I cared about. I’m still working this out and I have binges frequently, but I’m getting better. The biggest thing that has helped me is finding/rediscovering passions and friendships. Before I eat I play my instrument or call and old friend and I find that I feel more fulfilled with “normal amounts” of food and care less about the amount or the feelings in general. I hope this helps and be strong. Counseling has also helped me so maybe if you can afford it?...",
      "created_utc": 1620065335.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gwrsisg",
      "author": "None",
      "body": "Relatable",
      "created_utc": 1620042316.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gws4e96",
      "author": "Background-Fall7700",
      "body": "You will be ok. Pursuing a hobby is definitely on of the ways to go about it. One trick I always share is to allow yourself to eat in moderation but only after you have had a large portion of vegetables. This typically fills you up and leaves less room for overeating on the heavy/sugary stuff. That way you are mostly eating the healthy stuff more than the unhealthy stuff.",
      "created_utc": 1620048728.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwtfr50",
      "author": "witty_kitty23",
      "body": "Yupppp I've felt the same way. I don't know if you do this, but eating consistently throughout the day can help reduce cravings. Restriction can often lead to eating more than you might want",
      "created_utc": 1620069044.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gwstgjg",
      "author": "testfreak377",
      "body": "I know it’s hard, but make beating this food addiction like a part time job. Even just spend 20 minutes after you come home researching ways to stop and make a battle plan. You may need to get outside help also. I struggle with binging and purging so I can relate (not exactly the same but I understand the mental anguish).\n\nI’ve found that any hobbies I do (even ones I used to love) I can’t focus on for any length of time. I don’t think hobbies will change the course of an addiction because your brain’s neurochemistry and thought patterns are so fucked up.\n\nMy goal is to get to the point where the mere thought of engaging in my bad behavior makes me sick and angry at what I used to do. May I suggest that you create a mental goal like this also, can be anything. I hope this helps and gives you perspective and a better outlook",
      "created_utc": 1620059702.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gws5e31",
      "author": "nobigdramallama",
      "body": "Just wanted to say that I don’t have an ED, but feel this exact same way. I love eating food and get really excited to get home, sit down with a lovely meal infront of the TV and relax! I’m sure there’s lots of others that feel the same! I saw someone say they feel worthless because of it. Don’t. Food is known to bring happiness, it doesn’t make you any less of a person because you enjoy it. \n\nI understand it’s an issue with your obesity, but that will likely be due to your lifestyle/ what you eat, not the fact that you look forward to meals. It would obviously be good to make some adjustments, but I really just wanted to reiterate how important it is to not form a negative view on meals. Food is one of life’s joys!",
      "created_utc": 1620049177.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwrhae6",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1620034282.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwth4r7",
      "author": "pvdme",
      "body": "100% relatable. 25yr F. I’ve just recently stopped going out, stopped spending money to eat out, and anything that resulted in me spending money on things I don’t need to. I’m saving money up to move out and have a cushion to fall back on, because I’m miserable at home. But I’ve come to realize that the reason I’ve always had a weight problem is because home has always made me feel this way and going out and eating made me happy. So now that it’s just me at home finding something to make to eat, instead of calling up someone to go out to eat with I’ve fallen in a slump where I really feel worse than I did being broke. Just wanted to share my position. I’m hoping I can motivate myself to go for walks, or even start exercising to find joy in something that will benefit me in the long run, because this saving period to move out to be happy won’t change the end goal if food still drives my instant and short lived happiness.",
      "created_utc": 1620069638.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwts5yu",
      "author": "mandy_miss",
      "body": "Wow this just made me realize i do the same thing. I spend money everyday on grubhub and doordash to get something i really want. Im just not satisfied with the food i normally keep in the house anymore. I wake up everyday and start planning the food im going to get. And everyday i tell myself i wont do it again and then the next day i do",
      "created_utc": 1620074450.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwumw52",
      "author": "throwaway-m1",
      "body": "Are you eating consistently (and the things you crave/enjoy) throughout the day? Sometimes if you go the whole day without having any good, satisfying snacks/meals, at the end of the day you’ll become obsessed with and fixated on food.",
      "created_utc": 1620088710.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h9w2wkg",
      "author": "Responsible_Prior208",
      "body": "Don't idolize it because it's just another high of life you experience. Recognise you like the high feeling and acknowledge where else you feel that feeling.",
      "created_utc": 1629623302.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gwvsaln",
      "author": "bot_hair_aloon",
      "body": "(Hijacking your comment.) The way I  did this was I imagined what I wanted my values to be. Not like trust or whatever but what I wanted to focus most of my time on or what i wanted to know about. For example, I am really intressted in physics, im now doing a degree in it. So when I caught myself obsessing over food and idealising it, i would stop and google something about physics. Literally only takes like 3 minutes and I learnt alot. Similarly, if I had a bad day obsessing. I would picture who i thought i wanted to be, like intellectually or what someone i thought to be cool to be intressted in. Like world politics, geography, fashion and economics. I found the more I did this, the more I learnt and the easier it got. Logically, I find food boring. Its not a passion of mine. I dont like to cook or experiment, so it was probably easier for me in this way. But now i can say with certainty i spend VERY little time thinking about food and actually regularly foget to prepare food for work (so i have to buy something, im not feeding those ed behaviours lol.) Good luck and I hope this helps a little bit!",
      "created_utc": 1620114735.0,
      "score": 3,
      "context": [
        {
          "id": "gwrlr8a",
          "author": "None",
          "body": "just boosting this because I struggle with the exact same shit. depression is a bitch and food is such an instant comfort.",
          "created_utc": 1620037775.0
        }
      ]
    },
    {
      "id": "gws928o",
      "author": "None",
      "body": "I mostly agree with what you're saying, but I think what OP meant here is that food is the *only* thing they enjoy / look forward to. Of course it's okay to enjoy food and look forward to meals, but when it's the only thing, it's more problematic",
      "created_utc": 1620050866.0,
      "score": 2,
      "context": [
        {
          "id": "gws5e31",
          "author": "nobigdramallama",
          "body": "Just wanted to say that I don’t have an ED, but feel this exact same way. I love eating food and get really excited to get home, sit down with a lovely meal infront of the TV and relax! I’m sure there’s lots of others that feel the same! I saw someone say they feel worthless because of it. Don’t. Food is known to bring happiness, it doesn’t make you any less of a person because you enjoy it. \n\nI understand it’s an issue with your obesity, but that will likely be due to your lifestyle/ what you eat, not the fact that you look forward to meals. It would obviously be good to make some adjustments, but I really just wanted to reiterate how important it is to not form a negative view on meals. Food is one of life’s joys!",
          "created_utc": 1620049177.0
        }
      ]
    },
    {
      "id": "gwyqpua",
      "author": "threadofhope",
      "body": "This is brilliant and doable advice. I always think I've got to do something big, but learning something for three minutes a day is something I can handle.",
      "created_utc": 1620171875.0,
      "score": 2,
      "context": [
        {
          "id": "gwrlr8a",
          "author": "None",
          "body": "just boosting this because I struggle with the exact same shit. depression is a bitch and food is such an instant comfort.",
          "created_utc": 1620037775.0
        },
        {
          "id": "gwvsaln",
          "author": "bot_hair_aloon",
          "body": "(Hijacking your comment.) The way I  did this was I imagined what I wanted my values to be. Not like trust or whatever but what I wanted to focus most of my time on or what i wanted to know about. For example, I am really intressted in physics, im now doing a degree in it. So when I caught myself obsessing over food and idealising it, i would stop and google something about physics. Literally only takes like 3 minutes and I learnt alot. Similarly, if I had a bad day obsessing. I would picture who i thought i wanted to be, like intellectually or what someone i thought to be cool to be intressted in. Like world politics, geography, fashion and economics. I found the more I did this, the more I learnt and the easier it got. Logically, I find food boring. Its not a passion of mine. I dont like to cook or experiment, so it was probably easier for me in this way. But now i can say with certainty i spend VERY little time thinking about food and actually regularly foget to prepare food for work (so i have to buy something, im not feeding those ed behaviours lol.) Good luck and I hope this helps a little bit!",
          "created_utc": 1620114735.0
        }
      ]
    },
    {
      "id": "gws9j5m",
      "author": "nobigdramallama",
      "body": "They way they word it seems to me like the issue is is that it’s the thing they enjoy the most. I don’t think they say anywhere that it’s the only thing that they enjoy :)",
      "created_utc": 1620051089.0,
      "score": 2,
      "context": [
        {
          "id": "gws5e31",
          "author": "nobigdramallama",
          "body": "Just wanted to say that I don’t have an ED, but feel this exact same way. I love eating food and get really excited to get home, sit down with a lovely meal infront of the TV and relax! I’m sure there’s lots of others that feel the same! I saw someone say they feel worthless because of it. Don’t. Food is known to bring happiness, it doesn’t make you any less of a person because you enjoy it. \n\nI understand it’s an issue with your obesity, but that will likely be due to your lifestyle/ what you eat, not the fact that you look forward to meals. It would obviously be good to make some adjustments, but I really just wanted to reiterate how important it is to not form a negative view on meals. Food is one of life’s joys!",
          "created_utc": 1620049177.0
        },
        {
          "id": "gws928o",
          "author": "None",
          "body": "I mostly agree with what you're saying, but I think what OP meant here is that food is the *only* thing they enjoy / look forward to. Of course it's okay to enjoy food and look forward to meals, but when it's the only thing, it's more problematic",
          "created_utc": 1620050866.0
        }
      ]
    },
    {
      "id": "gwtqmnk",
      "author": "None",
      "body": "Oh okay, I think I misunderstood the first time I read it, you're probably right. Lol I always take things too literally :P",
      "created_utc": 1620073774.0,
      "score": 1,
      "context": [
        {
          "id": "gws5e31",
          "author": "nobigdramallama",
          "body": "Just wanted to say that I don’t have an ED, but feel this exact same way. I love eating food and get really excited to get home, sit down with a lovely meal infront of the TV and relax! I’m sure there’s lots of others that feel the same! I saw someone say they feel worthless because of it. Don’t. Food is known to bring happiness, it doesn’t make you any less of a person because you enjoy it. \n\nI understand it’s an issue with your obesity, but that will likely be due to your lifestyle/ what you eat, not the fact that you look forward to meals. It would obviously be good to make some adjustments, but I really just wanted to reiterate how important it is to not form a negative view on meals. Food is one of life’s joys!",
          "created_utc": 1620049177.0
        },
        {
          "id": "gws928o",
          "author": "None",
          "body": "I mostly agree with what you're saying, but I think what OP meant here is that food is the *only* thing they enjoy / look forward to. Of course it's okay to enjoy food and look forward to meals, but when it's the only thing, it's more problematic",
          "created_utc": 1620050866.0
        },
        {
          "id": "gws9j5m",
          "author": "nobigdramallama",
          "body": "They way they word it seems to me like the issue is is that it’s the thing they enjoy the most. I don’t think they say anywhere that it’s the only thing that they enjoy :)",
          "created_utc": 1620051089.0
        }
      ]
    }
  ]
}