{
  "id": "n5c093",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1620207467.0,
  "title": "Request: How did it happen for you guys?",
  "selftext": "When did you realise something was terribly wrong with you? Did you learn those behaviours or did they just come instinctively?\n\nI told my mom about how I think I have an ED a couple days ago, she asked if I knew of vomiting my food out through the internet and said that I'm basically just copying other people with it. \n\nIs that true? Am I really just overreacting and faking all these?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/n5c093/request_how_did_it_happen_for_you_guys/",
  "score": 56,
  "num_comments": 28,
  "comments": [
    {
      "id": "gx0bltq",
      "author": "Choice_EconomicsNa",
      "body": "For me it started as a form of self-punishment that evolved into a way for me to build self-esteem.  \nI may not be as smart/beautiful/funny as anyone else, but I will be the thinnest.\n\n  \nAlso like a lot of other girls I met in treatment: my mom would comment on my weight. \n\nA lot.  \n\n\n\"When  was your age I weighed xxx less\"\n\n\"Why can't you eat salads like your stepsister\"  \n\"your breasts are **too big**\"",
      "created_utc": 1620208012.0,
      "score": 30,
      "context": []
    },
    {
      "id": "gx0qbk9",
      "author": "nnogales",
      "body": "for me, it started with my mom commenting about my weight incessantly as i grew up. then i gained a bunch of weight when i was about 16, and i decided i was going to \"glow up\" and \"get hot\". i remember exactly when i said \"i will get thin\". right off the bat i restricted severely, skipped meals and purged. i know for a fact that i turned to behaviors that i had heard of from social media, but it doesnt make me any less sick. i still became addicted to them, my health still was severely damaged, and i have still lost 5 years to an ED.",
      "created_utc": 1620218748.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gx0c3af",
      "author": "None",
      "body": "The fact that you question the fact if you have a problem or not, should be enough. \nI hope you can touch base with a GP or another trusted person and voice your concerns. \nI never thought I had an ED, I thought I needed a dietitian. So when I went to my GP to ask for her recommendations she actually brought up therapy for ED and that’s when I knew. \nThis person sees me only a few times each year and the fact that she saw and heard me out really ment a lot. They should also know the right connections for you! \nHope this helps",
      "created_utc": 1620208464.0,
      "score": 15,
      "context": []
    },
    {
      "id": "gx0mo12",
      "author": "NoLengthiness1058",
      "body": "its really weird because i can pin point alot of things in my life that have led to it getting this bad (my dad always commenting on weight, my brother being overweight, going to an all girls school) and ive had an unhealthy relationship with food n body image for years, but since christmas i started feeling scared to eat certain foods which i had never had before, of course now thats snowballed into super restrictive eating. i lose my sense of smell from covid in october and used it as an excuse to not eat alot of types of food, i still dont know if im just scared of the food or if my senses are still affected. i feel both in complete control and completely lost but hey thats EDs i guess",
      "created_utc": 1620216618.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gx0shn9",
      "author": "jeabgrenouille",
      "body": "No!!! I certainly didn't copy anyone when I was sick.\n\nI had been insecure about my body since kindergarten, and I kept wanting to go on a diet. I had heard of diets from family members. I didn't even know what calories were, but grade 5 was a stressful  year for me, and I 'finally' started dieting. I didn't have any guidance. I just started eating less and less, and feeling amazing about it.\n\nI did not need to lose weight whatsoever, but I thought I did. I just kept making new ruled and getting stricter and stricter. I didn't even know what anorexia was. I thought this was a special secret hobby that made me happy and made me feel special and everyone in my life was an enemy to me if they tried to make me eat or sit down. \n\nI told myself I would keep it up until I hit a certain weight, but I found I couldn't stop. I was a little worried when I realized this, but I also didn't think much of it and kept up my routines. I felt I had to live that way forever and I felt like I was content to do that as that became easier than eating properly. \n\nI did have some scares. One day it was when I saw what my body looked like and saw something that scared me. One day it was when I blacked out and had to lie on the bathroom floor until I felt better. \n\nBut even so, I would keep going and those things would become a new standard. I would feel not good enough if I didn't black out, for example.\n\nI don't think I ever would have admitted truly to myself or anyone that something was wrong. I heard the word anorexia for the first time when I was admitted to the hospital. \n\nIn a way, I was lucky that I was so young because I didn't need to ask for help myself. My parents were taking me to a lot of doctors that whole time. The doctors would talk to my parents behind closed doors, and my parents would never share what they were talking about. \n\nSo to answer your question, this was very much something that was within me. I didn't know what I was doing at all. My sisters developed ED's after me. They could have conceivably been seen as having \"copied\" me, but they both became sick in different ways. Some people have a genetic disposition to develop these compulsions after a period of prolonged restriction. It is a great way to survive a famine. Not a great way to survive modern life.",
      "created_utc": 1620219904.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gx13fqo",
      "author": "lmj1129",
      "body": "I’m honestly not really sure. I have BED and tend to frequently go through restriction phases that then lead to massive binges. I have never been and am not fat, but I’ve always been an overeater when it comes to snacks. I remember coming home from elementary school and eating so much that I would be too full for dinner. This of course annoyed my parents and led to them limiting my snack intake, which then just led to me snacking in secret and then also forcing myself to eat as much of my dinner as possible. I think that this is what ended up leading me to eat large quantities of food. I’m also really weird about snacking now and pretty much always do it in private, and I have pretty major food guilt. The restricting I think comes from having a very thin best friend going up. She was naturally thin but was obsessed with staying that way and I remember from as early as age 11 she would have us weigh ourselves every single time we hung out so she could compare her weight to mine. She also ate like a bird, she wouldn’t even eat a goldfish cracker in one bite. These things of course obviously made my young self very insecure and it basically ended up becoming a competition of us trying to eat less than the other. It was rough.",
      "created_utc": 1620225101.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gx1ecf0",
      "author": "CricketExtreme",
      "body": "I am noticing a trend here with mothers commenting on weight being a factor in people’s EDs. My mum commented on my weight a lot and compared me to my friends of the same age who were built more slim. \n\nI gained weight after my first year of university (think freshman’s 15) and my mothers comments didn’t stop. I then started using apps to count calories and started restricting heavily. I lost a lot of weight but received nothing but praise. I didn’t think that I was doing anything wrong for a long time but the guilt I felt from eating was immense. \n\nIt wasn’t until I went to a music festival and got really drunk on an empty stomach and completely broke down into tears because I hated my appearance and thought I was fat (looking back I was actually very slim). My boyfriend at the time had no idea what was going on but tried to comfort me. I realized how irrational this was and that was the moment that I considered I might have an ED. \n\nI don’t think it came from social media at all but I definitely used social media (particularly 2013/14 fitspo era) to “motivate” myself to restrict. I broke down and told my mother one day and she also insinuated that I was overreacting. Reflecting now I do realize that so many ED behaviours are secretive so I can see why parents struggle to understand or believe their children when they tell them, but I’m sure everyone would appreciate more empathy.. I think/hope the next generation of parents will be more understanding.",
      "created_utc": 1620229684.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gx0b1ce",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1620207467.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx0y4m4",
      "author": "None",
      "body": "I knew I previously had issues, but I thought I was over that. It wasn't until I came to a group home that I realized my eating was abnormal",
      "created_utc": 1620222696.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx14wdq",
      "author": "tears_of_an_angel_",
      "body": "ever since I was a little kid (probably age 6 tbh) I’ve just instinctively thought that skinny is better and fat = bad. growing up, every time I gained weight, I tried to lose it right away but I did learn diet tricks and purging methods from pro ana sites. I was never actually fat though (always on the lower end of healthy) so I wasn’t super invested in losing. it didn’t become full blown until college though when I actually got serious about losing and now here I am",
      "created_utc": 1620225745.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx1dsem",
      "author": "Cheesieblaster",
      "body": "My mom has an eating disorder.\n\nI didn't realize it for a LONG time but she would always call herself fat when I was younger (at most she was 130 and 5'3). She's not 5'3 and like 105 pounds and thinks she's fat because she has a permanently boated stomach (gastrointestinal issues). \n\nWhen I was younger, she refused to have any snacks in the house (which I actually think made me and my siblings crave junk food more in the long run). She would binge whenever we had sugary foods around (try to hide, or out it in her purse, and basically eat as quickly as she could, usually without a utensil). She would drink diet coke alll day long, decided to become a vegetarian as an excuse to get out of eating with us (nothing against vegetarians! Its really just a way for her to get out of most dinners!)...\n\nSo I consciously and subconsciously noticed this. I also noticed how my dad would always comment on my sister's weight (she's 38 now, absolutely gorgeous but she's naturally curvy and doesn't work out). She's 5'3 and probably 160 right now.\n\nMy dad and brother have commented on my weight since I hit puberty.  They mainly comment on how puffy my face is or how I should eat better for my own self confidence...\n\nThings got worse with my ex. We started dating when I was 21. I was very depressed when we met and underweight because I had no appetite. We dated for about 8 years and the only time he complimented me on my appearance was 1) When I could barely stand I was so frail (he told me I had the perfect body) and 2)... He would tell me I was the best girlfriend because I was small (he clarified that he meant my vagina was small).\n\nRight now, Im at my biggest. Im 130 and 5'4 and I am not happy about it but I'm with a good guy who loves me first as a person and finds me attractive regardless of whether I weight 104 or 134.\n\nMy weight is still up and down. This past year has really done a number on my motivation to get healthy the right way.",
      "created_utc": 1620229460.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx1ps70",
      "author": "None",
      "body": "For me it still is the thought of if I wait 10 minutes my stomach will stop hurting",
      "created_utc": 1620234311.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx2cnr8",
      "author": "None",
      "body": "For me, it was my dad constantly commenting about my weight and how I’m getting fatter. He was very abusive and forced my to exercise all the time, now I’m in my 20s and my dad passed away two years ago but I still struggle with body image a lot. I just feel such a sense of control and pride when I’m closer to my “goal” weight but I’m honestly never satisfied. Also having a bf that is a porn addict doesn’t help. I once snooped through his Reddit and saw all the extremely thin girls he followed and that’s launched my ED to a point where it’s uncontrollable for me to control.",
      "created_utc": 1620243954.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx2yx2t",
      "author": "SilentMellow",
      "body": "I got it from the fear of vomiting. I never ate, or only ate safe foods. While having the severe phobia of eating due to fear of vomiting, I was also noticing that I was judging how I looked compared to my friends at school. I was a mess... keep in mind I was only 11/12 at the time. I am now 21 and only suffer with social anxiety so that’s cool .... but no, you’re not overreacting. I think social media does make it more evident that it’s a growing problem in our society, but don’t dismiss you’re feelings and your thoughts even if someone believes you’re faking it!",
      "created_utc": 1620253471.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx31jwi",
      "author": "ningyizhuo",
      "body": "Consciously ? When I fell on pro ana content by mistake on Google and after being disturbed and feeling very sick by what I read, started to think that maybe this was the solution. I was bullied, with no friends at a boarding school at the time ; without my twin,  and while it sounds crazy now, I felt like I tried everything to make people like me and that if they didn't then it meant that I wasn't skinny enough. It gave me something to focus on other than the fact that I was socially inadaptive and missed my sister.\n\nUnconsciously ? Earlier than that, I have no idea when. I started purging 2 years before \"the big event\" to punish myself (because I was bullied and I hated myself). I also had disordered thoughts but I also had like a weird pride about my weight as a child (in elementary school) because I was skinny and looking back, I definitely don't think it was healthy. I think it's small things here and there since my early childhood that set the foundations to what later became disordered habits as self harm and then anorexia\n\nIf you think you have an ED, chances are you probably have one. Vomiting isn't mandatory, most people I know don't do it. There is plenty of different types of eating disorders and symptoms can vary a lot. I don't think you're overreacting",
      "created_utc": 1620254706.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx3bhux",
      "author": "aytlolcan",
      "body": "I always knew there was something off, I just never wanted to acknowledge it. There were times I’d be so tired from my constant unsustainable lifestyle and my teacher urged me to seek professional help. I just always “neutralised” the severity of my ED. My family noticed as well and sometimes forced fed me. I just get mad and upset because “How dare they not trust me when I do eat?!” I was slowly and surely dying in front of everyone and I felt superior because “I’ve got so much control”. One day, I was genuinely so tired of all my little habits that were in fact killing me, my teacher as usual, suggested I finally tell my mother the truth. So, I did. I sought the help I truly needed. Currently, I’m 2 years into recovery. I’m not so sure how far I’ve come but talking about it was the first step.",
      "created_utc": 1620259440.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx3bhvp",
      "author": "Sea-Smoke-9498",
      "body": "I got fed up of being told that I had too much of this too much of that can’t have 3 pieces of toast only 2, pizza isn’t a lunch thing, then was laughed at weekly by my sisters counsellors and said that I couldn’t hide it. Went to my room and cried. Then someone opened up the flood gates and all the “little comments from the past couple months came for a visit: make sure to do your excerecise said the news; everyone’s gonna eat and get fat said society; you’ve got big thighs we’re gonna have to size up; remember when you were tiny and nothing would fit your waist now they do; growing up I was always called thin and low key liked it and that dreaded age called puberty hit :( \n\nI saw a post like a year ago calling out what I feel is 90% of people:\n\nWho gave you an ED and why was it your mum...........\n\n\nSo like if I don’t eat, there’s nothing to judge and I get my “slender” frame back. I did alright and look like the result of if slender man had and orgee with the beldam from coraline but feel like I’m mr bobinski.",
      "created_utc": 1620259440.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx3hewg",
      "author": "None",
      "body": "I learned it from movies, internet and just plain knowledge that when your sick and you throw up you lose weight. \n\nI started trying to find fast ways to lose weight because of harassment from a my fiancé’s ex and her friends and just comments from my family and ex friends. \n\nOnce it started it was hard to stop.",
      "created_utc": 1620262328.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx4e351",
      "author": "None",
      "body": "I knew it was unhealthy when all I could think about 24/7 was health and fitness. My homepages on my phone and laptop were healthy food blogs, I denied hangouts because I was anxious about derailing from my diet plan, I went to a nutritionist secretly hoping she’d point out anything unhealthy in my patterns, I restricted myself so much that not even my family could remember the rules no matter how hard they tried to accommodate...those are some examples of how I knew I had an ED. It consumed very, very overlooked parts of my life so much that it made existing in a world with food and mirrors extremely dangerous and painful.",
      "created_utc": 1620281627.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx4u9fo",
      "author": "possessedandblessed",
      "body": "For me it started after my last suicide attempt (I struggled with depression my whole life and I still do, I've also got BPD). I took a lot and I mean A LOT of pills and I was constantly vomiting in the hospital. When I was released the first thing I did was weight myself because in my mind was this thought: \"I vomited so much, I must have lost some weight.\" But no I weihgted more than I ever did (it was still a normal weight) and that's kinda where it started. I didn't ate for 3 days and after that I only eat less than 500 calories a day and did a lot of sport. Than the binges started and I was in this binge-starve cycle but I got out of that. I still don't eat much but more than back then and I don't have any binges anymore.",
      "created_utc": 1620296420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx50jsv",
      "author": "SheHer0",
      "body": "It started with me wanting to be healthy. I ate healthy and went out on walks, nothing was wrong with that, yet. Then I started decreasing my food intake. Somedays I skipped eating and came up with excuses saying I already ate and stuff.\n\nAfter some time I started eating only once a day and bingeing my ass off, then purging it all out again. That was when I was at my lowest weight. Other times I ate throughout the day, but puked after the meals.\n\nI would weigh myself a lot of times throughout the day. And sometimes I skipped multiple days in a row. I also wave a looot of anxiety when I eat so I guess when I starting to purge I noticed that something wasn’t right.\n\nBut the bulimic symptoms comes and goes, but my main problem is anorexia. And I just got diagnosed with it and depression so yeah",
      "created_utc": 1620301241.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx72m8x",
      "author": "None",
      "body": "Tw? Numbers and behavior talk \nhad been restricting for so long, but every now and then I would have a couple days where I would eat \"more\" which was still less than 500 cal a day. I had eventually stopped having even that much and really started shedding weight but I was just so happy with how much progress I was seeing so I just let it go deeper and deeper secretly. I ended up having manic episodes and severe, severe low episodes. I was convinced entirely that I was bipolar. There was in my mind literally no other issue and my eating habits weren't anything abnormal. I finally started talking to my therapist and psychiatrist about it and they both started to piece it together I guess. My psych changed my meds. Didn't give me a diagnosis which just got under my skin. I needed to know I was bipolar right? My therapist called me the next day and told me they both agree that it's an eating disorder. I was so shocked and honestly I kind of still am. Anyway. Now we've gone from nothing is a problem to threats of inpatient. \nI know this is hard and confusing. But really look into your behaviors and your past. This could be something that's so engrained in your behavior. Especially if your mom has always made comments like this to you. If you see your behaviors getting worse or you find yourself retreating from your loved ones and isolating, please check in with yourself and reach out to at least one person who will really listen and start to get help. You are so worth it.",
      "created_utc": 1620334228.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gxojize",
      "author": "edensrotting",
      "body": "I was 9-10 years old when it started, I was always very worried about my body and I used to make promises that I would not eat but I always failed. When I was satisfied that I would not be able to stop eating, I started to vomit and a bad thing happened and I had to stop, obviously, the worries about my body maintained but I were overeating to hurt my stomach (I have a self harming behavior since 11). \n\nSome years later, my concerns about losing weight came back more stronger and now I starve myself, but more because of my aversion to food, I can't stop thinking about how much I hate food and I avoid eat. Also, I always think too much if i have to eat or not and question my behavior while im eating and overthink my food.",
      "created_utc": 1620697819.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx0meul",
      "author": "bliiiiib",
      "body": "Yeah because you decide your breast size....",
      "created_utc": 1620216457.0,
      "score": 19,
      "context": [
        {
          "id": "gx0bltq",
          "author": "Choice_EconomicsNa",
          "body": "For me it started as a form of self-punishment that evolved into a way for me to build self-esteem.  \nI may not be as smart/beautiful/funny as anyone else, but I will be the thinnest.\n\n  \nAlso like a lot of other girls I met in treatment: my mom would comment on my weight. \n\nA lot.  \n\n\n\"When  was your age I weighed xxx less\"\n\n\"Why can't you eat salads like your stepsister\"  \n\"your breasts are **too big**\"",
          "created_utc": 1620208012.0
        }
      ]
    },
    {
      "id": "gx37mut",
      "author": "Sea-Smoke-9498",
      "body": "Genetics; everyone is also built differently so there’s no real way for anything to be put into an equation.",
      "created_utc": 1620257573.0,
      "score": 2,
      "context": [
        {
          "id": "gx0bltq",
          "author": "Choice_EconomicsNa",
          "body": "For me it started as a form of self-punishment that evolved into a way for me to build self-esteem.  \nI may not be as smart/beautiful/funny as anyone else, but I will be the thinnest.\n\n  \nAlso like a lot of other girls I met in treatment: my mom would comment on my weight. \n\nA lot.  \n\n\n\"When  was your age I weighed xxx less\"\n\n\"Why can't you eat salads like your stepsister\"  \n\"your breasts are **too big**\"",
          "created_utc": 1620208012.0
        }
      ]
    },
    {
      "id": "gx3jn5r",
      "author": "elizolam",
      "body": "wow did your sense of smell come back?? did you lose taste as well?",
      "created_utc": 1620263440.0,
      "score": 1,
      "context": [
        {
          "id": "gx0mo12",
          "author": "NoLengthiness1058",
          "body": "its really weird because i can pin point alot of things in my life that have led to it getting this bad (my dad always commenting on weight, my brother being overweight, going to an all girls school) and ive had an unhealthy relationship with food n body image for years, but since christmas i started feeling scared to eat certain foods which i had never had before, of course now thats snowballed into super restrictive eating. i lose my sense of smell from covid in october and used it as an excuse to not eat alot of types of food, i still dont know if im just scared of the food or if my senses are still affected. i feel both in complete control and completely lost but hey thats EDs i guess",
          "created_utc": 1620216618.0
        }
      ]
    },
    {
      "id": "gxfwn08",
      "author": "RealisticArrival2216",
      "body": "Same",
      "created_utc": 1620517578.0,
      "score": 1,
      "context": [
        {
          "id": "gx1ps70",
          "author": "None",
          "body": "For me it still is the thought of if I wait 10 minutes my stomach will stop hurting",
          "created_utc": 1620234311.0
        }
      ]
    },
    {
      "id": "gx4g698",
      "author": "NoLengthiness1058",
      "body": "yeah its come back but in a different way, apparently its the nerves rehealing themselves? It basically made things taste different, because the smell would affect the taste but I never fully lost my taste. My smell is still off though like cigarettes smell suppper strange and the taste/smell of carrots stays with me for days haha",
      "created_utc": 1620283328.0,
      "score": 3,
      "context": [
        {
          "id": "gx0mo12",
          "author": "NoLengthiness1058",
          "body": "its really weird because i can pin point alot of things in my life that have led to it getting this bad (my dad always commenting on weight, my brother being overweight, going to an all girls school) and ive had an unhealthy relationship with food n body image for years, but since christmas i started feeling scared to eat certain foods which i had never had before, of course now thats snowballed into super restrictive eating. i lose my sense of smell from covid in october and used it as an excuse to not eat alot of types of food, i still dont know if im just scared of the food or if my senses are still affected. i feel both in complete control and completely lost but hey thats EDs i guess",
          "created_utc": 1620216618.0
        },
        {
          "id": "gx3jn5r",
          "author": "elizolam",
          "body": "wow did your sense of smell come back?? did you lose taste as well?",
          "created_utc": 1620263440.0
        }
      ]
    }
  ]
}