{
  "id": "n639p6",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1620292974.0,
  "title": "Request: Could my partner be suffering from bulimia?",
  "selftext": "I'll give a little bit of background first.\n\nMy partner has a chronic migraine condition which means she is constantly in pain and it can flare up for days or weeks where she'll be in high amounts of pain. She has been vomiting daily as a result of this pain and I don't doubt that it's making her vomit. However, recently I have started to suspect that the vomiting might not entirely be a result of the pain, she had a new procedure done about a month ago which has helped reduce this pain and the vomiting still hasn't stopped.\n\nShe had a doctors appointment a while back and found that she'd gained a bit of weight, mainly due to being inside 24/7 (because of Covid rest) and not really excercizing much. She's been concerned about her weight and joked a few times that at least the vomiting from the pain will help her lose weight, I didn't think much of them at the time but now it's starting to feel like that might be the reason why she's still vomiting so much. She's claimed that her body has just gotten into a habit of vomiting and it just needs time to stop, but it's showed no signs of slowing down at all.\n\nI've been planning on talking to her about it and seeing if it might be bulimia as I'm aware it can be subconscious but I wanted to see if it looks like bulimia to anyone else?\n\nAny information of help would be much appreciated",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/n639p6/request_could_my_partner_be_suffering_from_bulimia/",
  "score": 42,
  "num_comments": 8,
  "comments": [
    {
      "id": "gx4zvu6",
      "author": "banana-itch",
      "body": "First of all, it's really good that you're looking out for your partner. She is really lucky to have someone as caring as you. It is impossible to diagnose any mental illness from this post, and only a doctor or therapist she is seeing can really do that. You have, however, noticed some worrying signs, like the fact that her vomiting has not gotten better at all, and the remarks she has made about her body. To be diagnosed with bulimia, there have to be episodes of binge eating. If that is not the case, but she is still suffering from an eating disorder, it might possibly be atypical anorexia binge / purge subtype (note: if an individual engages in either binging or purging or both, and fulfils the other criteria, they may be diagnosed with that). There is also an eating disorder called purging disorder, which doesn't include binge eating as well. Again, it is impossible to diagnose anything based on what is posted on the internet, and nobody on this sub can do that. It is a really good idea to talk to her about this, and suggest she see a therapist or doctor. Be aware that this is most likely a very uncomfortable subject for her, so make sure to approach it gently and with compassion, and let her know what it is that's worrying you and that you care for her and are there for her",
      "created_utc": 1620300798.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gx52bgj",
      "author": "xxtatgirl93xx",
      "body": "She is lucky to have someone as caring as you and who is looking out for her. \nLike the other Redditor pointed out we can’t diagnose nor should we because we can’t see the whole picture. I will say that it does sound like some disordered eating. If she’s not bindgeing it’s not really bulimia. The factors that we don’t see see what is going on in her mind. It is possible to get stuck in a purge cycle. When you purge a lot any amount of food feels heavy and your instincts do become to purge. You get reliant on that behavior. I wonder if the best thing would you to bring it up from a medical standpoint ie “you have been throwing up a lot maybe you should speak to your doctor” and go from there. Share your concerns, and your feelings about her.\nI hope this helps best of luck",
      "created_utc": 1620302385.0,
      "score": 12,
      "context": []
    },
    {
      "id": "gx5cv90",
      "author": "unsaintedheretic",
      "body": "Basically what the others said, we can't diagnose her but...\n\nI do feel that eating disorders can be triggered by certain events and this is definitely one I could imagine playing a big role in getting into an ED.\n\nI think it's great that you're attentive like that and the thing is... It doesn't matter what we or anyone else thinks. This is a suspicion you rightfully have and it's important to bring it up. \nYou should never feel as if you're overreacting when you come from a place of genuine concern.\n\nI think talking to her about it is the best thing you can do. Just be sure to not put any pressure on her or come off as if you're pointing a finger. Be gentle and show your concern. Whether or not she has a problem she'll be happy to know that you care about her and that she can open up to you. \nI also want to add that even if she indeed has an ED she may not be ready to deal with that reality (not even realize it herself yet) and either play it down or flat out refuse to admit it. And that is her right. We can't force people to admit these things or acknowledge them and accept help if they don't want it. \nJust make sure to be there for her no matter how she's going to react to \"being called out\".",
      "created_utc": 1620308205.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gx69lzy",
      "author": "Big_Sky5952",
      "body": "Some major signs to look at for are \n• Cut marks or scars on the knuckles (from teeth hitting your knuckles while gagging”\n• Puffy face \n• Weight changes\n• Finding hidden stashes or empty wrappers of foods\n• Bad Breath •\nShe very well may be, or she could just be sick. It is very important to be educated on the subject, no matter race, wealth, religion, sex, or age, Eating Disorders can effect anyone. Maybe try talking to her, but know it can be a very embarrassing thing. Many Bullimics are embarrassed/ashamed of the illness.",
      "created_utc": 1620322288.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gx5bopg",
      "author": "Nonamemeisback",
      "body": "Very possible",
      "created_utc": 1620307614.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gx4qkfk",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1620292974.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx7cbtm",
      "author": "None",
      "body": "It’s impossible to tell but I had an illness whereby I would vomit anytime I ate something. At some point, my mum would buy me juice so that I could drink it after throwing up, in order to make the next time I threw up easier. I used to joke that I was bulimic and I was really thin so it would get awkward because it was between the ages 12 to 16 and people would believe me. \n\nI was in and out hospital at that stage and once I was better, the puking stopped. It was glorious. \n\nI never ever did it to lose weight. It was much too painful. \n\nSee how she feels post-puke?",
      "created_utc": 1620338372.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gx980pr",
      "author": "Idejbfp",
      "body": "Just talk to her. If she's vomiting from a medical reason, she should be happy enough to go see a doctor about it. If it's on purpose, then at least open the conversation, show you're supportive, non-judgemental and let her know you're there. She might not be able to admit it immediately, but you've shown her that she can in the future.",
      "created_utc": 1620381009.0,
      "score": 1,
      "context": []
    }
  ]
}