{
  "id": "n8b0aq",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1620553938.0,
  "title": "Request: trigger by a fatshaming post",
  "selftext": "Hi, I have a lot of problems with my body and not fitting in, in society, due to chronic illness and symptoms. I struggle to leave the house and think about how I look so much that it limits me. I never quite fit the normal box of ED. I was dangerously thin as a teen, but I did not starve myself, I just tried eating healthier and exercised despite the exhaustion and other signals my body was giving me. I have celiac disease and was diagnosed at 15 years old. Yesterday I read a post on forum that was basicly fatshaming and it really triggered me. I tried to not let it affect me. Thinking \"why would this affect me so much? I don't have ED\". But I did not succeed. I cry now when I think about it. I find it hard to talk about because I don't fit into any box. And I feel quite lonely and invalid.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/n8b0aq/request_trigger_by_a_fatshaming_post/",
  "score": 50,
  "num_comments": 5,
  "comments": [
    {
      "id": "gxiohpn",
      "author": "brima24",
      "body": "If you are this upset over eating and body image, you would benefit from ED specific treatment. I fell into a similar pattern of just \"being healthy\" before realizing how bad my ed was, and calling a treatment center to schedule an intake interview, despite feeling that I didn't \"really\" have an ED probably saved my life.",
      "created_utc": 1620582404.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gxja7jv",
      "author": "claudalex26",
      "body": "You should look into orthorexia, which is an eating disorder that requires treatment, just as anorexia and bulimia. I'm not trying to diagnose you or anything, but people generally overlook how being obsessed with eating just the right amount, the right food, the right supplements can also be problematic, even though your behavior would usually be described as healthy.",
      "created_utc": 1620592881.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gxkbpaa",
      "author": "Sprinkles_Natural",
      "body": "While I am currently bulimic, and have what you what \"medically\" consider bulimia since around age 17 (I'm 31 now)  I absolutely had an eating disorder before then. I started counting calories at age 9, had severe body dysmorphia, and as a young teen even after getting home from 5 hours of dance class the first thing I would do when I got home was walk in the door and walk straight on the treadmill and run for at least an hour. Nobody thought I had an eating disorder. I always knew something was wrong though. And guess what? It was. You absolutely do not need to feel invalid, your feelings (and you) are completely valid because you exist in this world along with the rest of us and you deserve your truths and your experiences, not matter how painful they are. I can't give doctoral advice because I haven't been to a program, but I want to support you because your words triggered me too. Feeling invalid is a lot of the reason most of us are in these situations to begin with.",
      "created_utc": 1620613243.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gxhe1v2",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1620553938.0,
      "score": 1,
      "context": []
    }
  ]
}