{
  "id": "nfi3vn",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1621362223.0,
  "title": "Request: I miss the care I got before I began recovery. How do I get over that nostalgia?",
  "selftext": "This is a hard post for me, especially because I know people wrongly portray people with Eating Disorders as “just begging for attention.” That said, I really feel like I miss the care people showed me before I started weight restoration. \n\nI used to go to a nice doctor’s office every week because she was worried about me. Now she’s telling me that she’ll see me in a month, and if I’m still weight-restored, we can do once every three months. \n\nAlso, how did it become the case that I have the biggest appetite of all my friends? My friends used to have to trick me into going to restaurants or getting food, Now, if we’re together, they say things like “it’s so nice to see you not concerned about eating anymore” while I’m the only one at the table who ordered food. \n\nHeck, it even bothers me that my parents will bring me food, and I eat it without any thought. They like to hug me and tell me how I look so much happier these days. Oddly enough, I’m not happy that people think I’m happier.\n\nIt’s like, when I was underweight, I was really afraid of weight gain, but I was also afraid that my friends and family would think I’m content with what is happening to me in recovery. Now, that seems to be the case. I just kind of feel alone because I both want and don’t want to relapse, but it seems to be because I want people acknowledge I have an eating disorder. I want them to know how powerless I feel to stop the recovery process, and how much grief I feel toward my changing behaviours. \n\nIt’s a mindset I’m not proud of, and I’m wondering if any people have endured something similar and can share some advice. Thank you.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nfi3vn/request_i_miss_the_care_i_got_before_i_began/",
  "score": 37,
  "num_comments": 5,
  "comments": [
    {
      "id": "gymx1yo",
      "author": "amphetameany",
      "body": "This is a really common mindset in early recovery. You’re not alone at all. It takes time for our brains to catch up with our bodies.",
      "created_utc": 1621383293.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gyn3ven",
      "author": "dredged_dm",
      "body": "I really feel for you. Getting past this mindset is one of the hardest hurdles on the path to recovery. But just being aware that you are stuck in these thought patterns is a really good sign that you are capable of getting past them.",
      "created_utc": 1621386708.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gyo2xhv",
      "author": "Lobstermooniq",
      "body": "I understand that. I feel the same. But I think it’s the ED talking, if u think of it as seperate entities. It’s not you it’s the ED. It wants you to come back to it, it’s a trick.",
      "created_utc": 1621407167.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gylkw5q",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1621362223.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gyrxl9k",
      "author": "MmmAioli",
      "body": "I’m so glad you brought this up - and fuck common beliefs, stereotypes, myths, rumors, etc. YOU ARE ENTITLED TO HOW YOU FEEL AND YOUR EXPERIENCE IS VALID. <3 :)",
      "created_utc": 1621477682.0,
      "score": 1,
      "context": []
    }
  ]
}