{
  "id": "nfi532",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1621362303.0,
  "title": "Request: My younger sister is in the midst of a particularly low point with her anorexia",
  "selftext": " \n\nMy younger sister is in the midst of a particularly low point with her anorexia. It's rather intense. I have never had an ED, or been close... on the contrary, food is my best friend, always has been... my family and I are doing everything we can to wrap our heads around it (any advice here would be great as well). She has been opening up to me about her thoughts during my visit home to see her, expressing to me that her \"ED thoughts\" are particularly strong right now - specifically that food will harm her, make her fat, make her stomach hurt, and that getting through this is so much arduous work and she is not convinced that she even deserves that kind of attention and care from herself. It is body image, self-worth, and seemingly most prominently, the stomach pain (tips on navigating this are beyond welcome too). She has been in and out of treatment centers, but she has moved around from place to place, even signing herself out at the last one, never completing a program for a multitude of reasons: the food tastes bad (food always tastes bad to her, but extra bad in the facilities) and you don't get to pick what you eat, her therapists are not present enough to actually talk about things and do actual work (they just force her to eat and sleep, that's it), she doesn't get to go outside, etc. Honestly, sounds awful to me too. I mean, isn't a large part of ED the issue of mentally linking food, or lack thereof, with punishment? Does this approach of taking away privileges and human rights to breathing fresh air not simply reinforce this way of perceiving food? Genuinely, I want to understand if this works for people - if she is simply resisting inpatient because her ED is in the drivers seat, or if these concerns are valid and shared by many who have gone to inpatient, or perhaps a bit of both.\n\nNow she is in this tough spot. She is at my parents place where my parents are the ones figuratively wrestling with her to complete her meals, which seem to be one of three things: a shake of ensure mixed with peanut butter and ice cream, 5 or 6 yogurt covered pretzels, or a slice of bread. She freezes and I can see her panic on her face when she is served food. As you may have deduced, she is slowly losing weight after the weight she sustained from 6 or so months on a feeding tube. She is at the point where if she went to an outpatient/partial program, they would likely strongly suggest inpatient or drop her from the program for liability reasons. Same with therapists... she is meeting with one tomorrow who may be more open to the possibility of taking her on than others. She needs real, intensive help, more than what our (incredibly giving and self sacrificing) parents are capable of but she is just so incredibly resistant and non-responsive to the kind of care they offer at inpatient! Where do we go from here? Is it unsafe for her to be here at home? ...will she be ok? And what can I do, as her sister? It's incredibly hard to watch someone you care about so much become so pinned by their own mind... listless and numb and rigid with fear of life. She is really in the thick of it, folks. I can only imagine what hell she goes through every day.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nfi532/request_my_younger_sister_is_in_the_midst_of_a/",
  "score": 59,
  "num_comments": 3,
  "comments": [
    {
      "id": "gymgxbm",
      "author": "Bethcrunchy",
      "body": "I didn't struggle with that for a long time.  Because my family was supportive.. they dont even know that it was  mental disorder. ( but they know I struggle with depression) they rained me with complements. They asked me to coo mfor them because they love my cooking. I don't remember a lot. It was a long time ago. You have to help her realize that food is as important as water. And if Gid forbids she dies today. Will food be an important thing people talk about?Or what she does.\nIt's hard. But a bite is better than no bite. I remember  I loved to see people eating because it made me feel safe. And it made food very tempting to me. \nIt's  a slow process by the way. And even one positive word a day might help her mood. Just don't suffocate her with attention",
      "created_utc": 1621375456.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gyll3f0",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1621362303.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gyoe4xx",
      "author": "Sea-Smoke-9498",
      "body": "I can’t really help as everyone is different and the worst thing to feel is words being put in your mouth. So I’d say have you considedered consulting r/AnorexiaNervosa and hear a range of ideas from people all dealing with this one particular ED?",
      "created_utc": 1621417287.0,
      "score": 1,
      "context": []
    }
  ]
}