{
  "id": "nfrvhk",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1621386743.0,
  "title": "Request: Fat Acceptance vs. Ruining My Health",
  "selftext": "Hi.\nI (53F) have struggled with various eating disorders from the time I was about eight years old. It's mostly been BED, with periods of severe restriction especially in my 20s and 30s. I finally sought help at the end of 2019 and spent four months in an intensive outpatient program at a highly-regarded eating disorders clinic. It helped tremendously, especially with \"fat acceptance\". Some of the best lessons I learned were that food is just fuel, there are no \"bad\" foods, and \"fat\" is just an adjective. When I left the program, I had tools under my belt and a new outlook.\nAnd then the pandemic hit. Along with the isolation and the toxic positivity that is thrown at essential workers (I am one) and some severe mental health struggles my kid was having that were leading to rages and abuse, the binges came back -- not quite full-bore, but close.\nI have been excusing my binges by comparing them to worse binges I've had in the past. I keep hanging on to \"fat acceptance\" and the fact that I am the fat girl who baffles doctors with her perfect blood pressure and perfect cholesterol and perfect A1C. Thing is, it's gotten to the point where my weight is affecting my health now. I am at the highest weight I have ever been in my life. My feet and lower back hurt all. the. time. My stomach is starting to get in the way of sex. I took my dog out for a walk yesterday and it took 20 minutes to walk less than half a mile. Five years ago, I was walking 20-30 miles a week.\nI spent so many years hating my body. Treatment got me to love my body again. Now I am having a hard time reconciling the fact that I need to take action to be kind to my body against the old tapes that are telling me that any sort of modification, tracking, or restriction of food intake means that I hate my body.\nI don't know exactly what I'm asking here. I just knew that someone here would probably get it.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nfrvhk/request_fat_acceptance_vs_ruining_my_health/",
  "score": 51,
  "num_comments": 15,
  "comments": [
    {
      "id": "gynhpoq",
      "author": "Rainbow_Explosion",
      "body": "I have BED as well and what I took from treatment is that for us it is more helpful to focus on health than weight/calories. Start moving regularly, eating according to your schedule, and focus on getting balanced meals. This is good for you. I lost weight in treatment and it had nothing to do with counting calories or weighing myself. I'm struggling outside of it, but treatment taught me I don't have to be strict and suffer to be healthy.",
      "created_utc": 1621393583.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gyox8rn",
      "author": "Boosey0910",
      "body": "I can relate albeit my ED past is dealing with anorexia, and exercise bulimia.  I am also 53.  I started down the road at 14, lost a ton of weight after sexual abuse by a neighbor, got some therapy (not good stuff though as this was back in the early 80's ), and put enough back on to look \"healthy\" and then when stresses would hit my life (abusive ex husband, death of a parent, etc) , I'd lose weight again and start the shame and self hatred spiral.  I don't think I ever really uncovered the pain, grief and trauma that led to my ED in the first place, UNTIL the pandemic. The gym shut down, I got injured, I gained a few pounds, I got a bone density scan (osteoporosis) and had to sit in the rubble of the pain destruction I'd never deal with.    The self loathing and hatred I still felt towards this body of mine was still there.  Just buried away.  Now I'm really trying to work through it, I'm 53 and this (as you know) has occupied my way of thinking for so long that it's become part of the lens that I view the world through.   Loving ourselves is so damn hard, no matter the size.  I just wanted you to know that you are not alone.  I'm not overweight but I still hate myself.  Working on it though and each time I cry I think \"well another layer of this grief is releasing\" and it seems like that is a good thing.  I'm sending you support on your journey.  I bet you're beautiful.  :-)",
      "created_utc": 1621429603.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gyovfd6",
      "author": "FoxiiFighter",
      "body": "So, I'm kind of in a similar spot. I recovered from an undereating disorder to an obese BMI (thanks to BOPO and Fat Acceptance), and I've spent the last two years learning how to maintain my weight by balancing food and movement, learning how to enjoy foods, etc. \n\nTrying to reconcile WHAT I know I need to do to lose the weight healthfully is a little challenging because it does seem counter-productive to recovery and staying in a healthy mindset. And given my history, I'm absolutely terrified that I may slip back to old habits. \n\nI would strongly suggest doing a TON of research and educating yourself on nutrition in general -- like, get to the biological, chemical level of food and nutrients -- knowledge is power, and learning about it helped me to create my own game plan when it comes to nutrition. And because of that, I know how I can fit in some of my favorite treat foods into my life and still reach my goals, all without the anxiety I used to have. \n\nFocusing on behaviors is also a really good way to start without focusing on number goals. Things like making sure you stay hydrated, being active every day, doing stretching or meditation or other connective activities every day. \n\nI would also recommend that you choose your inspirations/information sources very very carefully.  It's taken me a while, but I have a set list of about 5 fitness/nutrition/lifestyle influencers that I follow that appropriately fit what is best for me. All of them are no-bullshit, pro-science, all have certifications and 10+ years of lived experience. A few of them have had BED or other EDs that I can relate to. If you want to message me I can share them with you (I don't know if it goes against the policy to share influencers here). They all balance each other out, and keep me focused on the right things.",
      "created_utc": 1621428717.0,
      "score": 4,
      "context": []
    },
    {
      "id": "gyn4y4i",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1621387255.0,
      "score": 20,
      "context": []
    },
    {
      "id": "gyo0m26",
      "author": "Maggiemaccy",
      "body": "Restriction will bring back your binge eating in full, any ‘diet’ is going to do that. Your mental health is also an important element of your health. \n\nWhen I get into this state of mind and feel bulimia pulling me back in I vocalise that what I’m experiencing with eating is a symptom of something else going on, it’s stress or anxiety or whatever it may be. For some reason that helps, then I work on managing that issue, not the food. My eating has always rectified itself.\n\nBinge eating lives within a cycle. Your brain will respond to restriction or even the idea of it with an urge to binge and that will cycle on until binge eating is out of control. I struggled with it for years and thought I was “getting better” by playing the ‘I’ve got X days without a binge’ game while eating clean between times. It just doesn’t work that way, ask yourself have you been dieting or telling yourself you will start dieting soon? That will fuel the urge to binge",
      "created_utc": 1621405364.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gyn3xth",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1621386743.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gyr3f50",
      "author": "Bassplayer1776",
      "body": "I got an eating disorder from the pandemic. One thing that really helped me honestly was fitness YouTube. Greg doucette, will tennyson, and the podcast “mind pump” are really good at getting you to a place where you can honestly evaluate yourself, and then know where to go. I had anorexia which led to BED eventually( not extreme hunger trust me) and I am still struggling for sure, but they have helped immensely. I hope you get to a place where you love yourself enough to take care of your body",
      "created_utc": 1621462494.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gyrfwg4",
      "author": "ruth_mcdougle",
      "body": "i don't know how helpful it is but i think it's okay to exist in the middle? i've struggled with my eating disorder for nearly 15 years. the thing that has helped me every time i've gotten to a dark place is accountability but also kindness. \n\nyour life sounds really stressful right now! being an essential worker, mental health struggles, being a mom during this time, the isolation of the pandemic, the general stress of the outside world - that's a lot to be dealing with. this year was really hard. sometimes, we're just trying to survive and make it through all of those really challenging and mentally exhausting experiences. sometimes, we'll cope in certain ways using food. that's okay. i hope you're also celebrating all the things you were able to do in this time too, like you worked in the outside world when others couldn't, you kept your family fed and housed, you supported your child to the best of your ability during these crises. thank you for doing what you did, because to a total internet stranger that sounds like a lot to be proud of! i hope you're proud of it too. \n\ni hope you can give yourself a little bit of grace and also recognize that you are in a different position than before. you know that weight and body shape is different than health, and you're realizing that you're tipping into the health side of things. that's okay and normal! we will all deal with that in our lives. \n\nit sounds like you're already making changes to address this by noticing what is feeling different. be kind and gentle with yourself as you introduce new changes to help you feel better. you can love yourself for being yourself and try new behaviors to help you feel good when living your life as well as feeling good about who you are. \n\ni listen to a podcast called maintenance phase if you're interested - where the hosts debunk misconceptions about weight and food related trends in america. one of the cohosts wrote this! i really appreciated this perspective: https://highline.huffingtonpost.com/articles/en/everything-you-know-about-obesity-is-wrong",
      "created_utc": 1621468764.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gype69l",
      "author": "n_chloe",
      "body": "hi, im a 14 year old girl right now and im suffering with disordered eating and i guess this hit me hard for some reason. i know there is a big age gap between us but im proud of you! i hope to be as strong as you when im older :)",
      "created_utc": 1621436953.0,
      "score": 7,
      "context": [
        {
          "id": "gyox8rn",
          "author": "Boosey0910",
          "body": "I can relate albeit my ED past is dealing with anorexia, and exercise bulimia.  I am also 53.  I started down the road at 14, lost a ton of weight after sexual abuse by a neighbor, got some therapy (not good stuff though as this was back in the early 80's ), and put enough back on to look \"healthy\" and then when stresses would hit my life (abusive ex husband, death of a parent, etc) , I'd lose weight again and start the shame and self hatred spiral.  I don't think I ever really uncovered the pain, grief and trauma that led to my ED in the first place, UNTIL the pandemic. The gym shut down, I got injured, I gained a few pounds, I got a bone density scan (osteoporosis) and had to sit in the rubble of the pain destruction I'd never deal with.    The self loathing and hatred I still felt towards this body of mine was still there.  Just buried away.  Now I'm really trying to work through it, I'm 53 and this (as you know) has occupied my way of thinking for so long that it's become part of the lens that I view the world through.   Loving ourselves is so damn hard, no matter the size.  I just wanted you to know that you are not alone.  I'm not overweight but I still hate myself.  Working on it though and each time I cry I think \"well another layer of this grief is releasing\" and it seems like that is a good thing.  I'm sending you support on your journey.  I bet you're beautiful.  :-)",
          "created_utc": 1621429603.0
        }
      ]
    },
    {
      "id": "gyrbn8x",
      "author": "Boosey0910",
      "body": "If I could go back and have a chat with my 14 year old self, I would give her a huge hug, tell her she was perfect just as she was and that one day she'd learn to love herself.  I'd also tell her to get some help sooner rather than later so she wouldn't be still dealing with an ED and the resulting health issues.  Of course my 14 year old self may have not listened to my 53 year old self.  But I do wish I had received help when I was a lot younger.  But there wasn't as much information and help available way back then.   Take care of yourself.  Be brave.",
      "created_utc": 1621466588.0,
      "score": 3,
      "context": [
        {
          "id": "gyox8rn",
          "author": "Boosey0910",
          "body": "I can relate albeit my ED past is dealing with anorexia, and exercise bulimia.  I am also 53.  I started down the road at 14, lost a ton of weight after sexual abuse by a neighbor, got some therapy (not good stuff though as this was back in the early 80's ), and put enough back on to look \"healthy\" and then when stresses would hit my life (abusive ex husband, death of a parent, etc) , I'd lose weight again and start the shame and self hatred spiral.  I don't think I ever really uncovered the pain, grief and trauma that led to my ED in the first place, UNTIL the pandemic. The gym shut down, I got injured, I gained a few pounds, I got a bone density scan (osteoporosis) and had to sit in the rubble of the pain destruction I'd never deal with.    The self loathing and hatred I still felt towards this body of mine was still there.  Just buried away.  Now I'm really trying to work through it, I'm 53 and this (as you know) has occupied my way of thinking for so long that it's become part of the lens that I view the world through.   Loving ourselves is so damn hard, no matter the size.  I just wanted you to know that you are not alone.  I'm not overweight but I still hate myself.  Working on it though and each time I cry I think \"well another layer of this grief is releasing\" and it seems like that is a good thing.  I'm sending you support on your journey.  I bet you're beautiful.  :-)",
          "created_utc": 1621429603.0
        },
        {
          "id": "gype69l",
          "author": "n_chloe",
          "body": "hi, im a 14 year old girl right now and im suffering with disordered eating and i guess this hit me hard for some reason. i know there is a big age gap between us but im proud of you! i hope to be as strong as you when im older :)",
          "created_utc": 1621436953.0
        }
      ]
    },
    {
      "id": "gyren41",
      "author": "n_chloe",
      "body": "that really made me realize that my future self will probably look back and be regretful. your words have actually helped me so much, so thank you. i hope you will also take care of yourself :)",
      "created_utc": 1621468132.0,
      "score": 1,
      "context": [
        {
          "id": "gyox8rn",
          "author": "Boosey0910",
          "body": "I can relate albeit my ED past is dealing with anorexia, and exercise bulimia.  I am also 53.  I started down the road at 14, lost a ton of weight after sexual abuse by a neighbor, got some therapy (not good stuff though as this was back in the early 80's ), and put enough back on to look \"healthy\" and then when stresses would hit my life (abusive ex husband, death of a parent, etc) , I'd lose weight again and start the shame and self hatred spiral.  I don't think I ever really uncovered the pain, grief and trauma that led to my ED in the first place, UNTIL the pandemic. The gym shut down, I got injured, I gained a few pounds, I got a bone density scan (osteoporosis) and had to sit in the rubble of the pain destruction I'd never deal with.    The self loathing and hatred I still felt towards this body of mine was still there.  Just buried away.  Now I'm really trying to work through it, I'm 53 and this (as you know) has occupied my way of thinking for so long that it's become part of the lens that I view the world through.   Loving ourselves is so damn hard, no matter the size.  I just wanted you to know that you are not alone.  I'm not overweight but I still hate myself.  Working on it though and each time I cry I think \"well another layer of this grief is releasing\" and it seems like that is a good thing.  I'm sending you support on your journey.  I bet you're beautiful.  :-)",
          "created_utc": 1621429603.0
        },
        {
          "id": "gype69l",
          "author": "n_chloe",
          "body": "hi, im a 14 year old girl right now and im suffering with disordered eating and i guess this hit me hard for some reason. i know there is a big age gap between us but im proud of you! i hope to be as strong as you when im older :)",
          "created_utc": 1621436953.0
        },
        {
          "id": "gyrbn8x",
          "author": "Boosey0910",
          "body": "If I could go back and have a chat with my 14 year old self, I would give her a huge hug, tell her she was perfect just as she was and that one day she'd learn to love herself.  I'd also tell her to get some help sooner rather than later so she wouldn't be still dealing with an ED and the resulting health issues.  Of course my 14 year old self may have not listened to my 53 year old self.  But I do wish I had received help when I was a lot younger.  But there wasn't as much information and help available way back then.   Take care of yourself.  Be brave.",
          "created_utc": 1621466588.0
        }
      ]
    },
    {
      "id": "gyrezdr",
      "author": "Boosey0910",
      "body": ":-).  You have a great life ahead of you.",
      "created_utc": 1621468298.0,
      "score": 1,
      "context": [
        {
          "id": "gyox8rn",
          "author": "Boosey0910",
          "body": "I can relate albeit my ED past is dealing with anorexia, and exercise bulimia.  I am also 53.  I started down the road at 14, lost a ton of weight after sexual abuse by a neighbor, got some therapy (not good stuff though as this was back in the early 80's ), and put enough back on to look \"healthy\" and then when stresses would hit my life (abusive ex husband, death of a parent, etc) , I'd lose weight again and start the shame and self hatred spiral.  I don't think I ever really uncovered the pain, grief and trauma that led to my ED in the first place, UNTIL the pandemic. The gym shut down, I got injured, I gained a few pounds, I got a bone density scan (osteoporosis) and had to sit in the rubble of the pain destruction I'd never deal with.    The self loathing and hatred I still felt towards this body of mine was still there.  Just buried away.  Now I'm really trying to work through it, I'm 53 and this (as you know) has occupied my way of thinking for so long that it's become part of the lens that I view the world through.   Loving ourselves is so damn hard, no matter the size.  I just wanted you to know that you are not alone.  I'm not overweight but I still hate myself.  Working on it though and each time I cry I think \"well another layer of this grief is releasing\" and it seems like that is a good thing.  I'm sending you support on your journey.  I bet you're beautiful.  :-)",
          "created_utc": 1621429603.0
        },
        {
          "id": "gype69l",
          "author": "n_chloe",
          "body": "hi, im a 14 year old girl right now and im suffering with disordered eating and i guess this hit me hard for some reason. i know there is a big age gap between us but im proud of you! i hope to be as strong as you when im older :)",
          "created_utc": 1621436953.0
        },
        {
          "id": "gyrbn8x",
          "author": "Boosey0910",
          "body": "If I could go back and have a chat with my 14 year old self, I would give her a huge hug, tell her she was perfect just as she was and that one day she'd learn to love herself.  I'd also tell her to get some help sooner rather than later so she wouldn't be still dealing with an ED and the resulting health issues.  Of course my 14 year old self may have not listened to my 53 year old self.  But I do wish I had received help when I was a lot younger.  But there wasn't as much information and help available way back then.   Take care of yourself.  Be brave.",
          "created_utc": 1621466588.0
        },
        {
          "id": "gyren41",
          "author": "n_chloe",
          "body": "that really made me realize that my future self will probably look back and be regretful. your words have actually helped me so much, so thank you. i hope you will also take care of yourself :)",
          "created_utc": 1621468132.0
        }
      ]
    },
    {
      "id": "gyrf4h5",
      "author": "n_chloe",
      "body": "thank you, you're an awesome woman :D",
      "created_utc": 1621468368.0,
      "score": 1,
      "context": [
        {
          "id": "gyox8rn",
          "author": "Boosey0910",
          "body": "I can relate albeit my ED past is dealing with anorexia, and exercise bulimia.  I am also 53.  I started down the road at 14, lost a ton of weight after sexual abuse by a neighbor, got some therapy (not good stuff though as this was back in the early 80's ), and put enough back on to look \"healthy\" and then when stresses would hit my life (abusive ex husband, death of a parent, etc) , I'd lose weight again and start the shame and self hatred spiral.  I don't think I ever really uncovered the pain, grief and trauma that led to my ED in the first place, UNTIL the pandemic. The gym shut down, I got injured, I gained a few pounds, I got a bone density scan (osteoporosis) and had to sit in the rubble of the pain destruction I'd never deal with.    The self loathing and hatred I still felt towards this body of mine was still there.  Just buried away.  Now I'm really trying to work through it, I'm 53 and this (as you know) has occupied my way of thinking for so long that it's become part of the lens that I view the world through.   Loving ourselves is so damn hard, no matter the size.  I just wanted you to know that you are not alone.  I'm not overweight but I still hate myself.  Working on it though and each time I cry I think \"well another layer of this grief is releasing\" and it seems like that is a good thing.  I'm sending you support on your journey.  I bet you're beautiful.  :-)",
          "created_utc": 1621429603.0
        },
        {
          "id": "gype69l",
          "author": "n_chloe",
          "body": "hi, im a 14 year old girl right now and im suffering with disordered eating and i guess this hit me hard for some reason. i know there is a big age gap between us but im proud of you! i hope to be as strong as you when im older :)",
          "created_utc": 1621436953.0
        },
        {
          "id": "gyrbn8x",
          "author": "Boosey0910",
          "body": "If I could go back and have a chat with my 14 year old self, I would give her a huge hug, tell her she was perfect just as she was and that one day she'd learn to love herself.  I'd also tell her to get some help sooner rather than later so she wouldn't be still dealing with an ED and the resulting health issues.  Of course my 14 year old self may have not listened to my 53 year old self.  But I do wish I had received help when I was a lot younger.  But there wasn't as much information and help available way back then.   Take care of yourself.  Be brave.",
          "created_utc": 1621466588.0
        },
        {
          "id": "gyren41",
          "author": "n_chloe",
          "body": "that really made me realize that my future self will probably look back and be regretful. your words have actually helped me so much, so thank you. i hope you will also take care of yourself :)",
          "created_utc": 1621468132.0
        },
        {
          "id": "gyrezdr",
          "author": "Boosey0910",
          "body": ":-).  You have a great life ahead of you.",
          "created_utc": 1621468298.0
        }
      ]
    },
    {
      "id": "gytcbb6",
      "author": "Boosey0910",
      "body": "Believe me you are awesome as well and wiser than you probably realize.  DM me anytime.",
      "created_utc": 1621513765.0,
      "score": 1,
      "context": [
        {
          "id": "gyox8rn",
          "author": "Boosey0910",
          "body": "I can relate albeit my ED past is dealing with anorexia, and exercise bulimia.  I am also 53.  I started down the road at 14, lost a ton of weight after sexual abuse by a neighbor, got some therapy (not good stuff though as this was back in the early 80's ), and put enough back on to look \"healthy\" and then when stresses would hit my life (abusive ex husband, death of a parent, etc) , I'd lose weight again and start the shame and self hatred spiral.  I don't think I ever really uncovered the pain, grief and trauma that led to my ED in the first place, UNTIL the pandemic. The gym shut down, I got injured, I gained a few pounds, I got a bone density scan (osteoporosis) and had to sit in the rubble of the pain destruction I'd never deal with.    The self loathing and hatred I still felt towards this body of mine was still there.  Just buried away.  Now I'm really trying to work through it, I'm 53 and this (as you know) has occupied my way of thinking for so long that it's become part of the lens that I view the world through.   Loving ourselves is so damn hard, no matter the size.  I just wanted you to know that you are not alone.  I'm not overweight but I still hate myself.  Working on it though and each time I cry I think \"well another layer of this grief is releasing\" and it seems like that is a good thing.  I'm sending you support on your journey.  I bet you're beautiful.  :-)",
          "created_utc": 1621429603.0
        },
        {
          "id": "gype69l",
          "author": "n_chloe",
          "body": "hi, im a 14 year old girl right now and im suffering with disordered eating and i guess this hit me hard for some reason. i know there is a big age gap between us but im proud of you! i hope to be as strong as you when im older :)",
          "created_utc": 1621436953.0
        },
        {
          "id": "gyrbn8x",
          "author": "Boosey0910",
          "body": "If I could go back and have a chat with my 14 year old self, I would give her a huge hug, tell her she was perfect just as she was and that one day she'd learn to love herself.  I'd also tell her to get some help sooner rather than later so she wouldn't be still dealing with an ED and the resulting health issues.  Of course my 14 year old self may have not listened to my 53 year old self.  But I do wish I had received help when I was a lot younger.  But there wasn't as much information and help available way back then.   Take care of yourself.  Be brave.",
          "created_utc": 1621466588.0
        },
        {
          "id": "gyren41",
          "author": "n_chloe",
          "body": "that really made me realize that my future self will probably look back and be regretful. your words have actually helped me so much, so thank you. i hope you will also take care of yourself :)",
          "created_utc": 1621468132.0
        },
        {
          "id": "gyrezdr",
          "author": "Boosey0910",
          "body": ":-).  You have a great life ahead of you.",
          "created_utc": 1621468298.0
        },
        {
          "id": "gyrf4h5",
          "author": "n_chloe",
          "body": "thank you, you're an awesome woman :D",
          "created_utc": 1621468368.0
        }
      ]
    }
  ]
}