{
  "id": "nklvhi",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1621936170.0,
  "title": "Request: I just admitted to myself that I have an eating disorder and I don't know what to do next.",
  "selftext": "I'm in my late20s, male.  I was very overweight my whole life until my early 20s. Due to a stressful school situation, I lost a lot of weight very quickly, and had to be hospitalized for dehydration. When I am stressed, I get nauseous and have to vomit. I always told myself it wasn't bulimia because I didn't binge eat and I didn't make myself throw up.\n\nI've been strength training for almost a year. Been building some muscle but losing body fat is slow and hard. With my trainers advice, I just did a week of calorie restriction. I still gained weight. He said my metabolism was slow due to losing a lot of weight in the past and I should stop restricting calories to start repairing it. I am so terrified of gaining weight again, it makes me viscerally sick and upset. I've been tracking calories and I was actually under my maintenance. I forced myself to eat more, despite being hungry I felt like I was binging even though I technically needed to eat. I tried to tell myself not to throw up but I just did and then cried in my bathroom, filled with nightmares about gaining weight and being unable to lose it.\nI'm so scared and I don't know what to do.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nklvhi/request_i_just_admitted_to_myself_that_i_have_an/",
  "score": 53,
  "num_comments": 7,
  "comments": [
    {
      "id": "gzdkcwt",
      "author": "Possible_Ad_8694",
      "body": " Don’t panic. If you do one week without restriction, surely nothing irreparable will happen to your body. Experimenting is a huge part of solving eating disorder. Don’t be scared, you’re not bingeing as I can tell from your post. Focus on your health, weight maintenance is only a part of a healthy body, which you will achieve!",
      "created_utc": 1621938890.0,
      "score": 14,
      "context": []
    },
    {
      "id": "gzefz70",
      "author": "dredged_dm",
      "body": "Fellow late-20s man with an eating disorder here. Listen to your trainer and remember that being healthy and low numbers on a scale are not the same thing. \n\nAnd if you ever feel yourself panicking feel free to message me. I've been where you are and I know having someone who will listen helped me.",
      "created_utc": 1621956323.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gzecscy",
      "author": "None",
      "body": "If this is any consolation, I’ve been through three separate periods in my life where I lost so much weight so quickly, lost my menstrual cycle, had chronic constipation, and experienced absolutely no appetite. If you still get hungry, you probably haven’t restricted to the point of irreparable damage because each time I’ve gotten bad - I’ve gotten better. I’m currently getting better and am happy to say that 4 days of adequate calories was enough to show initial signs of improvement. \n\nGet with a professional, and stop relying your sense of self worth on the number on the scale. I understand it’s not that easy for someone who has conditioned themselves to be scared of weight gain, but I highly recommend seeking help from both medical and mental health professionals to help you get better on both fronts. You are worthy of love and an amazing life no matter what the number on the scale is. Our bodies are resilient and can heal from *most* damage. \n\nLook into what happens to the body during recovery, it’ll ease your mind on some of the effects. Focus on health not appearance. Much love.",
      "created_utc": 1621954895.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gzgu3pi",
      "author": "None",
      "body": "Hi there! I got free from food & weight obsession and compulsive eating & compulsive exercising behaviors by working a 12 step program with a recovered sponsor. If you'd like more info feel free to reach out to me.",
      "created_utc": 1621996004.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gzewflw",
      "author": "None",
      "body": "Thank you for sharing with us first off. It is brave to come to terms with your Eating Disorder yourself, let alone admit it online or reach out for help. I am a former bulimic who is 8 months into recovery. What really helped me was reading the book “Intuitive Eating” by Evelyn Tribole, MS, RDN, CEDRD-S and Eylse Resch, MS, RDN, CEDRD-S, FAND. I later bought the accompanying workbook to help guide me through my recovery process with the help of my therapist. \n\nIntuitive Eating changed my life and gave me the strength to stand up to my ED of 14 years. Before Intuitive Eating I was nutrient deficient from restriction, binging, and purging. My hair was falling out, I lost so much muscle mass that I was weak and fatigued all the time, and I developed major depressive episode. It is a long process, but it is a great place to start. \n\nI believe in you!",
      "created_utc": 1621963380.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzdharn",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1621936170.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gze7b3k",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1621952435.0,
      "score": 5,
      "context": [
        {
          "id": "gzdkcwt",
          "author": "Possible_Ad_8694",
          "body": " Don’t panic. If you do one week without restriction, surely nothing irreparable will happen to your body. Experimenting is a huge part of solving eating disorder. Don’t be scared, you’re not bingeing as I can tell from your post. Focus on your health, weight maintenance is only a part of a healthy body, which you will achieve!",
          "created_utc": 1621938890.0
        }
      ]
    },
    {
      "id": "gzen7m5",
      "author": "Possible_Ad_8694",
      "body": "I suppose when you fix your metabolism, weight change will be so much easier for you! Bingeing is unhealthy, and therefore it never makes sense, but eating whatever you want does make complete sense. Importantly, bingeing ≠ eating whatever you want.",
      "created_utc": 1621959417.0,
      "score": 2,
      "context": [
        {
          "id": "gzdkcwt",
          "author": "Possible_Ad_8694",
          "body": " Don’t panic. If you do one week without restriction, surely nothing irreparable will happen to your body. Experimenting is a huge part of solving eating disorder. Don’t be scared, you’re not bingeing as I can tell from your post. Focus on your health, weight maintenance is only a part of a healthy body, which you will achieve!",
          "created_utc": 1621938890.0
        },
        {
          "id": "gze7b3k",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1621952435.0
        }
      ]
    }
  ]
}