{
  "id": "nlcifj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1622020317.0,
  "title": "Request: Heard my sister purging",
  "selftext": "I (23F) am still in the process of recovering from an eating disorder undeveloped at 16. Today I overheard my sister (14F) purging in the bathroom. She isn’t sick and she’s taken a recent interest in calorie counting and intermittent fasting. She’s a perfectly healthy weight for her her age and height. How can I go about approaching her about this? I don’t want to let it get to the point my ED got to.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nlcifj/request_heard_my_sister_purging/",
  "score": 56,
  "num_comments": 11,
  "comments": [
    {
      "id": "gzht3or",
      "author": "thedutchgirl13",
      "body": "I can only suggest you talk to her honestly. Describe your own struggles and how that effected you. Explain it will only progress. Mostly offer support",
      "created_utc": 1622020934.0,
      "score": 52,
      "context": []
    },
    {
      "id": "gzi0p4m",
      "author": "Lukarhys",
      "body": "Talk to her gently and use your own experiences as an example. You know what it's like, so be understanding and let her know that you're there for her.",
      "created_utc": 1622027228.0,
      "score": 11,
      "context": []
    },
    {
      "id": "gzi2v5f",
      "author": "None",
      "body": "I would approach the conversation with compassion. Think back to when you were in the depths of your ED and imagine how you would have liked someone to discuss it with you. I am a recovering bulimic and it really is such a brutal ED to suffer from. I am wishing you and your sister only the best <3",
      "created_utc": 1622028785.0,
      "score": 8,
      "context": []
    },
    {
      "id": "gzi1vdv",
      "author": "None",
      "body": "I would talk to her 1 you might be the support she needs 2 you never know what she is doing or why. My wife was crying one time because she heard me throwing up after dinner 2 night in a row. I recently been losing a bunch of weight and she thought i was just throwing up everything i ate. I hate hiccups a lot and if you make your self throw up they go away. She went from crying to laughing at me very fast. Hoping for the best",
      "created_utc": 1622028087.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gzi98k6",
      "author": "SellimarieTomsen",
      "body": "You should maybe adress it gently and tell her that you are there if she wants to talk. You could tell her that you can relate or describe some of the things you struggled with. Please do not push her or force her to talk about it if she doesnt want to. My mom did this, and it was really hard mentally. Try to support her, and be there for her. Wishing you both the best☺️",
      "created_utc": 1622032745.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gzic8w1",
      "author": "enord11400",
      "body": "I assume she knows about your ED but if she doesn’t then tell her about it and maybe express that you could try to help her find help if your family can afford it. She may not want help but she also might be waiting for someone to notice what’s going on. At 13, I was always a little touched and a little terrified when someone noticed I wasn’t really eating much. I always just shrugged it off saying I wasn’t hungry. You could start gently with the calorie counting and intermittent fasting and just talk to her about it and your concerns and if she seems receptive then mention the purging since it is often wrapped in shame more so than more typical diet-like behaviors. I started purging at 14 or 15 and if someone had heard me then I think I would’ve denied it with everything I had. Alternatively you could come in strong with the purging and say combined with the other things you are concerned. You’ll have to assess which one you think will work better. There is the risk that once you mention it she will try to hide everything more, but you will probably be able to recognize if that is happening if she suddenly stops mentioning her new food habits. I hope you can get through to her.",
      "created_utc": 1622034335.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gzjpipn",
      "author": "heiiidiii",
      "body": "I don't have any advice that hasn't already been commented but I just wanted to say that you seem like a great sister. Whether or not your sister chooses to open up to you, you're still letting her know that you care and are there for her, which can make such a huge difference. Sending love to you both <3",
      "created_utc": 1622055190.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzhsgrc",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1622020317.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gzhxcts",
      "author": "Outrageous-Worth-192",
      "body": "I've been in the same situation with my sister. It's terrifying seeing the people you love harming themselves the same way you do.\nTalk to her, heart-to-heart, about your own struggles. The downside is that she may think you're lecturing her and she might get upset. You know how hard it is to admit there's something wrong.\nTry to find in your environment what could be a trigger of the disorder. For example, if someone in your family says hurtful things or even seemingly innocent sentences that can be hurtful to your sister. Try to correct what you can in your direct environment.\nGood luck, I know it's not easy.",
      "created_utc": 1622024631.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzkcvyp",
      "author": "elhazelenby",
      "body": "You should let her know that you're there for her and that this isn't going to make her happier, more the opposite.\n\nMy older sister has bulimia and I used to hear her purging a lot when I was younger and I'd hear her do it when I lived with her for a bit last year. It's not very nice to hear or see in someone you care about.  I hope you can convince her that she needs help.",
      "created_utc": 1622065333.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzhxock",
      "author": "None",
      "body": "Seconding this. Although, from experience, when someone tried to raise it with me I would get defensive and push them away. Raising the issue gently works best I think, whilst focusing on the underlying reason for the struggle rather than the pursuit of weight loss itself.",
      "created_utc": 1622024889.0,
      "score": 21,
      "context": [
        {
          "id": "gzht3or",
          "author": "thedutchgirl13",
          "body": "I can only suggest you talk to her honestly. Describe your own struggles and how that effected you. Explain it will only progress. Mostly offer support",
          "created_utc": 1622020934.0
        }
      ]
    }
  ]
}