{
  "id": "nlx49z",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1622080985.0,
  "title": "Request: I need Help",
  "selftext": "Hi, i’m a 17yr old female, and i’ve been struggling with disordered eating for as long as i can remember. In the last year or so i’ve developed full blown anorexia. \ntoday my mom asked if i wanted to go get a slurpee from 7-eleven, and i agreed happily. \nshe asked me what size i wanted and i said “large”. she looked at me and said “seriously? Do you really need all of that?”.\nthis crushed me, when i got home i ended up pouring the drink down the sink.\nmy mom and dad constantly say those kinds of comments to me and my brother (we are both extremely under weight right now). \nfor reference both my parents are overweight and have continually warned us about gaining weight. ( they don’t know that i have an ED as i try and hide it)\nI HAVE NO IDEA HOW TO DEAL WITH MY PARENTS. please if u have experienced something similar, share you advice/story with me.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nlx49z/request_i_need_help/",
  "score": 54,
  "num_comments": 13,
  "comments": [
    {
      "id": "gzlc842",
      "author": "canadianworm",
      "body": "Ask for help or if your not comfortable with that seek help yourself. My mom had friends that were concerned about my anorexia but she always disagreed, now as an adult we’ve talked about and she’s apologized for not noticing and getting me help. Many parents aren’t aware of how there comments can affect there kids in a bad way, they just want the best (in most cases). Tell them your struggling, tell them straight up, with examples, that those comments make it really hard and ask for professional help",
      "created_utc": 1622082969.0,
      "score": 21,
      "context": []
    },
    {
      "id": "gzlcj22",
      "author": "DragonflyStunning",
      "body": "sorry you’re dealing with that, is there any way to make an appointment with your family doctor? doctors aren’t very helpful but they can refer you to a nutritionist and therapist that specializes in eds it sounds like your mom may have some disordered eating as well, look up some eating disorder hotlines to call or text and see what resources are available\n\ni’ve been through tons of treatment, you’re a minor and the best time to get help is right now. message me if you need more help or resources !!!",
      "created_utc": 1622083133.0,
      "score": 6,
      "context": []
    },
    {
      "id": "gzlm8ow",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1622088890.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gzlmk9p",
      "author": "None",
      "body": "first of all, are you ok right now? that must be so hard. maybe your mother didn't have any malicious intent behind her words, but still, it hurts to hear things like that from your very own parents. there shouldn't be anything wrong with getting a slurpee, if a person wants one they get one, end of story :( i've been through something similar as well w my parents through recovery, but i've figured out ways to get over it. the best way to get yourself over that hurdle is to first understand. to assess the situation as it is. for example, when my mother would make a rather triggering comment, i would think, 'oh, this sounds pretty triggering. but it wasn't meant to trigger me, was it? it was hardly directed towards me, and her making that comment probably resulted from her own lifestyle and her own problems. my mom would have absolutely no problem if i ate this (insert food) right now. which means i have no reason to mull on this conversation any longer.' \n\nsometimes, my sister would be even more triggering that my parents. we both suffered from the same ED for quite a while. it was pretty hard to recover when a person i saw every day showed the very disordered habits i was trying to overcome. but then i realized that her eating habits, or anyone else's eating habits for that matter, didn't have to affect mine. maybe she would make her recovery later, but i wanted to make my recovery as soon as possible, since i had the knowledge and will to do so, and because i missed the life before ED so much. and maybe, after i make a successful recovery, i could be there for my sister when she makes her own recovery. there was no way that she would directly tell me to stop my recovery. because she too, deep inside, would know that her current habits are wrong, and that i was facing those fears and making a constant effort to get out of that dark hole. \n\nsee, what helped me most was belief in myself. don't let yourself be swayed by those around you. you're strong, you're in charge. you can, and you will.",
      "created_utc": 1622089103.0,
      "score": 3,
      "context": []
    },
    {
      "id": "gzla97g",
      "author": "Kore624",
      "body": "To be fair, large slurpees are fucking enormous. I wouldn’t let my child get a large either, even if they were skinny. \n\nGrowing up my parents were kind of the opposite. I was the underweight one and they would always give me extra sweets and it made me feel bad for my brother and sister. It didn’t make me gain weight either, it just made me eat unhealthy foods.\n\nI know it’s hard, but you can’t let how you interpret what others say influence your health. Your mom sounds like she’s more concerned about your *health* than your *weight*",
      "created_utc": 1622081913.0,
      "score": -12,
      "context": []
    },
    {
      "id": "gzl8lmp",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1622080986.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzn45if",
      "author": "ChubbyPupstar",
      "body": "Yes! Please tell them. If you can’t figure out how to,  talk to you pediatrician and have the Doctor help you start that conversation. There is a learning curve to understand eating disorders... you can’t start that process until you start it! Give it a chance to start. Give your parents time to begin that process. You need help and they will too. The upside is a normal healthy life, happiness, not having to struggle daily and hide things from those you love! It’s not an easy journey. It will have ups and downs, but it has to start somewhere! Please get help telling them! You are not alone! If communication with your parents is hard, give them time...eventually you will probably find that this will get way better than you might think it will. Remember ED is a disease and it’s one you are in together. It is the disease, not a blame game, though others actions and words can affect you. You need to be able to talk about it.",
      "created_utc": 1622126631.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzoktrn",
      "author": "Thattransguy123",
      "body": "My mother does pretty much the same thing. I’ve struggled with anorexia and bulimia for a few years. As well as body image issues. My mother always comments on my weight, what I eat, and how much I eat. She’s always directly and indirectly called me fat, and in ways she’s encouraged my ED. Dealing with parents like that is probably the worst thing in the world, and I’m sorry you have to deal with it. \n\nAs for the advice portion of this comment, have you tried journaling about it? Writing about how you’re feeling and how it affects you might help. Even if it’s just word vomit on the page, and it makes no sense, it helps to get it out. \nTalking to others is also a great way to deal with things like this, and my personal DMS are open if you ever need someone to talk to! \n\nI hope this helps at least a bit.",
      "created_utc": 1622149092.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzpg3yp",
      "author": "tchrgrl321",
      "body": "This is a great insight. My mom had no idea that what she said was hurtful to me and just needed it to be pointed out. My dad said kinda shitty things which idk how he didn’t know were hurtful, but it could’ve been how he was treated as a child or a ‘tough love’ approach. Sometimes it was ‘joking.’ But it really messed with me. One day I finally stood up for myself and said something to the effect of “please don’t comment on what I’m eating. You might think it’s helpful or funny but it’s actually hurtful and makes things worse.” He replied kind of jokingly, “people will always comment on what your eating wherever you are” to which I replied, “I disagree, and even if that were true, I’m asking you not to and you are now one person who is aware and can choose to respect it.” He has never commented about what I’m eating since then, and I’ve even eaten challenge foods/things he used to comment on with him. It was a spur of the moment comment on my part (fueled by knowledge I gained in treatment/therapy) but it was one of the best things I did. I did it in a calm, logical way and I think that did the trick. I didn’t go to treatment/say this until I was 27-28. If anyone else isn’t comfortable saying like this, please don’t feel like you have to. I just wanted to share this and how liberated I feel since. \n\nOP I hope that you are able to get the support you need and deserve 💕💕",
      "created_utc": 1622164608.0,
      "score": 2,
      "context": [
        {
          "id": "gzlc842",
          "author": "canadianworm",
          "body": "Ask for help or if your not comfortable with that seek help yourself. My mom had friends that were concerned about my anorexia but she always disagreed, now as an adult we’ve talked about and she’s apologized for not noticing and getting me help. Many parents aren’t aware of how there comments can affect there kids in a bad way, they just want the best (in most cases). Tell them your struggling, tell them straight up, with examples, that those comments make it really hard and ask for professional help",
          "created_utc": 1622082969.0
        }
      ]
    },
    {
      "id": "gzlwbge",
      "author": "iceover",
      "body": "Any decent person can stop making comments once being spoken to, your parents are just assholes",
      "created_utc": 1622096077.0,
      "score": 2,
      "context": [
        {
          "id": "gzlm8ow",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1622088890.0
        }
      ]
    },
    {
      "id": "gzm0dk5",
      "author": "A__6",
      "body": "thats not the point lmao op is asking for coping advice not health advice\n\n\"you can’t let how you interpret what others say influence your health\" so op (correctly) percieved what their parents said as negative feedback.. which under your logic would be good for them because large slurpee = bad?\n\nur lost bro",
      "created_utc": 1622099452.0,
      "score": 6,
      "context": [
        {
          "id": "gzla97g",
          "author": "Kore624",
          "body": "To be fair, large slurpees are fucking enormous. I wouldn’t let my child get a large either, even if they were skinny. \n\nGrowing up my parents were kind of the opposite. I was the underweight one and they would always give me extra sweets and it made me feel bad for my brother and sister. It didn’t make me gain weight either, it just made me eat unhealthy foods.\n\nI know it’s hard, but you can’t let how you interpret what others say influence your health. Your mom sounds like she’s more concerned about your *health* than your *weight*",
          "created_utc": 1622081913.0
        }
      ]
    },
    {
      "id": "gzpgj3n",
      "author": "tchrgrl321",
      "body": "Dick move buddy…smh",
      "created_utc": 1622164829.0,
      "score": 3,
      "context": [
        {
          "id": "gzla97g",
          "author": "Kore624",
          "body": "To be fair, large slurpees are fucking enormous. I wouldn’t let my child get a large either, even if they were skinny. \n\nGrowing up my parents were kind of the opposite. I was the underweight one and they would always give me extra sweets and it made me feel bad for my brother and sister. It didn’t make me gain weight either, it just made me eat unhealthy foods.\n\nI know it’s hard, but you can’t let how you interpret what others say influence your health. Your mom sounds like she’s more concerned about your *health* than your *weight*",
          "created_utc": 1622081913.0
        }
      ]
    },
    {
      "id": "gznl682",
      "author": "Kore624",
      "body": "*Cope* by understanding where your parents are coming from. They’re not calling you fat, they just don’t want you eating unhealthy things. Don’t take it as an insult.",
      "created_utc": 1622133911.0,
      "score": 0,
      "context": [
        {
          "id": "gzla97g",
          "author": "Kore624",
          "body": "To be fair, large slurpees are fucking enormous. I wouldn’t let my child get a large either, even if they were skinny. \n\nGrowing up my parents were kind of the opposite. I was the underweight one and they would always give me extra sweets and it made me feel bad for my brother and sister. It didn’t make me gain weight either, it just made me eat unhealthy foods.\n\nI know it’s hard, but you can’t let how you interpret what others say influence your health. Your mom sounds like she’s more concerned about your *health* than your *weight*",
          "created_utc": 1622081913.0
        },
        {
          "id": "gzm0dk5",
          "author": "A__6",
          "body": "thats not the point lmao op is asking for coping advice not health advice\n\n\"you can’t let how you interpret what others say influence your health\" so op (correctly) percieved what their parents said as negative feedback.. which under your logic would be good for them because large slurpee = bad?\n\nur lost bro",
          "created_utc": 1622099452.0
        }
      ]
    }
  ]
}