{
  "id": "nnk3qc",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1622281885.0,
  "title": "Request: My daughter won’t cut out her triggers. How can I encourage her to do so?",
  "selftext": "My (legal adult) daughter was diagnosed with anorexia four years ago. The severity of the illness and her weight have varied over the years, but it got especially problematic after the pandemic hit. She’s back in recovery, and actively weight-restoring, but it’s a slow progress. It doesn’t help that her room is filled with posters with model-thin women all over them. \n\nI really think her decor is hurting her self-esteem. Just last week, I went in her room and caught her eyeing a picture of her favourite singer, kneading her stomach. She seemed upset  that I caught her body checking, but then she just brushed it off as nothing with “I just think the lead singer is pretty.” I feel stuck because every time I’ve suggested taking down some of the posters, I’m met with intense opposition. She cries, she screams; it’s almost like she becomes a toddler that I feel compelled to comfort. I don’t want to hurt my daughter’s feelings, but I also don’t want her to hurt her own feelings by constantly looking at bodies she can never have. \n\nAm I overreacting? How should I proceed?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nnk3qc/request_my_daughter_wont_cut_out_her_triggers_how/",
  "score": 59,
  "num_comments": 17,
  "comments": [
    {
      "id": "gzuxv83",
      "author": "thedutchgirl13",
      "body": "I don’t think you’re overreacting, but I do think you’re going about it the wrong way. You can’t take anything down without her permission, it creates resentment and will probably amplify her stubbornness. The best thing you can do is talk to her about it calmly. If you feel like it makes her too emotional maybe you could type it out and send it to her. It’s important to support her and make it clear it’s coming from a place of love. Don’t make her feel forced to do anything. \n\nIt is hard to stop triggering yourself. It’s a very real part of the disorder. Personally even though I am weight restored I keep looking at pictures of very underweight people. I personally try to be realistic. Being that thin is unhealthy and not pretty. That still doesn’t take away from the fact I still wish I looked like that, as I never did it to be pretty. I try to look at people I find pretty at healthy weights. \n\nI am not sure what you can do except for talk to her. I really want to emphasize again, don’t do anything she didn’t agree to. You will only push her away and she’ll relapse quicker if she doesn’t feel supported. \n\nIt is better to support her and have those things stay up than taking them down but making her feel like you don’t understand.",
      "created_utc": 1622284603.0,
      "score": 31,
      "context": []
    },
    {
      "id": "gzvv8pi",
      "author": "Maggaggie",
      "body": "I’m sorry that she, and you as well, are going through this. It doesn’t sound like you’ve forced the issue, which I like. Some of the comments are suggesting taking down the posters anyway-the intent is good, but I worry because the loss of autonomy often pushes people deeper into eating disorder tendencies as it is partially a way to gain perceived control over your life.\nI really only can think that therapy for her, but also therapy for both of you together might be good if you can afford it. The both of you together so you can be on a healthy page about how to best communicate. Does her recovery include either of those?",
      "created_utc": 1622306003.0,
      "score": 9,
      "context": []
    },
    {
      "id": "gzw3k2i",
      "author": "ferretsonaplane",
      "body": "What kind of things is your daughter into? Does she like to travel? Is she pursuing a career with some really awesome female role models (that isn't focused around body image but accomplishments). \n\nI would suggest sitting her down and talking to her nonconfrontationally but matter of factly. Tell her you love her and you only want to help her, and you notice that the posters she looks at regularly could be more harmful than helpful. Suggest other things she likes. I love traveling, my parents commissioned someone to get the world map painted on my bedroom wall and I got to fill it in. Where I'm living now, I have some personal artworks hung up (they're horrible and no one else will ever see them, but I like them and it's a fun creative outlet) and my partner has some posters signed by his favorite youtubers hung up. Theres also a couple Canvas pictures of family etc. Strung around. Tapestries are also fun you can find some really cool ones on Amazon. See if she's willing to redecorate her room to reflect her future goals/interests that don't involve body image.",
      "created_utc": 1622310241.0,
      "score": 5,
      "context": []
    },
    {
      "id": "gzvsa0l",
      "author": "None",
      "body": "Instead of taking down the posters, why not show her what those singers actually look like? If you know anything about advertisements and how the entertainment industry works, you know that a lot of it is fake. It's not uncommon to airbrush people to make them skinnier, give them perfect skin, etc. \n\n(And there's more editing that goes into it, I'm just not that well versed in it to spell it out here.) She's internalizing this as her ideal, but her ideal is not only unrealistic for herself, it's also unachievable for the people in those posters. Good luck.",
      "created_utc": 1622304464.0,
      "score": 7,
      "context": []
    },
    {
      "id": "gzuvrsd",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1622282563.0,
      "score": 2,
      "context": []
    },
    {
      "id": "gzwpouf",
      "author": "CeramicHorses",
      "body": "Thats one sure fire way to get a child upset. How about instead of trying to change her thinking you listen to her. Like don't try to tell her why her thinking is wrong or why she is actually pretty. And follow the therapist's advice. I just think it's a strange tactic to freak out and change her life as more punishment instead of just asking why she feels the way she feels. And as someone who literally faints at the sight of her triggers I would be furious if one of my parents were  pushing me like this to remove them from my life. Skinny people don't disappear. Triggers don't disappear. So help her work through them instead of avoid them.\n\nEdit: missed the blaring *legal adult* part. What are you doing dude? She's an adult. You can't do anything about her space",
      "created_utc": 1622321429.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzxfuqe",
      "author": "MellieinOA",
      "body": "I joined OA and I learned that since I’m a chronic compulsive eater giving up and or fighting trigger foods didn’t work for me.  I had to find a recovered sponsor and work the steps. I also had to join CoDA because I always tried to force others to do things the way I thought they should. I had the best intentions but it really made people pull away from me. And when my mom tried to get involved I get angry and it pushed me back towards compulsive eating. I’m a recovered sponsor now and I am in a better place. Food doesn’t have to be more focus anymore. The freedom is amazing.",
      "created_utc": 1622336072.0,
      "score": 0,
      "context": []
    },
    {
      "id": "gzvcu47",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1622296018.0,
      "score": -5,
      "context": []
    },
    {
      "id": "gzuv40e",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1622281885.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzx7c6p",
      "author": "grumpylittleteapot",
      "body": "Is there any way the posters can be in the house and available,  but not necessarily where she sees them all the time? If they were smaller I'd say like a photo album. That way they'd be there for later, or as a crutch for her, but just not so present in her every day life? Like for me I have a hard time getting rid of my scale, but I'll put it where I have to dig it out instead of someplace that's easy to step on it every day. Baby steps",
      "created_utc": 1622331016.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzxjk0q",
      "author": "emmaabarness",
      "body": "it’s a really difficult thing to manage. Eating disorders are stubborn and challenging illnesses. Ultimately the want to make the changes is up to her and all you can do is gently encourage her. calmly sitting down with her snd evaluating what is and isnt helpful is a good first step. it will be challenging as a parent, just try to be there for her. explain why you’re making suggestions and do it as gently as possible xx",
      "created_utc": 1622338321.0,
      "score": 1,
      "context": []
    },
    {
      "id": "gzxqh6d",
      "author": "jeskimo",
      "body": "For a long time I kept an image of a deathly thin model as my phone screen. This was after a few years of steady recovery. It made me sick to look at it. Every once in a while I'd catch myself wanting to be it but quickly saw all the negative that image caused me.\n\nI don't know if it's the same in this case, grabbing at her stomach makes me say it's not. But in some situations it can help keep recovering. When you see the unhealthy and negative of an image and not a desire to become it.",
      "created_utc": 1622342526.0,
      "score": 2,
      "context": [
        {
          "id": "gzuxv83",
          "author": "thedutchgirl13",
          "body": "I don’t think you’re overreacting, but I do think you’re going about it the wrong way. You can’t take anything down without her permission, it creates resentment and will probably amplify her stubbornness. The best thing you can do is talk to her about it calmly. If you feel like it makes her too emotional maybe you could type it out and send it to her. It’s important to support her and make it clear it’s coming from a place of love. Don’t make her feel forced to do anything. \n\nIt is hard to stop triggering yourself. It’s a very real part of the disorder. Personally even though I am weight restored I keep looking at pictures of very underweight people. I personally try to be realistic. Being that thin is unhealthy and not pretty. That still doesn’t take away from the fact I still wish I looked like that, as I never did it to be pretty. I try to look at people I find pretty at healthy weights. \n\nI am not sure what you can do except for talk to her. I really want to emphasize again, don’t do anything she didn’t agree to. You will only push her away and she’ll relapse quicker if she doesn’t feel supported. \n\nIt is better to support her and have those things stay up than taking them down but making her feel like you don’t understand.",
          "created_utc": 1622284603.0
        }
      ]
    },
    {
      "id": "gzx3jah",
      "author": "ningyizhuo",
      "body": "I think the singer in question may be a Kpop idol though. I may be totally wrong but the fact that she said \"the lead singer\", that said singer is skinny, on posters and pretty makes me think it is...? Because if I'm right it may not help as Kpop idols are really skinny, most of them underweight. I remember years ago triggering myself with Yoona from SNSD, from the days where you could literally see her ribs. Now they're doing that with Lisa from Blackpink.. She can understand that they're editing their pictures so they can look perfect etc... but still believe that since said celebrity is an exception to the worldwide rule and is super skinny, then that's the proof she can do it too",
      "created_utc": 1622328822.0,
      "score": 2,
      "context": [
        {
          "id": "gzvsa0l",
          "author": "None",
          "body": "Instead of taking down the posters, why not show her what those singers actually look like? If you know anything about advertisements and how the entertainment industry works, you know that a lot of it is fake. It's not uncommon to airbrush people to make them skinnier, give them perfect skin, etc. \n\n(And there's more editing that goes into it, I'm just not that well versed in it to spell it out here.) She's internalizing this as her ideal, but her ideal is not only unrealistic for herself, it's also unachievable for the people in those posters. Good luck.",
          "created_utc": 1622304464.0
        }
      ]
    },
    {
      "id": "gzwgoty",
      "author": "None",
      "body": "That will do nothing but make her daughter resentful and push her away. She can bring this up in a more compassionate way with her daughter and try to create more dialogue. As someone with an ED whose mother frequently violated my privacy and would snoop and take things from my room, giving ultimatums and taking her stuff away will make the situation worse.",
      "created_utc": 1622316886.0,
      "score": 3,
      "context": [
        {
          "id": "gzuvrsd",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1622282563.0
        }
      ]
    },
    {
      "id": "gzwgy7x",
      "author": "None",
      "body": "Her daughter isn’t stupid. She’ll notice this. “Tough love” will do nothing but make her daughter feel more alienated and distrustful.",
      "created_utc": 1622317012.0,
      "score": 5,
      "context": [
        {
          "id": "gzvcu47",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1622296018.0
        }
      ]
    },
    {
      "id": "gzx4tv5",
      "author": "None",
      "body": "That's actually a very good point, and something I didn't think of at the time of posting this. Thanks. \n\nOP, if you see this comment thread, I would take this into consideration as well. Perhaps look into it first, and if you come to the conclusion showing the person as they actually are would be more harmful than helpful, perhaps some of the other suggestions in this thread would be helpful instead.",
      "created_utc": 1622329562.0,
      "score": 1,
      "context": [
        {
          "id": "gzvsa0l",
          "author": "None",
          "body": "Instead of taking down the posters, why not show her what those singers actually look like? If you know anything about advertisements and how the entertainment industry works, you know that a lot of it is fake. It's not uncommon to airbrush people to make them skinnier, give them perfect skin, etc. \n\n(And there's more editing that goes into it, I'm just not that well versed in it to spell it out here.) She's internalizing this as her ideal, but her ideal is not only unrealistic for herself, it's also unachievable for the people in those posters. Good luck.",
          "created_utc": 1622304464.0
        },
        {
          "id": "gzx3jah",
          "author": "ningyizhuo",
          "body": "I think the singer in question may be a Kpop idol though. I may be totally wrong but the fact that she said \"the lead singer\", that said singer is skinny, on posters and pretty makes me think it is...? Because if I'm right it may not help as Kpop idols are really skinny, most of them underweight. I remember years ago triggering myself with Yoona from SNSD, from the days where you could literally see her ribs. Now they're doing that with Lisa from Blackpink.. She can understand that they're editing their pictures so they can look perfect etc... but still believe that since said celebrity is an exception to the worldwide rule and is super skinny, then that's the proof she can do it too",
          "created_utc": 1622328822.0
        }
      ]
    },
    {
      "id": "gzwhc2t",
      "author": "hayleybts",
      "body": "Yes, say her and remove but not at once.\n Ofcourse she will notice.\nJust watch your daughter n do nothing isn't solution. I mean therapy is better option. Still something needs to done about the posters. Needs change",
      "created_utc": 1622317210.0,
      "score": -1,
      "context": [
        {
          "id": "gzvcu47",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1622296018.0
        },
        {
          "id": "gzwgy7x",
          "author": "None",
          "body": "Her daughter isn’t stupid. She’ll notice this. “Tough love” will do nothing but make her daughter feel more alienated and distrustful.",
          "created_utc": 1622317012.0
        }
      ]
    },
    {
      "id": "gzwkt4c",
      "author": "None",
      "body": "No one is saying do nothing about the posters. There are far better ways of going about this than just invading her privacy and taking her things. As someone whose mother use to do that to me, all it will do is make her daughter resentful, distrustful, and push her further into her ED to re-gain control. \n\nTherapy and creating open dialogue is the only thing that will fix this. Sure, you can take the triggering posters. But she can always just buy more, plus with ads, magazines, TV shows, movies, Instagram “influencer” culture, and just general pop culture is triggering for people with ED’s, there’s genuinely no escaping it. \n\nTaking the posters will just lead to sneakier forms of triggering because you can find it everywhere. It will be like playing an endless game of whack-a-mole, take one poster down and another 2 will go up, or she’ll just start using social media where her mom has even less control.",
      "created_utc": 1622318897.0,
      "score": 2,
      "context": [
        {
          "id": "gzvcu47",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1622296018.0
        },
        {
          "id": "gzwgy7x",
          "author": "None",
          "body": "Her daughter isn’t stupid. She’ll notice this. “Tough love” will do nothing but make her daughter feel more alienated and distrustful.",
          "created_utc": 1622317012.0
        },
        {
          "id": "gzwhc2t",
          "author": "hayleybts",
          "body": "Yes, say her and remove but not at once.\n Ofcourse she will notice.\nJust watch your daughter n do nothing isn't solution. I mean therapy is better option. Still something needs to done about the posters. Needs change",
          "created_utc": 1622317210.0
        }
      ]
    },
    {
      "id": "gzwmyfp",
      "author": "hayleybts",
      "body": "Sorry, I thought I read already in therapy. \nYeah,  then first they should try therapy. \nAlso listen to the daughter why it's happening in first place. Feel safe for daughter to talk about it. \nYep, I agree it's everywhere. Until you love yourself and realise 10-20 pounds doesn't define you. It's just created by society. As long as you stay fit in healthy way. Realising you will die, life's short. It's okay. Weight doesn't matter. That's just me. \n\nI'm an emotional eater, I recently recognised it. That's why looked up the sub. Then it hit me eating this chocolate will help me for what 3 mins at max? One day  at a time.",
      "created_utc": 1622320008.0,
      "score": 1,
      "context": [
        {
          "id": "gzvcu47",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1622296018.0
        },
        {
          "id": "gzwgy7x",
          "author": "None",
          "body": "Her daughter isn’t stupid. She’ll notice this. “Tough love” will do nothing but make her daughter feel more alienated and distrustful.",
          "created_utc": 1622317012.0
        },
        {
          "id": "gzwhc2t",
          "author": "hayleybts",
          "body": "Yes, say her and remove but not at once.\n Ofcourse she will notice.\nJust watch your daughter n do nothing isn't solution. I mean therapy is better option. Still something needs to done about the posters. Needs change",
          "created_utc": 1622317210.0
        },
        {
          "id": "gzwkt4c",
          "author": "None",
          "body": "No one is saying do nothing about the posters. There are far better ways of going about this than just invading her privacy and taking her things. As someone whose mother use to do that to me, all it will do is make her daughter resentful, distrustful, and push her further into her ED to re-gain control. \n\nTherapy and creating open dialogue is the only thing that will fix this. Sure, you can take the triggering posters. But she can always just buy more, plus with ads, magazines, TV shows, movies, Instagram “influencer” culture, and just general pop culture is triggering for people with ED’s, there’s genuinely no escaping it. \n\nTaking the posters will just lead to sneakier forms of triggering because you can find it everywhere. It will be like playing an endless game of whack-a-mole, take one poster down and another 2 will go up, or she’ll just start using social media where her mom has even less control.",
          "created_utc": 1622318897.0
        }
      ]
    }
  ]
}