{
  "id": "nqsusz",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1622659016.0,
  "title": "Request: Is full recovery possible or are you always in \"recovery\"",
  "selftext": "Once you develop an eating disorder, is it something that is always a part of you even after being recovered, like a lifelong battle till the day you die kinda thing. Or does it depend on how long you have had an eating disorder for, whether you've had it for months or for years.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nqsusz/request_is_full_recovery_possible_or_are_you/",
  "score": 48,
  "num_comments": 25,
  "comments": [
    {
      "id": "h0cfser",
      "author": "JupiterRocket",
      "body": "I suppose it depends on the person. For me, it’s a daily struggle, but definitely not as bad as it was when I was in the depths of my ED. Some days I’m good, and don’t even think about food (in a negative way). Other days, it’s a lot harder.",
      "created_utc": 1622659182.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h0cml6w",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1622662046.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h0ch97d",
      "author": "Cmh33190",
      "body": "Fifteen years later, I’m still on a “just for today” mindset. \n\nEating disorders are unlike others IMO…in the sense that if you’re an alcoholic or an addict, you abstain from drinking/drugs.\n\nYou can’t abstain from food.\n\nSo as people in recovery, we have to face our demons every meal time. It’s a tough process, but it is what it is. Stay strong.",
      "created_utc": 1622659795.0,
      "score": 36,
      "context": []
    },
    {
      "id": "h0cng9q",
      "author": "MoosieGoose",
      "body": "It seems to be different for everyone. I really struggle sometimes thinking \"I don't want to deal with this every day\". Been in recovery for about 6 years, struggled with ED for about 15 (including recovery time because it's not a said & done sort of thing)\n\nBut then I realize that the thoughts I deal with in recovery are so much more manageable than when I was sick. I can actually do things, and focus on things, which was completely impossible when I was sick.\n\nThere's a quote from Chris Farley that I always go back to. It's something like \"I eat because I hate myself, but I hate myself because I eat.\" Food issues are very hard to deal with, because like others have said, you can live without alcohol & drugs. Avoiding them may be very hard to do, but it's not a requirement to be alive. Food is required to be alive, and that means we have to face our demon multiple times a day, every day, forever.\n\nAt least know that you're not alone & that there are many people you can talk to if you need.",
      "created_utc": 1622662412.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h0cih4b",
      "author": "FoxiiFighter",
      "body": "I don't necessarily know that it's a journey with a final destination....I've always looked at recovery as a practice (like, piano or yoga) because you literally have to work on it every single day, and, you kind of always have to be prepared for it to come up.\n\nKind of like an alcoholic always has to be ready for the possibility of their recovery and addiction being challenged.",
      "created_utc": 1622660302.0,
      "score": 15,
      "context": []
    },
    {
      "id": "h0cp23c",
      "author": "dredged_dm",
      "body": "I can only speak from my personal experience. \n\nAfter realizing I have an ED I recall struggled to get to a healthy state. Now I do occasionally notice myself slipping when I'm stressed, but as long as I stay aware of my habits it's not too difficult to keep myself from relapsing. I wouldn't describe my experience as a \"lifelong battle\" but more something I will need to be vigilant for the rest of my life. \n\nI also feel like it gets easier with time to notice myself slipping and to get myself back on track after to do. \n\nAgain, that's been my experience and I know it's not the same for everyone.",
      "created_utc": 1622663086.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h0criat",
      "author": "bot_hair_aloon",
      "body": "I feel that most days Im good. If i get extremely stressed i can feel myself fall back into ED behaviours. If you think of it as a coping mechanism. Something youve pracised for so long, every day, all day. Its really hard to unlearn that.",
      "created_utc": 1622664091.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0ctvl1",
      "author": "mimosaholdtheoj",
      "body": "Definitely will always be “in recovery” since some days are better than others, but food is always on my mind. I’ve struggled with laxative abuse, mia, and ana since I was 8. I’m 28 now and still fall back every so often.",
      "created_utc": 1622665076.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0dc6tf",
      "author": "None",
      "body": "I believe full recovery is possible, I've met plenty of people who have fully recovered. After my first ED 'episode', I considered myself recovered for 5 years and even doubted whether I had an ED in the first place because food/body was totally not a thing for me anymore, I even volunteered at an ED helpline. But then I relapsed hard, probably because I became complacent and missed all the obvious warning signs. Again though I'm well into recovery and I only get fleeting ED thoughts. Research says it takes on average 6 years to recover fully. Google Millie Thomas ED - she had her ED for 15 years and doctors had given up on her and expected her to die. She's now an ED recovery coach and fully recovered.",
      "created_utc": 1622673143.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h0cvubf",
      "author": "None",
      "body": "Sometimes I forget. Mostly I have a messed up brain and I feel like I’ll never be happy again because I hate my body.",
      "created_utc": 1622665891.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0cfe4f",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1622659016.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0d8dkl",
      "author": "ferlozs",
      "body": "I must say that in my case, it never really leaves. There is always a little splinter or \"ruins\" from my eating disorder.\n\nI can live everyday eating like a normal person, but there's still a little thought in the back of my head. For me recovery is a long life thing, and even if it's hard - it really is worth it.",
      "created_utc": 1622671351.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0dn292",
      "author": "KryptonionNipple",
      "body": "I would say always in recovery. Especially in my case. I can be doing so well. And then bam, my ED demons come back and I lose 14kg in a short about of time. I'm at a middle weight now but always fluctuate between slightly underweight to middle. \n\nBut my carelessness for food is always there. I really don't care for it. If I didn't have my husband I doubt I would be healthy.",
      "created_utc": 1622678485.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0e76j1",
      "author": "Various-List",
      "body": "I’ve been in “full recovery”. I didn’t engage in any disordered behavior for ~10 years. I didn’t count or think about calories, and I felt fine with my body. I had bad body image days from time to time, for sure, but it didn’t control me. Full disclosure, I always continued to weigh myself a few times a week, but if I was gaining weight, I would just make a point to cut back on drinking/nights out for a little bit or snacks in my office and didn’t sweat it.\n\nUnfortunately a year ago, covid related issues created a level of stress (loss of childcare) that I couldn’t find a way to handle. My stress was unmanageable and there was no escape from the circumstances creating it. I’m sad to say but I consciously turned back to my eating disorder as a way to deal. I’m in a much better place right now but now struggling to kick the ED again, and living in the delusion that I can “recover” from the bad aspects but keep the good. 🤦‍♀️",
      "created_utc": 1622688526.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0ec4u1",
      "author": "SilentMellow",
      "body": "I had a eating disorder 10 years ago, and I wouldn’t eat because I was deeply afraid of throwing up. It turned into a vicious cycle because I wouldn’t eat and then I would feel sick because I was starving, but then I would eat and would think about “what if I get sick?” eventually it also turned into “will this make me fat?” Well now, I feel like I’ve grown up I was 11 10 years ago and I’ve definitely made progress and don’t worry so much about what I eat and illness, but I still am super cautious about my weight. I guess I’m lucky because I have just maintained my weight which is very average for my age and height, for the past few years. I’m like 95% recovered, but I don’t consider myself to have a eating disorder... hope that makes sense and wasn’t a ramble lol.",
      "created_utc": 1622691249.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0emn2h",
      "author": "grumpycatt4",
      "body": "i would say that full recovery is possible, but it’s entirely dependent on the individuals perspective on recovery and their own journey. for myself, i would say i’m always in recovery because there are days that the eating disorder voice comes creeping back in stronger than other days, and some days it’s not there at all. but that’s just how i personally view recovery. for someone else, they may consider themselves to be fully recovered because of physical health restoration and a majority of their days are ed-thought free. again, it is completely up to the individual in my opinion. just like there are bad days in life, there can be bad days in recovery, but that doesn’t mean that one bad day takes away all of your progress.",
      "created_utc": 1622697552.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0et7vg",
      "author": "None",
      "body": "After I first started having an eating disorder, few months in i had an epiphany of just how wrong what I'm doing is and sort of moved on and forgot about it. But after I relapsed, now I don't believe it will ever be the way it was before, I imagine i will always have to worry about food and think about what I eat and have some sort of rules/regiment so I don't fall if track",
      "created_utc": 1622702447.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0f3yd4",
      "author": "Phantomsgf",
      "body": "I think of it as an addiction. Some people manage to \"recover\" and never go back, because they work on themselves and find healthier ways to deal with their inner struggles and they now have a different mindset.\nSome others, we manage to \"recover\" but are left with a bad relationship with food all around and it turns into a daily struggle where you know what the healthy answer is, you know you shouldn't be doing those things and sometimes you fix it, but you still fall back into old habits when live gets too rough or when some event triggers you back to your old ways.\nAnd then there's some that just can't handle recovery, they can't ever imagine their lives without that \"drug\" that is their ED and they can't find alternative copping mechanisms, it's become part of their identity.\nIt really depends on the person, the environment they are in and your own will to have a healthier relationship with food and with yourself.",
      "created_utc": 1622711951.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0fh4co",
      "author": "yungdonbean",
      "body": "I honestly consider myself fully recovered. That is not to say that relapse is impossible, but it is to say that I consider myself to have a very healthy mindset when it comes to food and ED related things. Full recovery is definitely possible, but obviously it is not the same for everyone.",
      "created_utc": 1622721880.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0likuo",
      "author": "Woplin",
      "body": "Once your relationship with food becomes as messed up as it does during an ED, you never quite go back.",
      "created_utc": 1622831503.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0lqx8n",
      "author": "your_moms_a_spider",
      "body": "Had an ED for about 10 years. Went to rehab and therapy. It was a struggle for a few years after that but then I was ok for many years with only small relapses (couple months) here and there. Until 2 years ago I had a big relapse that has lasted until recently.  I am getting help again but now I know for me it a lifelong struggle and I have to be aware of it. I would say it doesn’t matter how long you’ve had an ED there is always the possibility to relapse. Keeping up with a therapist or groups help.",
      "created_utc": 1622835072.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3464h1",
      "author": "croquetas_queen",
      "body": "I was diagnosed when I was 15. It lasted a couple of months and it was on and off for a couple of years. Then, I would say that for 4 years I was ok. I did care about eating healthy but never obsessing about food or starving (like I could eat really bad and not to feel guilty). Though this last months (I am 26 now) with covid and other stuff I've been feeling really anxious and insecure and it's kind of getting back. It's definitely a coping mechanism that I feel it demands a lot of energy to fight. Last week I felt my ED was stronger than me but after thinking about it for days, I am sure I can get back to the state where I was okay. I just feel that it is never going to be off at 100% or healed. I feel it will always have a place in my brain and when I feel good, it is going to be in \"stand by\" and when I feel bad it will try to grow bigger.\nMaybe I way to see it is that there's always going to be something within you that challenges you and pushes you to be stronger and more compassionate towards your body and being everyday. I guess thinking this makes me feel better about the whole thing.\n Anyways, lots of strength to the people in this group.",
      "created_utc": 1624722045.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1m9jdg",
      "author": "kernal1337",
      "body": "Same boat, exact time lines. Just looked up this sub due to some triggers particularly after this second pregnancy. Hoping I can find some answers here.",
      "created_utc": 1623589374.0,
      "score": 2,
      "context": [
        {
          "id": "h0cml6w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1622662046.0
        }
      ]
    },
    {
      "id": "h0dd3ze",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1622673583.0,
      "score": 1,
      "context": [
        {
          "id": "h0cng9q",
          "author": "MoosieGoose",
          "body": "It seems to be different for everyone. I really struggle sometimes thinking \"I don't want to deal with this every day\". Been in recovery for about 6 years, struggled with ED for about 15 (including recovery time because it's not a said & done sort of thing)\n\nBut then I realize that the thoughts I deal with in recovery are so much more manageable than when I was sick. I can actually do things, and focus on things, which was completely impossible when I was sick.\n\nThere's a quote from Chris Farley that I always go back to. It's something like \"I eat because I hate myself, but I hate myself because I eat.\" Food issues are very hard to deal with, because like others have said, you can live without alcohol & drugs. Avoiding them may be very hard to do, but it's not a requirement to be alive. Food is required to be alive, and that means we have to face our demon multiple times a day, every day, forever.\n\nAt least know that you're not alone & that there are many people you can talk to if you need.",
          "created_utc": 1622662412.0
        }
      ]
    },
    {
      "id": "h0ddrw8",
      "author": "MoosieGoose",
      "body": "I can't seem to find it either, it was mentioned in an interview with someone close to him. I've tried searching & haven't found it",
      "created_utc": 1622673907.0,
      "score": 1,
      "context": [
        {
          "id": "h0cng9q",
          "author": "MoosieGoose",
          "body": "It seems to be different for everyone. I really struggle sometimes thinking \"I don't want to deal with this every day\". Been in recovery for about 6 years, struggled with ED for about 15 (including recovery time because it's not a said & done sort of thing)\n\nBut then I realize that the thoughts I deal with in recovery are so much more manageable than when I was sick. I can actually do things, and focus on things, which was completely impossible when I was sick.\n\nThere's a quote from Chris Farley that I always go back to. It's something like \"I eat because I hate myself, but I hate myself because I eat.\" Food issues are very hard to deal with, because like others have said, you can live without alcohol & drugs. Avoiding them may be very hard to do, but it's not a requirement to be alive. Food is required to be alive, and that means we have to face our demon multiple times a day, every day, forever.\n\nAt least know that you're not alone & that there are many people you can talk to if you need.",
          "created_utc": 1622662412.0
        },
        {
          "id": "h0dd3ze",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1622673583.0
        }
      ]
    }
  ]
}