{
  "id": "nr98ev",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1622712216.0,
  "title": "Request: I think my partner is relapsing but I’m unsure",
  "selftext": "He used to be anorexic until his family put him in rehab. This was like 5 years ago or something. I feel like he’s just moved to another form of the eating disorder. \n\nHe recently mentioned that he’s the lightest he’s been in a while. He works out for 2 hours a day - every day. He’s vegan but also refuses to eat sugar or any carbs. He does eat but it’s literally only fruits and vegetables, some vegan protein powder, and a bunch of supplemental pills. He’s gotten so bony. I’ve asked if he could consult a nutritionist but he said he doesn’t want to spend the money. He says he just wants to be in peak physical shape. If you think this sounds fine, I’ll believe you. If not, I feel like I need to do this gently because of his history. I’m worried about him. How can I do this the right way?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nr98ev/request_i_think_my_partner_is_relapsing_but_im/",
  "score": 43,
  "num_comments": 13,
  "comments": [
    {
      "id": "h0f9m9e",
      "author": "Allofthecaffeine",
      "body": "Yeah I’m sorry to say that sounds like a relapse to me. Having ‘safe’ and ‘unsafe’ foods, and over-exercising are both classic eating disorder symptoms. Having said that I find my eating disorder comes and goes in waves, particularly if I’m stressed out. What else is going on in his life? I think it’s important that you talk to him and see how he’s feeling about himself and how he’s thinking, I would avoid commenting on his actual weight though as this can often backfire and either make him think he’s doing the right thing or could make him not talk to you about it. I would just ask about his general well being and mental health and let him know you are always there for him. It’s such a hard conversation to have. I wish you both all the best",
      "created_utc": 1622716809.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h0fa9uh",
      "author": "None",
      "body": "It's not uncommon to \"recover\" from ana into orthorexia, you're right to be concerned",
      "created_utc": 1622717316.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h0fpghl",
      "author": "None",
      "body": "I would look up orthorexia. It is very common for people who have recovered from EDs to become orthorexic later on, because it is quite easy to disguise disordered eating behind the guise of \"health\". I have had many friends go down this road and edged on going down it myself. Wishing the best for you both <3",
      "created_utc": 1622726360.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h0faids",
      "author": "None",
      "body": "You’re 100% right to be concerned. He should\nProbably be in toxic with a therapist, not a nutritionist.",
      "created_utc": 1622717494.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h0h35kb",
      "author": "ginajadesmith",
      "body": "Sounds like a case of orthorexia, try and bring this up with him and talk about it. It will no doubt cause him distress, but it's best to take action now rather than when it's too late. You're right to worry, and it's good that he has got you to look out for him.",
      "created_utc": 1622747171.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h0f9xyf",
      "author": "Hoppinginpuddles",
      "body": "I think you know the answer already. Kia kaha.",
      "created_utc": 1622717063.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0fnth7",
      "author": "Boosey0910",
      "body": "It sounds like orthorexia",
      "created_utc": 1622725548.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0g918r",
      "author": "None",
      "body": "this just sounds like going from ana to ortho",
      "created_utc": 1622734701.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0f493t",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1622712216.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0iiwnc",
      "author": "extremecaffeination",
      "body": "It's not fine, he isn't eating enough food or enough variety of food to meet his nutritional needs. It's not your job to make him healthy, but a good step for him would be to start seeing a dietician trained in eating disorders regularly, a lot of insurance plans cover it.",
      "created_utc": 1622770784.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0fwomk",
      "author": "Fun-Plum-5351",
      "body": "His job is crazy stressful. He works like 80 hours a week. That’s probably pushing him over the edge. Thank you for your insight!",
      "created_utc": 1622729538.0,
      "score": 7,
      "context": [
        {
          "id": "h0f9m9e",
          "author": "Allofthecaffeine",
          "body": "Yeah I’m sorry to say that sounds like a relapse to me. Having ‘safe’ and ‘unsafe’ foods, and over-exercising are both classic eating disorder symptoms. Having said that I find my eating disorder comes and goes in waves, particularly if I’m stressed out. What else is going on in his life? I think it’s important that you talk to him and see how he’s feeling about himself and how he’s thinking, I would avoid commenting on his actual weight though as this can often backfire and either make him think he’s doing the right thing or could make him not talk to you about it. I would just ask about his general well being and mental health and let him know you are always there for him. It’s such a hard conversation to have. I wish you both all the best",
          "created_utc": 1622716809.0
        }
      ]
    },
    {
      "id": "h0gxu9r",
      "author": "MoosieGoose",
      "body": "This seems very common, especially in the past few decades. All the emphasis on clean eating can easily spark a disorder in someone, or be something to shift into that is more acceptable in society.\n\nEDs are often a control mechanism, so I'd talk to him about what's going on in his daily life. The working 80 hours a week would certainly do it.",
      "created_utc": 1622744945.0,
      "score": 5,
      "context": [
        {
          "id": "h0fa9uh",
          "author": "None",
          "body": "It's not uncommon to \"recover\" from ana into orthorexia, you're right to be concerned",
          "created_utc": 1622717316.0
        }
      ]
    },
    {
      "id": "h0h0eh9",
      "author": "lhanson_950",
      "body": "Exactly what I came to say",
      "created_utc": 1622746011.0,
      "score": 3,
      "context": [
        {
          "id": "h0fpghl",
          "author": "None",
          "body": "I would look up orthorexia. It is very common for people who have recovered from EDs to become orthorexic later on, because it is quite easy to disguise disordered eating behind the guise of \"health\". I have had many friends go down this road and edged on going down it myself. Wishing the best for you both <3",
          "created_utc": 1622726360.0
        }
      ]
    }
  ]
}