{
  "id": "ns1af0",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1622800149.0,
  "title": "Request: Wanted to share good news!",
  "selftext": " \n\ni thought i would share some good news!! so i had an eating disorder for a while and the lab we are doing in my biology class involves tracking what you eat for a day to calculate the energy intake and i told the teacher i had an ed a year ago and shes letting me skip that part of the lab :)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ns1af0/request_wanted_to_share_good_news/",
  "score": 74,
  "num_comments": 7,
  "comments": [
    {
      "id": "h0kfhen",
      "author": "Shindiee",
      "body": "i wish teachers were always that considerate with stuff like that :)",
      "created_utc": 1622814638.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h0l06ew",
      "author": "witpolis",
      "body": "That’s awesome! I had a similar class and my lab instructor didn’t care at all and just told me to use someone else to collect data. It sucked. But I’m glad you had a positive experience sharing that with your teacher!!",
      "created_utc": 1622823732.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h0k33qx",
      "author": "speckled113",
      "body": "That’s amazing! Good for you. I had to do a lot of those types of assignments in school and it was awful. It’s great you were able to advocate for yourself.",
      "created_utc": 1622808146.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0l384r",
      "author": "bleepityblurp",
      "body": "That's super awesome! I love when standing up for yourself pays off.",
      "created_utc": 1622825043.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h0jrvi8",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1622800149.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0m973z",
      "author": "Prestigious-Menu",
      "body": "My nutrition professor in college let me do a separate project instead of the food diary. He was very supportive!",
      "created_utc": 1622843294.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h0p695f",
      "author": "None",
      "body": "that's wonderful to hear!! it's super nice your teacher did that, good for you!",
      "created_utc": 1622909232.0,
      "score": 1,
      "context": []
    }
  ]
}