{
  "id": "nviars",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1623196683.0,
  "title": "Request: Trying to find advice for an ED I've never seen anyone have",
  "selftext": "So most of my life I've had an ED that was always just pushed off by my family as being stubborn.  I eat nothing but very basic foods and it takes a lot of courage and willpower to try anything new, and I almost always hate it.  Something about the textures of foods just disgust me and anything I don't know well just looks disgusting to me.  I was bribed with money and new video games growing up to try something as simple as an orange and refused.  I really just want to know if there's anyone else like me and if they've pushed through these barriers.  Thank you for taking the time to read my message.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nviars/request_trying_to_find_advice_for_an_ed_ive_never/",
  "score": 42,
  "num_comments": 12,
  "comments": [
    {
      "id": "h13d5jy",
      "author": "sharongrace_",
      "body": "This sounds a lot like ARFID (Avoidant/Restrictive food intake disorder)\nYou aren't alone, and there is definitely help out there for you. I'd recommend bringing it up with your GP or therapist if you have one, and they can maybe get you on the road to diagnosis and treatment. Good luck <3",
      "created_utc": 1623197318.0,
      "score": 54,
      "context": []
    },
    {
      "id": "h13fvpe",
      "author": "stumpyspice",
      "body": "Hi! \n\nYou’re not alone, I have this exact same disorder. It is ARFID. I have only just recently discovered the exact name for it myself, so I cannot say I have overcome massive barriers in this, but I am aware that people have done. Some people try their best to power through, which I can’t recommend - it’s important that you speak to a GP about this. They’ll be able to refer you to the relevant service for treatment, which could be CBT, exposure therapy or anti-anxiety meds - or a mixture of those treatments. \n\nIt’s definitely possible to overcome this, even slightly. I have had this disorder for 20 years and have only managed to incorporate a few food items/condiments into my regular diet without help, so hopefully I can progress more with professional help.\n\nI wish you luck on your journey and please remember that this is not your fault, it is not you being picky or stubborn.",
      "created_utc": 1623198693.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h13ep13",
      "author": "Captainbauman",
      "body": "I had this issue a while ago too when it suddenly dawned on me that my eating habits (or lack there of) and “picky eating” weren’t healthy. It’s certainly a journey to feel good around food, but please know that every step -whether it’s two steps forward and one step back, or even the smallest of baby steps and you feel like you’re making no progress- will start to pay off. Every arfid journey is different and I can’t tell you if the road ahead will be at all easy -it wasn’t for me, especially with coming to terms with having an ED, which I’m now very open about. I wish you the best of luck. You deserve to feel comfortable around food, which was the thought that got me through the tough days where I didn’t even want to enter the kitchen. You’ll be kicking those barriers down one day!",
      "created_utc": 1623198096.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h142ha6",
      "author": "sorcerers_apprentice",
      "body": "Check out /r/ARFID too--they may be able to offer some support for this specifically",
      "created_utc": 1623210465.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h13bvs0",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1623196683.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h13pfxy",
      "author": "HubbyHasBlueBalls",
      "body": "Yup. Absolutely sounds like ARFID.",
      "created_utc": 1623203604.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h13pz4f",
      "author": "None",
      "body": "I think that sounds like ARFID",
      "created_utc": 1623203864.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h143vvk",
      "author": "TheAshSystem",
      "body": "ARFID",
      "created_utc": 1623211277.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h159kue",
      "author": "Mrsakkooo217",
      "body": "I'm similar to you. by the sounds of it I eat more types of food then you but i'm extremely picky when it comes to looks too like other than cheeseburgers I never eat black colored meat even hamburger by itsself chopped up because of the way it looks",
      "created_utc": 1623242419.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h18c5ld",
      "author": "TheMelonSystem",
      "body": "Definitely sounds like either ARFID or some sort of sensory issue (like the kind autistics can get) with the way you’re describing texture bothering you.",
      "created_utc": 1623290553.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1cs69s",
      "author": "girlmeetsjoy",
      "body": "I have this too! You’re not alone. <3",
      "created_utc": 1623376832.0,
      "score": 1,
      "context": []
    }
  ]
}