{
  "id": "nxk279",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1623428952.0,
  "title": "Request: Feel unsafe in my bigger body",
  "selftext": " \n\nHi beautiful people! I'm a 21F looking for advice in a world that seems to have no answers. A little bit of background: I have struggled with disordered eating for a big chunk of my life but I have been committed to recovery for over 3 years now. I love the peace that recovery has brought, and I'm very scared of losing it. Nevertheless, I'm at my highest weight ever and while it doesn't necessarily bother me, all I can think of when I look in the mirror is of how my fat phobic friends and family perceive me. They make comments about how much better I looked before, and I feel the urge to go back to those behaviors just to be more visually pleasing. It might be all in my head, but I feel unsafe in this bigger body in some way. Does anyone have any thoughts or advice? Attempting \"healthy\" weight loss has never gone well for me, so intentional weightless is not an option, but I feel desperate to feel fully accepted in my community. Thank you so much in advance for reading, and for you moderators if you accept my post. I'm 100% pro recovery, I just feel a little lost.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nxk279/request_feel_unsafe_in_my_bigger_body/",
  "score": 50,
  "num_comments": 10,
  "comments": [
    {
      "id": "h1fc5rm",
      "author": "Appropriate-Gain2812",
      "body": "I'm in a similar situation. It takes time, and also, get clothes that fit you well! Think about showing your happiness through your posture and your smile, educate those who comment on your body about the seriousness of ED. Keep up all your excercise and your hobbies, live your life to the fullest, use all your energy on doing what makes you happy.\nI know it sounds a bit corny, but we gotta remember that fighting ED is exhausting, and every battle that we win, we have to manifest it into a happy future.",
      "created_utc": 1623432583.0,
      "score": 19,
      "context": []
    },
    {
      "id": "h1f865p",
      "author": "SilverBlaze234",
      "body": "Hi luv! Remember that your body is the LEAST I teething about you. You have a gorgeous personality and you are beautiful inside and out. You don’t need anyone in your life who will be judgy about your healthy body. And it’s probably not true. That is most likely just the ED wanting to come back but please kicking kicking ED’s Ass! You’re doing amazing!",
      "created_utc": 1623430846.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h1fhmyb",
      "author": "None",
      "body": "Jesus, I’m sorry you’re having to hear these kind of things from friends. Honestly, I think you should dump them. It’s completely inappropriate (and rude) for them to be commenting on your weight, whether positive or negative!\n\n(Please see my comment below, I apologize for using the term “should”, OP. This sort of story is particularly triggering for me. You know what is best for you, your health, and your wellness. Sending love.)",
      "created_utc": 1623434999.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h1giq59",
      "author": "DreyaNova",
      "body": "One of the things that really helped me out was starting weight training. Weight training requires lots of food intake to help build muscle, and I found it really liberating to see my body change and get stronger instead of just bigger or smaller. Not sure if that would help you too, but it’s a pretty fun hobby.\n\nNot a good path though if you get addicted to exercise.",
      "created_utc": 1623452259.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1f3rhm",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1623428952.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1gcnms",
      "author": "Dammit_Amber",
      "body": "Honey it sounds like you need new friends and to distance yourself from those family members who say things like that. I dont know you or your situation. But if they are giving you triggering thoughts then you need to take care of you. I'm at my biggest too. I've been atypical anorexic for about 10 years now. I bounce between relapse and recovery so much I feel ridiculous to even say I'm in recovery because, am I really? But let me tell you. Relapsing can happen so easily if you dont identify your triggers. And the older I get the harder each relapse is on my body. My last one left me feeling  so horrible.\n\n I don't know how long you have been ED but I can tell you that the body will only take so much. Its usually about the 10 year mark that one really starts to see the effects of ED. I dont say this to scare you but you dont want to be the 26 year old that gets out of bed in the morning and fractures her foot just from standing up because your bones have lost so much density that you now have osteoporosis.  From experience, it can happen. You're young and have a whole life ahead of you. Talk to someone, a professional who can help you identify and eliminate or avoid your triggers. It does help. You dont have to be bone thin to be sick enough for help. Do it because you're worth it. You deserve to be happy and healthy.",
      "created_utc": 1623449054.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1hlprt",
      "author": "joesprocket16",
      "body": "Please know you are good enough just the way you are. I feel like with ED  it’s so easy to constantly be engulfed in a cycle of shame, whether it’s your body, external forces, or a slip back into old habits. Regardless, please give yourself grace, love and patience.",
      "created_utc": 1623476462.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1hom6r",
      "author": "NutellaKiller",
      "body": "While I was recovering from anorexia and gained weight my mom said one day that I should start focusing on my appearance because I've gained enough now. It hurt. But after my body healed and it learned that it doesn't need to store every gram of carbs because I love me now and I'll always nurish myself properly my body turned into the best, most grateful machine. As for my mom, I don't think her intentions were bad, she was worried that gaining more weight would trigger me, but if you are expected to look a certain way to be accepted in you group of friends or family, it's really not okay. You are recovering from an eating disorder and it's hell of a fight and it requieres energy and strenght so they should be proud and make you feel good about yourself.",
      "created_utc": 1623478874.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1fvrop",
      "author": "bot_hair_aloon",
      "body": "Its totally inappropriate but it doesnt mean theyre bad people. They more than likely just dont know what theyre doing. Saying to dump them without anymore knowledge than what OP provided isnt that helpful imo. I totally agree that its awful and shouldnt be ok but maybe just saying it to them would stop them. Like 'hey i really dont like talking badly about bigger people, its kinda weird and makes me feel uncomfortable'.",
      "created_utc": 1623441232.0,
      "score": 2,
      "context": [
        {
          "id": "h1fhmyb",
          "author": "None",
          "body": "Jesus, I’m sorry you’re having to hear these kind of things from friends. Honestly, I think you should dump them. It’s completely inappropriate (and rude) for them to be commenting on your weight, whether positive or negative!\n\n(Please see my comment below, I apologize for using the term “should”, OP. This sort of story is particularly triggering for me. You know what is best for you, your health, and your wellness. Sending love.)",
          "created_utc": 1623434999.0
        }
      ]
    },
    {
      "id": "h1g21hg",
      "author": "None",
      "body": "I think it’s completely unacceptable and I couldn’t/wouldn’t put up with that behavior, personally. One shouldn’t have to explain why it’s inappropriate to be shamed for a change weight. While they might not be bad people, this is abusive behavior.\n\nETA I do apologize for saying OP “should” do something. They obviously have the autonomy to make their own decisions. As someone who has been shamed for their weight my entire 30 years of life, reading the post just brought up strong emotions. I DO strongly believe that nobody deserves to feel unsafe at the expense of any relationship. These feelings are not the fault of the OP, but the people insulting them.",
      "created_utc": 1623444008.0,
      "score": 4,
      "context": [
        {
          "id": "h1fhmyb",
          "author": "None",
          "body": "Jesus, I’m sorry you’re having to hear these kind of things from friends. Honestly, I think you should dump them. It’s completely inappropriate (and rude) for them to be commenting on your weight, whether positive or negative!\n\n(Please see my comment below, I apologize for using the term “should”, OP. This sort of story is particularly triggering for me. You know what is best for you, your health, and your wellness. Sending love.)",
          "created_utc": 1623434999.0
        },
        {
          "id": "h1fvrop",
          "author": "bot_hair_aloon",
          "body": "Its totally inappropriate but it doesnt mean theyre bad people. They more than likely just dont know what theyre doing. Saying to dump them without anymore knowledge than what OP provided isnt that helpful imo. I totally agree that its awful and shouldnt be ok but maybe just saying it to them would stop them. Like 'hey i really dont like talking badly about bigger people, its kinda weird and makes me feel uncomfortable'.",
          "created_utc": 1623441232.0
        }
      ]
    }
  ]
}