{
  "id": "nxk3x6",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1623429070.0,
  "title": "Request: How can I help my 13 year old daughter",
  "selftext": " \n\nI have recently found out that my daughter (13) has been avoiding eating, and purging if she does eat. Her mom and I have had a talk with her, and she seems like she wants to recover. We have already helped her find a therapist, and have her first appointment scheduled. I'm hoping to find information on how to make this as easy as possible on her. How could I cook for her? Should I push her to tell me what she wants from the grocery store, or just stock the house with food I know she likes? How can I keep up with what's going on with her without making it feel like I'm invading her privacy constantly? Are there any podcasts/reading/any other information for not only her, but her mom and I, too? I have already started listening to Food Psych, which has a lot of useful information. Thank you.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nxk3x6/request_how_can_i_help_my_13_year_old_daughter/",
  "score": 48,
  "num_comments": 29,
  "comments": [
    {
      "id": "h1f7hwo",
      "author": "SilverBlaze234",
      "body": "Hi! I’m thirteen and I’m in the same situation that your daughter is in. Please do stock the house with food that she likes and don’t comment about if she is eating. Even something like “you’re eating, I’m so proud of you!” Is well intentioned but it’s better to avoid it unless she wants you to. It’s a bit hard to have foods you enjoy with and ED but it’s nice if you ask her so that she knows she has the option. Also, NEVER comment on her body, your body, or someone else’s body or eating habits.",
      "created_utc": 1623430559.0,
      "score": 58,
      "context": []
    },
    {
      "id": "h1f6npy",
      "author": "Lostsoulx0x0",
      "body": "As someone who has suffered through this personally at the same age as your daughter, I highly highly recommend never mentioning her weight to her. That was the biggest thing that set me off. Let her know how beautiful and ‘healthy’ she’s looking never too skinny or fat. It’s a trigger. I would recommend stocking the fridge with food she likes as well as healthy snacks! She’ll be less likely to want to purge if she’s eating ‘low calorie’ healthy snacks. Hopefully this will encourage her to like eating again. When you see she’s getting comfortable with the thought of having a consistent eating habit she’ll hopefully start to lose the hate for food and this idea she needs to look a certain way. I hope this helps a little!",
      "created_utc": 1623430202.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h1f753x",
      "author": "None",
      "body": "Thanks for being a good parent and wanting to approach your daughter in the right way!! Seriously!\n\nFirst steps sound like they are done, though, and I'm glad you have her speaking to a professional.\n\nMy first piece of advice would be to just be really careful to not comment on her weight or body, or don't make comments about how much she is eating (if she's eating a normal amount of food or more than that!)\n\nAs to her food, I would do a mix of something healthy and nutritious that she also likes, and then keep her favorite snacks around. When I was in recovery, it did help in the beginning to eat meals that were healthy -- lots of vegetables and fruits and less cheese and oil (Those were my fear/trigger foods.) So if possible, find out if there is a certain food that your daughter actually fears eating. Don't force it, especially in the beginning. There is a time and place to start conquering your fear foods, but getting back to eating and not purging is the first and most important step. It's likely her therapist will help her introduce those foods (if she has any!) When she is ready.\n\nI would talk to her and see how she's feeling about the process. Everyone's recovery is different! Especially given the age, length, intensity, and etc. There isn't one right approach to it all! I would just focus on helping your daughter get and maintain a healthy relationship with food :)\n\n13 is a super rough age for a lot of girls tbh. Especially it they are starting to go through puberty or already have. If you haven't experienced having or living with a new teenage girl, well it can be very emotional and they can get very moody. It's a hard time for them, honestly! Especially at that age, some girls bodies are changing and some aren't ready yet. If she's starting to grow before a lot of her peers and friends or vice versa, I'm sure it's a stressful time for her and how her body looks and is changing. For me personally, hitting puberty was definitely a big mark in when I started caring about how other people saw me and my body.\n\nI obviously don't know you or your daughter, but I would look into if puberty could be (one of) the reason for these restrictions and purging, and maybe have her mom (I'm assuming you are dad, so forgive me if you are also mom, too!) or another trusted female adult talk to her about the fun puberty type stuff and changes in feelings and bodies and alllll that good stuff. It could quite possibly not be that, but she's in the perfect age range for it so just something to consider!\n\n&#x200B;\n\nEdit: So long story short: Be encouraging and patient. It could quite possibly be learning the weird balance of making sure she eats each day, but not forcing it at the same time. If she \"just cannot\" eat something at that moment, give her a half hour to cool off and do something else, then try again,",
      "created_utc": 1623430407.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h1ff239",
      "author": "writerkatescripps",
      "body": "Aroundthedinnertable.org is super helpful for parents",
      "created_utc": 1623433843.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h1f9hdo",
      "author": "None",
      "body": "My loved ones found [NEDA’s Parent Toolkit](https://www.nationaleatingdisorders.org/sites/default/files/nedaw18/1.%20ParentToolkit.pdf) to be very helpful for offering ways to support your child.  They have a few different [toolkits](https://www.nationaleatingdisorders.org/toolkits) in case that one doesn’t help.      \n\nAlso, [FBT](https://www.eatingdisordertherapyla.com/everything-you-need-to-know-about-family-based-treatment-fbt/) therapy might be very helpful as she is young.",
      "created_utc": 1623431416.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h1fkksp",
      "author": "wesjag0",
      "body": "I was in the same situation at 13. I'm 21 now and unfortunately I'm going back into the bad habits. Sounds like you're doing great! You're helping! Don't punish her for anything. My parents would take stuff away as if I wasn't punishing myself constantly. Don't get mad whatever you do please! Just encourage healthy eating habits, don't diet or talk about it around her, show her your healthy relationship with food. Luckily it sounds like you caught it early.",
      "created_utc": 1623436306.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1fuzo4",
      "author": "bluecloud306",
      "body": "The Emily Program helped my daughter.  They have 4 locations in mn, oh, pa, wa.  They offer both out patient amd residential treatment programs.  \nWe went through their out patient program as a family.  They offer a lot of parent support and help.\nTheir CBT program helped her to understand her feelings.\n\nA few things I learned:\n1. All food is good.  We do not judge food as good or bad.\n2. We do not count calories. \n3. Lots of other activities and distractions help too like doing a craft. My daughter learned to crochet.\n4. The original Paula deen cookbooks offer great tastey recipes. (Before she reduced the calories in her meals)\n5. It is a long road to recovery.",
      "created_utc": 1623440902.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h1f56fz",
      "author": "crazykooko23",
      "body": "I would first search for professional help. She needs to see someone who knows eating disorders how they work and all that jazz. It's good she expresses interest in wanting to recover but it's alot more than just eating.",
      "created_utc": 1623429571.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h1gi7jx",
      "author": "throwaway38473864",
      "body": "You are doing a good thing. Please don’t comment on her body whether it’s good or bad, either way it will encourage her to continue.",
      "created_utc": 1623451965.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1i7hsu",
      "author": "Maggiemaccy",
      "body": "My Dad would literally run and get me anything I mentioned I felt like eating and made such a huge effort to make eating enjoyable for me, he also sort of built little traditions around eating so I would look forward to it e.g. when I had a hard night of studying ahead he’d always bring my favourites, an aero and a Diet Coke, so through time I felt this positive association with those moments. That helped me a lot in the early days. \n\nJust important to remember that while my Dad made life easier for me, he couldn’t really help me out of that place or fix me. So as a parent now myself I see how heartbreaking that is. I had to go on my own journey over 10 years to get out the other side and the recovery was absolute hell, took so much grit but there’s no one in the world who could have done that for me.",
      "created_utc": 1623496630.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1f7r1f",
      "author": "luvvy123",
      "body": "Look into the Maudsley Approach based family treatment, specifically for children and adolescents. This has been researched and effective. Also, if you can, find an Ed specialist who treats adolescents.",
      "created_utc": 1623430668.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h1gytu9",
      "author": "throwaway-m1",
      "body": "1. Read Tabitha Farrar’s and Jenifer Gaudiani’s books (they also both have YouTube channels).\n\n2. Make sure there’s no negative body or food talk from anyone in the household. \n\n3. Find her a good dietitian - look for ones who say they are anti-diet/diet culture, and HAES. Not a nutritionist, bc they aren’t as qualified! The dietitian can help come up with a meal plan for her and tell you and your wife how to help keep her on track. \n\n4. Like others said, don’t bring up food unless she brings it up. If it does get brought up, only talk neutrally/positively about food and eating. Do stock the house with foods you know she likes. \n\n5. Look into FBT (family-based therapy!) it’s been proven to be highly effective for teens/kids with eating disorders.\n\nAlso, good on you for doing all of this. I can’t tell you how much I wish my parents took the action you and your wife are. It might’ve saved me from 8 years of eating disorder hell.",
      "created_utc": 1623461594.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1l0tly",
      "author": "AkaminaKishinena",
      "body": "Inform her pediatrician ASAP and ask for a referral to an eating disorder specialist-Family Based Therapy, FBT-is the treatment with the best evidence base-it works best the sooner a teenager starts. A good treatment team will have an experienced doctor, dietician and therapist. Again you want people who have dealt extensively with teens! I wish we hadn’t wasted our time with a dietician without the right expertise-there was no change or progress until we met with the eating disorders clinical staff. \n\nI found a lot of help from this [blog ](https://anorexiafamily.com/?v=7516fd43adaa), in fact I bought her book too. \n\nFEAST was linked somewhere else-that’s a great site too. \n\nAgain, my suggestion is to get her evaluated medically ASAP and start the process now to work with a team that does FBT-which is the standard, best treatment for adolescents. \n\nTake care.",
      "created_utc": 1623554057.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1sph8u",
      "author": "ZLCer",
      "body": "It's so great to know you're so involved with and concerned for your daughter! Thank you.\n\nHaving been the girl with eating disorders and now the person who loves helping parents navigate the waters, my #1 piece of advice from both sides of the coin is ask your daughter what works best for her. There's no way to know what will help her unless you ask the one who's needing the help.\n\n\\#1A piece of advice is always speak your truth with love and respect to your daughter. Tell her EVERYTHING about what you're experiencing, but do it using \"I\" statements: \"I love you so much, and I want to do everything I can to help. You know what though? I have no idea what I'm doing. Can we make a deal that we talk about this so we can work through it together? We might have to have some tough conversations, but I'm willing to stick it out because I don't want you to go through this feeling alone. We might get frustrated with each other along the way, but again, it's only because I want to understand and don't at the time. So I'll need you to help me and let me know when I've crossed the line or said something that I probably shouldn't have. I can't know what I don't know till I know it, so please help me know what I need to know, yeah?\"\n\nPlus there's no way to plan ahead for next month or next week for that matter. Your daughter will be a different person as she goes through recovery, and you'll get to be learning her all over again. The beauty is you'll get to spend time with, support, and encourage her authentic self, so you'll be doing some growing through this as well.\n\nNone of you will come out on the other side of this the same. That's why communication is NON-NEGOTIABLE. It's your superpower as well as your weapon of warfare. Over use it!",
      "created_utc": 1623718891.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1f419y",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1623429071.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1hmbhw",
      "author": "tymopa",
      "body": "Some people on here have great advice and some of these are very uneducated opinions. Check out NEDA's website. There are resources for all of you. This is a tough road but nipping this in the bud is essential. You are going to inevitably do something wrong because she's vulnerable but just keep chipping at it. Hopefully the therapist is over who deals with EDs. She's lucky to have you.",
      "created_utc": 1623476948.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1fcqpf",
      "author": "mniicolet",
      "body": "this! my parents didn’t understand how to support me at first and made a lot of similar “supportive” comments that ended up triggering me. they also hovered a lot and asked me lots of questions about food, and even though i knew they had good intentions, it activated my disordered mind. definitely keep educating yourself, understanding is an important step. getting foods she enjoys like you said is a great way to indirectly support her!",
      "created_utc": 1623432835.0,
      "score": 14,
      "context": [
        {
          "id": "h1f7hwo",
          "author": "SilverBlaze234",
          "body": "Hi! I’m thirteen and I’m in the same situation that your daughter is in. Please do stock the house with food that she likes and don’t comment about if she is eating. Even something like “you’re eating, I’m so proud of you!” Is well intentioned but it’s better to avoid it unless she wants you to. It’s a bit hard to have foods you enjoy with and ED but it’s nice if you ask her so that she knows she has the option. Also, NEVER comment on her body, your body, or someone else’s body or eating habits.",
          "created_utc": 1623430559.0
        }
      ]
    },
    {
      "id": "h1ffguj",
      "author": "RedVelvet1108",
      "body": "I honestly think stocking the house with her favorite foods is a huge invite to binge. I'm saying that because it would feel that way for 13yr old me. I'd rather say stock with healthy foods.",
      "created_utc": 1623434023.0,
      "score": 8,
      "context": [
        {
          "id": "h1f7hwo",
          "author": "SilverBlaze234",
          "body": "Hi! I’m thirteen and I’m in the same situation that your daughter is in. Please do stock the house with food that she likes and don’t comment about if she is eating. Even something like “you’re eating, I’m so proud of you!” Is well intentioned but it’s better to avoid it unless she wants you to. It’s a bit hard to have foods you enjoy with and ED but it’s nice if you ask her so that she knows she has the option. Also, NEVER comment on her body, your body, or someone else’s body or eating habits.",
          "created_utc": 1623430559.0
        }
      ]
    },
    {
      "id": "h1fkgov",
      "author": "None",
      "body": "I would gently add that \"healthy\" for some people can be perceived negatively, so maybe be a little careful in that regard.",
      "created_utc": 1623436256.0,
      "score": 13,
      "context": [
        {
          "id": "h1f6npy",
          "author": "Lostsoulx0x0",
          "body": "As someone who has suffered through this personally at the same age as your daughter, I highly highly recommend never mentioning her weight to her. That was the biggest thing that set me off. Let her know how beautiful and ‘healthy’ she’s looking never too skinny or fat. It’s a trigger. I would recommend stocking the fridge with food she likes as well as healthy snacks! She’ll be less likely to want to purge if she’s eating ‘low calorie’ healthy snacks. Hopefully this will encourage her to like eating again. When you see she’s getting comfortable with the thought of having a consistent eating habit she’ll hopefully start to lose the hate for food and this idea she needs to look a certain way. I hope this helps a little!",
          "created_utc": 1623430202.0
        }
      ]
    },
    {
      "id": "h1g98wv",
      "author": "squirrels-rule",
      "body": ">how beautiful and ‘healthy’ she’s looking\n\nI absolutely hated when people said I looked healthy. I had constructed these really insane standards for myself, and I thought that \"healthy\" by other people's standards really meant fat.",
      "created_utc": 1623447383.0,
      "score": 4,
      "context": [
        {
          "id": "h1f6npy",
          "author": "Lostsoulx0x0",
          "body": "As someone who has suffered through this personally at the same age as your daughter, I highly highly recommend never mentioning her weight to her. That was the biggest thing that set me off. Let her know how beautiful and ‘healthy’ she’s looking never too skinny or fat. It’s a trigger. I would recommend stocking the fridge with food she likes as well as healthy snacks! She’ll be less likely to want to purge if she’s eating ‘low calorie’ healthy snacks. Hopefully this will encourage her to like eating again. When you see she’s getting comfortable with the thought of having a consistent eating habit she’ll hopefully start to lose the hate for food and this idea she needs to look a certain way. I hope this helps a little!",
          "created_utc": 1623430202.0
        }
      ]
    },
    {
      "id": "h1f7tie",
      "author": "None",
      "body": "And also, if she's into or on social media, following accounts of people who have recovered from eating disorders and promote recovery was super helpful to me. (Be careful in this though, because there are many more accounts that encourage eating disorders/disordered eating!) I was also 19-22 when I was in the depths of my eating disorder and most of the accounts I followed seemed to be catered to more so those ages, I'm sure similar accounts for younger girls exist too!",
      "created_utc": 1623430696.0,
      "score": 5,
      "context": [
        {
          "id": "h1f753x",
          "author": "None",
          "body": "Thanks for being a good parent and wanting to approach your daughter in the right way!! Seriously!\n\nFirst steps sound like they are done, though, and I'm glad you have her speaking to a professional.\n\nMy first piece of advice would be to just be really careful to not comment on her weight or body, or don't make comments about how much she is eating (if she's eating a normal amount of food or more than that!)\n\nAs to her food, I would do a mix of something healthy and nutritious that she also likes, and then keep her favorite snacks around. When I was in recovery, it did help in the beginning to eat meals that were healthy -- lots of vegetables and fruits and less cheese and oil (Those were my fear/trigger foods.) So if possible, find out if there is a certain food that your daughter actually fears eating. Don't force it, especially in the beginning. There is a time and place to start conquering your fear foods, but getting back to eating and not purging is the first and most important step. It's likely her therapist will help her introduce those foods (if she has any!) When she is ready.\n\nI would talk to her and see how she's feeling about the process. Everyone's recovery is different! Especially given the age, length, intensity, and etc. There isn't one right approach to it all! I would just focus on helping your daughter get and maintain a healthy relationship with food :)\n\n13 is a super rough age for a lot of girls tbh. Especially it they are starting to go through puberty or already have. If you haven't experienced having or living with a new teenage girl, well it can be very emotional and they can get very moody. It's a hard time for them, honestly! Especially at that age, some girls bodies are changing and some aren't ready yet. If she's starting to grow before a lot of her peers and friends or vice versa, I'm sure it's a stressful time for her and how her body looks and is changing. For me personally, hitting puberty was definitely a big mark in when I started caring about how other people saw me and my body.\n\nI obviously don't know you or your daughter, but I would look into if puberty could be (one of) the reason for these restrictions and purging, and maybe have her mom (I'm assuming you are dad, so forgive me if you are also mom, too!) or another trusted female adult talk to her about the fun puberty type stuff and changes in feelings and bodies and alllll that good stuff. It could quite possibly not be that, but she's in the perfect age range for it so just something to consider!\n\n&#x200B;\n\nEdit: So long story short: Be encouraging and patient. It could quite possibly be learning the weird balance of making sure she eats each day, but not forcing it at the same time. If she \"just cannot\" eat something at that moment, give her a half hour to cool off and do something else, then try again,",
          "created_utc": 1623430407.0
        }
      ]
    },
    {
      "id": "h1h32nf",
      "author": "ChubbyPupstar",
      "body": "Getting professional help is REALLY hard! I have called several therapists multiple times but no return calls occur. 😞",
      "created_utc": 1623464047.0,
      "score": 1,
      "context": [
        {
          "id": "h1f56fz",
          "author": "crazykooko23",
          "body": "I would first search for professional help. She needs to see someone who knows eating disorders how they work and all that jazz. It's good she expresses interest in wanting to recover but it's alot more than just eating.",
          "created_utc": 1623429571.0
        }
      ]
    },
    {
      "id": "h1l12op",
      "author": "AkaminaKishinena",
      "body": "Yes! This is another name for FBT-which I mentioned in another post! Just posting so OP doesn’t feel overwhelmed with choices. The two best choices are the same thing.",
      "created_utc": 1623554199.0,
      "score": 1,
      "context": [
        {
          "id": "h1f7r1f",
          "author": "luvvy123",
          "body": "Look into the Maudsley Approach based family treatment, specifically for children and adolescents. This has been researched and effective. Also, if you can, find an Ed specialist who treats adolescents.",
          "created_utc": 1623430668.0
        }
      ]
    },
    {
      "id": "h1fg4ee",
      "author": "SilverBlaze234",
      "body": "That is a totally valid point and I agree! I definitely think having healthy food is important too, I’m just saying that having not necessarily healthy food should be an option if she wants it",
      "created_utc": 1623434319.0,
      "score": 7,
      "context": [
        {
          "id": "h1f7hwo",
          "author": "SilverBlaze234",
          "body": "Hi! I’m thirteen and I’m in the same situation that your daughter is in. Please do stock the house with food that she likes and don’t comment about if she is eating. Even something like “you’re eating, I’m so proud of you!” Is well intentioned but it’s better to avoid it unless she wants you to. It’s a bit hard to have foods you enjoy with and ED but it’s nice if you ask her so that she knows she has the option. Also, NEVER comment on her body, your body, or someone else’s body or eating habits.",
          "created_utc": 1623430559.0
        },
        {
          "id": "h1ffguj",
          "author": "RedVelvet1108",
          "body": "I honestly think stocking the house with her favorite foods is a huge invite to binge. I'm saying that because it would feel that way for 13yr old me. I'd rather say stock with healthy foods.",
          "created_utc": 1623434023.0
        }
      ]
    },
    {
      "id": "h1gi09c",
      "author": "Lostsoulx0x0",
      "body": "I can definitely see that! It’s definitely a very difficult and touchy subject. See growing up my parents always commented on how fat or skinny I looked. It carried over to when I got older (my sister struggled with an eating disorder too) and she was the one who started mentioning the word ‘healthy’ to me. I guess how I think of the word is that it means that there’s nothing wrong with the way I look, that healthy means whatever shape or size I am that it’s my natural body. I’m not starving myself or overeating but rather I’m taking care of my body and I guess that word just made sense to me",
      "created_utc": 1623451850.0,
      "score": 4,
      "context": [
        {
          "id": "h1f6npy",
          "author": "Lostsoulx0x0",
          "body": "As someone who has suffered through this personally at the same age as your daughter, I highly highly recommend never mentioning her weight to her. That was the biggest thing that set me off. Let her know how beautiful and ‘healthy’ she’s looking never too skinny or fat. It’s a trigger. I would recommend stocking the fridge with food she likes as well as healthy snacks! She’ll be less likely to want to purge if she’s eating ‘low calorie’ healthy snacks. Hopefully this will encourage her to like eating again. When you see she’s getting comfortable with the thought of having a consistent eating habit she’ll hopefully start to lose the hate for food and this idea she needs to look a certain way. I hope this helps a little!",
          "created_utc": 1623430202.0
        },
        {
          "id": "h1g98wv",
          "author": "squirrels-rule",
          "body": ">how beautiful and ‘healthy’ she’s looking\n\nI absolutely hated when people said I looked healthy. I had constructed these really insane standards for myself, and I thought that \"healthy\" by other people's standards really meant fat.",
          "created_utc": 1623447383.0
        }
      ]
    },
    {
      "id": "h1h3s3m",
      "author": "crazykooko23",
      "body": "Is she very underweight? Your local hospital may be able to help find her resources. When you starve and purge you're at high risk for low potassium levels and that can be very dangerous. I myself have OSFED where I restrict and purge and over exercise. I have been hospitalized before so be cautious.",
      "created_utc": 1623464458.0,
      "score": 1,
      "context": [
        {
          "id": "h1f56fz",
          "author": "crazykooko23",
          "body": "I would first search for professional help. She needs to see someone who knows eating disorders how they work and all that jazz. It's good she expresses interest in wanting to recover but it's alot more than just eating.",
          "created_utc": 1623429571.0
        },
        {
          "id": "h1h32nf",
          "author": "ChubbyPupstar",
          "body": "Getting professional help is REALLY hard! I have called several therapists multiple times but no return calls occur. 😞",
          "created_utc": 1623464047.0
        }
      ]
    },
    {
      "id": "h1h5lqd",
      "author": "ChubbyPupstar",
      "body": "We have been in the hospital twice since February and once in Residential for 7 weeks. The waitlists are excessively long. We are in a program and have a physician from an adolescent Ed program following. We are in limbo with possible further residential vs op vs php (not currently qualified for those).\nThank you for your support!!!",
      "created_utc": 1623465530.0,
      "score": 3,
      "context": [
        {
          "id": "h1f56fz",
          "author": "crazykooko23",
          "body": "I would first search for professional help. She needs to see someone who knows eating disorders how they work and all that jazz. It's good she expresses interest in wanting to recover but it's alot more than just eating.",
          "created_utc": 1623429571.0
        },
        {
          "id": "h1h32nf",
          "author": "ChubbyPupstar",
          "body": "Getting professional help is REALLY hard! I have called several therapists multiple times but no return calls occur. 😞",
          "created_utc": 1623464047.0
        },
        {
          "id": "h1h3s3m",
          "author": "crazykooko23",
          "body": "Is she very underweight? Your local hospital may be able to help find her resources. When you starve and purge you're at high risk for low potassium levels and that can be very dangerous. I myself have OSFED where I restrict and purge and over exercise. I have been hospitalized before so be cautious.",
          "created_utc": 1623464458.0
        }
      ]
    },
    {
      "id": "h1hfpvc",
      "author": "ChubbyPupstar",
      "body": "Yes, thank you. I she does, but I know it’s probably not enough for her needs yet",
      "created_utc": 1623472015.0,
      "score": 1,
      "context": [
        {
          "id": "h1f56fz",
          "author": "crazykooko23",
          "body": "I would first search for professional help. She needs to see someone who knows eating disorders how they work and all that jazz. It's good she expresses interest in wanting to recover but it's alot more than just eating.",
          "created_utc": 1623429571.0
        },
        {
          "id": "h1h32nf",
          "author": "ChubbyPupstar",
          "body": "Getting professional help is REALLY hard! I have called several therapists multiple times but no return calls occur. 😞",
          "created_utc": 1623464047.0
        },
        {
          "id": "h1h3s3m",
          "author": "crazykooko23",
          "body": "Is she very underweight? Your local hospital may be able to help find her resources. When you starve and purge you're at high risk for low potassium levels and that can be very dangerous. I myself have OSFED where I restrict and purge and over exercise. I have been hospitalized before so be cautious.",
          "created_utc": 1623464458.0
        }
      ]
    },
    {
      "id": "h1hb0wn",
      "author": "crazykooko23",
      "body": "Just wasn't sure if she had help thats all!",
      "created_utc": 1623468891.0,
      "score": 2,
      "context": [
        {
          "id": "h1f56fz",
          "author": "crazykooko23",
          "body": "I would first search for professional help. She needs to see someone who knows eating disorders how they work and all that jazz. It's good she expresses interest in wanting to recover but it's alot more than just eating.",
          "created_utc": 1623429571.0
        },
        {
          "id": "h1h32nf",
          "author": "ChubbyPupstar",
          "body": "Getting professional help is REALLY hard! I have called several therapists multiple times but no return calls occur. 😞",
          "created_utc": 1623464047.0
        },
        {
          "id": "h1h3s3m",
          "author": "crazykooko23",
          "body": "Is she very underweight? Your local hospital may be able to help find her resources. When you starve and purge you're at high risk for low potassium levels and that can be very dangerous. I myself have OSFED where I restrict and purge and over exercise. I have been hospitalized before so be cautious.",
          "created_utc": 1623464458.0
        },
        {
          "id": "h1h5lqd",
          "author": "ChubbyPupstar",
          "body": "We have been in the hospital twice since February and once in Residential for 7 weeks. The waitlists are excessively long. We are in a program and have a physician from an adolescent Ed program following. We are in limbo with possible further residential vs op vs php (not currently qualified for those).\nThank you for your support!!!",
          "created_utc": 1623465530.0
        }
      ]
    }
  ]
}