{
  "id": "nygstv",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1623532542.0,
  "title": "Request: Want to stop binge-purge cycle but afraid of gaining weight",
  "selftext": "So 1.5 years ago I was on the upper end of my BMI. I’d been trying to lose weight for a while but never had time to workout and I went out too often to have a clean diet. Quarantine however let me have the time to regularly exercise and diet which helped me to lose a good amount of weight in a few months. I didn’t realize then but realized later that I was restricting myself way too much and justifying it by saying “if you want results, you gotta work for it”. And I would binge a lot on cheat days. I later realized these are symptoms of bulimia. Earlier this year I started self-induced vomiting and that’s just made things worse. I decided to recover and so in April I stopped dieting and it was going great for 2 weeks until I took a photo w a friend on an occasion and then when I later saw it I felt like I looked fat (I probably didn’t). But that just made me go into a hate spree and I decided to diet again. And so the binge purge cycle started once again. But this is making me miserable, especially with added stress from college. I really don’t wanna be worrying about my body and food all the time. I know the right thing to do would be to stop dieting and start eating intuitively but I am so scared of gaining weight. I know I shouldn’t care about this but I do. Ever since losing weight I have been feeling a lot more confident, I can wear the clothes I want and I don’t feel as insecure. So if I gain weight I won’t feel this confidence anymore which is why I’m so scared of gaining weight.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/nygstv/request_want_to_stop_bingepurge_cycle_but_afraid/",
  "score": 40,
  "num_comments": 15,
  "comments": [
    {
      "id": "h1k05ya",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1623532543.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1lpvtk",
      "author": "Indy_Anna",
      "body": "Hey there. I just want to say I feel you. Here is something that has helped me. If you have Instagram, start following people with different body types, like moms who are post partum and \"larger\" people. I've started to notice that seeing normal bodies more often has shifted the way I look at my own body. I do less worrying about carrying some extra weight. I'm the heaviest I've been in my life, but am more secure in my body than I was when way thinner.",
      "created_utc": 1623573254.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1mo2e1",
      "author": "CreditAnxious",
      "body": "Hey girlie! I’m a fellow binge eater. Firstly, I feel you. I used to cut my meals down to one meal a day and when I checked how many calories I should consume (I’m short) to lose weight, it was 1200 a day. That’s child size portions. It’s not enough for a growing adult. I tried eating one meal a day so I would feel like I am eating enough for an adult bc I was consuming a 1000 calories in one sitting and fooling myself into thinking I ate enough. And horrible would be an understatement to describe such an experience. I was dizzy all the time, if I ate anything over a 1200 I looked bloated and gained weight and the cycle was awful. My body felt weak. I stopped going out with friends, my hair was falling out, I would only see my bf (now ex for obvious reasons) in the morning so I’d be at my ‘skinniest’ and never eat out with him and only go for drinks. Just writing this is bringing me pain. Then I found this YouTuber ‘abby’s kitchen’ and let me tell you, she absolutely changed my life. I’m still learning amd def not super healthy but she made everything better. She is a registered dietitian and she said, ‘don’t restrict food but try to make it balanced. If you’re eating cake, don’t just eat it but have something else. It’s all about balancing carbs, fat and protein so you can achieve satiety. And only 80% of your meals need to be ‘healthy’ which just means nourishing.’ Your healthy foods can be things you enjoy and trying funnel recipes. So I took a leap and started eating lunch and dinner. I eat salad for dinner and the meal my mom cooks which used be very carb heavy and I consumed a lot of it. For lunch, I also have a balance of protein carb and fat. I start my mornings off with firman b12 for energy and vitamin d bc ya girl is deficient. It honestly helps a lot and I see food as my fuel and something that is there to nourish me. I also go on daily walks for about 30-45 minutes after dinner to help with the digestion. So here’s my little start. I hope this helps and please go watch her videos,  and try not to listen to the toxic diet culture. I wish you the best and I know you got this! Text me at any time if you want to talk about it (:",
      "created_utc": 1623597562.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1n0op0",
      "author": "una_verdadera_lata",
      "body": "I would highly encourage seeing a dietician who specializes in eating disorders. I think IE is a good goal but also not super realistic right off the bat in early recovery. Good luck <3",
      "created_utc": 1623603881.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1k1fmp",
      "author": "flowerslikesunnydays",
      "body": "i’m literally in the same exact situation rn and it’s so exhausting :( i just wish i could be like one of those people who have literally never thought twice before eating :/ maybe you could try replacing the purging with exercise? you would be able to eat a normal amount of food and it’d help you get your metabolism and stuff :) and if you ever eat more than you wanted to or something, you won’t have to worry about gaining bc your body will balance itself out :)",
      "created_utc": 1623533237.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1l9q7u",
      "author": "Gambarize",
      "body": "Try setting small goals and acheiving them. One day of less restricted eating at a time. Allowing yourself to eat absolutely anything you want cold turkey may not be the best option. Try easing into it, slowly increasing your variety and portions to a level where you dont feel hungry all the time.\n\n\nMaybe try getting clothes that fit you, or will fit you, so you dont have that nawing at you each day?\n\n\nIve went through seeing myself in photos and thinking i look fat during the first year of my recovery, it gets better. Now i look back on those photos and theres absolutely no way i could call myself fat in them.\n\n\nOf course getting a professional to help you is probably the best course of action.",
      "created_utc": 1623559661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1kdcvr",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1623539870.0,
      "score": -2,
      "context": []
    },
    {
      "id": "h1mtu7i",
      "author": "None",
      "body": "I wish I knew how to stop too, at the age of 42, 32 years after I started and after visiting all sorts of psychiatrists and psychologists and being on all sorts of meds, I still haven't found a solution. It's a daily hell.",
      "created_utc": 1623600499.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1k3zen",
      "author": "GuessIllGoFuckMyself",
      "body": "I struggle similarly. The fact is while recovering you may gain some. You can’t purge when you have poor impulse control so you have to deal with the consequences (gaining). Reframing the gaining as consequence made me realize I need to fix my relationship with food. I tend to binge when I’m stressed or anxious and have nothing else to do. When I stay busy I’m wayyyy less likely to binge and can maintain a weight rather than gaining. Figure out your brain hack. What makes you purge? Stress? Certain food? Boredom?",
      "created_utc": 1623534611.0,
      "score": 3,
      "context": [
        {
          "id": "h1k05ya",
          "author": "AutoModerator",
          "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
          "created_utc": 1623532543.0
        }
      ]
    },
    {
      "id": "h1k6fot",
      "author": "lipsofevil",
      "body": "Be careful, there is a BN subtype called “exercise bulimia” and it’s pretty dangerous too.",
      "created_utc": 1623535938.0,
      "score": 9,
      "context": [
        {
          "id": "h1k1fmp",
          "author": "flowerslikesunnydays",
          "body": "i’m literally in the same exact situation rn and it’s so exhausting :( i just wish i could be like one of those people who have literally never thought twice before eating :/ maybe you could try replacing the purging with exercise? you would be able to eat a normal amount of food and it’d help you get your metabolism and stuff :) and if you ever eat more than you wanted to or something, you won’t have to worry about gaining bc your body will balance itself out :)",
          "created_utc": 1623533237.0
        }
      ]
    },
    {
      "id": "h1l86gj",
      "author": "Gambarize",
      "body": "Don't go giving advice for losing weight like this here. It would be best if this was deleted.",
      "created_utc": 1623558611.0,
      "score": 2,
      "context": [
        {
          "id": "h1kdcvr",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623539870.0
        }
      ]
    },
    {
      "id": "h1k6kno",
      "author": "flowerslikesunnydays",
      "body": "yeah i’ve heard of it :( i just thought it could maybe help op, i’m sorry if it sounded triggering or anything:(",
      "created_utc": 1623536012.0,
      "score": 2,
      "context": [
        {
          "id": "h1k1fmp",
          "author": "flowerslikesunnydays",
          "body": "i’m literally in the same exact situation rn and it’s so exhausting :( i just wish i could be like one of those people who have literally never thought twice before eating :/ maybe you could try replacing the purging with exercise? you would be able to eat a normal amount of food and it’d help you get your metabolism and stuff :) and if you ever eat more than you wanted to or something, you won’t have to worry about gaining bc your body will balance itself out :)",
          "created_utc": 1623533237.0
        },
        {
          "id": "h1k6fot",
          "author": "lipsofevil",
          "body": "Be careful, there is a BN subtype called “exercise bulimia” and it’s pretty dangerous too.",
          "created_utc": 1623535938.0
        }
      ]
    },
    {
      "id": "h1lekjm",
      "author": "RickC-666",
      "body": "oou sorry :<",
      "created_utc": 1623563201.0,
      "score": 1,
      "context": [
        {
          "id": "h1kdcvr",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1623539870.0
        },
        {
          "id": "h1l86gj",
          "author": "Gambarize",
          "body": "Don't go giving advice for losing weight like this here. It would be best if this was deleted.",
          "created_utc": 1623558611.0
        }
      ]
    },
    {
      "id": "h1k6rx7",
      "author": "lipsofevil",
      "body": "don’t worry, I didn’t want to sound rude :( I think the best thing OP can do is go to therapy if they can afford it… eating disorders only get worse with time",
      "created_utc": 1623536122.0,
      "score": 1,
      "context": [
        {
          "id": "h1k1fmp",
          "author": "flowerslikesunnydays",
          "body": "i’m literally in the same exact situation rn and it’s so exhausting :( i just wish i could be like one of those people who have literally never thought twice before eating :/ maybe you could try replacing the purging with exercise? you would be able to eat a normal amount of food and it’d help you get your metabolism and stuff :) and if you ever eat more than you wanted to or something, you won’t have to worry about gaining bc your body will balance itself out :)",
          "created_utc": 1623533237.0
        },
        {
          "id": "h1k6fot",
          "author": "lipsofevil",
          "body": "Be careful, there is a BN subtype called “exercise bulimia” and it’s pretty dangerous too.",
          "created_utc": 1623535938.0
        },
        {
          "id": "h1k6kno",
          "author": "flowerslikesunnydays",
          "body": "yeah i’ve heard of it :( i just thought it could maybe help op, i’m sorry if it sounded triggering or anything:(",
          "created_utc": 1623536012.0
        }
      ]
    },
    {
      "id": "h1k6yg5",
      "author": "flowerslikesunnydays",
      "body": "yeah, i definetely agree with that, also u didn’t sound rude dw!!!!",
      "created_utc": 1623536220.0,
      "score": 0,
      "context": [
        {
          "id": "h1k1fmp",
          "author": "flowerslikesunnydays",
          "body": "i’m literally in the same exact situation rn and it’s so exhausting :( i just wish i could be like one of those people who have literally never thought twice before eating :/ maybe you could try replacing the purging with exercise? you would be able to eat a normal amount of food and it’d help you get your metabolism and stuff :) and if you ever eat more than you wanted to or something, you won’t have to worry about gaining bc your body will balance itself out :)",
          "created_utc": 1623533237.0
        },
        {
          "id": "h1k6fot",
          "author": "lipsofevil",
          "body": "Be careful, there is a BN subtype called “exercise bulimia” and it’s pretty dangerous too.",
          "created_utc": 1623535938.0
        },
        {
          "id": "h1k6kno",
          "author": "flowerslikesunnydays",
          "body": "yeah i’ve heard of it :( i just thought it could maybe help op, i’m sorry if it sounded triggering or anything:(",
          "created_utc": 1623536012.0
        },
        {
          "id": "h1k6rx7",
          "author": "lipsofevil",
          "body": "don’t worry, I didn’t want to sound rude :( I think the best thing OP can do is go to therapy if they can afford it… eating disorders only get worse with time",
          "created_utc": 1623536122.0
        }
      ]
    }
  ]
}