{
  "id": "o0asrv",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1623751618.0,
  "title": "Request: How to be on a diet without triggering ED habits?",
  "selftext": "I'm currently classed as obese and am actively losing weight on the keto diet (I have PCOS & this seemed my best chance). I'm losing better than I did when attempting to restrict (which would lead to a binge and eventually giving up because why bother all this suffering for no reason?) I'm trying to be grateful & accept that this is good enough. But then the thoughts of \"you're not losing enough/fast enough/there's more you can do\" creep in. \n\nI'm getting married this year and want to not feel like a whale in my pictures, so this is my biggest motivation. My estimated end date is a couple months after my wedding, and idk how to feel about that. Like, at least I'll be at least closer to a healthy weight than I am now, but I'm also struggling with not trying to lose faster.\n\nI've been doing this for a bit over month, and I feel myself slowly slipping back into obsession over numbers. I'm weighing myself multiple times a day, even though I **KNOW** anything beyond the morning doesn't even count. I try to stay close to my macros, but I won't lie and say I don't get a thrill when MFP gives me the warning of not eating enough.\n\nI just want to be a healthy weight & happy with my body for once in my life. I'm just starting to struggle with not going back down a dark road. I'm scared to end up developing a full blown ED, where before it was more on/off tendencies leaning more to BED. I can't stay overweight if I ever want a chance of getting pregnant naturally",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/o0asrv/request_how_to_be_on_a_diet_without_triggering_ed/",
  "score": 44,
  "num_comments": 20,
  "comments": [
    {
      "id": "h1uo67s",
      "author": "CheekyMolasses",
      "body": "Heya, obese gal who's battled bulimia and binge eating disorder for the past 15 years here. Honest answer is that you can't - any diet that requires you to cut out foods, count calories or do ANYTHING that was part of your ED is basically out of bounds. \n\nI too have PCOS and I know this makes weight even more difficult  because it often feels out of our control - gaining is super easy but losing is 200x  harder. But I think accepting that is a very key part to not letting yourself fall down that hole again; improve your lifestyle and diet for your health, not for the number on the scale, because the number on the scale is not wholly in your control. Being overweight might make getting pregnant harder but being malnourished does too, so try to remove that argument from your mind. Being fat truly is not the worst thing you can be. \n\nNourish yourself mentally and physically, move your body without the sole purpose being punishment and please please please try to move away from tracking what you're eating. What you eat day to day should not take up space in your head, let alone your phone. You deserve to eat.",
      "created_utc": 1623767476.0,
      "score": 23,
      "context": []
    },
    {
      "id": "h1un05m",
      "author": "FoxiiFighter",
      "body": "As someone who has been embarking on this very journey (a recovered anorexic, trying to lose about 20lbs of fat as determined by a dexa scan), you really need to do this with a professional - maybe even two - a therapist as well as an RD.\r  \n\r  \nI started back in January on my own, and it's a daily battle. As of right now, I've maintained my weight because of how the restricting (and subsequent binging) has come into play, and I have to pull myself out of a deficit and eat at maintenance to get my brain back in check. My biggest trigger right now is when the scale DOES go down, it drives my restricting urge. I cannot afford a dietician or a therapist at this point, so I am going to keep trying, but this is not a journey I would ever recommend someone in our shoes go on their own.\n\nIf you truly are above a healthy weight (and not just targeting a specific BMI or size for a wedding dress), following good, basic health principles SHOULD see your body balancing out to where it needs to be. You could work with an RD that's familiar with gentle nutrition as well as Intuitive Eating to help you find a safe way to reach a healthy weight goal. NOTE: The idea of IE and intentional weight loss are often counterproductive, but it is still 100% possible to eat towards a specific goal while honoring your body's hunger cues. It's a delicate art form. \n\nAsk yourself this: What if you could achieve your aesthetic goals and \"be happy\" with your body, but the number on the scale never changed? Is it really your appearance? Or are you chasing a number and what you think it looks like? These are all things I think you really should look at and work through. I used to think that the aesthetic I wanted meant a certain weight --- come to find out, several of my favorite influencers who all have the same shape I want...have a 30-50lb difference in their weight due to muscle mass and composition. Sometimes the \"goal\" we set for ourselves doesn't align with the reality of what will actually make us happy --- that's why so many people hit that \"goal\" and aren't happy because they thought they should look like something different at this goal weight. So I think you need to re-evaluate what \"happy with my body\" actually means to you -- because I doubt a number on the scale will fix that. \n\nTL;DR - If you're going to do this, get a therapist and an RD to help you control the ED behaviors and help you achieve results healthfully. Also bear in mind that the aesthetic you want may not match the weight goal you're setting for yourself.",
      "created_utc": 1623766933.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h1uu6zx",
      "author": "Urbanlotus21",
      "body": "Please get rid of the scale that thing is evil and will drive you crazy and incorporate exercise into your day.for me when I have tried to diet I always fall back into my Ed. With a wedding next year coupled with increased health problems from being overweight I needed to drop weight in  a healthy manner without falling into old habits. I had been eyeing the Katyhern fitness challenge for awhile and took the plunge and coughed up $200 and started my first coached challenge in October.I don’t have a scale at home I only weigh myself once a week at the super market for the check in. I find myself feeling more motivated and satisfied with my body because of the exercise. The scale hasn’t moved much honestly but I’m seeing physical changes from week to week which helps curve my desire to restrict. Added plus has been my doctor said I no longer fall into the obesity category my bp is down and I’ve been able to decrease the amount of insulin I use (t1 diabetic) because of the exercise.",
      "created_utc": 1623770201.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h1v9sf9",
      "author": "None",
      "body": "Hi, I would work closely with a professional who understands eating disorders, honestly, and wouldn't attempt this on your own.",
      "created_utc": 1623776950.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h1y24vi",
      "author": "Icy_Ad_8802",
      "body": "Hi there. The honest answer is: it’s not possible. I’m not saying losing weight is bad but the reasons behind it always determine the process and the outcome.\n\nRestrictive diets are not sustainable in the long term, even more without falling into ED habits. You’re thinking about food all the time, trying to control every aspect of it and the logic “reward” would be to see the numbers down in the scale. But those numbers are always changing based on a gazillion things and will never be consistent with your restrictive dieting.\n\nIf this is the way you’re feeling after one month, imagine after 4 or 5 once the honeymoon period is over and the reality of diets shows.\n\nRegarding the pregnancy and other health issues, yes, that might require addressing to certain diet modifications or activity levels, but it won’t be solved only by “not being overweight”, there’s so much more than that.\n\nAs a fat woman with PCOS, I’d say you need to ditch the scale and address the issue with medical professionals: gynaecologist, nutritionist and maybe a psychologist as well.",
      "created_utc": 1623830424.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h1tz67s",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1623751618.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1xjj40",
      "author": "pussyforpresident",
      "body": "You’re going to maybe hear a lot of rhetoric about how diets don’t work/are unhealthy/etc. \n\nHere’s the thing: …Everyone’s on a diet. Everything you eat is a diet. It should’ve never been used as a catch all to explain “a plan to eat to lose weight.” Diet is not a bad word, it’s just what we put in our bodies day to day. \n\nI do have a bit of a bone to pick with keto; As a recovered anorexic and someone in nutrition, it can often do more harm than good. People replace milk in their lattes with heavy whipping cream (AHHH) and lots of other things. It’s bad for your heart in the long run, and you’ll want something more sustainable that makes you feel good! Keto is great short term but will make you feel a bit shit long term, and their rules don’t often guarantee weight loss, but can guarantee weight gain/fluid retention/etc etc. \n\nI’d reach out to your gynecologist and explain your situation, or even a registered dietician. I have needed supervision when I’ve needed to log my food, as it can go wrong very fast. But just because I can respond poorly to it doesn’t make it bad. Eventually I’m hoping it won’t be such an Everest. \n\nIt’s all about burning more than you take in, at the end of the day, and that can be hard to guarantee without logging. You really don’t even have to have too much of a deficit — it is *okay* to be on a restrictive diet, as long as it is healthy and not too restrictive. Calories in/calories out is a pretty good choice, as you restrict nothing except a few hundred calories at best. It gets dangerous when you restrict too many. \n\nThe thing is, non-restrictive CICO diets are either maintenance diets (harder than losing weight, IMO!) or diets in excess of calories burned. Think less “restrict” and more “slight deficit.”\n\nAlso I’d encourage you to have your blood work looked at as well, the gyno may agree! If there are thyroid issues they can be addressed with medication and cause less discouragement/more solutions. \n\nAnd I am sure you don’t look like a whale at all, btw!",
      "created_utc": 1623816131.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1vueem",
      "author": "momunist",
      "body": "There are ways to manage your health without dieting. There isn’t a way to diet or intentionally lose weight that isn’t triggering to eating disorders. But the good news is that there is a lot you can do for your health besides just trying to lose weight. Getting plenty of vegetables, pairing carbs with protein and fiber, drinking more water, getting better sleep, and finding movement you enjoy— all of these things might help you to lose weight or might not, but they will all be beneficial to your health regardless. If you’re on Instagram, there are some weight-neutral PCOS dietitians who also offer amazing advice, and there’s at least one good Facebook group for diet-free help for insulin issues.",
      "created_utc": 1623785750.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1xheno",
      "author": "mandy_miss",
      "body": "I take vyvanse for ADD and for bulimia. I highly suggest it for managing binging. I eat breakfast, take pill, then eat again at dinner. And i’m good.",
      "created_utc": 1623814870.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1y44mr",
      "author": "JefferyJeffJefferson",
      "body": "Hello, I'm only speaking from my experience, and these are my opinions. I was a fat kid, then a severely underweight teenager, and now I'm a at a healthy weight.\n\nThe best thing you can do when you're dieting is to eat food that is satiating, delicious, low in calories, and high in protein, (like idk spinach), and exercise. The reason you're falling back into bad eating habits might be because you're not enjoying your diet. Your diet shouldn't feel like you're dieting at all! Just eat healthy and you will reach your goals!\n\nIf you don't enjoy your diet, it isn't sustainable long term.\n\nDon't put a deadline to your diet and think \"oh I need to loose this much weight before \\*insert event here\\*\". \n\nBeing fit and healthy is a lifestyle, and it is an enjoyable one. It is also something you have to learn to do. It's slow and difficult but it is ultimately worth it.\n\nA general piece of advice is don't loose too much weight in a short amount of time. Keep it slow and steady! Don't starve yourself, substitute bad food with good food ([this is what I mean](https://www.youtube.com/watch?v=0Q8T9gjICAc&) ~~i know, he sounds like the parrot from aladin but he has good advice~~).\n\nSo keep at it.\n\nSorry if this is all over this place.",
      "created_utc": 1623832319.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1y4vke",
      "author": "gloppy213",
      "body": "I TOTALLY get this experience. Keto is personally a triggering diet for me since results are so instant that you just feel like you can do more and more and more until you're eating just a single sausage every day lol.\n\n1. Focus on the foods and their nutritional quality themselves. Come up with balanced go-to meals and establish a meal routine that you rotate through every few weeks to make sure you have nutritional variety. \n2. Ultimately weight loss is not your goal in life. You don't die happy because you lost weight or anything. It's so so so important that the weight loss process does not hinder your ability to participate in activities you enjoy. If you've had disordered eating for a while that took up a ton of time, pick up a new hobby. Crocheting is therapeutic and surprisingly consuming for me so I do it for fun.\n\nAnd to make this point more applicable to you, you need to stop focusing on that deadline for weight loss. Weight loss is the result of healthier habits and it happens at its own pace. I can't will myself to become the president of the US by bribing everyone in the country to vote for me. It's a multi-faceted process and becoming president is merely the uncontrollable outcome.\n\n1. Refocus and challenge your thoughts. This is basically self-therapy. Every time you have a super restrictive thought tell yourself like a dog, \"No, bad \\[gloppy213\\]\". It's humorous and it refocuses you. Another thing that's understandably extremely difficult is stopping the weighing and stopping mirror checking. Just refuse yourself once and say \"What am I doing? I look the same as I did yesterday\". This will challenge the habit or even addiction you've built to the measurements and the pattern will be disrupted. You'll be able to catch yourself next time even more easily and you always have to challenge yourself to say \"no, I don't need to. It's unnecessary and I look and feel fine\". Eating disorders are mental disorders that can turn physical so don't let it get to the point of physical illness. Build healthy thought patterns.\n2. Similar to coming up with a set meal plan, eat exactly three meals a day (and designated snacks if you want). Don't let your restrictive thoughts tell you \"Oh you're not hungry you can skip this meal\". Eat when it's time to eat.\n3. Don't take this too seriously. Again, weight loss should not interfere with your life. Go out and eat with your friends and family. Try that new restaurant if that's something you enjoy. For obese people the problem tends to be portion control so the only thing you should be strict about is listening to your body. Even if you eat a low volume of foods (like something fatty with a lot of sugar), your body knows how much energy it needs and it will regulate that for you by telling you that you have enough energy even if your stomach isn't bursting.\n4. If you're trying all of these things while losing weight at the same time and it's not working then you need a break from weight loss. For my various eating disorders I would hear messages like the ones I put in this comment and I would say \"Oh! That makes sense, I'll do that\" but then I wouldn't do it properly because I was still terrified of letting go and losing control. I had no faith in my body's ability to regulate itself. You need to let go of that need for control and if you take a break from losing weight for a bit then you can take of the added pressure of recovering from these thoughts.\n\nI see a lot of people saying it's not possible to lose weight while having an eating disorder. I would agree with that. However based on your post you only seem to be having disordered thoughts, which is natural and can be mitigated while losing weight if caught early (which you do seem to have caught your thoughts early). More than anything you have to recognize that these thoughts are rooted in fear. They are not your friend and you should never indulge them.",
      "created_utc": 1623833040.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1ya2by",
      "author": "littlegoldsmith",
      "body": "In my experience, you ha e to change your whole diet permanently not for the short term or for weight loss. But eat for the body you want. I won’t mention sizes or numbers but I’m a size X and I eat the correct amount of calories to maintain my size X. I think if you just go straight to the correct amount of calories for the size you want and stick with it you’ll notice a change. But also remember no one eats the recommended amount of calories for their body every day, you can eat regularly for 6 days and if you eat a huge pizza on day 7 it won’t make you gain weight.  Also check out volume eating, it’s the best thing I’ve found.",
      "created_utc": 1623837928.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h1wtil6",
      "author": "MathematicianNo9146",
      "body": "I have PCOS myself and the struggle is real.  I tired to do Keto as well and found myself started to obsess about the number on the scale.  Telling myself I need to weigh in a specific time each week and then I realized I was weighing myself multiple times ago.  Ever since I stopped my weight has gone up. I have to accept I have PCOS and weight loss won’t be easy.  But I feel you.",
      "created_utc": 1623802360.0,
      "score": 1,
      "context": [
        {
          "id": "h1un05m",
          "author": "FoxiiFighter",
          "body": "As someone who has been embarking on this very journey (a recovered anorexic, trying to lose about 20lbs of fat as determined by a dexa scan), you really need to do this with a professional - maybe even two - a therapist as well as an RD.\r  \n\r  \nI started back in January on my own, and it's a daily battle. As of right now, I've maintained my weight because of how the restricting (and subsequent binging) has come into play, and I have to pull myself out of a deficit and eat at maintenance to get my brain back in check. My biggest trigger right now is when the scale DOES go down, it drives my restricting urge. I cannot afford a dietician or a therapist at this point, so I am going to keep trying, but this is not a journey I would ever recommend someone in our shoes go on their own.\n\nIf you truly are above a healthy weight (and not just targeting a specific BMI or size for a wedding dress), following good, basic health principles SHOULD see your body balancing out to where it needs to be. You could work with an RD that's familiar with gentle nutrition as well as Intuitive Eating to help you find a safe way to reach a healthy weight goal. NOTE: The idea of IE and intentional weight loss are often counterproductive, but it is still 100% possible to eat towards a specific goal while honoring your body's hunger cues. It's a delicate art form. \n\nAsk yourself this: What if you could achieve your aesthetic goals and \"be happy\" with your body, but the number on the scale never changed? Is it really your appearance? Or are you chasing a number and what you think it looks like? These are all things I think you really should look at and work through. I used to think that the aesthetic I wanted meant a certain weight --- come to find out, several of my favorite influencers who all have the same shape I want...have a 30-50lb difference in their weight due to muscle mass and composition. Sometimes the \"goal\" we set for ourselves doesn't align with the reality of what will actually make us happy --- that's why so many people hit that \"goal\" and aren't happy because they thought they should look like something different at this goal weight. So I think you need to re-evaluate what \"happy with my body\" actually means to you -- because I doubt a number on the scale will fix that. \n\nTL;DR - If you're going to do this, get a therapist and an RD to help you control the ED behaviors and help you achieve results healthfully. Also bear in mind that the aesthetic you want may not match the weight goal you're setting for yourself.",
          "created_utc": 1623766933.0
        }
      ]
    },
    {
      "id": "h1y2uel",
      "author": "Icy_Ad_8802",
      "body": "It should say “restrictive diets” instead. \n\nThe problem with CICO is that it can go as restrictive as you want, from 100 cal to 1000 cal, and if the slight deficit or restriction is not overlooked by a professional then things can get baaaaad.\n\nA slight calories deficit as per CICO won’t lead to a drastic weight change and the “wow you look amazing” that every restrictive dieter wants. Most of us don’t diet for health, but because we want to fulfil the ideal beauty standard, e.g. OP not wanting to look “like a whale” in her wedding photos.",
      "created_utc": 1623831080.0,
      "score": 3,
      "context": [
        {
          "id": "h1xjj40",
          "author": "pussyforpresident",
          "body": "You’re going to maybe hear a lot of rhetoric about how diets don’t work/are unhealthy/etc. \n\nHere’s the thing: …Everyone’s on a diet. Everything you eat is a diet. It should’ve never been used as a catch all to explain “a plan to eat to lose weight.” Diet is not a bad word, it’s just what we put in our bodies day to day. \n\nI do have a bit of a bone to pick with keto; As a recovered anorexic and someone in nutrition, it can often do more harm than good. People replace milk in their lattes with heavy whipping cream (AHHH) and lots of other things. It’s bad for your heart in the long run, and you’ll want something more sustainable that makes you feel good! Keto is great short term but will make you feel a bit shit long term, and their rules don’t often guarantee weight loss, but can guarantee weight gain/fluid retention/etc etc. \n\nI’d reach out to your gynecologist and explain your situation, or even a registered dietician. I have needed supervision when I’ve needed to log my food, as it can go wrong very fast. But just because I can respond poorly to it doesn’t make it bad. Eventually I’m hoping it won’t be such an Everest. \n\nIt’s all about burning more than you take in, at the end of the day, and that can be hard to guarantee without logging. You really don’t even have to have too much of a deficit — it is *okay* to be on a restrictive diet, as long as it is healthy and not too restrictive. Calories in/calories out is a pretty good choice, as you restrict nothing except a few hundred calories at best. It gets dangerous when you restrict too many. \n\nThe thing is, non-restrictive CICO diets are either maintenance diets (harder than losing weight, IMO!) or diets in excess of calories burned. Think less “restrict” and more “slight deficit.”\n\nAlso I’d encourage you to have your blood work looked at as well, the gyno may agree! If there are thyroid issues they can be addressed with medication and cause less discouragement/more solutions. \n\nAnd I am sure you don’t look like a whale at all, btw!",
          "created_utc": 1623816131.0
        }
      ]
    },
    {
      "id": "h1x1g83",
      "author": "tchrgrl321",
      "body": "Can you say which dietitians on insta you’re referring to? I’d like to follow",
      "created_utc": 1623806472.0,
      "score": 1,
      "context": [
        {
          "id": "h1vueem",
          "author": "momunist",
          "body": "There are ways to manage your health without dieting. There isn’t a way to diet or intentionally lose weight that isn’t triggering to eating disorders. But the good news is that there is a lot you can do for your health besides just trying to lose weight. Getting plenty of vegetables, pairing carbs with protein and fiber, drinking more water, getting better sleep, and finding movement you enjoy— all of these things might help you to lose weight or might not, but they will all be beneficial to your health regardless. If you’re on Instagram, there are some weight-neutral PCOS dietitians who also offer amazing advice, and there’s at least one good Facebook group for diet-free help for insulin issues.",
          "created_utc": 1623785750.0
        }
      ]
    },
    {
      "id": "h1y5i41",
      "author": "pussyforpresident",
      "body": "Which is why I said what I said. And honestly, a slight calorie deficit *can* obtain results, over time. Especially with light exercise (like walking!) The mindset that they can’t unless you do it to an unhealthy degree is harmful. Professionals can point you in the right direction and oversee results. \n\n“Most of us don’t diet for health, but because we want to fulfill the ideal beauty standard”\n\nI disagree e.g. — OP mentioned wanting to get naturally pregnant in a healthy way. \n\nAlso my formerly super underweight body from restricting also doesn’t agree, it wouldn’t have even been passable in the 90’s. Lol. \n\nI’m not saying people don’t, I’m just reactive to this claim because I don’t agree it has much to do with eating disorders, to be honest. If it did, we’d all “stop” while sick when we get there. Naturally if you need to lose weight for whatever reason, and you have a history of eating disorders, you should seek a professional to help you obtain that goal safely. In fact, it’ll probably encourage a healthier relationship with food as a result.",
      "created_utc": 1623833644.0,
      "score": 1,
      "context": [
        {
          "id": "h1xjj40",
          "author": "pussyforpresident",
          "body": "You’re going to maybe hear a lot of rhetoric about how diets don’t work/are unhealthy/etc. \n\nHere’s the thing: …Everyone’s on a diet. Everything you eat is a diet. It should’ve never been used as a catch all to explain “a plan to eat to lose weight.” Diet is not a bad word, it’s just what we put in our bodies day to day. \n\nI do have a bit of a bone to pick with keto; As a recovered anorexic and someone in nutrition, it can often do more harm than good. People replace milk in their lattes with heavy whipping cream (AHHH) and lots of other things. It’s bad for your heart in the long run, and you’ll want something more sustainable that makes you feel good! Keto is great short term but will make you feel a bit shit long term, and their rules don’t often guarantee weight loss, but can guarantee weight gain/fluid retention/etc etc. \n\nI’d reach out to your gynecologist and explain your situation, or even a registered dietician. I have needed supervision when I’ve needed to log my food, as it can go wrong very fast. But just because I can respond poorly to it doesn’t make it bad. Eventually I’m hoping it won’t be such an Everest. \n\nIt’s all about burning more than you take in, at the end of the day, and that can be hard to guarantee without logging. You really don’t even have to have too much of a deficit — it is *okay* to be on a restrictive diet, as long as it is healthy and not too restrictive. Calories in/calories out is a pretty good choice, as you restrict nothing except a few hundred calories at best. It gets dangerous when you restrict too many. \n\nThe thing is, non-restrictive CICO diets are either maintenance diets (harder than losing weight, IMO!) or diets in excess of calories burned. Think less “restrict” and more “slight deficit.”\n\nAlso I’d encourage you to have your blood work looked at as well, the gyno may agree! If there are thyroid issues they can be addressed with medication and cause less discouragement/more solutions. \n\nAnd I am sure you don’t look like a whale at all, btw!",
          "created_utc": 1623816131.0
        },
        {
          "id": "h1y2uel",
          "author": "Icy_Ad_8802",
          "body": "It should say “restrictive diets” instead. \n\nThe problem with CICO is that it can go as restrictive as you want, from 100 cal to 1000 cal, and if the slight deficit or restriction is not overlooked by a professional then things can get baaaaad.\n\nA slight calories deficit as per CICO won’t lead to a drastic weight change and the “wow you look amazing” that every restrictive dieter wants. Most of us don’t diet for health, but because we want to fulfil the ideal beauty standard, e.g. OP not wanting to look “like a whale” in her wedding photos.",
          "created_utc": 1623831080.0
        }
      ]
    },
    {
      "id": "h1x1ovc",
      "author": "momunist",
      "body": "pcos.nutritionist is the main one I love!",
      "created_utc": 1623806600.0,
      "score": 1,
      "context": [
        {
          "id": "h1vueem",
          "author": "momunist",
          "body": "There are ways to manage your health without dieting. There isn’t a way to diet or intentionally lose weight that isn’t triggering to eating disorders. But the good news is that there is a lot you can do for your health besides just trying to lose weight. Getting plenty of vegetables, pairing carbs with protein and fiber, drinking more water, getting better sleep, and finding movement you enjoy— all of these things might help you to lose weight or might not, but they will all be beneficial to your health regardless. If you’re on Instagram, there are some weight-neutral PCOS dietitians who also offer amazing advice, and there’s at least one good Facebook group for diet-free help for insulin issues.",
          "created_utc": 1623785750.0
        },
        {
          "id": "h1x1g83",
          "author": "tchrgrl321",
          "body": "Can you say which dietitians on insta you’re referring to? I’d like to follow",
          "created_utc": 1623806472.0
        }
      ]
    },
    {
      "id": "h1x20i6",
      "author": "tchrgrl321",
      "body": "Thx!",
      "created_utc": 1623806768.0,
      "score": 1,
      "context": [
        {
          "id": "h1vueem",
          "author": "momunist",
          "body": "There are ways to manage your health without dieting. There isn’t a way to diet or intentionally lose weight that isn’t triggering to eating disorders. But the good news is that there is a lot you can do for your health besides just trying to lose weight. Getting plenty of vegetables, pairing carbs with protein and fiber, drinking more water, getting better sleep, and finding movement you enjoy— all of these things might help you to lose weight or might not, but they will all be beneficial to your health regardless. If you’re on Instagram, there are some weight-neutral PCOS dietitians who also offer amazing advice, and there’s at least one good Facebook group for diet-free help for insulin issues.",
          "created_utc": 1623785750.0
        },
        {
          "id": "h1x1g83",
          "author": "tchrgrl321",
          "body": "Can you say which dietitians on insta you’re referring to? I’d like to follow",
          "created_utc": 1623806472.0
        },
        {
          "id": "h1x1ovc",
          "author": "momunist",
          "body": "pcos.nutritionist is the main one I love!",
          "created_utc": 1623806600.0
        }
      ]
    }
  ]
}