{
  "id": "o3ryqj",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1624143462.0,
  "title": "Request: is there an eating disorder for obsessively wanting to gain weight?",
  "selftext": "my best friend is at a healthy weight but she’s fixated on gaining weight. she tries every weight gain pill/supplement/gimmick and focuses on eating “fattening” foods. she’s reached a point where she doesn’t eat healthy food because she thinks it’ll make her lose weight. I think she has body dysmorphia because she is and looks healthy/average but she thinks she’s very underweight, though I don’t know if what she has counts as an eating disorder.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/o3ryqj/request_is_there_an_eating_disorder_for/",
  "score": 40,
  "num_comments": 13,
  "comments": [
    {
      "id": "h2dfj2n",
      "author": "None",
      "body": "oh! im actually recovering from this... i’m not sure what it’s called but ive always been a little underweight due to a fast metabolism. it really fricked with my body image and my perception of self, so for a couple of years i tried pretty desperately to gain weight. it mostly stemmed from not feeling feminine enough?",
      "created_utc": 1624144613.0,
      "score": 21,
      "context": []
    },
    {
      "id": "h2dwp35",
      "author": "throwaway-m1",
      "body": "I don’t know if there is a name for this, but that definitely sounds like a mental illness/disordered eating.",
      "created_utc": 1624154723.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h2ecmk9",
      "author": "None",
      "body": "beneficial meeting shy reply dependent truck sable tap afterthought hobbies\n\n *This post was mass deleted and anonymized with [Redact](https://redact.dev/home)*",
      "created_utc": 1624164668.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h2ebt7h",
      "author": "Scary-Part-7714",
      "body": "im not surprised this is a thing now everybody wants to be \"thicccc\"",
      "created_utc": 1624164089.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h2e2hkc",
      "author": "Big_Sky5952",
      "body": "look up bigorexia. it’s something like this",
      "created_utc": 1624158229.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2fkiwo",
      "author": "TomboXP",
      "body": "There is a whole subculture built around this with “gainers.” There are then “admirers” who like to look at the gainers and how big they have got. \n\nI know a guy who is like this, he was thin but he wanted to be fat so now he is bigger and he has like eating parties with other people who want to do the same. \n\nThere is also a fetish side to it",
      "created_utc": 1624199825.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h2ezag4",
      "author": "Trippy_trip27",
      "body": "Yup there is. I have had this for some time, trying to control a lot of aspects of my diet, counting calories, nutrients. Getting supplements for protein and amino acids, eating high cal foods, getting way too many pills. After some time you realise that calorie dense foods don't help, you still need to eat like a normal human. something like 50% carbs 20% protein 30% fats in every meal you eat, you can't just overfill one slice of bread with butter. At the end of the day it's a mental health issue and it's about control, not so much about confidence. If you think she needs a doctor then visit one with her if she can't do it alone, if she needs to gain weight tell her she needs to get a blender, it really makes a difference. She needs to go to a psychiatrist, try to make sure she doesn't give up on that",
      "created_utc": 1624185350.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2dxl83",
      "author": "testfreak377",
      "body": "Could be a fetish or new magazine fad that’s going on somewhere... I’m not sure. That sounds most likely",
      "created_utc": 1624155264.0,
      "score": 0,
      "context": []
    },
    {
      "id": "h2ddja5",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1624143463.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2sj83u",
      "author": "tatigray",
      "body": "Me. I just had an epiphany about my whole life and why I’ve always been fascinated with anorexia forums. I think it’s cuz I was surprised there’s girls out there whowant to be thin like me when I’ve always wanted to be curvy and shit. Wow. I always was wondering about it but just always had the wrong perspective thinking I was ed’d or some shit because I read forums",
      "created_utc": 1624470517.0,
      "score": 1,
      "context": []
    },
    {
      "id": "he0vsjb",
      "author": "aangiev",
      "body": "I never thought I would see people who are going through a similar problem like me. I still don’t understand exactly what I’m going through but I noticed my anxiety of eating in public places is because I’m scared people will judge me for not finishing a plate or judge me for being too thin? If that’s even a thing and I worry if I don’t eat at a certain time I’ll loose weight. I could be wrong about what I have but seeing things like real women have curves is hurtful because it makes me feel like I’m not not a woman.",
      "created_utc": 1632438634.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2sj99v",
      "author": "tatigray",
      "body": "Saaaaaame",
      "created_utc": 1624470531.0,
      "score": 1,
      "context": [
        {
          "id": "h2dfj2n",
          "author": "None",
          "body": "oh! im actually recovering from this... i’m not sure what it’s called but ive always been a little underweight due to a fast metabolism. it really fricked with my body image and my perception of self, so for a couple of years i tried pretty desperately to gain weight. it mostly stemmed from not feeling feminine enough?",
          "created_utc": 1624144613.0
        }
      ]
    },
    {
      "id": "h2f4lmk",
      "author": "eeker5",
      "body": "It’s been a thing for much longer than that but i get your point.",
      "created_utc": 1624190018.0,
      "score": 4,
      "context": [
        {
          "id": "h2ebt7h",
          "author": "Scary-Part-7714",
          "body": "im not surprised this is a thing now everybody wants to be \"thicccc\"",
          "created_utc": 1624164089.0
        }
      ]
    }
  ]
}