{
  "id": "o45kw6",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1624195389.0,
  "title": "Request: Just telling her she's not fat doesn't feel like enough.",
  "selftext": "I'm dating this incredible girl and since early on we've been very open with our struggles. We've discussed her eating disorder, which to me sounds like Atypical Anorexia, and I've asked how I can help.\n\nBecause we live a few hours apart I feel useless, I want to help her in every way but it's just not physically possible at the moment. However she's asked me simply to remind her that she's not fat. I mean, she is absolutely not fat, she's actually intimidatingly beautiful and it makes me sad to think of the tricks our mind plays on us. But I just feel like saying \"You're not fat\" isn't enough. It sounds scripted and even though I mean it completely, it sounds shallow.\n\nWhat can I say to make it feel more organic? Are there more ways I can help without physically being with her? Is saying she's beautiful helpful, or does it reinforce her mindset if I say it after she's had a triggered day?\n\nPlease help.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/o45kw6/request_just_telling_her_shes_not_fat_doesnt_feel/",
  "score": 43,
  "num_comments": 8,
  "comments": [
    {
      "id": "h2fowrw",
      "author": "856850835",
      "body": "I think you might be taking a little too much responsibility here. You're doing your best to be supportive in the only way you know how. She is responsible for her eating disorder, and only she can make the decision to recover. There are things you can do to help her come to that decision, but please don't blame yourself at all for her condition. You might like this article:\n\nhttps://www.eatingrecoverycenter.com/resources/addressing-caregiver-concern-eating-disorder-spouse-partner",
      "created_utc": 1624202129.0,
      "score": 29,
      "context": []
    },
    {
      "id": "h2fo281",
      "author": "cinnamondaisies",
      "body": "“[Youre] absolutely not fat, [youre] actually intimidatingly beautiful and it makes me sad to think of the tricks our mind plays on us”\n\nTell her this :)\n\nAnd even if it feels shallow- it’s still a lot to hear when you’re that deep in despair. It might not seem like enough to you, but she’s trusted you to remind her when she needs it. That shows a lot to me.",
      "created_utc": 1624201674.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h2fsqr3",
      "author": "xenomorphgirl",
      "body": "The problem with eating disorders is that on the surface, it appears it's all about your body, but the truth is, its roots go much deeper than that.  \n\nIt's sounds like you are being asked to help her with the symptoms of a possible eating disorder or body dismorphia, but that won't get at the cause. Not that it's wrong, but just something for you to be aware of.  No matter how many times you say it, is not going to \"fix\" anything until the root issues are addressed, and it will just be a constant thing- you reassuring her.\n\nI think the best you can do is be supportive, be a good listener, be curious, but ultimately, it will be up to her when/if she's willing to work on the deeper stuff (with or without professional help).",
      "created_utc": 1624204110.0,
      "score": 13,
      "context": []
    },
    {
      "id": "h2gc4q9",
      "author": "CheekyMolasses",
      "body": "If it's at all possible, I would try and focus on things that have no bearing on weight, compliment her organically when she makes you laugh, tell her you adore her smile, the way she walks, how outrageously adorable it is when she tucks her hair behind her ears, how sexy she is when she's talking passionately about something...I find with ED we can focus the conversation far too much on weight and for me that's not even something I want to be reminded of. If my partner told me out the blue \"you're not fat\" I'd focus on why they were telling me that - have I eaten too much? Is my dress too tight? Have I gained without somehow noticing? I want to be reminded of all the things that my partner loves about me that are away from my disorder and the way I criticise myself.",
      "created_utc": 1624213668.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h2h113u",
      "author": "highacidcontent",
      "body": "I think that in the moment, telling her that she isn't fat might make her feel better, but in the long run it will only make things worse. When you compliment her, try to focus on things that have nothing to d with her body or weight. Like her hair, eyes, or her humor, how smart she is, etc.",
      "created_utc": 1624226134.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h2ft5re",
      "author": "HoneyWest55",
      "body": "Some how you have to distance yourself from her struggle.  It is not your responsibility.  You can be supportive and reassuring like saying 'you look nice today' or 'I loved being with you today'.  Reinforce your tie to her in positive ways but telling her she's 'intimidatingly beautiful' is quite over the top.  I would run that through my own head if I were you.  Think about why you think she's 'intimidatingly beautiful' and why you even came up with that terminology.  Right out of the gate that screams 'she's too good for me or out of my league'.  Honestly it sounds like you both need some self work.",
      "created_utc": 1624204327.0,
      "score": -1,
      "context": []
    },
    {
      "id": "h2fcjbh",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1624195389.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2fw0x0",
      "author": "bruhcrossing",
      "body": "^ this. You being her only source of support is not a good idea. Encourage her to seek it elsewhere as well: friends, family, therapy, self help books, support groups",
      "created_utc": 1624205785.0,
      "score": 11,
      "context": [
        {
          "id": "h2fowrw",
          "author": "856850835",
          "body": "I think you might be taking a little too much responsibility here. You're doing your best to be supportive in the only way you know how. She is responsible for her eating disorder, and only she can make the decision to recover. There are things you can do to help her come to that decision, but please don't blame yourself at all for her condition. You might like this article:\n\nhttps://www.eatingrecoverycenter.com/resources/addressing-caregiver-concern-eating-disorder-spouse-partner",
          "created_utc": 1624202129.0
        }
      ]
    }
  ]
}