{
  "id": "o4jdh4",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1624236946.0,
  "title": "Request: What can I do about my Binge eating?",
  "selftext": " \n\nHi, long story. I was always big, over the course of a year or so i lost a massive amount of weight, made bad choices in the way i lost it etc. I've maintained my love for fitness and not just for looks but also performance. I occasionally binged, once a month to maybe once a week etc etc. Now I'm lucky if i can go 2 days without binging. I've tried everything - stopped and started calorie counting countless times, read and tried to utilise books, researched online etc. I've lost hope. I haven't regained all the weight, only about a quarter of it so far. But it's killing me seeing myself undo the one good thing i was proud of. The depression is coming back and I feel completely and utterly helpless. This is my first time making a post on here - reddit has helped with any other questions I have. Can it help here? Anything appreciated. Thank you",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/o4jdh4/request_what_can_i_do_about_my_binge_eating/",
  "score": 37,
  "num_comments": 12,
  "comments": [
    {
      "id": "h2hwglu",
      "author": "zuroma",
      "body": "What worked for me was letting go of trying to “solve” my binge eating problem, and letting go of trying to identify my triggers in the hope of being able to expertly avoid them. \n\nI treated it as a deep-rooted pattern in my brain that would always be there. If I deprived myself or tried dieting, the binge frequency would increase. So I stopped dieting, stopped calorie counting, threw out my scale, and just ate what I wanted to make sure I never felt deprived.\n\nIt started off with me eating whatever I wanted with unhealthy choices, but eventually morphed into eating whatever I wanted with healthier choices. It was a razor’s edge though. If I forced myself too soon to eat healthy, that sense of deprivation came up and I binged. It took about 6 months to end all desire to ever binge again.\n\nI still eat emotionally sometimes. That will always be there and I’m okay with it. But when binging stopped, I eventually (took a year) stabilized at a healthy weight.\n\nI know you said you’ve read books, but just in case you haven’t yet, try looking for books that use this approach I’ve described.",
      "created_utc": 1624243616.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h2hm2ye",
      "author": "suicidalpenguin99",
      "body": "I'm in a similar boat myself and feel completely out of control. I wish I had some good advice for you, but I don't. I can however offer the support of someone going through it too and wish you the best with this awful disease",
      "created_utc": 1624237966.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h2hnuln",
      "author": "Small_Turtle14",
      "body": "Trying to figure out what triggers the binges is a good start. For example, is it just restriction in general or do you have specific trigger foods? Or maybe you're bringing to escape reality/avoid tough emotions. \nTalking to a professional about your issue is also something I'd strongly recommended. \nThe binges are consequences of something. Trying to work through that something and finding healthier coping alternatives will help you get through this.\nBest of luck",
      "created_utc": 1624238994.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h2i3o94",
      "author": "sadbabykitty",
      "body": "the only thing that ever helped me with binge eating was eating multiple times a day like meal, snack, meal, snack, meal snack and also allowing myself to eat any foods i wanted. and like normal portions. it took a long time. it’s not like after one day the binge eating stopped, it took a while for my brain to be like okay i’m getting enough food and all the foods i want everyday.  it’s hard to force yourself to eat like that because it can feel like you’re eating a lot or if you’re still binging at first that you shouldn’t continue eating like normal because you need to somehow make up for the binge eating but it gets easier. then eventually you can eat more intuitively and stuff. idk if you’ve tried this but it definitely helped me in the past! i hope things get better for you ♥️",
      "created_utc": 1624247876.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h2i3uhr",
      "author": "malavika9",
      "body": "I’m not an expert or nearly qualified enough to give you an advice, so I’ll tell you what I did. I listened to my hunger cues. And also pick one healthy thing that you can eat guilt free- for me it was chocolate protein oats, I ate that whenever I felt hungry. Your body needs to trust you. There’s this YouTube channel-Linda Sun, her videos helped too. Hope this helps!",
      "created_utc": 1624247987.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h2i8gzp",
      "author": "None",
      "body": "So I’m not at all a professional. At all. And I’ve suffered with both binging and restricting so I’m not the worlds best. But, for me personally, my binging is rooted in the fact I grew up poor with locks on the fridge. I became an emotional eater. When I’m financially stable and able to buy 3-4 of every item, multiple bags of granola or multiple boxes of ice cream etc, I stopped. This may not work for someone who binges for different reasons as it may be enabling that, but for me having access to a ton of food made eating less way easier. And I have to slow down over time. I went from gigantic plates full of heavy food to slightly smaller meals, and I mean SLIGHTLY. I had to do it slowly so my stomach stopped wanting so much, and now if I look at a plate of what I ate in December I’d probably be able to only touch a quarter of it. It took telling myself I’m allowed to buy more food and that food wasn’t a finite resource to stop me from filling myself with literally all the food I saw. I also remind myself that my body is beautiful. It survived a pandemic. I remind myself of the things I learned in therapy and with my dietitian, and I don’t restrict so much it triggers a huge binge. It helped so much.",
      "created_utc": 1624251132.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2ife6l",
      "author": "anni67199",
      "body": "The one thing that made me quit binge eating is when I took acid. Idk why I never felt the urge after that.",
      "created_utc": 1624256826.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2izuhm",
      "author": "DunnoWhatToPutSoHi",
      "body": "This was my post - I massively appreciate all your kindness, advice and support. Reddit is a beautiful place sometimes. I'll keep trying my best, but man is it tough sometimes. Thank you all",
      "created_utc": 1624276123.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2hka6k",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1624236946.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2j34a7",
      "author": "rzs96",
      "body": "I am in the exact same boat right now. Lost a ton of weight last year (through unhealthy behaviors) and now I feel like I have no control over my food intake. I feel like I am bingeing to make up for all the food I restricted last year. I haven't gained all the weight back, but enough to make me miserable. I wish I had good advice and a way to help. But know that you are not alone and you are supported. I hope things get better 💕",
      "created_utc": 1624278441.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2of11q",
      "author": "Granny_Skeksis",
      "body": "Honestly the only thing that worked for me was medication. Apparently binging can be caused by undiagnosed ADHD. As soon as I started taking meds for it my desire to binge stopped and I lost 50 pounds without trying. Before I could eat a whole pizza no problem, now I can only eat 2 slices. It was such a crazy change. I even notice the mental desire to binge is almost non existent now. It’s crazy",
      "created_utc": 1624385628.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2ii8xj",
      "author": "None",
      "body": "Location, time of day, overall feeling and if you use a certain type of entertainment, then that‘s also important. \nWhat triggers binges for me is the following combination: using instagram or youtube while bingeing, sitting in the living room in the afternoon/evening and having trigger foods. Very likely i‘ll binge.",
      "created_utc": 1624259413.0,
      "score": 3,
      "context": [
        {
          "id": "h2hnuln",
          "author": "Small_Turtle14",
          "body": "Trying to figure out what triggers the binges is a good start. For example, is it just restriction in general or do you have specific trigger foods? Or maybe you're bringing to escape reality/avoid tough emotions. \nTalking to a professional about your issue is also something I'd strongly recommended. \nThe binges are consequences of something. Trying to work through that something and finding healthier coping alternatives will help you get through this.\nBest of luck",
          "created_utc": 1624238994.0
        }
      ]
    }
  ]
}