{
  "id": "o530e2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1624302981.0,
  "title": "Request: My gf's eating disorder makes her happy",
  "selftext": "Hi everyone,\n\nI need help figuring out what to do.\n\nMy girlfriend has had an eating disorder for about a decade now and ever since we started dating two years ago she has relapsed several times. She also has severe depression, anxiety and OCD. Over the past year she got the right medication and partly got over her depression. However, right now her eating disorder it's worse than it's ever been and she's doing so badly. She says that she's tired of it but that it makes her happy and she doesn't want for it to go away. \n\nShe has A LOT of unprocessed trauma and she's never been to therapy, but we can't afford to start it. Every day it gets worse and worse and it's killing me, I don't know what to do. She says she wants to hit rock bottom and basically go to inpatient before she can start recovery and I feel like I simply can't take that. I don't know if I can stay sane while we're together.\n\nPlease help, what can I do? How can I help.\n\nThank you.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/o530e2/request_my_gfs_eating_disorder_makes_her_happy/",
  "score": 47,
  "num_comments": 10,
  "comments": [
    {
      "id": "h2kthn7",
      "author": "tryingtorecover54",
      "body": "Unfortunately, you're not going to be able to change her mindset (coming from someone who also finds joy in her ED) its something she feels like she can control. Rock bottom is a dark dark place, and some people don't make it out. \n\nLet her know you love her, but you need to decide if its something you can watch her do. Look for free therapy programs in your area, or support groups. Because things are going to get very very bad before they might get better.",
      "created_utc": 1624308035.0,
      "score": 33,
      "context": []
    },
    {
      "id": "h2klmb5",
      "author": "HoneyWest55",
      "body": "Well you can't make anyone get help who doesn't want it.  I don't know what you mean when you say her ED makes her happy but she wants to hit rock bottom.  Anyway her issues sound pretty complicated but you have to remember they are HER issues not yours.  Your issue is trying to figure out if you can live with her while she goes through this.  I don't think there's much you can do to help her but you might seek out counselling for yourself to regain some balance and perspective.  It's never wise to make big decisions while you're upset.",
      "created_utc": 1624304451.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h2l48wr",
      "author": "iforgotmyedaccount",
      "body": "It doesn’t make her happy, it’s a coping mechanism. It helps her cope with negative feelings so she thinks it makes it happier because it takes those negative feelings away. The same way a drug addict would think drugs make them happy. She should go to counseling/therapy so she can learn healthier coping mechanisms that don’t harm her health.",
      "created_utc": 1624313091.0,
      "score": 18,
      "context": []
    },
    {
      "id": "h2l0fvp",
      "author": "Maggiemaccy",
      "body": "When I lived with my disorder I was happy and successful. I’ve been without it for many years and I miss it terribly a lot of the time. I’ve been depressed since recovery, it’s hard to find motivation for anything anymore so, I really empathise with how she feels. I only decided to get better when my disorder started to backfire on me honestly, I started gaining weight and getting extremely puffy around my face and I couldn’t live with that. But I very much doubt I would have ever stopped if not for that because what a lot of people don’t realise is while it’s working and giving you what you want, life with an eating disorder can be very euphoric. \n\nI don’t have advice other than, she has to come to it in her own time. Life on the other side of it is tough, getting to the other side is also hell. Can you imagine someone asking you to put your mind and body through hell to come out of it feeling worse than ever?",
      "created_utc": 1624311270.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h2l7zi3",
      "author": "Powasam5000",
      "body": "Ive gotten upset for years when people say you can't change their mindset so they has to hit rock bottom. The truth is they are right. I tried so many times to help her and nothing came of it. 8 years later and many  ER visits and her body is failing her. She has been in a special ER clinic for almost a month now.  I won't even list all the problems she is dealing with as it is too graphic. To hear them sounds like death knocking on the door.  Before going to this clinic she couldn't even move and had to spend all day in bed. After this if she is well enough she will go to a inpatient center for another unknown timeframe. So while it is true you can't do anything about it, I still tried. But it hurts and stings that they ended up where you already knew they would go without help. So for 8 years you watch them slowly make it a reality.  It leaves you in a very vulnerable state. I have no advice I'm sorry. Just felt like venting a bit. It's just hard to hear you have to let someone you love hit rock bottom when you would do anything to protect them and prevent that.",
      "created_utc": 1624314974.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h2lwyrs",
      "author": "una_verdadera_lata",
      "body": "The dangerous thing is that there is no “rock bottom“ there is no “sick enough“ that magically makes someone want to get better. Its the same as active addiction- the bottom keeps getting lower and lower and the things you are willing to sacrifice have more and more consequence until you end up either dead, or with so little of value left that you wish you were. I would highly, highly highly encourage your gf to seek therapy- there are all sorts of low cost and sliding scale options. Additionally, I would make sure you are taking care of yourself. You are not going to convince her that her life is worth living (you can’t have a life and an active ED at the same time, trust me) and that isn’t because you aren’t enough or don’t love her enough- it’s the nature of the disease. I hope she can find the help she needs. Take care.",
      "created_utc": 1624328495.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2kwrfr",
      "author": "ginmonty",
      "body": ">She has A LOT of unprocessed trauma and she's never been to therapy, but we can't afford to start it.\n\nIf she had cancer and needed treatment, would you also delay because of the cost? Eating disorders can be deadly and are serious. Mental health should be taken as seriously as physical health. It will also cost less, in the long run, to get her treatment now than wait until you can afford it, as her eating disorder could get worse. If you both think therapy is expensive, take a look at what inpatient costs. \n\nI feel for both of you, this sounds like an incredibly tough situation. The best thing you can do for her (and you and your relationship) is to help her immediately seek help from a professional.",
      "created_utc": 1624309541.0,
      "score": 0,
      "context": []
    },
    {
      "id": "h2kieto",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1624302981.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2l0h3m",
      "author": "eeker5",
      "body": "Some people don’t get treated for cancer because they can’t afford it. Mental illnesses are treated a lot differently in the eyes of insurance etc as well. It’s not that simple for a lot of people. She also doesn’t want to recover from her ED and theres not much he can do about that other than figure out if he can cope with how it effects him.",
      "created_utc": 1624311285.0,
      "score": 7,
      "context": [
        {
          "id": "h2kwrfr",
          "author": "ginmonty",
          "body": ">She has A LOT of unprocessed trauma and she's never been to therapy, but we can't afford to start it.\n\nIf she had cancer and needed treatment, would you also delay because of the cost? Eating disorders can be deadly and are serious. Mental health should be taken as seriously as physical health. It will also cost less, in the long run, to get her treatment now than wait until you can afford it, as her eating disorder could get worse. If you both think therapy is expensive, take a look at what inpatient costs. \n\nI feel for both of you, this sounds like an incredibly tough situation. The best thing you can do for her (and you and your relationship) is to help her immediately seek help from a professional.",
          "created_utc": 1624309541.0
        }
      ]
    }
  ]
}