{
  "id": "o5tffg",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1624385576.0,
  "title": "Request: Should we tell our kids when a parent has an eating disorder?",
  "selftext": "My spouse is going to be going to an inpatient treatment center. We need to tell our kids she is going away. We had someone tell us that we shouldn't tell our kids about it. Right now we are using vague terminology but IMO our teenage daughters can figure it out. Are we doing more harm by not naming it? We obviously don't have to go into graphic details but we don't want to trigger them into copying, as this person told us it would.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/o5tffg/request_should_we_tell_our_kids_when_a_parent_has/",
  "score": 60,
  "num_comments": 21,
  "comments": [
    {
      "id": "h2oiuom",
      "author": "una_verdadera_lata",
      "body": "Tbh if you have teenagers, they most likely already know. I recommend being honest with them. Not naming creates a taboo and that isn’t healthy for anyone. Also if the center she is going to have any sort of family education groups/classes I would definitely try to attend- they can be really helpful in both educating and also providing you all with support/community. Congratulations to your family for making such a step in recovery. <3",
      "created_utc": 1624387343.0,
      "score": 86,
      "context": []
    },
    {
      "id": "h2ofilv",
      "author": "None",
      "body": "i don’t think your kids will want to copy her at all! i think that the more secretive you are the worse it will be for you as a family unit. tell them. tell them how horrible it is and how scary it is and how this person in their life needs to recover from it so that they can be happy again. that’s very infantile wording, sorry, i just feel that by not talking about it you will add to the stigma that it is shameful to need treatment",
      "created_utc": 1624385847.0,
      "score": 37,
      "context": []
    },
    {
      "id": "h2oh87k",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1624386614.0,
      "score": 32,
      "context": []
    },
    {
      "id": "h2okk4d",
      "author": "FFD1706",
      "body": "You should tell them. My mom definitely has an ED and I got a lot of my own issues from observing her as a kid. But I thought this was normal because she never admitted there was a problem.",
      "created_utc": 1624388107.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h2oku23",
      "author": "OverallMembership3",
      "body": "As the daughter of someone with an untreated (and unacknowledged) disordered eating, please tell them. My mom’s disorder, which she refuses to acknowledge, has bled into all of our eating habits and it’s made it harder to work through my own disordered eating because I don’t feel validated knowing it runs in my family. If anything, you’ll probably protect your kids more from not developing a severe ED by telling them what’s going on and naming it.",
      "created_utc": 1624388229.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h2omotu",
      "author": "allCreepy",
      "body": "When I was at inpatient treatment, one of the other patient had two young boys (I think they were around 7-8) and our therapists always encouraged her to bring them whenever we did family activities and involved them in the treatment whenever it was possible and adequate for their age.\nI remember they new their mum had a “bug” called anorexia and that it was making her feel ill and sad but the doctors were helping her.\nWhenever they came to visit they brought us girls a lot of joy, that’s for sure.",
      "created_utc": 1624389060.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h2ol3ly",
      "author": "IndieAcademic",
      "body": "Kids' imaginations are usually worse than reality. I would be honest and clear, especially since they are teens. I would act matter-of-fact and frame it as a health issue, which it is. They need to feel it's normalized to seek help for health issues of any kind.",
      "created_utc": 1624388345.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h2p5jw5",
      "author": "ningyizhuo",
      "body": "I agree with all of the other users, it's better to tell them. Especially since they are teenagers and probably already figured out that their parent is sick.\n\nI would just like to add that there is a genetic factor in anorexia. If one of your kids ends up developing it later in life (which I really hope it won't !) they might get upset at you for hiding this important fact to them. I know that I sometimes get upset that no one told me that my grandma has a disordered relationship with food because even if she's not diagnosed with anything and will deny it until she dies, she definitely has not an healthy relationship with weight and food and her comments affected my sister and I and are one of the reasons why we developed an ED. By telling them their parent has an eating disorder, you're breaking the taboo and teaching them that what this parent does isn't healthy, normal and that they shouldn't believe the same thing.",
      "created_utc": 1624397637.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h2pputd",
      "author": "burrito_finger",
      "body": "I noticed my mom's disordered eating from my earliest memories. I wish I would have known it had a name and wasn't my fault or anything I could have changed. I remember her pinching and poking herself and weighing herself and crying and measuring and measuring and measuring. She lost so much weight she developed permanent heart damage. She is recovered, but it led to me and my siblings all having disordered eating in different ways and created this huge stigma. She only recently talked about to me as an adult, and had no idea that *I always knew*. I knew when she'd say she wasn't hungry that she was. Or that she'd eat a lot when she was sad and then she'd be even more sad for weeks after. Speak to them. They need to know.",
      "created_utc": 1624408334.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2prdf6",
      "author": "bakerbabe126",
      "body": "My mom was anorexic. I don't think she meant for it to, but it bled into me. She would make comments about her own weight and mine and the things I ate and now I am 190 lbs and I hate myself for every calorie I eat.",
      "created_utc": 1624409161.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2r187s",
      "author": "Soybeans-Quixote",
      "body": "EDs are profoundly shaped - and reinforced - by secrecy and shame. Your daughters are of utmost concern, but so is thier mom, and she’s the one that’s suffering and needs immediate help. Sometimes this help begins with honest openness about your wife’s illness. If you she had cancer, and you think your girls would be mature to know that she needed cancer treatment, then they are mature enough to know about their moms eating disorder - it’s a chronic illness. Being honest with them about this isn’t going to make them any more predisposed to struggling with an eating disorder than they already are. If anything, secrecy - omission and ignoring the family’s shared trauma - is the higher risk factor for detrimentally impacting their health and wellness. \n\nMy story:\n\nBulimia started at 17 \nInpatient at 19 - Brief recovery \nRelapse went on for another 1.5 years \nRecovery stabilized at about 21 \n5 years recovery!\nRelapsed at 26 for many years \nBegan intensive outpatient \nRecovery at 30 - we welcomed our son \nPostpartum anxiety spurred intermittent relapses\nRecovery at 32 \nRelapse at  relapse at 33\nRecovery at 34 \nmy daughter is born \nPostpartum relapse at 35\nRecovery at 36\nGlobal pandemic \nRelapse at 37 \nI’m 38. In recovery.",
      "created_utc": 1624440775.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h2oewwn",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1624385576.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2p4z7v",
      "author": "HoneyWest55",
      "body": "If you have pursued this to the point that a treatment centre is involved, certainly there is a professional councillor on staff who can advise you with regard to this matter.  You say 'someone told you you shouldn't tell the kids.'  Who?  Was it a professional or some emotionally involved family member?  Professional advice is what you need not some social media opinion IMHO.",
      "created_utc": 1624397359.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2pzjfw",
      "author": "Various-List",
      "body": "Yeah, obviously there is a boundary with certain details, but it’s a hallmark sign if a toxic family to try to cover up or not acknowledge problems like this. It deprives the children’s the opportunity to process and make sense of things when they happen, erodes trust because they know you’re hiding things, etc. It sounds like your gut feeling is to ignore this advice and you shouldn’t doubt yourself in deciding what’s appropriate for your own kids.",
      "created_utc": 1624413370.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2qne53",
      "author": "dayummm2009",
      "body": "From my experience, you should talk about it , especially if they start showing early signs of eating disorder too or if they noticed that the parent has a strange relationship with food.\nAlso, it depends on their age, are they able to understand what it is ? What relationship they have with the parent ? \nAnd it's important to present it as a sickness, \n \nFinally, the parent needs help, the eating disorder is just the symptoms of the real problem. Being a mom and a wife, doesn't leave a lot of energy for the parent to focus on her problem and to fix it. She's gonna need time for herself and the help of a professional that she feels comfortable with.",
      "created_utc": 1624427938.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2qx4jx",
      "author": "_okayfinenowstfu_",
      "body": "TELL THEM!\n\n***TELL THEM EVERY.LAST.DETAIL.***\n\ngrowing up I was always told my moms anorexia horror stories, this was the ONLY thing the stopped me from developing one back then\n\nand they are teens they already know about eating disorders, you are doing more harm I can say that as a fact because unless they KNOW how much their parent is suffering and WHY they are, they are at risk of developing one by so many other factors\n\nunless they already have an ED it shouldn't make them want to replicate your spouse, no it'll scare them away by telling them the details, it'll teach them empathy for those dealing with similar situations\n\nso yes do tell them.",
      "created_utc": 1624436675.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2rk6m7",
      "author": "HubbyHasBlueBalls",
      "body": "I named it and explained it. My own mother had anorexia but tried to hide it and model “healthy” behavior, and it made huge issues for me. \n\nI talked to my children when they were pretty young, 5-8 ish. I explained that everyone has fears, and our brain makes us scared of things to help protect us and keep us safe. For example, being afraid of heights keeps a person from falling, being afraid of snakes helps us not get bit, etc. But sometimes our brain sends the wrong signals and makes us afraid of something that won’t hurt us. Like being afraid of grasshoppers, because grasshoppers aren’t dangerous. I then explained that mom’s brain tells her to be afraid of food, and it makes it hard to eat. But it’s okay because I’m seeing lots of “doctors” who are helping me with it and making sure I stay healthy. It made going inpatient easier to explain.",
      "created_utc": 1624454661.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h2p4qsb",
      "author": "wol",
      "body": "Thank you. We had the talk and you were right. One of them overheard a phone call so she knew but didn't quite know. They seemed relieved to understand what was going on.",
      "created_utc": 1624397244.0,
      "score": 28,
      "context": [
        {
          "id": "h2oiuom",
          "author": "una_verdadera_lata",
          "body": "Tbh if you have teenagers, they most likely already know. I recommend being honest with them. Not naming creates a taboo and that isn’t healthy for anyone. Also if the center she is going to have any sort of family education groups/classes I would definitely try to attend- they can be really helpful in both educating and also providing you all with support/community. Congratulations to your family for making such a step in recovery. <3",
          "created_utc": 1624387343.0
        }
      ]
    },
    {
      "id": "h2pr93b",
      "author": "gloppy213",
      "body": "Totally agree with this. And if you address it head on you can make it clear that if your children are having body image issues or are feeling out of control in their lives then they can always talk to you. (Those are the two places where eating disorders usually come from)",
      "created_utc": 1624409096.0,
      "score": 9,
      "context": [
        {
          "id": "h2oiuom",
          "author": "una_verdadera_lata",
          "body": "Tbh if you have teenagers, they most likely already know. I recommend being honest with them. Not naming creates a taboo and that isn’t healthy for anyone. Also if the center she is going to have any sort of family education groups/classes I would definitely try to attend- they can be really helpful in both educating and also providing you all with support/community. Congratulations to your family for making such a step in recovery. <3",
          "created_utc": 1624387343.0
        }
      ]
    },
    {
      "id": "h2pj1bi",
      "author": "ScareBear23",
      "body": "Also, if they *were* going to copy mom, I feel like it'd be because her behaviors were normalized instead of named as a problem.",
      "created_utc": 1624404599.0,
      "score": 10,
      "context": [
        {
          "id": "h2oh87k",
          "author": "None",
          "body": "[removed]",
          "created_utc": 1624386614.0
        }
      ]
    },
    {
      "id": "h2qnwgx",
      "author": "Raven_Craft815",
      "body": "Calories are necessary. Do you hate yourself for every breath of air you take? Food is a life necessity, just like the air we breathe.  When we demonize it, it becomes something that we want to avoid, and when we inevitably can't avoid it any longer, we internalize that. Shifting the role food plays in our heads can drastically improve our mental and emotional health, or just the opposite. I'm speaking from experience as well, at my highest weight I was 370 lbs, and now that I've made that mental shift, I am so much happier! Be kind to yourself,  fuel your body, and work towards healing your relationship with food.",
      "created_utc": 1624428353.0,
      "score": 3,
      "context": [
        {
          "id": "h2prdf6",
          "author": "bakerbabe126",
          "body": "My mom was anorexic. I don't think she meant for it to, but it bled into me. She would make comments about her own weight and mine and the things I ate and now I am 190 lbs and I hate myself for every calorie I eat.",
          "created_utc": 1624409161.0
        }
      ]
    }
  ]
}