{
  "id": "ob8kvd",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1625093415.0,
  "title": "Request: Recovery is worth it (my story)",
  "selftext": " \n\n i’m about to hit one year of sobriety from purging. i’m in recovery from anorexia, purging subtype. i was addicted to purging, doing it almost everyday & sometimes multiple times a day. now that ive hit almost one year, i know i can go without it. i cannot explain how much better i feel physically when i’m no longer in that horrible habit, my mind is clear, i don’t have constant acid reflux and headaches, my mouth isn’t full of sores. and mentally, i feel such a huge sense of accomplishment, i feel proud of myself. please get help if you’re struggling with an eating disorder, you are sick enough right at this moment. recovery is worth it <3 and i’d love to help anyone who is struggling with purging, i’ll try to answer any questions :)",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ob8kvd/request_recovery_is_worth_it_my_story/",
  "score": 67,
  "num_comments": 8,
  "comments": [
    {
      "id": "h3mx457",
      "author": "s169ja",
      "body": "Thank you for sharing. Hope everyday gets better for you. Stay strong",
      "created_utc": 1625106356.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h3ni13w",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1625118532.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h3m7k94",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1625093415.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3qycmc",
      "author": "None",
      "body": "(it’s my story) thank you love, appreciate those kind words <3",
      "created_utc": 1625186166.0,
      "score": 1,
      "context": [
        {
          "id": "h3mx457",
          "author": "s169ja",
          "body": "Thank you for sharing. Hope everyday gets better for you. Stay strong",
          "created_utc": 1625106356.0
        }
      ]
    },
    {
      "id": "h3pu6mz",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1625167414.0,
      "score": 3,
      "context": [
        {
          "id": "h3ni13w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1625118532.0
        }
      ]
    },
    {
      "id": "h3qyseg",
      "author": "None",
      "body": "oh my love, i know how fucking hard it is to overcome your anorexia. in the beginning it really does feel impossible, it’s a whole entity inside your head and it won’t leave you easily. \nfor starting, eat as well as you can. please. i know how hard it is, so so hard, but your brain is malnourished and can only focus on your anorexic thoughts! it cannot see why you need to gain weight, stop purging, etc. once you start nourishing your mind, body & soul, you can see reasons to quit your ED and live with food freedom! im hoping you’ll see this, and keep the mindset that you are SO MUCH MORE THAN A BODY! your body is the least interesting thing about you (in a good way!) im glad you’re getting help. just fucking eat, that’s all you can do right now. i know that sounds horrible, like you’re losing all your control, but you aren’t. anorexia isn’t control, purging isn’t control. it’s all in your head, the real control is food freedom!",
      "created_utc": 1625186396.0,
      "score": 3,
      "context": [
        {
          "id": "h3ni13w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1625118532.0
        }
      ]
    },
    {
      "id": "h4rttf9",
      "author": "unoriginalusername18",
      "body": "Please be honest, get the strength to tell your mum, or someone you can trust, about how you're still really struggling. She's not the enemy. She loves you so much and wants to help you fight this evil disease.\n\n The disease is so awful and it thrives on secrecy. It thrives on existing just in your own head where it can grow without being called out by reason/rationality. But hopefully your mum will understand it's not really YOU that has been behaving that way.\n\nIt is so so good you have great goals. You are so young with your whole life ahead of you. Choose recovery. Fuck the eating disorder - every time it tries to lie and tell you to do something that is going to get in the way of your recovery/restoration of your life - tell it to fuck off :P\n\nYou can do this. Your future self will be so proud and thankful for it. Choose recovery, and crack on and do what you gotta do (eat what your plan says). It will feel really hard at first. But hold on to that big picture. Keep talking to your mum etc about how you're finding it. And keep fighting. Xxx\n\nEdit: im really sorry - realised this is a bit old. But read your message and couldn't help but reply sorry. Hope it's not too out of place. Just you have my best wishes from afar :) take care",
      "created_utc": 1625974463.0,
      "score": 3,
      "context": [
        {
          "id": "h3ni13w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1625118532.0
        }
      ]
    },
    {
      "id": "h3qyw6x",
      "author": "None",
      "body": "i’m so proud of your recovery!! that’s a beautiful story, and i hope you continue to better your mental health & be kind to your mind (and body!) mwah",
      "created_utc": 1625186451.0,
      "score": 2,
      "context": [
        {
          "id": "h3ni13w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1625118532.0
        },
        {
          "id": "h3pu6mz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1625167414.0
        }
      ]
    },
    {
      "id": "h3wb8aq",
      "author": "AzMateo42069",
      "body": "when you speak of recovery, what did you do?  counseling?",
      "created_utc": 1625295355.0,
      "score": 2,
      "context": [
        {
          "id": "h3ni13w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1625118532.0
        },
        {
          "id": "h3pu6mz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1625167414.0
        }
      ]
    },
    {
      "id": "h40kb76",
      "author": "None",
      "body": "i was in a rehab for my anorexia, and counseling is part of it. therapy, group therapy, seeing if meds work for you, etc.",
      "created_utc": 1625400172.0,
      "score": 2,
      "context": [
        {
          "id": "h3ni13w",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1625118532.0
        },
        {
          "id": "h3pu6mz",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1625167414.0
        },
        {
          "id": "h3wb8aq",
          "author": "AzMateo42069",
          "body": "when you speak of recovery, what did you do?  counseling?",
          "created_utc": 1625295355.0
        }
      ]
    }
  ]
}