{
  "id": "oc6tq1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1625219329.0,
  "title": "Request: I'm afraid to see a therapist because I'm afraid I'll be committed",
  "selftext": " \n\nI'll start by saying I'm already in contact with a therapist's office and waiting for them to get back to me once my insurance is processed. It's been two days now, so I'm going to call them tomorrow, because I think this might be the beginning of something I need to catch early.\n\nI've always had body-image issues. I grew up with a father that made comments on my weight very often, even though I was never overweight as a child. I'm in my early twenties now, and overweight, and every time I come home, he comments in some way. Usually it's a comment on when/how much I'm eating. A few years ago, when I was a teenager, I started restricting under the recommended minimum. I stopped because I was recovering from an alcohol addiction and wanted to be honest about every aspect of my life. I've tried to lose weight more times than I count, and every time it ends in me giving up on the calorie counting and binging, sometimes for long periods, which has contributed to my weight gain. I'm told by my friends and men that \"it suits me\" and that they don't think I need to lose weight, but I cannot stop equating \"skinny\" with \"pretty.\" But, more than that, now that I think about it. Worthy.\n\nSo, it started with that cycle again, just me deciding to count calories, but within the recommended range. And then I saw a pro-ED Tiktok, and then I sought out that kind of content, and started restricting far too much again. I've had physical symptoms now and it's scaring me. The thing that's scaring me the most is that I have tried to stop, and I can't. Now, the thought of food honestly fills me with dread. It truly feels easier to just be hungry than eat. I have done well these past two days, meeting the recommended minimum. I have a friend that's been checking in with me. The weird thing that's helped with it is intermittent fasting. It's like if I tell myself, \"Okay, you have to eat, and you have to eat enough, but only in this 8 hour period,\" it's doable, at least for now. But I'm terrified of what I might lower myself to tomorrow.\n\nSo I finally called a therapist. The thing is, I'm really afraid to be honest with her. I'm graduating college in a year, and it's been rough ride for me. I've been hospitalized for depression several times, and although I'm grateful that those inpatient stays saved my life, they did disrupt my life, especially my academic life. I can't bear the thought of losing what I've worked so hard for (to clarify, I'm taking classes right now to graduate on time). If I tell her how low I've been restricting (I'm trying not to use numbers, and I'm sorry if I'm getting too specific with what I have said), I'm afraid that she'll IVC me. I'm not underweight, again, I'm actually a good bit overweight, and I can't see any emergent symptoms right now - I also am not having any suicidal ideations.\n\nI'm sorry, because I think I'm partially coming here for validation. I feel like I can't have an eating disorder because I'm overweight. I know if I were to tell my family, they would tell me that I'm ruining everything I've almost lost before, and the thing that kills me is I KNOW I am. I know why I shouldn't be doing this, and I'm still doing it. I ate enough today and yesterday, but I'm still spending so much time on those sites. And I still feel pretty when I'm hungry while I'm fasting. This is something, much like alcohol (which I haven't consumed in three years), I just don't think I know how to fix on my own. If I'm told that she probably will commit me, honestly, that's fine. I'll go and I'll be honest anyway, because I have to be alive to graduate. I just would like to know what to expect. It's also good motivation, in a macabre way, to eat enough in the days leading up to meeting with her. Any suggestions people have that have worked for them to get themselves to eat are more than welcome. I want to eat, I do, I'm just afraid of it. I'm thinking of calling my best friend and asking if I could send her my calorie counts at the end of each day for accountability, but I don't know if that's crossing boundaries too much - I don't want to make someone else feel responsible for my safety. She's a sweetheart and I know she'd say yes but I don't want to be codependent with her. I'm just trying to think of ways to stay safe until I can get some help, and I don't know that fasting is the right way to do it. That could spiral, too.\n\nSorry, this has gone on forever.\n\nTL;DR - I'm going to a therapist about restricting my intake too low and I'm afraid she'll IVC me. I'm asking for experience on getting yourself to eat when you're afraid to do so, and also wondering if fasting could put me in more danger even though it's helping right now.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/oc6tq1/request_im_afraid_to_see_a_therapist_because_im/",
  "score": 40,
  "num_comments": 7,
  "comments": [
    {
      "id": "h3svm64",
      "author": "dredged_dm",
      "body": "Firstly, congrats in your battle to go from alcohol addiction to sober for 3 years! That's a serious accomplishment! \n\nIt's my understanding that IVC is only used if you present a danger to yourself or others. If, as you said, you don't have any suicidal ideation you should be fine. \n\nIf you're looking for habits to try to help you eat regularly the best I can do is tell you what worked for me. I started eating really bland food, rice pudding being a big one, that really helped fight off the feeling of how gross eating made me feel. \n\nAs for the intermittent fasting, if it is helping you eat more and more orderly then stick to it. Eating at the same times every day can really help.\n\nAlso don't feel guilty for seeking validation from time to time. Humans are social creatures, so we need it every once in a while. I'm sure you are a beautiful person and I hope the therapist is able to break that \"skinny = pretty\" thought pattern so you can see yourself for the pretty person you are right now.",
      "created_utc": 1625232257.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h3t2u4r",
      "author": "None",
      "body": "They definitely won't. Unless you are in danger of killing yourself or others. I was in therapy for years with an eating disorder. I also self injured and was worried if I talked about cutting myself then I would be committed. My therapist said it's really not that easy, the therapist has to be very sure that if they let you go home, you may end your life (or be a danger to someone else).",
      "created_utc": 1625235652.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h3schwk",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1625219329.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3u3zu9",
      "author": "ThrowRA078965",
      "body": "Hi! It’s OP. Thank you so much for your encouragement ❤️ I know that since I’ve done this with alcohol, I can recover from this too! 😊 I’m doing pretty well. I’ve eaten the recommended minimum for the past four days, including today, but I’m confident I’ll get there by the end of the day. I also told my parents and they took it seriously and were supportive, and didn’t say any of those things I was afraid they’d say. I’m sending my mom a screenshot of my calories each night, which is helping. I’ve been tempted to lie, but I can’t bring myself to, so that’s good. It’s helped me push past that temptation to go back too low.\n\nDid you find your appetite shrank when you started eating more? I just got a “You Pick 2” from Panera, some mac and cheese and a salad with a fruit cup, and I had force myself to finish the mac and the salad and couldn’t even do the fruit cup. I used to be able to eat everything, and usually I’d get a baguette instead of fruit. It feels like my stomach has shrunk 😅 It’s been easier for me to just eat two calorie-dense meals a day to eat my minimum, but maybe I should try splitting it up a bit more.",
      "created_utc": 1625251033.0,
      "score": 3,
      "context": [
        {
          "id": "h3svm64",
          "author": "dredged_dm",
          "body": "Firstly, congrats in your battle to go from alcohol addiction to sober for 3 years! That's a serious accomplishment! \n\nIt's my understanding that IVC is only used if you present a danger to yourself or others. If, as you said, you don't have any suicidal ideation you should be fine. \n\nIf you're looking for habits to try to help you eat regularly the best I can do is tell you what worked for me. I started eating really bland food, rice pudding being a big one, that really helped fight off the feeling of how gross eating made me feel. \n\nAs for the intermittent fasting, if it is helping you eat more and more orderly then stick to it. Eating at the same times every day can really help.\n\nAlso don't feel guilty for seeking validation from time to time. Humans are social creatures, so we need it every once in a while. I'm sure you are a beautiful person and I hope the therapist is able to break that \"skinny = pretty\" thought pattern so you can see yourself for the pretty person you are right now.",
          "created_utc": 1625232257.0
        }
      ]
    },
    {
      "id": "h3ubotp",
      "author": "dredged_dm",
      "body": "It's amazing that your parents support you! The road to recovery is so much easier just knowing you have people who support you. \n\nYeah my appetite felt like it had shrunk everytime I got back to eating more. But the good news is that the stomach doesn't actually shrink, so it's just a matter of getting used to eating until you are full. As long as you hit your minimum, feel free to stop when you feel full. Just give yourself enough time and you'll find it easier and easier to hit that minimum, or at least that's how it was for me. \n\nWhatever strategy works for you (and your doctor) is the one you should stick to. But if you want to try snacking over meals, give it a shot, that's the tactic I used to recover.",
      "created_utc": 1625254352.0,
      "score": 3,
      "context": [
        {
          "id": "h3svm64",
          "author": "dredged_dm",
          "body": "Firstly, congrats in your battle to go from alcohol addiction to sober for 3 years! That's a serious accomplishment! \n\nIt's my understanding that IVC is only used if you present a danger to yourself or others. If, as you said, you don't have any suicidal ideation you should be fine. \n\nIf you're looking for habits to try to help you eat regularly the best I can do is tell you what worked for me. I started eating really bland food, rice pudding being a big one, that really helped fight off the feeling of how gross eating made me feel. \n\nAs for the intermittent fasting, if it is helping you eat more and more orderly then stick to it. Eating at the same times every day can really help.\n\nAlso don't feel guilty for seeking validation from time to time. Humans are social creatures, so we need it every once in a while. I'm sure you are a beautiful person and I hope the therapist is able to break that \"skinny = pretty\" thought pattern so you can see yourself for the pretty person you are right now.",
          "created_utc": 1625232257.0
        },
        {
          "id": "h3u3zu9",
          "author": "ThrowRA078965",
          "body": "Hi! It’s OP. Thank you so much for your encouragement ❤️ I know that since I’ve done this with alcohol, I can recover from this too! 😊 I’m doing pretty well. I’ve eaten the recommended minimum for the past four days, including today, but I’m confident I’ll get there by the end of the day. I also told my parents and they took it seriously and were supportive, and didn’t say any of those things I was afraid they’d say. I’m sending my mom a screenshot of my calories each night, which is helping. I’ve been tempted to lie, but I can’t bring myself to, so that’s good. It’s helped me push past that temptation to go back too low.\n\nDid you find your appetite shrank when you started eating more? I just got a “You Pick 2” from Panera, some mac and cheese and a salad with a fruit cup, and I had force myself to finish the mac and the salad and couldn’t even do the fruit cup. I used to be able to eat everything, and usually I’d get a baguette instead of fruit. It feels like my stomach has shrunk 😅 It’s been easier for me to just eat two calorie-dense meals a day to eat my minimum, but maybe I should try splitting it up a bit more.",
          "created_utc": 1625251033.0
        }
      ]
    },
    {
      "id": "h3uut9n",
      "author": "houston_veronica",
      "body": "Hey OP, you are SO brave and so honest. Keep this up! You actually are slaying this process, even though it seems like it's herculean. You are able to conquer this beast, and you have all the right tools. I love how honest you are about your desire to lie, but you still did not - that is awesome. (And ED's are known to be totally lie-driven, so you are not unusual! You just win a war every time you opt for honesty, and that is commendable.) Also, I love that you are practical and go for things like P's \"You Pick Two\" - that is a great choice. I can't comment on things like caloric needs, but the fact that you will MAKE yourself try -- is HUGE. Keep trucking, don't let anything hurt or stop you. And yes, ITA with everyone else - you are not going to be IVC'd, for many reasons IMO...you have a healthy view of reality, for one, and that is remarkable. \nYou deserve help; please, please take advantage of any/all resources, and don't be afraid to be picky. Find a team that works hard to get you to a healthier place, and by that, I mean gives you all the support you need to leave this thing in the dust. You're amazing.",
      "created_utc": 1625262975.0,
      "score": 3,
      "context": [
        {
          "id": "h3svm64",
          "author": "dredged_dm",
          "body": "Firstly, congrats in your battle to go from alcohol addiction to sober for 3 years! That's a serious accomplishment! \n\nIt's my understanding that IVC is only used if you present a danger to yourself or others. If, as you said, you don't have any suicidal ideation you should be fine. \n\nIf you're looking for habits to try to help you eat regularly the best I can do is tell you what worked for me. I started eating really bland food, rice pudding being a big one, that really helped fight off the feeling of how gross eating made me feel. \n\nAs for the intermittent fasting, if it is helping you eat more and more orderly then stick to it. Eating at the same times every day can really help.\n\nAlso don't feel guilty for seeking validation from time to time. Humans are social creatures, so we need it every once in a while. I'm sure you are a beautiful person and I hope the therapist is able to break that \"skinny = pretty\" thought pattern so you can see yourself for the pretty person you are right now.",
          "created_utc": 1625232257.0
        },
        {
          "id": "h3u3zu9",
          "author": "ThrowRA078965",
          "body": "Hi! It’s OP. Thank you so much for your encouragement ❤️ I know that since I’ve done this with alcohol, I can recover from this too! 😊 I’m doing pretty well. I’ve eaten the recommended minimum for the past four days, including today, but I’m confident I’ll get there by the end of the day. I also told my parents and they took it seriously and were supportive, and didn’t say any of those things I was afraid they’d say. I’m sending my mom a screenshot of my calories each night, which is helping. I’ve been tempted to lie, but I can’t bring myself to, so that’s good. It’s helped me push past that temptation to go back too low.\n\nDid you find your appetite shrank when you started eating more? I just got a “You Pick 2” from Panera, some mac and cheese and a salad with a fruit cup, and I had force myself to finish the mac and the salad and couldn’t even do the fruit cup. I used to be able to eat everything, and usually I’d get a baguette instead of fruit. It feels like my stomach has shrunk 😅 It’s been easier for me to just eat two calorie-dense meals a day to eat my minimum, but maybe I should try splitting it up a bit more.",
          "created_utc": 1625251033.0
        }
      ]
    },
    {
      "id": "h3uz0k3",
      "author": "ThrowRA078965",
      "body": "Thank you so much, this is so meaningful to me ❤️ I’m pretty much bribing myself to get to my minimum tonight with my favorite buttered popcorn. Not the “healthiest,” but it works for now 😂",
      "created_utc": 1625265074.0,
      "score": 2,
      "context": [
        {
          "id": "h3svm64",
          "author": "dredged_dm",
          "body": "Firstly, congrats in your battle to go from alcohol addiction to sober for 3 years! That's a serious accomplishment! \n\nIt's my understanding that IVC is only used if you present a danger to yourself or others. If, as you said, you don't have any suicidal ideation you should be fine. \n\nIf you're looking for habits to try to help you eat regularly the best I can do is tell you what worked for me. I started eating really bland food, rice pudding being a big one, that really helped fight off the feeling of how gross eating made me feel. \n\nAs for the intermittent fasting, if it is helping you eat more and more orderly then stick to it. Eating at the same times every day can really help.\n\nAlso don't feel guilty for seeking validation from time to time. Humans are social creatures, so we need it every once in a while. I'm sure you are a beautiful person and I hope the therapist is able to break that \"skinny = pretty\" thought pattern so you can see yourself for the pretty person you are right now.",
          "created_utc": 1625232257.0
        },
        {
          "id": "h3u3zu9",
          "author": "ThrowRA078965",
          "body": "Hi! It’s OP. Thank you so much for your encouragement ❤️ I know that since I’ve done this with alcohol, I can recover from this too! 😊 I’m doing pretty well. I’ve eaten the recommended minimum for the past four days, including today, but I’m confident I’ll get there by the end of the day. I also told my parents and they took it seriously and were supportive, and didn’t say any of those things I was afraid they’d say. I’m sending my mom a screenshot of my calories each night, which is helping. I’ve been tempted to lie, but I can’t bring myself to, so that’s good. It’s helped me push past that temptation to go back too low.\n\nDid you find your appetite shrank when you started eating more? I just got a “You Pick 2” from Panera, some mac and cheese and a salad with a fruit cup, and I had force myself to finish the mac and the salad and couldn’t even do the fruit cup. I used to be able to eat everything, and usually I’d get a baguette instead of fruit. It feels like my stomach has shrunk 😅 It’s been easier for me to just eat two calorie-dense meals a day to eat my minimum, but maybe I should try splitting it up a bit more.",
          "created_utc": 1625251033.0
        },
        {
          "id": "h3uut9n",
          "author": "houston_veronica",
          "body": "Hey OP, you are SO brave and so honest. Keep this up! You actually are slaying this process, even though it seems like it's herculean. You are able to conquer this beast, and you have all the right tools. I love how honest you are about your desire to lie, but you still did not - that is awesome. (And ED's are known to be totally lie-driven, so you are not unusual! You just win a war every time you opt for honesty, and that is commendable.) Also, I love that you are practical and go for things like P's \"You Pick Two\" - that is a great choice. I can't comment on things like caloric needs, but the fact that you will MAKE yourself try -- is HUGE. Keep trucking, don't let anything hurt or stop you. And yes, ITA with everyone else - you are not going to be IVC'd, for many reasons IMO...you have a healthy view of reality, for one, and that is remarkable. \nYou deserve help; please, please take advantage of any/all resources, and don't be afraid to be picky. Find a team that works hard to get you to a healthier place, and by that, I mean gives you all the support you need to leave this thing in the dust. You're amazing.",
          "created_utc": 1625262975.0
        }
      ]
    }
  ]
}