{
  "id": "od0s9e",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1625328037.0,
  "title": "Request: What should be avoided by therapists?",
  "selftext": " \n\n&#x200B;\n\nI’m a therapist and starting to learn about treating eating  disorders. As I work with my supervisor before working with people on my  own, I’m also curious to get feedback from people who struggle with ED.  What are some basic dos or don’ts for therapists working ED? For  example: is it a big no-no to have someone keep a food log? Or is it  helpful under certain circumstances? What was helpful when seeing a  therapist? Or what was something cringeworthy during therapy?\n\nThank you for taking the time to enlighten me. I don’t work with  clients with ED yet but have found many young teen clients that seem to  be skirting around the potential (hence my process for professional  growth as a therapist).",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/od0s9e/request_what_should_be_avoided_by_therapists/",
  "score": 54,
  "num_comments": 78,
  "comments": [
    {
      "id": "h3xxiyp",
      "author": "Twigsintheforest",
      "body": "For the love of god don't ever say anything along the lines of \"you don't look like you have an ED\" or assume the patient is doing better because they ate something high calorie/something that isn't a singular rice cake. I know so many people, including me, that have given up on therapy/recovery because of things like that. It's almost guaranteed to make them feel \"not sick enough\" and go back to their disorder or even actively make it worse as a result.\n\nI agree that keeping a log is only good for a few days to get a feel for their eating habits and establish concrete goals but I'd only do it between two sessions and then stop so the focus is taken away from the numbers, they'll do that by themselves anyway. What's helped me is reassurance that what I'm doing is good and right when I manage to eat but not being pressured to do things I'm not comfortable with and see every meal as my decision and if I can't do it I can try again next time without feeling like I'm disappointing my therapist.",
      "created_utc": 1625335435.0,
      "score": 57,
      "context": []
    },
    {
      "id": "h3y6nj0",
      "author": "HubbyHasBlueBalls",
      "body": "1. Trust between client and therapist. I refuse to work with ED treatment professionals anymore. I’m not manipulative, I try really hard to be honest, and I fight really hard to gain the trust of the people around me. Yet, I find that the narrative around eating disorder clients is that they can’t be trusted. As a result, I put in tons of effort to prove I’m honest, but treatment professionals have already put on the label before they’ve even met me and their opinion never changes. It’s created a lot of situations where I genuinely needed to be trusted and believed, and instead my feelings/emotions/and genuine needs were ignored and dismissed. Eventually, you stop advocating for yourself, because speaking up and being ignored hurts more than never speaking in the first place. It only reaffirms it that I’m only seen as a mental illness and not a person. \n\n2. Inpatient/ residential treatment has a lot of flaws. It saves lives and helps many. But there are also many others who are traumatized by the experience, and feel the experience was harmful/ detrimental to their long term recovery. Trust issues with professionals after this becomes a big issue even when clients really want help. Use higher levels of care judiciously, and understand that it isn’t this glorified solution that only leads to positive gains for everyone who steps through their care.\n\n3. Treat your adults like adults and not like children.\n\n4. ED treatment is often coercive, that’s absolutely not going to fly with your clients who have trauma histories. Make sure you have a firm understanding of trauma informed care. Not all ED patients have trauma, but statistically speaking many of us do. \n\n5. I’ve found that the whole, “You can’t get anything out of therapy if you aren’t well nourished” to be inaccurate. At a certain weight/ daily calorie intake, this may be true, but don’t underestimate what your clients are capable of accomplishing. If they can get straight A’s in class, they can get something out of your therapy too. \n\n6. The idea that the eating disorder needs to be fully addressed and treated before dealing with any other mental health issue is one I struggle with greatly. My ED is a way to cope with PTSD symptoms. Learning to cope with the ptsd symptoms and process trauma decreased my need to depend on my ED to function. It was the greatest factor in my recovery process. When I went to residential, they took the approach of only treating the ED, and it was horribly ineffective and retraumatizing. It’s taken an additional two years of trauma therapy and EMDR because residential treatment itself was so traumatic…..outside of temporary weight restoration, it made every aspect of recovery much more difficult. Try recovering from an eating disorder when anything and everything that even remotely reminds you of treatment/ recovery triggers flashbacks.",
      "created_utc": 1625340241.0,
      "score": 33,
      "context": []
    },
    {
      "id": "h3y8u7l",
      "author": "FoxiiFighter",
      "body": "Stay in your lane - you should be very careful with things like food logs and meal plans unless you are tag teaming with an RD that specializes in ED's. Depending how you use the information, you could wind up inadvertently putting something in the person's head that could lead to exacerbated ED behaviors. Don't make your patients keep a food log unless you damn well know what you plan to do with that information. And unless you have formal dietetics training, you should not be doing ANYTHING that looks like suggesting foods or meal plans, etc (if you're in the U.S., this could put you on the path to be sued). \n\nI feel like there should be some professional development classes, etc that your supervisor should work with you on to get a base knowledge of all eating disorders. \n\nOne thing I will say, that I wish all up-and-coming therapists understand: Not everyone in the ED community is comfortable with HAES or Body Positivity for a lot of reasons. Not everyone's eating disorder is rooted in some sort of systematic fat-phobia. (ie - don't make a patient feel guilty for not wanting their body to be a certain size -- examine the hell of out it to find the why, but a lot of HAES-recovery teams use this guilt tactic).  Educate yourself on what HAES and Body Positivity are,  but understand that many sufferers (especially those who've had a few therapists, hospital stays, etc), will be very resistant due to previous exposure.",
      "created_utc": 1625341391.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h3xzltv",
      "author": "Discalced-diapason",
      "body": "For the nutrition piece, it would be really helpful to collaborate with and refer to a registered dietician who has experience with treating eating disorders. Most of my ED therapists focus more on the emotional side of things and left most of the intake/nutrition for the RD. \n\nAs far as food logs go, it can be really helpful for some people and detrimental to others. I’m in the latter camp, because even if I weren’t logging calories, it feels too close to calorie counting apps.",
      "created_utc": 1625336549.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h3xtnp7",
      "author": "allsevenpetals",
      "body": "I kept a food log just for a couple days towards the beginning of my treatment but it wasn't so much about the food, we had to document what we felt when we ate. It also gives a good idea for where to start goal wise; having breakfast at least 2 times a week, trying to eat dinner every day, etc. Measureable and achievable goals. It's ok for a small amount of time but I don't think it would be good long term since it'll keep us focused on what we're eating.",
      "created_utc": 1625333416.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h3xua9m",
      "author": "libismanaged",
      "body": "when i started seeing my new therapist for my ED i was very open about my struggles with b/ping i was having and she said she was going to call my boyfriend (emergency contact) because i was a threat to myself. i lost all trust in her right then and there. she also kept pushing me into explaining myself and my actions despite me saying i had to cut our session short as i had the flu & knew i shouldn't have even gone to our session bc of it. it made me feel trapped. \njust general comments on my appearance also made me hella uncomfortable and just saying, \"I'm sure that goes for a lot of people\" to almost every emotion I'd tell her especially during quarantine last year.",
      "created_utc": 1625333736.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h3xz2w0",
      "author": "None",
      "body": "When I tried to speak to a counsellor (not the same, but it works) about my ED, she immediately wanted me to tell my parents and threatened to call the police if I didn't let them speak to my parents because I was a threat to myself. This was the first day I've spoken to this woman. Rlly put me off of sharing stuff and gave me trust issues",
      "created_utc": 1625336271.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h3y1pux",
      "author": "edie43",
      "body": "I think being educated on the different kinds of EDs is very important. Bine eating disorder and bulimia is a lot more common than people think and having a therapist who acknowledged that and knew what she was talking about was honestly such a relief when I first started getting treatment. \n\nIn the beginning I was asked to have a food journal and that honestly was a good resource for me. I would write down what I ate and what I felt while eating, no focus on calories or anything and no judgement when we went through the journal. \n\nAlso, I am very thankful that my therapist never mentions my weight in any way unless I bring it up. The focus is entirely on my mind and it’s very refreshing that I can work on healing in an environment that doesn’t make me feel judged for my body.",
      "created_utc": 1625337661.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h3xxzz5",
      "author": "una_verdadera_lata",
      "body": "As someone who also did their graduate work in counseling (and also has an ED) I would focus on honing/focusing on your preferred modality as a clinician rather than “what works for ED clients.“ my most successful relationships have been with therapists whose modalities work with my world view because there isn’t really a blanket “this is what works for EDs“ as every clients experience of their ED is different. Meet your clients where they are, and they will let you know what works and what doesn’t.",
      "created_utc": 1625335685.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h3xu27f",
      "author": "Small_Turtle14",
      "body": "Please make sure you're weight inclusive and never tell your client \"don't worry I won't let you get fat\" even if that's your client's biggest fear. \nI think meal plans at first is a good idea only if your client isn't in tune with their hunger cues, but the end goal should be intuitive eating of course.\nAll-in would be my second best approach (in my opinion).\nGood luck with everything",
      "created_utc": 1625333623.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h3y0wps",
      "author": "dlewark",
      "body": "Dont automatically assume that trauma or some other source specifically caused an ED. Grilling the patient to come up with something that was traumatic makes things worse.",
      "created_utc": 1625337241.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3y6lj0",
      "author": "600lbGoldfish",
      "body": "My therapist asked me to shake my arms out to relieve stress but I couldn’t do it because all I could think of was how my arms were shaking around, so just being conscious of body movement being difficult for some people. I told her about this and she actually thanked me a said knowing that made her a better therapist for her patients so it was all good",
      "created_utc": 1625340212.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3yvina",
      "author": "iamspeaking77",
      "body": "downplaying the seriousness of an eating disorder if the patient doesn’t “look” sick or meet the diagnostic criteria. this happened to me many times by medical professionals.",
      "created_utc": 1625353831.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3yxouk",
      "author": "Maggiemaccy",
      "body": "When someone overcomes an eating disorder or is in recovery there’s an expectation that they’re never allowed to have body issues again, never allowed to feel negatively about their body, not allowed to have any form of body goals or fitness goals. \n\nI struggled with this during recovery. Fact remains I was still a woman in my early 20s entitled to feelings around my body just like everyone else. Recovery came with the expectation that I would now accept my body in a way that isn’t expected of anyone else, otherwise I ‘wasn’t really recovering’. In reality everyone carries body and image issues, it’s an unfair expectation to place on someone to ‘get over’ that and be perfectly accepting of themselves 100% of the time and I believe pushing this really just forces those in recovery to shut up about it. \n\nI think that’s important to note.",
      "created_utc": 1625355119.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h3xwm4z",
      "author": "inutilities",
      "body": "I've been to therapy for more than 10 years, seeing different kinds if therapists for my ED. A REALLY annoying thing is that they always started asking about my family situation and tried to dig deep to find some trauma in my childhood. In the beginning it was ok but like, I'm done discussing my family, I have the ED, I've had it for a looong time, and I need your help with it. I would have wanted concrete tips about nutrition; what do I actually need to eat daily to get healthy. F*** the \"you have to eat breakfast, lunch, dinner\" I'd rather learn to listen to my body and my emotions, f.e what triggers I have, what am I trying to solve with starving, how can I deal with my issues / problems in a healthy way. I would want concrete tips and tricks based upon my own life, capabilities, possibilities... hope this helps. EDIT: I'm 38 yo.",
      "created_utc": 1625334953.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h3ya5ge",
      "author": "KryptonionNipple",
      "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
      "created_utc": 1625342077.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3yjm4x",
      "author": "thats_scrummy",
      "body": "Biggest thing to remember, like someone mentioned above, is that not all eating disorders are the same. There’s anorexia, binge eating, bulimia, binge/purge, exercise bulimia, etc and different severities. For example, I am a binger/calorie restrictor and after trying several different things with my therapist she said she thought that my issue was a food/eating addiction. I’m now a member of Overeaters Anonymous which I didn’t even know was a thing until I googled “community for food addicts”. It’s also a home for all kinds of eating disorders. Many people don’t know about it - I didn’t, and neither did my therapist. But it has been the BIGGEST help. I call OA, therapy, and my nutritionist my Holy Trinity.",
      "created_utc": 1625347116.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3ytbcl",
      "author": "Caactiii",
      "body": "From my personal experience, and part of the reason I stopped seeing a therapist:\n\nIf your client confides in you that they're struggling with food and have been for a while (or haven't, length shouldn't matter) do not dismiss them. I told my therapist I purposefully restricted intake in a hopes of getting better. My therapist asked me \"how would you feel if you were fat?\" And I didn't know how to reply. That therapist never brought up my food issues again, and I still struggle to this day. Just because your client doesn't show physical symptoms of an eating disorder doesn't mean they aren't struggling. Don't dismiss someone finally being able to say something they haven't been able to say for years.",
      "created_utc": 1625352546.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3ywvtf",
      "author": "windysydney",
      "body": "Don’t make any assumptions about anyone’s eating disorder. I once met a therapist who just assumed I struggled with BED because I was overweight at the time. I was actually struggling with bulimia and was so humiliated that I couldn’t even correct her. Don’t be that person.",
      "created_utc": 1625354647.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3zmi3t",
      "author": "courtenax",
      "body": "Jennifer Rollin has training courses! She’s a specialised therapist who also went through the it herself.  Highly highly recommend.\n\nLook into what diet culture is as I think that helps see how SO MANY things that have become part of our every day life and language and can be immensely triggering.\n\nGet the ED voice to trust you.  understanding personal history has been helpful for me, everyone is so different and thereasons EDs develop vary significantly.  It’s helped me to look for what purposes it serves. It helps me feel safe that my therapist never ever pushes me if we find that it’s still serving one or more those purposes (I also have trauma history and PTSD), she only encourages me challenge/process the root causes (note: I’m also in the beginning stages of this, it’s been almost a year since I’ve been slowly accepting that I even have an ED.)\n\nBefore I started seeing her I had to have a standing appointment with a nutritionist as a requirement, she doesn’t handle specific nutrition or physical health at all but is a part of my team.  The most important part right now because I don’t trust any of the other ones yet haha - if someone were to ask me to log food I’d FREAK out, the thought makes me immediately so ashamed of my intake and want to restrict even more",
      "created_utc": 1625370651.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3zz6h4",
      "author": "Vessecora",
      "body": "I'll share a bad experience I had as an example of something that should be avoided: I'd been seeing a psychologist for a few years and finally decided to tackle the eating disorder. She referred me to a dietitian who specialises in eating disorders, which was great. But after a few sessions with the dietitian I went back to my psychologist for a regular session and she told me I looked like I was doing well: that I had 'slimmed' down in the face....\n\nLike... Holy hell that was a bad comment to make. I had been swinging between restriction and bingeing for some time and I could feel the urge to restrict really hard after my eating disorder heard validation. Not healthy at all! Luckily I had already been trying to heal before the dietitian appointments. I can't imagine how bad it would have been if I hadn't been so far in my recovery.\n\nI brought it up with the dietitian who said she would education my psychologist and there haven't been any hints of that sort of thinking since.",
      "created_utc": 1625380351.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h40796p",
      "author": "CaregiverNo2642",
      "body": "As a therapist, never give up on your clients and see the ed as the symptom not the core problem.respect and trust the client to make changes when they are ready",
      "created_utc": 1625387817.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h409x74",
      "author": "CaregiverNo2642",
      "body": "If it's of help for the self harming aspect I usually suggest a staying alive contract between us throughout the sessions and develop trust but the key thing is not to give up on your client. Explore how the client is processing Thier issue moreso than the content",
      "created_utc": 1625390455.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h3xj6kf",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1625328037.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h3y3juf",
      "author": "Haunting-Elephant618",
      "body": "Thank you!! This aligns with my current approach to therapy anyway, so it’s helpful to hear that many of my approaches will be helpful. ED is definitely a new area for me as I could see myself slipping and saying something I think is reassuring but is inadvertently triggering for someone and I want to avoid that. The last thing I want is to be unhelpful. I do often have that conversation with my clients (non ED), that if I say something that’s upsetting to please tell me! This way it can be talked through and I can do better, I’m human and I know I’ll make mistakes, but I want to learn from those mistakes.",
      "created_utc": 1625338613.0,
      "score": 11,
      "context": [
        {
          "id": "h3xxiyp",
          "author": "Twigsintheforest",
          "body": "For the love of god don't ever say anything along the lines of \"you don't look like you have an ED\" or assume the patient is doing better because they ate something high calorie/something that isn't a singular rice cake. I know so many people, including me, that have given up on therapy/recovery because of things like that. It's almost guaranteed to make them feel \"not sick enough\" and go back to their disorder or even actively make it worse as a result.\n\nI agree that keeping a log is only good for a few days to get a feel for their eating habits and establish concrete goals but I'd only do it between two sessions and then stop so the focus is taken away from the numbers, they'll do that by themselves anyway. What's helped me is reassurance that what I'm doing is good and right when I manage to eat but not being pressured to do things I'm not comfortable with and see every meal as my decision and if I can't do it I can try again next time without feeling like I'm disappointing my therapist.",
          "created_utc": 1625335435.0
        }
      ]
    },
    {
      "id": "h3y7wl5",
      "author": "sweetbird26",
      "body": "Oh my goodness, yes. This.",
      "created_utc": 1625340903.0,
      "score": 4,
      "context": [
        {
          "id": "h3y6nj0",
          "author": "HubbyHasBlueBalls",
          "body": "1. Trust between client and therapist. I refuse to work with ED treatment professionals anymore. I’m not manipulative, I try really hard to be honest, and I fight really hard to gain the trust of the people around me. Yet, I find that the narrative around eating disorder clients is that they can’t be trusted. As a result, I put in tons of effort to prove I’m honest, but treatment professionals have already put on the label before they’ve even met me and their opinion never changes. It’s created a lot of situations where I genuinely needed to be trusted and believed, and instead my feelings/emotions/and genuine needs were ignored and dismissed. Eventually, you stop advocating for yourself, because speaking up and being ignored hurts more than never speaking in the first place. It only reaffirms it that I’m only seen as a mental illness and not a person. \n\n2. Inpatient/ residential treatment has a lot of flaws. It saves lives and helps many. But there are also many others who are traumatized by the experience, and feel the experience was harmful/ detrimental to their long term recovery. Trust issues with professionals after this becomes a big issue even when clients really want help. Use higher levels of care judiciously, and understand that it isn’t this glorified solution that only leads to positive gains for everyone who steps through their care.\n\n3. Treat your adults like adults and not like children.\n\n4. ED treatment is often coercive, that’s absolutely not going to fly with your clients who have trauma histories. Make sure you have a firm understanding of trauma informed care. Not all ED patients have trauma, but statistically speaking many of us do. \n\n5. I’ve found that the whole, “You can’t get anything out of therapy if you aren’t well nourished” to be inaccurate. At a certain weight/ daily calorie intake, this may be true, but don’t underestimate what your clients are capable of accomplishing. If they can get straight A’s in class, they can get something out of your therapy too. \n\n6. The idea that the eating disorder needs to be fully addressed and treated before dealing with any other mental health issue is one I struggle with greatly. My ED is a way to cope with PTSD symptoms. Learning to cope with the ptsd symptoms and process trauma decreased my need to depend on my ED to function. It was the greatest factor in my recovery process. When I went to residential, they took the approach of only treating the ED, and it was horribly ineffective and retraumatizing. It’s taken an additional two years of trauma therapy and EMDR because residential treatment itself was so traumatic…..outside of temporary weight restoration, it made every aspect of recovery much more difficult. Try recovering from an eating disorder when anything and everything that even remotely reminds you of treatment/ recovery triggers flashbacks.",
          "created_utc": 1625340241.0
        }
      ]
    },
    {
      "id": "h3yn9ai",
      "author": "Haunting-Elephant618",
      "body": "Wow!! So much good information! Thank you! Just to follow up on your points. \n\n1. I’m sorry you experienced professionals who added to trust issues and made assumptions. I already work with a variety of MH areas and I find this happens in many areas, unfortunately. I will definitely keep this in mind with ED as well, no 2 people are the same and no 2 presentations of ED is going to be the same. And you are not your mental illness. You’re a person, with complexities, like anyone else. \n\n2. Holy guacamole, this is definitely true for all inpatient/residential placements. I’ve worked in so many environments and have seen the best and the worst, even in one facility. Like you said, for some it’s life saving, others it’s traumatic. \n\n3. Does this really happen?! Don’t answer that, it does. I’ve seen it. I want to slap those people. \n\n4. Excellent point!! I am trauma informed care trained. For many years at this point and this is something I’ve been able to adopt into my practice. An excellent reminder though and what people with ED may experience with other therapists. \n\n5. Oof. A lot to unpack there. And not in regards to you, but that statement in general. Even with in the learning stages of treating ED, that statement triggers me on many levels. Therapists need to give people more credit than that. \n\n6. I may be in the learning stages, but I’m general, co-morbidities are so common in MH. Sometimes a certain area needs to be focused on and sometimes it’s working on everything at one time as they all become intertwined. For example, ADHD can often create depression and anxiety in those who are struggling with symptoms, understandable the connection between them is important. And some days depression may be the primary focus, other days time management. I’m so sorry your recovery process creates additional things to work on. I’m glad EMDR was helpful for trauma, it’s such an amazing therapeutic approach!! That may be my next endeavor, but one thing at a time. I tend to overextend myself and want to do it all (something I talk to my own therapist about as it’s often to my own detriment). \n\nHope you’re doing well in your recovery! And thank you for so much valuable information!!",
      "created_utc": 1625349105.0,
      "score": 5,
      "context": [
        {
          "id": "h3y6nj0",
          "author": "HubbyHasBlueBalls",
          "body": "1. Trust between client and therapist. I refuse to work with ED treatment professionals anymore. I’m not manipulative, I try really hard to be honest, and I fight really hard to gain the trust of the people around me. Yet, I find that the narrative around eating disorder clients is that they can’t be trusted. As a result, I put in tons of effort to prove I’m honest, but treatment professionals have already put on the label before they’ve even met me and their opinion never changes. It’s created a lot of situations where I genuinely needed to be trusted and believed, and instead my feelings/emotions/and genuine needs were ignored and dismissed. Eventually, you stop advocating for yourself, because speaking up and being ignored hurts more than never speaking in the first place. It only reaffirms it that I’m only seen as a mental illness and not a person. \n\n2. Inpatient/ residential treatment has a lot of flaws. It saves lives and helps many. But there are also many others who are traumatized by the experience, and feel the experience was harmful/ detrimental to their long term recovery. Trust issues with professionals after this becomes a big issue even when clients really want help. Use higher levels of care judiciously, and understand that it isn’t this glorified solution that only leads to positive gains for everyone who steps through their care.\n\n3. Treat your adults like adults and not like children.\n\n4. ED treatment is often coercive, that’s absolutely not going to fly with your clients who have trauma histories. Make sure you have a firm understanding of trauma informed care. Not all ED patients have trauma, but statistically speaking many of us do. \n\n5. I’ve found that the whole, “You can’t get anything out of therapy if you aren’t well nourished” to be inaccurate. At a certain weight/ daily calorie intake, this may be true, but don’t underestimate what your clients are capable of accomplishing. If they can get straight A’s in class, they can get something out of your therapy too. \n\n6. The idea that the eating disorder needs to be fully addressed and treated before dealing with any other mental health issue is one I struggle with greatly. My ED is a way to cope with PTSD symptoms. Learning to cope with the ptsd symptoms and process trauma decreased my need to depend on my ED to function. It was the greatest factor in my recovery process. When I went to residential, they took the approach of only treating the ED, and it was horribly ineffective and retraumatizing. It’s taken an additional two years of trauma therapy and EMDR because residential treatment itself was so traumatic…..outside of temporary weight restoration, it made every aspect of recovery much more difficult. Try recovering from an eating disorder when anything and everything that even remotely reminds you of treatment/ recovery triggers flashbacks.",
          "created_utc": 1625340241.0
        }
      ]
    },
    {
      "id": "h3ydxxy",
      "author": "HubbyHasBlueBalls",
      "body": "Thank you so much for speaking on the haes & body positivity piece. Simply hearing others speak up against that approach is validating.",
      "created_utc": 1625344068.0,
      "score": 7,
      "context": [
        {
          "id": "h3y8u7l",
          "author": "FoxiiFighter",
          "body": "Stay in your lane - you should be very careful with things like food logs and meal plans unless you are tag teaming with an RD that specializes in ED's. Depending how you use the information, you could wind up inadvertently putting something in the person's head that could lead to exacerbated ED behaviors. Don't make your patients keep a food log unless you damn well know what you plan to do with that information. And unless you have formal dietetics training, you should not be doing ANYTHING that looks like suggesting foods or meal plans, etc (if you're in the U.S., this could put you on the path to be sued). \n\nI feel like there should be some professional development classes, etc that your supervisor should work with you on to get a base knowledge of all eating disorders. \n\nOne thing I will say, that I wish all up-and-coming therapists understand: Not everyone in the ED community is comfortable with HAES or Body Positivity for a lot of reasons. Not everyone's eating disorder is rooted in some sort of systematic fat-phobia. (ie - don't make a patient feel guilty for not wanting their body to be a certain size -- examine the hell of out it to find the why, but a lot of HAES-recovery teams use this guilt tactic).  Educate yourself on what HAES and Body Positivity are,  but understand that many sufferers (especially those who've had a few therapists, hospital stays, etc), will be very resistant due to previous exposure.",
          "created_utc": 1625341391.0
        }
      ]
    },
    {
      "id": "h3ypbw0",
      "author": "Haunting-Elephant618",
      "body": "Thank you!!! I’m not only working with my supervisor but spending a lot of time reading, attending webinars/trainings, etc. But I don’t want to just hear from professionals in the field, I want to hear from those in recovery, so tapping into resources like this, following certain people on social media to gain information through various platforms, etc. I’m definitely wanting to make sure I’m not venturing into an unknown lane where I’d be causing more harm than good. The RD suggestion is something I’m going to look into more as it’s been recommended by others as well. And I do want to clarify, I haven’t suggested food logs to anyone, ever. It’s definitely something that even someone who doesn’t have ED could cause problems or even send down a path of ED, the complete opposite of what I’d want. I really just wanted to give an example of something that really could be problematic and if it’s a full stop. \n\nAs for body positivity, there’s also toxic body positivity in that sometimes when someone is trying to be supportive and kind, it invalidates the person’s feelings and experiences. When someone feels uncomfortable about a body feature and all they hear is “you’re beautiful,” sure, great, but that doesn’t change that someone still may not like their nose, legs, whatever. And trying to convince someone otherwise, just isn’t helpful. And HAES, it can have its place, but as with anything else, it’s so individualized with a variety of factors that could be contributing to someone’s perspective or experience (culture, religion, socioeconomic status, underlying medical conditions, etc.). \n\nSorry, went on a bit of a tangent there. Just kind of have some issues with the body positivity movement and how it can actually be toxic and invalidating. I’ve worked in MH a long time and have seen some pretty toxic things that just make me cringe, and that being one of them.\n\nAnyway, thank you so much for your response!!",
      "created_utc": 1625350268.0,
      "score": 3,
      "context": [
        {
          "id": "h3y8u7l",
          "author": "FoxiiFighter",
          "body": "Stay in your lane - you should be very careful with things like food logs and meal plans unless you are tag teaming with an RD that specializes in ED's. Depending how you use the information, you could wind up inadvertently putting something in the person's head that could lead to exacerbated ED behaviors. Don't make your patients keep a food log unless you damn well know what you plan to do with that information. And unless you have formal dietetics training, you should not be doing ANYTHING that looks like suggesting foods or meal plans, etc (if you're in the U.S., this could put you on the path to be sued). \n\nI feel like there should be some professional development classes, etc that your supervisor should work with you on to get a base knowledge of all eating disorders. \n\nOne thing I will say, that I wish all up-and-coming therapists understand: Not everyone in the ED community is comfortable with HAES or Body Positivity for a lot of reasons. Not everyone's eating disorder is rooted in some sort of systematic fat-phobia. (ie - don't make a patient feel guilty for not wanting their body to be a certain size -- examine the hell of out it to find the why, but a lot of HAES-recovery teams use this guilt tactic).  Educate yourself on what HAES and Body Positivity are,  but understand that many sufferers (especially those who've had a few therapists, hospital stays, etc), will be very resistant due to previous exposure.",
          "created_utc": 1625341391.0
        }
      ]
    },
    {
      "id": "h3yi79f",
      "author": "Haunting-Elephant618",
      "body": "That’s good advice! Thank you! And for the food logs, that was my fear, that it be too close to counting calories or lead to counting calories. Maybe it’s case by case for each person, hopefully open dialogue will help to determine who would benefit vs. who it would be detrimental for. Thanks again!!",
      "created_utc": 1625346347.0,
      "score": 3,
      "context": [
        {
          "id": "h3xzltv",
          "author": "Discalced-diapason",
          "body": "For the nutrition piece, it would be really helpful to collaborate with and refer to a registered dietician who has experience with treating eating disorders. Most of my ED therapists focus more on the emotional side of things and left most of the intake/nutrition for the RD. \n\nAs far as food logs go, it can be really helpful for some people and detrimental to others. I’m in the latter camp, because even if I weren’t logging calories, it feels too close to calorie counting apps.",
          "created_utc": 1625336549.0
        }
      ]
    },
    {
      "id": "h3xwjce",
      "author": "Haunting-Elephant618",
      "body": "That’s a really good point. I’m the OP, so I wasn’t sure about food logs possibly becoming problematic. Thanks for the response!",
      "created_utc": 1625334911.0,
      "score": 1,
      "context": [
        {
          "id": "h3xtnp7",
          "author": "allsevenpetals",
          "body": "I kept a food log just for a couple days towards the beginning of my treatment but it wasn't so much about the food, we had to document what we felt when we ate. It also gives a good idea for where to start goal wise; having breakfast at least 2 times a week, trying to eat dinner every day, etc. Measureable and achievable goals. It's ok for a small amount of time but I don't think it would be good long term since it'll keep us focused on what we're eating.",
          "created_utc": 1625333416.0
        }
      ]
    },
    {
      "id": "h3xysiw",
      "author": "Haunting-Elephant618",
      "body": "Yikes! That person sounds overall like they need some additional training. I’m sorry they were so unsupportive.",
      "created_utc": 1625336117.0,
      "score": 3,
      "context": [
        {
          "id": "h3xua9m",
          "author": "libismanaged",
          "body": "when i started seeing my new therapist for my ED i was very open about my struggles with b/ping i was having and she said she was going to call my boyfriend (emergency contact) because i was a threat to myself. i lost all trust in her right then and there. she also kept pushing me into explaining myself and my actions despite me saying i had to cut our session short as i had the flu & knew i shouldn't have even gone to our session bc of it. it made me feel trapped. \njust general comments on my appearance also made me hella uncomfortable and just saying, \"I'm sure that goes for a lot of people\" to almost every emotion I'd tell her especially during quarantine last year.",
          "created_utc": 1625333736.0
        }
      ]
    },
    {
      "id": "h3yscr1",
      "author": "Haunting-Elephant618",
      "body": "Omg! That’s awful! I work with teens who self-harm through cutting and they ask me if I’m going to tell their parents. And especially if they’re age of consent in MH (14 in my state) the answer is “I will only breach confidentiality if you’re suicidal or homicidal and I believe there’s immediate risk. But we’re going to talk about it *together* before anything is done.” And I’ve had that happen, and instead of freaking out (like many newer therapist may) we talk, I obviously assess for plan, means, intent (the usual) and in the end the client and I often call together or if the parent is in the waiting room we’ll invite them to join the session. Sometimes they want me to talk and sometimes they take the lead. Sometimes they text instead of call. It depends on the situation, but I find having a conversation rather than becoming an alarmist not only keeps the rapport, it also helps the teen begin to have more dialogue with their parents. If parents are not supportive, then we may do a contract for safety, create a safety plan together, or contact crisis together if they can’t contract for safety. Panicking doesn’t help anything. And I’d hope that for ED, I’d be taking a similar approach that I used for self-harm.",
      "created_utc": 1625351990.0,
      "score": 3,
      "context": [
        {
          "id": "h3xz2w0",
          "author": "None",
          "body": "When I tried to speak to a counsellor (not the same, but it works) about my ED, she immediately wanted me to tell my parents and threatened to call the police if I didn't let them speak to my parents because I was a threat to myself. This was the first day I've spoken to this woman. Rlly put me off of sharing stuff and gave me trust issues",
          "created_utc": 1625336271.0
        }
      ]
    },
    {
      "id": "h3ysrrl",
      "author": "Haunting-Elephant618",
      "body": "Sounds like you’ve found a good therapist that’s meeting you where you are. That’s awesome and so important. I’m the OP and one of the first things I did in my professional development for ED was to learning just what you said, the differences between each ED. Learning individual experiences has also been really helpful in my journey as well.",
      "created_utc": 1625352232.0,
      "score": 2,
      "context": [
        {
          "id": "h3y1pux",
          "author": "edie43",
          "body": "I think being educated on the different kinds of EDs is very important. Bine eating disorder and bulimia is a lot more common than people think and having a therapist who acknowledged that and knew what she was talking about was honestly such a relief when I first started getting treatment. \n\nIn the beginning I was asked to have a food journal and that honestly was a good resource for me. I would write down what I ate and what I felt while eating, no focus on calories or anything and no judgement when we went through the journal. \n\nAlso, I am very thankful that my therapist never mentions my weight in any way unless I bring it up. The focus is entirely on my mind and it’s very refreshing that I can work on healing in an environment that doesn’t make me feel judged for my body.",
          "created_utc": 1625337661.0
        }
      ]
    },
    {
      "id": "h3yecwp",
      "author": "HubbyHasBlueBalls",
      "body": "Second this. Also, don’t get so caught up in a singular modality being the cure all to everything. People are different, their experiences are different, their mental health issues are different. One size does not fit all. Ever.",
      "created_utc": 1625344288.0,
      "score": 5,
      "context": [
        {
          "id": "h3xxzz5",
          "author": "una_verdadera_lata",
          "body": "As someone who also did their graduate work in counseling (and also has an ED) I would focus on honing/focusing on your preferred modality as a clinician rather than “what works for ED clients.“ my most successful relationships have been with therapists whose modalities work with my world view because there isn’t really a blanket “this is what works for EDs“ as every clients experience of their ED is different. Meet your clients where they are, and they will let you know what works and what doesn’t.",
          "created_utc": 1625335685.0
        }
      ]
    },
    {
      "id": "h3y7w17",
      "author": "FoxiiFighter",
      "body": "I 100% agree with this. The most effective therapist I ever had never treated ED patients before me. His methodology was what kept me coming back, and ultimately pushed me into a full recovery attempt.",
      "created_utc": 1625340896.0,
      "score": 3,
      "context": [
        {
          "id": "h3xxzz5",
          "author": "una_verdadera_lata",
          "body": "As someone who also did their graduate work in counseling (and also has an ED) I would focus on honing/focusing on your preferred modality as a clinician rather than “what works for ED clients.“ my most successful relationships have been with therapists whose modalities work with my world view because there isn’t really a blanket “this is what works for EDs“ as every clients experience of their ED is different. Meet your clients where they are, and they will let you know what works and what doesn’t.",
          "created_utc": 1625335685.0
        }
      ]
    },
    {
      "id": "h3ypw8u",
      "author": "Haunting-Elephant618",
      "body": "For sure!! I’m the OP and generally use CBT and DBT as my modalities. I guess when I asked this I more or less want to have an understanding of the client’s experience and build confidence in understanding the ED world a bit better. There’s never a one size fits all approach for anyone, regardless of diagnosis. For example, I’m not a religious person but if my client is and prayer is helpful for them, then I may suggest a prayer journal or prayer as a form of meditation. They’re welcoming me into THEIR world, not the other way around, so if I can’t meet them where they are, make assumptions, or treat everyone the same, I’m doing them a disservice and not doing my job as a helper. \n\nThank you so much for this reminder and how it applies to ED as well.",
      "created_utc": 1625350588.0,
      "score": 1,
      "context": [
        {
          "id": "h3xxzz5",
          "author": "una_verdadera_lata",
          "body": "As someone who also did their graduate work in counseling (and also has an ED) I would focus on honing/focusing on your preferred modality as a clinician rather than “what works for ED clients.“ my most successful relationships have been with therapists whose modalities work with my world view because there isn’t really a blanket “this is what works for EDs“ as every clients experience of their ED is different. Meet your clients where they are, and they will let you know what works and what doesn’t.",
          "created_utc": 1625335685.0
        }
      ]
    },
    {
      "id": "h3yszbm",
      "author": "Haunting-Elephant618",
      "body": "I’m so glad you told your therapist and that they listened. I love when my clients offer corrections or feedback on something I’ve said that isn’t helpful.",
      "created_utc": 1625352355.0,
      "score": 3,
      "context": [
        {
          "id": "h3y6lj0",
          "author": "600lbGoldfish",
          "body": "My therapist asked me to shake my arms out to relieve stress but I couldn’t do it because all I could think of was how my arms were shaking around, so just being conscious of body movement being difficult for some people. I told her about this and she actually thanked me a said knowing that made her a better therapist for her patients so it was all good",
          "created_utc": 1625340212.0
        }
      ]
    },
    {
      "id": "h3yx0e1",
      "author": "Haunting-Elephant618",
      "body": "Thank you!! I’ve definitely learned quickly that people make assumptions about ED and what someone with ED looks like.",
      "created_utc": 1625354721.0,
      "score": 1,
      "context": [
        {
          "id": "h3yvina",
          "author": "iamspeaking77",
          "body": "downplaying the seriousness of an eating disorder if the patient doesn’t “look” sick or meet the diagnostic criteria. this happened to me many times by medical professionals.",
          "created_utc": 1625353831.0
        }
      ]
    },
    {
      "id": "h3z0035",
      "author": "Haunting-Elephant618",
      "body": "It’s not only unfair, but unrealistic. Like you said, everyone has body image issues, and being in recovery doesn’t magically make that go away. Thank you for that perspective so I can keep it in my for keeping goals realistic. \n\nOn a side note and unrelated to ED, it reminds me of how adults expect kids to never get angry, upset, or fidgety, etc. they’ll get in trouble for getting angry but we as adults feel all those things and express ourselves. It’s all about how it’s expressed that becomes important. So if I try to tie this back to ED, we all experience body image issues, but it’s how we address those issues that determines if it’s problematic and possible ED related?",
      "created_utc": 1625356501.0,
      "score": 2,
      "context": [
        {
          "id": "h3yxouk",
          "author": "Maggiemaccy",
          "body": "When someone overcomes an eating disorder or is in recovery there’s an expectation that they’re never allowed to have body issues again, never allowed to feel negatively about their body, not allowed to have any form of body goals or fitness goals. \n\nI struggled with this during recovery. Fact remains I was still a woman in my early 20s entitled to feelings around my body just like everyone else. Recovery came with the expectation that I would now accept my body in a way that isn’t expected of anyone else, otherwise I ‘wasn’t really recovering’. In reality everyone carries body and image issues, it’s an unfair expectation to place on someone to ‘get over’ that and be perfectly accepting of themselves 100% of the time and I believe pushing this really just forces those in recovery to shut up about it. \n\nI think that’s important to note.",
          "created_utc": 1625355119.0
        }
      ]
    },
    {
      "id": "h3y31nm",
      "author": "Haunting-Elephant618",
      "body": "Thank you! It can often be helpful to address early issues to help reframe core beliefs that may have been instilled through childhood. BUT! What you mentioned about concrete steps to take is a big thing I do with all my clients, so that’s helpful to hear, along with identifying triggers.",
      "created_utc": 1625338353.0,
      "score": 3,
      "context": [
        {
          "id": "h3xwm4z",
          "author": "inutilities",
          "body": "I've been to therapy for more than 10 years, seeing different kinds if therapists for my ED. A REALLY annoying thing is that they always started asking about my family situation and tried to dig deep to find some trauma in my childhood. In the beginning it was ok but like, I'm done discussing my family, I have the ED, I've had it for a looong time, and I need your help with it. I would have wanted concrete tips about nutrition; what do I actually need to eat daily to get healthy. F*** the \"you have to eat breakfast, lunch, dinner\" I'd rather learn to listen to my body and my emotions, f.e what triggers I have, what am I trying to solve with starving, how can I deal with my issues / problems in a healthy way. I would want concrete tips and tricks based upon my own life, capabilities, possibilities... hope this helps. EDIT: I'm 38 yo.",
          "created_utc": 1625334953.0
        }
      ]
    },
    {
      "id": "h3yf04h",
      "author": "HubbyHasBlueBalls",
      "body": "That’s awful. I have selective mutism, so the concept that this was your experience is horrifying to me in itself. Now, I have enough trauma from treatment that I would probably start sobbing and not be able to stop with any new provider put in front of me. \nIf you ever feel brave enough or safe enough to reach out for support again, maybe email/ call/ etc ahead of time and see if they would allow you to write down what’s going on internally.  I’ve had two separate therapists allow me to write in session, and never had someone tell me no. I’m so sorry this has been your experience.",
      "created_utc": 1625344633.0,
      "score": 3,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        }
      ]
    },
    {
      "id": "h3ytf9g",
      "author": "Haunting-Elephant618",
      "body": "That’s truly awful!! I’m open to people writing things down, drawing a picture, even sending me a message. I’ve often had people who get nervous saying something out loud so they’ll send me an email in the moment, I personally love it! Any form of communication is helpful. Some people email me throughout the week with their thoughts for an upcoming session or after a session and I love it!!\n\nActually, it’s funny you mentioned this, yesterday I ordered a bunch of journals for my office. Just so those who want to use a journal in sessions can have one. It can stay there with me or they can take it home, completely up to them. I’m so excited for them to arrive (Wednesday according to Amazon lol)!!!",
      "created_utc": 1625352608.0,
      "score": 3,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        }
      ]
    },
    {
      "id": "h3yvo0v",
      "author": "Haunting-Elephant618",
      "body": "I’ll have to check and see if there’s OA available around my area. I’ve heard of it, but I’m glad you mentioned it because had also kind of forgotten about it as a resource. Would be helpful to know what’s around me to be able to give out the information when applicable.",
      "created_utc": 1625353920.0,
      "score": 1,
      "context": [
        {
          "id": "h3yjm4x",
          "author": "thats_scrummy",
          "body": "Biggest thing to remember, like someone mentioned above, is that not all eating disorders are the same. There’s anorexia, binge eating, bulimia, binge/purge, exercise bulimia, etc and different severities. For example, I am a binger/calorie restrictor and after trying several different things with my therapist she said she thought that my issue was a food/eating addiction. I’m now a member of Overeaters Anonymous which I didn’t even know was a thing until I googled “community for food addicts”. It’s also a home for all kinds of eating disorders. Many people don’t know about it - I didn’t, and neither did my therapist. But it has been the BIGGEST help. I call OA, therapy, and my nutritionist my Holy Trinity.",
          "created_utc": 1625347116.0
        }
      ]
    },
    {
      "id": "h3yvgu1",
      "author": "Haunting-Elephant618",
      "body": "Omg. I’m so sorry that happened to you!! This is actually partly why I’ve been learning more and getting more training in this area, I’ve had a couple younger teens disclose some restriction and fears of being fat. And I’d like to help them before it turns into an ED. But they’re teens I’ve already established a rapport with over the past few months, I was so glad they trusted me. And it’s just become part of the conversation in sessions. Just like me checking on mood over the past week or how such and such went, etc. now I’ll ask how eating is going, how they felt about it, etc. But I felt out of my wheelhouse and afraid I’d say something detrimental so started getting more training and supervision.",
      "created_utc": 1625353802.0,
      "score": 2,
      "context": [
        {
          "id": "h3ytbcl",
          "author": "Caactiii",
          "body": "From my personal experience, and part of the reason I stopped seeing a therapist:\n\nIf your client confides in you that they're struggling with food and have been for a while (or haven't, length shouldn't matter) do not dismiss them. I told my therapist I purposefully restricted intake in a hopes of getting better. My therapist asked me \"how would you feel if you were fat?\" And I didn't know how to reply. That therapist never brought up my food issues again, and I still struggle to this day. Just because your client doesn't show physical symptoms of an eating disorder doesn't mean they aren't struggling. Don't dismiss someone finally being able to say something they haven't been able to say for years.",
          "created_utc": 1625352546.0
        }
      ]
    },
    {
      "id": "h3yx3ws",
      "author": "Haunting-Elephant618",
      "body": "Thank you!! I’m sorry that was your experience. I hope you’re doing well in your recovery!",
      "created_utc": 1625354779.0,
      "score": 1,
      "context": [
        {
          "id": "h3ywvtf",
          "author": "windysydney",
          "body": "Don’t make any assumptions about anyone’s eating disorder. I once met a therapist who just assumed I struggled with BED because I was overweight at the time. I was actually struggling with bulimia and was so humiliated that I couldn’t even correct her. Don’t be that person.",
          "created_utc": 1625354647.0
        }
      ]
    },
    {
      "id": "h40trci",
      "author": "Haunting-Elephant618",
      "body": "Thank you!! I’ll look into Jennifer Rollin, I’m definitely looking for as much training as I can find. \n\nDiet culture - I loathe and despise diet culture. I grew up in the 80’s and 90’s with a mom who always commented on how “fat” she was. Seeing her go through various diets, workout fads, etc. She has since maintained a weight she’s content with, but still buys “diet” food, and I’m regularly having to remind her not to talk about her weight or how she looks around my kids. She tries, occasionally slips, but she definitely tries. I know just how this impacted me as a kid/teen and as an adult seeing the ads and various fads irritate me to no end. \n\nThe food journal, that’s a really good point. Seems like it would need to be very individualized.",
      "created_utc": 1625406549.0,
      "score": 1,
      "context": [
        {
          "id": "h3zmi3t",
          "author": "courtenax",
          "body": "Jennifer Rollin has training courses! She’s a specialised therapist who also went through the it herself.  Highly highly recommend.\n\nLook into what diet culture is as I think that helps see how SO MANY things that have become part of our every day life and language and can be immensely triggering.\n\nGet the ED voice to trust you.  understanding personal history has been helpful for me, everyone is so different and thereasons EDs develop vary significantly.  It’s helped me to look for what purposes it serves. It helps me feel safe that my therapist never ever pushes me if we find that it’s still serving one or more those purposes (I also have trauma history and PTSD), she only encourages me challenge/process the root causes (note: I’m also in the beginning stages of this, it’s been almost a year since I’ve been slowly accepting that I even have an ED.)\n\nBefore I started seeing her I had to have a standing appointment with a nutritionist as a requirement, she doesn’t handle specific nutrition or physical health at all but is a part of my team.  The most important part right now because I don’t trust any of the other ones yet haha - if someone were to ask me to log food I’d FREAK out, the thought makes me immediately so ashamed of my intake and want to restrict even more",
          "created_utc": 1625370651.0
        }
      ]
    },
    {
      "id": "h40ske0",
      "author": "Haunting-Elephant618",
      "body": "Oh wow! I can imagine how hard that would have been. It’s my standard rule of thumb to never comment on someone’s body. Glad the dietician was able to talk with your psychologist. Sounds like the psychologist was open to that feedback.",
      "created_utc": 1625405845.0,
      "score": 2,
      "context": [
        {
          "id": "h3zz6h4",
          "author": "Vessecora",
          "body": "I'll share a bad experience I had as an example of something that should be avoided: I'd been seeing a psychologist for a few years and finally decided to tackle the eating disorder. She referred me to a dietitian who specialises in eating disorders, which was great. But after a few sessions with the dietitian I went back to my psychologist for a regular session and she told me I looked like I was doing well: that I had 'slimmed' down in the face....\n\nLike... Holy hell that was a bad comment to make. I had been swinging between restriction and bingeing for some time and I could feel the urge to restrict really hard after my eating disorder heard validation. Not healthy at all! Luckily I had already been trying to heal before the dietitian appointments. I can't imagine how bad it would have been if I hadn't been so far in my recovery.\n\nI brought it up with the dietitian who said she would education my psychologist and there haven't been any hints of that sort of thinking since.",
          "created_utc": 1625380351.0
        }
      ]
    },
    {
      "id": "h3y9l3y",
      "author": "Twigsintheforest",
      "body": "I just wanted to tell you, the fact you're asking at all is huge! It's awesome you're open to hear from patients and take feedback, I think you'll make a great therapist just from the fact you admit to mistakes and are willing to work on them, I wish more therapists were like that. All the best in your career!",
      "created_utc": 1625341785.0,
      "score": 10,
      "context": [
        {
          "id": "h3xxiyp",
          "author": "Twigsintheforest",
          "body": "For the love of god don't ever say anything along the lines of \"you don't look like you have an ED\" or assume the patient is doing better because they ate something high calorie/something that isn't a singular rice cake. I know so many people, including me, that have given up on therapy/recovery because of things like that. It's almost guaranteed to make them feel \"not sick enough\" and go back to their disorder or even actively make it worse as a result.\n\nI agree that keeping a log is only good for a few days to get a feel for their eating habits and establish concrete goals but I'd only do it between two sessions and then stop so the focus is taken away from the numbers, they'll do that by themselves anyway. What's helped me is reassurance that what I'm doing is good and right when I manage to eat but not being pressured to do things I'm not comfortable with and see every meal as my decision and if I can't do it I can try again next time without feeling like I'm disappointing my therapist.",
          "created_utc": 1625335435.0
        },
        {
          "id": "h3y3juf",
          "author": "Haunting-Elephant618",
          "body": "Thank you!! This aligns with my current approach to therapy anyway, so it’s helpful to hear that many of my approaches will be helpful. ED is definitely a new area for me as I could see myself slipping and saying something I think is reassuring but is inadvertently triggering for someone and I want to avoid that. The last thing I want is to be unhelpful. I do often have that conversation with my clients (non ED), that if I say something that’s upsetting to please tell me! This way it can be talked through and I can do better, I’m human and I know I’ll make mistakes, but I want to learn from those mistakes.",
          "created_utc": 1625338613.0
        }
      ]
    },
    {
      "id": "h3yv2f7",
      "author": "None",
      "body": "Yh, they told me they had to speak with my parents and when I told them I wasn't comfortable with that, they said they were legally obligated to, and said that the only other option was calling the police. When I thought the session was over (this was through an online service, it was a rlly reputable and trusted company that everybody pointed to as \"the perfect service\") and put my phone down, theyd blow it up every 5 minutes and threaten to call the cops if I didn't reply within 15. This gave me so much anxiety that every notification physically stopped my breath and made me shake.",
      "created_utc": 1625353566.0,
      "score": 2,
      "context": [
        {
          "id": "h3xz2w0",
          "author": "None",
          "body": "When I tried to speak to a counsellor (not the same, but it works) about my ED, she immediately wanted me to tell my parents and threatened to call the police if I didn't let them speak to my parents because I was a threat to myself. This was the first day I've spoken to this woman. Rlly put me off of sharing stuff and gave me trust issues",
          "created_utc": 1625336271.0
        },
        {
          "id": "h3yscr1",
          "author": "Haunting-Elephant618",
          "body": "Omg! That’s awful! I work with teens who self-harm through cutting and they ask me if I’m going to tell their parents. And especially if they’re age of consent in MH (14 in my state) the answer is “I will only breach confidentiality if you’re suicidal or homicidal and I believe there’s immediate risk. But we’re going to talk about it *together* before anything is done.” And I’ve had that happen, and instead of freaking out (like many newer therapist may) we talk, I obviously assess for plan, means, intent (the usual) and in the end the client and I often call together or if the parent is in the waiting room we’ll invite them to join the session. Sometimes they want me to talk and sometimes they take the lead. Sometimes they text instead of call. It depends on the situation, but I find having a conversation rather than becoming an alarmist not only keeps the rapport, it also helps the teen begin to have more dialogue with their parents. If parents are not supportive, then we may do a contract for safety, create a safety plan together, or contact crisis together if they can’t contract for safety. Panicking doesn’t help anything. And I’d hope that for ED, I’d be taking a similar approach that I used for self-harm.",
          "created_utc": 1625351990.0
        }
      ]
    },
    {
      "id": "h3yuzt7",
      "author": "edie43",
      "body": "I’m so glad to hear that! I’ve heard a lot of stories about people who’ve felt rejected by health workers in general, so I feel so lucky to have found both a doctor and a therapist who have taken me seriously. \n\nGood on you for doing this, I think you’ll be a lot of help for someone some day. Good luck!",
      "created_utc": 1625353523.0,
      "score": 2,
      "context": [
        {
          "id": "h3y1pux",
          "author": "edie43",
          "body": "I think being educated on the different kinds of EDs is very important. Bine eating disorder and bulimia is a lot more common than people think and having a therapist who acknowledged that and knew what she was talking about was honestly such a relief when I first started getting treatment. \n\nIn the beginning I was asked to have a food journal and that honestly was a good resource for me. I would write down what I ate and what I felt while eating, no focus on calories or anything and no judgement when we went through the journal. \n\nAlso, I am very thankful that my therapist never mentions my weight in any way unless I bring it up. The focus is entirely on my mind and it’s very refreshing that I can work on healing in an environment that doesn’t make me feel judged for my body.",
          "created_utc": 1625337661.0
        },
        {
          "id": "h3ysrrl",
          "author": "Haunting-Elephant618",
          "body": "Sounds like you’ve found a good therapist that’s meeting you where you are. That’s awesome and so important. I’m the OP and one of the first things I did in my professional development for ED was to learning just what you said, the differences between each ED. Learning individual experiences has also been really helpful in my journey as well.",
          "created_utc": 1625352232.0
        }
      ]
    },
    {
      "id": "h3ynwww",
      "author": "una_verdadera_lata",
      "body": "Amen!",
      "created_utc": 1625349473.0,
      "score": 1,
      "context": [
        {
          "id": "h3xxzz5",
          "author": "una_verdadera_lata",
          "body": "As someone who also did their graduate work in counseling (and also has an ED) I would focus on honing/focusing on your preferred modality as a clinician rather than “what works for ED clients.“ my most successful relationships have been with therapists whose modalities work with my world view because there isn’t really a blanket “this is what works for EDs“ as every clients experience of their ED is different. Meet your clients where they are, and they will let you know what works and what doesn’t.",
          "created_utc": 1625335685.0
        },
        {
          "id": "h3yecwp",
          "author": "HubbyHasBlueBalls",
          "body": "Second this. Also, don’t get so caught up in a singular modality being the cure all to everything. People are different, their experiences are different, their mental health issues are different. One size does not fit all. Ever.",
          "created_utc": 1625344288.0
        }
      ]
    },
    {
      "id": "h3yraq7",
      "author": "Haunting-Elephant618",
      "body": "Omg. This so much!! I’m the OP and while I generally use CBT and DBT, it’s so individualized based on the person’s needs, experiences, abilities, etc. And I see all ages so it’s so important to be able to adapt to who’s in my office.",
      "created_utc": 1625351385.0,
      "score": 1,
      "context": [
        {
          "id": "h3xxzz5",
          "author": "una_verdadera_lata",
          "body": "As someone who also did their graduate work in counseling (and also has an ED) I would focus on honing/focusing on your preferred modality as a clinician rather than “what works for ED clients.“ my most successful relationships have been with therapists whose modalities work with my world view because there isn’t really a blanket “this is what works for EDs“ as every clients experience of their ED is different. Meet your clients where they are, and they will let you know what works and what doesn’t.",
          "created_utc": 1625335685.0
        },
        {
          "id": "h3yecwp",
          "author": "HubbyHasBlueBalls",
          "body": "Second this. Also, don’t get so caught up in a singular modality being the cure all to everything. People are different, their experiences are different, their mental health issues are different. One size does not fit all. Ever.",
          "created_utc": 1625344288.0
        }
      ]
    },
    {
      "id": "h3yq333",
      "author": "Haunting-Elephant618",
      "body": "This is also helpful to hear. I’m so afraid of saying or doing something wrong that I didn’t want to take on an ED client until I understood it better. But I’m confident in my skills as a therapist in general. I do still want to fill my brain with knowledge so I’m not doing or saying something that could be detrimental, but that’s actually very reassuring to hear.",
      "created_utc": 1625350696.0,
      "score": 2,
      "context": [
        {
          "id": "h3xxzz5",
          "author": "una_verdadera_lata",
          "body": "As someone who also did their graduate work in counseling (and also has an ED) I would focus on honing/focusing on your preferred modality as a clinician rather than “what works for ED clients.“ my most successful relationships have been with therapists whose modalities work with my world view because there isn’t really a blanket “this is what works for EDs“ as every clients experience of their ED is different. Meet your clients where they are, and they will let you know what works and what doesn’t.",
          "created_utc": 1625335685.0
        },
        {
          "id": "h3y7w17",
          "author": "FoxiiFighter",
          "body": "I 100% agree with this. The most effective therapist I ever had never treated ED patients before me. His methodology was what kept me coming back, and ultimately pushed me into a full recovery attempt.",
          "created_utc": 1625340896.0
        }
      ]
    },
    {
      "id": "h3z1n17",
      "author": "Maggiemaccy",
      "body": "Obviously there’s also elements of body dysmorphia that go well beyond the body image issues we all face so it’s definitely not a recommendation that everyone is left to their own devices without any input on the matter. It’s so complex, some may need help with the way they choose to deal with their body issues, others may need help coming to a place where their body goals are more realistic, I’m not suggesting having a goal of 80lb go unchecked. But overall it’s unhelpful to go in with the expectation that a person in recovery isn’t allowed to care how they look anymore, which I feel was constantly pushed on me during recovery.",
      "created_utc": 1625357512.0,
      "score": 2,
      "context": [
        {
          "id": "h3yxouk",
          "author": "Maggiemaccy",
          "body": "When someone overcomes an eating disorder or is in recovery there’s an expectation that they’re never allowed to have body issues again, never allowed to feel negatively about their body, not allowed to have any form of body goals or fitness goals. \n\nI struggled with this during recovery. Fact remains I was still a woman in my early 20s entitled to feelings around my body just like everyone else. Recovery came with the expectation that I would now accept my body in a way that isn’t expected of anyone else, otherwise I ‘wasn’t really recovering’. In reality everyone carries body and image issues, it’s an unfair expectation to place on someone to ‘get over’ that and be perfectly accepting of themselves 100% of the time and I believe pushing this really just forces those in recovery to shut up about it. \n\nI think that’s important to note.",
          "created_utc": 1625355119.0
        },
        {
          "id": "h3z0035",
          "author": "Haunting-Elephant618",
          "body": "It’s not only unfair, but unrealistic. Like you said, everyone has body image issues, and being in recovery doesn’t magically make that go away. Thank you for that perspective so I can keep it in my for keeping goals realistic. \n\nOn a side note and unrelated to ED, it reminds me of how adults expect kids to never get angry, upset, or fidgety, etc. they’ll get in trouble for getting angry but we as adults feel all those things and express ourselves. It’s all about how it’s expressed that becomes important. So if I try to tie this back to ED, we all experience body image issues, but it’s how we address those issues that determines if it’s problematic and possible ED related?",
          "created_utc": 1625356501.0
        }
      ]
    },
    {
      "id": "h3ykzju",
      "author": "KryptonionNipple",
      "body": "Yeah, I think that would be the plan. If there is a next time. \n\nThe big problem is I can't get help because I'm not \"bad enough\".\n\nNot even when my depression was that low I tried to kill myself. Or when I made plans to kill myself, now husband and our cats. \n\nThe UK isn't as good as they make out they are.",
      "created_utc": 1625347859.0,
      "score": 3,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        },
        {
          "id": "h3yf04h",
          "author": "HubbyHasBlueBalls",
          "body": "That’s awful. I have selective mutism, so the concept that this was your experience is horrifying to me in itself. Now, I have enough trauma from treatment that I would probably start sobbing and not be able to stop with any new provider put in front of me. \nIf you ever feel brave enough or safe enough to reach out for support again, maybe email/ call/ etc ahead of time and see if they would allow you to write down what’s going on internally.  I’ve had two separate therapists allow me to write in session, and never had someone tell me no. I’m so sorry this has been your experience.",
          "created_utc": 1625344633.0
        }
      ]
    },
    {
      "id": "h3ytk8b",
      "author": "KryptonionNipple",
      "body": "I need you as my therapist. You're so lovely, and I adore all the things you are doing. Best of luck to you and your career! \n\nThose notebooks sound like a fantastic idea.",
      "created_utc": 1625352688.0,
      "score": 1,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        },
        {
          "id": "h3ytf9g",
          "author": "Haunting-Elephant618",
          "body": "That’s truly awful!! I’m open to people writing things down, drawing a picture, even sending me a message. I’ve often had people who get nervous saying something out loud so they’ll send me an email in the moment, I personally love it! Any form of communication is helpful. Some people email me throughout the week with their thoughts for an upcoming session or after a session and I love it!!\n\nActually, it’s funny you mentioned this, yesterday I ordered a bunch of journals for my office. Just so those who want to use a journal in sessions can have one. It can stay there with me or they can take it home, completely up to them. I’m so excited for them to arrive (Wednesday according to Amazon lol)!!!",
          "created_utc": 1625352608.0
        }
      ]
    },
    {
      "id": "h3ywxhf",
      "author": "thats_scrummy",
      "body": "Lots are still happening over Zoom because of COVID and there’s even a subreddit for it. You can search for your area at oa.org.",
      "created_utc": 1625354674.0,
      "score": 2,
      "context": [
        {
          "id": "h3yjm4x",
          "author": "thats_scrummy",
          "body": "Biggest thing to remember, like someone mentioned above, is that not all eating disorders are the same. There’s anorexia, binge eating, bulimia, binge/purge, exercise bulimia, etc and different severities. For example, I am a binger/calorie restrictor and after trying several different things with my therapist she said she thought that my issue was a food/eating addiction. I’m now a member of Overeaters Anonymous which I didn’t even know was a thing until I googled “community for food addicts”. It’s also a home for all kinds of eating disorders. Many people don’t know about it - I didn’t, and neither did my therapist. But it has been the BIGGEST help. I call OA, therapy, and my nutritionist my Holy Trinity.",
          "created_utc": 1625347116.0
        },
        {
          "id": "h3yvo0v",
          "author": "Haunting-Elephant618",
          "body": "I’ll have to check and see if there’s OA available around my area. I’ve heard of it, but I’m glad you mentioned it because had also kind of forgotten about it as a resource. Would be helpful to know what’s around me to be able to give out the information when applicable.",
          "created_utc": 1625353920.0
        }
      ]
    },
    {
      "id": "h42st5v",
      "author": "courtenax",
      "body": "It sounds to me like you’re already on your way to being a great help! Most people wouldn’t even ask us, thank you :)",
      "created_utc": 1625443127.0,
      "score": 2,
      "context": [
        {
          "id": "h3zmi3t",
          "author": "courtenax",
          "body": "Jennifer Rollin has training courses! She’s a specialised therapist who also went through the it herself.  Highly highly recommend.\n\nLook into what diet culture is as I think that helps see how SO MANY things that have become part of our every day life and language and can be immensely triggering.\n\nGet the ED voice to trust you.  understanding personal history has been helpful for me, everyone is so different and thereasons EDs develop vary significantly.  It’s helped me to look for what purposes it serves. It helps me feel safe that my therapist never ever pushes me if we find that it’s still serving one or more those purposes (I also have trauma history and PTSD), she only encourages me challenge/process the root causes (note: I’m also in the beginning stages of this, it’s been almost a year since I’ve been slowly accepting that I even have an ED.)\n\nBefore I started seeing her I had to have a standing appointment with a nutritionist as a requirement, she doesn’t handle specific nutrition or physical health at all but is a part of my team.  The most important part right now because I don’t trust any of the other ones yet haha - if someone were to ask me to log food I’d FREAK out, the thought makes me immediately so ashamed of my intake and want to restrict even more",
          "created_utc": 1625370651.0
        },
        {
          "id": "h40trci",
          "author": "Haunting-Elephant618",
          "body": "Thank you!! I’ll look into Jennifer Rollin, I’m definitely looking for as much training as I can find. \n\nDiet culture - I loathe and despise diet culture. I grew up in the 80’s and 90’s with a mom who always commented on how “fat” she was. Seeing her go through various diets, workout fads, etc. She has since maintained a weight she’s content with, but still buys “diet” food, and I’m regularly having to remind her not to talk about her weight or how she looks around my kids. She tries, occasionally slips, but she definitely tries. I know just how this impacted me as a kid/teen and as an adult seeing the ads and various fads irritate me to no end. \n\nThe food journal, that’s a really good point. Seems like it would need to be very individualized.",
          "created_utc": 1625406549.0
        }
      ]
    },
    {
      "id": "h3yhzsc",
      "author": "Haunting-Elephant618",
      "body": "Thank you!! That’s so sweet to say!",
      "created_utc": 1625346235.0,
      "score": 4,
      "context": [
        {
          "id": "h3xxiyp",
          "author": "Twigsintheforest",
          "body": "For the love of god don't ever say anything along the lines of \"you don't look like you have an ED\" or assume the patient is doing better because they ate something high calorie/something that isn't a singular rice cake. I know so many people, including me, that have given up on therapy/recovery because of things like that. It's almost guaranteed to make them feel \"not sick enough\" and go back to their disorder or even actively make it worse as a result.\n\nI agree that keeping a log is only good for a few days to get a feel for their eating habits and establish concrete goals but I'd only do it between two sessions and then stop so the focus is taken away from the numbers, they'll do that by themselves anyway. What's helped me is reassurance that what I'm doing is good and right when I manage to eat but not being pressured to do things I'm not comfortable with and see every meal as my decision and if I can't do it I can try again next time without feeling like I'm disappointing my therapist.",
          "created_utc": 1625335435.0
        },
        {
          "id": "h3y3juf",
          "author": "Haunting-Elephant618",
          "body": "Thank you!! This aligns with my current approach to therapy anyway, so it’s helpful to hear that many of my approaches will be helpful. ED is definitely a new area for me as I could see myself slipping and saying something I think is reassuring but is inadvertently triggering for someone and I want to avoid that. The last thing I want is to be unhelpful. I do often have that conversation with my clients (non ED), that if I say something that’s upsetting to please tell me! This way it can be talked through and I can do better, I’m human and I know I’ll make mistakes, but I want to learn from those mistakes.",
          "created_utc": 1625338613.0
        },
        {
          "id": "h3y9l3y",
          "author": "Twigsintheforest",
          "body": "I just wanted to tell you, the fact you're asking at all is huge! It's awesome you're open to hear from patients and take feedback, I think you'll make a great therapist just from the fact you admit to mistakes and are willing to work on them, I wish more therapists were like that. All the best in your career!",
          "created_utc": 1625341785.0
        }
      ]
    },
    {
      "id": "h3yy2fh",
      "author": "Haunting-Elephant618",
      "body": "Yikes! That sounds like quite the overreaction on the therapist’s part. It may depend on state and licensing boards, but in general SI/HI with plan, means, and intent are the grounds for breaking confidentiality (and child/elder abuse/neglect). I have clients who have chronic SI, they have plans and means, but will deny intent. We come up with safety plans, I make sure they have the crisis #, and get a contract for safety.",
      "created_utc": 1625355345.0,
      "score": 1,
      "context": [
        {
          "id": "h3xz2w0",
          "author": "None",
          "body": "When I tried to speak to a counsellor (not the same, but it works) about my ED, she immediately wanted me to tell my parents and threatened to call the police if I didn't let them speak to my parents because I was a threat to myself. This was the first day I've spoken to this woman. Rlly put me off of sharing stuff and gave me trust issues",
          "created_utc": 1625336271.0
        },
        {
          "id": "h3yscr1",
          "author": "Haunting-Elephant618",
          "body": "Omg! That’s awful! I work with teens who self-harm through cutting and they ask me if I’m going to tell their parents. And especially if they’re age of consent in MH (14 in my state) the answer is “I will only breach confidentiality if you’re suicidal or homicidal and I believe there’s immediate risk. But we’re going to talk about it *together* before anything is done.” And I’ve had that happen, and instead of freaking out (like many newer therapist may) we talk, I obviously assess for plan, means, intent (the usual) and in the end the client and I often call together or if the parent is in the waiting room we’ll invite them to join the session. Sometimes they want me to talk and sometimes they take the lead. Sometimes they text instead of call. It depends on the situation, but I find having a conversation rather than becoming an alarmist not only keeps the rapport, it also helps the teen begin to have more dialogue with their parents. If parents are not supportive, then we may do a contract for safety, create a safety plan together, or contact crisis together if they can’t contract for safety. Panicking doesn’t help anything. And I’d hope that for ED, I’d be taking a similar approach that I used for self-harm.",
          "created_utc": 1625351990.0
        },
        {
          "id": "h3yv2f7",
          "author": "None",
          "body": "Yh, they told me they had to speak with my parents and when I told them I wasn't comfortable with that, they said they were legally obligated to, and said that the only other option was calling the police. When I thought the session was over (this was through an online service, it was a rlly reputable and trusted company that everybody pointed to as \"the perfect service\") and put my phone down, theyd blow it up every 5 minutes and threaten to call the cops if I didn't reply within 15. This gave me so much anxiety that every notification physically stopped my breath and made me shake.",
          "created_utc": 1625353566.0
        }
      ]
    },
    {
      "id": "h3yx915",
      "author": "Haunting-Elephant618",
      "body": "Thank you!! I’m glad you’ve found both a good doctor and a therapist!",
      "created_utc": 1625354861.0,
      "score": 1,
      "context": [
        {
          "id": "h3y1pux",
          "author": "edie43",
          "body": "I think being educated on the different kinds of EDs is very important. Bine eating disorder and bulimia is a lot more common than people think and having a therapist who acknowledged that and knew what she was talking about was honestly such a relief when I first started getting treatment. \n\nIn the beginning I was asked to have a food journal and that honestly was a good resource for me. I would write down what I ate and what I felt while eating, no focus on calories or anything and no judgement when we went through the journal. \n\nAlso, I am very thankful that my therapist never mentions my weight in any way unless I bring it up. The focus is entirely on my mind and it’s very refreshing that I can work on healing in an environment that doesn’t make me feel judged for my body.",
          "created_utc": 1625337661.0
        },
        {
          "id": "h3ysrrl",
          "author": "Haunting-Elephant618",
          "body": "Sounds like you’ve found a good therapist that’s meeting you where you are. That’s awesome and so important. I’m the OP and one of the first things I did in my professional development for ED was to learning just what you said, the differences between each ED. Learning individual experiences has also been really helpful in my journey as well.",
          "created_utc": 1625352232.0
        },
        {
          "id": "h3yuzt7",
          "author": "edie43",
          "body": "I’m so glad to hear that! I’ve heard a lot of stories about people who’ve felt rejected by health workers in general, so I feel so lucky to have found both a doctor and a therapist who have taken me seriously. \n\nGood on you for doing this, I think you’ll be a lot of help for someone some day. Good luck!",
          "created_utc": 1625353523.0
        }
      ]
    },
    {
      "id": "h3z2uep",
      "author": "Haunting-Elephant618",
      "body": "A very good point! Thank you!",
      "created_utc": 1625358261.0,
      "score": 1,
      "context": [
        {
          "id": "h3yxouk",
          "author": "Maggiemaccy",
          "body": "When someone overcomes an eating disorder or is in recovery there’s an expectation that they’re never allowed to have body issues again, never allowed to feel negatively about their body, not allowed to have any form of body goals or fitness goals. \n\nI struggled with this during recovery. Fact remains I was still a woman in my early 20s entitled to feelings around my body just like everyone else. Recovery came with the expectation that I would now accept my body in a way that isn’t expected of anyone else, otherwise I ‘wasn’t really recovering’. In reality everyone carries body and image issues, it’s an unfair expectation to place on someone to ‘get over’ that and be perfectly accepting of themselves 100% of the time and I believe pushing this really just forces those in recovery to shut up about it. \n\nI think that’s important to note.",
          "created_utc": 1625355119.0
        },
        {
          "id": "h3z0035",
          "author": "Haunting-Elephant618",
          "body": "It’s not only unfair, but unrealistic. Like you said, everyone has body image issues, and being in recovery doesn’t magically make that go away. Thank you for that perspective so I can keep it in my for keeping goals realistic. \n\nOn a side note and unrelated to ED, it reminds me of how adults expect kids to never get angry, upset, or fidgety, etc. they’ll get in trouble for getting angry but we as adults feel all those things and express ourselves. It’s all about how it’s expressed that becomes important. So if I try to tie this back to ED, we all experience body image issues, but it’s how we address those issues that determines if it’s problematic and possible ED related?",
          "created_utc": 1625356501.0
        },
        {
          "id": "h3z1n17",
          "author": "Maggiemaccy",
          "body": "Obviously there’s also elements of body dysmorphia that go well beyond the body image issues we all face so it’s definitely not a recommendation that everyone is left to their own devices without any input on the matter. It’s so complex, some may need help with the way they choose to deal with their body issues, others may need help coming to a place where their body goals are more realistic, I’m not suggesting having a goal of 80lb go unchecked. But overall it’s unhelpful to go in with the expectation that a person in recovery isn’t allowed to care how they look anymore, which I feel was constantly pushed on me during recovery.",
          "created_utc": 1625357512.0
        }
      ]
    },
    {
      "id": "h3ymeeb",
      "author": "HubbyHasBlueBalls",
      "body": "Oh goodness. Honestly, I haven’t heard anything positive about UK’s mental health care, at least what is provided by the NHS. Hugs. It shouldn’t be that way.",
      "created_utc": 1625348636.0,
      "score": 2,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        },
        {
          "id": "h3yf04h",
          "author": "HubbyHasBlueBalls",
          "body": "That’s awful. I have selective mutism, so the concept that this was your experience is horrifying to me in itself. Now, I have enough trauma from treatment that I would probably start sobbing and not be able to stop with any new provider put in front of me. \nIf you ever feel brave enough or safe enough to reach out for support again, maybe email/ call/ etc ahead of time and see if they would allow you to write down what’s going on internally.  I’ve had two separate therapists allow me to write in session, and never had someone tell me no. I’m so sorry this has been your experience.",
          "created_utc": 1625344633.0
        },
        {
          "id": "h3ykzju",
          "author": "KryptonionNipple",
          "body": "Yeah, I think that would be the plan. If there is a next time. \n\nThe big problem is I can't get help because I'm not \"bad enough\".\n\nNot even when my depression was that low I tried to kill myself. Or when I made plans to kill myself, now husband and our cats. \n\nThe UK isn't as good as they make out they are.",
          "created_utc": 1625347859.0
        }
      ]
    },
    {
      "id": "h3z167b",
      "author": "Haunting-Elephant618",
      "body": "Holy hell!! I see people with a wide range of severity when it comes to mental health. Some are university students who are trying to adapt to stressors that come with living out of the home for the first time and some have severe depression with self harm who often experience suicidal thoughts. They all need help with various things and I’m there to support them (that’s the goal anyway), without judgment based on how bad things are or if it’s “bad enough.” I definitely have people who will ask if what they are experiencing is bad enough for therapy and I tell them that anyone and everyone can benefit from therapy, regardless of what’s going on. It’s not about being “bad enough” it’s about getting help when it’s needed or wanted. \n\nI’m sorry the UK isn’t recognizing that need. I’m in the US and our healthcare system sucks, and mental health is underfunded but thankfully most insurance companies approve outpatient therapy pretty easily.",
      "created_utc": 1625357224.0,
      "score": 1,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        },
        {
          "id": "h3yf04h",
          "author": "HubbyHasBlueBalls",
          "body": "That’s awful. I have selective mutism, so the concept that this was your experience is horrifying to me in itself. Now, I have enough trauma from treatment that I would probably start sobbing and not be able to stop with any new provider put in front of me. \nIf you ever feel brave enough or safe enough to reach out for support again, maybe email/ call/ etc ahead of time and see if they would allow you to write down what’s going on internally.  I’ve had two separate therapists allow me to write in session, and never had someone tell me no. I’m so sorry this has been your experience.",
          "created_utc": 1625344633.0
        },
        {
          "id": "h3ykzju",
          "author": "KryptonionNipple",
          "body": "Yeah, I think that would be the plan. If there is a next time. \n\nThe big problem is I can't get help because I'm not \"bad enough\".\n\nNot even when my depression was that low I tried to kill myself. Or when I made plans to kill myself, now husband and our cats. \n\nThe UK isn't as good as they make out they are.",
          "created_utc": 1625347859.0
        }
      ]
    },
    {
      "id": "h3ytx73",
      "author": "Haunting-Elephant618",
      "body": "Awe!! You’re so sweet! I hope you find a good therapist (if you’re still looking), it took me 5 tries to find my match. And I use TalkSpace for my own therapy (yes, I’m a therapist who’s in therapy), which is nice because they have the text and audio feature for communicating with a therapist. So helpful for me since I’m so busy during the week, to leave a quick 5min audio or a quick typed message is insanely helpful. Good luck!!",
      "created_utc": 1625352899.0,
      "score": 3,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        },
        {
          "id": "h3ytf9g",
          "author": "Haunting-Elephant618",
          "body": "That’s truly awful!! I’m open to people writing things down, drawing a picture, even sending me a message. I’ve often had people who get nervous saying something out loud so they’ll send me an email in the moment, I personally love it! Any form of communication is helpful. Some people email me throughout the week with their thoughts for an upcoming session or after a session and I love it!!\n\nActually, it’s funny you mentioned this, yesterday I ordered a bunch of journals for my office. Just so those who want to use a journal in sessions can have one. It can stay there with me or they can take it home, completely up to them. I’m so excited for them to arrive (Wednesday according to Amazon lol)!!!",
          "created_utc": 1625352608.0
        },
        {
          "id": "h3ytk8b",
          "author": "KryptonionNipple",
          "body": "I need you as my therapist. You're so lovely, and I adore all the things you are doing. Best of luck to you and your career! \n\nThose notebooks sound like a fantastic idea.",
          "created_utc": 1625352688.0
        }
      ]
    },
    {
      "id": "h3yyfrr",
      "author": "Haunting-Elephant618",
      "body": "Thank you!!!",
      "created_utc": 1625355563.0,
      "score": 1,
      "context": [
        {
          "id": "h3yjm4x",
          "author": "thats_scrummy",
          "body": "Biggest thing to remember, like someone mentioned above, is that not all eating disorders are the same. There’s anorexia, binge eating, bulimia, binge/purge, exercise bulimia, etc and different severities. For example, I am a binger/calorie restrictor and after trying several different things with my therapist she said she thought that my issue was a food/eating addiction. I’m now a member of Overeaters Anonymous which I didn’t even know was a thing until I googled “community for food addicts”. It’s also a home for all kinds of eating disorders. Many people don’t know about it - I didn’t, and neither did my therapist. But it has been the BIGGEST help. I call OA, therapy, and my nutritionist my Holy Trinity.",
          "created_utc": 1625347116.0
        },
        {
          "id": "h3yvo0v",
          "author": "Haunting-Elephant618",
          "body": "I’ll have to check and see if there’s OA available around my area. I’ve heard of it, but I’m glad you mentioned it because had also kind of forgotten about it as a resource. Would be helpful to know what’s around me to be able to give out the information when applicable.",
          "created_utc": 1625353920.0
        },
        {
          "id": "h3ywxhf",
          "author": "thats_scrummy",
          "body": "Lots are still happening over Zoom because of COVID and there’s even a subreddit for it. You can search for your area at oa.org.",
          "created_utc": 1625354674.0
        }
      ]
    },
    {
      "id": "h3yyya8",
      "author": "Haunting-Elephant618",
      "body": "Found one! I’ll be adding it to my list of resources for my area. Thank you again for mentioning this!",
      "created_utc": 1625355871.0,
      "score": 1,
      "context": [
        {
          "id": "h3yjm4x",
          "author": "thats_scrummy",
          "body": "Biggest thing to remember, like someone mentioned above, is that not all eating disorders are the same. There’s anorexia, binge eating, bulimia, binge/purge, exercise bulimia, etc and different severities. For example, I am a binger/calorie restrictor and after trying several different things with my therapist she said she thought that my issue was a food/eating addiction. I’m now a member of Overeaters Anonymous which I didn’t even know was a thing until I googled “community for food addicts”. It’s also a home for all kinds of eating disorders. Many people don’t know about it - I didn’t, and neither did my therapist. But it has been the BIGGEST help. I call OA, therapy, and my nutritionist my Holy Trinity.",
          "created_utc": 1625347116.0
        },
        {
          "id": "h3yvo0v",
          "author": "Haunting-Elephant618",
          "body": "I’ll have to check and see if there’s OA available around my area. I’ve heard of it, but I’m glad you mentioned it because had also kind of forgotten about it as a resource. Would be helpful to know what’s around me to be able to give out the information when applicable.",
          "created_utc": 1625353920.0
        },
        {
          "id": "h3ywxhf",
          "author": "thats_scrummy",
          "body": "Lots are still happening over Zoom because of COVID and there’s even a subreddit for it. You can search for your area at oa.org.",
          "created_utc": 1625354674.0
        }
      ]
    },
    {
      "id": "h42vvxi",
      "author": "Haunting-Elephant618",
      "body": "That makes me sad that professionals don’t go to the best source available: people who experience it. Whether it’s ED or any other mental health diagnosis, learning from those who experience it is invaluable.",
      "created_utc": 1625444987.0,
      "score": 2,
      "context": [
        {
          "id": "h3zmi3t",
          "author": "courtenax",
          "body": "Jennifer Rollin has training courses! She’s a specialised therapist who also went through the it herself.  Highly highly recommend.\n\nLook into what diet culture is as I think that helps see how SO MANY things that have become part of our every day life and language and can be immensely triggering.\n\nGet the ED voice to trust you.  understanding personal history has been helpful for me, everyone is so different and thereasons EDs develop vary significantly.  It’s helped me to look for what purposes it serves. It helps me feel safe that my therapist never ever pushes me if we find that it’s still serving one or more those purposes (I also have trauma history and PTSD), she only encourages me challenge/process the root causes (note: I’m also in the beginning stages of this, it’s been almost a year since I’ve been slowly accepting that I even have an ED.)\n\nBefore I started seeing her I had to have a standing appointment with a nutritionist as a requirement, she doesn’t handle specific nutrition or physical health at all but is a part of my team.  The most important part right now because I don’t trust any of the other ones yet haha - if someone were to ask me to log food I’d FREAK out, the thought makes me immediately so ashamed of my intake and want to restrict even more",
          "created_utc": 1625370651.0
        },
        {
          "id": "h40trci",
          "author": "Haunting-Elephant618",
          "body": "Thank you!! I’ll look into Jennifer Rollin, I’m definitely looking for as much training as I can find. \n\nDiet culture - I loathe and despise diet culture. I grew up in the 80’s and 90’s with a mom who always commented on how “fat” she was. Seeing her go through various diets, workout fads, etc. She has since maintained a weight she’s content with, but still buys “diet” food, and I’m regularly having to remind her not to talk about her weight or how she looks around my kids. She tries, occasionally slips, but she definitely tries. I know just how this impacted me as a kid/teen and as an adult seeing the ads and various fads irritate me to no end. \n\nThe food journal, that’s a really good point. Seems like it would need to be very individualized.",
          "created_utc": 1625406549.0
        },
        {
          "id": "h42st5v",
          "author": "courtenax",
          "body": "It sounds to me like you’re already on your way to being a great help! Most people wouldn’t even ask us, thank you :)",
          "created_utc": 1625443127.0
        }
      ]
    },
    {
      "id": "h3z9ws3",
      "author": "None",
      "body": "The most I told them was that I had an ED and that I was feeling suicidal, and that's all it took for them to react like that. I'm not in America, but I know that the rules are very similar here. Confidentiality can only be broken if the client is a danger to themselves or someone else, and now I don't know what counts as that, so now I'm scared to tell future counsellors anything.",
      "created_utc": 1625362659.0,
      "score": 2,
      "context": [
        {
          "id": "h3xz2w0",
          "author": "None",
          "body": "When I tried to speak to a counsellor (not the same, but it works) about my ED, she immediately wanted me to tell my parents and threatened to call the police if I didn't let them speak to my parents because I was a threat to myself. This was the first day I've spoken to this woman. Rlly put me off of sharing stuff and gave me trust issues",
          "created_utc": 1625336271.0
        },
        {
          "id": "h3yscr1",
          "author": "Haunting-Elephant618",
          "body": "Omg! That’s awful! I work with teens who self-harm through cutting and they ask me if I’m going to tell their parents. And especially if they’re age of consent in MH (14 in my state) the answer is “I will only breach confidentiality if you’re suicidal or homicidal and I believe there’s immediate risk. But we’re going to talk about it *together* before anything is done.” And I’ve had that happen, and instead of freaking out (like many newer therapist may) we talk, I obviously assess for plan, means, intent (the usual) and in the end the client and I often call together or if the parent is in the waiting room we’ll invite them to join the session. Sometimes they want me to talk and sometimes they take the lead. Sometimes they text instead of call. It depends on the situation, but I find having a conversation rather than becoming an alarmist not only keeps the rapport, it also helps the teen begin to have more dialogue with their parents. If parents are not supportive, then we may do a contract for safety, create a safety plan together, or contact crisis together if they can’t contract for safety. Panicking doesn’t help anything. And I’d hope that for ED, I’d be taking a similar approach that I used for self-harm.",
          "created_utc": 1625351990.0
        },
        {
          "id": "h3yv2f7",
          "author": "None",
          "body": "Yh, they told me they had to speak with my parents and when I told them I wasn't comfortable with that, they said they were legally obligated to, and said that the only other option was calling the police. When I thought the session was over (this was through an online service, it was a rlly reputable and trusted company that everybody pointed to as \"the perfect service\") and put my phone down, theyd blow it up every 5 minutes and threaten to call the cops if I didn't reply within 15. This gave me so much anxiety that every notification physically stopped my breath and made me shake.",
          "created_utc": 1625353566.0
        },
        {
          "id": "h3yy2fh",
          "author": "Haunting-Elephant618",
          "body": "Yikes! That sounds like quite the overreaction on the therapist’s part. It may depend on state and licensing boards, but in general SI/HI with plan, means, and intent are the grounds for breaking confidentiality (and child/elder abuse/neglect). I have clients who have chronic SI, they have plans and means, but will deny intent. We come up with safety plans, I make sure they have the crisis #, and get a contract for safety.",
          "created_utc": 1625355345.0
        }
      ]
    },
    {
      "id": "h3ype94",
      "author": "KryptonionNipple",
      "body": "Definitely not. I'm just fortunate I have my husband to keep me sane",
      "created_utc": 1625350304.0,
      "score": 3,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        },
        {
          "id": "h3yf04h",
          "author": "HubbyHasBlueBalls",
          "body": "That’s awful. I have selective mutism, so the concept that this was your experience is horrifying to me in itself. Now, I have enough trauma from treatment that I would probably start sobbing and not be able to stop with any new provider put in front of me. \nIf you ever feel brave enough or safe enough to reach out for support again, maybe email/ call/ etc ahead of time and see if they would allow you to write down what’s going on internally.  I’ve had two separate therapists allow me to write in session, and never had someone tell me no. I’m so sorry this has been your experience.",
          "created_utc": 1625344633.0
        },
        {
          "id": "h3ykzju",
          "author": "KryptonionNipple",
          "body": "Yeah, I think that would be the plan. If there is a next time. \n\nThe big problem is I can't get help because I'm not \"bad enough\".\n\nNot even when my depression was that low I tried to kill myself. Or when I made plans to kill myself, now husband and our cats. \n\nThe UK isn't as good as they make out they are.",
          "created_utc": 1625347859.0
        },
        {
          "id": "h3ymeeb",
          "author": "HubbyHasBlueBalls",
          "body": "Oh goodness. Honestly, I haven’t heard anything positive about UK’s mental health care, at least what is provided by the NHS. Hugs. It shouldn’t be that way.",
          "created_utc": 1625348636.0
        }
      ]
    },
    {
      "id": "h3z1hpm",
      "author": "KryptonionNipple",
      "body": "Yeah. It's only been the past few years that I realised I may have been groomed. I've not spoken to a therapist yet, but I was going to do Covid-Testing in a school. So had to do a few online, learning sessions. \n\nAnd it felt like the session unplugged a full sink. All the water flushes down the pipe and I had to leave because I couldn't stop crying. \n\n\"Look for these signs\" \"yup I went through all that\"\n\nI know I was in an abusive relationship which started a lot of shit. But didn't realise that this could have happened to me as well.",
      "created_utc": 1625357421.0,
      "score": 2,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        },
        {
          "id": "h3yf04h",
          "author": "HubbyHasBlueBalls",
          "body": "That’s awful. I have selective mutism, so the concept that this was your experience is horrifying to me in itself. Now, I have enough trauma from treatment that I would probably start sobbing and not be able to stop with any new provider put in front of me. \nIf you ever feel brave enough or safe enough to reach out for support again, maybe email/ call/ etc ahead of time and see if they would allow you to write down what’s going on internally.  I’ve had two separate therapists allow me to write in session, and never had someone tell me no. I’m so sorry this has been your experience.",
          "created_utc": 1625344633.0
        },
        {
          "id": "h3ykzju",
          "author": "KryptonionNipple",
          "body": "Yeah, I think that would be the plan. If there is a next time. \n\nThe big problem is I can't get help because I'm not \"bad enough\".\n\nNot even when my depression was that low I tried to kill myself. Or when I made plans to kill myself, now husband and our cats. \n\nThe UK isn't as good as they make out they are.",
          "created_utc": 1625347859.0
        },
        {
          "id": "h3z167b",
          "author": "Haunting-Elephant618",
          "body": "Holy hell!! I see people with a wide range of severity when it comes to mental health. Some are university students who are trying to adapt to stressors that come with living out of the home for the first time and some have severe depression with self harm who often experience suicidal thoughts. They all need help with various things and I’m there to support them (that’s the goal anyway), without judgment based on how bad things are or if it’s “bad enough.” I definitely have people who will ask if what they are experiencing is bad enough for therapy and I tell them that anyone and everyone can benefit from therapy, regardless of what’s going on. It’s not about being “bad enough” it’s about getting help when it’s needed or wanted. \n\nI’m sorry the UK isn’t recognizing that need. I’m in the US and our healthcare system sucks, and mental health is underfunded but thankfully most insurance companies approve outpatient therapy pretty easily.",
          "created_utc": 1625357224.0
        }
      ]
    },
    {
      "id": "h4awyfo",
      "author": "courtenax",
      "body": "I agree, thank you!! Also something I’ve been experiencing is that Medical doctors usually (and even frequently dieticians/nutritionists) don’t fully understand EDs.. if you do end up working with a lot of ED clients I’d recommend reading Sick Enough by Jennifer Gaudiani.  Unfortunately sometimes therapists go to bat when the rest of the healthcare world is dangerously uneducated.",
      "created_utc": 1625619651.0,
      "score": 2,
      "context": [
        {
          "id": "h3zmi3t",
          "author": "courtenax",
          "body": "Jennifer Rollin has training courses! She’s a specialised therapist who also went through the it herself.  Highly highly recommend.\n\nLook into what diet culture is as I think that helps see how SO MANY things that have become part of our every day life and language and can be immensely triggering.\n\nGet the ED voice to trust you.  understanding personal history has been helpful for me, everyone is so different and thereasons EDs develop vary significantly.  It’s helped me to look for what purposes it serves. It helps me feel safe that my therapist never ever pushes me if we find that it’s still serving one or more those purposes (I also have trauma history and PTSD), she only encourages me challenge/process the root causes (note: I’m also in the beginning stages of this, it’s been almost a year since I’ve been slowly accepting that I even have an ED.)\n\nBefore I started seeing her I had to have a standing appointment with a nutritionist as a requirement, she doesn’t handle specific nutrition or physical health at all but is a part of my team.  The most important part right now because I don’t trust any of the other ones yet haha - if someone were to ask me to log food I’d FREAK out, the thought makes me immediately so ashamed of my intake and want to restrict even more",
          "created_utc": 1625370651.0
        },
        {
          "id": "h40trci",
          "author": "Haunting-Elephant618",
          "body": "Thank you!! I’ll look into Jennifer Rollin, I’m definitely looking for as much training as I can find. \n\nDiet culture - I loathe and despise diet culture. I grew up in the 80’s and 90’s with a mom who always commented on how “fat” she was. Seeing her go through various diets, workout fads, etc. She has since maintained a weight she’s content with, but still buys “diet” food, and I’m regularly having to remind her not to talk about her weight or how she looks around my kids. She tries, occasionally slips, but she definitely tries. I know just how this impacted me as a kid/teen and as an adult seeing the ads and various fads irritate me to no end. \n\nThe food journal, that’s a really good point. Seems like it would need to be very individualized.",
          "created_utc": 1625406549.0
        },
        {
          "id": "h42st5v",
          "author": "courtenax",
          "body": "It sounds to me like you’re already on your way to being a great help! Most people wouldn’t even ask us, thank you :)",
          "created_utc": 1625443127.0
        },
        {
          "id": "h42vvxi",
          "author": "Haunting-Elephant618",
          "body": "That makes me sad that professionals don’t go to the best source available: people who experience it. Whether it’s ED or any other mental health diagnosis, learning from those who experience it is invaluable.",
          "created_utc": 1625444987.0
        }
      ]
    },
    {
      "id": "h40rmd5",
      "author": "Haunting-Elephant618",
      "body": "I’ve had clients who have been afraid I’d send them to the hospital if they told me certain things. If you decide to try therapy again, maybe ask them about their policies on certain things to gauge how they react.",
      "created_utc": 1625405302.0,
      "score": 1,
      "context": [
        {
          "id": "h3xz2w0",
          "author": "None",
          "body": "When I tried to speak to a counsellor (not the same, but it works) about my ED, she immediately wanted me to tell my parents and threatened to call the police if I didn't let them speak to my parents because I was a threat to myself. This was the first day I've spoken to this woman. Rlly put me off of sharing stuff and gave me trust issues",
          "created_utc": 1625336271.0
        },
        {
          "id": "h3yscr1",
          "author": "Haunting-Elephant618",
          "body": "Omg! That’s awful! I work with teens who self-harm through cutting and they ask me if I’m going to tell their parents. And especially if they’re age of consent in MH (14 in my state) the answer is “I will only breach confidentiality if you’re suicidal or homicidal and I believe there’s immediate risk. But we’re going to talk about it *together* before anything is done.” And I’ve had that happen, and instead of freaking out (like many newer therapist may) we talk, I obviously assess for plan, means, intent (the usual) and in the end the client and I often call together or if the parent is in the waiting room we’ll invite them to join the session. Sometimes they want me to talk and sometimes they take the lead. Sometimes they text instead of call. It depends on the situation, but I find having a conversation rather than becoming an alarmist not only keeps the rapport, it also helps the teen begin to have more dialogue with their parents. If parents are not supportive, then we may do a contract for safety, create a safety plan together, or contact crisis together if they can’t contract for safety. Panicking doesn’t help anything. And I’d hope that for ED, I’d be taking a similar approach that I used for self-harm.",
          "created_utc": 1625351990.0
        },
        {
          "id": "h3yv2f7",
          "author": "None",
          "body": "Yh, they told me they had to speak with my parents and when I told them I wasn't comfortable with that, they said they were legally obligated to, and said that the only other option was calling the police. When I thought the session was over (this was through an online service, it was a rlly reputable and trusted company that everybody pointed to as \"the perfect service\") and put my phone down, theyd blow it up every 5 minutes and threaten to call the cops if I didn't reply within 15. This gave me so much anxiety that every notification physically stopped my breath and made me shake.",
          "created_utc": 1625353566.0
        },
        {
          "id": "h3yy2fh",
          "author": "Haunting-Elephant618",
          "body": "Yikes! That sounds like quite the overreaction on the therapist’s part. It may depend on state and licensing boards, but in general SI/HI with plan, means, and intent are the grounds for breaking confidentiality (and child/elder abuse/neglect). I have clients who have chronic SI, they have plans and means, but will deny intent. We come up with safety plans, I make sure they have the crisis #, and get a contract for safety.",
          "created_utc": 1625355345.0
        },
        {
          "id": "h3z9ws3",
          "author": "None",
          "body": "The most I told them was that I had an ED and that I was feeling suicidal, and that's all it took for them to react like that. I'm not in America, but I know that the rules are very similar here. Confidentiality can only be broken if the client is a danger to themselves or someone else, and now I don't know what counts as that, so now I'm scared to tell future counsellors anything.",
          "created_utc": 1625362659.0
        }
      ]
    },
    {
      "id": "h3z2r5z",
      "author": "Haunting-Elephant618",
      "body": "I hope you can get in to see someone that is helpful, listens to you, and meets you were you are.",
      "created_utc": 1625358206.0,
      "score": 2,
      "context": [
        {
          "id": "h3ya5ge",
          "author": "KryptonionNipple",
          "body": "Please, please give them the option to write how they feel on paper.\n\nI physically can't talk to a therapist because I can't stop crying. I asked if I could write it and they always said no. \n\nSo now I refuse therapy because they don't listen to me. But feel if I could have written it then I wouldn't keep flip flopping with my ED, PTSD, OCPD, Anxiety and Depression. Lovely how they diagnosed me but didn't help me. 🙄",
          "created_utc": 1625342077.0
        },
        {
          "id": "h3yf04h",
          "author": "HubbyHasBlueBalls",
          "body": "That’s awful. I have selective mutism, so the concept that this was your experience is horrifying to me in itself. Now, I have enough trauma from treatment that I would probably start sobbing and not be able to stop with any new provider put in front of me. \nIf you ever feel brave enough or safe enough to reach out for support again, maybe email/ call/ etc ahead of time and see if they would allow you to write down what’s going on internally.  I’ve had two separate therapists allow me to write in session, and never had someone tell me no. I’m so sorry this has been your experience.",
          "created_utc": 1625344633.0
        },
        {
          "id": "h3ykzju",
          "author": "KryptonionNipple",
          "body": "Yeah, I think that would be the plan. If there is a next time. \n\nThe big problem is I can't get help because I'm not \"bad enough\".\n\nNot even when my depression was that low I tried to kill myself. Or when I made plans to kill myself, now husband and our cats. \n\nThe UK isn't as good as they make out they are.",
          "created_utc": 1625347859.0
        },
        {
          "id": "h3z167b",
          "author": "Haunting-Elephant618",
          "body": "Holy hell!! I see people with a wide range of severity when it comes to mental health. Some are university students who are trying to adapt to stressors that come with living out of the home for the first time and some have severe depression with self harm who often experience suicidal thoughts. They all need help with various things and I’m there to support them (that’s the goal anyway), without judgment based on how bad things are or if it’s “bad enough.” I definitely have people who will ask if what they are experiencing is bad enough for therapy and I tell them that anyone and everyone can benefit from therapy, regardless of what’s going on. It’s not about being “bad enough” it’s about getting help when it’s needed or wanted. \n\nI’m sorry the UK isn’t recognizing that need. I’m in the US and our healthcare system sucks, and mental health is underfunded but thankfully most insurance companies approve outpatient therapy pretty easily.",
          "created_utc": 1625357224.0
        },
        {
          "id": "h3z1hpm",
          "author": "KryptonionNipple",
          "body": "Yeah. It's only been the past few years that I realised I may have been groomed. I've not spoken to a therapist yet, but I was going to do Covid-Testing in a school. So had to do a few online, learning sessions. \n\nAnd it felt like the session unplugged a full sink. All the water flushes down the pipe and I had to leave because I couldn't stop crying. \n\n\"Look for these signs\" \"yup I went through all that\"\n\nI know I was in an abusive relationship which started a lot of shit. But didn't realise that this could have happened to me as well.",
          "created_utc": 1625357421.0
        }
      ]
    },
    {
      "id": "h4b0huk",
      "author": "Haunting-Elephant618",
      "body": "Thank you for the book recommendation!! I’m currently reading Life Without Ed and it’s such a good read.",
      "created_utc": 1625621515.0,
      "score": 1,
      "context": [
        {
          "id": "h3zmi3t",
          "author": "courtenax",
          "body": "Jennifer Rollin has training courses! She’s a specialised therapist who also went through the it herself.  Highly highly recommend.\n\nLook into what diet culture is as I think that helps see how SO MANY things that have become part of our every day life and language and can be immensely triggering.\n\nGet the ED voice to trust you.  understanding personal history has been helpful for me, everyone is so different and thereasons EDs develop vary significantly.  It’s helped me to look for what purposes it serves. It helps me feel safe that my therapist never ever pushes me if we find that it’s still serving one or more those purposes (I also have trauma history and PTSD), she only encourages me challenge/process the root causes (note: I’m also in the beginning stages of this, it’s been almost a year since I’ve been slowly accepting that I even have an ED.)\n\nBefore I started seeing her I had to have a standing appointment with a nutritionist as a requirement, she doesn’t handle specific nutrition or physical health at all but is a part of my team.  The most important part right now because I don’t trust any of the other ones yet haha - if someone were to ask me to log food I’d FREAK out, the thought makes me immediately so ashamed of my intake and want to restrict even more",
          "created_utc": 1625370651.0
        },
        {
          "id": "h40trci",
          "author": "Haunting-Elephant618",
          "body": "Thank you!! I’ll look into Jennifer Rollin, I’m definitely looking for as much training as I can find. \n\nDiet culture - I loathe and despise diet culture. I grew up in the 80’s and 90’s with a mom who always commented on how “fat” she was. Seeing her go through various diets, workout fads, etc. She has since maintained a weight she’s content with, but still buys “diet” food, and I’m regularly having to remind her not to talk about her weight or how she looks around my kids. She tries, occasionally slips, but she definitely tries. I know just how this impacted me as a kid/teen and as an adult seeing the ads and various fads irritate me to no end. \n\nThe food journal, that’s a really good point. Seems like it would need to be very individualized.",
          "created_utc": 1625406549.0
        },
        {
          "id": "h42st5v",
          "author": "courtenax",
          "body": "It sounds to me like you’re already on your way to being a great help! Most people wouldn’t even ask us, thank you :)",
          "created_utc": 1625443127.0
        },
        {
          "id": "h42vvxi",
          "author": "Haunting-Elephant618",
          "body": "That makes me sad that professionals don’t go to the best source available: people who experience it. Whether it’s ED or any other mental health diagnosis, learning from those who experience it is invaluable.",
          "created_utc": 1625444987.0
        },
        {
          "id": "h4awyfo",
          "author": "courtenax",
          "body": "I agree, thank you!! Also something I’ve been experiencing is that Medical doctors usually (and even frequently dieticians/nutritionists) don’t fully understand EDs.. if you do end up working with a lot of ED clients I’d recommend reading Sick Enough by Jennifer Gaudiani.  Unfortunately sometimes therapists go to bat when the rest of the healthcare world is dangerously uneducated.",
          "created_utc": 1625619651.0
        }
      ]
    },
    {
      "id": "h41qntk",
      "author": "None",
      "body": "Most definitely will. Although, any sort of therapy seems to be out of reach at the moment, I'll definitely ask them about that.",
      "created_utc": 1625422971.0,
      "score": 2,
      "context": [
        {
          "id": "h3xz2w0",
          "author": "None",
          "body": "When I tried to speak to a counsellor (not the same, but it works) about my ED, she immediately wanted me to tell my parents and threatened to call the police if I didn't let them speak to my parents because I was a threat to myself. This was the first day I've spoken to this woman. Rlly put me off of sharing stuff and gave me trust issues",
          "created_utc": 1625336271.0
        },
        {
          "id": "h3yscr1",
          "author": "Haunting-Elephant618",
          "body": "Omg! That’s awful! I work with teens who self-harm through cutting and they ask me if I’m going to tell their parents. And especially if they’re age of consent in MH (14 in my state) the answer is “I will only breach confidentiality if you’re suicidal or homicidal and I believe there’s immediate risk. But we’re going to talk about it *together* before anything is done.” And I’ve had that happen, and instead of freaking out (like many newer therapist may) we talk, I obviously assess for plan, means, intent (the usual) and in the end the client and I often call together or if the parent is in the waiting room we’ll invite them to join the session. Sometimes they want me to talk and sometimes they take the lead. Sometimes they text instead of call. It depends on the situation, but I find having a conversation rather than becoming an alarmist not only keeps the rapport, it also helps the teen begin to have more dialogue with their parents. If parents are not supportive, then we may do a contract for safety, create a safety plan together, or contact crisis together if they can’t contract for safety. Panicking doesn’t help anything. And I’d hope that for ED, I’d be taking a similar approach that I used for self-harm.",
          "created_utc": 1625351990.0
        },
        {
          "id": "h3yv2f7",
          "author": "None",
          "body": "Yh, they told me they had to speak with my parents and when I told them I wasn't comfortable with that, they said they were legally obligated to, and said that the only other option was calling the police. When I thought the session was over (this was through an online service, it was a rlly reputable and trusted company that everybody pointed to as \"the perfect service\") and put my phone down, theyd blow it up every 5 minutes and threaten to call the cops if I didn't reply within 15. This gave me so much anxiety that every notification physically stopped my breath and made me shake.",
          "created_utc": 1625353566.0
        },
        {
          "id": "h3yy2fh",
          "author": "Haunting-Elephant618",
          "body": "Yikes! That sounds like quite the overreaction on the therapist’s part. It may depend on state and licensing boards, but in general SI/HI with plan, means, and intent are the grounds for breaking confidentiality (and child/elder abuse/neglect). I have clients who have chronic SI, they have plans and means, but will deny intent. We come up with safety plans, I make sure they have the crisis #, and get a contract for safety.",
          "created_utc": 1625355345.0
        },
        {
          "id": "h3z9ws3",
          "author": "None",
          "body": "The most I told them was that I had an ED and that I was feeling suicidal, and that's all it took for them to react like that. I'm not in America, but I know that the rules are very similar here. Confidentiality can only be broken if the client is a danger to themselves or someone else, and now I don't know what counts as that, so now I'm scared to tell future counsellors anything.",
          "created_utc": 1625362659.0
        },
        {
          "id": "h40rmd5",
          "author": "Haunting-Elephant618",
          "body": "I’ve had clients who have been afraid I’d send them to the hospital if they told me certain things. If you decide to try therapy again, maybe ask them about their policies on certain things to gauge how they react.",
          "created_utc": 1625405302.0
        }
      ]
    }
  ]
}