{
  "id": "og3ozf",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1625736207.0,
  "title": "Request: Watching Myself Lose Weight Is Triggering- Everyone Commenting On It Is Hell.",
  "selftext": "I'm gonna try to give you the background info as quick as possible:\n\n&#x200B;\n\nStruggled with eating disorders my whole life, starting at about 12 or so. Really toxic family-you're familiar I'm sure. I don't want to get into the specifics of how unhealthy my relationship with food and exercise was- but I was big into pro-ana tumblr if that gives you some kind of measure of where my head was at. Somewhere in 2015/16 I started working on it and became more comfortable with food, and slowly over time I just.. abandoned all diet and exercise. I felt like I couldn't handle looking at any kind of nutrition or workout routine in a healthy way so I just tuned it all out. Not so shockingly, I ended up putting on a lot of weight. But to be honest, I didn't mind. I liked not having the stress of diet or exercise preying on my every move and destroying my mental health. I didn't love my body but I was accepting of her new look and figured it was a fair trade for not having to think about food/workingout/looking perfect all the time. That's the background story, more or less.\n\n&#x200B;\n\nAnyway, Completely ignoring and avoiding something is not the same as healing from it and I came to recognize that. Since 2020 I've been slowly working on making healthier choices and being a little more active. And I liked it! This year I've started doing lots of activities that I've missed and feeling really good doing them. The last time I was active, it was a means to an end- I enjoyed the results and the process was sacrifice to achieve it. I forgot how great it is to run just for the pleasure of running. Physical activity feels amazing and brings me so much happiness! And I've been healing my relationship with food, making healthy choices for health's sake while still enjoying some less-than-healthy favorites. Honestly? I'm really happy with where I'm at and how I got here. It took years and I'm only excited to see where this goes. I would love to become more physically capable so I can enjoy more achievements within my new hobbies.\n\n&#x200B;\n\nHere's where it gets sticky:\n\n&#x200B;\n\nAna sits on my shoulder like a devil and whispers into my ear. I've noticed my own weight loss and I try not to give it too much space in my life. A part of me will always have that ED and I have to deal with that everytime I look in the mirror. That's a struggle on it's own, but one I've been managing.Everyone else, however, keeps commenting on my weight loss and its devastating. I'm aware that I've lost weight but I have been so so careful to make sure it's not a focal point for me. I don't count any calories or look at portions and I don't weigh or measure myself. I measure my progress in what I'm physically capable of. A few months ago I could barely run 3km. Last week, I ran 13km! I've put in a lot of work and I'm finally seeing progress.\n\n&#x200B;\n\nI said that to a friend recently: that I had run 13km and I was happy to be seeing progress and he said, \"I'll say you can see progress! That shirt's hanging off you like a tent!\" A few people joined in behind him, remarking on my weight loss, singing my praises. My heart shattered. Weight loss hadn't even occurred to me as something worth being proud of. It was just a side-effect of my hard work. There I was beaming about my accomplishment and it was inconsequential compared to how i looked.\n\n&#x200B;\n\nNot only do I have to work extra hard to make sure I keep my mind focused on what's important so I don't slip into a bad place- But that now that task feels impossible since it seems that everyone only cares about weight. It feels like I could run a marathon and they'd tell me how amazing I Look.\n\n&#x200B;\n\nAt this point, I'm disheartened. I haven't even lost that much weight (posting numbers is against the rules, but believe me, it hasn't been much and it's been over the course of months) and EVERYONE comments on it. I don't have a single person in my life who hasn't brought it up. It makes me sick and honestly? It makes me want to quit doing anything just so people stop talking about my body and my weight.\n\n&#x200B;\n\nAnd I'm terrified the more I get praised and complimented for my weight loss- the louder Ana gets. The validation of people liking me and liking my appearance more is equal parts saddening and tempting. I haven't slipped up yet: I'm still eating well and I'm not over exerting myself but I am thinking about my weight and my body more. I'm finding myself longing for more weight loss- and this wasn't the case before people started commenting.\n\n&#x200B;\n\nI needed that off my chest, but I'm also looking for advice. It's a struggle quieting my own mind against ED... but the struggle of standing up to others and quieting their voices in my mentalscape was a challenge I wasn't prepared for. I don't think people will understand if I try to explain, but then again how can I get them to take it seriously and stop fucking talking about it?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/og3ozf/request_watching_myself_lose_weight_is_triggering/",
  "score": 83,
  "num_comments": 9,
  "comments": [
    {
      "id": "h4gihbs",
      "author": "Aliinga",
      "body": ">Weight loss hadn't even occurred to me as something worth being proud of. It was just a side-effect of my hard work.\n\nPlease hold onto this thought. Your text began with saying that weight loss used to be your goal and exercise only the sacrifice or 'side effect' you had to go through. Now you managed to completely turn your thinking upside down to seeing weight loss as the side effect of a healthier and happier life style instead - but not a goal in and of itself. That is such a huge step. \n\nAll I can do is encourage you always remember this way of thinking. Writing down as a daily affirmation if it helps. And do tell people that. \"I am doing this for my happiness, not weight loss\" - and if they are sensitive enough people they should get the message. If not, it is fair to just call out people and ask them not to make it about weight loss but instead ask you if you are feeling better. It's just asking them to re-frame the same thought and shift focus to well-being rather than assuming that weight loss = happiness. (\"You can inquire about my happiness without mentioning weight loss\")\n\nAnd always consider getting help with making healthy choices without re-activating an eating disorder if it is necessary",
      "created_utc": 1625739800.0,
      "score": 17,
      "context": []
    },
    {
      "id": "h4gi3m1",
      "author": "idkwhatimkindalost25",
      "body": "I’ve been through something similar. I had to say it straight, please never comment my weight again. Worked. BUT the eyeballing is never fun anyways, cant do much about it anyways… idk.. also I am happy your addressing this and taking it seriously, it’s really important :)",
      "created_utc": 1625739462.0,
      "score": 9,
      "context": []
    },
    {
      "id": "h4j9hbf",
      "author": "BedroomImpossible124",
      "body": "I once read in the New York Times Social Qs column this response to questions about one's weight: \"Let's skip my body as a subject of conversation. It makes me uncomfortable \". I took a screenshot to occasionally remind myself of this if ever needed.",
      "created_utc": 1625789017.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h4hrdmg",
      "author": "Mom_of_furry_stonk",
      "body": "I struggled with this so much. I went from severe ana to binging. I did get to a point where I reduced how much I was eating. It has taken a lot of time to relearn healthy habits. My husband has been a huge support to me and never allows me to skip a meal. He saw me at my worst at 80 lbs and is terrified of losing me to ana again. You are doing a great job recovering. Do your best to ignore comments about weight.",
      "created_utc": 1625763795.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h4idt8r",
      "author": "WhovianGirl777",
      "body": "Society has taught people to value weight over strengths me ability. That's why the people make these types of comments.\n\nWhenever they make a weight comment, correct it with something like , \"yea, you're right, I have been able to run a lot longer than before.\" Or \"yea, my max weight has really increased in the last few weeks.\"  Eventually they will take the hint and stop making physical comments. Try to make the comments about your growth rather than your loss. \n\nPeople only see sacrifice when it comes to health. They stopped eating carbs, or stopped drinking their favorite soda. It's like anything but sacrifice is not valid. \n\nIf they don't stop the comments, consider stopping them from being a part of your life.",
      "created_utc": 1625773702.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h4jg6p0",
      "author": "malavika9",
      "body": "If they’re not impressed by your amazing strength improvement it’s because most people aren’t aware of EDs and how it affects people. Don’t know if this helps but I am sooo proud of you, you did great! Your mindset is perfect! Good luck for everything!",
      "created_utc": 1625792632.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h4gelyz",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1625736207.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4mv6lb",
      "author": "None",
      "body": "Heya! Honestly it sounds like you’re doing really well. It would be a shame to stop doing something you enjoy and enjoy seeing improvement in because of other people’s ignorance. I guess I’d say to see if you can reframe the conversation to be more along the lines of “yeah I guess that’s from training really hard to build my stamina the past couple of months. I’m hoping to reach ...km by next month” . That way people can refocus on what you are doing instead of just how you’re looking.",
      "created_utc": 1625865228.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h4qlzer",
      "author": "ChubbyPupstar",
      "body": "I’m so sorry this is all so hard. You are right that unless you are or have dealt with EDOs; you have NO IDEA how hard, all consuming, complex and exhausting it is. I am speaking from the voice of a learning mom of a child with an ED. I am enlightened everyday. (Wonder if I have some tendencies since I feel like it’s really easy to understand all the things that other family members of those with EDs say the have a hard time understanding.)\nThat said, don’t know if I have any useful advice, but to say that staying very connected to not only a therapist who specializes in ED, as well as a support group will be very helpful to be able to discuss and work on processing through these feelings and emotions will probably be very helpful. Also realize that you likely work with others who have gone through or are going through similar things currently. Once I started to discuss things with some co-workers, I was blown away at how many shared that they experience either with another family member or even themselves. I can’t believe how hard and more complex this all is, but you’re not alone! Stay open. Stay connected! Hopefully Reddit helps too- but seek as many supports as you can. Lose the ones that aren’t helpful. Be proud of your accomplishments. Be proud that you’re recognizing where your May be hitting a tough edge and be proud that you’re concerned and honest enough to be trying to head that off now! Stay true to yourself!",
      "created_utc": 1625950047.0,
      "score": 1,
      "context": []
    }
  ]
}