{
  "id": "ojewxu",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1626180641.0,
  "title": "Request: How can I recover from an ED when nobody is on my side and I have no money",
  "selftext": " \n\nI (19f with autism) have had an eating disorder for about half a year- not sure how to label it, but I heavily restrict calories and am at a point where I no longer feel hungry and all food tastes bad to me… I can only manage a few bites of food I used to love because the taste is so sour in my mouth. I have also been finding whenever I eat I get bad stomach aches- not sure if that’s anxiety or if my body can’t handle food anymore.\n\nMy parents (who i still life with) are obsessive about food and have told me my whole life that I was too fat and need to eat less (I have never been overweight in my life, they just have an obsession with me being bone thin). Lately since I have lost a lot of weight they have been telling me I look good and are proud of me for losing weight. I have lightly tried to tell them that I have an eating disorder and it doesn’t help when they encourage it but I am always met with “we are just trying to make sure you’re healthy” and end up yelling at me and sometimes crying.\n\nI am not in a position to get a job, so I cannot afford therapy, plus I don’t know how I’d get there since I don’t have a car and my parents can’t know I’m going to therapy. I am scared I am going to cause irreversible damage on my body and I don’t want to feel like this anymore. Does anyone know of free online Ed recovery or other tricks that helped them? I am desperate.\n\nThank you",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ojewxu/request_how_can_i_recover_from_an_ed_when_nobody/",
  "score": 61,
  "num_comments": 6,
  "comments": [
    {
      "id": "h51ryjs",
      "author": "bibibirdie99",
      "body": "The Alliance for EDs also has free virtual support groups multiple times a week: https://www.allianceforeatingdisorders.com/recovery-programs-and-support/",
      "created_utc": 1626191795.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h529hd0",
      "author": "Freckles2000m",
      "body": "We are on your side ❤️ sending you lots of love and strength",
      "created_utc": 1626199497.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h51829p",
      "author": "MentallyFucked127",
      "body": "I used to be apart of an online group called MEDA. I don't know where youre from but they're located in Massachusetts and most of the people are from there as well but we didn't have a few people out of country. They meet every Tuesday at 7pm and Thursdays at 1pm (Massachusetts time) and all you have to do is sign up via your email and you'll get a zoom meeting invite through your email about an hour before it starts. They're a wonderful group of people and it should help you a lot.",
      "created_utc": 1626182390.0,
      "score": 10,
      "context": []
    },
    {
      "id": "h544pwr",
      "author": "SignificantBeing5",
      "body": "Sending you positive thoughts. I truly hope you get all the support you need and deserve. Please know that you are enough and you are doing the right thing by reaching out.",
      "created_utc": 1626232549.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h51cbqn",
      "author": "1800SnooRadishes",
      "body": "I was recommended these support groups, they are free and online: https://anad.org/get-help/about-our-support-groups/\n\nI am so sorry for what you’re going through. Sending a hug.",
      "created_utc": 1626184598.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h514zin",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1626180641.0,
      "score": 2,
      "context": []
    }
  ]
}