{
  "id": "okpbjl",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1626341171.0,
  "title": "Request: Don't feel as though I'm deserving of recovery because I'm not underweight",
  "selftext": " \n\nHello, my name is Winnie and I have been struggling with anorexia for a while.\n\nRecently, I have made the decision to try and recover, although it has been extremely difficult without outside support to help me along the way. I'm making an effort to eat when I feel hungry, and to have foods that I want. Despite the anxiety and guilt, I try my absolute best to push through. I know that guilt isn't a useful emotion in this situation and it's not worth sitting on it.\n\nHowever, I'm still having a lot of trouble about restricting myself. I feel like I'm not deserving of food as much as others. I see other people eat during recovery and I want to eat too, but I keep telling myself \"oh you can't do that, you're not underweight,\" or \"you're still trying to lose weight, you're not meant to be eating.\"\n\nThe stress has been piling up endlessly, which has been enhancing my psychosis and delusions as well on top of PMS. It's unbearable, I don't know what to do.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/okpbjl/request_dont_feel_as_though_im_deserving_of/",
  "score": 80,
  "num_comments": 10,
  "comments": [
    {
      "id": "h59nwc2",
      "author": "canadianworm",
      "body": "That’s part of the eating disorder. As recovered one of the most relatable things I’ve ever heard was “I never felt good enough to be considered anorexic”",
      "created_utc": 1626352484.0,
      "score": 26,
      "context": []
    },
    {
      "id": "h59avjf",
      "author": "rileyyj001",
      "body": "Please know that no matter your weight, the ED will *always* tell you, you are not sick enough. If you are here in this sub, asking these questions, you absolutely *are* sick enough. \n\nI would suggest looking into Dr. Jennifer Gaudiani’s work on the subject. She literally wrote the book *Sick Enough.* 💖",
      "created_utc": 1626343073.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h59i8bc",
      "author": "ggrace3302",
      "body": "I am also dealing with this right now. My heart goes out to you and remember you do deserve to eat as much as anyone else.",
      "created_utc": 1626348889.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h59ntrv",
      "author": "Training_Parfait4297",
      "body": "Something that helped me overcome this false belief is being mindful of my hunger cues and honoring them. Honoring hunger can be challenging for us because for a long time we avoided, hated feeling it, and we’re afraid we’d have to restrict or purge once giving in to it.  Try to label hunger as a good thing. Associate it with your body telling you, you are ready for growth and renewal. I know it’s challenging to start believing these things when you don’t feel it. Have hope though. It’s possible.",
      "created_utc": 1626352443.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h59zr4d",
      "author": "Content-Cockroach-90",
      "body": "hi i was in recovery for like 6 months but i recently relapsed. now, i’m trying to recover again. it was really hard because i’m not underweight. i thought i didn’t deserve to recover until i was “sick enough”. the reality is that anorexia is a mental illness. it takes over your life in every way. so i may not physically look sick. but my brain was extremely sick. i find that now i’ve started eating enough, my weight doesn’t change so rapidly. and now i get to live a normal life without constantly feeling guilty. when i was suffering with my ed, i felt like it would never end. “this is my life now” kinda attitude. but ed’s are extremely exhausting. it’s not a healthy sustainable way to live. now that i’m recovering, i’m genuinely so much happier and i feel overall healthy. anorexia is a bitch. hands down. but i can say 100% certainly, recovery is worth it. i wish you all the best.",
      "created_utc": 1626358424.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h5b8lr6",
      "author": "Woplin",
      "body": "You are deserving of food and love and all the wonderful things in life. You are worthy of living a happy life, so don't let guilt lie to you!",
      "created_utc": 1626377764.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h5ale0v",
      "author": "sandgoon1235",
      "body": "This might be the most toxic thought of ED's. And the reason so many won't get help. It is the reason I ended up in the ICU. And then a very long 2 years of treatment. You deserve help right now. Not when you are \"sicker\" because your ED will NEVER let you believe that you are sick enough. Don't wait. The longer you do the longer the road to recovery is.  And please don't try to do this all on your own. Find someone you trust and confide in them. Just doing that will take so much power away from ED. You are worth it. And will always be deserving of recovery.",
      "created_utc": 1626367842.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h5cwost",
      "author": "None",
      "body": "I can’t tell you how much I relate to this. I’m so sorry you’re going through this. It is hell and you deserve better. I know the stress of trying to get out of it, and it takes major strength, which I’m sure you have in you. You can do this. Keep reminding yourself you are more valuable than you know. Your weight and appearance is not a reflection of you as a worthy, amazing person. You have so much to give the world and so much to experience.",
      "created_utc": 1626407623.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h598q5b",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1626341171.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5ah95m",
      "author": "Hannalog",
      "body": "i thought the same. looking back now, I WAS THIN AS HELLLL dude seriously you are worth it and start with smoothies/protein shakes they are easy to eat and help get your body ready to digesting normal foods :) keep going its amazing to wake up not feeling sick !!!! girl you need to continue 🥺🥺🥺🥺 you got this!!!",
      "created_utc": 1626366103.0,
      "score": 1,
      "context": []
    }
  ]
}