{
  "id": "oldkgm",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1626428412.0,
  "title": "Request: Can I Ever Really Recover?",
  "selftext": "I first began treatment for anorexia about 5 years ago. I've been in \"active recovery\" for roughly 3.5 of those years and have been relapse free for 2 years or so. Despite my success in recovery I feel like I'll never actually be able to kick ED habits and the ED voice. I haven't looked in a mirror and not hated my body in 7 or 8 years. I guess my question is, does it ever end? Will I ever be truly recovered? Like to the point where I can stop thinking about my appearance and weight everyday. Honestly it gets exhausting sometimes to constantly avoid the urge to fall back into bad habits and sometimes I worry that I won't be able to resist forever.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/oldkgm/request_can_i_ever_really_recover/",
  "score": 58,
  "num_comments": 12,
  "comments": [
    {
      "id": "h5dt6jn",
      "author": "piercecharlie",
      "body": "In some ways, my eating disorder is one of many addictions, in other ways it's a beast completely different from any substance I've had to quit.\n\nWith my sobriety, quitting was more clear cut. Don't drink. Don't smoke weed. Don't do hard drugs.\n\nWith my eating disorder, it's more like I have good days and bad days. I started having disordered eating at a very young age (earliest memory 6 or 7). My eating disorder developed age 13. I just sought treatment with a dietician at 25, the beginning of this year.\n\nShe's really helped me focus on the wins day by day, meal by meal. She constantly reminds me the last thing to change is my body image and thoughts. As you call it, the ED voice.\n\nShe also says it's normal to have waxing and waning in recovery. I'm going through a rough patch right now. Lots of triggers and backsliding. She said that's completely normal. She doesn't make me feel like I relapsed if I skip a meal or a snack. It's always about progress and to keep moving forward.\n\nI hope this helps 💙",
      "created_utc": 1626432760.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h5dpho9",
      "author": "sweetparamour79",
      "body": "I think you will never fully be free of it. I have been good for ~5 years and still have my moments. I see recovery as not giving into my habits. Just acknowledging the feelings and trying to stay focused on my health. \nIt does depress me that I may never like myself though.",
      "created_utc": 1626429743.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h5eqbyw",
      "author": "bange_lille_pjell",
      "body": "I think my ED will be with me forever. It's a quiet ringing in my ears at my darkest moments, moments when I feel the most out of control. But I have so many days when I just don't think about it, mornings when I wake up and look in the mirror and feel so happy, evenings when I eat a meal with friends and feel relaxed and grateful. There are periods where I feel like I have to be so vigilant and work so hard to stay on track but there are also periods when recovery feels effortless. \n\nI hope you're able to find a little peace.",
      "created_utc": 1626450329.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h5eve2m",
      "author": "hagfan41",
      "body": "Some people say yes. But In my opinion, and most of my recovery buddies will say no. You are recovering forever. Always at risk of backslide. I face my ED head on every single day, But I’m in control now. It ebbs and flows. Sometimes the battle is not so intense, even for months at a time. But after 10+ years I know this is a part of my life and mental health I have to carry with me.",
      "created_utc": 1626452470.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h5gaqbu",
      "author": "spinenthusiast",
      "body": "I say yes. I recovered seven years ago after a six year struggle (most of that in and out of day treatment/IOP/OP/therapy and dietitian sessions and haven’t had any issues since. Do I absolutely love every facet of my body all day, every day? No. But I can at least have neutrality and be thankful that I’m alive and healthy and my body can support my life as I focus on more important things like my husband, family, friends, faith, and work. I think telling yourself you’re always going to struggle or have to deal with it… we’ll, leads to you always having to think about and deal with it. But complete recovery is possible. There are days I don’t even think about my old ED and OCD and that is so incredibly freeing. You have to tell yourself that it will come, and you have to tell yourself and act that way until you believe it. I’m praying for the best for you and all who respond or read this and think differently that you would experience that freedom as well.",
      "created_utc": 1626475028.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h5hhkr8",
      "author": "maryjean0524",
      "body": "I feel this lately. I am exhausted. I try so hard everyday to eat a normal amount. Its really hard for me to eat in public. I am right there with you. \nYesterday, I went out to eat with my friend and at the end of the meal I apologized for having to take most of my meal to go because I couldn't eat it at that moment. She told me to not apologize and that she was really proud I ate how much I did. I think its a sign for me to be more kind to myself. I am trying to show myself the same level of compassion that she did. I just keep trying its all I can do. Hang in there.",
      "created_utc": 1626498710.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h5iv093",
      "author": "Kayla_701",
      "body": "I definitely think it is possible. It has been for me.  Maybe it just takes time to fully shake off. If you’ve been struggling with the disorder for 3-5 years, maybe it’ll just take time to fully shake off if that makes sense. But things should get better  over time. Sometimes it may not feel that way, but grace and constant faith be your guide. \n\nAlso, find and do things that will distract you from it. Like focusing more on your career and future. God has really helped me in my recovery to focus more on Him and more important things in life. Of course the struggles you are facing are real, but God will help you through it and give you the strength and wisdom you need when you are weak and face it strong.",
      "created_utc": 1626535347.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h5dnyyl",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1626428413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5otzxe",
      "author": "georgeOO7",
      "body": "It takes time. I’m 7 years in and it’s hard but as time goes on I continue to get better and better. I have lapses sometimes but at the end of the day, I become more and more free the longer I fight :)",
      "created_utc": 1626650124.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h5h7twq",
      "author": "cpjkyl",
      "body": "does it get easier over time or does progress eventually plateau. i rlly dont want to deal with this forever",
      "created_utc": 1626492435.0,
      "score": 1,
      "context": [
        {
          "id": "h5dpho9",
          "author": "sweetparamour79",
          "body": "I think you will never fully be free of it. I have been good for ~5 years and still have my moments. I see recovery as not giving into my habits. Just acknowledging the feelings and trying to stay focused on my health. \nIt does depress me that I may never like myself though.",
          "created_utc": 1626429743.0
        }
      ]
    },
    {
      "id": "h5hrwos",
      "author": "sweetparamour79",
      "body": "It gets easier in some ways. Like you will get to a stage where you can snack on things you couldn't even comprehend before or enjoy a meal without considering the calorie intake. \nThe hardest part is learning to manage weight gain in a healthy manner once you 'recover'. I have had a coach for the last 1.5 years who is helping me to rebuild my metabolism and keep a steady weight on adult calories. It is slow work but I know it'll be worth it once I accomplish it.\nI can't promise that every day will be perfect or that you won't feel triggered at time, but I can promise it will get better and it will get easier.",
      "created_utc": 1626506780.0,
      "score": 2,
      "context": [
        {
          "id": "h5dpho9",
          "author": "sweetparamour79",
          "body": "I think you will never fully be free of it. I have been good for ~5 years and still have my moments. I see recovery as not giving into my habits. Just acknowledging the feelings and trying to stay focused on my health. \nIt does depress me that I may never like myself though.",
          "created_utc": 1626429743.0
        },
        {
          "id": "h5h7twq",
          "author": "cpjkyl",
          "body": "does it get easier over time or does progress eventually plateau. i rlly dont want to deal with this forever",
          "created_utc": 1626492435.0
        }
      ]
    }
  ]
}