{
  "id": "orvhg7",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1627292808.0,
  "title": "Request: Anorexia to Binge Eating",
  "selftext": " I developed anorexia at about 15 during a volatile period in my life. I went from being overweight to underweight in about 5 months. It started out with healthy weight loss but slowly devolved into anorexia. After being forced into recovery from my family, I began to gain weight. And that is all that I have done for the past 6 years. For many years I didn't acknowledge the fact that I just traded one extreme for the other. I remember being told by my therapist that I wouldn't become overweight again during recovery, the thing that I was most scared of, and he was right. I am not overweight, I am obese. It is so hard for people to understand what I am going through. It is like I still have that ravenous hunger that was supposedly only going to last for a while. I feel like my BED invalidates my struggle with anorexia and vice versa. I just want to know if anyone has had the same outcome after \"completing\" recovery. I am frustrated and just want to be able to look at food as what it is, food. Not as the thing that dictates my life.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/orvhg7/request_anorexia_to_binge_eating/",
  "score": 55,
  "num_comments": 3,
  "comments": [
    {
      "id": "h6m5xhq",
      "author": "gloppy213",
      "body": "You need to set a schedule for meals. I had the exact same problem but I eventually figured out that 1. I was binge eating because I didn't have anything I enjoyed doing in life and 2. because I didn't have a set eating schedule so I couldn't hold myself accountable for anything. \n\n1st I would start eating just three meals a day. Disclaimer: don't think about weight loss at all. Even if you overeat for the first few days, it's fine. You need to continue to eat all three (or how many you decide) meals per day because your body won't adjust to the new routine if there is no routine to adjust to.\n\nWhen you eat, put everything that you plan on eating right in front of you and don't even think about going and getting more food. If you need to put a larger quantity of food on your plate at first because you're scared of that kind of permanence that's fine. You'll figure it out within a few weeks. If you reaaally need snacks then that's also okay but they need to be scheduled snacks. Personally I don't like to eat snacks because that time I've spent not eating allows me to listen to my hunger signals better and also be more productive at other things I am doing. The main thing is scheduling and preparing because at this point, your hunger signals are going to be confused with psychological hunger. And while it's okay to listen to psychological hunger, it's important to be able to differentiate between physical and psychological hunger and that starts with forming a routine.\n\n2nd find something that you enjoy doing more than eating. For me, I got back into reading and playing chess. It's very engaging for my brain, I don't feel like I'm wasting away when I do it (though it's not exactly a completely productive use of my time), and it fills time and helps me procrastinate in a non-harmful way if I want to. This tip might not be as applicable to you since your cause of binge eating might be different than mine. However, I think I know the feeling you're describing. For me, I felt proud that I was eating as I gained weight, but that pride became a quick dopamine shot if I was feeling down, which normally happened when I had too time or work to do. \n\nIt's difficult to put into words exactly how important a routine eating schedule is because you won't understand the way it completely changes your view of food until you have established that routine and find yourself only thinking about food during your meal times. You can also slowly make adjustments to make your meals healthier and it ultimately results in more mindful eating. (I actually hate the term \"mindful eating\" because it sounds like you have to be laser focused on your food while eating it, but for me it's more of an understanding of food for what it is rather than the emotions attached to it). \n\nSorry if a lot of this doesn't make sense. Just listen to the practical advice first and the mental and emotional results will come.",
      "created_utc": 1627324255.0,
      "score": 15,
      "context": []
    },
    {
      "id": "h6lcxiy",
      "author": "raeg14",
      "body": "I had a similar experience! Ultimately it comes down to therapy and figuring out why you binge (could very well be the same reasons for why you restricted).. therapy can help you figure that out, answering questions like what emotions you experience before you binge, are there any triggers you can identify, what emotions do you experience while binging, what could you do instead to truly satisfy what you’re searching for (besides using food) etc. so you can figure out where you need to heal. After figuring that out and working though those underlying issues (if there are any.. I’m not trying to imply anything about your experience this was just my experience) then you can start healing your relationship with food. \nI also struggled with anorexia and went from overweight to underweight then gained all the weight back and more to becoming obese (in part I believe that was normal and something my body did to recover which was very necessary.. but eventually after being stable at a higher weight I just kept bingeing even when I wasn’t hungry mentally or physically) and now over the years I am a “normal” weight.",
      "created_utc": 1627311615.0,
      "score": 8,
      "context": []
    },
    {
      "id": "h6kiuc7",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1627292808.0,
      "score": 1,
      "context": []
    }
  ]
}