{
  "id": "ot6ska",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1627466197.0,
  "title": "Request: Exchange meal plans feel just as obsessive as restricting",
  "selftext": "I just got put on an exchange meal plan by my dietician and I feel like trying to attempt recovery while still having to follow rigid food rules is so counterintuitive and requires me to spend just as much time thinking & obsessing about food and limiting my food choices as restricting did. Like I am still having to measure my food and weigh my proteins, I have to essentially count macros to meet my exchange goals for every meal, I have to plan out everything in advance instead of just eating what feels/sounds good.\n\n&#x200B;\n\nI was trying to plan a dinner to make for tonight and looking through recipes, and my meal plan calls for one fat exchange but nearly every recipe would require me to use probably more than a single tablespoon of oil, and I also wanted to make a sauce but that would also require more than one fat exchange. So I am having to choose between roasting my veggies with oil, being able to bake my tofu, or making a sauce for the dish. I could make a sauce and eat raw/steamed veggies and tofu, or cook the tofu and veggies but omit sauce and it would be dry and bland. I feel almost more limited and restricted than when I’m not following a meal plan, because at least I can eat what sounds good to me (but in smaller, controlled portions). Now I have to eat a large volume of bland food and nothing about my relationship to food changes other than the caloric intake. I am still having to view food in numerical terms, and instead of getting to enjoy my food I have to eat meals that are incoherent and still don’t feel like they resemble how normal people eat.\n\n&#x200B;\n\nOne of the most exciting and motivating prospects of recovery for me was being able to have the freedom to cook without having to calculate every aspect of the meal and just making what sounds good, and this is not allowing me to do that. I get that there needs to be a system in place to ensure that I’m eating substantial enough portions and a balanced diet with a variety of foods but this just doesn’t feel helpful at all and I am still having to spend way too much mental energy thinking about food and feeling guilty that the things I want to eat don’t necessarily match the meal plan all the time. I feel like I’ll just end up eating the same meals every single day to avoid having to think so much about how to come up with different ways each day to fit all my exchanges at the times they’re supposed to be eaten. Has anyone had success with a different model of meal planning with their dietician? I feel so hopeless and trapped, this is the only available dietician in my area who has ED experience and this is honestly making me even less motivated to recover :(",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ot6ska/request_exchange_meal_plans_feel_just_as/",
  "score": 42,
  "num_comments": 8,
  "comments": [
    {
      "id": "h6ud3xx",
      "author": "alexisseffy",
      "body": "I'm also on a meal plan, but not as strict though. I think meal plans can be important at the beginning of recovery to restore normal eating patterns and physical health. But Im not supposed to measure anything, it's just estimating portion sizes (eg, half a plate grains, 1/4 plate protein, 1/4 plate veg). But I agree that having to track food so closely isn't helpful. Maybe consider the meal plan as a minimum? So like for the fats when cooking, just make sure you have at least one, and having more is okay. Good luck in recovery!",
      "created_utc": 1627487602.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h6ugkul",
      "author": "lisa1896",
      "body": "\" I have to plan out everything in advance instead of just eating what feels/sounds good.\"\n\nThat was SUCH a massive struggle for me. I had always eaten whatever I wanted, purging as a teen, then just gaining as an adult, or I did horribly restrictive diets, like 400 cal/day or just fasting for days. Those never worked for me, I always gained all the weight back, i.e., not sustainable. You have to retrain your habits, be patient, and trust the process (I know, trust was an issue for me too).\n\nI have to say now, though, after 1/2 a century of trying to lose weight (I'm 60, started restricting and issues when I was 10), that planning the day takes my food worries off the table. I know what I'm going to eat, decide in the morning before I start my day, and log it. If there are changes for some reason I log that. Other than that I don't think about food anymore. For the first month of this I thought I was going to go insane. All I thought about was food. When do I eat, what do I eat, is it enough, will I be miserable, will I lose weight on this, etc. \n\nGradually though, those horrible feelings went away and this became, dare I say it, habit. If you replace bad habits with good habits your brain will adapt to that via neuroplasticity. Does it suck at first? It does. If you have recovery goals though you have to decide is it worth the struggle for the end. I was for me. I did a lot of crying some days. Now I don't think about food. Sometimes I forget to eat. \n\nIt's so worth it. Dig those fingers and toes into that cliff and hang on. You've got this, you may think, like I did, that you don't, but you really do. I believe in you. Come here and talk it out when it gets bad like you did today.",
      "created_utc": 1627489037.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h6uj2sr",
      "author": "peachy-aloe",
      "body": "Maybe the dietitians style isn't for you? That would be okay. My dietitian is called a \"non-diet dietitian\" who doesn't believe a meal plan is right for me right now. (She might use them but I'm not 100% sure). She's trauma-aware and that's a big help too. I actually have my sessions with her over zoom. Depending on your location maybe that'll open up some more options for you?",
      "created_utc": 1627490056.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h6tga5e",
      "author": "goldencersei",
      "body": "what about meal prep? maybe if you only do it once and keep things in the fridge that might help?\n\nUnfortunately in the west, especially if you are from America because of the SAD culture/diet, nothing about 'normal' people's eating habits is healthy. Taking care of yourself will require you to put a lot of attention on food since most 'foods' avaliable to us are almost entirely poisoned (sugars, food coloring, trans fats, etc).\n\nI have gut problems and I can barely eat anything, honestly I prefer it this way though, it helps me focus on my nutrition and really nourishing myself and having limited options regarding food makes it easier to actually choose what my body needs to function instead of just 'what sounds good'. I get that food and eating should be a good/positive experience and not 'forced' at all, but I don't think food has to be 'bland' or 'boring' just because it is healthy. Since I have struggled with BED before Anorexia I personally feel really comfortable/safe now being aware of my nutritional needs, if that makes sense, because back then I know I just was not in the slightest.",
      "created_utc": 1627471165.0,
      "score": 0,
      "context": []
    },
    {
      "id": "h6ta3n2",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1627466197.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6ul89r",
      "author": "outrageous_solanacea",
      "body": "Completely relate!!!",
      "created_utc": 1627490925.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h6zbr2d",
      "author": "FrustratedPenguins",
      "body": "Yes, I have been there. I was first put on the exchange plan as well and had the exact same reaction as you. I was obsessing over making sure I had, for example, two carbohydrate exchanges at every meal and both were 80 cal each, and two fat exchanges that were each…… Etc. \n\nMore recently, I was put on another meal plan that seemed similar to the exchange plan but was somewhat simplified.  In this case, my therapist ended up calling my dietitian and telling her that I would not be following the meal plan because I was just obsessing about it and it was making things worse. \n\nI would definitely talk to your dietitian. She should have other ideas of different types of meal plans that might be more flexible and work better for you, or perhaps some sort of system that is not a fixed meal plan at all. I think your concerns are very real and very reasonable.",
      "created_utc": 1627580434.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h75l6dg",
      "author": "teacozy",
      "body": "My initial exchange meal plan held me back. I’ve since deserted it in favor of “meals that look like full plates of food a healthy adult would eat”— or as Tabitha Farrar calls them “pub-sized meals.” I failed to weight restore at all for 2.5 years following the exchanges. I was eating more calories per day, but just as sick and obsessed in the head, and I had barely gained weight, I suppose because my metabolism increased with the increased intake. For the past 6 months I’ve switched from counting exchanges to using the question “would I serve this size meal to my healthy adult partner?” to give myself a reality check on portions. Measuring and counting per my original plan almost always yields meals that are too small to pass this test for me. The 1-2 fats prescribed by the meal plan made all but the leanest blandest foods seem so sinful to me, and made it difficult for me to eat food that I didn’t prepare myself. My dietician gave me the exchanges meal plan with the caveat that it was a minimum, but my ED brain can’t help but turn the minimum needed into the maximum allowed. The only way for me to quiet the restrictive urge was to stop counting and measuring. Instead. I log whether each meal/snack is adequate, inadequate, or skipped. I eat so much more than that measly exchange meal plan now, and I’m still only restoring weight very slowly. I wish I had known back then how much food my body really needed! Wish you the best in your recovery and figuring out the right way to structure your food choices. Check out Tabitha Farrar’s book or YouTube for a different approach that inspired me in recovering from restriction.",
      "created_utc": 1627695385.0,
      "score": 1,
      "context": []
    }
  ]
}