{
  "id": "ow4c8j",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1627866060.0,
  "title": "Request: How do I cope with gaining actual weight for the first time?",
  "selftext": " \n\nFor backstory I have had an ED since I was around 16 years old (9 years). Its only gotten serious a few times, mainly my senior year and the tail end of 2018 was when I weighed my least. After a year of therapy in 2019 I started to tackle my depression and anxiety and that started to help my ED as well, even though I had trouble even with gaining a few pounds. Over the pandemic I moved out of my parents and things started to get better but at the same time they were not really. Today I am at what is considered a healthy weight for my height and age but it is the most I have ever weighed in my life and I’m having a hard time coping with it and it makes me wish I could just gain weight but still look the way I did in 2018 even though I still had body image issues then. I just don’t know how to cope.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ow4c8j/request_how_do_i_cope_with_gaining_actual_weight/",
  "score": 54,
  "num_comments": 7,
  "comments": [
    {
      "id": "h7dtd59",
      "author": "cool_trashboat",
      "body": "I just try to be thankful I'm recovering and becoming healthy. My ED and weighing the lowest I ever had messed me up so much mentally, physically, and socially. I try to remind myself that, yes I'm the heaviest I've been, but that means I'm getting better, I'm not letting the eating disorder win, I'm fighting and winning against this awful disease.",
      "created_utc": 1627870635.0,
      "score": 16,
      "context": []
    },
    {
      "id": "h7e21so",
      "author": "virg000",
      "body": "I am kinda in the same boat as you, I’ve struggled with my ED for many years and I was a D1 athlete throughout college so I was exercising 20 hours a week. Now that I’m out of college and the pandemic happened I gained weight again too and was really really struggling. I had to mend my relationship with exercising because my body is literally deteriorating from the over exertion of several years of sports. I learned to exercise by honoring just doing something for the day, wether it was a walk, yoga, or full gym session. My body is still larger than it was before and I became very triggered when I decided I had to let go of my smaller sized clothing items because every time I’d try them on they wouldn’t fit and it would cause a decline. I bought some clothes that fit better and that was hard too realizing I wasn’t the same size I had been for years. Once I let go of the thought of having to get back to that I realized how unsustainable that weight was when my body was happy. We NEED to eat. Our bodies are literally designed to eat, and our bodies shouldn’t suffer for the sake of an unhealthy habit. I was also reminded of how our bodies are allowed to change. It’s still a struggle and some days are harder than others but reminding yourself that change is good helps. :) (sorry if I’m rambling lol)",
      "created_utc": 1627875394.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h7e73wm",
      "author": "grimoiregraves",
      "body": "I am in a similar place however my struggle came a little differently. I always was very small, however after a tragedy and being diagnosed with PTSD the medication I am on made me gain a fair bit of weight. What I have come to accept is that I have grown not only physically but mentally and my body has carried me through it all. Your body will never be the same as it is today, it will always change but your love for it doesn't have to. If you are having a hard time accepting your form try to love your body for all it does with you and for you. Know that tomorrow is a new day and aim for a 1-10% increase of love and health! Cause even 1% is still an improvement! Hope this helps",
      "created_utc": 1627878453.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h7eom9v",
      "author": "tiaaaaaaaaaaa",
      "body": "it’s really hard but try to be grateful for the little things, like the fact that you actually have energy to live life. the way that your hair doesn’t fall out anymore. the way that your nails no longer break anytime they touch anything. the way that you’re now giving your body the love it deserves for everything it does for you!!",
      "created_utc": 1627892340.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7dkp3r",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1627866060.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7gln8w",
      "author": "SpiralConsciousness",
      "body": "Though I do agree that being thankful for where you are now vs then is great, it can lead to being overly annoyed about comparing yourself and then finding flaws to justify a relapse. For me, when I'm trying to do well I just do my best to enjoy day to day things and the moment. ED thinking is flawed and always around, distractions are great for when things creep in again. Let go of who you were and find out who you are now.",
      "created_utc": 1627930601.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7e2hbs",
      "author": "dirtyhip",
      "body": "Yes this!!!!",
      "created_utc": 1627875633.0,
      "score": 3,
      "context": [
        {
          "id": "h7e21so",
          "author": "virg000",
          "body": "I am kinda in the same boat as you, I’ve struggled with my ED for many years and I was a D1 athlete throughout college so I was exercising 20 hours a week. Now that I’m out of college and the pandemic happened I gained weight again too and was really really struggling. I had to mend my relationship with exercising because my body is literally deteriorating from the over exertion of several years of sports. I learned to exercise by honoring just doing something for the day, wether it was a walk, yoga, or full gym session. My body is still larger than it was before and I became very triggered when I decided I had to let go of my smaller sized clothing items because every time I’d try them on they wouldn’t fit and it would cause a decline. I bought some clothes that fit better and that was hard too realizing I wasn’t the same size I had been for years. Once I let go of the thought of having to get back to that I realized how unsustainable that weight was when my body was happy. We NEED to eat. Our bodies are literally designed to eat, and our bodies shouldn’t suffer for the sake of an unhealthy habit. I was also reminded of how our bodies are allowed to change. It’s still a struggle and some days are harder than others but reminding yourself that change is good helps. :) (sorry if I’m rambling lol)",
          "created_utc": 1627875394.0
        }
      ]
    }
  ]
}