{
  "id": "ox04si",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1627984238.0,
  "title": "Request: Does recovering/being recovered ever get easier?",
  "selftext": "I’ve been “in recovery” for a long time, but this year was the first time I actually started to eat more to fight my anorexia. As a result, I’ve gained a lot of weight and am objectively much healthier physically. However, I just haven’t been able to mentally accept with all of these changes. Beyond endless body distress, I feel weak for not being able to restrict like I used to, and my ravenous appetite scares me. It’s like even though I’m healthier physically, there’s a voice in my head constantly bullying me for my weight, trying to get me to restrict again or start purging. It’s really kind of scary because I haven’t been able to stop that voice at any point in recovery, and I’m beginning to fear that I never will.\n\n&#x200B;\n\nDoes anyone have any recommendations for making recovery easier on my brain? I am losing hope and think I am close to relapse.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/ox04si/request_does_recoveringbeing_recovered_ever_get/",
  "score": 55,
  "num_comments": 22,
  "comments": [
    {
      "id": "h7jhlfu",
      "author": "Nulledupp",
      "body": "I strongly recommend reading the articles on the edinstitute.org - they finally triggered me into recovering properly, without relapses. It explains in understandable language why a proper recovery is the only choice you have if you do not wish to break your mind and body fatally but instead want to live a full and long and healthy life. Please read! I wish you and everyone out there with an ed all the strength in the world.",
      "created_utc": 1627990147.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h7jcgj3",
      "author": "bring_me_MONSTER",
      "body": "recovery requires a lot of time and mental strength.. I'm in recovery almost 2 years.. and the last half of a year have been devastating.. from undereating to overeating, from fasting to binge and purge. I've lost control of myself absolutely.... Just because I wanted to get better.. I've never felt worse.. until now .. last few weeks are the best weeks in my life.. I still have thoughts that I'm disgusting, have no control, or im hopeless piece of shit. But that is just thoughts... I'm able to control my feelings,  and I'm in control of my ED. No purging, no restriction.. \n\nI thought that recovery is impossible. But that's not true.\n\nI believe you can do it!\nStay strong and the day when it gets easier will come!\n\nAlso. I suggest you can try DBT therapy. Or just read about it, maybe try to use some DBT skills. It actually helps to overcome the voice in a head",
      "created_utc": 1627986251.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h7k22tn",
      "author": "SirDawnslayer",
      "body": "More or less. I don’t know about easier, but you do become more adapted to telling your ED to go fuck itself, but that may just be my experience. I’ve been in recovery for about 5 years now, and I still think about it frequently. I still have to tell myself that it is okay to eat things. Recovery is very possible. Recovery is very much worth it. It is a fight to be sure, but a fight well worth fighting.",
      "created_utc": 1628001263.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h7k4oaz",
      "author": "jeabgrenouille",
      "body": "Being mindful and as mentally prepared as you can. You know that recovery is what you want. You know that with recovery (often) comes extreme hunger and weight gain. Tell yourself that these things will happen. \n\nThen, prepare yourself for when they do. When you look in the mirror and have mean thoughts about your appearance, have something prepared to say to yourself like \"I knew this was coming. I chose this. My discomfort is temporary.\" And make sure you have prepared yourself for needing different clothes that make you comfortable. That is expected and part of the process.\n\nWhen you have those mean thoughts about your appetite, you can think \"it makes sense that I am so hungry. This is a normal human body's response to restriction. There is nothing wrong with eating more and feeding my body is my new goal.\"\n\nIn general, I would say that feeling bad from time to time is expected. Expect that you will feel bad sometimes as you change your habits and rewire your brain. That way, when a particularly bad day comes, you can, say, hello, I've been expecting you. I will still eat today even though it feels bad, but maybe I will choose to do something that helps me sit with those feelings like watching TV, doing a puzzle, calling a loved one, etc.",
      "created_utc": 1628002525.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h7lq1df",
      "author": "graciously13",
      "body": "It does get easier, but it's also not so black and white. Recovery is not linear. There will be easier days, weeks, months than others. I have a few thoughts for you. \n\n1. Try to accept/acknowledge the dialecticals of recovery. You can feel disappointed in yourself for not engaging in ED behaviors (which is not really you, but really the internalized ED voice) AND you can still appreciate your healthy body.\n\n2. You mentioned feeling more hungry, and that causing you discomfort. This is called extreme hunger, and is so common! This is the mental and physical hunger associated with recovery. And yes, it is a bit disorienting and uncomfortable. I know I hated it (and still do). Your body (brain, muscles, connective tissues, etc) needs to repair itself and that requires extra nutrition over the course of YEARS. The physical ramifications of an ED is no joke. Mental hunger is also something that is part of being human. You have likely deprived yourself of foods sure to the ED habit of labeling certain foods \"unsafe\". These foods are part of helping you feel satiated. Sometimes a donut is going to satisfy your hunger more than a bowl of plain oatmeal. Honor your hunger. Your body is telling it what it needs to recover.\n\n3. Opposite action. Feel your feelings, acknowledge your ED thoughts, and then move on. E.g. \"I should restrict.\" \"Yep, that's my ED. I'm hungry, so I'm going to eat this because my body needs it.\"\n\n4. Joyful movement, fueled appropriately. Hikes, swimming, yoga, running. Enjoy your body's abilities.\n\nYou are not weak. You are not out of control. You are choosing health - to have coherent thoughts, to have energy, to engage with other people in meaningful ways. \n\nYou can do this. Day by day. Minute but minute.",
      "created_utc": 1628026710.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7khwcz",
      "author": "olivia42399",
      "body": "it may feel impossible now, but it will get easier. i promise. last fall I was entering recovery and ended up in the mental hospital a few times because of how much weight gain f-ed with my mind. i tried desperately to lose it all again but it was a losing battle and I was never happy. i was bingeing constantly and hated myself. very slowly i began having breakthroughs and eventually i reached a point where I was at peace. once you get over the hump of wow-this-sucks-and-is-totally-impossible your body will physically be able to handle food better - you won't feel as bloated or horrible - and your metabolism will recover. your weight gain will even out and the weight will redistribute as you continue eating more. eventually you will be like wow I can eat without feeling super bloated the next morning which prevents the extreme guilt (in my case), and that's literally just because your body knows what to do with food now. I once lived in a mental state where I had to do intense cardio and I had to binge/purge/restrict constantly, but yesterday I had mac and cheese, a big cookie, and a pint of ice cream without even thinking about it and I woke up this morning exactly the same as I was yesterday. i haven't binged or purged in a long time and I can finally enjoy life without constantly agonizing over what I'm going to eat. ultimately, I just filled out with weight gain and most of my clothes still fit, they just look better on my because I actually have a body for them to be on. basically, once you begin realizing that your body is designed to know how to eat, handle food, and maintain weight, you will become more comfortable and it becomes a positive feedback cycle. you eat more, your body recovers more, you can continue to eat more and more, and eventually retrain your mind that food isn't evil and that nothing will change if you eat.",
      "created_utc": 1628008309.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h7mwt3n",
      "author": "Rad_Scorpion",
      "body": "It has absolutely gotten easier for me.  A few years ago I was constantly weighing,  checking, thinking about food.  At one point I was partially hospitalized.   Just to provide some context that I was in a rough place.\n\nBut now I hardly think about food outside loosely trying to make sure I hit a couple nutritional goals (mostly vitamins that impact depression and anxiety).  I just finished eating two of my fear foods without even registering they used to be an issue,  and I enjoyed my serving and put it away without binging.  No guilt, just satisfaction.  I feel worth taking care of my body. \n\n I still struggle sometimes, but it feels manageable and temporary.\n\nIt does get better.",
      "created_utc": 1628047505.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7n9bah",
      "author": "scumfederate",
      "body": "Hi! I started my ED 12 years ago, and I’d say I’ve been in recovery for about five or six years now (not without difficulty or relapses along the way). \n\nHonestly, for me it’s a choice I make every day. Do I choose health today, or do I choose sickness? Some days I hardly have to think about making a good choice, it comes easily and with no second thoughts. Others it’s a hard choice. And sometimes sickness wins still. \n\nThe biggest thing is time and consistency. The more you practice choosing your health over this illness, the stronger the “recovery muscle” becomes. It gets better, I promise. Hang in there. ❤️",
      "created_utc": 1628055203.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7jfwyh",
      "author": "Equivalent_Section13",
      "body": "Internal family systems may help you with that voice \nIn recovery we have to keep trying different things",
      "created_utc": 1627988933.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7kz279",
      "author": "Ktm6891",
      "body": "Recovery definitely gets easier! I’m rounding out six years this fall. What’s really helped me is allowing myself to take it one day at a time, as needed. Recovery isn’t linear but it becomes more manageable, for sure. The pandemic has tested my recovery in ways that I never could have prepared for - being more sedentary during lock down, coupled with having fun baking and cooking new recipes to fill time, led to me gaining weight. But I persisted. You will, too. Hang in there and know that sometimes it’s okay to slow down and just take it one day at a time.",
      "created_utc": 1628015408.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h7leke6",
      "author": "tiny_teacup97",
      "body": "I would recommend you the book\n8 keys to recovery from an eating disorder by Carolyn Costin and Gwen Schubert Grabb.\nThey are both therapists who specialize in ED, and one of them even had an ED and was the other one's patient.\nIn the book there are both insights from the patients that recovered, as well as professional advice.\n\nHelped me a lot when I was in a bad place with my recovery last year after the pandemic hit.\n\nJust take it slow and hang in there. Some periods are harder than others in recovery and you just have to muscle through.\nI'm in recovery for 5 years now and it has been a crazy ride. \nMy refeeding phase was really long, now that I think about it. I had extreme hunger, but even after that stopped, my body still needed more food than I was used to. And that's fine. Just learn to listen and trust your body.\nRecovery is not linear and healing needs time. For example, it took me until now to stop having fear foods.\n\nThe pandemic was particularly hard, but I feel like I came out stronger out of it. Although I still struggle a lot, I am happy. I can manage my emotions, I can eat with friends and I am more comfortable in my body every day.\nI wish you all the luck in the world. You are not alone! I hope this helped!",
      "created_utc": 1628021840.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7ja2ac",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1627984239.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7mcrar",
      "author": "LisaFrankTattoo",
      "body": "You put: “in recovery” are you actively seeing a therapist? There were tools in therapy that I would never have thought of or known about that helped me immeasurably. A lot of self talk- stopping the spiraling and helping reason and self care myself out of a purge/binge cycle. If you’re not currently seeing someone please do.",
      "created_utc": 1628037413.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h7jo3fh",
      "author": "Flower-1234",
      "body": "Hey! I’ve had a look at that website and just wondered if there was any article specifically that you’d recommend? Thanks x",
      "created_utc": 1627994298.0,
      "score": 6,
      "context": [
        {
          "id": "h7jhlfu",
          "author": "Nulledupp",
          "body": "I strongly recommend reading the articles on the edinstitute.org - they finally triggered me into recovering properly, without relapses. It explains in understandable language why a proper recovery is the only choice you have if you do not wish to break your mind and body fatally but instead want to live a full and long and healthy life. Please read! I wish you and everyone out there with an ed all the strength in the world.",
          "created_utc": 1627990147.0
        }
      ]
    },
    {
      "id": "h7matua",
      "author": "Zelda_is_my_homegirl",
      "body": "Oof can we not have numbers? I gained much more and this was a tad triggering for me, and I’m pretty stable in recovery.",
      "created_utc": 1628036458.0,
      "score": 1,
      "context": [
        {
          "id": "h7kz279",
          "author": "Ktm6891",
          "body": "Recovery definitely gets easier! I’m rounding out six years this fall. What’s really helped me is allowing myself to take it one day at a time, as needed. Recovery isn’t linear but it becomes more manageable, for sure. The pandemic has tested my recovery in ways that I never could have prepared for - being more sedentary during lock down, coupled with having fun baking and cooking new recipes to fill time, led to me gaining weight. But I persisted. You will, too. Hang in there and know that sometimes it’s okay to slow down and just take it one day at a time.",
          "created_utc": 1628015408.0
        }
      ]
    },
    {
      "id": "h7jy6ve",
      "author": "Nulledupp",
      "body": "Yes, absolutely! The following article turned my way of thinking about the ed upside down: https://edinstitute.org/blog/2011/9/17/is-it-too-late-for-me-to-recover-from-restricted-eating-behaviors-ages-26-52",
      "created_utc": 1627999446.0,
      "score": 8,
      "context": [
        {
          "id": "h7jhlfu",
          "author": "Nulledupp",
          "body": "I strongly recommend reading the articles on the edinstitute.org - they finally triggered me into recovering properly, without relapses. It explains in understandable language why a proper recovery is the only choice you have if you do not wish to break your mind and body fatally but instead want to live a full and long and healthy life. Please read! I wish you and everyone out there with an ed all the strength in the world.",
          "created_utc": 1627990147.0
        },
        {
          "id": "h7jo3fh",
          "author": "Flower-1234",
          "body": "Hey! I’ve had a look at that website and just wondered if there was any article specifically that you’d recommend? Thanks x",
          "created_utc": 1627994298.0
        }
      ]
    },
    {
      "id": "h7szhtv",
      "author": "Ktm6891",
      "body": "You are right!!! My apologies!!!",
      "created_utc": 1628171271.0,
      "score": 2,
      "context": [
        {
          "id": "h7kz279",
          "author": "Ktm6891",
          "body": "Recovery definitely gets easier! I’m rounding out six years this fall. What’s really helped me is allowing myself to take it one day at a time, as needed. Recovery isn’t linear but it becomes more manageable, for sure. The pandemic has tested my recovery in ways that I never could have prepared for - being more sedentary during lock down, coupled with having fun baking and cooking new recipes to fill time, led to me gaining weight. But I persisted. You will, too. Hang in there and know that sometimes it’s okay to slow down and just take it one day at a time.",
          "created_utc": 1628015408.0
        },
        {
          "id": "h7matua",
          "author": "Zelda_is_my_homegirl",
          "body": "Oof can we not have numbers? I gained much more and this was a tad triggering for me, and I’m pretty stable in recovery.",
          "created_utc": 1628036458.0
        }
      ]
    },
    {
      "id": "h7kason",
      "author": "Flower-1234",
      "body": "Thank you!! Will have a read now ❤️",
      "created_utc": 1628005340.0,
      "score": 2,
      "context": [
        {
          "id": "h7jhlfu",
          "author": "Nulledupp",
          "body": "I strongly recommend reading the articles on the edinstitute.org - they finally triggered me into recovering properly, without relapses. It explains in understandable language why a proper recovery is the only choice you have if you do not wish to break your mind and body fatally but instead want to live a full and long and healthy life. Please read! I wish you and everyone out there with an ed all the strength in the world.",
          "created_utc": 1627990147.0
        },
        {
          "id": "h7jo3fh",
          "author": "Flower-1234",
          "body": "Hey! I’ve had a look at that website and just wondered if there was any article specifically that you’d recommend? Thanks x",
          "created_utc": 1627994298.0
        },
        {
          "id": "h7jy6ve",
          "author": "Nulledupp",
          "body": "Yes, absolutely! The following article turned my way of thinking about the ed upside down: https://edinstitute.org/blog/2011/9/17/is-it-too-late-for-me-to-recover-from-restricted-eating-behaviors-ages-26-52",
          "created_utc": 1627999446.0
        }
      ]
    },
    {
      "id": "h7kdsfp",
      "author": "Nulledupp",
      "body": "Take care of yourself please - I wish you all the best! ❤️",
      "created_utc": 1628006592.0,
      "score": 2,
      "context": [
        {
          "id": "h7jhlfu",
          "author": "Nulledupp",
          "body": "I strongly recommend reading the articles on the edinstitute.org - they finally triggered me into recovering properly, without relapses. It explains in understandable language why a proper recovery is the only choice you have if you do not wish to break your mind and body fatally but instead want to live a full and long and healthy life. Please read! I wish you and everyone out there with an ed all the strength in the world.",
          "created_utc": 1627990147.0
        },
        {
          "id": "h7jo3fh",
          "author": "Flower-1234",
          "body": "Hey! I’ve had a look at that website and just wondered if there was any article specifically that you’d recommend? Thanks x",
          "created_utc": 1627994298.0
        },
        {
          "id": "h7jy6ve",
          "author": "Nulledupp",
          "body": "Yes, absolutely! The following article turned my way of thinking about the ed upside down: https://edinstitute.org/blog/2011/9/17/is-it-too-late-for-me-to-recover-from-restricted-eating-behaviors-ages-26-52",
          "created_utc": 1627999446.0
        },
        {
          "id": "h7kason",
          "author": "Flower-1234",
          "body": "Thank you!! Will have a read now ❤️",
          "created_utc": 1628005340.0
        }
      ]
    },
    {
      "id": "h7kenj7",
      "author": "Nulledupp",
      "body": "And please, please read till the end, even if it's painful - it is definitely worth it. 💕",
      "created_utc": 1628006957.0,
      "score": 1,
      "context": [
        {
          "id": "h7jhlfu",
          "author": "Nulledupp",
          "body": "I strongly recommend reading the articles on the edinstitute.org - they finally triggered me into recovering properly, without relapses. It explains in understandable language why a proper recovery is the only choice you have if you do not wish to break your mind and body fatally but instead want to live a full and long and healthy life. Please read! I wish you and everyone out there with an ed all the strength in the world.",
          "created_utc": 1627990147.0
        },
        {
          "id": "h7jo3fh",
          "author": "Flower-1234",
          "body": "Hey! I’ve had a look at that website and just wondered if there was any article specifically that you’d recommend? Thanks x",
          "created_utc": 1627994298.0
        },
        {
          "id": "h7jy6ve",
          "author": "Nulledupp",
          "body": "Yes, absolutely! The following article turned my way of thinking about the ed upside down: https://edinstitute.org/blog/2011/9/17/is-it-too-late-for-me-to-recover-from-restricted-eating-behaviors-ages-26-52",
          "created_utc": 1627999446.0
        },
        {
          "id": "h7kason",
          "author": "Flower-1234",
          "body": "Thank you!! Will have a read now ❤️",
          "created_utc": 1628005340.0
        }
      ]
    },
    {
      "id": "h7tgj82",
      "author": "Flower-1234",
      "body": "Thank you so much! It’s taken me two days to read it but I’m so glad I did. I didn’t realise what I was doing to my body but now I do so thank you xxx",
      "created_utc": 1628177198.0,
      "score": 2,
      "context": [
        {
          "id": "h7jhlfu",
          "author": "Nulledupp",
          "body": "I strongly recommend reading the articles on the edinstitute.org - they finally triggered me into recovering properly, without relapses. It explains in understandable language why a proper recovery is the only choice you have if you do not wish to break your mind and body fatally but instead want to live a full and long and healthy life. Please read! I wish you and everyone out there with an ed all the strength in the world.",
          "created_utc": 1627990147.0
        },
        {
          "id": "h7jo3fh",
          "author": "Flower-1234",
          "body": "Hey! I’ve had a look at that website and just wondered if there was any article specifically that you’d recommend? Thanks x",
          "created_utc": 1627994298.0
        },
        {
          "id": "h7jy6ve",
          "author": "Nulledupp",
          "body": "Yes, absolutely! The following article turned my way of thinking about the ed upside down: https://edinstitute.org/blog/2011/9/17/is-it-too-late-for-me-to-recover-from-restricted-eating-behaviors-ages-26-52",
          "created_utc": 1627999446.0
        },
        {
          "id": "h7kason",
          "author": "Flower-1234",
          "body": "Thank you!! Will have a read now ❤️",
          "created_utc": 1628005340.0
        },
        {
          "id": "h7kdsfp",
          "author": "Nulledupp",
          "body": "Take care of yourself please - I wish you all the best! ❤️",
          "created_utc": 1628006592.0
        }
      ]
    },
    {
      "id": "h7th2s2",
      "author": "Nulledupp",
      "body": "I am so, so happy to hear this! ❤️ Please keep it up and try to remember the bad consequences - it helped me so much during recovery and whenever my brain tricked me into thinking I was getting \"too fat\". Remember, you are not alone in this. I wish you all the good things in the world!",
      "created_utc": 1628177430.0,
      "score": 1,
      "context": [
        {
          "id": "h7jhlfu",
          "author": "Nulledupp",
          "body": "I strongly recommend reading the articles on the edinstitute.org - they finally triggered me into recovering properly, without relapses. It explains in understandable language why a proper recovery is the only choice you have if you do not wish to break your mind and body fatally but instead want to live a full and long and healthy life. Please read! I wish you and everyone out there with an ed all the strength in the world.",
          "created_utc": 1627990147.0
        },
        {
          "id": "h7jo3fh",
          "author": "Flower-1234",
          "body": "Hey! I’ve had a look at that website and just wondered if there was any article specifically that you’d recommend? Thanks x",
          "created_utc": 1627994298.0
        },
        {
          "id": "h7jy6ve",
          "author": "Nulledupp",
          "body": "Yes, absolutely! The following article turned my way of thinking about the ed upside down: https://edinstitute.org/blog/2011/9/17/is-it-too-late-for-me-to-recover-from-restricted-eating-behaviors-ages-26-52",
          "created_utc": 1627999446.0
        },
        {
          "id": "h7kason",
          "author": "Flower-1234",
          "body": "Thank you!! Will have a read now ❤️",
          "created_utc": 1628005340.0
        },
        {
          "id": "h7kdsfp",
          "author": "Nulledupp",
          "body": "Take care of yourself please - I wish you all the best! ❤️",
          "created_utc": 1628006592.0
        },
        {
          "id": "h7tgj82",
          "author": "Flower-1234",
          "body": "Thank you so much! It’s taken me two days to read it but I’m so glad I did. I didn’t realise what I was doing to my body but now I do so thank you xxx",
          "created_utc": 1628177198.0
        }
      ]
    }
  ]
}