{
  "id": "oz3ko8",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1628243757.0,
  "title": "What I've Learned in Recovery So Far (4 years in)",
  "selftext": " \n\nHi there, (I had to break my submission into 2 messages to meet the character limit. This is Part 1 of 2 for 1 post) A friend asked me for some advice for her sister who is currently struggling with her relationship to food and her body. I compiled the following information to pass along to her and thought it might be of service to this subreddit. I hope it brings some insight!\n\nHere is a post I shared on social media a few years ago to summarize my journey:\n\nI debated sharing this post for a long time so please read with an open heart and mind. For years, I hated and was very concerned about my body size and shape. I went on restrictive diets, religiously counted calories and steps, compulsively over-exercised, measured everything I ate, always ordered ridiculous substitutions at restaurants, and would often binge while drinking, stressed, or starving in secret. Even at my lowest weight (nutrient deficient, bones visible, hair loss), I still hated my body and thought I could be thinner. From then on, I almost always felt fat. It is possible to have an extremely distorted self image. It took me years to hit “diet rock bottom” where I knew I needed help and have since been on my recovery journey. At first, I was terrified to let myself eat whatever I wanted. I thought I’d never stop eating and could never trust my body to know what it needed. Learning to intuitively eat is a process but it is so well worth the effort! Having stabilized my weight near my natural “set point”, I am no longer constantly starving, obsessing over food/calories/workouts, and I am so much more in tune with what my body truly needs. Diets and health culture teach us to lose touch with our body’s innate wisdom. Disordered eating comes in many forms as eating struggles and body dysmorphia affect most people (Some stats say >70% of us have some form of disordered eating) yet we seldom talk about it. The aim of this post is to share my story in hopes of helping others reexamine their relationships to food and body. I know how painful food struggles and body dissatisfaction can be and am now a huge advocate for self acceptance and rebellion against the weight loss/fitness industry and beauty ideal. We are so much more than our bodies. If any of this resonates with you, I highly suggest looking into the Food Psych Podcast, the book Intuitive Eating by Tribole/Resch, cleansing your Instagram of accounts that make you feel bad about yourself, and starting a journaling practice. \\~\\~\\~\\~\n\nAdditional reflections on what I've learned over the last 4+ years in Recovery: We live in a society that normalizes disordered eating. I used to think that either you have an eating disorder (i.e full blown anorexia or bulimia) or you are normal. When in reality, disordered eating exists on a spectrum. SO SO SO so many women (and increasingly more men) have disordered relationships to food and their body. We learn it from our mothers, friends, and the culture at large. Many women, nutritionists, doctors, and athletes have become aware of the constructed set of beliefs, norms, and practices that is referred to as “diet culture”. Examples of diet culture are: the idea that certain foods are “bad or good” or “clean or dirty” or the classic “vacation calories don’t count” or “I better be running xx miles tomorrow after this meal”, etc. The guilt and shame that is associated with allowing oneself to eat is one of the major effects of diet culture. Diet culture can be easily seen in fitness and weight loss industries but is also sneakily hidden in the general health and wellness industry. It’s a tricky realm to navigate because obviously we care about our health, but adopting diet culture’s norms and the “diet mentality” is ultimately detrimental to our health, even if it looks like making healthy choices in the short term. (More on this later.)\n\nIn order to heal from my own journey of disordered eating, chronic dieting, compulsive over exercising, and loathing my body, I dove deep into understanding the physical and psychological underworkings of my experience. It led to a massive perspective shift and profound learning around our current society, social norms, our biological needs, true self care, holistic health, and more. I have read multiple books on the topic and have listened to hundreds of hours of podcast interviews and stories with dietitians, nutritionists, psychologists, research scientists, social activists, and people in larger bodies who have been through astoundingly painful weight loss attempts and abuse from doctors/practitioners. But most importantly, I’ve lived it. I first handedly experienced the process of going from chronically dieting and hating my body to intuitively choosing foods that feel supportive in each moment, eating for the purpose of satisfaction and self care, and trusting and loving my body more than I could have ever imagined. I can confidently say that today, approximately 4.5 years after deciding I didn’t want to live my life obsessing over food, body concerns, and exercise, my relationship to food and my body is SO different. I never thought it could be so easeful and fulfilling. There is so much to learn but I can try to distill down some core facets that have really served my recovery.\n\n**Intuitive eating:**\n\n* This has been the most important resource for healing my relationship to food. The concept of intuitive eating was coined by 2 dietitians, and is outlined in a seminal book: Intuitive Eating, [https://www.intuitiveeating.org/](https://www.intuitiveeating.org/), the newest addition is now out and I fully recommend the accompanying workbook - Intuitive eating is a direct response to the failure of dieting. Ultimately, you’ll learn in the book that statistically speaking, diets don't work. They may deliver short term weight loss but the majority of people regain the initial weight plus MORE weight. Numerous studies have found that in general, diets result in long term weight GAIN rather than loss. This is because the body is protecting itself from famine. It’s a biological instinct to hold onto nutrients when they are restricted.\n* Intuitive eating is how our bodies were designed. It’s based around identifying hunger and fullness cues, feeling into our cravings, desires, satisfaction, and practicing attunement and acceptance. It’s a practice so there will be times when you feel like you made a mistake (i.e. overeat and it will hurt, under eat and get way too hungry and maybe overeat), but that is where the acceptance part comes in. Practice self compassion, move on and try better next time! You're completely unlearning old diet behaviors/rules and learning a whole new way of living and being in your body. It takes time but it gets easier and easier and ultimately you don't even really have to think about it, it becomes so natural. Also, Intuitive Eating is not a tool for weight loss nor is it the \"hunger and fullness diet\" where you only are \"allowed\" to eat when hungry. THERE ARE NO RULES in intuitive eating. It is a personal practice based on developing an intimate relationship with your body.\n* Trust is key. It’s really scary to trust your body at first. Especially if you’ve been in the diet mentality for a long time. Trust gets easier the more you practice it. And it’s so worth it.\n* Binge/Restrict cycling: This was a major lightbulb for me. I used to restrict foods physically (e.g. restricting # of calories/day or avoiding sugar). Physical restriction triggers a biological craving for what is restricted. It’s within our DNA to avoid famine as was advantageous for so many of our ancestors to survive. Our bodies are created to sustain themselves. A diet is nothing more than a simulated famine. When certain food groups or nutrients in general are restricted, the body responds with intense cravings that ultimately result in binging. Out of control eating that feels scary, wrong, and shameful. My binge sessions were often triggered by stress or being drunk. Following a binge episode, we often then are very ashamed and freaked out about the amount consumed. This often leads to further restriction and the cycle continues. I lived this cycle for years.\n* We can also restrict foods mentally. It’s a little trickier to understand but mental restriction is when you are telling yourself you “shouldn't” or “can’t” eat certain foods. The “good vs bad” and “clean vs dirty” food labeling are examples of mental restriction. Even if you are not physically restricting by outwardly being on a diet, mental restriction also can trigger the primal binge response. Our bodies are smarter than our minds. It’s against our biology to be denied nutrients, pleasure, and the social bonding of certain food rituals such as birthday cake or thanksgiving dinner.\n* There is also the “last supper mentality” which is when you are planning to go on a diet (such as a no sugar diet or all veggie cleanse) but you have some time before starting. It’s common that your cravings will be out of control as your body tries to get as much of that food group in as it can before being restricted.\n* Other Intuitive eating resources: Christy Harrison's Intuitive Eating Fundamentals Course (here), Isabel Foxen Duke's Stop Fighting Food (here), or the Fuck It Diet (here).\n\n \n\n**Joyful Movement:** \n\nI used to approach movement as “working out” or “exercise”. Constantly counting my calories, distance, pace, and progress. In healing your relationship to food and body, it’s often recommended to reconsider your movement choices. I stopped running and doing pilates for 3+ years since those types of movement did not feel supportive for my healing. Instead, I explored ways of moving that truly felt good in my body and I approached them with no expectations of caloric exertion, etc. - Yoga, rock climbing, nature walks, and tribal fusion belly dancing are all forms of movement that make me feel embodied, joyful, and mentally refreshed. My body feels celebrated instead of punished. I also approach movement intuitively, and never force myself to do any type or amount of movement that doesn’t feel like it will serve me. I embrace rest, especially on certain days of my monthly cycle, and I feel so much more in tune with my body's needs. - There have been challenging moments where life gets so busy that there is no/little time for joyful movement. These are times when my recovery is challenged and I get to deepen my practice of acceptance, trust, and letting go of expectations. Life is very cyclical and there will always be time to regularly move again. Time for movement is a privilege that so many people do not have. I’m so grateful when time allows for joyful movement but I do not punish myself or feel guilty when I do not have the time.\n\n**Body Image:**  \n\n\n* Health at Every Size:\n   * Health at Every Size (HAES) is a newly emerging concept with substantial scientific evidence to support it. In short, it is the idea that one’s body size does not indicate one’s health. Or rather, that people in larger bodies can be completely healthy even if considered “overweight”. Or that thinner does not necessarily equal healthier. (This is not to say that all people in larger bodies are healthy). You can learn about HAES at the website (here).\n* It's virtually impossible to live in western society without some form of body image struggles. Working on body image and reversing fat-phobia are KEY in healing. Whenever I have a body conscious/bad body image thought, I try to recognize it as a \"negative body image thought\" and respond with something like \"I am not my body\" or \"my body does not define me\" or \"my body is my vessel\" or \"the shape of my body does not matter\" or \"all bodies are worthy of love\"... I’d recommend finding some little mantras that resonate with you. Try following fat-positive social media accounts (models, athletes, influencers, etc.) that are actively celebrating diverse body types and people in larger bodies. This will help with restructuring your mindset to be less fat-phobic.\n* We live in a society/economy that glorifies a body type that only a small fraction of the female population naturally has. Capitalism media/marketing has insidious psychological tactics to make you hate your body and fear being \"fat\" in order to SELL YOU THINGS (diets, exercise products, beauty products, clothes, the list goes on)! They profit off of self hatred that they instill within us - It's truly evil. We must remember that \"modern\" times are only a glimpse of human history. Women in larger bodies have been worshiped for millennia by other cultures since they saw the full feminine form as a sign of fertility, beauty, and prosperity. Try to remember that we have all been subconsciously programmed by social construction, media, and marketing to fear the fat on our bodies. There is truly NOTHING wrong with your body no matter what size it is. Journaling down these reminders and self affirmations to encourage body acceptance will help restructure your mindset. It is totally possible to create new neural networks (brain connections = thought patterns) and overcome the root cause of your struggles!\n\n&#x200B;\n\n**Self care practices:**  \n\n\n* Healing from having a disordered relationship to food and body is so much more than just addressing the food and body relationship. There is almost always an underlying issue or set of issues that is driving the disordered behaviors. Yes, living in diet culture and fatphobia are main factors, but other factors contribute significantly. Some examples of underlying causes are: trauma (emotional, physical, etc.), unworthiness, low self esteem, perfectionism, needing to have control, escapism, self harm, etc.\n* For me, my disordered eating was caused by low self esteem, unworthiness, perfectionism, and the need to have control. When life gets stressful and overwhelming, it’s an instinct to grasp for control of something. Controlling one's food and body is an accessible option. - Prioritizing self care practices that support us is key! Ways to healthily manage stress, overcome trauma, heal unworthiness wounds, and increase self love and self acceptance are CRUCIAL to healing the root causes. Joyful movement is one of these practices but others are: journaling, talk therapy, art therapy, women's circles, reading, dance, yoga, singing, sound healing, reiki, acupuncture, creativity (art, writing, etc). A book that is often recommended is the Artist's Way. One of the practices in the book is a 30 minute journaling session first thing in the morning. Stream of consciousness, brain dump on to paper. This was amazingly transformative for me. My writing sessions often consisted of me unpacking my stresses and body concerns, and reassuring myself with positive affirmations.\n* So I highly recommend journaling! Journal your thoughts, feelings, emotions, etc. Practice self compassion, let yourself cry if you need to, and most of all FORGIVE yourself. We are not perfect and we are always learning. Forgiveness is huge. Explore other creativity, explore expression through dance, song, colors, cooking, whatever calls to you! More resources that have helped me:\n* The food psych podcast\n* the love food podcast\n* the fuck it diet podcast\n* Eating in the light of the moon\n* Intuitive eating book and workbook\n* Local support groups\n* Instagrams such as: nourishandeat, danaisabellaaa, jennifer\\_rollin, bravespacenutrition\n\nI hope this brings some insights and is supportive to your journey. Sending all the best to you <3",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/oz3ko8/what_ive_learned_in_recovery_so_far_4_years_in/",
  "score": 70,
  "num_comments": 5,
  "comments": [
    {
      "id": "h7xfeoe",
      "author": "Boosey0910",
      "body": "If even one person can gain something from your post, you will have done a great service.  I have lived a parallel experience to you.  I suffered for over 30 years and was in quasi recovery for a long time.  Finally pushed through the final barriers.  It was difficult to say the least. Your post is so encouraging which is what we all need (needed) to face the difficulties of recovery.",
      "created_utc": 1628253488.0,
      "score": 11,
      "context": []
    },
    {
      "id": "h7x1t5b",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1628243757.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h84d2tf",
      "author": "None",
      "body": "This was so insightful, thank you so much for sharing. As a friend of someone who suffers from a serious eating disorder where they have been in and out of hospital 8 times, reading this helps me to understand what she is going through and how to better support her. I wish you all the best on your healing journey.",
      "created_utc": 1628386145.0,
      "score": 2,
      "context": []
    },
    {
      "id": "haaxpse",
      "author": "dzoya1266",
      "body": "Hello. I am a 27 years old man and am the youngest child in my family. I have 2 sisters who are 3 and 4 years older than me and the younger one, I have no doubt, has an eating disorder. I think she is having it for more than 10 years now. I tried talking to her countless times and I ran out of words to say (tried explaining to her how much stress her body has to go through, told her she will struggle to find a boyfriend at this day and age when males think only of curves and are all needy, told her she is harming herself and the whole family by doing that, told her she can die doing it, her organs can stop working, tried explaining what she does from fitness point of view, told her I know she tries to manipulate us and lie that she eats and is trying to recover). Few days ago she fainted on her way to work, fell directly on her chin and broke her jaw, also injured on couple more places but now her jaws are sealed and she can only eat liquid food with straw. I think she still doesn't want to admit she has an eating disorder and I fear she will continue doing the same after she recovers from broken jaw. Is it ok if I try to force her to eat more or am I creating the counter effect by doing so. Please help me if you can, I think none of the other family members realises what a massive problem we have on our hands and I currently fear the worst. I know she will recover from injuries and this hard times will be past, but I know the whole problem is nowhere near being solved and the next time she starves her might be the last one if I don't tackle the problem real quick. She is now 30 years old and I think the problem started when she was 15 or so years old.",
      "created_utc": 1629905537.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h9w2ezc",
      "author": "Responsible_Prior208",
      "body": "Hello person, I know it is hard, and you want to fit in and your brainwashed by yourself and others but, please don't die one day only eaten Veggies and no sugar. Never living.",
      "created_utc": 1629622863.0,
      "score": 2,
      "context": [
        {
          "id": "h7xfeoe",
          "author": "Boosey0910",
          "body": "If even one person can gain something from your post, you will have done a great service.  I have lived a parallel experience to you.  I suffered for over 30 years and was in quasi recovery for a long time.  Finally pushed through the final barriers.  It was difficult to say the least. Your post is so encouraging which is what we all need (needed) to face the difficulties of recovery.",
          "created_utc": 1628253488.0
        }
      ]
    }
  ]
}