{
  "id": "p1cul0",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1628550582.0,
  "title": "Request: My girlfriend of 5 years has an eating disorder.",
  "selftext": " \n\nWhat can I do to help her? I'm unsure of when exactly  it started but she told me within the first 6 months of dating. She  told me her brother and others would make fun of her for being  overweight by her brother and some people at school when she was in  middle school and high school, so I can assume it started around 10  years ago since she is 25. She is like 5' 7 and maybe weighs xxx pounds (very thin)  now. Her parents know but I'm not sure to the extent, since they never  mention it. They are probably just pretending it's not a problem because  they feel bad/helpless. Heck, I'm not even sure how often she does it  because we don't live together, but I do know she has acid reflux and  sensitive teeth because of it. I try sometimes to talk about it but she  just says that she has good days and bad days sometimes. I've told her  to talk to a professional because I feel helpless, but she gets  defensive. I'm at a loss. I love her and want to help her to the best of  my ability.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/p1cul0/request_my_girlfriend_of_5_years_has_an_eating/",
  "score": 49,
  "num_comments": 9,
  "comments": [
    {
      "id": "h8cg3f4",
      "author": "Heart_shapedboots",
      "body": "Try cooking for her and getting her favorite snacks. On dates, try to eat earlier and let her keep the food down while you’re together. Usually not talking about eating helps me personally. If you’re having a snack, offer her some casually. If you don’t make it a big deal, she’s likely to be less defensive of it.",
      "created_utc": 1628550751.0,
      "score": 28,
      "context": []
    },
    {
      "id": "h8cunvk",
      "author": "una_verdadera_lata",
      "body": "It sounds like you are a very sensitive and caring partner to her, which is a lot of help already. Its also great that you are encouraging her to seek professional help. In my experience, especially when considering seeking some form of treatment it was a lot easier (if I wanted the help, because sometimes I didn’t, because I wasn’t ready) if someone I trusted and cared about helped me make those phonecalls, appointments, etc. however, you know already that you cant force her to get help she is t ready to receive. offering to make calls, schedule appts, if you are able might be helpful if she has anxiety about the nuts and bolts of getting treatment.\n\nim sure you already know this too, but I would avoid making comments about her appearance, food choices, etc. even positive remarks can be misinterpreted or twisted by her illness. being a safe person to eat with but not the food police (which is a hard balance to strike, I realize) is what would be helpful- because she won’t feel pressure, but will also (potentially) begin to feel comfortable making some steps, with you. Sometimes when no one acknowledges something that is a very obvious problem the ED can convince sufferers that “it isn’t bad enough to reach out” or that they “aren’t really ill” etc so I do think that somewhere deep down she appreciates that you are aware that she is in pain and that you see her suffering. In addition, it’s useful to make sure she knows that you see her behind her illness- and that could become a really motivating factor for her to get better: you love her personality, her talents, her skills, etc and those are denigrated by the disease.\n\nI would also just remind you to make sure you are taking care of yourself, as well. I know you don’t live with her but caring emotionally for someone with a serious disorder can take a toll on your own health so be sure to keep yourself well, and allow yourself to set healthy boundaries as well. You’re already doing a great job- it’s clear that you care a lot about her.",
      "created_utc": 1628557790.0,
      "score": 7,
      "context": []
    },
    {
      "id": "h8chxqr",
      "author": "None",
      "body": "Ur doing the best u can right now for her, not getting upset with her and trying to help her. Just don’t get mad or upset with her over it at any point, it will only make her worse. Don’t try to force food on her it will probably make her very upset. Just show her that u care about her and how much u love her and tell her everyday how beautiful she is.",
      "created_utc": 1628551637.0,
      "score": 13,
      "context": []
    },
    {
      "id": "h8daxxb",
      "author": "SpiralConsciousness",
      "body": "Don't push her, don't judge her, be her safe space. All rules of a normal functioning relationship are still applicable, just be there. When she says she needs help be ready. If you fear it's to that point without her acceptance, mention things you plan for the future with the 2 of you, get her thinking of the ahead and not on the past or her present disorder. Get her out of  a cycle that's repetitive and try to go for dates like a walk in nature or just a nice drive.",
      "created_utc": 1628565977.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h8e87jx",
      "author": "Plastic-Bid-1036",
      "body": "First off, we all need a man like you in our lives.\n\nIt's clear that you want to help her which is amazing.\n\nRecovery is the choice of the individual, nobody can make us (trust me all of my loved ones have tried). The sufferer has to be ready to make the choice for themselves.\n\nEating disorders are chronic and difficult to treat with a high rate of relapse. This doesn't mean recovery isn't possible, it's just really fricking difficult.\n\nI find being able to speak openly with the person I'm eating with is so helpful. Being able to casually mention \"I'm anxious that when the food comes out that something will be wrong\" (for example) and experience a supportive response makes me feel so much more at ease with eating.\n\nTake it day by day. One day she might want to eat with you and stuff, other days she might dig the heels in. One day she might over react, one day she might have a lovely meal with you. Be supportive, understanding and forgiving when she over reacts. Celebrate the small victories when you have a nice meal together and really savour that time with her. \n\nDon't ever try to make her eat. Express concern and be tactful with her. Choose your timing well when raising concerns. Encourage her to get help and look up local resources. Tell her she isn't alone. When she talks to you about it, really listen to her. If you don't know what to say in response to her, it's OK. Remember you're not an expert and you won't become one overnight. Just be as supportive as you can.",
      "created_utc": 1628591499.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h8f2885",
      "author": "HoneyWest55",
      "body": "I think you feel helpless because you are.  People with mental disorders or addictions have to first acknowledge the problem and then feel the necessity of getting help.  I lived with an alcoholic for years feeling helpless because he was ruining our family with abusive behaviour.  Saying anything just made matters worse because he felt 'pressured'.  Ironically, he lost me and alienated himself from his kids and eventually sought help and is now a non drinker.  Your GF will have to come to terms with it and deal with it.  It's wonderful that you are trying to be an encouragement to her.  She is not ready if she's getting defensive.  I stayed because I felt guilty to leave.  I sought counselling for myself and eventually realized that the responsibility for the situation was not mine.  I wasn't the one with the problem.",
      "created_utc": 1628608175.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h8cfqjy",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1628550582.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8ecz0g",
      "author": "hyliaheart",
      "body": "Try to not shame her or get angry about it. My husband tries to restrict me and I have a binge eating disorder. I always asked him to help but now I regret it because he tracks my eating and if I buy anything junk food like he will make me throw it away. I know he is trying to help but it makes me want to sneak food and binge more. This has now been discussed and worked on. \n\nIf she is seeing any therapists or groups encourage her to go and talk about her session afterwards with you. It seems she isn't doing that but maybe encourage her to go to group therapy? Its a good start. There is a foundation called Linda Tremble that does them for free. It is UK based but maybe they will take her? \n\nTL;DR: Encourage help, don't force her to eat.",
      "created_utc": 1628595128.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h8gujei",
      "author": "None",
      "body": "You could ask what foods she is most likely to purge so that you try to avoid those.  I know there are certain foods that I will usually keep down but others that I will purge 99% of the time.",
      "created_utc": 1628635750.0,
      "score": 1,
      "context": []
    }
  ]
}