{
  "id": "p5770k",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1629081142.0,
  "title": "Should we get my sister out of inpatient?",
  "selftext": "Not from the US, but I can't find advice on this anywhere else\n\n&#x200B;\n\n**TL;DR Sister is getting help in public hospital but her treatment seems too restrictive and we worry it's going to make things worse**\n\n&#x200B;\n\nMy sister(19) has been purging for months and her weight is at an all time low, also starting to showing symptoms like muscle pain, teeth problems these few weeks. From what we know she's also diagnosed with anxiety but not delusional, is very smart and highly self aware of her problems.\n\n&#x200B;\n\nFew days ago her counsellor advised her to be institutionalized, she agreed so we took her to a public hospital and she just got transferred to a mental unit yesterday, with her consent of course. By then all her personal items are taken away, which I understand. **Problem is they also took away her books, which to me seems very innocuous. We were told that the psychiatrist won't be able to see her until a week later. She probably won't have a counsellor aside from drugs. Also visitors are not allowed, not because of covid, but it's just a rule.**\n\n&#x200B;\n\nIt's great to have free healthcare here and I understand inpatient treatment comes with a lot of restrictions, the lack of doctors is a sad reality we have to accept, but the book thing seems too extreme to us. But if they're giving her all this free time and not doing anything special, why can't she at least read?\n\n&#x200B;\n\nIs inpatient treatment supposed to be this restrictive? We're tempted to get her out of there however we can't afford private hospitals. She has always been hated the attention and will likely resent us for her stay there anyway. Should we just wait and see what happens? What else can we do?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/p5770k/should_we_get_my_sister_out_of_inpatient/",
  "score": 37,
  "num_comments": 16,
  "comments": [
    {
      "id": "h94c2ie",
      "author": "empoweredaritay",
      "body": "It is not supposed to be that restrictive, no. Such a harsh environment can make it really hard to recover. She should be somewhere where she can speak to a therapist and be able to read books in her free time. The treatment center I went to was somewhat restrictive, yes, but we met with a therapist a few times a week, had group sessions, and could read/do puzzles/etc in our free time. We could also have visitors.",
      "created_utc": 1629089236.0,
      "score": 32,
      "context": []
    },
    {
      "id": "h94g2yf",
      "author": "InSkyLimitEra",
      "body": "I’m a resident emergency physician almost 4 years recovered from anorexia. Taking away books goes too far. My guess is that they are concerned that the books contain material that will continue to feed the mindset of an eating disorder in some way, but that’s too restrictive. Physicians do have the power to bend rules, but it’ll be hard to justify getting an exception made for her when nobody else is allowed to have books. You may need to make a decision about the risks of leaving and how long it will take to transfer her elsewhere versus just gutting it out and hopefully finding some sort of alternate diversion. I have never heard of a psych ward taking books away unless they were spiral-bound (lethal weapons, truly! 🙄).",
      "created_utc": 1629091900.0,
      "score": 20,
      "context": []
    },
    {
      "id": "h955d32",
      "author": "HubbyHasBlueBalls",
      "body": "I literally have PTSD from inpatient/ residential treatment, a lot of it came from being in an extremely restrictive setting without adequate mental health support. I spent years trying to scrape my self-worth off the ground (if mental health professionals feel I should be treated this way, then I must deserve it).  It made trusting professionals in the future very difficult and at times impossible.  There is a trade off in all of this.  Treatment temporarily gave me my physical health back, but it came at a huge long term cost.  It drove me further into my disorder instead of helping me reach recovery. Going to treatment remains one of my biggest lifetime regrets. I don't have a ton of advice, especially since your medical system is so different from the US, but you do have a right to be cautious and apprehensive about how your sister is being treated.",
      "created_utc": 1629111922.0,
      "score": 14,
      "context": []
    },
    {
      "id": "h94q2eh",
      "author": "houston_veronica",
      "body": "It's not uncommon, at least IME. I went to a place in Arizona that is very well-known, and they took my only book away, and it was a book on hiring people in the \"I-generation\"..(meaning: this was a very, very non-ED-related book. It was a book my boss had asked us all to read).\nTheir comments to me were:\n- We want you to focus on recovery -- and they HAD given all patients a GIANT bag full of books that were to help us with our treatment and recovery. (actually pretty decent books, too.)",
      "created_utc": 1629099445.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h968ccw",
      "author": "avalclark",
      "body": "I am a clinical psychologist who just took and passed my state’s laws and rules exam. One of the things I had to learn was that inpatient programs legally have to allow visitors or at least contact with loved ones. New intakes have to be seen within 24 hours. This might just be my state, but this seems illegal and definitely not ok. \n\nEating disorder treatment may be different than psych inpatient, but yeah, this doesn’t seem right.",
      "created_utc": 1629130473.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h95t2w5",
      "author": "Equivalent_Section13",
      "body": "Well there is no transfer \nThe issue is of your sister is having major medical problems you need to know what they are \nWhat is her blood work \nHow is her major organs \nIf she has restricted is she exhausted ..\nYour choices are really limited \nPlus there are doctors there you must be referring to the specialist. Who are they. What are their names",
      "created_utc": 1629124347.0,
      "score": 0,
      "context": []
    },
    {
      "id": "h96ax5n",
      "author": "None",
      "body": "If she has a ed than being that restricted will make it worse on top of that i refuse to go back to a inpatient bc they only give you what they serve or nothing so there's a good chance she's not eating due to having a ed and no safe foods, in my personal opinion have her call someone with a ed that she can relate to, a pen pal was how i started getting better",
      "created_utc": 1629131467.0,
      "score": 0,
      "context": []
    },
    {
      "id": "h93xfo2",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1629081142.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h953dtp",
      "author": "xxtatgirl93xx",
      "body": "Is this a general psych ward do you know",
      "created_utc": 1629110475.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h975m7a",
      "author": "in_the_sheyd",
      "body": "That kind of treatment is extremely common in emergency psych wards. Staff take away all your things because they don’t want to deal with keeping track of it. Ditto for visitors. There’s no therapeutic reason for doing it. It’s a staff convenience thing, it’s traumatic, and it’s wrong.\n\nMake contact then get her out without delay. You might need to reach out to a local lawyer to learn your (and her) rights because actually getting her out is going to be a fight.\n\nEdit to add: I have severe PTSD in part from my experience in a hospital like that. It ultimately made my ED much worse because it made me feel unable to control my own body.",
      "created_utc": 1629143553.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h978zeq",
      "author": "_Axelotl_",
      "body": "This is way too harsh. A lot of facilities that treat eating disorders don’t go about it the right way and a lot of people come out of there traumatized. I’d suggest to find something else like group therapies and daily therapy. Read about the best way to support someone with an eating disorder and provide a home environment where she feels safe. Sending love and support xx",
      "created_utc": 1629144874.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h98avhj",
      "author": "una_verdadera_lata",
      "body": "Sometimes in my experience the rules are very strict at the beginning- even the visitor thing- because the patient is so poorly that they really need to just focus on restoring their health without distractions. Then, as they gain back strength and cognitive function- more normalcy is restored to their routine. I have had my clothes taken away before and although it made me mad as all hell at the time, ultimately it curbed a destructive behavior and the place that enforced that rule truly saved my life on multiple occasions. I would talk to her team before removing her from the unit, and see if they can explain the rules to you and her course of treatment. Not saying you definitely should or should not just offering a perspective that sometimes harsh rules can have benefits, and aren’t necessarily permanent.",
      "created_utc": 1629161140.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h96bp59",
      "author": "None",
      "body": "Ime?",
      "created_utc": 1629131767.0,
      "score": 2,
      "context": [
        {
          "id": "h94q2eh",
          "author": "houston_veronica",
          "body": "It's not uncommon, at least IME. I went to a place in Arizona that is very well-known, and they took my only book away, and it was a book on hiring people in the \"I-generation\"..(meaning: this was a very, very non-ED-related book. It was a book my boss had asked us all to read).\nTheir comments to me were:\n- We want you to focus on recovery -- and they HAD given all patients a GIANT bag full of books that were to help us with our treatment and recovery. (actually pretty decent books, too.)",
          "created_utc": 1629099445.0
        }
      ]
    },
    {
      "id": "h96c9rn",
      "author": "None",
      "body": "With a ed being so restricted made it to where i got worse and worse until my mom took me out, legally bc she went there of her own will she is allowed to leave of her own will,and not having contact with your rock (usually a family member) also makes a ed worse then on top of that if reading is a coping mechanism Taking away her books will make her mental stability away also making her ed worse",
      "created_utc": 1629131989.0,
      "score": 2,
      "context": [
        {
          "id": "h968ccw",
          "author": "avalclark",
          "body": "I am a clinical psychologist who just took and passed my state’s laws and rules exam. One of the things I had to learn was that inpatient programs legally have to allow visitors or at least contact with loved ones. New intakes have to be seen within 24 hours. This might just be my state, but this seems illegal and definitely not ok. \n\nEating disorder treatment may be different than psych inpatient, but yeah, this doesn’t seem right.",
          "created_utc": 1629130473.0
        }
      ]
    },
    {
      "id": "h96fbiy",
      "author": "per_aspera--ad_astra",
      "body": "IME: “in my experience”",
      "created_utc": 1629133157.0,
      "score": 4,
      "context": [
        {
          "id": "h94q2eh",
          "author": "houston_veronica",
          "body": "It's not uncommon, at least IME. I went to a place in Arizona that is very well-known, and they took my only book away, and it was a book on hiring people in the \"I-generation\"..(meaning: this was a very, very non-ED-related book. It was a book my boss had asked us all to read).\nTheir comments to me were:\n- We want you to focus on recovery -- and they HAD given all patients a GIANT bag full of books that were to help us with our treatment and recovery. (actually pretty decent books, too.)",
          "created_utc": 1629099445.0
        },
        {
          "id": "h96bp59",
          "author": "None",
          "body": "Ime?",
          "created_utc": 1629131767.0
        }
      ]
    },
    {
      "id": "h99rdlb",
      "author": "houston_veronica",
      "body": "yes!!",
      "created_utc": 1629193702.0,
      "score": 1,
      "context": [
        {
          "id": "h94q2eh",
          "author": "houston_veronica",
          "body": "It's not uncommon, at least IME. I went to a place in Arizona that is very well-known, and they took my only book away, and it was a book on hiring people in the \"I-generation\"..(meaning: this was a very, very non-ED-related book. It was a book my boss had asked us all to read).\nTheir comments to me were:\n- We want you to focus on recovery -- and they HAD given all patients a GIANT bag full of books that were to help us with our treatment and recovery. (actually pretty decent books, too.)",
          "created_utc": 1629099445.0
        },
        {
          "id": "h96bp59",
          "author": "None",
          "body": "Ime?",
          "created_utc": 1629131767.0
        },
        {
          "id": "h96fbiy",
          "author": "per_aspera--ad_astra",
          "body": "IME: “in my experience”",
          "created_utc": 1629133157.0
        }
      ]
    }
  ]
}