{
  "id": "p5up2h",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1629166655.0,
  "title": "Request: My (f23) Dad (m56) has an eating disorder, how do I help him?",
  "selftext": "Context: I previously have had eating disorders (bulimia + anorexia + exercise disorder ), and I’ve dealt with female friends with EDs, but I don’t know how to address it with my dad. I also have a mom, twin sister, and older brother (m25). Of the siblings I am the closest with my dad.\n\n&#x200B;\n\nMy Dad is a no-nonsense, no-emotion, would never ask for help, would never go for counselling kind of guy. However he has lost a significant amount of weight over the summer due to his small meals, and his 3-6 hours of exercise a day. My whole family is aware of his current habits.\n\n&#x200B;\n\nHe normally has oatmeal for breakfast, an apple or carrots for lunch, and a really small dinner (like a salad). First of all he is not even eating enough for someone his size even if the person was inactive. Second, because he works out so much he should be eating way more. He is also constantly weighing himself and bringing up his weight in conversation, saying that he thought he should have lost more weight.\n\n&#x200B;\n\nI want to help him, but this is different because it’s my dad, and because he has a tricky ego complex. How do I encourage healthy habits and how do in recommend that he seeks medical advice? He never likes talking about his personal life and personal thoughts, but my family and I are very concerned. Any advice is appreciated!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/p5up2h/request_my_f23_dad_m56_has_an_eating_disorder_how/",
  "score": 59,
  "num_comments": 9,
  "comments": [
    {
      "id": "h98yi5k",
      "author": "xxtatgirl93xx",
      "body": "I can not say I’ve been in this scenario exactly however I can empathize.\nI will say this. You have an understanding that only comes through going through it. Use it. It’s hard but when you speak to him show him that vulnerable part of you and perhaps that will help him.  \nI hope this helps and I wish the best for you",
      "created_utc": 1629172625.0,
      "score": 24,
      "context": []
    },
    {
      "id": "h99hnev",
      "author": "Aliinga",
      "body": "That sounds like a lot of responsibility for a daughter. Please be careful that this doesn't put you at risk of relapse.\n\nI think the best thing you can do as a family member is to show that you understand and that you are concerned, but ultimately to get him to accept the help of professionals. Even if he initially just goes to ease the concerns of his family, and not for himself.\n\nIf he goes, I think it might be important to have someone go with him or be otherwise in contact with the GP/ED professional bc your dad might downplay the issue and then turn around at you guys and say \"see, my blood results are fine! The doc says I am okay\". Someone needs to tell the professionals what is really going on and that there is a history of anorexia in the family.\n\nLastly, if you go to a doctor, make sure they have experience recognizing EDs. Middle-aged men are not the population group professionals are used to diagnosing with an ED. It would be very tempting to dismiss him if they don't know what they are looking for.\n\nEdit: Also not all forms of treatment involve talking about feelings. In case your dad is worried about that.",
      "created_utc": 1629185641.0,
      "score": 12,
      "context": []
    },
    {
      "id": "h99h2dy",
      "author": "Elllliiiizzzaabeth",
      "body": "My dad has an eating disorder, too! I honestly think I inherited some of my dad’s tendencies, because his weighing himself daily, & constant talk of exercise & healthy eating definitely impact my own mindset & behavior. \n\nIn terms of advice, I genuinely have no idea how to approach it with my own dad, so I can’t really help with that aspect unfortunately. I’ve talked about it with my therapist, & it seems like the stigma around mental illness for that age group, plus the stigma and disbelief that males could have eating disorders, all make it even harder to approach the subject. I feel like the best thing you could do for your father is offer to listen & support him. Maybe you could bring it up in terms of how it effects you, maybe by saying it impacts your Ed recovery, & then he’d feel less like you were accusing him of anything. Obvi that’s gonna be a touchy convo no matter what, but in my experience, my dad doesn’t like admitting any vulnerability so it’s impossible getting through to him unless I’m talking about myself",
      "created_utc": 1629185172.0,
      "score": 6,
      "context": []
    },
    {
      "id": "h9b674z",
      "author": "RembrandtQ-Einstein",
      "body": "This is so tough. My husband is in a similar age range and also has unhealthy and extreme eating and exercise habits. It has been heartbreaking watching him become more and more frail. I have raised my concerns with him and he is very defensive and unwilling to consider there is a problem. Like your dad, he is uncomfortable with emotions and the idea of examining them. It seems like eating disorder treatment focuses a lot on emotions, self esteem, poor body image, etc, and I think that’s not at play with my husband. He just thinks he’s developing healthy habits and he loves his new body. His liver panels showed abnormalities and he had testing that turned up the warning signs of liver damage, but as a thin man who eats low fat and exercises, his doctors have completely missed that he has a problem, and that was my last hope of him getting a wake up call. He argues that he doesn’t have a problem because he’s reached his goal weight and doesn’t intend to lose more, his BMI is in the acceptable range, and he’s never been so hungry that he’s passed out. \n\nI have been approached by many mutual friends who expressed concern for him and assumed he was undergoing cancer treatment. I’m hoping that even though he is in denial, my bringing concerns with him have planted a seed that there is something wrong, and maybe someday he will turn a corner. I think that’s all I can do at this point. \n\nSeeing other people’s comments here about the men in their lives having similar struggles have brought me some comfort knowing I’m not alone in this. It’s so rare to hear about middle aged men with eating disorders. I think all you can do is express your concern, encourage him to get help, and then take care of your own emotional well being.",
      "created_utc": 1629219017.0,
      "score": 5,
      "context": []
    },
    {
      "id": "h9aaavz",
      "author": "Tracie10000",
      "body": "I'd say dad would you be happy if I was eating the little you do and exercise the amount you do. Say dad you are losing too much weight. It's making me very concerned about your well-being. I think you need to be gentle. Ask him why he feels the need to disappear on you. He says what are you on about?? Then you say dad you are going to disappear if you lose much more.",
      "created_utc": 1629205640.0,
      "score": 3,
      "context": []
    },
    {
      "id": "h98mrzk",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1629166655.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h9b8gnt",
      "author": "Deni02",
      "body": "I don’t think I’ve ever related to a post more, and tbh I thought I was completely alone in this. Over the course of the past four years or so, my dad has become obsessed with nutrition and wellness, specifically keto. He’s lost a significant amount of weight and I’d be comfortable confronting him about it if I didn’t also take up the diet and develop a severe eating disorder myself. If I brought it up now I know he would hate himself and blame himself for my eating behaviors and obsessive tendencies, so I feel that if he hadn’t influenced me and I wasn’t in the midst of a disorder I would be able to help. As someone who has dealt with several disorders yourself and, as you said, someone who is close with your father, I feel you confronting him one on one and being nothing but honest about your experiences and concerns would be the best course of action. He may feel cornered if your entire family stage a sort of intervention, so I would take things slow and help him realize that he has a problem that needs solving.",
      "created_utc": 1629220276.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h9broh1",
      "author": "None",
      "body": "Honestly... you need an intervention. You need a large group of people that arguably love and care about him to sit around and tell him that they're worried about him, that it's not healthy, and that he needs help.\n\nIt can't just be you... that's just a kid, HIS KID, being overly protective. It can't be JUST anyone. It needs to be a group. He needs to have his views seen as the minority. That's the only way past the \"I am fine and can do everything alone\" ego complex. And admittedly it doesn't always work the way you want it to. Some people just get mad and throw around the words \"ganged up on\" a lot. At which point, we have another intervention, in my personal experience. We just kept making it a thing until they couldn't argue with it anymore. \n\nI don't have great answers, but I hope you think of something, and I hope this doesn't impact your own recovery unless it strengthens you to help someone else.",
      "created_utc": 1629230023.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h9cg8ss",
      "author": "None",
      "body": "Does your dad know about your previous EDs? Do you think if you talk to him about it gently, he would understand your perspective of being worried about him, especially if he was in that position himself when you had your ED? Using 'I' statements about how you feel about the situation is the least 'attacking'. It may be a slow processes of building his insight - small conversations that plant the seeds, so don't put heaps of pressure on yourself to get  him to realise he needs help straight away - because it's likely a process and you planting the seeds in his head is a wonderful start!",
      "created_utc": 1629240734.0,
      "score": 1,
      "context": []
    }
  ]
}