{
  "id": "p7s7qe",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1629422752.0,
  "title": "Request: Girlfriend got mad at me after I confessed to struggling with an ED",
  "selftext": " \n\nI'm.. not really sure what to do. I've been struggling with this for a few months now but I was scared to admit it. Today I decided I'd let my girlfriend know, I don't know what I expected or why I told her, guess I just thought she deserved to know. Either way I didn't think it through. She got mad at me and told me it wasn't healthy, that I looked perfect like this, etc. all I could do was apologize and promise I'd do better in hopes she'd calm down. She now says she's going to check on me everyday to make sure I'm eating all my meals. I already know it's not healthy, it's not like I'm not aware of what I'm doing... I know she's trying to help but right now I'm just terrified. I regret bringing it up and I don't know how to convince her to not do it.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/p7s7qe/request_girlfriend_got_mad_at_me_after_i/",
  "score": 61,
  "num_comments": 7,
  "comments": [
    {
      "id": "h9lyt22",
      "author": "None",
      "body": "I think you wanting to share this with your girlfriend shows that part of you wants to address the problem. Her reaction of anger was probably rooted in the fear that you’re hurting yourself and she might have a hard time understanding why. A lot of people initially respond with anger because it’s confusing to them, she’ll understand better with time and if you guys continue to have conversations about your ED. It’s normal for her to be concerned and want to make sure you’re okay, I think you’re just going to have to further discuss what kind of support you expect from her and what feels out of line to you. I’m proud of you for speaking up about your ED, whether or not you’re working towards recovery it’s a great step to building a support system. I’m sure it feels overwhelming right now but in the end, you made a good choice and things will get easier. Good luck.",
      "created_utc": 1629423875.0,
      "score": 32,
      "context": []
    },
    {
      "id": "h9mdtoa",
      "author": "Dammit_Amber",
      "body": "Your girlfriends anger most likely came from a place of love and care. I'm in no way comparing ED to drug abuse but the reaction that our loved ones have to finding out about ED is comparable to the reaction to finding out about drug abuse. Mostly fear and love but a small percent is anger because how could we do this to ourselves. People who dont struggle with ED tend to have a very slim perception on what ED really is. It's not just hating our bodies.  It's a mental illness. Let her take the time to let it sink in and kind of get used to the idea because it is shocking. Then sit down and explain yourself. If you dont already have professional help it's best to seek it. You are sick enough. You dont have to be dying to get help. Find a support system and let your girlfriend help as much as she wants. Let her know you want to be better but you will very likely have relapses. Even though you dont want to. But you will try your hardest every day to overcome this. Let her know what she can do if she wants to help. I hope you find a smooth path toward recovery my friend. Positive vibes your way.",
      "created_utc": 1629431560.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h9ngepe",
      "author": "houston_veronica",
      "body": "It's so hard, and you did something so, so brave. We've mostly all been in a similar shoe, if we are part of this sub. I remember vividly that my husband got mad when I told him I wanted to suddenly be a vegetarian. It's not that he's against that in the least, but it was part of a bigger picture of me eating less and less, and him not knowing how to handle it. It took me 14 years to get help, so please know that you can definitely benefit from getting help sooner!  \nDon't allow anyone to shame you or make you feel that you are to blame. This is an ED, it's a mental illness. You didn't ask for it, you cannot \"wish\" it into happening. She doesn't understand these things, but in time, she may. I believe that she is having an initial reaction, but soon, she will see how very hard this is and hopefully, develop some empathy.",
      "created_utc": 1629460504.0,
      "score": 4,
      "context": []
    },
    {
      "id": "h9nyqxd",
      "author": "maddie6ix9ineeeeeeee",
      "body": "i understand her pov where it comes out of love and concern but this can be traumatic for you to handle since this kind of ed behavior usually determines how in control we feel, so id recommend consulting a therapist if you can ASAP",
      "created_utc": 1629469454.0,
      "score": 2,
      "context": []
    },
    {
      "id": "h9lwh4w",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1629422753.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h9q2ujk",
      "author": "sweetparamour79",
      "body": "Anger often comes from fear. My husband was the same when I first told him and had a horrendous nickname for me, which as my therapist confirmed is a sign he is totally out of his depth lol. \nIt's hard to start recovering without enough food to get rid of the brain fog. The main point is something emotional/mental underlies this and when your partner appreciates this it will help. \nUntil then remember they are just scared, you've told them you are sick but unlike with other illnesses you are starting without a support team of experts. Telling someone is a massive step though ❤️",
      "created_utc": 1629501110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "h9trpds",
      "author": "DartInTheDark",
      "body": "Anger is typically a secondary emotion - a reaction to another emotion that came first. Fear? Worry? Sadness? Perhaps a good next step is (when you're both calm and in a good headspace to talk) to ask her what she felt before the anger?",
      "created_utc": 1629576460.0,
      "score": 1,
      "context": []
    }
  ]
}