{
  "id": "p9wn7i",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1629712817.0,
  "title": "Request: I've begun eating normally and have started getting hungrier and hungrier.",
  "selftext": " \n\nHi, I've struggled with what I believe to be an eating disorder for about a year now, although the intensity of it has fluctuated. I've recently started eating normally again, eating a regular amount of calories opposed to the amount I was eating, so about xxx more (I think I should add that I've always just fasted and worked out, never purged). But with this I've noticed I've started getting way hungrier, like usually I can last about 24 hours without eating and feel alright but since I've been eating better I can only last about 8. I guess this is just my body getting back into how it used to be but it's all happened so suddenly, and its weird because I didn't even do this with the intent to \"recover\", I've just been eating more. Is this normal? Anyone have any advice on how to deal with this increased hunger?\n\nTL;DR: I've begun eating normally and have started getting hungrier and hungrier. Is this normal and does anyone have any advice on what to do about it?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/p9wn7i/request_ive_begun_eating_normally_and_have/",
  "score": 62,
  "num_comments": 11,
  "comments": [
    {
      "id": "ha0yi3j",
      "author": "oerosarevegan",
      "body": "I went through something similar when I started increasing my calorie intake. I was absolutely ravenous, could eat anything in sight. And it wasn't like I *wanted* to eat or was in a binge where it felt compulsive, my stomach was growling and so hungry no matter how much food I ate. I remember one night for dinner I ate like 4 massive peanut butter and banana sandwiches, a cinnamon role and cereal in the span of like 2 hours and was still hungry after. \n\nYour body is simply making up for lost time, it is essentially thinking \"we're finally getting food, now we need to get *allllllll* the food\". It can definitely be uncomfortable, and I had terrible digestive issues that went along with this as my body was adjusting to new intake. The best thing you can do it just eat, even mental hunger is hunger and like it or not our bodies need fuel. \n\n&#x200B;\n\nTabitha Farrar has great resources on extreme hunger and how to navigate it. I hope you're doing ok, it is definitely a very uncomfortable process physically and mentally but restricting any further to what you think \"should\" satisfy you will only make the extreme hunger worse.",
      "created_utc": 1629722860.0,
      "score": 33,
      "context": []
    },
    {
      "id": "ha0rbfa",
      "author": "UnlikelyAwareness343",
      "body": "Hi, I just want to start off by saying I hope you are doing ok - this type of thing can be very distressing, especially if you don’t know what’s going on.\n\nThis is very common for people in eating disorder recovery; it is called extreme hunger and can happen at any time. This is essentially your body compensating for a period of restriction. Your body is responding to what it thinks has been a famine, and is trying to get you back to a weight at which it can function properly.\n\nTo get rid of this, you need to make your body trust you. The only way to do this is to listen to what it is telling you and eat until you are full. This is very difficult, and your eating disorder will tell you not to. You mustn’t listen to it - restricting more will only make it worse. If you want to research more on this, I would recommend the YouTube channel What Mia Did Next, or just searching up extreme hunger in ed recovery on google. \n\nI went through this not long ago, and all I can say is it does get better :).",
      "created_utc": 1629718559.0,
      "score": 16,
      "context": []
    },
    {
      "id": "ha2eslh",
      "author": "canadianworm",
      "body": "Yep, super normal. Your finally feeding your body and it wants to keep being feed, metabolism bounces back after starvation mode.",
      "created_utc": 1629745399.0,
      "score": 6,
      "context": []
    },
    {
      "id": "ha1pjbl",
      "author": "graciously13",
      "body": "You're likely hypermetabolic right now. It happens to pretty much every underweight individual once they start eating normally. It just means your body needs more calories to even maintain your current weight let alone repair soft tissues and continue to gain weight.\n\nAlso, extreme hunger is no joke. It goes away, so please don't fret. I disagree with the other comment about this behavior leading to binging. Sure, anything's possible, but I think your body will be thankful and healthier once you repair your body (with food) and allow yourself to fill full and satiated (with whatever it takes). I have felt this way once and now I eat more intuitively. Check out All In diets. Stephanie Buttermore comes to mind.",
      "created_utc": 1629735066.0,
      "score": 5,
      "context": []
    },
    {
      "id": "ha2hptp",
      "author": "tiny_teacup97",
      "body": "Hey :)\nThis is completely normal and a common occurence if you've starved yourself for a long time.\nIt happened to me a few years ago.\nI would eat a ton of literally everything and still be hungry. I felt genuine hunger and would just eat continuously throughout the day. \nNow I am so thankful that I listened to my body. \n\nJust try to relax and not to worry about it. Be strong and try not give in to your ED thoughts. I would advise you to reach out for help/advice or medical help (if you can) because extreme hunger is mentally challenging. I went through it alone and it was really really hard. At the time I felt like my body was recovering, but my brain was stuck in the past. You will have to do mental work.\n\nI hope it goes well for you. Treat yourself with kindness and be strong <3",
      "created_utc": 1629746610.0,
      "score": 3,
      "context": []
    },
    {
      "id": "ha0yh13",
      "author": "juliecaesar",
      "body": "Yeah, your body was starved for so long that your so-called “animal brain” is kicking into survival mode and sending you signals to get as many calories as it can, in case it is starved again. This is how anorexia can turn into the binge (and potentially purge) cycle. You’ll want to get adequate calories so that you’re not starved, and then when you get the urges to binge calories you just have to ignore them until they go away. Definitely try and seek counseling to help you through this. Brain Over Binge is also a great book to help break down what is happening in your brain/body. It’s all about retraining the prefrontal cortex to be your decision maker, not your starved/abused sub-cortex that is much more impulse and survival driven.",
      "created_utc": 1629722844.0,
      "score": 2,
      "context": []
    },
    {
      "id": "ha0jqt4",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1629712817.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ha4e0yc",
      "author": "None",
      "body": "I’m in the same exact boat",
      "created_utc": 1629777190.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ha1zqtg",
      "author": "oerosarevegan",
      "body": "I really don't think your comment about the binge eating is accurate- OP made it clear they are dealing with real, physical hunger cues. Binge eating is often an emotional response or habitual, it is eating past the point of fullness but not being able to stop yourself. Many doctors and ED specialists have concluded that you actually cannot binge in anorexia recovery (provided this is what OP has, there is no mention of ED diagnosis). She is simply refeeding, and categorizing the process of extreme hunger as a binge can be more stress inducing to the ED brain. \n\nThis ([https://tabithafarrar.com/2017/02/recovery-binges-not-end-world/](https://tabithafarrar.com/2017/02/recovery-binges-not-end-world/)) website gives good insight into why recovery is not a binge, and why posting that OP could possibly develop binge tendencies is not helpful.",
      "created_utc": 1629739237.0,
      "score": 7,
      "context": [
        {
          "id": "ha0yh13",
          "author": "juliecaesar",
          "body": "Yeah, your body was starved for so long that your so-called “animal brain” is kicking into survival mode and sending you signals to get as many calories as it can, in case it is starved again. This is how anorexia can turn into the binge (and potentially purge) cycle. You’ll want to get adequate calories so that you’re not starved, and then when you get the urges to binge calories you just have to ignore them until they go away. Definitely try and seek counseling to help you through this. Brain Over Binge is also a great book to help break down what is happening in your brain/body. It’s all about retraining the prefrontal cortex to be your decision maker, not your starved/abused sub-cortex that is much more impulse and survival driven.",
          "created_utc": 1629722844.0
        }
      ]
    },
    {
      "id": "ha4v13m",
      "author": "burningbonksalad",
      "body": "Me too, it's somewhat comforting reading this post and knowing it's normal",
      "created_utc": 1629789046.0,
      "score": 1,
      "context": [
        {
          "id": "ha4e0yc",
          "author": "None",
          "body": "I’m in the same exact boat",
          "created_utc": 1629777190.0
        }
      ]
    },
    {
      "id": "ha2e3cu",
      "author": "juliecaesar",
      "body": "I’m not a doctor, that is just my understanding of it. OP should take advice from the Internet with caution and seek help with professionals. Will check out your link, thanks",
      "created_utc": 1629745110.0,
      "score": 2,
      "context": [
        {
          "id": "ha0yh13",
          "author": "juliecaesar",
          "body": "Yeah, your body was starved for so long that your so-called “animal brain” is kicking into survival mode and sending you signals to get as many calories as it can, in case it is starved again. This is how anorexia can turn into the binge (and potentially purge) cycle. You’ll want to get adequate calories so that you’re not starved, and then when you get the urges to binge calories you just have to ignore them until they go away. Definitely try and seek counseling to help you through this. Brain Over Binge is also a great book to help break down what is happening in your brain/body. It’s all about retraining the prefrontal cortex to be your decision maker, not your starved/abused sub-cortex that is much more impulse and survival driven.",
          "created_utc": 1629722844.0
        },
        {
          "id": "ha1zqtg",
          "author": "oerosarevegan",
          "body": "I really don't think your comment about the binge eating is accurate- OP made it clear they are dealing with real, physical hunger cues. Binge eating is often an emotional response or habitual, it is eating past the point of fullness but not being able to stop yourself. Many doctors and ED specialists have concluded that you actually cannot binge in anorexia recovery (provided this is what OP has, there is no mention of ED diagnosis). She is simply refeeding, and categorizing the process of extreme hunger as a binge can be more stress inducing to the ED brain. \n\nThis ([https://tabithafarrar.com/2017/02/recovery-binges-not-end-world/](https://tabithafarrar.com/2017/02/recovery-binges-not-end-world/)) website gives good insight into why recovery is not a binge, and why posting that OP could possibly develop binge tendencies is not helpful.",
          "created_utc": 1629739237.0
        }
      ]
    }
  ]
}