{
  "id": "pbw47y",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1629970748.0,
  "title": "Request: My GF is spiralling and I'm lost on what to do.",
  "selftext": " \n\nI (26M) have been with my GF (26F) for almost two years now. When I met her, she was at a healthy weight, thin, but healthy.\n\nI already knew that, a few years prior to us getting together, she was hospitalized for anorexia nervosa and low weight. She talked about it with normalcy, and it was clear she was better.\n\nDuring the first few months, she ate normally, and aside from a few comments about her not being perfectly happy with her body, she was stable and mostly okay. 6 months in, she had her first real episode. She said that she was obese and that she wanted to lose X amount of weight. I discouraged it, tried to be supportive, but she was set on losing weight.\n\nI guess at this point I have to talk about her family. Her parents are just terrible, unsupportive and judgmental. Her mother is manipulative and extremely toxic, and her father is a bigot. Their way of dealing with her being unwell is telling or forcing her to eat, calling her names, or lashing out at her.\n\nThe thing is, she cares more about what her parents have to say than anything in the world. She craves their approval (which they never give) and makes them a part of everything, knowing that they're going to make everything ten times worse.\n\nShe looked like she was getting better, but then she was diagnosed with lactose and fructose intolerance, on top of her celiac disease. This has just been devastating to her mental health and her struggle against anorexia. It started by her losing a bit of weight because her stomach hurts every time she eats, and then it spiraled out of control. To her, the weight she's lost is gone forever, not the consequence of an illness that needs to be corrected, but the start of a weight loss journey.\n\nShe's already at the point of being medically underweight, but that doesn't matter. She sets the goal of losing X amount of weight, promising that she will be happy with her body then, then she reaches that weight and moves the goalposts to an even lower weight. Recently she's said that she wants to be exactly at the weight where she's not going to be hospitalized, even though that's severely underweight by any metric.\n\nSometimes she weighs herself and tries to celebrate with me that she's lost weight. I don't know if that's her trying to manipulate me into enabling her or just an attention-seeking behaviour, but it always leads to her being disappointed and sad that I don't celebrate with her. I don't scold her or anything, I just mention that I wish she didn't put such an emphasis on her weight.\n\nI also can't just try to keep her mind off her weight or weight loss in general. Anything and everything can be twisted to talk about her desire to weight less and her disgust with her body. Try to play a videogame? If the player's avatar can be customized, she will make the most underweight character possible, spending ages trying to \"get the proportions right\". Reading a book? Is any of the characters fat? What do they eat?\n\nShe also suffers from GAD and, I suspect, from depression, which she absolutely refuses to even consider. She doesn't enjoy any of her old hobbies, she can't finish books or series, she just browses TikTok endlessly. She used to love her job, now she dreads going back (she's on sick leave). I have to push her to text her best friend of ten years. This all screams \"depression\" to me, someone who has gotten better from depression myself.\n\nShe's extremely intelligent and a nurse, which allows her to hide her symptoms when she talks to her psychologist and psychiatrist. She convinces all of her healthcare providers that she's just suffering from anxiety.\n\nI love her, and I want to spend the rest of my life with her. She's everything I could ask for in a woman, but I feel like that woman is slowly being replaced by her illness. I can count with one hand the times that we've had a genuinely good time that didn't involve sex in the last 6 months. I can't go for a walk with her, as not only she doesn't want to leave the house for anything other that driving to go grocery shopping or seeing her parents, but most she will get light-headed if she walks for five minutes.\n\nLast year, during the pandemic, her mother was making her have an anxiety attack everyday, making her life miserable. Throwing her things away (including a gift from her late best friend, who committed suicide years ago), insulting her, shouting, and my GF even told me about an incident when her mother called her obese.\n\nAll of this led me to look for an place so we could live together and get her out of her parent's house. This has been at the expense of my own goals. I was studying to get a job that would grant me economical stability for the rest of my life, and I've put that on hold to get a job and pay rent. I've even been on sick leave myself because of migraines I think are associated with stress.\n\nShe refuses therapy or treatment on the basis that \"all therapists ask her the same things\". She found A therapist that she liked last year, and left because €70 an hour was \"too expensive\", a few months after buying a €1100 iPhone, and a few months before spending more than €1000 on an iPad, and I offered to help her pay for it despite barely making it paycheck to paycheck, and her father being loaded. Money isn't the issue, and when she feels that she works well with a therapist, she leaves. I know that's what her illness compels her to do, but I cannot help but feel like she doesn't want to get better, and will actively work against it.\n\nYesterday she said that she wants to have children because that would help her feel better about herself. First, even if I found that believable, which I don't, I think it's horrible to bring a baby into this world as some kind of therapy. Second, she freaks out when her period makes her look a tiny little bit bloated, and I'm genuinely terrified of how she will react to pregnancy.\n\nI'm at my wits end. I know it is not my job to \"fix\" her, but I feel like she just wants me to enable her self-destructive habits and refuses to even make an effort to get better. I would jump in front of a train for her, but I've spent the last year trying to prevent her from jumping in front on a train herself, and I don't think I have it in me anymore. I don't know how to deal with this situation anymore.\n\nTLDR: GF of two years is progressively getting worse, refuses treatment, refuses therapy, tries to manipulate or guilt me into enabling her, and I'm at the end of my rope.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/pbw47y/request_my_gf_is_spiralling_and_im_lost_on_what/",
  "score": 81,
  "num_comments": 9,
  "comments": [
    {
      "id": "haen3mn",
      "author": "shortpoppy",
      "body": "Have you considered getting a therapist for YOURSELF who specialises in eating disorders / eating disorder support to help you?  This is a very scary problem to watch a loved one battle.  I'd say that most of the people here are not qualified to help you but I hope we can give you some support.",
      "created_utc": 1629972416.0,
      "score": 63,
      "context": []
    },
    {
      "id": "haer7b3",
      "author": "None",
      "body": "From the perspective of a mentally ill eating disordered person, she probably truly feels the way she says. If she’s looking for you to celebrate with her, it’s because what she sees in the mirror is most likely not at all what she looks like. She’s proud because she sees flaws that aren’t there, that she’s “fixing”. \n\nFrom the perspective of someone who lost their spouse to suicide, \nShe needs help, and you just can’t let her drag you down too if she won’t help herself. You can’t give 150% to make up for the fact that she’ll only give 50% effort. \nUnfortunately her brain is going to keep struggling as she struggles, and things can just get worse. Have you spoken to her about any sort of treatment programs, inpatient maybe even, so she can get the nutritional and psychiatric care she needs? \n\nBut even then, if she’s not wanting to be better, nothing you do will change that unfortunately",
      "created_utc": 1629975582.0,
      "score": 14,
      "context": []
    },
    {
      "id": "haf176h",
      "author": "Few-You4510",
      "body": "i am very very similar to your gf: i suffer from anorexia nervosa, i restored my weight after hospitalization then started thinking of losing it again, i freak out at any little change on my body and i dont want to recover. but let me tell you something. i am going to therapy, but so do my parents! it could sound crazy, but it’s true. even people who have to support the sufferer need therapy. not the same as the person with the disorder, but they sure can get help and support too. try to get a therapist, there’s nothing better than discussing it with someone.",
      "created_utc": 1629981630.0,
      "score": 6,
      "context": []
    },
    {
      "id": "haf4frd",
      "author": "AdeadKitty7",
      "body": "I came here to give you kudos for reaching out. I agree with the above statement about you getting therapy. She needs support, but so do you. As someone who found myself with a mild eating disorder as a young teen because of the social media I had access to (deadjournal/myspace) I would suggest a break from TikTok and other toxic social media... but as others have said, she has to want to get better. \n\nI wish you all the positive energy in this struggle and I hope you find a solution that works for both of you.",
      "created_utc": 1629983251.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hagaslg",
      "author": "None",
      "body": "Wow u just described what I do with my bf and it’s opened my eyes. She probably wants help but her illness isn’t allowing her too. Anorexia is a very confusing and terrible disorder that I don’t think anyone can understand unless theyve been through it.",
      "created_utc": 1630000643.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hah1klt",
      "author": "Mom_of_furry_stonk",
      "body": "I also suffered from it. My parents were similar. Being in a healthy environment and having food security helped me. My husband (bf at the time) helped me through it. What finally did me in though was going to the doctor to be seen for a bad leg injury. I hurt myself badly taking off a boot. Taking. Off. A. Boot. I didn't understand how it happened. I went to the doctor and a nurse came in and basically said, \" you are dying a very slow, agonizing death. Your body is breaking and starting to shut down. This is the beginning of the end\". It helped me find the courage to work through it. That and my husband motivating me. I felt really uncomfortable and depressed at first when I basically went cold turkey, but that only lasts for a while. I would never go back. It sickens me now when I hear someone call someone else perfect, because perfection is just bloody unrealistic. No one is perfect and it's sad when people seek something out that's unattainable.",
      "created_utc": 1630011439.0,
      "score": 2,
      "context": []
    },
    {
      "id": "haolnxm",
      "author": "OOOOFBABEY",
      "body": "i can't give a lot of advice but i would recommend considering her sick even when she's \"healthy.\" even when you're recovered physically that doesn't mean the illness isn't present. imo even if i recover someday my ed brain will always still be there and will be something i have to work with somehow. she's never \"not sick\" she could just look better or be trying to be better. she can GET better but it'll always be present",
      "created_utc": 1630159331.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hahultw",
      "author": "Responsible_Prior208",
      "body": "Hey there. I was struggling with the same things as your wife. First off I want to say thank you for loving her and sticking by her side and understanding it's just her illness. That leads me to saying that it is just her illness. I have a friend who is struggling now and I understand how I must've been.\n\nIt's to the point I'm having dreams of her choosing excercise over me. Which I don't think she'd really do.sorry on her behalf .\n\nGet rid of tiktok. It makes people sick. It makes everyone with Ed's sick. It promotes anerexia and not eating. \n\nA therapist who also was a Buddhist told me that healthy thoughts create healthy actions.maybe talk to her about the triangle of thoughts actions and feelings.\n Get rid of the scale. Maybe even dish up food for her and tell her that's undereating still\n\nMy brain was fucked. I mean fucked fucked. And it amplified it all. Same thing with my friend \n\nDelete calorie apps. Get her to eat carrots, celery anything super healthy and low calories\n\nShe just needs to eat and feel her brain .\n\nIt helped me when my mum told me how much she missed the things we used to do together. Make her realise that her life is bad and it can be better. That anerexia is the enemy\n\nTake her to nature and the beach. Distract her from the unhealthy thoughts. Tell her you love her over and over.\n\nBecause she's kill herself if you leave to\n\nGood luck. I'll answer any questions",
      "created_utc": 1630024445.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hael4ol",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1629970748.0,
      "score": 1,
      "context": []
    }
  ]
}