{
  "id": "pcvazs",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1630095768.0,
  "title": "Request: Helping my girlfriend stop calorie counting",
  "selftext": " \n\nI am my girlfriends only support network outside of professionals at  the moment, and a lot of her anxiety around food comes from calories. I  was wondering if anyone knew any resources to help me assist her in  overcoming this, or had any tips or tricks.\n\nI really don't want to be a kind of barrier to her eating what she  wants, or being some sort of food moderator for her. I've looked online  and I've really struggled with finding resources on how to support.\n\nMany Thanks in advance",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/pcvazs/request_helping_my_girlfriend_stop_calorie/",
  "score": 34,
  "num_comments": 9,
  "comments": [
    {
      "id": "hamchuy",
      "author": "LittleMissCosmic1992",
      "body": "I wish I had some helpful advice here but I don't other than her seeking professional help, which she is. I would just leave her be and let them help her. She might get snappy and angry at you if you start suggesting not calorie counting. I know I would as I'd be frustrated at you for not understanding I currently need to do it in order to feel safe and ok.",
      "created_utc": 1630107210.0,
      "score": 10,
      "context": []
    },
    {
      "id": "haoljfp",
      "author": "Bop23",
      "body": "Eating disorder dietitian here. It hard to say without knowing where she is at mentally. If she is still in the beginning of her treatment and struggling with the fact that she has an eating disorder at all, I would just talk to her about how calories are really just a measure of energy, and energy is a good thing. Having energy makes your body feel good so you can enjoy your life! Also talk to her about how it’s not just calories in and calories out. Our bodies are doing things all day that require energy beyond exercise. We need energy to think, to move, to play, to exist. Our blood is pumping all day-this requires energy too! We don’t want that to stop happening! And in reality, there is no formula that can predict exactly how many calories your body needs. Everyone is different. Everyone’s metabolism is different. So she is likely putting in a lot of effort into counting something that isn’t even accurate, and causing herself significant anxiety for no verifiable reason. I could go on forever lol so I’m just going to end this comment with 2 resource recommendations. (Again I don’t know where she is at mentally, but these are often helpful). Podcast - food psych by Christy Harrison. Book- life without ED by Jenni Schaefer",
      "created_utc": 1630159271.0,
      "score": 7,
      "context": []
    },
    {
      "id": "haolecx",
      "author": "OOOOFBABEY",
      "body": "this may sound silly but maybe try to always eat with her when she's hungry? even if it's just a little snack? it may help her to focus on the fact that you're spending time together and nourishing your bodies, instead of the calories she's consuming?? i'm not rly sure how to help bc i'm in this almost exact situation but as the ed girlfriend. i'm sure she worries about burdening you, but also worries you'll police her food if she talks and cause that to create weight gain. how long have you two been together? it might be harder if this is a fresh relationship because she'll be particularly focused on how you perceive her",
      "created_utc": 1630159204.0,
      "score": 2,
      "context": []
    },
    {
      "id": "halvwig",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1630099555.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hambpp5",
      "author": "canadianworm",
      "body": "Look into learning about intuitive eating. And if she checks calories you could try taping over that information, so she just can’t know.",
      "created_utc": 1630106830.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hamol2h",
      "author": "None",
      "body": "One thing that helps me is making food with other people or eating at a local restaurant that doesn’t show calories on the menu. It’s a lot easier to forget about calories when I’m eating with loved ones. Another thing that has helped is giving myself one day a week to eat something that I wouldn’t normally eat on top of what I normally eat. So last summer, every Thursday I would eat some ice cream and just seeing that the only difference was that I enjoyed it and not that it was affecting my weight (it was kinda making up for me not eating enough throughout the rest of the week) really really helped my mental health and helped me to start eating more and even start gaining weight eventually.",
      "created_utc": 1630113183.0,
      "score": 0,
      "context": []
    },
    {
      "id": "haln2ms",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1630095768.0,
      "score": 1,
      "context": []
    },
    {
      "id": "ham9tr8",
      "author": "LittleMissCosmic1992",
      "body": "I get you mean well, but I don't think this is the best advice.",
      "created_utc": 1630105929.0,
      "score": 12,
      "context": [
        {
          "id": "halvwig",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1630099555.0
        }
      ]
    },
    {
      "id": "hambcp3",
      "author": "WhovianGirl777",
      "body": "I agree with this. I did this for a month and it helped me so binge eating. \n\nDiet culture has taught us that certain foods are bad and letting yourself eat what you like while mentally working through the diet culture bs can be very helpful. \n\nAnyone that says this wouldn't help has never tried this technique.",
      "created_utc": 1630106659.0,
      "score": 3,
      "context": [
        {
          "id": "halvwig",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1630099555.0
        }
      ]
    },
    {
      "id": "hamcywk",
      "author": "None",
      "body": "[deleted]",
      "created_utc": 1630107437.0,
      "score": 2,
      "context": [
        {
          "id": "halvwig",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1630099555.0
        },
        {
          "id": "hambcp3",
          "author": "WhovianGirl777",
          "body": "I agree with this. I did this for a month and it helped me so binge eating. \n\nDiet culture has taught us that certain foods are bad and letting yourself eat what you like while mentally working through the diet culture bs can be very helpful. \n\nAnyone that says this wouldn't help has never tried this technique.",
          "created_utc": 1630106659.0
        }
      ]
    },
    {
      "id": "hamd2rj",
      "author": "WhovianGirl777",
      "body": "Exactly!! Spot on!",
      "created_utc": 1630107490.0,
      "score": 2,
      "context": [
        {
          "id": "halvwig",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1630099555.0
        },
        {
          "id": "hambcp3",
          "author": "WhovianGirl777",
          "body": "I agree with this. I did this for a month and it helped me so binge eating. \n\nDiet culture has taught us that certain foods are bad and letting yourself eat what you like while mentally working through the diet culture bs can be very helpful. \n\nAnyone that says this wouldn't help has never tried this technique.",
          "created_utc": 1630106659.0
        },
        {
          "id": "hamcywk",
          "author": "None",
          "body": "[deleted]",
          "created_utc": 1630107437.0
        }
      ]
    }
  ]
}