{
  "id": "pif616",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1630855848.0,
  "title": "Request: Drinking laxative tea has messed up my stomach, and now I’m afraid to eat.",
  "selftext": " \n\nTW: Laxative abuse.\n\nI’m a 37-year-old woman who has been “recovered” from bulimia for about 20 years. I say “recovered” because while I’ve stopped the daily purging, I still occasionally fall back on ED behaviors. I’m fully aware of this and won’t lie to myself.\n\nAbout 2 weeks ago, I was constipated. Stimulant laxatives are a MAJOR no-no for me. Even with my sporadic disordered eating, I will not touch them.\n\nI stupidly convinced myself that a diet tea was a better alternative. “It’s made from plant extracts,” I told myself. How bad could it be?\n\nReally bad. Really really bad. I drank too much - like I fucking should have known I would - and now my digestive system is wrecked.\n\nIt’s been a week since I last had the tea and my stomach is still hyper sensitive. Eating anything other than binding foods sends me running to the bathroom within an hour of my meal. I can’t eat while I’m working. I can’t eat before bed.\n\nI’m worried that this is going to send me back into the cycle of restrictive eating. I feel so fucking stupid.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/pif616/request_drinking_laxative_tea_has_messed_up_my/",
  "score": 60,
  "num_comments": 6,
  "comments": [
    {
      "id": "hbpbley",
      "author": "in_the_sheyd",
      "body": "Something that has helped me in similar situations has been the drug loperamide. It’s an over the counter medication sold under the brand name Imodium among others. It’s an extremely potent anti-diarrheal.",
      "created_utc": 1630859592.0,
      "score": 27,
      "context": []
    },
    {
      "id": "hbqiwik",
      "author": "Bakedalaska1",
      "body": "Seconding loperamide. In the future for constipation I'd recommend miralax, it is not stimulating or habit forming in anyway, mild and safe for daily use if needed.",
      "created_utc": 1630879022.0,
      "score": 13,
      "context": []
    },
    {
      "id": "hbp33x0",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1630855848.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hbqflhr",
      "author": "None",
      "body": "[removed]",
      "created_utc": 1630877476.0,
      "score": 8,
      "context": [
        {
          "id": "hbpbley",
          "author": "in_the_sheyd",
          "body": "Something that has helped me in similar situations has been the drug loperamide. It’s an over the counter medication sold under the brand name Imodium among others. It’s an extremely potent anti-diarrheal.",
          "created_utc": 1630859592.0
        }
      ]
    },
    {
      "id": "hbpoy27",
      "author": "None",
      "body": "I give this to my puppies when they've eaten something bad. Definitely worth trying.",
      "created_utc": 1630865485.0,
      "score": 4,
      "context": [
        {
          "id": "hbpbley",
          "author": "in_the_sheyd",
          "body": "Something that has helped me in similar situations has been the drug loperamide. It’s an over the counter medication sold under the brand name Imodium among others. It’s an extremely potent anti-diarrheal.",
          "created_utc": 1630859592.0
        }
      ]
    }
  ]
}