{
  "id": "plsnh2",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1631304575.0,
  "title": "Request: Triggered by other people’s addictions",
  "selftext": " \n\nHi, I’ve been struggling with an eating disorder for the past twenty  years (yikes), but I have felt I’ve had a pretty good grip on my  recovery.\n\nI’ve noticed one thing in particular that triggers me that I can’t  find info about is whenever I find out about someone who has experienced  addiction, I immediately want to open up to them but don’t, and instead  go into a tailspin of ideas and old habits.\n\nDoes this happen to anyone else? Does opening up to them help? I’m  wondering if this is a better approach for me. So many people don’t see  the connection between an eating disorder and, say, alcoholism, and I  would love not to get triggered by someone’s recovery journey even if  it’s not an eating disorder.\n\nThank you, sending love to you all!",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/plsnh2/request_triggered_by_other_peoples_addictions/",
  "score": 45,
  "num_comments": 2,
  "comments": [
    {
      "id": "hccufef",
      "author": "TravelbugRunner",
      "body": "I have a certain kinship with addicts. Because we tend to come from similar backgrounds and trauma so I feel somewhat comfortable talking to them. \n\nMy dad was an alcoholic and I also know I’ve inherited a propensity for addiction as well. I’m addicted to my Eating Disorders and cigarettes and if it wasn’t for my fear of the calories in alcohol I’d probably be an alcoholic, too. \nWeird to say Anorexia helps me from possibly becoming an alcoholic. \n\nI don’t really feel too triggered by other people’s addictions. It always reminds me that I could easily go that way if I’m not careful. \n\nSo they help me feel like I can relate and they also help me keep my footing with my own issues.",
      "created_utc": 1631306110.0,
      "score": 16,
      "context": []
    },
    {
      "id": "hccqtx0",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1631304575.0,
      "score": 1,
      "context": []
    }
  ]
}