{
  "id": "pondu1",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1631701452.0,
  "title": "Request: i think i'm getting to the point of an ED",
  "selftext": " \n\nhi, so i'm 13 f and i think i'm getting to the point of an ED. i don't have a gag reflex so I can't puke. trust me i've tried to force myself. i eat a lot of snacks and stuff in between meals. I'm not really overweight but I have stretch marks and weigh a decently healthy weight, I'm 5\"7. i hate the way I look and have multiple breakdowns over my stomach fat. when I try to starve myself I cave and the will pig out of junk food and just food in general. then I feel worse. I'll have swings of confidence and self-hatred and my self-hatred usually ending with SH or pigging out. what should I do to stop or is this even an eating disorder? i really don't know and don't want to ask my parents because my mom is the reason I try to puke/starve.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/pondu1/request_i_think_im_getting_to_the_point_of_an_ed/",
  "score": 44,
  "num_comments": 7,
  "comments": [
    {
      "id": "hcxmr1a",
      "author": "t13rn4",
      "body": "this behaviour could easily turn into an ed please be careful! eds are horrible",
      "created_utc": 1631701586.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hcyq2fz",
      "author": "Spacemilk",
      "body": "This is definitely an ED already and it sounds so scary for you. I am really sorry you’ve gotten to this point so young, and I feel you about the mom issue (it’s how I got my first ED around 15-16).\n\nFirst of all, professional help is the best way to get completely away from this. Is there an adult in your life who you can trust who can help you find someone to talk to?\n\nSecondly, a couple things to dispel: stretch marks happen to most everyone and will happen as you grow, which you are naturally doing now. They aren’t an indication of fat or excessive weight gain. I have stretch marks on my thighs because I have a juicy butt I love very much. Stretch marks are determined by genetics and are as much a part of a woman’s beautiful body as anything else. Some people call them “tiger stripes” which I like a lot. Although I didn’t always think this way, I think they are beautiful and I know a lot of people agree with me.\n\nFood exists primarily to fuel you. Try to change the language you use around eating, and why you eat. You eat because your body is growing and you are doing amazing things in the world today and you need energy to do those things. Our bodies are basically electrified meat bags that move and think and that’s incredible! You are incredible! And while food is needed as fuel, it is OK to ENJOY eating, and to take pleasure in fuel/food that both tastes good and nourishes and powers your amazing body. There is no reason to be ashamed of eating to fuel your body, and there is no reason not to enjoy a basic process that we must do.",
      "created_utc": 1631721674.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hcxml4f",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1631701452.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hd0iyic",
      "author": "cmdillard",
      "body": "this sounds like a binge and restrict cycle, the best thing to do to stop binges (pigging out) is to not restrict yourself. it’s hard sometimes but eating enough food will keep you from uncontrollable eating and will be better for you in the long term. if you want to lose weight in a healthy way you should talk to a dietician and figure out a healthy plan. you should do research on weight loss and if you’d rather do it without the advice of a dietician, look into a healthy calorie deficit! there are calculators online to find a plan that’s healthy, safe, and effective. patience is key",
      "created_utc": 1631748799.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hd0v3er",
      "author": "24hr_pharmacy",
      "body": "we have an incredible amount in common. i can relate too much to this post. i'm sorry though. my dm's are always open if you want to talk, i'm sure i'll understand.",
      "created_utc": 1631754546.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdubmkf",
      "author": "BootyBandit_420",
      "body": "Thank you for writing this, i do not personally have an ED but my gf does, and I have been looking for a good way to describe basically this to her; this is perfectly said.",
      "created_utc": 1632317451.0,
      "score": 2,
      "context": [
        {
          "id": "hcyq2fz",
          "author": "Spacemilk",
          "body": "This is definitely an ED already and it sounds so scary for you. I am really sorry you’ve gotten to this point so young, and I feel you about the mom issue (it’s how I got my first ED around 15-16).\n\nFirst of all, professional help is the best way to get completely away from this. Is there an adult in your life who you can trust who can help you find someone to talk to?\n\nSecondly, a couple things to dispel: stretch marks happen to most everyone and will happen as you grow, which you are naturally doing now. They aren’t an indication of fat or excessive weight gain. I have stretch marks on my thighs because I have a juicy butt I love very much. Stretch marks are determined by genetics and are as much a part of a woman’s beautiful body as anything else. Some people call them “tiger stripes” which I like a lot. Although I didn’t always think this way, I think they are beautiful and I know a lot of people agree with me.\n\nFood exists primarily to fuel you. Try to change the language you use around eating, and why you eat. You eat because your body is growing and you are doing amazing things in the world today and you need energy to do those things. Our bodies are basically electrified meat bags that move and think and that’s incredible! You are incredible! And while food is needed as fuel, it is OK to ENJOY eating, and to take pleasure in fuel/food that both tastes good and nourishes and powers your amazing body. There is no reason to be ashamed of eating to fuel your body, and there is no reason not to enjoy a basic process that we must do.",
          "created_utc": 1631721674.0
        }
      ]
    }
  ]
}