{
  "id": "pr5786",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1632045868.0,
  "title": "Request: Even when I'm 'better' I'm never actually better",
  "selftext": "My eating disorder seems to go in a huge cycle. When I'm in the phase where I'm eating the right amount and looking healthy, I still don't feel 'better'. My eating disorder is still there. It's still telling me that my arms are too flabby, my face is too fat and puffy, I'm eating too much and should be ashamed.\n\n&#x200B;\n\nIn this phase I'm not eating because my ED is better. I'm eating because my body has been starving for so long that it just can't take it anymore, and it becomes stronger than my thoughts to restrict.\n\n&#x200B;\n\nI'm too scared to tell my dietitian that I'm eating more now and have stopped losing weight, sometimes even gaining it, because I fear the invalidation of her thinking my ED is better.\n\n&#x200B;\n\nAnyone else the same?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/pr5786/request_even_when_im_better_im_never_actually/",
  "score": 90,
  "num_comments": 7,
  "comments": [
    {
      "id": "hdgiukz",
      "author": "illestheartbreaker",
      "body": "This is exactly what I’m going through and I feel you entirely 100%. I’m terrified to visit my psych again because I’m afraid she will start assuming that I’m ‘better’ since I’m not underweight anymore. \nThe only time I was taken super seriously was when I was emaciated and my BMI was alarmingly low. This was during my relapse period. \nThe truth is ED is more than just eating, it’s the thoughts and the cycle of behaviour.\nLay people unfortunately do not grasp this. \nThey associate anorexia as someone who’s superbly and unhealthily thin, but I’ve only been like this at two stages of my life.\nIt’s so stupid because it’s like someone thinking oh this person doesn’t have cancer cause she/he/they aren’t losing hair. \nThis ideology honestly harms my mental health more than anything",
      "created_utc": 1632056888.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hdit2it",
      "author": "EmergencyMango6263",
      "body": "You summed up my experience so perfectly. No one would understand if I told them that it still consumes 9/10 of my thoughts. I am not free and never will be.",
      "created_utc": 1632091526.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hdg2l1l",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1632045868.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdjx25g",
      "author": "katiekat1989",
      "body": "From my experience, it's better to share how you're feeling. For so long I thought my thoughts were invalid, until I shared with people and realized that what I'm going through is real and that I need help. Sometimes we can't do it alone and you shouldn't.",
      "created_utc": 1632111054.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdjgar8",
      "author": "Toofyyy",
      "body": "I tried telling my family about my thoughts and they still don't understand. it's so frustrating, but it's good to know that I'm not alone.",
      "created_utc": 1632102468.0,
      "score": 1,
      "context": [
        {
          "id": "hdit2it",
          "author": "EmergencyMango6263",
          "body": "You summed up my experience so perfectly. No one would understand if I told them that it still consumes 9/10 of my thoughts. I am not free and never will be.",
          "created_utc": 1632091526.0
        }
      ]
    },
    {
      "id": "hdkcdwp",
      "author": "None",
      "body": "You're absolutely not alone. SO many of us have these kinds of patterns and habits.",
      "created_utc": 1632121968.0,
      "score": 2,
      "context": [
        {
          "id": "hdit2it",
          "author": "EmergencyMango6263",
          "body": "You summed up my experience so perfectly. No one would understand if I told them that it still consumes 9/10 of my thoughts. I am not free and never will be.",
          "created_utc": 1632091526.0
        },
        {
          "id": "hdjgar8",
          "author": "Toofyyy",
          "body": "I tried telling my family about my thoughts and they still don't understand. it's so frustrating, but it's good to know that I'm not alone.",
          "created_utc": 1632102468.0
        }
      ]
    }
  ]
}