{
  "id": "prrrsx",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1632132420.0,
  "title": "Request: Mother stares at my body",
  "selftext": " \n\nHi,\n\n My mother has struggled with disorder eating for as long as I can remember. As for myself, I have been struggling with maintaining a healthy weight due to anxiety and OCD for the past 2 years.\n\nI have been noticing she stares at my body when I talk to her lately. It makes me very uncomfortable. To the point that I deliberately cover up in really baggy clothes if I’m going to be interacting with her. I’ve brought it up with her, but she denies she does it. However, the last time I said something along the lines of “please stop looking at my body” she said that I had a “beautiful body”.\n\nFor parents who struggle with disordered eating, is this something that’s normal?\n\nI’m trying to be supportive during her recovery and be there for her, but it really makes me uncomfortable and makes me not want to see her in person. If it’s normal, I’ll be happy to accept the emotional burden and learn to cope. I just want the best for her.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/prrrsx/request_mother_stares_at_my_body/",
  "score": 41,
  "num_comments": 8,
  "comments": [
    {
      "id": "hdksmb1",
      "author": "WhovianGirl777",
      "body": "You are right in having your feelings about this.\n\nEveryone's feeling are valid and she denied that your feelings were valid. \n\nReiterate how you feel and don't allow her to brush your feelings aside. Openly communicate and let her know that it makes you not want to visit her and that if she doesn't leave to correct it then you will have to hold your boundaries and visit less often.",
      "created_utc": 1632136221.0,
      "score": 19,
      "context": []
    },
    {
      "id": "hdlhlic",
      "author": "StockReporter5",
      "body": "That would make me uncomfortable too :/ I don’t really have any advice but I hear u. My mom is similar",
      "created_utc": 1632149349.0,
      "score": 11,
      "context": []
    },
    {
      "id": "hdlwb5h",
      "author": "fourcornersbones",
      "body": "Continue to let her know when you are uncomfortable. It’s not good for your mental health or hers to have her gawking at you like that. Is she seeing a therapist? This is something that should be brought up. Your mother’s actions are damaging your relationship and mental health. \n\nMen who stare at women’s breasts are rightfully called out for objectifying women. Your mother is also objectifying you and needs to be called out, albeit with a different motivation.",
      "created_utc": 1632155431.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hdm8myj",
      "author": "DesertBlossom_1",
      "body": "I also struggle with this, whenever I see my mother after a long extended break (usually around the holidays we come visit) she will always remark on my body. I typically have to remind myself that it will happen when I see her but I shouldn’t have to change the way I look to be comfortable around her. She will typically squeeze my stomach or arms and tell me how “skinny” I look, when I actually eating very healthy and sticking to recovery. I’m at a healthy weight, and not “dieting”. It makes me physically cringe but I typically tell her “please don’t touch me like that, I don’t like it” and she will stop. It usually stuns her a bit but she stops lol. Unfortunately my mom also struggles with her weight and had an ED so I think there is a bit of jealousy for them with our youth. I’ve really talked about this in length with my therapist and learned ways to cope or take it less offensively and def recommend speaking to a therapist about it to come up with ways to set boundaries with your mom.",
      "created_utc": 1632160434.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hdknqaz",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1632132420.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdmkh22",
      "author": "bathtubsarentreal",
      "body": "I also have OCD, general anxiety, and disordered eating! Currently my therapist and I are discussing setting boundaries a lot and I would recommend doing this. Tell your mother her staring is making you want to spend less time with her because how uncomfortable it makes you, and hopefully she'll understand. If she doesn't understand, stand by your boundary and repeat yourself. If she continues to stare, maybe it's time to keep conversations phone-only until she is able to restrain herself. You deserve to have and hold boundaries! I'm sorry you are going through this",
      "created_utc": 1632165309.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdyjklf",
      "author": "theantimama",
      "body": "It would bother me, but I would have a hard time settling on it being real if I also had issues.  I don’t think I would trust my own judgment in that situation.",
      "created_utc": 1632402212.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hee0n2w",
      "author": "None",
      "body": "When I was growing up my mom also struggled with an eating disorder. She did most my life, she would pick at her food, obsess over her body, weight, exercise etc... When I started going through puberty she would also stare at my body, she also as a kid would watch me eat, almost like she was vicariously eating through me since she didn't allow herself too. At 13 I developed anorexia and have struggled with an eating disorder off and on since then. \n\nSeconding, it's not your job to take care of your mom. She needs to get help on her own, she is your mother, you are the daughter. Not the other way around. This is probably a lot of where some of your anxiety comes from if she expects you on some level to take care of her. You have to take care of yourself first. It doesn't mean you can't care about her, but don't let her issues swallow and drown you. I say this from first hand experience. My mom used to put all her stuff onto me, all her feelings, her pain, her self hatred. I was a kid and didn't know how to deal with that. I myself, needed nurture and love too. I assume you do as well. I put all my energy into taking care of my mom that I felt emotionally exhausted all the time. I was obsessive, anxious, felt tremendous guilt and responsibility for her well being.\n\nDo you have your own support system? Therapist, friends etc... Not saying you don't do this, but take care of yourself and do what you love, pursue your passions and dreams as well.",
      "created_utc": 1632687343.0,
      "score": 1,
      "context": []
    }
  ]
}