{
  "id": "pt3otf",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1632302228.0,
  "title": "Request: Is it possible to request not to see or hear my weight in medical situations?",
  "selftext": "I'm currently in recovery for bulimia. I have a disability that I stopped receiving help for because the knowledge of how this will affect me is more dangerous to my well being than not seeing a doctor is. I'm getting to a point where I've been putting off surgery for a few years and I'd like to get help for that. If I explain the situation and request not to know the number do you think they'd go for it? ",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/pt3otf/request_is_it_possible_to_request_not_to_see_or/",
  "score": 71,
  "num_comments": 18,
  "comments": [
    {
      "id": "hdtps66",
      "author": "hlarrais",
      "body": "i don’t see why they wouldn’t agree to keep that information from you, especially if you explain why it’s so important",
      "created_utc": 1632303012.0,
      "score": 17,
      "context": []
    },
    {
      "id": "hdts6l8",
      "author": "tryingtorecover54",
      "body": "Yes, my PCP office makes me turn around and they black out the weight and BMI on my end of visit papers and my therapist has the screen in an area that only him or his staff can see. Many times if an ED is noted in your chart they will ask if you want to see.",
      "created_utc": 1632305223.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hdttox2",
      "author": "HJEANS",
      "body": "Yes! Just request this when you go in! You can let the nurse and doctor know and then remind them again when you go to see the weight! If they give you any paperwork ask them if it has your weight on it before you take it and if it does ask that they block it out for you! This may feel awkward but it is super common for many people especially those in recovery! Good for you for keeping your recovery in mind!!!",
      "created_utc": 1632306519.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hdtycw0",
      "author": "FrustratedPenguins",
      "body": "Yes, you can absolutely do this. I have simply told doctors that I am in treatment for eating disorder and I’m being weighed regularly by my dietitian and prefer not to be weighed at their clinic. They are very understanding and just bypass weighing me completely. When they do insisted that I need to be weighed, I have them weigh me backward and not tell me the number. Some doctors implicitly understand this and do it with ease; however, sometimes you have to tell them precisely what to do. For the most part, the reaction I have had has been very understanding and positive.",
      "created_utc": 1632310028.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hdu4fcv",
      "author": "Boosey0910",
      "body": "I got rid of my scale years ago and whenever I go to my doctor I request to NOT be weighed. They know I have a history of an ED so it's never been a problem.  Even if they didn't you still can request not to be weighed.  If they have to weigh me (this never has happened) I turn the other way.  Getting rid of the scale for me was hard but one of the best things I did.",
      "created_utc": 1632313747.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hdu7gg1",
      "author": "Thin-Tennis-365",
      "body": "Haha I just look at them and say no. They don’t ask anymore",
      "created_utc": 1632315371.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hdud12g",
      "author": "in_the_sheyd",
      "body": "Unless you have a specific medical reason to have your weight measured it might be a better idea to just decline to be weighed. You can request to have your weight concealed but the way medical software is it requires people to actively do things to keep you from seeing that information and sometimes they forget to do it.\n\n… or they comment on your numbers.\n\nPoint is, you are allowed to decline medical examinations, tests, and treatments for any reason or without any reason. Nobody can force you to step on a scale.",
      "created_utc": 1632318116.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hdup4lk",
      "author": "vociferousgirl",
      "body": "Yes! Not only can you ask for a blind weight, you can also ask for it to be kept off the print out you get, and, in most systems, they can hide it from your view online. \n\nI would be open with your doctor about why you don't want to know, your history with it, and, if your doc really insists, have a conversation as to why they think it's important.",
      "created_utc": 1632323358.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hdury7z",
      "author": "wrknprogress2020",
      "body": "I finally asked this recently. There was some push back, because all I said was that I didn’t want to weigh myself. But once I nervously explained that knowing may trigger my disorder they quickly moved on. \n\nYou are definitely able to decline having weight taken and also decline to see the numbers on scale(turn backwards) and decline having them say out loud. \n\nAlso, I work in healthcare. A note is added to your patient profile(provider view) that will have that as a note above your picture. So I’m the future, they won’t ask/show/tell the weight.",
      "created_utc": 1632324520.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hdury8d",
      "author": "None",
      "body": "Yes or you don’t even have to be weighed if you just tell them you’d rather not. That’s what I do at all my medical appts",
      "created_utc": 1632324520.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hdv4juf",
      "author": "BedroomImpossible124",
      "body": "Yes, I always tell the medical assistant not to tell me my weight. Also, you can decline to be weighed.",
      "created_utc": 1632329633.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hdtoyff",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1632302228.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdujey2",
      "author": "None",
      "body": "Is it cosmetic surgery (eg breast augmentation, liposuction)? If so, and your doctor is ethical, he or she may advise against it before getting the proper help you need to treat your ED/body dysmorphia. If you can’t acknowledge the number on the scale, elective cosmetic surgery might not be the best option for you right now. Could actually make things worse. I say this without judgement as I’m in the same boat as you, kinda. I’m in recovery but I still suffer from the after effects. It’s a lifelong thing, we just have to learn how to manage. If it’s not cosmetic surgery, then ignore me!",
      "created_utc": 1632320979.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdve4sp",
      "author": "None",
      "body": "100% agree with everything above!! Usually it’s a nurse/medical assistant taking weight. I always decline to be weighed. If they have something to say about it, I either tell them that it’s not medically necessary, that I have an eating disorder, or request to speak with the doctor about it privately (where I explain my eating disorder/triggers). They almost always end up not weighing you. If the doctor thinks my weight is important I either tell them to call my nutritionist (who weighs me) or I do a blind weight and request it to be off all paperwork I receive. I’ve had my share of bad experiences with doctors/medical staff about this and it sucks. You are not alone. You got this. ❤️",
      "created_utc": 1632333511.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdvi1yz",
      "author": "None",
      "body": "Yes! My general practitioners nurses have never once ever remembered to do blind weight inspite of requesting every single time\n\nSo yea can request just be prepared that 99% of nurses don’t care lol",
      "created_utc": 1632335095.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdvmgn7",
      "author": "rayballine",
      "body": "When I step on the scale I close my eyes and that don’t bother to tell me.",
      "created_utc": 1632336878.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hdwmg1s",
      "author": "dykenzie",
      "body": "yes!! my pcp knows i have an ed and automatically had me on blind weights since i first started seeing her, i just look away from the numbers, u can totally ask them to not tell you ur weight!! :)",
      "created_utc": 1632356881.0,
      "score": 1,
      "context": []
    },
    {
      "id": "he3n6vh",
      "author": "None",
      "body": "Absolutely. I always say \"Please write refused\" at normal doctor's appointments. I have a chronic illness, so I inevitably end up getting IVs at least 1-12ish times per year. That's the one time I allow them to weigh me. I always request not to see or be told the number and tell them that I do NOT want it recorded on any papers or online messages I receive. \n\nBefore I get any discharge papers, etc, I double-check with them and ask if my weight is on it. If it is, I say \"cross it out please\" before it gets into my hands.",
      "created_utc": 1632496847.0,
      "score": 1,
      "context": []
    }
  ]
}