{
  "id": "pwqa1l",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1632775851.0,
  "title": "Request: Im a recovering bulimic, but the thought of working out is triggering for me. Any tips?",
  "selftext": " \n\nHi! im a recovering bulimic w/ 4 years under my belt now but i can’t seem to start working out. My dad would make fun of me whenever i tried to lose weight n that’s one of the big reasons i resorted to bulimia.\n\nIm wondering if anyone has some practices around exercise that they use to remove the importance off of body image and more to do with wellbeing and contentment with self? Any exercise youtubers you watch that offer that kind of support in their vids? any overall tips/experiences?",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/pwqa1l/request_im_a_recovering_bulimic_but_the_thought/",
  "score": 44,
  "num_comments": 12,
  "comments": [
    {
      "id": "hej55zv",
      "author": "FoxiiFighter",
      "body": "This would be a situation where I would look into active hobbies, as opposed to working out. \n\nThere are still several activities, like, kayaking, bird watching, hiking, bike riding, heck, even rock climbing, dancing, Jiu Jitsu or other type of fighting skill, etc, that people don't immediately associate with weightloss (like they would going to the gym or cardio). One of those might be good to start with.",
      "created_utc": 1632786127.0,
      "score": 27,
      "context": []
    },
    {
      "id": "hejo5kf",
      "author": "graciously13",
      "body": "First of all, your dad sounds like an ass. Secondly, I agree with the idea of finding joyful movement. I know one of the go to for recovery and exercise re-entry is yoga and walking. Maybe that's your thing? I personally found weight lifting to be empowering, rather than focusing on the aesthetic of exercise I focus on how it makes me feel. I love feeling strong, and would never choose to go back to my previously weak and underfed form. I found Sydney Cummings on YouTube about a year ago, and I think she's been a liberating influence for me.",
      "created_utc": 1632794937.0,
      "score": 8,
      "context": []
    },
    {
      "id": "helayrb",
      "author": "CraftsAndSass",
      "body": "I find going on walks is more relaxing and focused on enjoying nature than workouts. I know yoga is cliche for its focus on wellbeing, but it's cliche for a reason. I like Yoga with Adrienne, Yoga with Kassandra, and Allie the Journey Junkie.\n\nDancing like others mentioned is another good one. If you want the social aspect of a workout community, ballroom dancing is great. Unlike other dance studios, ballroom is not about perfection or weight loss. It's about learning something new, meeting new people, and having fun!",
      "created_utc": 1632834871.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hem3tsy",
      "author": "throwaway-m1",
      "body": "First off, you don’t *have* to workout, no matter what anyone else says. If you want to for the right reasons, awesome! \n\nWhat part of exercise is triggering for you? Is it the environment at gyms, the things youtube instructors say, the act of pushing yourself, etc.? \n\nFor me I started off with doing yoga and walking, and then I moved onto strength training using dumbbells, and then I found a gym that’s typically really empty and started using the cable machines there. I avoid any fitness content (whether that be subreddits, social media accounts, or workout videos) with any sort of diet culture bullshit like the plague. I actually like to listen to anti-diet culture podcasts while I’m working out (my favorite one is called Maintenance Phase)",
      "created_utc": 1632847273.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hexylkp",
      "author": "a-redtailedhawk",
      "body": "Also Gaga People dance (not Lady Gaga) is a movement language developed by an israeli choreographer that’s designed to be all about finding joy and pleasure in the unique ways your body moves and expresses itself. I found it really helpful to break out of the “perform and entertain to please” mindset that I grew up with in elite sport. It’s available to do online in 20-40 min classes.",
      "created_utc": 1633065708.0,
      "score": 2,
      "context": []
    },
    {
      "id": "heijkrg",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1632775852.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hekmpar",
      "author": "captainfatc0ck",
      "body": "My re-introduction to working out was turning on music in the morning and dancing around while doing my routine. Fun, low pressure, relieves stress, and best of all, doesn’t really feel like a “workout.”",
      "created_utc": 1632817569.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hemgqml",
      "author": "smol_lydia",
      "body": "For me, I can’t go to a gym or do those kind of traditional work outs. A big part of my recovery was picking up a hobby that involved joyful movement. \n\nFor me personally that was burlesque because my teacher is very adamant that “every body is a burlesque body” and affirmed everyone no matter where they were at with their body image. It was also a good exercise in getting to know and listen to my body. \n\nIt doesn’t have to be dance of course and I know that type of dance isn’t for everyone. But definitely something that helps you connect with your body in a non appearance based way. Some people prefer yoga for that but you may want to look for body neutral or body positive classes or on YouTube. \n\nAlso I agree with the comments that your dad is an ass.",
      "created_utc": 1632852583.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hevx49s",
      "author": "SeargentAngel",
      "body": "As someone who has been addictive to exercise in the past, I was always miserable while doing it. In recovery I wanted something that would allow me to let of anger & just have fun. I started doing ‘ les mills body combat boxercise’ there on youtube. I really got into it & found myself genuinely smiling & being able to come away saying ‘ that was beneficial for my body & for my mental health’. I was then able to pause it when I felt tired because I lost that sense of ‘ this is a punishment’",
      "created_utc": 1633029513.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hexy81n",
      "author": "a-redtailedhawk",
      "body": "Helen Phelan runs a really great body neutral space. She was a former dancer who struggled with an ED and has really mindfully designed her workouts to be embodied, intuitive, and free from the language of diet culture. It’s primarily Pilates.",
      "created_utc": 1633065447.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hf4ejv4",
      "author": "None",
      "body": "You should work out when u feel absolutely comfortable. If it’s gonna set u back, don’t even attempt. Now, if you rlly wanna move ur body, do some light exercise, like a walk or smt.",
      "created_utc": 1633196622.0,
      "score": 1,
      "context": []
    },
    {
      "id": "helgi06",
      "author": "neverlandends",
      "body": "second this! my personal favourites are hula hooping and roller skating",
      "created_utc": 1632837447.0,
      "score": 2,
      "context": [
        {
          "id": "hej55zv",
          "author": "FoxiiFighter",
          "body": "This would be a situation where I would look into active hobbies, as opposed to working out. \n\nThere are still several activities, like, kayaking, bird watching, hiking, bike riding, heck, even rock climbing, dancing, Jiu Jitsu or other type of fighting skill, etc, that people don't immediately associate with weightloss (like they would going to the gym or cardio). One of those might be good to start with.",
          "created_utc": 1632786127.0
        }
      ]
    }
  ]
}