{
  "id": "pzsb5f",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1633168651.0,
  "title": "Request: How do you stop from binging?",
  "selftext": "I'm a comfort eater and when I'm stressed I'll eat non stop which obviously is extremely unhealthy. This will last for a week or so then I'll be good till my next successful event. I keep telling myself \"tomorrow I wont binge eat\" it really fucking sucks.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/pzsb5f/request_how_do_you_stop_from_binging/",
  "score": 39,
  "num_comments": 15,
  "comments": [
    {
      "id": "hf2xama",
      "author": "Unvoltzz",
      "body": "for me, having a cup of tea or another hot drink that I can sip helped because it slowed me down and let me relax. green tea apparently helps stump cravings too",
      "created_utc": 1633168892.0,
      "score": 26,
      "context": []
    },
    {
      "id": "hf3ibay",
      "author": "wilcontantlylevetypo",
      "body": "Try not to have any triggering foods around, at least while you start your recovery. For me it's breads and pastas. Any time I have them in the house I always say I'll just have a bit, but it turns into a binge almost every time. Especially when there emotional eating triggers going on.",
      "created_utc": 1633182238.0,
      "score": 12,
      "context": []
    },
    {
      "id": "hf3lbwd",
      "author": "mysphit",
      "body": "If you have a headache, you reach for a pill. If you are thirsty, you want a drink. If there is a hunger, you reach for food.\n\nThe hunger isn't always physical.\n\nFill the void with something other than food. 💜",
      "created_utc": 1633183718.0,
      "score": 9,
      "context": []
    },
    {
      "id": "hf3j6oq",
      "author": "vandragon7",
      "body": "I brush my teeth very carefully and thoroughly. Usually the freshness in my mouth makes me stop wanting to eat or drink anything at least for a while.\nIf I’m still feeling hungry, I try to drink something first (sometimes thirst and hunger becomes the same thing for me - binge!).\n\nThen I try set a timer or watch TV or just mentally shout ‘NO!’ Every time I go near food! \n\nGo for a walk, get out and away from binge materials (and don’t take any money so you can’t buy any binge foods).\nGood luck!",
      "created_utc": 1633182668.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hf4cjte",
      "author": "Fragrant-Head9779",
      "body": "When you say 'I'll be good', do you mean healthy or in some way restrictive? Restriction leads to binging generally. \n\nIt doesn't have to be overly restrictive either - it can be something like not allowing yourself 'bad' foods at all, instead of eating a little when you want them.",
      "created_utc": 1633195770.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hf61557",
      "author": "Due_Razzmatazz_7068",
      "body": "Easiest place to say no is at the store, avoid buying triggering foods, and try to load up on baby carrots or fruit, then when you binge eat at least it’s on healthier foods. Try to avoid watching tv, or any other distractions when you eat, so as to start being more mindful when eating. Observe what emotions you are feeling before during and after eating, maybe even write them down.",
      "created_utc": 1633222382.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hf2x02l",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1633168652.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hf6xa45",
      "author": "prutzprutz",
      "body": "Mindful eating. Stop eating in front of TV, try to enjoy every bite, experience every taste.\nThere's no quick solve to this problem, it takes time and effort but if you can start trying slowly, you can do it and it'll change your life",
      "created_utc": 1633239255.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hf701m7",
      "author": "Snowypaton1",
      "body": "I used to a lot in highschool and it really made no sense to me then I found a way to do it without technically you know… eating. Honestly money. It’s so expensive it’s so fucking expensive. Also replacing that destructive habit with a slightly less destructive habit. I don’t binge anymore I smoke weed now 🤷🏼‍♀️ also good god water water water fuck drink water and don’t be in your house if you are feeling bingey. Just be anywhere else and don’t take money with you when you leave or you could buy food out.",
      "created_utc": 1633241162.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hf70bz5",
      "author": "Snowypaton1",
      "body": "The biggest thing thoigh that gets you away from it is distraction. Date around if you want, spend time with your loved ones friends, just get interested in something that isn’t your eating disorder and if you have an interest throw yourself into it. I’ve found it hard to quit something destructive without a replacement. Take that for what you will. Look into a thing that I guess could still be not the greatest for you (as in any indulgence of some kind) try to make it as non risky as possible (stay away from alcohol or nicotine or generally bad and addictive drugs or risky ssx)",
      "created_utc": 1633241365.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfde1xj",
      "author": "RoseAtelier",
      "body": "When you’re “good”, do you restrict?  When you get out of a binge cycle, let yourself eat anything you want. No restrictions on “unhealthy foods”.  I’ve had all the eating disorders in the past. BED being one of them but looking back, I always tried to restrict my intake when I wasn’t binging. When I recovered from it, I let myself eat literally anything and everything with no restrictions when I wasn’t binging and it happened to be more than normal, but eventually, you naturally eat at a normal amount. \n\nIf it’s purely emotions that makes you binge and not restricting at all, sometimes it’s a good idea to try change your environment a little temporarily, or your lifestyle schedule. It disrupts your binging routine and hours and could help.",
      "created_utc": 1633367129.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hf3mi8l",
      "author": "pancakes4meplz",
      "body": "definitely this. bread is one for me too and I simply don't keep it in the house. if I need it for anything I'll just buy a smaller loaf or make my own so I only have what I need and won't be tempted to eat the rest. also if you're like me and just... buy binge food with no regard for how much you're spending, try budgeting. I give myself a set amount for groceries every month and if i go over (usually from buying binge food) feels bad to have to move money from my vacation or even medical fund to have to cover that. it really puts it onto perspective for me.",
      "created_utc": 1633184294.0,
      "score": 2,
      "context": [
        {
          "id": "hf3ibay",
          "author": "wilcontantlylevetypo",
          "body": "Try not to have any triggering foods around, at least while you start your recovery. For me it's breads and pastas. Any time I have them in the house I always say I'll just have a bit, but it turns into a binge almost every time. Especially when there emotional eating triggers going on.",
          "created_utc": 1633182238.0
        }
      ]
    },
    {
      "id": "hf3lgnm",
      "author": "mysphit",
      "body": "Don't yell at and punish your inner child. Ask what it wants and try to understand its needs.",
      "created_utc": 1633183783.0,
      "score": 4,
      "context": [
        {
          "id": "hf3lbwd",
          "author": "mysphit",
          "body": "If you have a headache, you reach for a pill. If you are thirsty, you want a drink. If there is a hunger, you reach for food.\n\nThe hunger isn't always physical.\n\nFill the void with something other than food. 💜",
          "created_utc": 1633183718.0
        }
      ]
    },
    {
      "id": "hfb333d",
      "author": "MaxBangs_",
      "body": "Hey that's a very Nice tip. ¡Thank you!",
      "created_utc": 1633316184.0,
      "score": 1,
      "context": [
        {
          "id": "hf3lbwd",
          "author": "mysphit",
          "body": "If you have a headache, you reach for a pill. If you are thirsty, you want a drink. If there is a hunger, you reach for food.\n\nThe hunger isn't always physical.\n\nFill the void with something other than food. 💜",
          "created_utc": 1633183718.0
        },
        {
          "id": "hf3lgnm",
          "author": "mysphit",
          "body": "Don't yell at and punish your inner child. Ask what it wants and try to understand its needs.",
          "created_utc": 1633183783.0
        }
      ]
    }
  ]
}