{
  "id": "q1js21",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1633395417.0,
  "title": "Request:My therapist triggered me and It made me want to get worse",
  "selftext": " \n\nI go to her for something else but she knows about my messed up relationship with food so every session we spend at least a small amount of time talking about it (she insisted on it so if she does care)to check up on me and make sure it doesn’t get completely out of hand.\n\nDuring our last session she asked me how it was going and at some point I asked her if she thinks I have an Ed, and she responded that she thinks that it seems that it’s still a hobby to me and that I just like spending time being busy with body image and calorie tracking and that an eating disorder becomes a disorder once you physically can’t do things anymore like going to a school etc and also that I didn’t look that unhealthy anyways and damn it really messed me up 💀.\n\nBefore she said that the amount of cals I consumed a day was already like toddler sized but now even that seems too much for me and I just don’t want to eat anymore and start hating the feeling of food in my body. I already think I might have some type of b/p ana bc i am underweight now but I still binge and I already feel invalid and gross for binging but her comment straight up made it worse and now I just feel like I have to prove to her that I can get skinnier and that I can look unhealthy and part of my wants to tell her that her comment messed me up but at the same time i am just so uncomfortable talking about my struggles around food I just never want to talk about it with her again.\n\nOur next session is on Wednesday and i am for the most part wondering if she was right about the whole Ed thing and that maybe i am just overreacting and a “wanarexic”😕Idk I just feel bad and was wondering if people here have advice for me.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/q1js21/requestmy_therapist_triggered_me_and_it_made_me/",
  "score": 52,
  "num_comments": 25,
  "comments": [
    {
      "id": "hffig9z",
      "author": "mud_octopus",
      "body": "This person is wrong. What they told you truly boils down to this: \"I am not qualified to tell you whether or not you have an eating disorder, because I have no idea what the criteria for an eating disorder is, and am completely oblivious to the spectrum of what eating disorder sufferers may look like [physical appearance and behaviours].\" \n\nSeriously. I saw a psychiatrist for an ED program intake, just wanting to see a therapist or something. This ED specialist not only confirmed my ED diagnosis, but recommended IP treatment. This while I was a) slightly overweight / high normal weight but otherwise totally healthy looking and b) fully functioning at grad school, maintaining high grades and working 3 part time jobs.\n\nIdk if your therapist is helping you with your other issues, but I would recommend not talking to someone so clueless about EDs about anything related to your eating and body image. I have before too, and they also always made it worse with similar comments.",
      "created_utc": 1633398902.0,
      "score": 51,
      "context": []
    },
    {
      "id": "hfg2z4o",
      "author": "mar_ivy15",
      "body": "I’ve learned that if someone does not have actual real training and experience working with eating disorders, then they have no idea wtf they’re talking about. They might think that they do, but I can guarantee they don’t.\nFrom the sounds of it, your therapist is one of those people who thinks they know but they really don’t. Like I don’t know in what universe calorie counting and body checking is a fucking hobby. That’s not a hobby. For anyone. It’s hella disordered and disguises itself well as “health”.   Also eating disorders don’t look a certain way. There’s a reason why weight was taken out of the criteria in the DSM-V.   I mean honestly you could make the same argument for many diseases and disorders.  “Well you don’t look sad so you’re not depressed”.  Like what. No. I 10,000% recommend finding someone with real training and experience in EDs in your area who can do an intake or screening appt with you. It will be so much more validating, I promise. They won’t downplay any of your struggles (unless they’re shit at their job) because they are 100% real!  \nAlso- I really really really resonate with the wanting to prove to her that you do have a problem.  I’ve been the exact same way. One of my therapists pointed out to me that it’s basically because a need is not being met. From what I can tell from your post, it sounds like you feel like you’re not being heard.  That therapist gave me a list of functions for an ED and you basically just checked off what you think your ED is there for. One of the ones I checked off I thought was so embarrassing and I didn’t want to share it (I did bc I really trusted her). That function was attention. I was embarrassed by it bc I didn’t want her to think that I was using it to be an “attention whore” or some other bad connotation of the word.  She assured me that that reason is completely understandable and valid and it’s not fake. It means that I want people to listen to me and notice me and that need isnt being met. If this doesn’t resonate with you, then I’m sorry you had to read all of that 😅 But I want you to know that I hear you. And I, too, would be triggered as hell. Basically all I can think of is that meme “you wanna see some real speed??”  You don’t need to show her any real speed. You don’t need to look a certain way or function a certain way for something to be real. If it’s negatively interfering with your life and/or you have a concern about it, then that’s valid enough. \nSorry this was a long ramble. I kinda just typed my brain train. I hope even one sentence of this was even a tiny bit helpful to you (or anyone else reading it). \nOh I forgot- as for advice with your therapist, just mentioned like “hey so the ED stuff is actually kinda bothering me” and then maybe ask for a referral or something to an actual ED professional. And if you wanna try to ease the awkwardness, then you can be like I just wanna check to make sure and see what someone else has to say.  And if she’s offended by that, then fire her (ok maybe not, but any good therapist would be totally ok with you wanting to seek more help and guidance). Then if you do talk to someone, you can talk to your therapist about it and have more of a discussion on the whole situation.",
      "created_utc": 1633410484.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hffduuc",
      "author": "Realistic-Reason-481",
      "body": "Sweetheart that is not a good therapist an eating disorder isn’t defined In one way. Binge eating is a disorder the need to be skinny is a disorder just because it’s different than she perceives it does not make it any less valid. Therapist like this lead to harm of patience that’s down right negligence and ignorance",
      "created_utc": 1633396622.0,
      "score": 15,
      "context": []
    },
    {
      "id": "hffloyu",
      "author": "Yell0wCranberry",
      "body": "I agree with what’s been said. Eating disorders show up in all different shapes and sizes. And there’s no point in waiting to “get worse” before you get treatment, that just makes it harder. So please don’t wait until you “can’t go to school anymore.” \nI would suggest getting an ED-informed therapist and dietitian. Therapist can help you dig deep into reasons behind the ED, dietitian can help you with the behaviors and relationship with food. Even if you’re not officially diagnosed, dietitians can help with disordered eating.",
      "created_utc": 1633400513.0,
      "score": 4,
      "context": []
    },
    {
      "id": "hfhc36f",
      "author": "itsveronicalodge",
      "body": "Brb adding eating disorder to my dating profile as a “hobby” 🤡",
      "created_utc": 1633443285.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hffbgxk",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1633395417.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfgir7l",
      "author": "Rhiannonbecks",
      "body": "She is an asshole. And unethical. Idc what her degree is in, we can all say inappropriate things, but as a therapist I would think she knows how harmful the “you don’t even look sick” “you don’t look sick enough” trope is. \n\nOP, from the depths of my heart I’m so sorry that you were treated like that, that someone you are supposed to trust had added harm when they are supposed to be leading your healing. \n\nI obviously don’t know their background but to me, sounds like they truly have no experience nor qualifications around EDs/disordered eating. \n\nMy unsolicited advice: find a therapist who is multi focused and EDs are part of that focus. I’ve been in/out of therapy for years and often felt like I could never be honest about my ED. 1.5 years ago I started w/my now therapist who focuses largely on ED/Trauma & have been in recovery for a year. \n\nI only share my story out of hope, that your provider can make a major impact on your life, hopefully in a positive light, but your therapist (based on what little context we have) is doing the opposite. \n\nGood luck. Sending you some internet love.",
      "created_utc": 1633424081.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfgu0pl",
      "author": "MaryContrary26",
      "body": "Kind of like telling an  alcoholic well you don't drink every day, don't start until lunch and don't black out so no worries it's just a hobby.",
      "created_utc": 1633433680.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfibjfi",
      "author": "dredged_dm",
      "body": "One thing that really needs to be pointed out that I didn't see in other comments, **therapy is a service** and you are literally paying this person for their time. \n\nThis means that if they say something that makes you uncomfortable you should *always say something*. Therapists are not friends, you shouldn't feel the need to be careful to not upset them. Most of the therapists I've seen genuinely want to help, but remember that clear communication is key so being silent about how what they said hurt you is only going to impede their ability to help you. \n\nAlso you can find another therapist. It may not be easy depending on your situation, but it's usually doable. \n\n(also yeah she is wrong about your ED)",
      "created_utc": 1633458140.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfj2qd2",
      "author": "Mysterious_Purplee",
      "body": "I hear you the story of my life every month 🙁 hugs",
      "created_utc": 1633469691.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfj4z2b",
      "author": "Bloepbloepblue",
      "body": "What bullshit. Who obsessively counts calories, undereats and hates their body as a fun hobby? Is it fun to you? Probably not. She has no idea what she is talking about. You should see a specialist for a second opinion.",
      "created_utc": 1633470693.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hhh0dmr",
      "author": "AntiBeyonder",
      "body": "That's shit. I was the same (still am kinda but it's a lot better). I have ASD and BPD I couldn't stop binge eating. This endless void of dispare and hunger. I was obsessed with calorie counting and macros. Always having like 500g of protein a day. Had to keep single digit bodyfat. \n\nSo I went plant-based to help cut out a lot of foods so I wouldn't have to worry about them. I lost cravings because it was like a rule that erased them for me. I was also able to binge lower calorie foods like carrots, celery, low-calorie pastas whenever I needed to feel full. I also lost my fear of carbs and started having 500g+ a day.\n\nAnd over time my desire for binging has left and calorie counting OCD are seemingly gone. I had to convince myself of burnout though. I recommend it, just make sure you have iron and b12.\n\n\n I then became vegan for ethics. \nAutist are the best militant vegans haha. \nI'm still fucking miserable though.",
      "created_utc": 1634809110.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfkvyih",
      "author": "None",
      "body": "Thanks for the advice,tbh I’ve already been planning on getting a new therapist anyways because even tho she has helped me with my issues this in combination with her romaticising asd has made me uncomfortable af",
      "created_utc": 1633506318.0,
      "score": 2,
      "context": [
        {
          "id": "hffig9z",
          "author": "mud_octopus",
          "body": "This person is wrong. What they told you truly boils down to this: \"I am not qualified to tell you whether or not you have an eating disorder, because I have no idea what the criteria for an eating disorder is, and am completely oblivious to the spectrum of what eating disorder sufferers may look like [physical appearance and behaviours].\" \n\nSeriously. I saw a psychiatrist for an ED program intake, just wanting to see a therapist or something. This ED specialist not only confirmed my ED diagnosis, but recommended IP treatment. This while I was a) slightly overweight / high normal weight but otherwise totally healthy looking and b) fully functioning at grad school, maintaining high grades and working 3 part time jobs.\n\nIdk if your therapist is helping you with your other issues, but I would recommend not talking to someone so clueless about EDs about anything related to your eating and body image. I have before too, and they also always made it worse with similar comments.",
          "created_utc": 1633398902.0
        }
      ]
    },
    {
      "id": "hfhiv7g",
      "author": "Low-Euphoric",
      "body": "Truly one of the best comments (helpful and vulnerable) I’ve seen on this sub. Thank you ❤️",
      "created_utc": 1633446344.0,
      "score": 2,
      "context": [
        {
          "id": "hfg2z4o",
          "author": "mar_ivy15",
          "body": "I’ve learned that if someone does not have actual real training and experience working with eating disorders, then they have no idea wtf they’re talking about. They might think that they do, but I can guarantee they don’t.\nFrom the sounds of it, your therapist is one of those people who thinks they know but they really don’t. Like I don’t know in what universe calorie counting and body checking is a fucking hobby. That’s not a hobby. For anyone. It’s hella disordered and disguises itself well as “health”.   Also eating disorders don’t look a certain way. There’s a reason why weight was taken out of the criteria in the DSM-V.   I mean honestly you could make the same argument for many diseases and disorders.  “Well you don’t look sad so you’re not depressed”.  Like what. No. I 10,000% recommend finding someone with real training and experience in EDs in your area who can do an intake or screening appt with you. It will be so much more validating, I promise. They won’t downplay any of your struggles (unless they’re shit at their job) because they are 100% real!  \nAlso- I really really really resonate with the wanting to prove to her that you do have a problem.  I’ve been the exact same way. One of my therapists pointed out to me that it’s basically because a need is not being met. From what I can tell from your post, it sounds like you feel like you’re not being heard.  That therapist gave me a list of functions for an ED and you basically just checked off what you think your ED is there for. One of the ones I checked off I thought was so embarrassing and I didn’t want to share it (I did bc I really trusted her). That function was attention. I was embarrassed by it bc I didn’t want her to think that I was using it to be an “attention whore” or some other bad connotation of the word.  She assured me that that reason is completely understandable and valid and it’s not fake. It means that I want people to listen to me and notice me and that need isnt being met. If this doesn’t resonate with you, then I’m sorry you had to read all of that 😅 But I want you to know that I hear you. And I, too, would be triggered as hell. Basically all I can think of is that meme “you wanna see some real speed??”  You don’t need to show her any real speed. You don’t need to look a certain way or function a certain way for something to be real. If it’s negatively interfering with your life and/or you have a concern about it, then that’s valid enough. \nSorry this was a long ramble. I kinda just typed my brain train. I hope even one sentence of this was even a tiny bit helpful to you (or anyone else reading it). \nOh I forgot- as for advice with your therapist, just mentioned like “hey so the ED stuff is actually kinda bothering me” and then maybe ask for a referral or something to an actual ED professional. And if you wanna try to ease the awkwardness, then you can be like I just wanna check to make sure and see what someone else has to say.  And if she’s offended by that, then fire her (ok maybe not, but any good therapist would be totally ok with you wanting to seek more help and guidance). Then if you do talk to someone, you can talk to your therapist about it and have more of a discussion on the whole situation.",
          "created_utc": 1633410484.0
        }
      ]
    },
    {
      "id": "hfi92t3",
      "author": "None",
      "body": "YOOOO the “do you want to see some real speed bitch” sound reference resonated with me sm 😭that has litteraly been my brain since she said that to me like it even ruined my birthday bc I barely ate even tho I was out with friends and they kept offering me food bc they were concerned asf while my birthday should’ve been the day that I would somewhat eat normal but no.Tbh iam not going to try and blame this woman for every disordered thought I have but she defenitly made them a lot worse.And don’t worry about the ramble,I really appreciate your comment and it was really nice and comforting to read :)Also I do kinda resonate with that,my Ed (if iam even qualified to call it that at this point lol)initially started bc I wanted to lose 2 kg by after some time I realised ig it’s more then just wanting to be unhealthily skinny,it kind of has become my comfort and for some reason I really want people to notice how much weight iam losing and be shocked and idk it’s probably bc some need is not being met but idk which one it is 😅",
      "created_utc": 1633457173.0,
      "score": 1,
      "context": [
        {
          "id": "hfg2z4o",
          "author": "mar_ivy15",
          "body": "I’ve learned that if someone does not have actual real training and experience working with eating disorders, then they have no idea wtf they’re talking about. They might think that they do, but I can guarantee they don’t.\nFrom the sounds of it, your therapist is one of those people who thinks they know but they really don’t. Like I don’t know in what universe calorie counting and body checking is a fucking hobby. That’s not a hobby. For anyone. It’s hella disordered and disguises itself well as “health”.   Also eating disorders don’t look a certain way. There’s a reason why weight was taken out of the criteria in the DSM-V.   I mean honestly you could make the same argument for many diseases and disorders.  “Well you don’t look sad so you’re not depressed”.  Like what. No. I 10,000% recommend finding someone with real training and experience in EDs in your area who can do an intake or screening appt with you. It will be so much more validating, I promise. They won’t downplay any of your struggles (unless they’re shit at their job) because they are 100% real!  \nAlso- I really really really resonate with the wanting to prove to her that you do have a problem.  I’ve been the exact same way. One of my therapists pointed out to me that it’s basically because a need is not being met. From what I can tell from your post, it sounds like you feel like you’re not being heard.  That therapist gave me a list of functions for an ED and you basically just checked off what you think your ED is there for. One of the ones I checked off I thought was so embarrassing and I didn’t want to share it (I did bc I really trusted her). That function was attention. I was embarrassed by it bc I didn’t want her to think that I was using it to be an “attention whore” or some other bad connotation of the word.  She assured me that that reason is completely understandable and valid and it’s not fake. It means that I want people to listen to me and notice me and that need isnt being met. If this doesn’t resonate with you, then I’m sorry you had to read all of that 😅 But I want you to know that I hear you. And I, too, would be triggered as hell. Basically all I can think of is that meme “you wanna see some real speed??”  You don’t need to show her any real speed. You don’t need to look a certain way or function a certain way for something to be real. If it’s negatively interfering with your life and/or you have a concern about it, then that’s valid enough. \nSorry this was a long ramble. I kinda just typed my brain train. I hope even one sentence of this was even a tiny bit helpful to you (or anyone else reading it). \nOh I forgot- as for advice with your therapist, just mentioned like “hey so the ED stuff is actually kinda bothering me” and then maybe ask for a referral or something to an actual ED professional. And if you wanna try to ease the awkwardness, then you can be like I just wanna check to make sure and see what someone else has to say.  And if she’s offended by that, then fire her (ok maybe not, but any good therapist would be totally ok with you wanting to seek more help and guidance). Then if you do talk to someone, you can talk to your therapist about it and have more of a discussion on the whole situation.",
          "created_utc": 1633410484.0
        }
      ]
    },
    {
      "id": "hffvpal",
      "author": "None",
      "body": "Just making a comment here, OP sounds like they’re struggling with anorexia binge purge subtype...binge eating disorder is a disorder characterized by bingeing a minimum of 3x per week and meeting that criteria etc. which OP doesn’t sound like they’re struggling with. It sounds like they’re restricting/compensating for what they perceive as overeating (despite already being a too-minimal amount as described by their therapist as a “toddler sized” amount of food). It sounds like you are struggling, OP, and you need to get help from a therapist who is actually qualified to help you (ie one that specializes in eds, as well as a dietitian who can work with you to develop a healthy relationship with food again). Therapists are like doctors—there are some quacks out there who truly don’t know what they’re talking about or extend into areas they have no place being, and that is straight up malpractice in my opinion. Please get help from an ed specializing dietitian, you will not regret it, recovery will be so worth it. Your struggles are valid now and there is no point in making your situation any worse than it already is; you are valid and deserve recovery NOW. Before it gets any worse. Start the path to healing now, and you will be so incredibly glad you got the help when you did. DM me if I can help any more <3",
      "created_utc": 1633405811.0,
      "score": 3,
      "context": [
        {
          "id": "hffduuc",
          "author": "Realistic-Reason-481",
          "body": "Sweetheart that is not a good therapist an eating disorder isn’t defined In one way. Binge eating is a disorder the need to be skinny is a disorder just because it’s different than she perceives it does not make it any less valid. Therapist like this lead to harm of patience that’s down right negligence and ignorance",
          "created_utc": 1633396622.0
        }
      ]
    },
    {
      "id": "hfgvizi",
      "author": "None",
      "body": "Yeah you’re right but tbh it’s even hard for myself to believe it because my desire to lose weight has evolved from just wanting to lose 2kg to wanting to look frail and unhealthy and idk where it’s coming from honestly but now I see my previous healthy weight as fat even though I’ve always been skinny and want to go as far from being that weight as I possibly can especially after what the therapist said bc now I feel like she also thinks I look fat :( I know it sounds ridiculous but at this point all my logic is gone.Its sad that her opinion on Ed’s turns out to be this bc all I was hoping for is just someone who I could vent to about food related struggles without being forced into a hospital so if that’s why iam scared that if I contact a dietician they will force me to drop all my habits and tell me that I need to get hospitalised (I mean that’s kind of their job if it’s that bad) but in my head I keep switching inbetween feeling happy and confident living like this and then on other days feeling scared for myself.",
      "created_utc": 1633434689.0,
      "score": 1,
      "context": [
        {
          "id": "hffloyu",
          "author": "Yell0wCranberry",
          "body": "I agree with what’s been said. Eating disorders show up in all different shapes and sizes. And there’s no point in waiting to “get worse” before you get treatment, that just makes it harder. So please don’t wait until you “can’t go to school anymore.” \nI would suggest getting an ED-informed therapist and dietitian. Therapist can help you dig deep into reasons behind the ED, dietitian can help you with the behaviors and relationship with food. Even if you’re not officially diagnosed, dietitians can help with disordered eating.",
          "created_utc": 1633400513.0
        }
      ]
    },
    {
      "id": "hfhkwzd",
      "author": "None",
      "body": "AHAHAHA pls 😭I wish I could tell her this",
      "created_utc": 1633447175.0,
      "score": 2,
      "context": [
        {
          "id": "hfhc36f",
          "author": "itsveronicalodge",
          "body": "Brb adding eating disorder to my dating profile as a “hobby” 🤡",
          "created_utc": 1633443285.0
        }
      ]
    },
    {
      "id": "hfhv9r2",
      "author": "None",
      "body": "Exactly 💀Like does she think I legit cry over having to eat certain food groups for fun??",
      "created_utc": 1633451425.0,
      "score": 1,
      "context": [
        {
          "id": "hfgu0pl",
          "author": "MaryContrary26",
          "body": "Kind of like telling an  alcoholic well you don't drink every day, don't start until lunch and don't black out so no worries it's just a hobby.",
          "created_utc": 1633433680.0
        }
      ]
    },
    {
      "id": "hfl5icg",
      "author": "None",
      "body": "Nawh iam sorry :( but how do you mean every month?",
      "created_utc": 1633515370.0,
      "score": 1,
      "context": [
        {
          "id": "hfj2qd2",
          "author": "Mysterious_Purplee",
          "body": "I hear you the story of my life every month 🙁 hugs",
          "created_utc": 1633469691.0
        }
      ]
    },
    {
      "id": "hfieb86",
      "author": "mar_ivy15",
      "body": "Oh thank you so much!  I honestly could have said so much more. While my experience has been different than OP’s, SO MANY of those feels have been the same. And I still struggle with a lot of them, but at least with the right help that I’ve received, I am able to tell where they’re coming from and why I’m having them. It doesn’t make the journey easy by any means, but it certainly makes it easier to understand. I’ve been weight restored for about 2 yrs now and I just met by boyfriend about 7-8 months ago. He’s well informed of my background but sometimes I still feel like I need to prove to him that I do in fact still struggle with an eating disorder. I think he thinks that bc of my size and bc I snack, that I can’t still have one. But that’s simply not true. It’s much better between us now that I’ve been able to educate him more, but there are still times where I feel like I need to do something drastic to prove to him. In reality though, no one needs to “prove” anything to anyone. You know yourself best.",
      "created_utc": 1633459275.0,
      "score": 2,
      "context": [
        {
          "id": "hfg2z4o",
          "author": "mar_ivy15",
          "body": "I’ve learned that if someone does not have actual real training and experience working with eating disorders, then they have no idea wtf they’re talking about. They might think that they do, but I can guarantee they don’t.\nFrom the sounds of it, your therapist is one of those people who thinks they know but they really don’t. Like I don’t know in what universe calorie counting and body checking is a fucking hobby. That’s not a hobby. For anyone. It’s hella disordered and disguises itself well as “health”.   Also eating disorders don’t look a certain way. There’s a reason why weight was taken out of the criteria in the DSM-V.   I mean honestly you could make the same argument for many diseases and disorders.  “Well you don’t look sad so you’re not depressed”.  Like what. No. I 10,000% recommend finding someone with real training and experience in EDs in your area who can do an intake or screening appt with you. It will be so much more validating, I promise. They won’t downplay any of your struggles (unless they’re shit at their job) because they are 100% real!  \nAlso- I really really really resonate with the wanting to prove to her that you do have a problem.  I’ve been the exact same way. One of my therapists pointed out to me that it’s basically because a need is not being met. From what I can tell from your post, it sounds like you feel like you’re not being heard.  That therapist gave me a list of functions for an ED and you basically just checked off what you think your ED is there for. One of the ones I checked off I thought was so embarrassing and I didn’t want to share it (I did bc I really trusted her). That function was attention. I was embarrassed by it bc I didn’t want her to think that I was using it to be an “attention whore” or some other bad connotation of the word.  She assured me that that reason is completely understandable and valid and it’s not fake. It means that I want people to listen to me and notice me and that need isnt being met. If this doesn’t resonate with you, then I’m sorry you had to read all of that 😅 But I want you to know that I hear you. And I, too, would be triggered as hell. Basically all I can think of is that meme “you wanna see some real speed??”  You don’t need to show her any real speed. You don’t need to look a certain way or function a certain way for something to be real. If it’s negatively interfering with your life and/or you have a concern about it, then that’s valid enough. \nSorry this was a long ramble. I kinda just typed my brain train. I hope even one sentence of this was even a tiny bit helpful to you (or anyone else reading it). \nOh I forgot- as for advice with your therapist, just mentioned like “hey so the ED stuff is actually kinda bothering me” and then maybe ask for a referral or something to an actual ED professional. And if you wanna try to ease the awkwardness, then you can be like I just wanna check to make sure and see what someone else has to say.  And if she’s offended by that, then fire her (ok maybe not, but any good therapist would be totally ok with you wanting to seek more help and guidance). Then if you do talk to someone, you can talk to your therapist about it and have more of a discussion on the whole situation.",
          "created_utc": 1633410484.0
        },
        {
          "id": "hfhiv7g",
          "author": "Low-Euphoric",
          "body": "Truly one of the best comments (helpful and vulnerable) I’ve seen on this sub. Thank you ❤️",
          "created_utc": 1633446344.0
        }
      ]
    },
    {
      "id": "hfiiic4",
      "author": "mar_ivy15",
      "body": "It’s okay, you can celebrate your birthday 2, 3, 4, 5 more times if you want. Make it a whole week. Little bits of good things each day can add up to a good day lol. \nI guess it depends on how much you trust you therapist, but if you really do, you can tell her that when she said x, you thought y.  When I first started seeing my current therapist, I know if she said anything that made me think bad thoughts, I probably wouldn’t have told her (probably happened irl but I can’t think of a specific instance). After seeing her for like 9-10 months, she had mentioned me possibly seeing a therapist outside of The Emily Program. I tried to hide my crying but she could still tell over zoom. She asked what I was thinking, and it was really hard for me to say, but I was like yo I feel like if I’m not at TEP, then it’ll be so easy for me to just fall back again and I opened up more about having some other thoughts that I had kinda been trying to hide or downplay (like calorie counting and fasting and stuff). That was about a year ago and I’m still with her. We’re at a point where if she says something and I feel a trigger, I can tell her right away. Like recently she brought up self weighing and I was like “well actually I hadn’t even thought about that in awhile but now that you mention it, it sounds like a good idea 🤪” she was like “No! No let’s not do that.” I thought it was hilarious tbh. But being able to say something right away definitely helped me not spiral thinking about it. That was like 2-3 weeks ago and I still haven’t self weighed (yay me lol). So yeah, think about where you’re at in your relationship with your therapist and how/if you want to approach bringing this up to her. You certainly don’t have to, as I know it can be hella uncomfortable. But maybe it’d help ease some of your thoughts. \nI know I’ve found the ED comforting bc it gave me something I felt like I had control over in my chaotic life. And it made me feel like I could actually accomplish something and be “good” at something. \nBut bruh I had an appointment yesterday and my therapist asked me what function my ED has for me now and was like why are we still holding onto it. I was like dude idk I just like it. So I definitely understand not knowing what need it’s fulfilling, just that it’s there and it’s doing something lol. But it’s ok, we’ll both figure it out eventually 😊",
      "created_utc": 1633461130.0,
      "score": 1,
      "context": [
        {
          "id": "hfg2z4o",
          "author": "mar_ivy15",
          "body": "I’ve learned that if someone does not have actual real training and experience working with eating disorders, then they have no idea wtf they’re talking about. They might think that they do, but I can guarantee they don’t.\nFrom the sounds of it, your therapist is one of those people who thinks they know but they really don’t. Like I don’t know in what universe calorie counting and body checking is a fucking hobby. That’s not a hobby. For anyone. It’s hella disordered and disguises itself well as “health”.   Also eating disorders don’t look a certain way. There’s a reason why weight was taken out of the criteria in the DSM-V.   I mean honestly you could make the same argument for many diseases and disorders.  “Well you don’t look sad so you’re not depressed”.  Like what. No. I 10,000% recommend finding someone with real training and experience in EDs in your area who can do an intake or screening appt with you. It will be so much more validating, I promise. They won’t downplay any of your struggles (unless they’re shit at their job) because they are 100% real!  \nAlso- I really really really resonate with the wanting to prove to her that you do have a problem.  I’ve been the exact same way. One of my therapists pointed out to me that it’s basically because a need is not being met. From what I can tell from your post, it sounds like you feel like you’re not being heard.  That therapist gave me a list of functions for an ED and you basically just checked off what you think your ED is there for. One of the ones I checked off I thought was so embarrassing and I didn’t want to share it (I did bc I really trusted her). That function was attention. I was embarrassed by it bc I didn’t want her to think that I was using it to be an “attention whore” or some other bad connotation of the word.  She assured me that that reason is completely understandable and valid and it’s not fake. It means that I want people to listen to me and notice me and that need isnt being met. If this doesn’t resonate with you, then I’m sorry you had to read all of that 😅 But I want you to know that I hear you. And I, too, would be triggered as hell. Basically all I can think of is that meme “you wanna see some real speed??”  You don’t need to show her any real speed. You don’t need to look a certain way or function a certain way for something to be real. If it’s negatively interfering with your life and/or you have a concern about it, then that’s valid enough. \nSorry this was a long ramble. I kinda just typed my brain train. I hope even one sentence of this was even a tiny bit helpful to you (or anyone else reading it). \nOh I forgot- as for advice with your therapist, just mentioned like “hey so the ED stuff is actually kinda bothering me” and then maybe ask for a referral or something to an actual ED professional. And if you wanna try to ease the awkwardness, then you can be like I just wanna check to make sure and see what someone else has to say.  And if she’s offended by that, then fire her (ok maybe not, but any good therapist would be totally ok with you wanting to seek more help and guidance). Then if you do talk to someone, you can talk to your therapist about it and have more of a discussion on the whole situation.",
          "created_utc": 1633410484.0
        },
        {
          "id": "hfi92t3",
          "author": "None",
          "body": "YOOOO the “do you want to see some real speed bitch” sound reference resonated with me sm 😭that has litteraly been my brain since she said that to me like it even ruined my birthday bc I barely ate even tho I was out with friends and they kept offering me food bc they were concerned asf while my birthday should’ve been the day that I would somewhat eat normal but no.Tbh iam not going to try and blame this woman for every disordered thought I have but she defenitly made them a lot worse.And don’t worry about the ramble,I really appreciate your comment and it was really nice and comforting to read :)Also I do kinda resonate with that,my Ed (if iam even qualified to call it that at this point lol)initially started bc I wanted to lose 2 kg by after some time I realised ig it’s more then just wanting to be unhealthily skinny,it kind of has become my comfort and for some reason I really want people to notice how much weight iam losing and be shocked and idk it’s probably bc some need is not being met but idk which one it is 😅",
          "created_utc": 1633457173.0
        }
      ]
    },
    {
      "id": "hfmbrc5",
      "author": "Mysterious_Purplee",
      "body": "I see them every month and he seems to be triggering me, I’m going to find a different one.",
      "created_utc": 1633537190.0,
      "score": 1,
      "context": [
        {
          "id": "hfj2qd2",
          "author": "Mysterious_Purplee",
          "body": "I hear you the story of my life every month 🙁 hugs",
          "created_utc": 1633469691.0
        },
        {
          "id": "hfl5icg",
          "author": "None",
          "body": "Nawh iam sorry :( but how do you mean every month?",
          "created_utc": 1633515370.0
        }
      ]
    },
    {
      "id": "hgts6lu",
      "author": "Mysterious_Purplee",
      "body": "Im sorry",
      "created_utc": 1634359879.0,
      "score": 1,
      "context": [
        {
          "id": "hfj2qd2",
          "author": "Mysterious_Purplee",
          "body": "I hear you the story of my life every month 🙁 hugs",
          "created_utc": 1633469691.0
        },
        {
          "id": "hfl5icg",
          "author": "None",
          "body": "Nawh iam sorry :( but how do you mean every month?",
          "created_utc": 1633515370.0
        }
      ]
    },
    {
      "id": "hfifrrg",
      "author": "Low-Euphoric",
      "body": "Aww, wish you and him happiness, and congratulations on your path to recovering! I believe that people challenging our need to prove ourselves is a lesson about validating yourself. You are seen and loved.",
      "created_utc": 1633459941.0,
      "score": 1,
      "context": [
        {
          "id": "hfg2z4o",
          "author": "mar_ivy15",
          "body": "I’ve learned that if someone does not have actual real training and experience working with eating disorders, then they have no idea wtf they’re talking about. They might think that they do, but I can guarantee they don’t.\nFrom the sounds of it, your therapist is one of those people who thinks they know but they really don’t. Like I don’t know in what universe calorie counting and body checking is a fucking hobby. That’s not a hobby. For anyone. It’s hella disordered and disguises itself well as “health”.   Also eating disorders don’t look a certain way. There’s a reason why weight was taken out of the criteria in the DSM-V.   I mean honestly you could make the same argument for many diseases and disorders.  “Well you don’t look sad so you’re not depressed”.  Like what. No. I 10,000% recommend finding someone with real training and experience in EDs in your area who can do an intake or screening appt with you. It will be so much more validating, I promise. They won’t downplay any of your struggles (unless they’re shit at their job) because they are 100% real!  \nAlso- I really really really resonate with the wanting to prove to her that you do have a problem.  I’ve been the exact same way. One of my therapists pointed out to me that it’s basically because a need is not being met. From what I can tell from your post, it sounds like you feel like you’re not being heard.  That therapist gave me a list of functions for an ED and you basically just checked off what you think your ED is there for. One of the ones I checked off I thought was so embarrassing and I didn’t want to share it (I did bc I really trusted her). That function was attention. I was embarrassed by it bc I didn’t want her to think that I was using it to be an “attention whore” or some other bad connotation of the word.  She assured me that that reason is completely understandable and valid and it’s not fake. It means that I want people to listen to me and notice me and that need isnt being met. If this doesn’t resonate with you, then I’m sorry you had to read all of that 😅 But I want you to know that I hear you. And I, too, would be triggered as hell. Basically all I can think of is that meme “you wanna see some real speed??”  You don’t need to show her any real speed. You don’t need to look a certain way or function a certain way for something to be real. If it’s negatively interfering with your life and/or you have a concern about it, then that’s valid enough. \nSorry this was a long ramble. I kinda just typed my brain train. I hope even one sentence of this was even a tiny bit helpful to you (or anyone else reading it). \nOh I forgot- as for advice with your therapist, just mentioned like “hey so the ED stuff is actually kinda bothering me” and then maybe ask for a referral or something to an actual ED professional. And if you wanna try to ease the awkwardness, then you can be like I just wanna check to make sure and see what someone else has to say.  And if she’s offended by that, then fire her (ok maybe not, but any good therapist would be totally ok with you wanting to seek more help and guidance). Then if you do talk to someone, you can talk to your therapist about it and have more of a discussion on the whole situation.",
          "created_utc": 1633410484.0
        },
        {
          "id": "hfhiv7g",
          "author": "Low-Euphoric",
          "body": "Truly one of the best comments (helpful and vulnerable) I’ve seen on this sub. Thank you ❤️",
          "created_utc": 1633446344.0
        },
        {
          "id": "hfieb86",
          "author": "mar_ivy15",
          "body": "Oh thank you so much!  I honestly could have said so much more. While my experience has been different than OP’s, SO MANY of those feels have been the same. And I still struggle with a lot of them, but at least with the right help that I’ve received, I am able to tell where they’re coming from and why I’m having them. It doesn’t make the journey easy by any means, but it certainly makes it easier to understand. I’ve been weight restored for about 2 yrs now and I just met by boyfriend about 7-8 months ago. He’s well informed of my background but sometimes I still feel like I need to prove to him that I do in fact still struggle with an eating disorder. I think he thinks that bc of my size and bc I snack, that I can’t still have one. But that’s simply not true. It’s much better between us now that I’ve been able to educate him more, but there are still times where I feel like I need to do something drastic to prove to him. In reality though, no one needs to “prove” anything to anyone. You know yourself best.",
          "created_utc": 1633459275.0
        }
      ]
    }
  ]
}