{
  "id": "q2h445",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1633513618.0,
  "title": "Request: I’m at rock bottom",
  "selftext": "I don’t want to die, really. I just don’t see any better options. I’ve been treated over and over and over….why continue? I’m at rock bottom I guess. Doc said “eat or die” and referred me to Hospice.\n\n&#x200B;\n\nTo the optimistic ones who believe anyone can get to full recovery….I have tried graining the weight and giving it a sincere try. Restoration ended in BED, my worst nightmare. Would be 6 ft under, bullet to my head, if not for being one of the lucky ones who got prescribed Vyvanse and really benefit. It helped me fight BED and it is the only drug that ever touched my depression and lifted my spirits.\n\n&#x200B;\n\nMy current life: On SSI (disability); have tried school and work and failed each try. Food is the #1 source of pleasure in my life (ironic haha).\n\n&#x200B;\n\nAlso, I am physically pretty far gone. Hospice means 6 months or less. And the constant episodes of confusion, even delirium, don’t make me hopeful about brain damage",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/q2h445/request_im_at_rock_bottom/",
  "score": 50,
  "num_comments": 11,
  "comments": [
    {
      "id": "hfl5yly",
      "author": "idrankthetapwater",
      "body": "Hey OP, I'm not great help and I don't know what advice I can give you. But if you want someone to listen, I'm here. I'm frankly terrible at messaging in a timely manner, but if you're okay with a semi responsive person to rant to, hmu\n\nOh and a quick edit: amphetamines can be used beneficially for a wide variety of things. Your medicine is specifically prescribed for BED, so please don't listen to the commenter telling you to stop your meds. You only need to talk to your doctor about them if they don't work.",
      "created_utc": 1633515742.0,
      "score": 20,
      "context": []
    },
    {
      "id": "hflb9hc",
      "author": "Quarter_Straight",
      "body": "This is just a random comment but I worked hospice for five years, and I know there’s the idea that if your relationship recommended hospice that it’s the end and there’s no hope but it’s actually the opposite of that. I had so many patients who came in disheartened with their diagnosis and family upset but weeks, months, or years later super happy they signed on and that’s because hospice provides more than just meds and such. It’s a team who helps in so many ways than one. We always became family. As well as a lot of free stuff and services are provided that not everyone gets. I’ve always had many many clients signed off, weeks to even years later.\nI guess my point and story is, hospice isn’t a death sentence. \n\nHowever! I do understand the insensitiveness of what your doctor said and I would recommend getting a new one if I was you, if possible.\n\nMy heart goes out to you! Sometimes hitting rock bottom means the only way out is up. \n\nKeep reaching out and don’t give up on your body yet!",
      "created_utc": 1633519671.0,
      "score": 20,
      "context": []
    },
    {
      "id": "hfmufdq",
      "author": "blueberries-Any-kind",
      "body": "Hey there, have you experienced trauma (besides the ED) ? You might benefit from a form of therapy called IFS, It’s transformed my life. Hang on to that hope ❤️",
      "created_utc": 1633545032.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hfox02z",
      "author": "sandopsio",
      "body": "I hope this helps because I can sense some of your pain and a desire for hope, but tiredness in your words. First, I am so sorry. You don’t deserve this pain. You never deserved any of this pain. Now, for the part that I hope makes sense and can help. I’ve learned that the hardest thing to grasp, the most deceptive thing in life is perspective. When I was deep in my ED, my trauma and my symptoms, there was no way I could see anything that would make “recovery” worth it. When I saw things I knew “should” make me happy because they were once my favorite things and yet I felt nothing from them even if I tried to force myself to feel joy, it just made me feel unheard if someone told me things would ever get better. Fast-forward to now. I still struggle with self-hate. I still have a long way to go. I’ve still been too scared to recover. But I didn’t give up and I did find things that bring me joy again, things I actually look forward to and love. I NEVER would’ve believed that was possible back then. I know (and you may want to slap me for this but I’m still going to say it) that things can get better for you. Recovery for everyone is different. Yours can be what you truly need. What you want and may not know that you want right now. It’s not too late. I know if someone said that to me at my worst I’d just be mad they don’t understand, but what if the doubt is your ED manipulating you and there’s something good beyond it?",
      "created_utc": 1633580251.0,
      "score": 2,
      "context": []
    },
    {
      "id": "hfm8n4x",
      "author": "humbledbyit",
      "body": "In my experience I couldn't be open to the solution that would later help me until I hit my bottom. For me, my mind was insanely focused on me, my problems & my fears. It was also very focused on food & eating. It was a exhausting tug of war - food gives me pleasure- my erratic eating causes me pain. I found relief through working a 12 step program for my compulsive eating problem.  Today I get freedom from all that pain & obsessing as long as I work the steps. I'm grateful to have a solution that works - if I work it!",
      "created_utc": 1633535932.0,
      "score": 0,
      "context": []
    },
    {
      "id": "hfl3k93",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1633513618.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hfoxfar",
      "author": "sandopsio",
      "body": "Also, you don’t have to find the things that bring you joy. They will find you if you don’t give up. I never would’ve known where to look for mine. I wouldn’t have been able to find them. They’re there and you don’t have to do anything but not give up. And wait, unfortunately but it’s worth it …",
      "created_utc": 1633580498.0,
      "score": 1,
      "context": []
    },
    {
      "id": "hflac7w",
      "author": "dredged_dm",
      "body": "I came here to comment exactly this. \n\nOP, feel free to hit us both up. And do check out the sub's discord, you can always find someone there who will lend you their ear.",
      "created_utc": 1633519068.0,
      "score": 7,
      "context": [
        {
          "id": "hfl5yly",
          "author": "idrankthetapwater",
          "body": "Hey OP, I'm not great help and I don't know what advice I can give you. But if you want someone to listen, I'm here. I'm frankly terrible at messaging in a timely manner, but if you're okay with a semi responsive person to rant to, hmu\n\nOh and a quick edit: amphetamines can be used beneficially for a wide variety of things. Your medicine is specifically prescribed for BED, so please don't listen to the commenter telling you to stop your meds. You only need to talk to your doctor about them if they don't work.",
          "created_utc": 1633515742.0
        }
      ]
    },
    {
      "id": "hflhk5j",
      "author": "animatedrussian",
      "body": "Make that 3 people",
      "created_utc": 1633523540.0,
      "score": 4,
      "context": [
        {
          "id": "hfl5yly",
          "author": "idrankthetapwater",
          "body": "Hey OP, I'm not great help and I don't know what advice I can give you. But if you want someone to listen, I'm here. I'm frankly terrible at messaging in a timely manner, but if you're okay with a semi responsive person to rant to, hmu\n\nOh and a quick edit: amphetamines can be used beneficially for a wide variety of things. Your medicine is specifically prescribed for BED, so please don't listen to the commenter telling you to stop your meds. You only need to talk to your doctor about them if they don't work.",
          "created_utc": 1633515742.0
        },
        {
          "id": "hflac7w",
          "author": "dredged_dm",
          "body": "I came here to comment exactly this. \n\nOP, feel free to hit us both up. And do check out the sub's discord, you can always find someone there who will lend you their ear.",
          "created_utc": 1633519068.0
        }
      ]
    },
    {
      "id": "hfonmrl",
      "author": "cringeaddict89",
      "body": "I'll also be here, even if I'm late.",
      "created_utc": 1633574852.0,
      "score": 3,
      "context": [
        {
          "id": "hfl5yly",
          "author": "idrankthetapwater",
          "body": "Hey OP, I'm not great help and I don't know what advice I can give you. But if you want someone to listen, I'm here. I'm frankly terrible at messaging in a timely manner, but if you're okay with a semi responsive person to rant to, hmu\n\nOh and a quick edit: amphetamines can be used beneficially for a wide variety of things. Your medicine is specifically prescribed for BED, so please don't listen to the commenter telling you to stop your meds. You only need to talk to your doctor about them if they don't work.",
          "created_utc": 1633515742.0
        },
        {
          "id": "hflac7w",
          "author": "dredged_dm",
          "body": "I came here to comment exactly this. \n\nOP, feel free to hit us both up. And do check out the sub's discord, you can always find someone there who will lend you their ear.",
          "created_utc": 1633519068.0
        },
        {
          "id": "hflhk5j",
          "author": "animatedrussian",
          "body": "Make that 3 people",
          "created_utc": 1633523540.0
        }
      ]
    },
    {
      "id": "hfonluu",
      "author": "cringeaddict89",
      "body": "I'll also be here, even if I'm late.",
      "created_utc": 1633574840.0,
      "score": 2,
      "context": [
        {
          "id": "hfl5yly",
          "author": "idrankthetapwater",
          "body": "Hey OP, I'm not great help and I don't know what advice I can give you. But if you want someone to listen, I'm here. I'm frankly terrible at messaging in a timely manner, but if you're okay with a semi responsive person to rant to, hmu\n\nOh and a quick edit: amphetamines can be used beneficially for a wide variety of things. Your medicine is specifically prescribed for BED, so please don't listen to the commenter telling you to stop your meds. You only need to talk to your doctor about them if they don't work.",
          "created_utc": 1633515742.0
        },
        {
          "id": "hflac7w",
          "author": "dredged_dm",
          "body": "I came here to comment exactly this. \n\nOP, feel free to hit us both up. And do check out the sub's discord, you can always find someone there who will lend you their ear.",
          "created_utc": 1633519068.0
        },
        {
          "id": "hflhk5j",
          "author": "animatedrussian",
          "body": "Make that 3 people",
          "created_utc": 1633523540.0
        }
      ]
    }
  ]
}