{
  "id": "q5srwb",
  "subreddit": "EatingDisorders",
  "author": "EDPostRequests",
  "created_utc": 1633947475.0,
  "title": "Request: My partners insistence on a healthy lifestyle is triggering my ED",
  "selftext": " \n\nMe and my partner met about a year ago and have been dating since then. One of the things that I liked about him at the start was his positive outlook on life and his dedication to having a healthy diet, he started this lifestyle a few years ago after his ex developed diabetes from a poor diet.\n\nI’m almost two years in recovery from an ED that consumed my early twenties, I’m the happiest I’ve ever been since I started eating normally again and I’m now a healthy weight and reasonably fit.\n\nI told my partner about my recovery pretty early on in our relationship and he was very supportive. He said we should get healthy and fit together and I agreed, so I would eat what he ate when I stayed over at weekends and we would go for long walks together.\n\nI didn’t realize the extent of his diet until a couple of months into our relationship. He eats absolutely no sugar and only eats fruit occasionally ‘as a treat’, everything has to be organic (which is great!) or better yet grown by himself, no fast food or anything cooked in vegetable oil, the only carbs he eats is whole grain rice etc. He obsessively checks the ingredients of anything we buy in the supermarket. We usually eat the same thing every night, some kind of fish with vegetables and occasionally a tomato sauce.\n\nAll of that is great on paper but the problem is he makes me follow this diet as well and gets very upset if I don’t, I baked a homemade loaf of bread recently and he started an argument about how unhealthy I was being. I have a sweet tooth and because of my ADHD I need caffeine regularly to be able to function normally, I’ve been sneaking out and having a soda a couple of times a week but the anxiety of getting caught gets worse every time I do it. I feel so sluggish during the day and end up binge eating when I visit family which makes me feel terrible.\n\nI’ve tried to talk to him about this multiple times but he just doesn’t listen, I’ve said that I can feel my old ED habits creeping back in but he brushes it off and tells me I need to ‘get a grip’. I know it’s important to have a healthy diet but I also think it’s okay to sometimes enjoy a sugary drink on a night out or a piece of birthday cake but I know for a fact he start at argument at best or leave me at worst, if he ever caught me doing either.\n\nThis relationship is the best I’ve ever had and the only one I’ve ever been able to see lasting long term, I know he only acts like this because he cares about me and worries that I’ll get sick like his ex but I feel like I need to put my mental health first. I’m not sure what to do next to be honest, I’ve been thinking that maybe couples therapy could help but I don’t think he would agree to that. Any advice would be greatly appreciated.",
  "url": "https://www.reddit.com/r/EatingDisorders/comments/q5srwb/request_my_partners_insistence_on_a_healthy/",
  "score": 57,
  "num_comments": 10,
  "comments": [
    {
      "id": "hg7zqlp",
      "author": "KryptonionNipple",
      "body": "To be honest it sounds like your partner has an eating disorder as well. It sounds like he has Orthorexia which is an obsessiveness of eating healthy.\n\nMaybe you should both speak to a relationship counsellor?",
      "created_utc": 1633955808.0,
      "score": 62,
      "context": []
    },
    {
      "id": "hg7pzo6",
      "author": "rileyyj001",
      "body": "Sorry to be insensitive, but he’s gotta go. You matter *way* more in *your* life than he does and you need to care for yourself, first and foremost. It sounds like you have done an incredible job overcoming your demons, but I think you need to look at this relationship and realize, it’s another demon forming (slowly, but it’s coming).\n\nReread your post and look at the language you used (sneaking soda, getting caught, anxiety, binge eating) those things are not normal and shouldn’t be normalized in your life.\n\nTake care of yourself like you did during your recovery work because this is an extension of that. I have a strong reaction to this type of dynamic because I watched my mother suffer in a controlling marriage for 21 years and it broke her in every way. \n\nBest wishes, OP. 🧡",
      "created_utc": 1633948989.0,
      "score": 43,
      "context": []
    },
    {
      "id": "hg84cro",
      "author": "irishdancer2",
      "body": "This post can be separated into two parts—the first four paragraphs and the last three.\n\nPart 1 is great. You and your partner are going on a health and fitness journey together, he’s supportive about your recovery, things are good.\n\nPart 2 is not okay. He *makes* you follow his diet? You feel like you have to sneak out to drink a soda? You’re worried about eating a piece of cake because you know he’ll either start a fight or *leave you*? He’s dismissive of your recovery rather than supportive? Hell no. None of that is okay.\n\nAs I see it, you have two options, neither of them easy. You can walk away now, or you can sit your partner down for a firm discussion about boundaries, controlling behavior, and your needs. If he doesn’t respond the way he needs to, you walk away.",
      "created_utc": 1633958370.0,
      "score": 30,
      "context": []
    },
    {
      "id": "hg7oqjw",
      "author": "None",
      "body": "You’re right, you do need to put your mental health first. Even if your partner believes he has your best intentions in mind, he is continuing to pressure you into a diet AFTER you have made it clear it isn’t for you. If you have not already had a serious conversation with him about this I would do, take time to sit down and explain to him the affect this could have on you. \n\nIf he still insists you must follow his diet then please seek out something like couples therapy, or consider if this is a relationship you do want to keep long term. I would hate for you to lose someone you love over a food disagreement but EDs are a real ass to get over (as I’m sure you know), and your health, body physical and mental, should come before his strict forced diet plan. \n\nI hope he can understand the gravity of what food means to you, please don’t let him dictate your decision on this and please put your health first. I really hope it turns out well. Best of luck!",
      "created_utc": 1633947936.0,
      "score": 24,
      "context": []
    },
    {
      "id": "hg9avjn",
      "author": "scumfederate",
      "body": "The way I see it, I literally survived and have (mostly) beat a mental illness that made me so rigid and afraid that I couldn’t enjoy my life. I’m not going to be so rigid in the future that I can’t enjoy a soda or fast food. \n\nThere’s a line. Perfectly healthy people can enjoy snacks and sugar and unhealthy eating on occasion. Should that occasion be all the time? Of course not. But you should still be able to decide when it IS time, and when and what YOU want to eat. That’s the beauty of recovery in my opinion: you finally get to choose. Not your ED or your boyfriend or your therapist, you. \n\nLife’s too short, you don’t need to be so rigid about a diet that’s not yours and you don’t need to feel bad about not being rigid. (Totally understand why you would, I’d feel the same way in your shoes, but it’s not logical guilt is what I’m meaning).",
      "created_utc": 1633976742.0,
      "score": 8,
      "context": []
    },
    {
      "id": "hgaqswx",
      "author": "PulpyMilk5",
      "body": "I mean I’m no doctor but sounds like he has some symptoms of orthorexia, it is very challenging to be in a relationship or even a friends ship if two people have an Ed (as they are very competitive). Id say going to a couples therapy session might be helpful, maybe someone who has experience working with EDs if you can find one. This is a dangerous situation to be in and I hope the best for you. His eating habits are far from healthy and he should not be making you follow them",
      "created_utc": 1634000729.0,
      "score": 6,
      "context": []
    },
    {
      "id": "hg9en3h",
      "author": "wildxxdaze",
      "body": "Firstly, we'll done on your recovery, it's not easy and you should be so proud of your progress in healing! As for your relationship, I understand wanting to work things out but it sounds like your partner is also exhibiting signs of disordered eating/orthorexia. It's okay to want to live a 'healthy' lifestyle but really it's about finding *balance*. Your recovery and mental health is the most important thing here and restricting in any way or being rigid with your food choices may potentially hinder that. Also, feeling like you have to be secretive about foods you wish to eat is worrying as recovery is about being empowered to eat freely and whatever you wish to. You shouldn't be made to feel guilty about eating anything at all. If you'd like to explore the relationship more I'd suggest therapy as a couple or for yourself to protect you from any potential relapse. \n\nYou and your mental health are so important OP, wishing you all the best 💛",
      "created_utc": 1633978318.0,
      "score": 7,
      "context": []
    },
    {
      "id": "hgafsok",
      "author": "throwaway-m1",
      "body": "He has strong disorders eating tendencies if not full blown orthorexia AND is extremely controlling and rude. Avoiding fruit is unhealthy, and not being able to have fun drinks and food on special occasions is also healthy. Starting fights or potentially leaving over your partner eating cake is nuts. You should seriously consider leaving \n\nI follow a pretty healthy lifestyle because it’s important to me, but I would never try to get my partner to do that too. If they want to - awesome, I’ll help! But if not, it’s not my business!",
      "created_utc": 1633995429.0,
      "score": 5,
      "context": []
    },
    {
      "id": "hgb25c4",
      "author": "RadishPhysical",
      "body": "He may have an eating disorder himself. Regardless he should’ve listened and been concerned if you’re literally telling him you feel your ed coming back. If he won’t listen and stop forcing his diet on you, no relationship is worth redeveloping an ed over and you should leave.",
      "created_utc": 1634005877.0,
      "score": 3,
      "context": []
    },
    {
      "id": "hg7o76f",
      "author": "AutoModerator",
      "body": "Hello users of /r/EatingDisorders. As a reminder, please do not make requests via the reddit chat app. We noticed that a lot of requests are made by chatting with the /u/EDPostRequests account.\nThis is a bot account and rarely gets checked. We also have a Discord available for people that like to talk on a daily basis. You can join by using the following link: https://discord.gg/ShRD55t\n\n\nThanks for reading.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/EatingDisorders) if you have any questions or concerns.*",
      "created_utc": 1633947475.0,
      "score": 1,
      "context": []
    }
  ]
}